{
    "AppID": 736820,
    "Name": "Knights of Honor II: Sovereign",
    "Release date": "Dec 6, 2022",
    "About the game": "Become the King and wrestle over control of Europe in this fresh take on medieval real-time grand strategy. Knights of Honor II: Sovereign includes all the depth players desire while being the gate-way game to the grand strategy genre, presenting the world as a living, breathing miniature, alive and ripe for the taking. Choose your royal court carefully and determine the destiny of your people, be it riches, conquest, intrigue, trade, or defeat! Raise armies to defend your lands or take war to the enemy - even jump into battle directly in action-packed RTS combat. The path is open: become the true Sovereign of your people. Features Accessible Grand Strategy - All the depth of religion, diplomacy, city development, and more, with none of the confusion Choose Your Kingdom – Select from over 200 kingdoms across Europe, North Africa, and parts of Asia Real-Time Gameplay – The Medieval world comes alive, no turns needed Royal Court - Appoint Marshalls, Clerics, Merchants, Diplomats, and Spies to exert your will across the land RTS Battles - Lead your armies directly in riveting RTS engagements Robust Multiplayer - Join with multiple friends to take on new challenges across the medieval world ASSEMBLE THE ROYAL COURT In Knights of Honor II: Sovereign , your Royal Court is one of the most important tools at your disposal. Your choice of Knights greatly influences your capabilities and sets the tone for your style of gameplay. Marshals lead your armies into battles to conquer your enemies and defend your lands Diplomats are capable of turning even your greatest enemies into trustworthy friends. Use them to create strong defensive and offensive pacts, negotiate marriages, and make sure that your friends have your back in times of need Merchants can not only increase your income by trading with your neighbors, but also import needed goods to bolster your economy or go on a voyage in search for new riches Clerics take care of all your kingdom’s spiritual needs and play a vital role when it comes to the population’s education, happiness and culture Spies are great If you like a more subtle approach to world domination. The spies offer you plenty of options: bribe enemy knights, instigate rebellions, or provoke war between your neighbors to achieve your goals FIGHT FOR CONTROL OVER THE MEDIEVAL WORLD Start your campaign with one of 200+ historical kingdoms and expand your territory over 300+ provinces. Build up your economy and produce valuable goods while making sure your lands can support your military. Choose out of over 100 different military units ranging from English longbowman over fierce Nordic warriors to powerful siege engines and assemble great armies to defend your borders and bring the fight to your enemies. LEAD YOUR ARMIES INTO BATTLE You don’t trust someone else to make the right tactical decisions? Then lead your men into battle yourself! Knights of Honor II: Sovereign offers exciting real-time strategy field battles and sieges with up to four armies. FIGHT YOUR FRIENDS IN MULTIPLAYER Knights of Honor II: Sovereign supports multiplayer with up to 6 players and various game modes: Conquer the medieval world together in co-op or fight each other in teams or free-for-all games. You or your friends want a fresh new challenge from the normal game experience? No problem: Choose one of several victory conditions like Peasant Rush, War for Goods or First Blood and more! Plus, if you have a limited amount of time, you can control the duration of the match by either time or generations of Sovereigns as well.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/736820/header.jpg?t=1670408031",
    "Price": 39.59,
    "Developers": "Black Sea Games",
    "Publishers": "THQ Nordic",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/736820/ss_b316f6c8eec70385119db9a27d15c8a2b067914f.1920x1080.jpg?t=1670408031,https://cdn.akamai.steamstatic.com/steam/apps/736820/ss_0f0b4724fe6b986ee5365fa271368ae0e4aa6a71.1920x1080.jpg?t=1670408031,https://cdn.akamai.steamstatic.com/steam/apps/736820/ss_6ab5f575273441852dd1f2d5e58ae7cb4a949dcb.1920x1080.jpg?t=1670408031,https://cdn.akamai.steamstatic.com/steam/apps/736820/ss_55c6521feb46a3c1da6d55611658ab181ccdeeb6.1920x1080.jpg?t=1670408031,https://cdn.akamai.steamstatic.com/steam/apps/736820/ss_0232cb15b864a437c64788d4288a2266f064762b.1920x1080.jpg?t=1670408031,https://cdn.akamai.steamstatic.com/steam/apps/736820/ss_e90c0beb42c547f5d132c6aa6be8f4f7fffc1e27.1920x1080.jpg?t=1670408031,https://cdn.akamai.steamstatic.com/steam/apps/736820/ss_0c852c4988155a84d679fd0f537f2e33528939a6.1920x1080.jpg?t=1670408031,https://cdn.akamai.steamstatic.com/steam/apps/736820/ss_8ef0000c28d426cc4899a9ca3496613f43f8b2d1.1920x1080.jpg?t=1670408031,https://cdn.akamai.steamstatic.com/steam/apps/736820/ss_4f5ace18b20473fecb3dd2f4eec530442969ebf1.1920x1080.jpg?t=1670408031,https://cdn.akamai.steamstatic.com/steam/apps/736820/ss_03e6ac87020659c9009851290c66c398c1f436eb.1920x1080.jpg?t=1670408031",
    "Slug": "knights-of-honor-ii-sovereign",
    "Meta Title": "Knights of Honor II: Sovereign: Dec 6, 2022, Black Sea Ga...",
    "Meta Description": "Looking for information on Knights of Honor II: Sovereign? Check out the release date (Dec 6, 2022), developer insights from Black Sea Games, and a comp...",
    "Alt Text Image": "Official header image for Knights of Honor II: Sovereign game - Steam 736820",
    "Canonical URL": "https://gusku.site/game/knights-of-honor-ii-sovereign",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Knights of Honor II: Sovereign\", \"description\": \"Looking for information on Knights of Honor II: Sovereign? Check out the release date (Dec 6, 2022), developer insights from Black Sea Games, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Black Sea Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"THQ Nordic\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/736820/header.jpg?t=1670408031\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}