{
    "AppID": 2192480,
    "Name": "Luna & Monsters Tower Defense -The deprived magical kingdom-",
    "Release date": "Dec 20, 2022",
    "About the game": "Story This is the story of the world-traveling black cat Luna and vicious monsters! Luna, a black cat, once defeated the Demon King and saved the world together with a legendary hero. However, the hero disappeared without a trace and is now missing. Will he ever be found...? What is the mystery behind the hero...? The adventures of Luna, the black cat traveling the world, begin now! Summon giant bosses by defeating them! You can summon them by producing MANA. They have a variety of unique attacks, so be sure to use them according to the situation. Unicorn It recovers defenders in the range. Also, increase MANA gotten in MANA Tank. When you raise its level to the maximum, it will heal in range. King Goblin It does the magic that makes Goblin species betray with a certain probability. Turning high-strength blue goblins and high-attack red goblins will give you an advantage in battle. Turned goblins fight as soldiers until they die. They can also recover by summoning a unicorn nearby. The probability of turning increases as the level of the goblin is raised. When the level is raised to the maximum, two goblins can attack at the same time. Master Penguin It does the magic that freezes the enemy and slows them down. When its level is raised to maximum, its speed is reduced by 65%. It is very effective against flying enemies due to its long range and ranged attack. King Ogre It summons powerful ogres as defender. The ogre is not only strong, but also has a large number of blocks, so it can function as a wall. The ogre's large size also halves the attacks of smaller enemies. Sirens Singing voice charms flying enemies,reduces speed of them. Enchanted enemies have a higher drop rate of treasure chests. The treasure chests drop mana, so depending on how you use them, battles can be very lucrative. Stone Golem It smashes enemies with a projectile attack that boasts an overwhelmingly long range. It has a long range that covers half of the screen. Evileye Queen It does the magic that causes instant death to the enemy. Or, damages enemies that resist instant death. It can kill even powerful enemies with a single blow, so it is necessary to be creative in its placement. There are many other summoners that support you with powerful magic. Battle You build 4 types of defense towers - bows, cannons, anti-aircraft guns, and barracks - to intercept enemies. You need to build your own internal facilities because the cost is not recovered even if you defeat the enemy. Building a Ranch will increase your population, and building a MANA Tank will increase your MANA. Population can only be used to build basic towers, but MANA can be used to build summoning towers. Population is not only consumed to build towers, but it is also the HP that can withstand enemy attacks. With the summoning tower, you can use powerful summoners and their unique magic to take advantage of battles. This casual battle, which takes only 5 minutes per stage, has a total of 65 stages. The stages after the middle stage will not be easy to win. The difficulty level will vary greatly depending on the strategy you choose, whether cultivating internal affairs or using the population for defense! The difficulty level can be selected from 'easy,' 'normal,' and 'hard,' and can be switched at any time. attributes The game has four types of attributes: fire, ice, lightning, and wind. There are four types of attributes in this game: fire, ice, lightning, and wind. Flame attacks may cause the enemy to burn. Combustion does additional sustained damage, but at a faster rate. Ice attacks can freeze the enemy. Freezing slows down the enemy but removes the burning state. Flame and ice are incompatible. Basically, red enemies are resistant to fire and blue enemies are resistant to ice. Lightning attacks can paralyze the enemy. Wind attacks slow down and cause sustained damage when in a storm zone. Wind is ineffective against large, heavy enemies and is effective against smaller or flying enemies. Other status abnormalities include poison, instant death, and charm. Each enemy has its own set of attribute resistances, with a maximum of 90% of damage cut. If you do not attack with an effective attribute, you will not be able to defeat even the small fry. Enemies' attribute resistance can be checked before the battle begins. BGM 35 original BGM songs in all! When all bosses appear, boss-specific BGM will be played to liven up the battle. Languages Supported English/Japanese/Chinese (Simplified)/Spanish/German/French/Portuguese (Brazil)/Turkish/Italian/Russian/Indonesian/Korean/Malay/Vietnamese/Hindi/Chinese (Traditional)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2192480/header.jpg?t=1671675356",
    "Price": 12.74,
    "Developers": "Luna's Tail Creative LLC",
    "Publishers": "Luna's Tail Creative LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2192480/ss_d7547780b844cc17a35f1155913507c2e6bbad43.1920x1080.jpg?t=1671675356,https://cdn.akamai.steamstatic.com/steam/apps/2192480/ss_4236e363cc42e1d94d92efc600c42327da4f6800.1920x1080.jpg?t=1671675356,https://cdn.akamai.steamstatic.com/steam/apps/2192480/ss_7006ef22ec766bb8e22ae13e04f4cc9a898e90c4.1920x1080.jpg?t=1671675356,https://cdn.akamai.steamstatic.com/steam/apps/2192480/ss_7cf1feab560d6c56c1f6a6143050c798ddf4366b.1920x1080.jpg?t=1671675356,https://cdn.akamai.steamstatic.com/steam/apps/2192480/ss_31e79fdc741d94eec3f7537e8385b5549a701a04.1920x1080.jpg?t=1671675356,https://cdn.akamai.steamstatic.com/steam/apps/2192480/ss_9a6f6595120cfd41e1a93e9331a472831fccf9ea.1920x1080.jpg?t=1671675356,https://cdn.akamai.steamstatic.com/steam/apps/2192480/ss_e0958be36031c5ed46079e51c4c7b8f7cf36d3d4.1920x1080.jpg?t=1671675356",
    "Slug": "luna-monsters-tower-defense-the-deprived-magical-kingdom",
    "Meta Title": "Luna & Monsters Tower Defense -The deprived magical kingd...",
    "Meta Description": "Looking for information on Luna & Monsters Tower Defense -The deprived magical kingdom-? Check out the release date (Dec 20, 2022), developer insights f...",
    "Alt Text Image": "Official header image for Luna & Monsters Tower Defense -The deprived magical kingdom- game - Steam 2192480",
    "Canonical URL": "https://gusku.site/game/luna-monsters-tower-defense-the-deprived-magical-kingdom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Luna & Monsters Tower Defense -The deprived magical kingdom-\", \"description\": \"Looking for information on Luna & Monsters Tower Defense -The deprived magical kingdom-? Check out the release date (Dec 20, 2022), developer insights f...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Luna's Tail Creative LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Luna's Tail Creative LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2192480/header.jpg?t=1671675356\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.74, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}