{
    "AppID": 2175790,
    "Name": "Meticulous",
    "Release date": "Dec 16, 2022",
    "About the game": "Meticulous is a gamified personal health companion that will help you automate your diet and fitness planning. Define your own measures of success, design a custom program week-by-week to achieve your goals, and become your own personal health scientist! Meet Metic You aren’t alone. Metic will be your guide on your diet and fitness journey. They’ll offer you meal recommendations, strategies for improving and maintaining your health, and the occasional morale boost for when the going gets tough. Empirical Empowerment Become your own personal health scientist. Devise a hypothesis about what you need to do to achieve your goals, and catalogue your diet and fitness data on a weekly basis. Evaluate your success, make incremental adjustments to your plan over time, and monitor your progress with precision. Personalized Planning Focus on what is important to you, and design a plan that fits your schedule. Cut through the fads to discover how your individual physiology responds to different diet and fitness philosophies. So, is Meticulous right for you? If you… …want to lose weight. Meticulous can help you maintain the goals of any diet plan while still giving yourself room to eat the foods you love. …are tired of falling off the wagon, and you want a permanent weight management solution. Let Metic help you automate your diet and fitness planning for maximum results with minimum mental effort. …want to learn about being healthy, but you don’t know where to start. Meticulous is not a substitute for a doctor or dietician, but it will get you in the right mindset to start thinking about your health in a smart and productive way. …don’t care about those fancy macronutrients, you just want to be reminded to eat a salad every now and then. You don’t have to be a health guru. Start your fitness journey slow by choosing simple and easy measures of success, like how many leafy green vegetables you eat in a week. …struggle to stay focused on mental health when the world is burning down around you. Mental well-being is just as important as physical health. Meticulous can help you set aside time for mindfulness and self-care as a part of your fitness journey. …want to practice being creative or learn a new skill. Meticulous isn’t limited to scheduling gym activities. Schedule your time to reach any kind of goal, whether that’s leveling up your physique, becoming an artist, or learning a foreign language. …want to introduce your friends or family to becoming a little more health conscious. People can get Meticulous about their personal health at any age. With Metic as their guide, health and fitness can be simple and accessible for anyone. …want to support indie game development. Thank you so much for taking the time to check out indie games. There’s a lot of great indie games out there, and many of them – like Meticulous – are made with love and care, and they’re designed to make your life better. Your patronage is appreciated.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2175790/header.jpg?t=1671210033",
    "Price": 14.99,
    "Developers": "Imaginary Game Studios",
    "Publishers": "Imaginary Game Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2175790/ss_595a7d7b30380e2c865ab6b8cd3d72674976670e.1920x1080.jpg?t=1671210033,https://cdn.akamai.steamstatic.com/steam/apps/2175790/ss_6af70acc4224cb27d03bea8e03d0053ae8abbb47.1920x1080.jpg?t=1671210033,https://cdn.akamai.steamstatic.com/steam/apps/2175790/ss_4cdf31437e77063445105a1abeef027dea2a4d51.1920x1080.jpg?t=1671210033,https://cdn.akamai.steamstatic.com/steam/apps/2175790/ss_40d5ed94a4703c1cb23872385ef6a5a5810fbf10.1920x1080.jpg?t=1671210033,https://cdn.akamai.steamstatic.com/steam/apps/2175790/ss_7b6f80f7c3e15bc3cfc35a5791d3c9e56ab76e8a.1920x1080.jpg?t=1671210033,https://cdn.akamai.steamstatic.com/steam/apps/2175790/ss_5b4b57956abd28827cd51b309ca576ed45b8cd6a.1920x1080.jpg?t=1671210033,https://cdn.akamai.steamstatic.com/steam/apps/2175790/ss_c03c4d8312d4e38b5b5818fd60c33468eb05d26b.1920x1080.jpg?t=1671210033",
    "Slug": "meticulous",
    "Meta Title": "Meticulous: Dec 16, 2022, Imaginary Game Studios and Full...",
    "Meta Description": "Looking for information on Meticulous? Check out the release date (Dec 16, 2022), developer insights from Imaginary Game Studios, and a complete game su...",
    "Alt Text Image": "Official header image for Meticulous game - Steam 2175790",
    "Canonical URL": "https://gusku.site/game/meticulous",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Meticulous\", \"description\": \"Looking for information on Meticulous? Check out the release date (Dec 16, 2022), developer insights from Imaginary Game Studios, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Imaginary Game Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Imaginary Game Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2175790/header.jpg?t=1671210033\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}