{
    "AppID": 2149940,
    "Name": "MUST FLEE",
    "Release date": "Dec 7, 2022",
    "About the game": "The queen of the Andromeda galaxy is worried that a spacecraft of her fleet has crashed on planet Earth while she was on a mission of exploration. A loss that could have been insignificant and yet is a big problem. In the memory of the on-board computer there are the maps of the planets of the Andromeda galaxy and the maps must not end up in the hands of the earthlings! Arrived with her mother spaceship, in the orbit of the Earth, the queen does not want to descend in the atmosphere in order not to be sighted by humans. He doesn't even want to get his hands dirty about this. So how will he recover the memory card hidden miles deep inside a secret military base? He will send a robot, one of the hardest and most indestructible ones, which will enter the base, find the spacecraft, recover the memory card and then... And then we hope that the robot will be able to flee! In the role of this alien robot, the player will have to walk or run avoiding being spotted by soldiers, or dodging bullets fired at him. The game is a path between different situations that often require the player to act quickly. After collecting objects found in the game, such as coins, candies or balloons, the player will have to decide how use them to distract opponents and prevent them from using their weapons: pistols, rifles, sticks or electric shocks. Each inventory item has its own unique properties and must be used in the right way for it to perform its function. For example, candy can be used to prevent soldiers from firing, but only at a short distance; instead, if the soldiers are far away, balloons can be used. The player manages the actions of the robot in its movements and decides from time to time which objects to use. The path to follow is often blocked by locked doors, so it will be necessary to look for the pass in the different lockers of the game necessary to unlock the doors. The speed of the action and its development on a linear path make it easier to learn the game and favor its replayability. Note to read before purchasing: The player cannot use weapons against opposing characters in the game. The dialogues are silent and written in English. The language used in the game is not meant to be vulgar or offensive towards anyone. The game options do not allow you to change the image quality. Where this is possible, the images are always reproduced to the fullest extent of the graphics engine, with a resolution identical to that used on your computer desktop.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2149940/header.jpg?t=1670446902",
    "Price": 4.19,
    "Developers": "Vox Mare",
    "Publishers": "Vox Mare",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2149940/ss_a28b768b9f22ad3452036b539a4ff3391e6d43a4.1920x1080.jpg?t=1670446902,https://cdn.akamai.steamstatic.com/steam/apps/2149940/ss_cd175dfc1a0250e7ba5ae2c2a97e2593ef574902.1920x1080.jpg?t=1670446902,https://cdn.akamai.steamstatic.com/steam/apps/2149940/ss_72748da0134ca389d5bb95c2858e59ca30798445.1920x1080.jpg?t=1670446902,https://cdn.akamai.steamstatic.com/steam/apps/2149940/ss_35b531620ea6b137738cf964ce2cc4dd67a612c3.1920x1080.jpg?t=1670446902,https://cdn.akamai.steamstatic.com/steam/apps/2149940/ss_23d5f39c6a05d9b0b49890899b3234c7312b9b54.1920x1080.jpg?t=1670446902,https://cdn.akamai.steamstatic.com/steam/apps/2149940/ss_9d3c677f61b7ab309e3fafd30a95f6ce41215796.1920x1080.jpg?t=1670446902,https://cdn.akamai.steamstatic.com/steam/apps/2149940/ss_2a6416a1b8b149a22d1fb34655798e8887716e5a.1920x1080.jpg?t=1670446902,https://cdn.akamai.steamstatic.com/steam/apps/2149940/ss_23301ceb4e41442f0221b604e0c7e516fb3b5ee2.1920x1080.jpg?t=1670446902",
    "Slug": "must-flee",
    "Meta Title": "MUST FLEE: Dec 7, 2022, Vox Mare and Full Overview",
    "Meta Description": "Looking for information on MUST FLEE? Check out the release date (Dec 7, 2022), developer insights from Vox Mare, and a complete game summary.",
    "Alt Text Image": "Official header image for MUST FLEE game - Steam 2149940",
    "Canonical URL": "https://gusku.site/game/must-flee",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MUST FLEE\", \"description\": \"Looking for information on MUST FLEE? Check out the release date (Dec 7, 2022), developer insights from Vox Mare, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Vox Mare\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vox Mare\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2149940/header.jpg?t=1670446902\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}