{
    "AppID": 2222870,
    "Name": "My Boss' Wife is My Ex ~Reluctantly Drowning in Sex Deals After Hours~",
    "Release date": "Dec 19, 2022",
    "About the game": "An erotic visual novel from Appetite! Features - 15 Intimate scenes - 87 CGs (including variants) - Fully voiced Heroine - Multiple scene branches Story 'I'm sorry. In the end, we really do live in different worlds. I've come to understand that now. I'm sorry, Tomoki.' That was how we broke up. I wonder how many years had passed after we'd entered university when it happened? It really came out of the blue. That was the last thing that happened between us. Several years passed by. I was an employee at a mid-sized company. It was just another day... The former president decided to step down and let the vice president succeed him. The vice president was the president’s son. He was genuinely a diligent and pleasant guy. On top of that, he was intelligent and handsome, but he let it get to his head. He was friendly man who despite being the vice president, he took an active role in the grunt work. He had a nice personality, he was kind, and everyone responded well to him. To be honest, I liked the guy, too. That was the man who was suddenly appointed to be our new president after his father who started having health issues. I was fine with that. 'I am Shiho Kamiya. I am delighted to make your acquaintance.' That’s what the woman standing beside our new president said. While I clapped as the others did, my heart was pounding. I went pale and dizzy, and couldn't help staggering. My old girlfriend... The woman who had once dumped me, had of all things, become the president's wife at the place I worked at, and on top of that, the one in charge of accounting... To think she'd appear before me as our new leader. If she had just become the president's wife, if she had just been living elegantly in a big mansion in an upscale residential district, I could have taken it. But to think she would enter the company, to think she would take charge of accounting and do a job that affects all the employees, including me. This was the worst. I couldn't think of it as anything but a nightmare. And my premonition turned out to be quite accurate. After she had taken charge of accounting, the company changed. She was strict with management of necessary expenses, cracked down on the acceptance of receipts, and kept a constant eye on our activities. Naturally, the employees weren't pleased. But not only was the manager, the PRESIDENT'S WIFE, she was efficient, thorough, and productive. She was a shining example for the other employees in the company, so no one could say anything or go against her. But in the end, even if they understood it on an intellectual level, you couldn't help but feel an unconscious sense of dissatisfaction. And I too, was among those who harbored such frustrations.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2222870/header.jpg?t=1671512676",
    "Price": 8.99,
    "Developers": "Appetite",
    "Publishers": "MangaGamer",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2222870/ss_33083729930e7e7422ed77079764f76693f76fb9.1920x1080.jpg?t=1671512676,https://cdn.akamai.steamstatic.com/steam/apps/2222870/ss_e0252a0495fe6194657a97103248373c824c1016.1920x1080.jpg?t=1671512676,https://cdn.akamai.steamstatic.com/steam/apps/2222870/ss_9210565ec4c948ab74b4bd13e88da75397d125b0.1920x1080.jpg?t=1671512676,https://cdn.akamai.steamstatic.com/steam/apps/2222870/ss_53480f1d925d8cb9314a378173853b300e6d5e77.1920x1080.jpg?t=1671512676,https://cdn.akamai.steamstatic.com/steam/apps/2222870/ss_e4cb2b6a4dafa1eafc084c7e96cec42dc61a3680.1920x1080.jpg?t=1671512676,https://cdn.akamai.steamstatic.com/steam/apps/2222870/ss_9fee3b28754493887c0ba69db18e80d9472a7e81.1920x1080.jpg?t=1671512676,https://cdn.akamai.steamstatic.com/steam/apps/2222870/ss_028f41debf4afb64be12cee5ccfaac503283215c.1920x1080.jpg?t=1671512676,https://cdn.akamai.steamstatic.com/steam/apps/2222870/ss_0263fedc88aadc3fa7653004e787268c8d6b76a0.1920x1080.jpg?t=1671512676",
    "Slug": "my-boss-wife-is-my-ex-reluctantly-drowning-in-sex-deals-after-hours",
    "Meta Title": "My Boss' Wife is My Ex ~Reluctantly Drowning in Sex Deals...",
    "Meta Description": "Looking for information on My Boss' Wife is My Ex ~Reluctantly Drowning in Sex Deals After Hours~? Check out the release date (Dec 19, 2022), developer ...",
    "Alt Text Image": "Official header image for My Boss' Wife is My Ex ~Reluctantly Drowning in Sex Deals After Hours~ game - Steam 2222870",
    "Canonical URL": "https://gusku.site/game/my-boss-wife-is-my-ex-reluctantly-drowning-in-sex-deals-after-hours",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"My Boss' Wife is My Ex ~Reluctantly Drowning in Sex Deals After Hours~\", \"description\": \"Looking for information on My Boss' Wife is My Ex ~Reluctantly Drowning in Sex Deals After Hours~? Check out the release date (Dec 19, 2022), developer ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Appetite\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MangaGamer\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2222870/header.jpg?t=1671512676\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}