{
    "AppID": 1554010,
    "Name": "我的变色龙女友My Chameleon Girlfriend",
    "Release date": "Dec 23, 2022",
    "About the game": "My Chameleon Girlfriend is a beautiful AVG visual novel GALGAME developed by YIMI GAME. A rich bully in love with me? Throw me a 'Manhood Handbook'? The star girl loves me? All the gentle defense you give me? Forced open, this can't be a pipe dream... In fact, there is a secret behind the beautiful girl who loves me (Bai Fumi)... I can't believe they can even change! ? I'm a rich woman's slave, I'm the school girl's spare? Rich woman infatuated with all of me, only listen to my words, die-hard! School flowers love my brave strong struggle smart, vowed to steal me from the hands of the rich woman! It's a private secret with the leading ladies, my chameleon girlfriend! My lover is Miss Belly Black, my sidekick is everyone's favorite idol. Do you prefer a rich woman or a famous woman? At a young age, the daughter of the REIMS group's chairman is ranked as the 62nd richest person in the world for young people under 30. She often wears heavy glasses and has a rustic appearance. In fact, hidden behind the heavy glasses of Gigi is a beautiful appearance and a little devil like heart... The existence of the first school flower. Often active in the major fashion magazines and film screen, is one of the new generation of beautiful female stars. She is a gentle and clever girl in the eyes of teachers and classmates, but she is a little natural and not good at learning things. In fact, there is a secret hidden behind Shirley's clever exterior, that is, she is actually a... Visual novel, through reading the story of the game to choose different options, establish the relationship with the female protagonists, reach different endings. Two yuan beautiful girl painting style Producer: YIMI Scenario: YIMI Character: RX7649 CG: Spoon RX7649 UI: Su YIMI PV:YIMI Fat Tiger Dashu AC QQ group 855541897 Thanks to all the partners who participated in this production! Thanks to the players who have been supporting and accompanying us and giving us encouragement! Thank you for supporting My Chameleon Girlfriend! I hope this story brings you positive energy and happiness! Thank you all for supporting YIMI Games! 【 Initial thought 】 Hello, everyone I'm the producer Mijang, and this is the first GALGAME that we YIMI GAME made together. The project took longer to complete than I originally expected. The problems and difficulties I encountered were also unexpected, but I felt that I could immerse myself in the world surrounded by beautiful girls together. The initial idea of the project is very simple, that is, I think the boys in the eyes of the beautiful girls are super cute, love love! And then we're gonna make a Sailor galgame, too. Ha ha. Although this is not the most perfect work, but I still hope that this game can bring players a pleasant game experience. Welcome to give us good suggestions, also welcome to join our QQ discussion group 855541897 exchange Ha.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1554010/header.jpg?t=1671850053",
    "Price": 34.39,
    "Developers": "亿米米游戏YIMI GAME",
    "Publishers": "亿米米游戏YIMI GAME",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1554010/ss_064b2b3309c515bd35327acedbafffd8afbf7bd0.1920x1080.jpg?t=1671850053,https://cdn.akamai.steamstatic.com/steam/apps/1554010/ss_ac7a1812e0b544deaf9c8efe43e197158145cd96.1920x1080.jpg?t=1671850053,https://cdn.akamai.steamstatic.com/steam/apps/1554010/ss_654fc34a8961064df583733e02533e08fe1d7005.1920x1080.jpg?t=1671850053,https://cdn.akamai.steamstatic.com/steam/apps/1554010/ss_f427b02dec6a2dae6a376a0c1561ef8226f58cde.1920x1080.jpg?t=1671850053,https://cdn.akamai.steamstatic.com/steam/apps/1554010/ss_510f3520f53c1165d7308998b4e17c90119f0fcf.1920x1080.jpg?t=1671850053,https://cdn.akamai.steamstatic.com/steam/apps/1554010/ss_64f0c4800a91112cd3f054c5630fcb62f3902f0e.1920x1080.jpg?t=1671850053,https://cdn.akamai.steamstatic.com/steam/apps/1554010/ss_7876cb955365f965ab9fca7bc5e5088a7d14844c.1920x1080.jpg?t=1671850053,https://cdn.akamai.steamstatic.com/steam/apps/1554010/ss_cd9d725f74296d827f9fd7017e63292e97f64fed.1920x1080.jpg?t=1671850053,https://cdn.akamai.steamstatic.com/steam/apps/1554010/ss_d57f09dfea47af6dc4797c3f762d40233d91196e.1920x1080.jpg?t=1671850053",
    "Slug": "my-chameleon-girlfriend",
    "Meta Title": "我的变色龙女友My Chameleon Girlfriend: Dec 23, 2022, 亿米米游戏YIMI G...",
    "Meta Description": "Looking for information on 我的变色龙女友My Chameleon Girlfriend? Check out the release date (Dec 23, 2022), developer insights from 亿米米游戏YIMI GAME, and a comp...",
    "Alt Text Image": "Official header image for 我的变色龙女友My Chameleon Girlfriend game - Steam 1554010",
    "Canonical URL": "https://gusku.site/game/my-chameleon-girlfriend",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6211\\u7684\\u53d8\\u8272\\u9f99\\u5973\\u53cbMy Chameleon Girlfriend\", \"description\": \"Looking for information on \\u6211\\u7684\\u53d8\\u8272\\u9f99\\u5973\\u53cbMy Chameleon Girlfriend? Check out the release date (Dec 23, 2022), developer insights from \\u4ebf\\u7c73\\u7c73\\u6e38\\u620fYIMI GAME, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 23, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4ebf\\u7c73\\u7c73\\u6e38\\u620fYIMI GAME\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u4ebf\\u7c73\\u7c73\\u6e38\\u620fYIMI GAME\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1554010/header.jpg?t=1671850053\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}