{
    "AppID": 2218290,
    "Name": "理想の恋人になりなさいっ！- My Dream Lover -",
    "Release date": "Dec 21, 2022",
    "About the game": "'I'll be your ideal lover! - My Dream Lover -' is a visual novel game in which the protagonist and the heroines engage in a comical battle to become each other's ideal lover. This Bishojo Game originally released in 2019 under the 'Momoiro Pocket' brand has been reworked for the 'PandaShojo' platform for players of all ages worldwide to enjoy. ◆Introduction Takuma Shihoju was living a lonely school life. In order to break out of the boring school life, Takuma tries to turn the heroines into 'ideals' and spend a fulfilling school life, but... The heroines also have their own 'ideals'. A serious competition has begun to see who can change or can be changed...! ◆Synopsis Takuma Shihoju was living a lonely school life. Every day he fantasizes about his imaginary lover next to him, but it never comes true. Impatient to the point of having nightmares, Takuma asks his childhood friend Sakura for help, but naturally she refuses. When he was about to give up everything, Sakura, who felt sorry for him, suggested a match. 'If Takuma wins, your wish will be fulfilled. If Takuma loses, my wish will come true. What do you think?' It is a game of whether you can conform the other person to your ideal or whether you be conformed to the other person's ideal. If you lose, you must serve for the rest of your life. In order to create the ideal girlfriend, a forced battle between Takuma and the heroines broke out...! ◆Characters Sakura Iigashi If Takuma wins, your wish will come true. If Takuma loses, I get what I want. What do you think? A childhood friend of the protagonist who dislikes otaku. She gets along with everyone easily and is ranked high up in the castle. However, there are rumors that she plays with men badly, and some people ridicule her as a light woman. She also has a cute side, such as when she was a child, she said she would be the protagonist's wife. But, it's a story from the distant past. Miku Subo 'Takuma... Me too... I will cooperate as much as possible.' A senior at the school that the protagonist attends. 'Popular among both men and women as 'cool' because of her fresh appearance, reserved personality, and the way she shows it through her actions.' But in reality, she was just a bad talker and had miraculously gotten lucky in avoiding it all. She is everyone's illusion. But she is troubled by the fact that she can't confess it. Monono Kosaka 'I'll extend a helping hand to the poor senior who can't sleep because of his dreams.' A junior at the school that the protagonist attends. Contrary to the appearance of a small animal, she is super aloof. If she was friendly, she would have been popular in the class, but she is the opposite of friendly. Kozue Kadowaki 'Why even me... I'm sorry! 'I would like to participate!' A teacher intern at the school that the protagonist attends. She wants to be popular with students as a mature, beautiful, and cool teacher, but in reality, she's not good in many ways. She gets embarrassed when she tries to be sexy and tends to dress plainly. Takuma Shihoju The protagonist. A very ordinary student. He realized that his school life was lame. To live an ideal school life, he tries to bring the heroines closer to his ideal, but they also have their own ideals, and their school life begins to be full of ups and downs.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2218290/header.jpg?t=1671684566",
    "Price": 19.99,
    "Developers": "CyberStep, Inc.,Rideon Works Co. Ltd,",
    "Publishers": "CyberStep, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2218290/ss_5cc2deeabff6de8b9ba6011cc0e1904dc91fad8b.1920x1080.jpg?t=1671684566,https://cdn.akamai.steamstatic.com/steam/apps/2218290/ss_b4767581e9c37e31eca4ecab751df82b0b174876.1920x1080.jpg?t=1671684566,https://cdn.akamai.steamstatic.com/steam/apps/2218290/ss_52c64ea70ed53cd5e75d9cd8469eed452a8b759d.1920x1080.jpg?t=1671684566,https://cdn.akamai.steamstatic.com/steam/apps/2218290/ss_376176616573f4786f30fa4d85234d7aa83c541a.1920x1080.jpg?t=1671684566,https://cdn.akamai.steamstatic.com/steam/apps/2218290/ss_5930b24dfd2439c04b360f356a91a5c891f2c1c7.1920x1080.jpg?t=1671684566,https://cdn.akamai.steamstatic.com/steam/apps/2218290/ss_9b3c6b64084f0dfd00d2d166612650f89a1fc527.1920x1080.jpg?t=1671684566,https://cdn.akamai.steamstatic.com/steam/apps/2218290/ss_1bd55095b4fb461a3d7ed4aabdb95761e97a2af4.1920x1080.jpg?t=1671684566,https://cdn.akamai.steamstatic.com/steam/apps/2218290/ss_6ef56cf98e0f24cc178459bc819df0e972b70a6c.1920x1080.jpg?t=1671684566,https://cdn.akamai.steamstatic.com/steam/apps/2218290/ss_6822d0b0993871f5d6e8aae13f4a08783873e535.1920x1080.jpg?t=1671684566",
    "Slug": "my-dream-lover",
    "Meta Title": "理想の恋人になりなさいっ！- My Dream Lover -: Dec 21, 2022, CyberStep,...",
    "Meta Description": "Looking for information on 理想の恋人になりなさいっ！- My Dream Lover -? Check out the release date (Dec 21, 2022), developer insights from CyberStep, Inc.,Rideon Wo...",
    "Alt Text Image": "Official header image for 理想の恋人になりなさいっ！- My Dream Lover - game - Steam 2218290",
    "Canonical URL": "https://gusku.site/game/my-dream-lover",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u7406\\u60f3\\u306e\\u604b\\u4eba\\u306b\\u306a\\u308a\\u306a\\u3055\\u3044\\u3063\\uff01- My Dream Lover -\", \"description\": \"Looking for information on \\u7406\\u60f3\\u306e\\u604b\\u4eba\\u306b\\u306a\\u308a\\u306a\\u3055\\u3044\\u3063\\uff01- My Dream Lover -? Check out the release date (Dec 21, 2022), developer insights from CyberStep, Inc.,Rideon Wo...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberStep, Inc.,Rideon Works Co. Ltd,\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CyberStep, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2218290/header.jpg?t=1671684566\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}