{
    "AppID": 2153330,
    "Name": "Otome * Domain",
    "Release date": "Dec 22, 2022",
    "About the game": "When a guy loses his family, how’s he going to live...? He’ll have to go to an all-girls school just to survive in this wacky comedy visual novel! FEATURES 20+ hours of story Two branching heroine routes Japanese voice acting SUMMARY The protagonist is left alone in the world after his grandmother passes away. He is found by a young lady of his age who runs a school for promising gentlewomen, and with nowhere else to go, he ends up in an otherwise all-female dormitory. However, his new housefellows are all absolutely eccentric. Weren’t they the ones who rescued him ? Now he doesn’t know who’s taking care of who...! CHARACTERS Kazari Saionji (Voice: Anzuhana) The daughter of wealthy business tycoons, she was actually raised by Minato’s late grandmother, who was her maid at the time. Out of love and a sense of filial obligation, she assumes responsibility for Minato’s living expenses after hearing about his plight. Thanks to her rich parents owning the entire campus, she happens to be the board chair of the same school she attends as a student—Whitebell Girls’ Academy—and so conveniently enrolls Minato there, too. Despite her attempts to come off as a refined, elegant young lady, in many ways she’s surprisingly clumsy and below average. As her roommate, Minato soon discovers that she’s not only slow and socially awkward, but gets lost easily and needs her hand held for the simplest of tasks... Yuzu Kifune (Voice: Akane Ueda) Minato and Kazari’s classmate and dormmate, and the head of the school’s newspaper club. Another daughter of a prominent family, but unlike Kazari, she’s genuinely charming, friendly, and almost too accommodating to Minato... That might make it sound like she’s the ultimate Japanese tradwife, but when it comes to domestic chores, she’s beyond salvation. She’s also a terminally curious and surprisingly stubborn tomboy who tends not to sweat the small stuff—to the point where her dorm room is a constant pigsty. And as if that weren’t enough, she’s actually confident(!) about her terrible cooking... How can a girl so good at everything else be this catastrophic when it comes to household affairs?! Hinata Ogaki (Voice: Airi Himekawa) Minato’s junior dormmate and a member of the library committee. Her family struck it big only recently and now controls an up-and-coming business enterprise. Despite being a “nouveau riche,” she has none of the usual smugness that comes with it. In fact, she’s too caught up in being a huge fantasy nerd and edgelord to really care about things like family standing or “having a decent personality” anyway... Speaking of edgy, she insists on calling herself “Zarathustra, General of the East.” Indeed, as one of the Demon Generals of the Four Heavenly Kings, she apparently already rules the world as we know it. Her story often changes, though, so sometimes she’s “about to invade” us in the near future, instead of already being in control. For all her constant cringiness, however, she’s actually not so bad underneath. Heck, she’ll even apologize if you tell her off hard enough, waterworks and all. Minato Asuka (Voice: Sara Ayumi) The protagonist of this game! Left without anyone to rely on after the passing of his grandmother, he was taken in by Kazari and offered a roof over his head, as well as enrollment at her family’s all-girls school. Despite very much being a boy, when dolled up in a skirt he can easily pass for the fairer sex—even without the extra padding. While this god-given talent might help him move through his new school life undetected, he’s still loathe to accept how good a girl he makes... His hobbies and talents include cooking, cleaning, laundry, and other household chores. In fact, upon moving into the girls’ dorms, he assumed all domestic chore duties himself because he couldn’t bear to see the mess his housemother-less dormmates had made. For his troubles he was later voted “no. 1 ideal housewife” in a campus newspaper club poll. Miyu Minami (Voice: Haruto Turuya) Sits next to Minato in class. Always cheerful and approachable, even towards people she’s only just met. She’s also thoughtful and considerate, easily getting along with most of her classmates. Close friends with Yuzu, who has also invited her to join the same newspaper club. Despite attending an expensive all-girls school, her family is not that well off and is struggling to pay her tuition. The plan was apparently to ensure that she’s raised with a little more class than they have been able to provide thus far... Unfortunately, though, her grades are at the bottom of the class, much to her parents’ dismay. Miyu, however, doesn’t seem too worried about it. Nanami Nanami (Voice: Rin Nanagase) Minato’s homeroom teacher and math instructor at Whitebell Girls’ Academy. Gets salty if you make jokes about her full name or age. Seems to have landed the unfortunate extra role of looking after Kazari. She’s even the overseer of Dorm II—Minato’s new home. It’s not like she wanted the extra responsibilities, however. She just found herself unable to leave the seemingly helpless board chair to her own devices... She has two go-to maxims: “I don’t wanna do work” and “Why do today what you can leave for tomorrow?” As a chronic slacker, she leaves all the housework chores, including looking after Kazari, to Minato once he moves in.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2153330/header.jpg?t=1671757374",
    "Price": 19.99,
    "Developers": "PALETTE-QUALIA",
    "Publishers": "Shiravune",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2153330/ss_d4ffbe5045649f5107f0a354bb316fe820693377.1920x1080.jpg?t=1671757374,https://cdn.akamai.steamstatic.com/steam/apps/2153330/ss_52a9626de89a46e66532ca4f6911e6f59211507c.1920x1080.jpg?t=1671757374,https://cdn.akamai.steamstatic.com/steam/apps/2153330/ss_b975f668046416d06ff8ce8c5d2ba94288f804b1.1920x1080.jpg?t=1671757374,https://cdn.akamai.steamstatic.com/steam/apps/2153330/ss_ca3a0c6b2449623c134250cea2c65163072dbc79.1920x1080.jpg?t=1671757374,https://cdn.akamai.steamstatic.com/steam/apps/2153330/ss_29963d6c544f6b76555a87878f2720266ef385b8.1920x1080.jpg?t=1671757374",
    "Slug": "otome-domain",
    "Meta Title": "Otome * Domain: Dec 22, 2022, PALETTE-QUALIA and Full Ove...",
    "Meta Description": "Looking for information on Otome * Domain? Check out the release date (Dec 22, 2022), developer insights from PALETTE-QUALIA, and a complete game summary.",
    "Alt Text Image": "Official header image for Otome * Domain game - Steam 2153330",
    "Canonical URL": "https://gusku.site/game/otome-domain",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Otome * Domain\", \"description\": \"Looking for information on Otome * Domain? Check out the release date (Dec 22, 2022), developer insights from PALETTE-QUALIA, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"PALETTE-QUALIA\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shiravune\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2153330/header.jpg?t=1671757374\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}