{
    "AppID": 1929720,
    "Name": "Pixel Petkeeper",
    "Release date": "Dec 9, 2022",
    "About the game": "A pet-collecting battle game with light RPG mechanics. Enter dungeons and fight creatures, tame pets, and collect items along the way. Raise your rank and collect prizes in the arena to unlock new areas Enter Dungeons Select the path you want to take in a dungeon by choosing which room to enter. Some rooms have obstacles, treasure, travelling merchants, fields, and more. In battle rooms, fight creatures using an autobattling system or use your pets' skills in real time. Encounter treasure rooms where you can collect loot: money, gems, or items to aid in your travels. Come across obstacle rooms that test your pets' stat points, and possibly get some useful perks when they succeed. Special rooms may also come up with healing fountains, traders that have discounted items, or gamblers inviting you to a minigame. Train Your Pets Use the training room to increase your pets' stat points. You can also use the clinic to recover their HP if they are injured. Participate in the arena to gain experience and rank up to enter new areas, or go for prize competitions that offer cash and items! As pets gain experience through dungeons and arena participation, they gain new skills that you can choose for them to use. Elemental pets can have special elemental skills that can prove useful for higher level dungeons! Specialized Pets Your pets can die T_T But you can use the Laboratory to temporarily freeze or even merge them with other pets! The Laboratory is also the place to create artifacts. Artifacts can select specific parts of pets and save these characteristics for you to use on existing pets. For example, you can take the highest stat of a dying pet and convert it into an artifact, and then transfer that stat point into a new pet to immediately get it to a higher level. You can also transfer over skills, passives, and even the breed or element of a pet! Create Stuff Own a home, and purchase fixtures for it! You can use cooking fixtures to create boosting food items, or purchase a workbench to create items like nets used for taming. Collect crafting materials from monster drops and level up in the arena to obtain stronger items that you can craft. If you have extra coin, decorate your home with some new wallpaper or flooring!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1929720/header.jpg?t=1670588982",
    "Price": 4.99,
    "Developers": "Pixel Prototype",
    "Publishers": "Pixel Prototype",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1929720/ss_9bfddf6b99989adb48fab75d0595ad27c12328d8.1920x1080.jpg?t=1670588982,https://cdn.akamai.steamstatic.com/steam/apps/1929720/ss_8743a838b9f51af6e697efccd365a060f8a591cb.1920x1080.jpg?t=1670588982,https://cdn.akamai.steamstatic.com/steam/apps/1929720/ss_cc33488976eab36905e7c470766ab4bf0672effb.1920x1080.jpg?t=1670588982,https://cdn.akamai.steamstatic.com/steam/apps/1929720/ss_0ee188c739764f15f5ef33a9095fecfc207efd26.1920x1080.jpg?t=1670588982,https://cdn.akamai.steamstatic.com/steam/apps/1929720/ss_fa133970da95095a13ffba0177ffba6a18c08a80.1920x1080.jpg?t=1670588982,https://cdn.akamai.steamstatic.com/steam/apps/1929720/ss_270fd306994afb48d346361a4590a82ac469224d.1920x1080.jpg?t=1670588982",
    "Slug": "pixel-petkeeper",
    "Meta Title": "Pixel Petkeeper: Dec 9, 2022, Pixel Prototype and Full Ov...",
    "Meta Description": "Looking for information on Pixel Petkeeper? Check out the release date (Dec 9, 2022), developer insights from Pixel Prototype, and a complete game summary.",
    "Alt Text Image": "Official header image for Pixel Petkeeper game - Steam 1929720",
    "Canonical URL": "https://gusku.site/game/pixel-petkeeper",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pixel Petkeeper\", \"description\": \"Looking for information on Pixel Petkeeper? Check out the release date (Dec 9, 2022), developer insights from Pixel Prototype, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pixel Prototype\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pixel Prototype\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1929720/header.jpg?t=1670588982\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}