{
    "AppID": 2098390,
    "Name": "Planet Surfer",
    "Release date": "Dec 14, 2022",
    "About the game": "Dodge Obstacles. Acquire upgrades. Save the world. Planet Surfer is a non-stop anti-gravity survival racer and the ultimate forward scrolling don’t run into stuff game developed as a love letter to the temple run quintet and the early 3d sonic games. Set in the distant future, you glide through obstacle heavy terrain trying to reach the end of 40+ levels while weaving through everything from trees to spike traps floating on lava. Planet Surfer will have you gripping the keyboard as adrenaline is pumping through your body as you race across galactic landscapes while dodging dangerous obstacles and collecting powerful upgrades. Put your skills to the test and run through our unique forward scrolling universe to save the world from destruction... before it's too late! Features: *Explore 40+ hand crafted obstacle dense courses dispersed across 4 different semi-realistic biomes including Earth, a dessert planet, a water dense beach planet, the stories central fire planet, “Voltanis”, plus one unrealistic, meme filled, unlock-able biome. *New to racer/runner survival games? No Problem!! Planet surfer provides various tutorials and allows for the player to have plenty of room to try and try again until they graduate from cadet to captain and acquire insane reflexes. *Navigate across the various levels going to any place you have unlocked whenever you desire with an immersive level/planet select menu. *Participate in a very “meta” story where your character is in a VR space competing in a drone navigation program to get to be the person allowed to take a chance at controlling a real drone on a one time, make it or break it, mission to save the universe. *Experience the inside of your ship from a first person prospective including your very own living space, hologram machine, and “swively” captains chair. *Earn coins by hitting all the checkpoints in any given level which are sometimes place in locations requiring reflexes to reach, sometimes placed in locations that require exploration to discover, and sometimes are just a bit of puzzle. *Spend coins in an interactive upgrade shop on your ship to unlock new abilities, enhance abilities, customize your ship, and unlock bonus levels. Unlock abilities including (but not limited to): *Phase Dash: You can literally phase through obstacles in a dashing motion for a limited period *Jump booster: Once you unlock this the game takes on a 3d platformer element. *Shrink Drive: So you can fit in the small places temporarily. *Time slowing drive: For the moments in the game that would be near impossible without it. Combine your various abilities in unique ways to get through levels in ways that are creative and fit your play style. Experience alternate endings depending on whether you succeed or fail on your final mission making for a fun story experience. (Players are not intended to succeed on their first try of the final mission but if they do, we want to hear about it!) Prepare yourself, the late game tracks are extremely difficult and will likely not be beaten by most players due to sheer difficulty. That is OK, the planet surfer program probably should not have entrusted the fate of the universe to gamers.. But, they did. *Warning: Planet Surfer contains fast moving imagery and various effects such as white flashes that may potentially trigger seizures for people with photosensitive epilepsy.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2098390/header.jpg?t=1671219292",
    "Price": 5.09,
    "Developers": "Matthew Christiansen",
    "Publishers": "Mount Verita",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2098390/ss_aa4d7aa2db8e60ed51ea65a2b37fa2111aa3db8c.1920x1080.jpg?t=1671219292,https://cdn.akamai.steamstatic.com/steam/apps/2098390/ss_64022ef4961e167f9eb3faff3a4336151cef1ad2.1920x1080.jpg?t=1671219292,https://cdn.akamai.steamstatic.com/steam/apps/2098390/ss_bd6b82ff5216071654e83952d06a84be897171a1.1920x1080.jpg?t=1671219292,https://cdn.akamai.steamstatic.com/steam/apps/2098390/ss_f304772ebf62d4d024451c5cbec267bac5c04dd5.1920x1080.jpg?t=1671219292,https://cdn.akamai.steamstatic.com/steam/apps/2098390/ss_2d078090cf56d1f34124532d607fa3a30508ff72.1920x1080.jpg?t=1671219292,https://cdn.akamai.steamstatic.com/steam/apps/2098390/ss_bb9371ccf9ee665defd1280404d1a60cd48c5469.1920x1080.jpg?t=1671219292,https://cdn.akamai.steamstatic.com/steam/apps/2098390/ss_d8c2aac8fcd28159ec04de4d5b707b641b566c6b.1920x1080.jpg?t=1671219292,https://cdn.akamai.steamstatic.com/steam/apps/2098390/ss_29c627c41a5b907d364c9c5f00e8ec798be54820.1920x1080.jpg?t=1671219292,https://cdn.akamai.steamstatic.com/steam/apps/2098390/ss_109cc61cb4d6eb15140acf57b70a069c5e134ae2.1920x1080.jpg?t=1671219292,https://cdn.akamai.steamstatic.com/steam/apps/2098390/ss_6d6026a089576b247c684e2128b174995392eb7e.1920x1080.jpg?t=1671219292,https://cdn.akamai.steamstatic.com/steam/apps/2098390/ss_06f8f9fea9d58a7acfe920f5a04b56ce59e91659.1920x1080.jpg?t=1671219292,https://cdn.akamai.steamstatic.com/steam/apps/2098390/ss_cfdb1e49d1a69a30f8b0b4d96abd9018ff2a09c1.1920x1080.jpg?t=1671219292,https://cdn.akamai.steamstatic.com/steam/apps/2098390/ss_7fea51532589bcbd03d2e8d454f9b7c05d4f6588.1920x1080.jpg?t=1671219292",
    "Slug": "planet-surfer",
    "Meta Title": "Planet Surfer: Dec 14, 2022, Matthew Christiansen and Ful...",
    "Meta Description": "Looking for information on Planet Surfer? Check out the release date (Dec 14, 2022), developer insights from Matthew Christiansen, and a complete game s...",
    "Alt Text Image": "Official header image for Planet Surfer game - Steam 2098390",
    "Canonical URL": "https://gusku.site/game/planet-surfer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Planet Surfer\", \"description\": \"Looking for information on Planet Surfer? Check out the release date (Dec 14, 2022), developer insights from Matthew Christiansen, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Matthew Christiansen\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mount Verita\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2098390/header.jpg?t=1671219292\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.09, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}