{
    "AppID": 1833930,
    "Name": "Primasia (Chapter One)",
    "Release date": "Dec 8, 2022",
    "About the game": "Synopsis Prime8, an ethereal spirit of evolutionary history, exists within Prime8 Cavern, deep inside Green Mountain. Green Mountain is located on Prime8 island. Prime8 has now called upon eight disciples to join him on the island. These creatures previously lived in the Land of Humans, being carefully chosen for their natural aptitudes towards the tasks that Prime8 wishes to address. Features - The Prime8 Gang consists of Little Gorilla, Amanda Panda, Sam Snake, Caterpillar, Hugi Hippo, Rhino, Wanda Whale and Tiny Tiger. Switch between characters to undertake tasks and challenges. - All the southern region of Prime8 island (also known as Primopolis) may be explored. There are some areas that will hold important knowledge and information and others that exist purely for day-to-day activities. - Eight pirates that are a splinter group of a larger organisation have been given the task of invading Primopolis to disrupt your progress. You must thwart their efforts! - The southern region of Prime8 island also lends its name to the capital town. This was previously in the central region. You must develop it to encourage new citizens to live on the island as well as enabling trade with the other five islands of Primasia. You will need to use sustainable resources for building purposes. - There are eight unique crops that grown on Prime8 island. These vary from a variety of carrot called cone carrots to the famous Primasia potato. Sell these crops to earn Darwiniams – the currency of money used in Primasia. - There are five specific mini games that may be played where you will leave or enter another location. These are designed to assist greater understanding of the game mechanics and offer bonus rewards too. - There are eight riddles that form part of the side-story. These vary in complexity and may be attempted whenever you feel in the mood! - On your journey you will be asked to complete Q&amp;A sections to maintain your average score indicator – which measures your answering accuracy. These questions will include useful general knowledge, as does the contents of the Prime8 handbook. So where do you start…? Join the Prime8 Gang as they arrive on Prime8 island in the first part of their journey. They will trade with the other five islands to gain other resources for crafting purposes. As they learn about the island's history, they will meet new characters and learn other useful information about Primasia AND the Land of Humans. History At the same time Pangea broke up 273 million years ago - so too did Primasia. Primasia's location is never static, but always somewhere in the Atlantic ocean. Prime8 island - is the largest island in Primasia. The time has come for Prime8 to interact fully with those in the Land of Humans, to share historic ecological data pertaining to global natural health. The secrets held inside Prime8 Cavern must be accessed and used to enhance the world at large, to sustain the six distinct climates of Primasia and ensure environmental betterment globally in partnership with those in the Land of Humans. Who do we think should play this game?! We wanted to create a game that engaged families to play together. Although Primasia may appear to target a younger audience – we can assure you that all the family will need to get involved to complete the game properly. There is nothing better than children learning through play and at the same time referring to their responsible adults for assistance from time to time! Message from us Here at Prime8 we strive to create fun and educational games and other interactive resources for children and their families. The environmental pressures globally are very close to our hearts and to this end we have included various references and features in our products to reflect this. We should all try and ‘protect our tomorrows’ when we have the opportunity, and we hope that this ethos resonates warmly in your gaming experience!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1833930/header.jpg?t=1670512637",
    "Price": 29.99,
    "Developers": "Prime8 International Limited",
    "Publishers": "Prime8 International Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1833930/ss_892e58c3169fc847ebb4a2df353e8447b6d65e67.1920x1080.jpg?t=1670512637,https://cdn.akamai.steamstatic.com/steam/apps/1833930/ss_9965fcc8d7f20381f99fe45e5ff071aa627447aa.1920x1080.jpg?t=1670512637,https://cdn.akamai.steamstatic.com/steam/apps/1833930/ss_65da790ce73063e57be03f639efe1812eb2c9004.1920x1080.jpg?t=1670512637,https://cdn.akamai.steamstatic.com/steam/apps/1833930/ss_01e8522763eb7dfaf8f8cc7cd1012b0ccb192685.1920x1080.jpg?t=1670512637,https://cdn.akamai.steamstatic.com/steam/apps/1833930/ss_3eae262bc82cc0b0a1d520d676650366ef637040.1920x1080.jpg?t=1670512637,https://cdn.akamai.steamstatic.com/steam/apps/1833930/ss_98f4dc42f3dc4d698592f5a0cab086f2e9c1ba09.1920x1080.jpg?t=1670512637,https://cdn.akamai.steamstatic.com/steam/apps/1833930/ss_6cf4f5ccd4bc5a0c10f8ac002b97e4849706ee51.1920x1080.jpg?t=1670512637",
    "Slug": "primasia-chapter-one",
    "Meta Title": "Primasia (Chapter One): Dec 8, 2022, Prime8 International...",
    "Meta Description": "Looking for information on Primasia (Chapter One)? Check out the release date (Dec 8, 2022), developer insights from Prime8 International Limited, and a...",
    "Alt Text Image": "Official header image for Primasia (Chapter One) game - Steam 1833930",
    "Canonical URL": "https://gusku.site/game/primasia-chapter-one",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Primasia (Chapter One)\", \"description\": \"Looking for information on Primasia (Chapter One)? Check out the release date (Dec 8, 2022), developer insights from Prime8 International Limited, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Prime8 International Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Prime8 International Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1833930/header.jpg?t=1670512637\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}