{
    "AppID": 2183080,
    "Name": "Princess Dating Sim",
    "Release date": "Dec 5, 2022",
    "About the game": "Princess Dating Sim is an non-linear visual novel where you court multiple princesses at the same time. You'll need to woo them, and see what their tastes are before you can pick a partner to marry! But don't worry, you'll have plenty of chances to get to know them! Every princess has a different personality, dreams, desires, and hobbies. Your job is to get to know them all in order to find your perfect match! Will it be the shy Princess who loves books? The loud Princess who wants nothing more than to dance? Or maybe even the adventuring Princess who just wants to tease you? Who will you fall for? You play as prince Weston, a prince from faraway land who came to court all three of the princesses. Time duration - Each main story line is about 10 minutes of fast to medium play. - There are 3 princesses - that is three main story lines - the whole gameplay being around 30 minutes - Unlocking all the images will take you approximately 10 more minutes. - Unlocking all the achievements, all the branches and in overall getting 100% completion will take you about an hour. Features: - Different princesses to date in a non-linear simulation. - Flirty and fun dialogue trees. - Multiple love interests. - Easy to learn gameplay. - Interactive map with locations to go to. - Time simulation - during different time of the day you can meet different princess in a different location. - Replay value in trying to unlock the full story of each princess. Gameplay: In this non-linear visual novel you get to choose how you progress through the story. Each princess has her own storyline, which you can jump into. You'll get to make a lot of choices, and some will affect the progression. The game is designed to be relatively short, but with lots of choices and a lots of replay value (it is not possible to unlock everything for every princess in one go. It is even highly likely you will need more than one try per princess). Each princess also has special rewards - images of them - which you can unlock with certain choices and view them later in the gallery. In the end, you get to pick your princess and see if she accepts your invitation to the grand ball!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2183080/header.jpg?t=1670280711",
    "Price": 2.54,
    "Developers": "Cute Pen Games",
    "Publishers": "Cute Pen Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2183080/ss_b38bfe09e417bc14e06a7a63001f6262468c366b.1920x1080.jpg?t=1670280711,https://cdn.akamai.steamstatic.com/steam/apps/2183080/ss_9754d8cd32395159be62abb21ea71512860ac539.1920x1080.jpg?t=1670280711,https://cdn.akamai.steamstatic.com/steam/apps/2183080/ss_e93455a2f0bcdecd21b5ec89ffc04989fabd2aae.1920x1080.jpg?t=1670280711,https://cdn.akamai.steamstatic.com/steam/apps/2183080/ss_c228a78225b2e745be4b42dbf8a3958d74caa845.1920x1080.jpg?t=1670280711,https://cdn.akamai.steamstatic.com/steam/apps/2183080/ss_d3b2fd49f67a59e8f48d724f00b9123f8a09c086.1920x1080.jpg?t=1670280711,https://cdn.akamai.steamstatic.com/steam/apps/2183080/ss_94a5299737dde127b20232564f1e6549efe5f863.1920x1080.jpg?t=1670280711",
    "Slug": "princess-dating-sim",
    "Meta Title": "Princess Dating Sim: Dec 5, 2022, Cute Pen Games and Full...",
    "Meta Description": "Looking for information on Princess Dating Sim? Check out the release date (Dec 5, 2022), developer insights from Cute Pen Games, and a complete game su...",
    "Alt Text Image": "Official header image for Princess Dating Sim game - Steam 2183080",
    "Canonical URL": "https://gusku.site/game/princess-dating-sim",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Princess Dating Sim\", \"description\": \"Looking for information on Princess Dating Sim? Check out the release date (Dec 5, 2022), developer insights from Cute Pen Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 5, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cute Pen Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cute Pen Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2183080/header.jpg?t=1670280711\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.54, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}