{
    "AppID": 1764820,
    "Name": "PYRMD",
    "Release date": "Dec 12, 2022",
    "About the game": "Akhenaten – The King of Agony and Terror Thousands of years ago, Pharaoh Akhenaten ruled Egypt with his family. Egypt had reached its zenith of power and prosperity under the reign of Akhenaten, until foreigners came and stole all its wealth. Invaders wiped Egypt off the map in a few days and took Pharaoh Akhenaten's family away. Akhenaten vowed to get them back. He felt that as a Pharaoh, he had the responsibility to protect his family and reign by all means necessary. He started using imprisonment, torture and agony as tools to track down the enemy. By time, he became cruel and insane, desperately wanting his family and throne back. His cruelty was so intense that he believed he became a god of agony, terrorizing innocent people to retrieve his losses. When he was not able to cope with this torment any more, he decided to kill himself with the last items he owned so that he could be revived when his family returned. His family never returned. At least this is what most people believe, but there are other theories about what really happened… Some say Akhenaten was nothing but a true monster, and he himself brought death to his own family just to justify torturing and killing innocent people. He felt that he was above everyone else and therefore did whatever he wanted, which often resulted in unutterable terror. Nothing about him seemed normal, and everything about him screamed demon. Only survivors could tell the tale of what happened. The rest were dead. 4 Survivors, 1 Pharaoh... What Now? Four people entered the pyramid for different reasons. Some people came to make money and some came for professional reasons, but none expected what they would find inside. As soon as they entered the pyramid they started feeling distressed. The temperature dropped and it became harder to breath. They looked around but there was nothing unusual—just a dark corridor leading deeper into the pyramid. They followed it without hesitation despite their growing unease until one of them made a critical move without asking others, triggering a series of events. They suddenly found themselves separated from one another. There is no map or guidebook—just an ancient structure with no light except for what comes from their own flashlights or torches! They were supposed to be working together, but they're all separated now and they can't find their way back. They are in danger and they have no idea how to get out of this situation. What is the curse? No one knows! The way to escape is unclear. The only certainty is that they are all trapped inside, and the darkness within seems to be growing. The pyramid had been built by Akhenaten before he committed atrocities for mysterious reasons, and has been sealed for thousands of years. There have been rumors about a treasure chest full of gold and jewels in the pyramid, and an evil curse protecting it. Unbeknown to the intruders, it's also home to a mummy, Akhenaten, who had been asleep for a very long time. He is now furious that intruders have found his resting place and that his home has been violated. The intruders will pay! The Most Terrifying Multiplayer Game Ever! The game is simple; survive or die! Survivors must find the tablets and place them in the right places in order to kill the mummy to find their way out, or the mummy must send all of the survivors to Purgatory.. Remember, both survivors and the mummy are real players. There are traps and obstacles in their path—and the opponent might be lurking just around the corner! Dynamically Adjusting Soundscape Reveals Mummy's Presence Up Ahead! PYRMD is a game of strategy, skill and most importantly, listening! With its amazing sound design, PYRMD's seamlessly integrated dynamic ambient sound will help you to figure out the proximity of the mummy in relation to other survivors' location. Using this information strategically may give you the upper hand. If you love games with good sound design, this game is going to be one of your favorites. Do you hear where others are? Listen carefully, you sure do. A Terrifyingly Fun Game Since both the survivors and the Mummy are real players, you'll find PYRMD entertaining and scary at the same time. If you want to get your heart pumping, you should definitely play this game! Voice chat makes it even more fun to play, especially with a bunch of friends. If more than one player wants to be the Mummy, you'll be randomly selected. Fair warning - this game might be too scary to play at night by yourself! A Game That Changes Its Gameplay Everytime You Play It PYRMD offers a masterfully-crafted innovative game design that changes its gameplay everytime you play it - giving you the feel of a new game even if you have played it dozens of times. It ensures you'll always be alert, no matter how many times you play it. The next time you play PYRMD, it will automatically give you a unique game design that's completely different from what you had before. This means that even if you're a battle-scarred player, there will always be something new for you to experience! For Survivors Don't forget to grab items! You can split up tasks among your team members, and everyone can get items suited to their own roles so you can search for tablets much more efficiently. Find the tablets! Hiding won't work. To escape this cursed pyramid, you have to work together and find the tablets. You need to place the tablets you find in the right place to escape. Don't get caught! The Mummy will take you to Purgatory if he catches you. If you use your skills well, or someone else saves you, you can get out of Purgatory. If you stay in Purgatory too long, you will die. For Mummy If you play as the Mummy, you know that you have to chase survivors. Survivors will go to Purgatory when you catch them. You must send all survivors to Purgatory in order to kill them. If others reach the one in Purgatory, she will be saved. This cannot happen! More information about the game is available at pyrmdofficial.com",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1764820/header.jpg?t=1670861314",
    "Price": 4.79,
    "Developers": "tiplay studio",
    "Publishers": "tiplay studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1764820/ss_ba6bc8c91c44a8f118b587a71fda32c17806c2d4.1920x1080.jpg?t=1670861314,https://cdn.akamai.steamstatic.com/steam/apps/1764820/ss_c5bb60998a148271690a223a6e35012b64ed5f56.1920x1080.jpg?t=1670861314,https://cdn.akamai.steamstatic.com/steam/apps/1764820/ss_562423f59be94201db4d3f951dab54072982a2fc.1920x1080.jpg?t=1670861314,https://cdn.akamai.steamstatic.com/steam/apps/1764820/ss_8d1c1509ba2307402751475123f0bc77d68fb5c9.1920x1080.jpg?t=1670861314,https://cdn.akamai.steamstatic.com/steam/apps/1764820/ss_f133b74f3b78f2b305b31e6efab72b372e05347f.1920x1080.jpg?t=1670861314,https://cdn.akamai.steamstatic.com/steam/apps/1764820/ss_1fb327453c9bc401a1b65ddab87d0ca1c0341043.1920x1080.jpg?t=1670861314,https://cdn.akamai.steamstatic.com/steam/apps/1764820/ss_42504a52637f17aa0a002bb15b990cae5d1b7438.1920x1080.jpg?t=1670861314,https://cdn.akamai.steamstatic.com/steam/apps/1764820/ss_213a76820d8e3f91a7ba23f6d0ffb0624858caad.1920x1080.jpg?t=1670861314",
    "Slug": "pyrmd",
    "Meta Title": "PYRMD: Dec 12, 2022, tiplay studio and Full Overview",
    "Meta Description": "Looking for information on PYRMD? Check out the release date (Dec 12, 2022), developer insights from tiplay studio, and a complete game summary.",
    "Alt Text Image": "Official header image for PYRMD game - Steam 1764820",
    "Canonical URL": "https://gusku.site/game/pyrmd",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"PYRMD\", \"description\": \"Looking for information on PYRMD? Check out the release date (Dec 12, 2022), developer insights from tiplay studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"tiplay studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"tiplay studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1764820/header.jpg?t=1670861314\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}