{
    "AppID": 2180530,
    "Name": "Ragnarok: Fallen Legends",
    "Release date": "Dec 14, 2022",
    "About the game": "Ragnarok: Fallen Legends is a turn-based card battler with a unique shared-deck mechanism, exciting roguelike gameplay, and original multiplayer modes. Inspired by ancient myths and legends, you will play as gods, with mythical creatures as your fighting partners. Official Discord: Shared Deck with playing card elements – All players draw from a shared deck of 90 cards. Like standard playing cards, each card has a suit and a rank, which is related to certain card effects and character skills. Action cards – These allow you to attack and defend in the most common sense. Usually, you can only attack once during a turn. Spell cards – You can play as many spell cards as you’d like in one turn to deal spell damage, disrupt your opponent’s deck, or even reshuffle every player’s hand. Artifact cards – Equip up to 2 Artifact cards to gain long-lasting and even game-changing buff. For example, equip the ‘Trident’ to discard your enemy’s card after dealing damage. Solo roguelike – The demo offers a single player roguelike mode where a procedural generated system throws new characters, events and quests at you every run. Classic 2v2 – The full version will include a 2V2 mode, where you team up with 1 player to fight against 2 enemies. Rebellious Gods – A 6-player mode where each player has a randomly assigned Role. You need to guess the identity of other players to slay the right targets and complete your mission. 24 deities &amp; 24 pets – Unlock hand-drawn deity and pet characters based on myths from various origins: Play as the righteous Apollo, the cunning Loki, or the grim Anubis. Assemble your duo - Each deity and pet character comes with unique skills. Find the best pet for your favorite deity to develop your own playstyle – Use Sphinx to force the opponent to guess the suit of a card or take damage, or pick the Black Tortoise to bless your character with more armor? Strategic battles - Play your cards right to maximize the effects of your character skills, and unleash powerful attacks to shred your enemies, or outwit them with clever strategies. In this chaotic, magical world where gods and demons meet, with the power blessed in you by deities and mythical creatures, you will battle against the evil until you destroy the final boss Azathoth to restore peace and order.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2180530/header.jpg?t=1671086569",
    "Price": 0.89,
    "Developers": "Cultivation Studio",
    "Publishers": "Cultivation Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2180530/ss_2bcbfe9dc1e7a1252e7f53e52103b08d7eb56677.1920x1080.jpg?t=1671086569,https://cdn.akamai.steamstatic.com/steam/apps/2180530/ss_4950f03cbc75313fa7961043e506d2099b056a32.1920x1080.jpg?t=1671086569,https://cdn.akamai.steamstatic.com/steam/apps/2180530/ss_cfb091c4094bd3d2b77b9ce485f54504e29824d4.1920x1080.jpg?t=1671086569,https://cdn.akamai.steamstatic.com/steam/apps/2180530/ss_cee288022ed6bbcbb186866599d8e7abf97d0b43.1920x1080.jpg?t=1671086569,https://cdn.akamai.steamstatic.com/steam/apps/2180530/ss_4e688273aa658a37ffa22f8df8661172f87f4a02.1920x1080.jpg?t=1671086569",
    "Slug": "ragnarok-fallen-legends",
    "Meta Title": "Ragnarok: Fallen Legends: Dec 14, 2022, Cultivation Studi...",
    "Meta Description": "Looking for information on Ragnarok: Fallen Legends? Check out the release date (Dec 14, 2022), developer insights from Cultivation Studio, and a comple...",
    "Alt Text Image": "Official header image for Ragnarok: Fallen Legends game - Steam 2180530",
    "Canonical URL": "https://gusku.site/game/ragnarok-fallen-legends",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ragnarok: Fallen Legends\", \"description\": \"Looking for information on Ragnarok: Fallen Legends? Check out the release date (Dec 14, 2022), developer insights from Cultivation Studio, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cultivation Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cultivation Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2180530/header.jpg?t=1671086569\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.89, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}