{
    "AppID": 2102240,
    "Name": "Ravage Road",
    "Release date": "Dec 20, 2022",
    "About the game": "You control the direction of the road in this unique spin on the classic tower defense genre: choose where to place tiles, how to rotate them, and when to split your path and how to build out branches to maximize tower efficiency and create brutal death traps to decimate the incoming waves of would-be heroes! Starting with a hand full of basic towers, it's up to you to use your gold wisely for placing new defensive towers, upgrading the quality of your cards, and buying new cards to gain better allies. From the most basic of goblins to the top-tier dragon towers, it's up to you to unlock, acquire and place your minions to keep your tower safe! Why let your minion towers have all the fun? Unlock and equip four unique spells to slow and damage enemy units with raging blasts of fireballs, icy blizzards, and bolts of lightning, or give your allies a fire rate boost with the power of magical haste! With four unique bosses spread out over a hundred waves of enemies, you're sure to come to hate the sound of their spawning music - but with grit and determination and a lot of furiously firing towers, you can bring them down and capture their crowns to turn in for upgrades at the skill tree! Even if your tower is destroyed, between runs you can spend prizes won during the game to upgrade and unlock new features to make your next run stronger. Gain access to new towers, unlock new kinds of merchant spawns, and even upgrade the number of cards you draw each turn or the amount of gold you start with, and much more! Make strategic decisions about when to spend money and when to hoard it, as well as the best ways to place towers and how to build to deal with varying enemy types. Do you build a few super powerful towers? Fill the map with more affordable ones? Design your road in a twisting snake, a winding spiral, or a series of branching forks? It's up to you to figure out the ultimate strategy! With 100 waves to withstand, 20 kinds of enemies to destroy, 8 unique minions to discover and 35 useful skills to unlock, it's up to YOU to build the perfect road!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2102240/header.jpg?t=1671561035",
    "Price": 15.29,
    "Developers": "Triple Cerberus Studios",
    "Publishers": "Triple Cerberus Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2102240/ss_b56d11659f65bb72916ee9f76398b2ce137f17ed.1920x1080.jpg?t=1671561035,https://cdn.akamai.steamstatic.com/steam/apps/2102240/ss_fca3fee1fd2fa663af6f01e1594c7fca844ed8cd.1920x1080.jpg?t=1671561035,https://cdn.akamai.steamstatic.com/steam/apps/2102240/ss_856737c30b16e3abf1eb2498af99fca25d092077.1920x1080.jpg?t=1671561035,https://cdn.akamai.steamstatic.com/steam/apps/2102240/ss_b1740968f30de2166f26288c3d1c774a61de2375.1920x1080.jpg?t=1671561035,https://cdn.akamai.steamstatic.com/steam/apps/2102240/ss_0b9f048960105a97c60cfc332a0495f807ea024e.1920x1080.jpg?t=1671561035,https://cdn.akamai.steamstatic.com/steam/apps/2102240/ss_dd56be8a919826e428683cabfd86fe82bc751f63.1920x1080.jpg?t=1671561035",
    "Slug": "ravage-road",
    "Meta Title": "Ravage Road: Dec 20, 2022, Triple Cerberus Studios and Fu...",
    "Meta Description": "Looking for information on Ravage Road? Check out the release date (Dec 20, 2022), developer insights from Triple Cerberus Studios, and a complete game ...",
    "Alt Text Image": "Official header image for Ravage Road game - Steam 2102240",
    "Canonical URL": "https://gusku.site/game/ravage-road",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ravage Road\", \"description\": \"Looking for information on Ravage Road? Check out the release date (Dec 20, 2022), developer insights from Triple Cerberus Studios, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Triple Cerberus Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Triple Cerberus Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2102240/header.jpg?t=1671561035\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.29, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}