{
    "AppID": 2017640,
    "Name": "Sakura Gym Girls",
    "Release date": "Dec 19, 2022",
    "About the game": "Kitagawa Shouhei is a young man who lives in a quiet town, where he runs his deceased grandfather’s bookshop. His life is an ordinary one, but he’s content with it, even if he hasn’t had a girlfriend in years. Shouhei is happy enough to while away his days among stacks of old, dusty books, while chatting with his favorite (and only) colleague, the sweet-natured and mild-mannered Asa… But his luck with women takes a sudden turn for the better when Asa asks him to go to the local gym with her, to help her shed some extra weight. While at the gym, Shouhei runs into two very different women: the haughty and aloof Tsumiki, and the cheerful, energetic Ranko, with whom Shouhei shares a complicated past. Join Shouhei as he helps Asa with her fitness regimen, all while trying to win over the icy Tsumiki and processing his feelings for Ranko. Whether Shouhei will end up with Asa, Tsumiki, or Ranko (or all three of them) is up to you in this visual novel. Characters: Asa works at Shouhei’s bookshop as his most trusted (and, indeed, only) employee. She’s a quiet girl with low self-confidence, but her gentle smile ensures she always leaves her customers feeling satisfied. Asa is very short, which is something she’s horribly embarrassed about. She tries to counteract this by wearing heels, though she can’t help but envy popular idols and models for being so tall and willowy. She’s liked Shouhei for a long time, but she’s too shy to act on her feelings. Ranko used to be Shouhei’s girlfriend, back when the both of them were in university. They’ve since broken up, however, and Shouhei didn’t imagine he would ever see her again – that is, until he sees her at his local gym. Ranko is a cheerful, upbeat girl who doesn’t sweat the small stuff. She’s always smiling, laughing, and cracking jokes, which makes her fun to hang around with – though it can be hard to tell whether she’s being serious or not. Tsumiki is an aloof, haughty girl who acts like an aristocrat. She takes against Shouhei after their first meeting, and she’s aggressively rude towards him. Tsumiki might seem unapproachable, but she does have a sweet side. She’s a huge fan of romance novels, though she’s never been in a relationship before herself. She dreams about being swept off her feet one day by a handsome prince, and having her own happily ever after ending… But that’ll never happen, right?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2017640/header.jpg?t=1671478661",
    "Price": 7.49,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2017640/ss_27b22c05d936f0cc8ee95cc12f5347ab33595d99.1920x1080.jpg?t=1671478661,https://cdn.akamai.steamstatic.com/steam/apps/2017640/ss_2df52d87cc83cfedaaf5d52ab9b1558eab43e1c4.1920x1080.jpg?t=1671478661,https://cdn.akamai.steamstatic.com/steam/apps/2017640/ss_5c753d411d9d5fbabaf4d7d4c8749e2b5bf11c72.1920x1080.jpg?t=1671478661,https://cdn.akamai.steamstatic.com/steam/apps/2017640/ss_a01fd9efdb39dcee4d79c08ac781ba5a3a2d81ff.1920x1080.jpg?t=1671478661,https://cdn.akamai.steamstatic.com/steam/apps/2017640/ss_087ff8c76adc672f4429346b3107f8a7c2fec261.1920x1080.jpg?t=1671478661,https://cdn.akamai.steamstatic.com/steam/apps/2017640/ss_58564ebb0bbf7a6535790c485dd856759f1fdd74.1920x1080.jpg?t=1671478661,https://cdn.akamai.steamstatic.com/steam/apps/2017640/ss_3068ef1617665add419e18201e831ab83a171c94.1920x1080.jpg?t=1671478661",
    "Slug": "sakura-gym-girls",
    "Meta Title": "Sakura Gym Girls: Dec 19, 2022, Winged Cloud and Full Ove...",
    "Meta Description": "Looking for information on Sakura Gym Girls? Check out the release date (Dec 19, 2022), developer insights from Winged Cloud, and a complete game summary.",
    "Alt Text Image": "Official header image for Sakura Gym Girls game - Steam 2017640",
    "Canonical URL": "https://gusku.site/game/sakura-gym-girls",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura Gym Girls\", \"description\": \"Looking for information on Sakura Gym Girls? Check out the release date (Dec 19, 2022), developer insights from Winged Cloud, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2017640/header.jpg?t=1671478661\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}