{
    "AppID": 1756150,
    "Name": "SCP: Keter",
    "Release date": "Dec 17, 2022",
    "About the game": "Based on the SCP Foundation 'Keter' is a Dead by Daylight and Left4Dead-inspired Multiplayer Game. Every Screenshot or Video is captured in real-time Gameplay D CLASS vs SCP Subjects 3 D Class Players try to flee from the Facility, where an SCP played by another Player has to make their attempt a gruesome failure. A multiplayer (3vs1) horror survival Match where one player takes on the role of an SCP, and the other three players play as D Classes, trying to escape with the use of several Items and tactical behaviour with a portion of Stealth by reactivating the Escapesystem. No Round will be identical to the other, due to randomly placed Objectives and environmental opportunities. ABOUT GAMEPLAY - Make it out alive... Or Not. D Class players can work together to increase their chances to Flee or just be the lone Wolf and find a way out alone. But keep in mind that Distraction is a strong Weapon against the SCP... - Where was it again? Every time you join a Match the Locations of important Objects will change. Due to randomly spawned Traps and Terminals every Round will differ from the other. - The SCP Killer Dream comes True, you are the SCP with all its Power. Enjoy your Hunt and feed each of them to the Flesh which devours them all! - Dive deep into the SCP Universe and learn more about the D Class and SCPs. Find unique items and unlockables during Gameplay and through the Leveling Progress. - Slow the SCP down... You don't need to make yourself easy Prey, use the environment or special SCP Items to give yourself an advantage. WARNING: PHOTOSENSITIVITY/EPILEPSY SEIZURES - READ THIS NOTICE BEFORE PLAYING A very small percentage of people may experience epileptic seizures or blackouts when exposed to certain flashing lights or light patterns. These persons, or even people who have no history of seizures or epilepsy, may experience epileptic symptoms or attacks while playing video games. If you or any of your relatives have an epileptic condition or have had seizures of any kind, consult your physician before playing any video game. Confirmed SCPS: SCP-049 SCP-106 SCP-811 SCP-682 SCP-096 SCP-2761 SCP-5000 more to come... Features Handcrafted SCPs and D-Class Models with love to every Detail Unlockables SCP Foundation related Secrets Level progress SCP Player can Host Sessions Join Matches as a D Class Integrated Chat so much more to come!!! Upcoming during Early Access_ The release will be in early access with several changes during the Development process. Visual Software Support NVIDIA® DLSS and Reflex Support AMD® FidelityFX Super-Resolution (FSR) Ultra-wide support DLSS and Fidelity are scalable by the Player. Will be Updated to Unreal Engine 5 as soon as possible",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1756150/header.jpg?t=1671278375",
    "Price": 13.99,
    "Developers": "DRAUGR",
    "Publishers": "Glacier LTD",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1756150/ss_6cd95de28286e96b02c51640a0960a26c45f3396.1920x1080.jpg?t=1671278375,https://cdn.akamai.steamstatic.com/steam/apps/1756150/ss_24424ba1ad2bb75b230d9955e9fba252b7a6124e.1920x1080.jpg?t=1671278375,https://cdn.akamai.steamstatic.com/steam/apps/1756150/ss_fcfa31b9b3ff391fdcbc072e79894c63d1501677.1920x1080.jpg?t=1671278375,https://cdn.akamai.steamstatic.com/steam/apps/1756150/ss_10735435cb509e7e29de7ef5ca15a3776acf8209.1920x1080.jpg?t=1671278375,https://cdn.akamai.steamstatic.com/steam/apps/1756150/ss_003f8b7ae62c441da20ad8dc868521f85f984085.1920x1080.jpg?t=1671278375,https://cdn.akamai.steamstatic.com/steam/apps/1756150/ss_791b0bf9c7194cfc95df4319cde99db41552998f.1920x1080.jpg?t=1671278375,https://cdn.akamai.steamstatic.com/steam/apps/1756150/ss_4663f6233e7691f494f64ec0237ffe0465a5527a.1920x1080.jpg?t=1671278375,https://cdn.akamai.steamstatic.com/steam/apps/1756150/ss_a7e7601461daa2446f1fadd00ad03fedb95c63f8.1920x1080.jpg?t=1671278375,https://cdn.akamai.steamstatic.com/steam/apps/1756150/ss_f9f7451e7c1c38b0d44bfdb4799648b411b89942.1920x1080.jpg?t=1671278375,https://cdn.akamai.steamstatic.com/steam/apps/1756150/ss_75ae14ea928ea6075697dc1dab4739c9a7ed1841.1920x1080.jpg?t=1671278375",
    "Slug": "scp-keter",
    "Meta Title": "SCP: Keter: Dec 17, 2022, DRAUGR and Full Overview",
    "Meta Description": "Looking for information on SCP: Keter? Check out the release date (Dec 17, 2022), developer insights from DRAUGR, and a complete game summary.",
    "Alt Text Image": "Official header image for SCP: Keter game - Steam 1756150",
    "Canonical URL": "https://gusku.site/game/scp-keter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SCP: Keter\", \"description\": \"Looking for information on SCP: Keter? Check out the release date (Dec 17, 2022), developer insights from DRAUGR, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"DRAUGR\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Glacier LTD\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1756150/header.jpg?t=1671278375\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}