{
    "AppID": 2166220,
    "Name": "Students of Light Bonds - Typing RPG with Character Creation -",
    "Release date": "Dec 19, 2022",
    "About the game": "'Thank you!', 'Became CEO!', 'There is always next chance!' Combined cheerful positive words typing and RPG with character creation system for all party members! 'Students of Light Bonds - Typing RPG with Character Creation -' (Original title in Japanese : '光の絆の生徒達 ～ キャラメイク・タイピングRPG ～') is a RPG based Japanese romanization typing game with flexible character creation system. Features Highly Flexible Character Creation : Editing names, portraits, and colors (skin, hair, eyes, tie/ribbon, equipped stone). Japanese Romanization Typing : English translated texts and romanization examples for non-Japanese players, Japanese positive words/sentences typing, multiple difficulty setting based on KPM (keystrokes per minute) and accuracy JRPG Based Battle System : Command based, turn based, strengths and weaknesses between Elements, equipment items Consideration for Typist : In order to concentrate on typing, cheat equipment is available from early game which reduces difficulty only in the command selection part. Details - Highly Flexible Character Creation You can edit names, portraits, and colors (skin, hair, eyes, tie/ribbon, equipped stone) for all 3 party members. For eyes, you can set different colors for left and right. You can also specify colors directly with RGB values. Let's have a fun for creating your own party members! The number of available portraits is 10. (5 boys, 5 girls) Of course, you can edit colors (skin, hair, eyes, tie/ribbon, equipped stone) for all portraits. Let's roleplay with your favorite colors! Details - Japanese Romanization Typing You need to type specified words or sentences to cast the special 'psionic power' against enemies. All words and sentences are Japanese ones. What you need to type is Japanese positive words/sentences. You need to type these as romanized alphabets. English translated texts are also available. But, even if your language is non-Japanese, what you need to type is romanized Japanese texts. Following screenshot is an example of 'sentence' typing. Since number of required keystrokes increases, you can aim for multiple ally's turns if your typing speed and accuracy is high. But the same can be said for enemies. So, please be careful not to lose time due to mistypes. This typing game refers typical Japanese IMEs about the behavior of Japanese romanization. It means this game supports multiple and flexible romanization systems. So, it will be useful if you are going to try to learn Japanese input system with Hiragana. For example, when you need to type Japanese word 'しちふくじん', both of following romanization systems are supported and will be accepted. Kunrei-shiki like romanization input: 'sitihukuzinn' Hepburn like romanization input: 'shichifukujinn' This game supports multiple difficulty setting based on KPM (keystrokes per minute) and accuracy. So, both beginners and experts can enjoy this typing game. In this game, the 'Typing Level' is calculated from your KPM and accuracy. Formula of Typing Level calculation : Typing Level = KPM × accuracy^3 For example, if your typing speed is 100 KPM (keystrokes per minute), When accuracy is 90% : 100 × 0.9 × 0.9 × 0.9 = Lv. 73 When accuracy is 100% : 100 × 1.0 × 1.0 × 1.0 = Lv. 100 If you select the Difficulty based on your Typing Level displayed on Stage Selection menu, you will be able to play this game with fun. Details - JRPG Based Battle System When you have succeeded typing some words/sentences, you can select moves like as turn-based JRPG. You need to consider strengths and weaknesses between Elements. But this game is not only RPG but also typing game. So, the battle system is not so complex. Automatically calculated expected damage value (such as in following screenshot) will also support your tactical consideration. The Union Gauge in bottom-left of the screen increases +1.00 (Typical. Up to +4.00 by equipment items) for each ally's turn. Once Union Gauge reached full (8.00), you can select the special move 'Union'. When you select this move, all 3 allies cast pure heavy damage to enemies, and all allies' HP is fully recovered. Let's try to use this special move to annihilate the enemies! You can change ally's Elements, Roles, Specializations with equipping 'Psycho Stones'. You can also change ally's move set with equipping 'Gem Stones'. You can get these equipment items as rewards of each stages (levels). Also, you can buy equipment items with in-game currency called 'PP (Psycho Points)'. You can check the enemy information for each stage (level) in 'Stage Selection' menu. You need to consider changing equipments based on this information. Let's think the best tactics for each stage! Details - Consideration for Typist If you expects this game as 'Truely Typing Game', the JRPG Based Battle System would be unnecessarily and disturbing feature for you... If you think so, this Cheat Feature is VERY recommended for you. (If you want to use this cheat function, you need to clear at least Stage (Level) #1 to #4 in order to learn the game rule based on some tutorials.) If you use these cheat equipments, you can use special move 'Union' for every ally's turn, and other moves are also reinforced very much. The RPG battle system will turn into 'just boring work'. It means you can concentrate typing words or sentences! Of course, these equipments can only cheat battle system. These equipments can NOT cheat typing part itself. If your typing is slow or inaccurate, enemies will attack your party members. (On the other hand, if you want to cheat typing but don't want to cheat the battle part, it is recommended to set the Difficulty to EASY.) Note that it affects Steam Achievement because these strongest equipments are originally rewards of end contents (= Stages after cleared story scenario). So, be careful, you would be found out cheating from your friends due to your 'unnatural' achievement order of this game ...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2166220/header.jpg?t=1671462031",
    "Price": 6.79,
    "Developers": "Yakuentei",
    "Publishers": "Yakuentei",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2166220/ss_fe8f3bf0d990f83c50f7c6c459ed0bd33ba0c276.1920x1080.jpg?t=1671462031,https://cdn.akamai.steamstatic.com/steam/apps/2166220/ss_6817749a3c05849b5167defc2b0188539f1e7b17.1920x1080.jpg?t=1671462031,https://cdn.akamai.steamstatic.com/steam/apps/2166220/ss_366da5a9e827acef56747220363d60ac92a73a2f.1920x1080.jpg?t=1671462031,https://cdn.akamai.steamstatic.com/steam/apps/2166220/ss_9b4096ec718edc6669de3686e816b9e00635e82b.1920x1080.jpg?t=1671462031,https://cdn.akamai.steamstatic.com/steam/apps/2166220/ss_1f1582da261651ae000210aa3622b6ae0acea5f6.1920x1080.jpg?t=1671462031,https://cdn.akamai.steamstatic.com/steam/apps/2166220/ss_3b0ca775b391a7c30003b60dcf555f3f1596fcb1.1920x1080.jpg?t=1671462031,https://cdn.akamai.steamstatic.com/steam/apps/2166220/ss_2e7bf431dcdbf2f6dd231193365138d3d0596c72.1920x1080.jpg?t=1671462031,https://cdn.akamai.steamstatic.com/steam/apps/2166220/ss_153078411b08e21d9c85a2f89c1c4c5637ccdf20.1920x1080.jpg?t=1671462031,https://cdn.akamai.steamstatic.com/steam/apps/2166220/ss_ef14840876bd043fe18b79814865082c25e8e692.1920x1080.jpg?t=1671462031,https://cdn.akamai.steamstatic.com/steam/apps/2166220/ss_fdc6c7e699ce4d2fabb0cb716ace79b18dc7df83.1920x1080.jpg?t=1671462031",
    "Slug": "students-of-light-bonds-typing-rpg-with-character-creation",
    "Meta Title": "Students of Light Bonds - Typing RPG with Character Creat...",
    "Meta Description": "Looking for information on Students of Light Bonds - Typing RPG with Character Creation -? Check out the release date (Dec 19, 2022), developer insights...",
    "Alt Text Image": "Official header image for Students of Light Bonds - Typing RPG with Character Creation - game - Steam 2166220",
    "Canonical URL": "https://gusku.site/game/students-of-light-bonds-typing-rpg-with-character-creation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Students of Light Bonds - Typing RPG with Character Creation -\", \"description\": \"Looking for information on Students of Light Bonds - Typing RPG with Character Creation -? Check out the release date (Dec 19, 2022), developer insights...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Yakuentei\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Yakuentei\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2166220/header.jpg?t=1671462031\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}