{
    "AppID": 2218370,
    "Name": "Thunderbolt Poker",
    "Release date": "Dec 7, 2022",
    "About the game": "Thunder Bolt Poker brings all poker players thrilling Online Card Games of Classic Texas Hold'em &amp; Omaha for free! Without going to a Vegas casino yourself, you can now compete with the best poker players around the world in Thunder Bolt Poker 24/7 for the ultimate gaming experience, anywhere, anytime!! THUNDER BOLT POKER FEATURES 1. VARIOUS GAME MODES AVAILABLE! Classic Texas Hold'em and Omaha A classic never goes out of style. The most popular free online card games, Texas Holdem and Omaha, are available on Thunder Bolt Poker. Hit a huge jackpot to keep your burning passion while playing the Classic Texas Hold'em and Omaha within Cash Games! 6+, PLO5, and AOF Looking for something different than regular cash games? The fun 6+, PLO5, and AOF must suit your taste! Come and enjoy your favorite game mode in Cash Games. Bigger Bets, Bigger Wins! Challenge Yourself in Thunder Bolt Poker's 5-Max SNGs If you're into tournaments, join our exciting Sit &amp; Go's now! Feel the free poker game thrills by competing in the real-time leaderboard! Challenge rivals and aim for the electrifying championship! Play now and prove that you are the true poker stars! 2. BECOME A LEGEND BY CLIMBING UP THE LEAGUES! Thunder Bolt Poker offers a unique League challenge! Rank up for a greater chip bonus in games! Play Texas Holdem and accumulate League Points to promote weekly or trigger the Fast Track to advance immediately! 3. COLLECT SERIES OF RINGS BY PLAYING POKER! Fight for the ultimate glory of Rings! Join Thunder Bolt Poker and play in any game mode (Cash Games or SNG) to earn Ring Fragments! Collect Ring Fragments to forge a Ring, a symbol of a top poker player like the pros in the World Series of Poker! 4. DAILY FREE CHIPS AWAIT! Daily Missions - Complete daily missions to get more rewards. Missions refresh weekly. Time Bonuses - Collect free chips every four hours. Rewarded Ads - Watch video ads to earn lottery spins and win huge prizes! Jackpot Rewards - Big win! Hit a full house to get huge jackpot rewards! 7-day Check-in Rewards - Check-in for 7 days to double your rewards and spin the Lottery Slot for a huge prize! Bankruptcy Protection - Encountering downswings and losing chips? We've got you covered with our Bankruptcy Protection system! 5. SAFE AND FAIR GAMING ENVIRONMENT Our online Mute &amp; Report features help to prevent inappropriate and cheating behaviors in this game, thus safeguarding your gaming environment. It's our goal and effort to provide a secure and fair platform for all players to compete and play. ABOUT THUNDERBOLT POKER Thunderbolt Poker is intended for an adult audience for entertainment purposes only. Success at online poker games does not reward real money prizes, nor does it guarantee success at any real money gambling.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2218370/header.jpg?t=1670470000",
    "Price": 0.0,
    "Developers": "Formirai Co., Ltd.",
    "Publishers": "Formirai Co., Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2218370/ss_1a38613de7125fd07eabf1ed2cf36d7c26e9bacf.1920x1080.jpg?t=1670470000,https://cdn.akamai.steamstatic.com/steam/apps/2218370/ss_34c0bd38afc797c1279b0dea3fcb4f5372f756c4.1920x1080.jpg?t=1670470000,https://cdn.akamai.steamstatic.com/steam/apps/2218370/ss_db2c6d6ab69f826904d0ff1c7c63c8ad5e2f2836.1920x1080.jpg?t=1670470000,https://cdn.akamai.steamstatic.com/steam/apps/2218370/ss_ed36438d0b5206525b9069379e799a33be838cbd.1920x1080.jpg?t=1670470000,https://cdn.akamai.steamstatic.com/steam/apps/2218370/ss_284ae79e810ecde2b411ef27cad93fc6e47bcc8e.1920x1080.jpg?t=1670470000,https://cdn.akamai.steamstatic.com/steam/apps/2218370/ss_1d74e52f98af8f4fe6431cd302c5cd963d4f42f0.1920x1080.jpg?t=1670470000,https://cdn.akamai.steamstatic.com/steam/apps/2218370/ss_ec2bcbbed3c26b87162efa146c01c50a2712bb68.1920x1080.jpg?t=1670470000,https://cdn.akamai.steamstatic.com/steam/apps/2218370/ss_bbb88b007bcda13c08e2596ecf785f20e418443d.1920x1080.jpg?t=1670470000",
    "Slug": "thunderbolt-poker",
    "Meta Title": "Thunderbolt Poker: Dec 7, 2022, Formirai Co., Ltd. and Fu...",
    "Meta Description": "Looking for information on Thunderbolt Poker? Check out the release date (Dec 7, 2022), developer insights from Formirai Co., Ltd., and a complete game ...",
    "Alt Text Image": "Official header image for Thunderbolt Poker game - Steam 2218370",
    "Canonical URL": "https://gusku.site/game/thunderbolt-poker",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Thunderbolt Poker\", \"description\": \"Looking for information on Thunderbolt Poker? Check out the release date (Dec 7, 2022), developer insights from Formirai Co., Ltd., and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Formirai Co., Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Formirai Co., Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2218370/header.jpg?t=1670470000\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}