{
    "AppID": 2176130,
    "Name": "Tower! Simulator 3",
    "Release date": "Dec 13, 2022",
    "About the game": "Introducing the latest generation of ATC simulator, that provides a level of immersion like no other. With advanced voice recognition, custom modelled and detailed airports and state-of-the-art lighting, geometry and textures. Watch planes take-off and land from the tower or down on the ground and feel like as if you were really there. Tower! Simulator 3 is the gold standard for air traffic control simulation. This new version will leave you shocked! Designed to allow aviation fans, enthusiasts, ATC students and anyone interested in air traffic control to play and practice controlling even from the comfort of your home. Features - Greatly customizable (radars, schedules, data strips, airplane characteristic) - Advanced voice recognition - Realistic pilot voices provided by Acapela Group - Even more available commands - 3D Tower view - Multi-monitor support - Commercial version of the software is used for air traffic controller training Detailed Real-world Locations Using OSM (Open Street Map) we are able to model most of the surrounding area with never seen before detail. Realistic lighting, simulated in real-time, with technology used by movie studios. Tower! Simulator 3 will have the most accurate lighting with cinematic fidelity. We’ve made this simulator to be the true benchmark for visuals in air traffic control simulation, which will include famous airports from around the world. Airports Some airports will be included in the game by default, so you will have them available from the first moment. The first one of the airports to be included in Tower! Simulator 3 will be Raleigh-Durham (KRDU) in North Carolina. It has a main runway (5L-23R), a parallel runway (5R-23L) and a short runway (14-32), to serve its fluid regional traffic. Another confirmed air terminal is the all time favorite at our team – St. Thomas Cyril E. King International Airport (TIST), with a single runway (10-28) but with the spectacular natural surroundings of a Caribbean island. You can see preview images of this scenario in previous articles on this blog. The list of airports is not yet finished… more to come! Radar, Terrain, Strips The terrain inside the sim doesn’t use satellite images anymore. This means basically any airport in the world can be built and implemented in the base simulator. The ground and the terrain use 16x more details than before. This helps to keep most details sharp and enjoyable even at a close range. So content creators and streamers, make sure to have your streams ready to show off! When we say 3D, we mean it! Imagine you’re sitting in the control tower. With the radars and displays in front of you. Now that’s the feeling we’re looking to bring to you. Ground control is vital to the smooth operation of the airport, because this position impacts the sequencing of departure aircraft, affecting the safety and efficiency of the airport’s operation. In Tower! Simulator 3 the ground radar has been updated with a modern look and feel, allowing the controller to see the full airport. You will also be able to zoom into areas on sub screens. The strips have become now paperless. It’s your choice to move and edit them to your liking. Each airport can have a customizable digital strip display. Designed to look and operate like an analogue strip board. This will be a significant change with substantial benefits. Making it easier for controllers to handle the traffic. Weather Tower! Sim 3 has brand new weather display designed to see weather data and to change active runways. This is a feature we were keen to add to the new simulator. Shortcut keys to focus and zoom into any windows or stand up to have a better look at the airport. This is just going to make ground control so much easier. Dynamic lighting Used in Tower Simulator 3 – is a type of simulated lighting where lighting calculations are computed in real time. Therefore, using dynamic lighting enables on-the-fly lighting calculations accounting for real-time variations, such as change in game state, narrative, player’s and characters’ positions and camera movement. After we started working on our light simulation and then quickly realized it was missing something. Therefore we teamed up with feature film visual effect professional and using the same tools and measurement that VFX teams are using on movies. This allows FeelThere to bring you the lighting that your brain would expect on the big screen. Customization or Modding In response to the suggestions and requests of our current loyal simmers, we are going to bring in the possibility of configuring and customizing the simulator. Would you like to be able to assign different runways for specific aircraft, such as freighters? We are making it possible! You can select the arrival runway by applying the corresponding filter for freighters, wide or narrow body, regional, business etc. This is not just a variant of the game that will make it more changeable, it will also require you to exercise decision-making and manage an extra element of stress by using more than one runway for arrivals, for example. In addition to being able to configure the operation of your airport, you will also customize the electronic strips of each airport through independent and separate configuration files (csv). You will have the possibility to establish the number of columns, functions of the electronic strip and even the information of the strip for each one of the blocks. You can also unleash your creativity and add a background image. We will also give you the chance to configure and assign special airline liveries. Through the schedule (cfg) file it will also be possible to define the type of flight, such as cargo or regional for example. The new airline (cfg) file puts at your fingertips the variables to be defined for the airlines, so as the following image shows, you can assign up to the country of origin of each airline. Regarding the airport and its terminals, You can define terminals according to the name of the airline, international flights, national flights, by special colors, cargo or regional. All of this can be configured from the terminal (cfg) file. Built for Professionals This is a detailed simulation also used by professionals for training. Use voice commands to communicate with the pilots and sit in the tower with all the tools that a real air traffic controller would have.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2176130/header.jpg?t=1670949638",
    "Price": 50.99,
    "Developers": "FeelThere",
    "Publishers": "FeelThere",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_085a1bdcb671103db1ca4e03c2636d1d2fe6d802.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_0f9048a01c75e1914386d95c325352f9b5550a3c.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_e1d333bc1ed8f417b763e5f57d09a8ee2d71c614.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_9e420c531faeaff0e9a5c5ebdc561845f76e77da.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_ffadc497ec4104a49cca93eca32ec21a54cc47c5.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_18fd82ff2304623d99ec6088115ebf797eedc874.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_b492cdbe0e44d62733431780d04a92a4c637bfec.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_f6fad7ffb8aabac95309a8e91aa531e1727deaba.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_24ed81562f2cdc16029d879d83924bbe4c22394c.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_d77f50b48f83d37ba1a9f61887438b8dfb4f8af0.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_14ed5697b7698a8bba3e31eb3731799be1f3893c.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_5903887866201892c67496fb5178cb6c3392110b.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_74d295e13de71662a455334974ece25f032bddf0.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_ed6d46b80ccca5f749b31164e9fa7a8fc49636e6.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_fe247ba5803b25a847ae1c5736a86212e38ebde8.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_06a65827ed91ff9c408f0b24c4cd08df968de0f3.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_8921f82cef4c7d3dc21e0e9df9beda946040385a.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_6a531b2beee39a664fab63597b66412d8a672401.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_393cb0d1524a9d01bb0c5ead12f62b5e6cdf946b.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_2991d114d0ec6eff631bea0722fa7e7049b1044d.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_d8c1fcfc45a24b2ce28409ebfe8484f12854dc4e.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_349a51f1a69c8c0fca00e4ede63a7eedb473429b.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_c123f5b24dbb5266990ec5e18051d99e9778da9b.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_c4445f88e0c35a5dd89897d07aa6b7e44c4788d1.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_bc5d80de044382839e3a94df5e580557a24f9735.1920x1080.jpg?t=1670949638,https://cdn.akamai.steamstatic.com/steam/apps/2176130/ss_d384aeeed0b185e3fc54901663b34dab96fd0aad.1920x1080.jpg?t=1670949638",
    "Slug": "tower-simulator-3",
    "Meta Title": "Tower! Simulator 3: Dec 13, 2022, FeelThere and Full Over...",
    "Meta Description": "Looking for information on Tower! Simulator 3? Check out the release date (Dec 13, 2022), developer insights from FeelThere, and a complete game summary.",
    "Alt Text Image": "Official header image for Tower! Simulator 3 game - Steam 2176130",
    "Canonical URL": "https://gusku.site/game/tower-simulator-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tower! Simulator 3\", \"description\": \"Looking for information on Tower! Simulator 3? Check out the release date (Dec 13, 2022), developer insights from FeelThere, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"FeelThere\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FeelThere\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2176130/header.jpg?t=1670949638\", \"offers\": {\"@type\": \"Offer\", \"price\": 50.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}