{
    "AppID": 2227690,
    "Name": "Vampiric Tower Remix",
    "Release date": "Dec 14, 2022",
    "About the game": "Victoria the Vampire ascends the Vampiric Tower once more! A brand-new game featuring rooms from both Vampiric Tower 1 &amp; 2, as well as plenty of new ones. Plus, it has all new graphics and music! And it's much easier than 2! For the uninitiated, Vampiric Tower is a box-pushing puzzle game. The original game was made way back in 2000, when I was 16. Vampiric Tower Remix is the best &amp; definitive entry of the series! Push the boxes around to block the spells from the Pumpkins and the Ghosts. Try to pick up all the vials in each room without getting zapped, and then get to the exit! If you do get zapped, do not fret! You have unlimited lives in this game, so just try again! Turn into a bat to fly over spikes, water, pots, and other stuff in your way! Cast ice spells to turn the denizens of the tower into ice cubes that you can push around! Rock out to amazing chiptune remixes of Mozart classics! Featuring 15 worlds with 8 rooms each, for 120 rooms total. The 15 worlds are divided into 5 episodes of 3 worlds each. The worlds in each episode can be tackled in any order. Let’s check out those worlds! The Old Tower : Featuring classics from the original game! Get re-acquainted with the Pumpkins and Ghosts! Jiangshi Junction : The Jiangshis hop around and stop in place if they touch Victoria. Faerie Gardens : Faeries move back and forth to block Victoria’s progress. Nothing a well-placed ice spell can’t fix! Magick Library : Say hello to the Witches! They are intently reading their books, but when the last vial is collected, look out! Tomb of the Sun : The Mummies can be frozen, but they’ll fall apart afterward. Since you can only freeze them once, make it count! Bodacious Botany : These alien plants from Venus just won’t stop re-growing! Medusa’s Lair : Like the Witches, the Snakes wake up when all vials are collected. Their fireballs move pretty fast! Atlantean Shrine : The Shades cast ice spells, just like Victoria! Lil’ Bot Factory : The industrious Lil’ Bots walk back and forth, pushing boxes, pots, flasks, or anything else they find. Ethereal Palace : Imps like to bop back and forth and get in the way. Silly Imps! World Tree Roots : The Sorceresses have mastered a spell that can travel through pillars and pots, just like the Pumpkins and Ghosts! Luckily, it moves much slower than theirs. The Pearly Gates : The Doubles are perfect copies of Victoria. Whatever she does, they follow! Awesome Alchemy : Wisps move about and disintegrate when they touch Victoria. They have no resolve! All Hail Mars : The formidable Knights are invincible and immune to all magic. The Grand Finale : Put your skills to the test in the final world! Can Victoria make it through the 120 rooms of this new tower? Play the game and find out!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2227690/header.jpg?t=1671059487",
    "Price": 5.99,
    "Developers": "Michael Behrens",
    "Publishers": "Michael Behrens",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2227690/ss_409241b7dd5da9960d317c42519a76ce9dd6a105.1920x1080.jpg?t=1671059487,https://cdn.akamai.steamstatic.com/steam/apps/2227690/ss_b706fccb334f33f471e1790695995c073e0dca71.1920x1080.jpg?t=1671059487,https://cdn.akamai.steamstatic.com/steam/apps/2227690/ss_5c8796b3677c4e0bf549ecdc9c995fcb520d851c.1920x1080.jpg?t=1671059487,https://cdn.akamai.steamstatic.com/steam/apps/2227690/ss_49052e40597d14d17f48afd04f39c34b6a6d255e.1920x1080.jpg?t=1671059487,https://cdn.akamai.steamstatic.com/steam/apps/2227690/ss_3c7dc426e0616451979c73a253af5b11af8452c4.1920x1080.jpg?t=1671059487",
    "Slug": "vampiric-tower-remix",
    "Meta Title": "Vampiric Tower Remix: Dec 14, 2022, Michael Behrens and F...",
    "Meta Description": "Looking for information on Vampiric Tower Remix? Check out the release date (Dec 14, 2022), developer insights from Michael Behrens, and a complete game...",
    "Alt Text Image": "Official header image for Vampiric Tower Remix game - Steam 2227690",
    "Canonical URL": "https://gusku.site/game/vampiric-tower-remix",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Vampiric Tower Remix\", \"description\": \"Looking for information on Vampiric Tower Remix? Check out the release date (Dec 14, 2022), developer insights from Michael Behrens, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Michael Behrens\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Michael Behrens\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2227690/header.jpg?t=1671059487\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}