{
    "AppID": 1974110,
    "Name": "WestFallen",
    "Release date": "Dec 20, 2022",
    "About the game": "Please Read the Early Access Blurb Before Buying! The game is currently only a single player arena wave mode. Enter the world of WestFallen You are a nobody, destined to grow up and die a nobody. One fateful day, you are thrust into the midst of a war, watching on as your small village is invaded and the people you care about killed in front of you. Narrowly escaping, you set forth on a path of vengeance and destruction. A kingdom at war WestFallen, a kingdom in the heart of the continent, is a land full of promise, potential, and beautiful landscapes. The son of the king has taken his rightful place on the throne after his father stepped aside and has gone missing, leaving the kingdom in turmoil and uncertainty. Will this new king rule justly like his father, or will he put his own personal interests ahead of the kingdom? This uncertainty is what gave the neighboring kingdom of Lightgrave license to declare war, before the new king could meet with his generals and come to grips with the responsibility of defending the kingdom. The son of a local foreman, you watch helplessly as the Lightgrave murder your friends and family, burning your village to the ground, in a surprise attack marking the start of a brutal war. Left without home, family, friends, or any real purpose, you look to join the war to take revenge on those who robbed you of your life. However, not all is as it seems... With all of the death and destruction being caused, an ancient looks to gather it's strength to take advantage of the war. Features Compelling Open World: From the foothills of the mountains, to the glistening buildings of the capital, explore a beautiful open world where around every corner is a new fight, friend, or adventure to interact with! Character Development: Starting slowly, but ramping up into wave after wave of climactic action, the story of WestFallen will grip you with the highest of highs, and the lowest of lows. Throughout all of it, level up your skills, master your combat style, unlock perks, and forge and upgrade equipment to better yourself. Customization: Fight your enemies, take their loot, and parade around in the most stylish of it. You can equip whatever you want, and reap the benefits of that gear. You can customize your avatar as well, and play through the game as yourself, or don't. It is an RPG after all. Fight How You Want: WestFallen lets you make the choice as to how you approach each situation. If you want to go in sword swinging, shield smashing, you can skill and equip for it. Maybe you want to unleash the elements on your opponents, that too can be skilled and equipped for. Support For Ultrawide Monitors: This game was developed on one, so it would be foolish not to let players use their ultrawide monitor too!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1974110/header.jpg?t=1671837279",
    "Price": 16.19,
    "Developers": "Ninja Software Studio",
    "Publishers": "Ninja Software Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1974110/ss_9bac4fef8bac6b795793b34967c9e57ef2ddf9e3.1920x1080.jpg?t=1671837279,https://cdn.akamai.steamstatic.com/steam/apps/1974110/ss_8b6519d73fd97efc5ff60eeb31e5d831c9fb53ba.1920x1080.jpg?t=1671837279,https://cdn.akamai.steamstatic.com/steam/apps/1974110/ss_b89556dc11bb743bca8d2bca75a878cb836501dd.1920x1080.jpg?t=1671837279,https://cdn.akamai.steamstatic.com/steam/apps/1974110/ss_4ea46bd7db3dfb496efff8729703f41b9486d494.1920x1080.jpg?t=1671837279,https://cdn.akamai.steamstatic.com/steam/apps/1974110/ss_8fcdd81a0d6cb78bc0233f2afcdb205aec2c4a53.1920x1080.jpg?t=1671837279,https://cdn.akamai.steamstatic.com/steam/apps/1974110/ss_b7d645af9f55a1f724e0407a66cec2ceb159d1a4.1920x1080.jpg?t=1671837279,https://cdn.akamai.steamstatic.com/steam/apps/1974110/ss_de546b00da1e8c345a3a855a9e56fd595bb1d141.1920x1080.jpg?t=1671837279",
    "Slug": "westfallen",
    "Meta Title": "WestFallen: Dec 20, 2022, Ninja Software Studio and Full ...",
    "Meta Description": "Looking for information on WestFallen? Check out the release date (Dec 20, 2022), developer insights from Ninja Software Studio, and a complete game sum...",
    "Alt Text Image": "Official header image for WestFallen game - Steam 1974110",
    "Canonical URL": "https://gusku.site/game/westfallen",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"WestFallen\", \"description\": \"Looking for information on WestFallen? Check out the release date (Dec 20, 2022), developer insights from Ninja Software Studio, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ninja Software Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ninja Software Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1974110/header.jpg?t=1671837279\", \"offers\": {\"@type\": \"Offer\", \"price\": 16.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}