{
    "AppID": 2131430,
    "Name": "Wings of The Universe",
    "Release date": "Dec 17, 2022",
    "About the game": "Wings of The Universe is an indie game inspired by game titles 'Space Rangers 2: Reboot' (PC game), 'Avorion' (PC game) and 'Interstellar Pilot' (mobile game). Wings of The Universe is a game full of battles, diplomacies and trades. You can be a miner, merchant, warrior, diplomat or a strategist. You can build an empire with your friends and fight your foes, or become a pirate to promote chaos within other empires. There is only one galaxy, so make sure your name goes down in its history! Important In order to play, you have to register via game client or the game website. The game server is located in Europe, Germany. Players outside of Europe might face high internet latency issues. Key Features: single global map (the whole galaxy divided to 25 sectors and each sector is divided to 25 systems) purely player based economy (there are no NPC shops, everything is made and sold by players) galaxy domination, fights for resources strategy and tactics - your type of equipment and chosen ship make the difference bonuses for playing with other players in a long-term faction and a short-term squadron chained missions and repeatable missions non-pvp zone on starting map Purely player-based economy The space is empty. It is up to the players to create factions and build the space stations they need. Each station have different items it can interact with. This makes each station type have their own list of shop items and their own factory lines, which can consume the input items (mostly commodities) to create the output items (other commodities, ships or pieces of equipment). Players then set-up the shop prices, which can exclude some items from being bought or sold by the station or the player. Strategy Your equipment and skills matter! There are limitations on the ship equipment, but there are many types of equipment to choose from. Should you use projectile or energy weapons? Should your protection be against projectile or energy weapons? Should you take smaller or a bigger ship? Every target is different and one equipment strategy might not work all the time. Knowledge and reconnaissance is a key to survive. It also makes a difference if your strategy involves other players who can help achieve your goals. Tactics 'I go first and you follow' can sometimes be followed by 'Are you sure about that?' and Wings of The Universe is no exception. Especially when it comes to wars between players. Be prepared to be ambushed at all times. The space is vast and an enemy can come from any direction! Take a friend with you who will cover you or act as a bait for your own forces to counter an ambush. Prepare a carrier ship full of players to be safely transported to the war zone and be ready to be launched straight into battle.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2131430/header.jpg?t=1671270807",
    "Price": 0.0,
    "Developers": "Lukas Tokar",
    "Publishers": "Lukas Tokar",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2131430/ss_4ea862ad88c3bad38f454490a63ba113f1a3215c.1920x1080.jpg?t=1671270807,https://cdn.akamai.steamstatic.com/steam/apps/2131430/ss_adb47c919d04ac0f75af071caed9fd605854988d.1920x1080.jpg?t=1671270807,https://cdn.akamai.steamstatic.com/steam/apps/2131430/ss_46bef2a73b5253d4e329a195098e1cbfba532327.1920x1080.jpg?t=1671270807,https://cdn.akamai.steamstatic.com/steam/apps/2131430/ss_8c4369e356d56140728360859ddf5da1aa01101b.1920x1080.jpg?t=1671270807,https://cdn.akamai.steamstatic.com/steam/apps/2131430/ss_49bf529a624e947dd76c20e5ead7b39dd26bb10b.1920x1080.jpg?t=1671270807,https://cdn.akamai.steamstatic.com/steam/apps/2131430/ss_bda912531b8cfd4dc00cafd9ada5e55747ffc67b.1920x1080.jpg?t=1671270807,https://cdn.akamai.steamstatic.com/steam/apps/2131430/ss_5e40abfceea8ce45078f8063e2af135232a65a5f.1920x1080.jpg?t=1671270807,https://cdn.akamai.steamstatic.com/steam/apps/2131430/ss_d0488a42cf99db10d23ffcba652a8d5369dfc80a.1920x1080.jpg?t=1671270807",
    "Slug": "wings-of-the-universe",
    "Meta Title": "Wings of The Universe: Dec 17, 2022, Lukas Tokar and Full...",
    "Meta Description": "Looking for information on Wings of The Universe? Check out the release date (Dec 17, 2022), developer insights from Lukas Tokar, and a complete game su...",
    "Alt Text Image": "Official header image for Wings of The Universe game - Steam 2131430",
    "Canonical URL": "https://gusku.site/game/wings-of-the-universe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wings of The Universe\", \"description\": \"Looking for information on Wings of The Universe? Check out the release date (Dec 17, 2022), developer insights from Lukas Tokar, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lukas Tokar\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lukas Tokar\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2131430/header.jpg?t=1671270807\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}