{
    "AppID": 2217550,
    "Name": "Wizard's Wheel 2",
    "Release date": "Dec 23, 2022",
    "About the game": "The Dimension is in peril in this idle RPG, inspired by retro, turned based role playing games. Wizard's Wheel 2 is an epic, retro, pixel-art game, with idle/incremental mechanics and progression. With roughly 80 heroes to recruit, 150 base item types with randomly generated additional modifiers to seek, upgradable wizard powers to grant additional support, item crafting, mini-games and more, Wizard's Wheel 2 offers you limitless ways to play and customization for your chosen adventuring party. Play actively by selecting hero commands, boosting game speed with the wizard's wheel, and playing the unlockable dimensional deck mini-game, or play idly by enabling auto-battle, and letting your heroes do what they do best. As the powerful Wizard of Time, you'll salvage Time Mana from bosses slain, and use it to build statues in the Temple of TIme, granting powerful, permanent upgrades. Progress farther during each attempt at defeating a particular map level by collecting and upgrading equipment, recruiting new heroes or leveling up existing ones, upgrading temple statues and unlocking wizard powers, until you're finally able to conquer and save your dimension Features Include: Idle or Active Game-play - Gain various additional boosts and buffs by participating more often, or let your heroes battle until defeated using Auto-Battle. Incremental Numbers - Grow in power, exponentially, using any of the various systems in place, to deal damage-numbers with more 0's than ever. Tons of Heroes - Customize your 4-hero party by unlocking and recruiting from roughly 80 base hero types, each with an upgraded version, unique active and passive skill, stat growth rate, equipment options and more. Choose from characters such as knights, skeletons, mechs, or, as rumor would have it, dragons. Tons of Loot - As you gain strength and slay increasing numbers of monsters, you'll gain tens, hundreds, even thousands of chests on a game run, with randomly generated items. And don't worry! Wizard's Wheel 2 has a built-in... Loot Filter - Don't want to sit and sell dozens of items after every run? You can configure which items are auto-sold using various customizable toggles, once too much loot drops for your liking. Upgradable Village - Unlock crafters, recruitment areas, item shops, training facilities and more by building and upgrading buildings in your village. Item Crafting - Upgrade your Massive Broadsword of Quick Strikes by improving its bonus level at the blacksmith, its item tier at the manasmith, or its quality with whetstones at the alchemist. Is it socketed? Place an upgradable gem in it for extra elemental damage. Oh, and don't forget to imbue it with an Ascension Token, so that it becomes eternal, no matter what dimension you're in! Altered Gameplay with Timelines - Discover more than 20 alternate timelines, each with game-changing modifications to characters, enemies, items and more. Each timeline has unique items and/or item modifiers only available while adventuring in them. Daily Dungeon - Fight in the Inter-dimensional (or Daily) Dungeon, which lets you take your strongest party as far as they can reach, with its own set of unique loot to claim based on progress each day. Pantheon - Challenge a series of increasingly difficult boss enemies, granting additional permanent buffs and obtainable equipment. Dimensional Deck - Unlock and play a solitaire mini-game using the dimensional deck while on a run with your heroes, granting bonus multipliers to gold, time mana and loot, as well as granting other unique, immediate effects. Unlock and upgrade cards in your dimensional deck by conquering zones with various heroes. Capture Hero Skills with Skill Gems - Create countless hero configurations by capturing the skills of previously unlocked heroes in Skill Gems, granting those skills to any hero which equips them. Pets - Acquire eggs from slain enemies and place them into your hatchery, in order to obtain pets. Pets gain levels while incubating at the hatchery, and each grant up to 3 buffs to help your party advance while active. Breed pets of opposite genders to increasingly powerful buffs. Seasonal Timelines - Participate in seasonal events in order to battle unique enemies and unlock additional characters and loot. And more secrets to uncover... Note: This game requires an internet connection in order for offline progress to be enabled. Wizard's Wheel 2 is free to play. Some permanent boosts are available for a one-time cost. However, gems, the premium currency, can be found in game. There are NO characters, items, or any other areas of game content which require in app purchasing. (Note: A hero acquired with gems is then permanently unlocked.)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2217550/header.jpg?t=1671815189",
    "Price": 0.0,
    "Developers": "Winding Clock Games",
    "Publishers": "Winding Clock Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2217550/ss_ba777c14bd18c3600c632428b34e9f8714bb7ad9.1920x1080.jpg?t=1671815189,https://cdn.akamai.steamstatic.com/steam/apps/2217550/ss_e4f8249469fdea522d1145b3b747f6c4fe6ff952.1920x1080.jpg?t=1671815189,https://cdn.akamai.steamstatic.com/steam/apps/2217550/ss_d4183a65db7d00e53dd73f7d5f0f807cf8225db0.1920x1080.jpg?t=1671815189,https://cdn.akamai.steamstatic.com/steam/apps/2217550/ss_cb4b39282fe808e8dfed89d14de43889c940fd5a.1920x1080.jpg?t=1671815189,https://cdn.akamai.steamstatic.com/steam/apps/2217550/ss_5f6ede87c372ec5d5b13ed6e83bf8946d7e5451d.1920x1080.jpg?t=1671815189,https://cdn.akamai.steamstatic.com/steam/apps/2217550/ss_26abe5d009228d3de1cf5618ac7c75e71bf4f5d6.1920x1080.jpg?t=1671815189,https://cdn.akamai.steamstatic.com/steam/apps/2217550/ss_33be0f87d69df9ee9b800a80a64cb660d484ea9a.1920x1080.jpg?t=1671815189,https://cdn.akamai.steamstatic.com/steam/apps/2217550/ss_15c155a9c2535c998e6e4c312b5127537ff3f8b3.1920x1080.jpg?t=1671815189,https://cdn.akamai.steamstatic.com/steam/apps/2217550/ss_2f3ae0c9549ddbf9989d4ecc97c11903c556d4fa.1920x1080.jpg?t=1671815189",
    "Slug": "wizard-s-wheel-2",
    "Meta Title": "Wizard's Wheel 2: Dec 23, 2022, Winding Clock Games and F...",
    "Meta Description": "Looking for information on Wizard's Wheel 2? Check out the release date (Dec 23, 2022), developer insights from Winding Clock Games, and a complete game...",
    "Alt Text Image": "Official header image for Wizard's Wheel 2 game - Steam 2217550",
    "Canonical URL": "https://gusku.site/game/wizard-s-wheel-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wizard's Wheel 2\", \"description\": \"Looking for information on Wizard's Wheel 2? Check out the release date (Dec 23, 2022), developer insights from Winding Clock Games, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 23, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winding Clock Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winding Clock Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2217550/header.jpg?t=1671815189\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}