{
    "AppID": 1866570,
    "Name": "Xross Dreams",
    "Release date": "Dec 25, 2022",
    "About the game": "What is your violence? If left with nothing else to do, what will you do to get your way with the universe? Is it your fists? Is it your power? Is it your ideas? Can you shape your violence into different forms? Xross Dreams is a new type of violence. Xross Dreams is also a game. Xross Dreams is also a tool. Xross Dreams is also a universe. Xross Dreams is also a story. Xross Dreams is a multi-dimensional ascension utility for the mind, heart, and soul. If you're the loner type, you may pick a dreamer and follow their way through the universe as a series of puzzle games that you've never seen or played before but already might understand for some reason. If you don't go alone, you will pick a pair of dreamers and carve a path of understanding through your entire community. Xross Dreams is a hybrid action puzzle-versus battle game. It has many modes. It is a 2v2 fighting game with many characters. It is a puzzle game that evolved into a new genre. It is set to a jazzy drum n' bass soundtrack that will empower and relax you. It can be played offline or online, with rollback netcode to guarantee a smooth experience. In Xross Dreams, everybody has their own violence. Each dreamer plays a distinct puzzle game, some of which you may find familiar. When a dreamer inflicts their attacks on other dreamers, they send their own specific type of violence that the opponent must understand and tolerate. Matchups are just as important as individual skill. Some dreamers push your screen up from the bottom. Some dreamers drop useless pieces from the top. Some dreamers send you pieces that open into new pieces. All of these and more are possible. In Xross Dreams, you aren't alone. You will find yourself in control of a team of 2 dreamers. You have the ability to switch between each of these 2 dreamers at will. You can only win by defeating all the dreamers on the opponent team before they do the same to you. Switching dreamers will open your mind to higher ideas and violent possibilities. You may even find yourself using abilities that manipulate the opponent's team if you're worthy of them. Xross Dreams is a journey of discovery. Do you remember back when games had secrets? Why did they have secrets? What changed about the way we played games 20 years ago compared to the current information age? Even if you look up all the answers, what does that teach you about your learning process? What if we had the chance to experience the Wild West of information about a completely new type of competition? What strategies or stories will we conjure? Xross Dreams opens your mind. It might be opening your mind right now. By coming into contact with this information, Xross Dreams can bless your consciousness with new ideas. The story of Xross Dreams is told with our lives, but the actual plot of Xross Dreams is told without words. How do you read a story with no words? All of this and more is possible. Features Single-Player Story Mode Head to Head PvP VS In-game Learning Tools Training Mode PvP Online Play 10+ Playable Characters 30+ Dogs Endless Potential Xross Dreams is coming very soon. Wishlist it or follow on Twitter for updates.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1866570/header.jpg?t=1672016900",
    "Price": 24.99,
    "Developers": "Starlight Studios Games",
    "Publishers": "Starlight Studios Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1866570/ss_617bcab97ceb0525448077c89700530eb2296cb1.1920x1080.jpg?t=1672016900,https://cdn.akamai.steamstatic.com/steam/apps/1866570/ss_8303afc5e935ee6766365a0d739f2be93b50aef0.1920x1080.jpg?t=1672016900,https://cdn.akamai.steamstatic.com/steam/apps/1866570/ss_4fe1e5388a991c48520dce1476b7d7821bdc23e2.1920x1080.jpg?t=1672016900,https://cdn.akamai.steamstatic.com/steam/apps/1866570/ss_63edd0131836ca839c4ef62dc98f9ae33c3d79e4.1920x1080.jpg?t=1672016900,https://cdn.akamai.steamstatic.com/steam/apps/1866570/ss_a8327392d57fa0b1766fe07a2aa1875bd23ec05b.1920x1080.jpg?t=1672016900",
    "Slug": "xross-dreams",
    "Meta Title": "Xross Dreams: Dec 25, 2022, Starlight Studios Games and F...",
    "Meta Description": "Looking for information on Xross Dreams? Check out the release date (Dec 25, 2022), developer insights from Starlight Studios Games, and a complete game...",
    "Alt Text Image": "Official header image for Xross Dreams game - Steam 1866570",
    "Canonical URL": "https://gusku.site/game/xross-dreams",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Xross Dreams\", \"description\": \"Looking for information on Xross Dreams? Check out the release date (Dec 25, 2022), developer insights from Starlight Studios Games, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Starlight Studios Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Starlight Studios Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1866570/header.jpg?t=1672016900\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}