{
    "AppID": 1964480,
    "Name": "Yami RPG Editor",
    "Release date": "Dec 8, 2022",
    "About the game": "Hi, I'm yami, I made this game editor in my spare time and plan to update it for a long time. It may be less accessible than RPG Maker and lacks learning materials, I'm sorry for that. Verbal promise before I release the EULA: the copyrights to the games you make with it belong to you in perpetuity. Yami RPG Editor is specially designed for making ARPG. It has two development modes, event and script. Newbies can choose the event mode for development. Games can be deployed to Windows and the Web. Scene Editor Supports scenes up to 512x512, automatic tiles, animation tiles and normal tiles. You can create actors, regions, light sources, animations, particles, parallax images, and tile maps. UI Editor Ability to visually design UI layout styles and interactions. Animation Editor Use the Timeline design mode to easily create sequence frame animations, simple skeletal animations, particle animations for actors and skills. It supports the paper doll system, and supports animation in any direction such as one-direction with flip, four-direction, eight-direction, etc. Particle Editor Simple particle editor for simulating weather, water, fire, smoke and more. File System Each file has a GUID, and files are read by GUID, so the filename and path can be changed at any time. Custom Attributes Actors, skills, states, equipments, items can customize the attributes. Add the attributes you want, and then use events or scripts to realize the function of attributes, you can also upgrade equipments and skills. High Performance I created 10,000 actors at random positions in a 512x512 scene for stress testing, and added AI to each actor that automatically searches for nearby enemies and fights (implemented with event commands), the FPS remains at 200. When actor collision system is turned on, the FPS is over 100. Create 1000 actors in a 128x128 scene with an average FPS of 1200. It means you can achieve a massive battle scene. (Test environment: CPU Intel i7 7700, Graphics GTX 1070) Script Plugin Using JavaScript as the scripting language, scripts can be used wherever events can be used, and they can call each other. The game program does not use any third-party javascript library. Free Development The game does not have specific gameplay logic, which requires users to implement through events or scripts. In other words, you can design the combat system yourself to a certain extent. In addition to the above-mentioned custom attributes, combat AI, casting skills, using items, equipping weapons all have corresponding event and script development modes. In short, it is very flexible to use. Matters Needing Attention The editor needs some time to test and fix bugs. If you want to use it stably, you can wait and see. Game program framework may change frequently during testing. English tutorials are not ready now. And the current version lacks game development related assets.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1964480/header.jpg?t=1670810809",
    "Price": 71.99,
    "Developers": "Yami Sama",
    "Publishers": "Yami Sama",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1964480/ss_1c1fd73d96218efc88c74fd1d5b43c3ae2d633cf.1920x1080.jpg?t=1670810809,https://cdn.akamai.steamstatic.com/steam/apps/1964480/ss_b7acd5d70006daa7a0224db23b8cf46ed8b78786.1920x1080.jpg?t=1670810809,https://cdn.akamai.steamstatic.com/steam/apps/1964480/ss_49fd2a24e9da79700f5c437131f568f41c181120.1920x1080.jpg?t=1670810809,https://cdn.akamai.steamstatic.com/steam/apps/1964480/ss_325a3859a007b714fc61ae5e15589bdc86522065.1920x1080.jpg?t=1670810809,https://cdn.akamai.steamstatic.com/steam/apps/1964480/ss_47f422ae003808787ca2c82a733c03c53c1fc361.1920x1080.jpg?t=1670810809,https://cdn.akamai.steamstatic.com/steam/apps/1964480/ss_4478be8ff5cb3397090d0cf122c30ea8a290705f.1920x1080.jpg?t=1670810809,https://cdn.akamai.steamstatic.com/steam/apps/1964480/ss_68fe58dd512c9cd269ccd9d2b890c7b4d0e94156.1920x1080.jpg?t=1670810809,https://cdn.akamai.steamstatic.com/steam/apps/1964480/ss_82f9fd9040c54af3e258a28edf55a51ddacf2e9e.1920x1080.jpg?t=1670810809,https://cdn.akamai.steamstatic.com/steam/apps/1964480/ss_2e41beee3089a084eb0c2587a5a400b8f876944c.1920x1080.jpg?t=1670810809",
    "Slug": "yami-rpg-editor",
    "Meta Title": "Yami RPG Editor: Dec 8, 2022, Yami Sama and Full Overview",
    "Meta Description": "Looking for information on Yami RPG Editor? Check out the release date (Dec 8, 2022), developer insights from Yami Sama, and a complete game summary.",
    "Alt Text Image": "Official header image for Yami RPG Editor game - Steam 1964480",
    "Canonical URL": "https://gusku.site/game/yami-rpg-editor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Yami RPG Editor\", \"description\": \"Looking for information on Yami RPG Editor? Check out the release date (Dec 8, 2022), developer insights from Yami Sama, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Yami Sama\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Yami Sama\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1964480/header.jpg?t=1670810809\", \"offers\": {\"@type\": \"Offer\", \"price\": 71.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}