{
    "AppID": 2112990,
    "Name": "王子斗恶龙2 Prince fighting dragon 2",
    "Release date": "Sep 12, 2022",
    "About the game": "Story background: Wang Zi Dou evil dragon 2 inherits the first generation and is the continuation of the first generation. It tells the story of the prince after he attacked the dragon. It is still set in the kingdom. But this time, the story is more grand, adding the demon clan and expanding the world outlook. The story background of this game is that I think the spirit of man is the beautiful yearning of mankind. The prince killed it in the first game, which led to the disappearance of this spiritual sustenance, which inevitably led to the imbalance of the continent I set up, and then the war between people and the demon clan took place. This work started against a heavy background. In the end, man defeated the devil, but the disaster did not disappear, but came one after another. The dead soldiers were revived, and they became ghosts, which could attack people and make people sick. This is the same as the current coronavirus epidemic background. I think that humans should reflect on nature. Why does nature retaliate against you? It's not good to fight back against the virus blindly. In the game, the virus is actually their own. It is the monster that those souls become. Play: A left on W, D right on S, enter to confirm, backspace to exit, and 1 to enter the menu. Main body introduction: This is an RPG game. At the beginning, the protagonist is very weak. By constantly defeating monsters and upgrading, he becomes stronger. By moving through the big map and visiting mazes and cities, you can buy new props and equipment to promote the development of the game. Game elements: Attack power is used in the game: that is, the ability to fight will be increased with the increase of equipment. Defense ability: the defense ability will be increased with the increase of equipment. Speed: in the game, we decide who will attack first according to the probability, which is related to the speed of both sides. The speed will be increased with the equipment bonus. Mantra: It is a kind of combat means, including attack type and auxiliary type. The attack category includes Mela, melami and melazuma. The auxiliary classes include behomer and behomer. They are restoration mantras that can regenerate blood. And lariho, who makes the other party sleep, can stop the other party's action for one round and eliminate the effect on him. Poison powder is used to poison the opponent and reduce his blood by 10 drops per round. Rukanan, reduce the opponent's defence by 10. Lula, you can move to the cities you have been to on the map. And a fantasy spell text spoiler, directly into the end. Magic bullet gun is added in the battle, which makes the fighting mode more abundant. Magic bullet gun is powerful. Its attack power is basic attack power multiplied by 1.1 + basic defense power multiplied by 1.1 + MP / 2 + level multiplied by 2. Monster Atlas: There are eight monsters in total, including six small monsters and two bosses. Each monster has special skills. Cats and cats will shed their shells and convert their attack power and defense power into attack power. The mage can spell venlukanan for defense, which can reduce the defense of the opponent. The devil will curse. If you attack it in three rounds, it will add blood. Barbara can use two jumps to attack twice in a row. Ghosts will use ghosts and howls to attack three times in a row. The God of heaven will use the lightning mantra text of kirkatin. The fishermen in the boss will use rain praying to increase their attack power and use magic bullets. The demon king can strike four times in a row and use the mantra skuru to increase his defense. characteristic: The picture is colored. In addition, I added background music, which is the developer's voice and is worth listening to.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2112990/header.jpg?t=1663031917",
    "Price": 0.84,
    "Developers": "杨君朝",
    "Publishers": "杨君朝",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2112990/ss_e48865a9be16dcc835de3547aeba843979fe9d0a.1920x1080.jpg?t=1663031917,https://cdn.akamai.steamstatic.com/steam/apps/2112990/ss_4d3dec58474370289ace051cbdb667889fa9ee80.1920x1080.jpg?t=1663031917,https://cdn.akamai.steamstatic.com/steam/apps/2112990/ss_ad313da89492c74d7d44dd6e90927418ab0ad7ce.1920x1080.jpg?t=1663031917,https://cdn.akamai.steamstatic.com/steam/apps/2112990/ss_c1b17b8539467692df32b720df38ebc46030eeae.1920x1080.jpg?t=1663031917,https://cdn.akamai.steamstatic.com/steam/apps/2112990/ss_f6e1c3fc315afb89f030d7eb4b9cbf4b11feaa62.1920x1080.jpg?t=1663031917,https://cdn.akamai.steamstatic.com/steam/apps/2112990/ss_e9c157f9455e59c5636deca5b0a3bc6c579752dd.1920x1080.jpg?t=1663031917,https://cdn.akamai.steamstatic.com/steam/apps/2112990/ss_691241eb56d43ee1856989b6e902869f4252e382.1920x1080.jpg?t=1663031917,https://cdn.akamai.steamstatic.com/steam/apps/2112990/ss_e392f7c1d0da190a788c2719830c742523e03647.1920x1080.jpg?t=1663031917",
    "Slug": "2-prince-fighting-dragon-2",
    "Meta Title": "王子斗恶龙2 Prince fighting dragon 2: Sep 12, 2022, 杨君朝 and Fu...",
    "Meta Description": "Looking for information on 王子斗恶龙2 Prince fighting dragon 2? Check out the release date (Sep 12, 2022), developer insights from 杨君朝, and a complete game ...",
    "Alt Text Image": "Official header image for 王子斗恶龙2 Prince fighting dragon 2 game - Steam 2112990",
    "Canonical URL": "https://gusku.site/game/2-prince-fighting-dragon-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u738b\\u5b50\\u6597\\u6076\\u9f992 Prince fighting dragon 2\", \"description\": \"Looking for information on \\u738b\\u5b50\\u6597\\u6076\\u9f992 Prince fighting dragon 2? Check out the release date (Sep 12, 2022), developer insights from \\u6768\\u541b\\u671d, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6768\\u541b\\u671d\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6768\\u541b\\u671d\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2112990/header.jpg?t=1663031917\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.84, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}