{
    "AppID": 2133330,
    "Name": "2tinycowboys",
    "Release date": "Sep 13, 2022",
    "About the game": "Jump, run, shoot and dodge your way through huge multi-directional levels, while avoiding a wide variety of enemies. Take advantage of the vultures and fly to the top, all the while searching for the gold-bars, required to win. Utilize power-ups and the strengths of your chosen character to search every nook and cranny Enter almost any building and make sure to visit the barbershop and try out any of the eight different hairstyles available for each character, in this retro-flavored platformer for 1-4 players. The Protagonists: Clint : Does not get bitten by snakes. Esmaralda : Does not get bitten by spiders. Felipe : Has a short-sword, rather than a knife (Longer stab-range). /not able to change appearance at Barbershop Ma’ Belle : Able to take two arrows, before dying. Mercedes : Gets 2 jump-boots, rather than one, on pickup. Rose : Jumps higher than everyone else. Santiago : Fires faster than the others. Zeke : Has penetrating bullets that will go straight through his foes. Zorra : Double jump and faster than the rest. Pistol &amp; Knife only. /not able to change appearance at Barbershop Ndyan (playable character): More info coming soon. The Enemies: Ndyan – Bow : If quick enough, you can shoot his arrows. Ndyan – Spear : This guy takes 2 bullets before going down. Long reach in melee, but no ranged weapons. Ndyan – Tomahawk : Keep track of his bounce and beware, it will take you 4 bullets to kill him. Sherif &amp; Sherif Twin : Fast draw, quick-shooter. Careful with shooting their bullets. The sherif and his Twin will take 3 shots each to kill. Killing one will resurrect the other. Robot : Made of indestructible material and fires lasers. Bullets will ricochet right off of these guys; Your best bet is to jump over him. Zombies : These undead cowboys can take 5 bullets before going down, becoming slower by each hit. Stabbing will instantly kill them, however. Snakes : Sometimes easy to spot, sometimes hidden in the undergrowth. Their venomous bite will poison the player, giving them one minute to find a anti-venom. Spiders &amp; Bats : These will stun the player for a few seconds. If however the player has been bitten by a snake previous, then they will be instantly killed. Ooze : This will make you unable to stop jumping for 30 seconds. Tentacle : These will slow you down, while decreasing your jump for 30 seconds. Boulders : On certain levels there are boulders coming down from the mountains above. You shoot these to slow them down and eventually destroy them, or try to jump them, else instant death. Vultures : These will carry off with you, enemies as well as goldbars. The Cavalry: Ollie : A bit slow, but fires scattering bullets. Otis : Slow reload, but far reaching bullets. Curtis : Fires his pistol at a rapid rate. Sarge : Boosts morale of the others. (Hard) Pete the Trumpeter : As long as Pete is alive, whenever there are less than 50% of Cavalry remaining, they will respawn. (Hard) The Guns : Pistol : Medium range, medium speed, fist-sized bullets. Ammo capacity = 6 Shotgun : Short range, slow speed, fires in five different angles in front of the shooter, thus making it ideal for taking down enemies on ledges in front of you. Fires pellets, rather than bullets. Able to destroy rolling boulders. Ammo capacity = 5 Rifle : Long range, fast speed, fires a half fist-sized bullet, penetrating any and all enemies (except for Zombies, which are spongy by nature), killing them instantly. Also able to shoot destroy rolling boulders. Ammo capacity = 3 The Loot: Goldbars : These are what you want. Grab enough to win. Hats : Extra lives. Boots : Double-jump. Anti-venom : Negates snake-bite. Ammo : More ammunition for your gun. The different difficulty levels alter the game in the following ways: Easy : No boulders, robots, sherifs, tentacles or zombies. Vultures don’t pick up Tomahawk Ndyan, Goldbars or Snakes &amp; Spiders. 7 Goldbars required to win. Medium : No robots, no tentacles or boulders. Vultures don’t pick up Tomahawk Ndyan or Snakes. 10 Goldbars required to win. Hard : Your default game-mode, 2tinycowboys as it was intended. Challenging, but fun; Especially in multiplayer. But do feel free to pick any level of challenge to get acquainted with the game, before advancing to this. 2tinycowboys is about having fun, for everyone. 12 Goldbars required to win. Gamepad Controls are : D-Pad Right = move right D-Pad Left = move left D-Pad Up = climb up (ladders/vines) and enter cave/Interact with NPCs D-Pad Down = climb down (ladders/vines) A = jump B = stab X = shoot Y = special Keyboard Controls are: Player 1: Left Arrowkey = move left Right Arrowkey = move right Up Arrowkey = climb up (ladders/vines) and enter cave Down Arrowkey = climb down (ladders/vines) SPACE = jump M = stab CTRL = shoot N = special Player 2: D = move right A = move left W = climb up (ladders/vines) and enter cave S = climb down (ladders/vines) V = jump Z = stab C = shoot X = special Player 3: L = move right J = move left I = climb up (ladders/vines) and enter cave K = climb down (ladders/vines) O = jump ENTER = stab P = shoot Backspace = special Player 4: Numpad 6 = move right Numpad 4 = move left Numpad 8 = climb up (ladders/vines) and enter cave Numpad 2 = climb down (ladders/vines) Numpad + = jump Numpad 5 = stab Numpad - = shoot Numpad * = special",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2133330/header.jpg?t=1663092040",
    "Price": 0.0,
    "Developers": "André Esbjörnson",
    "Publishers": "Initative Workgroup",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2133330/ss_e65932abaa506fd7b25f518074763f3ce7fc46ce.1920x1080.jpg?t=1663092040,https://cdn.akamai.steamstatic.com/steam/apps/2133330/ss_31389dd2829c5328ffbe18838edb01b2a5a37542.1920x1080.jpg?t=1663092040,https://cdn.akamai.steamstatic.com/steam/apps/2133330/ss_fb8e32417d9538407e52daa20bad62343cdbfbc5.1920x1080.jpg?t=1663092040,https://cdn.akamai.steamstatic.com/steam/apps/2133330/ss_b2ecf53f1563a64e144bb748caef596401cb49bc.1920x1080.jpg?t=1663092040,https://cdn.akamai.steamstatic.com/steam/apps/2133330/ss_3b96474c446b21b101d555da3ed2c5e6985d0b60.1920x1080.jpg?t=1663092040",
    "Slug": "2tinycowboys",
    "Meta Title": "2tinycowboys: Sep 13, 2022, André Esbjörnson and Full Ove...",
    "Meta Description": "Looking for information on 2tinycowboys? Check out the release date (Sep 13, 2022), developer insights from André Esbjörnson, and a complete game summary.",
    "Alt Text Image": "Official header image for 2tinycowboys game - Steam 2133330",
    "Canonical URL": "https://gusku.site/game/2tinycowboys",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"2tinycowboys\", \"description\": \"Looking for information on 2tinycowboys? Check out the release date (Sep 13, 2022), developer insights from Andr\\u00e9 Esbj\\u00f6rnson, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Andr\\u00e9 Esbj\\u00f6rnson\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Initative Workgroup\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2133330/header.jpg?t=1663092040\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}