{
    "AppID": 2134360,
    "Name": "89",
    "Release date": "Sep 13, 2022",
    "About the game": "89 is a simple platforming game that features a small twist, there is only one checkpoint in the whole game, which is located halfway through, which means that unless you've passed the halfway point, everytime you die, you go back to the start (or the halfway point). It features 1-bit pixel art graphics and simple, intuitive controls. The game throws you straight into the levels, no mindbendingly complicated lore, no insane character arcs to keep track of, no oddly-specific scenery descriptions, just run and jump. At its core, 89 boasts basically the bare minimum required for a platforming game, a movement button, a jump button, and spikes and pits galore. It was designed to be the most straightforward experience possible, for anyone to be able to get into, but at the same time to have nerve-wracking level design, for the more experienced of players to also be able to have fun. As said before, the graphics present in 89 are as simple as possible, to try and aid the game's whole 'simple yet intuitive feeling'. The graphics are retro-inspired pixel art, but the graphics make use of only three colors, black, white and sometimes (but only sometimes) yellow, as merely an accent. The graphics were made specifically to be easy on the eyes, and to be able to be understood by anyone anywhere. 89 takes a no BS approach to control having only what is strictly needed for gameplay, forward and backwards movement, and a jump button, not even a run button. These controls may seem overly dumbed-down and limiting on the surface, but the levels were designed to perfectly suit these basic controls and to be able to stretch them to unexpected capacities. The OST (original sountrack) present in the game is fully composed by AV474R, and was tailored for 89. It is a perfect balance of upbeat and happy EDM tracks, and suspenseful minimalist-type tracks. Apart from the sountrack composed specifically for 89, AV474R has also granted the dev team access to the majority of his discography, meaning that together with all the EDM tracks he's composed for the game, you will also be able to hear some calming lofi, if you play for long enough. There are also some classical tracks sprinkled in, to be able to really suit every music taste. 89 also happens to be chock-full of fun little extras, so that everyone can have exactly the experience they want. Some of he afformentioned extras include: A shader meant to resemble the effect of a CRT television An infinite mode, where levels endlessly loop An inverted colors option And many more!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2134360/header.jpg?t=1663081123",
    "Price": 2.39,
    "Developers": "H-Pie Game Studio",
    "Publishers": "H-Pie Game Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2134360/ss_aa9f384a06737893f15a5eea9bcb233dd9b7a0f3.1920x1080.jpg?t=1663081123,https://cdn.akamai.steamstatic.com/steam/apps/2134360/ss_1e9ce0f644e9a1618647dbc73ac14375a9f15e98.1920x1080.jpg?t=1663081123,https://cdn.akamai.steamstatic.com/steam/apps/2134360/ss_b221cda221c48c78d70ada8ba9b420897f63b1e9.1920x1080.jpg?t=1663081123,https://cdn.akamai.steamstatic.com/steam/apps/2134360/ss_c2b08c67e93bd8ea9ba328d80189358071c39d75.1920x1080.jpg?t=1663081123,https://cdn.akamai.steamstatic.com/steam/apps/2134360/ss_aabc029c209440ab428684b62f0640c194e41598.1920x1080.jpg?t=1663081123",
    "Slug": "89",
    "Meta Title": "89: Sep 13, 2022, H-Pie Game Studio and Full Overview",
    "Meta Description": "Looking for information on 89? Check out the release date (Sep 13, 2022), developer insights from H-Pie Game Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for 89 game - Steam 2134360",
    "Canonical URL": "https://gusku.site/game/89",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"89\", \"description\": \"Looking for information on 89? Check out the release date (Sep 13, 2022), developer insights from H-Pie Game Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"H-Pie Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"H-Pie Game Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2134360/header.jpg?t=1663081123\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}