{
    "AppID": 1904730,
    "Name": "Adventure Academia: The Fractured Continent",
    "Release date": "Sep 7, 2022",
    "About the game": "We are going to update the title to cover the English language! The date for the update is still in the process to be decided, but please wishlist it now and stay tuned for further information! ◆Pick them up by pinching them, deploy them on the field, and the let the battle commence! Use markers to tactically guide your student soldiers in real time! ◆Uh oh! Backed into a corner by a deadly attack? Just pinch your students out of harm's way! Each stage features gargantuan boss monsters with varying abilities and attacks! You'll have to guide your party properly... Or face being wiped out! ◆An Edgy... Master Artist... Mentally Weak... Dwarf?! Choose your students! With ten races and over eighty different personality traits to mix and match with, you'll have a unique squad in no time! ◆The Main Races Race: Human No fortes, no flaws— Humans are versatile and voracious for historical knowledge. Action: Melee Attack Spec: Vanguard, Ally Support Race：Elf These wise, beautiful people use superior archery to guard their ancestral forests. Action: Ranged Attack Spec: Rear Guard, Ranged Firepower Race：Dwarf Strong, beastly, and hearty. Living proof that good things can come in small packages. Action: Melee AoE Attack Spec: Vanguard, Group Combat Race：Khulaz A speedy, dexterous people that remain childishly curious and energetic even as adults. Action: Melee Attack Spec: Middle Guard, Scouting Race：Felpurr These descendants of cats brim with vitality. They tend to be cheerful and frivolous. Action: Melee Attack Spec: Vanguard, Brawler Race：Gnome Spirits inhabiting special bodies, gnomes are known for their robotic conduct. Action: Ranged Attack Spec: Rear Guard, AoE Attack Magic Race：Fairy With a penchant for wisdom and magic, fairies are beloved by all for their healing spells. Action: Heal Spec: Rear Guard, Debuff Removal Race：Bahamoon These draconic people use their tough frames to lead the charge. Action: Melee Attack Spec: Vanguard, Potent Defense Race：Diabolos Underworld descendants that crave solitude and hiding in their own worlds. Action: Ranged AoE Attack Spec: Middle Guard, Disruptive Magic Race：Celestia Noble angels that value justice and faith, they long for peace and harmony. Action: AoE Healing Spec: Rear Guard, Revival ◆Story The Continent of Pedra, home to four nations, is in the midst of a serious crisis. The entire island is slowly transforming into a labyrinthine dungeon, and monsters are roaming the lands... Cue our charming protagonist, Alex, who sets out on a journey in search of his missing father. Using the Ruler Orb, a tactical artifact passed down in his family for generations, Alex has the ability to command others on the battlefield. With his childhood friend Citrin in tow, along with his dorky advisor Lazuli, he seeks to find the truth behind the anomalies that threaten all the people of Pedra.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1904730/header.jpg?t=1662723795",
    "Price": 35.99,
    "Developers": "ACQUIRE Corp.",
    "Publishers": "ACQUIRE Corp.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1904730/ss_6e2834739a4001619a1d85299b3a4b4184bf8ccb.1920x1080.jpg?t=1662723795,https://cdn.akamai.steamstatic.com/steam/apps/1904730/ss_e30cd315c9c29919b60f89eee235ca3aed4e426f.1920x1080.jpg?t=1662723795,https://cdn.akamai.steamstatic.com/steam/apps/1904730/ss_1c5a0513aec6ded062e53caeba54f1df6e775c5f.1920x1080.jpg?t=1662723795,https://cdn.akamai.steamstatic.com/steam/apps/1904730/ss_80ce407efb92897e8547b4e215f04bacc7f21924.1920x1080.jpg?t=1662723795,https://cdn.akamai.steamstatic.com/steam/apps/1904730/ss_4db785a80063d1473297ce73b7ed3eb6695e8da3.1920x1080.jpg?t=1662723795,https://cdn.akamai.steamstatic.com/steam/apps/1904730/ss_4fa83b5d2e0f105a45bbcd331dc1430504b7510e.1920x1080.jpg?t=1662723795,https://cdn.akamai.steamstatic.com/steam/apps/1904730/ss_de4a98ef3fad06b7d157120a28ad2e6ecfccede4.1920x1080.jpg?t=1662723795,https://cdn.akamai.steamstatic.com/steam/apps/1904730/ss_507177cdb076a0aa82c49e381ec0a968abba33b3.1920x1080.jpg?t=1662723795,https://cdn.akamai.steamstatic.com/steam/apps/1904730/ss_c04b3d786e5beac3fd8f4935c906730e17a7ae0a.1920x1080.jpg?t=1662723795,https://cdn.akamai.steamstatic.com/steam/apps/1904730/ss_08cef57e02dde74ed9e048b846708243798fd1fe.1920x1080.jpg?t=1662723795",
    "Slug": "adventure-academia-the-fractured-continent",
    "Meta Title": "Adventure Academia: The Fractured Continent: Sep 7, 2022,...",
    "Meta Description": "Looking for information on Adventure Academia: The Fractured Continent? Check out the release date (Sep 7, 2022), developer insights from ACQUIRE Corp.,...",
    "Alt Text Image": "Official header image for Adventure Academia: The Fractured Continent game - Steam 1904730",
    "Canonical URL": "https://gusku.site/game/adventure-academia-the-fractured-continent",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Adventure Academia: The Fractured Continent\", \"description\": \"Looking for information on Adventure Academia: The Fractured Continent? Check out the release date (Sep 7, 2022), developer insights from ACQUIRE Corp.,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"ACQUIRE Corp.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ACQUIRE Corp.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1904730/header.jpg?t=1662723795\", \"offers\": {\"@type\": \"Offer\", \"price\": 35.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}