{
    "AppID": 1837690,
    "Name": "Archtower",
    "Release date": "Sep 30, 2022",
    "About the game": "Archtower is a nonstandard mixture of roguelite and ARPG. There is a great Tower in this world. It has always been there. A primitive community of people, organized in family clans, are trying to get into it. You are playing for one of those families. Who knows what the offspring of your clan will find there next: fame, treasures, or just a painful death. Features Unique generated characters 4 basic classes, the rest will be unlocked over time System of innate Traits and acquired Perks for your adventurers Meta-progression: Clan improving, Clan's Domain rebuilding, Tower Upgrades Loot system similar to classic ARPGs, but with its nuances Power Crystals, that grant you active skills, improve your heroes with them Complete Quests, meet new Factions, increase your reputation with them, get bonuses Hardcore, the game isn't too difficult, but fast, you delay in combat - you fall Permadeath and drop of belongings, but the game gives chances to avoid this Traumas and Injuries system, if the hero loses often; Traumas can be healed, Injuries can't Explore the Tower, meet new friends and foes, uncover the secrets of this place Unlock New Content gradually: Classes, Weapons, Armour, and Power Crystals Play as you like, with a 1st-person or a 3rd-person camera, for the purposes you need Develop your character Choose your hero from the list of generated adventurers. Choose wisely, because, in addition to choosing a class, certain traits and stat spreading can significantly affect your playing experience. Increase its characteristics, level up, choose upgrades and perks. Pick the right equipment for your builds. Develop your clan Raise the family clan level by getting Fame (complete quests, explore the Tower). For clan level-ups, get small clan bonuses, which will gradually add up to a good boost for all your characters. Send your old characters to the well-deserved retirement, thereby earning additional clan Fame. Take back the lost clan lands and start building them up, taking various bonuses from buildings. For example, the Tavern allows you to have several characters at the same time. Explore the mysterious Tower Unlock and explore new floors, along with new classes and upgrades. Buy Tower upgrades from the enigmatic Attendant. Discover and explore secret places, find powerful gear for your characters, fight new enemies. Complete quests and find unexpected allies Do the quests, those that wait for your help can be found both in your home camp and in a strange mysterious Tower. Get Fame for your clan for this. Unlock new skills for your characters and improve relationships with your allies by doing class and faction quests. Use skills of power crystals Retrieve incomprehensible power crystals that gain you new active skills. Use these skills to diversify your gaming experience and cover the weak spots of your characters. Try not to die Preserve your heroes, don't forget to heal in time, buy and use bandages when low on health. If your character dies, then it is permanent, and its loot and equipment will stay in the Tower. And don't despair after defeat With time, you'll learn how to minimize harm from the death of characters and the loss of gear. You'll unlock upgrades that allow you to pick up the dropped loot of your predecessors. And defeat doesn't always mean the death of the character, you'll have your chances to survive and escape, but this will lead to the chance of getting traumas, or even injuries. If you have a Hospital, there you can heal your traumas if they weren't left to a serious condition. Try new classes and builds and you'll achieve great results!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1837690/header.jpg?t=1664573423",
    "Price": 10.79,
    "Developers": "Blaster Games Studio",
    "Publishers": "Blaster Games Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1837690/ss_36478d625fe7a48d85ed4b687407044e363130f2.1920x1080.jpg?t=1664573423,https://cdn.akamai.steamstatic.com/steam/apps/1837690/ss_4f9ea4a4d04e9d04edce6d167854b4e83b034b7c.1920x1080.jpg?t=1664573423,https://cdn.akamai.steamstatic.com/steam/apps/1837690/ss_bff035d3448abc32081d691d5460abf283826aa1.1920x1080.jpg?t=1664573423,https://cdn.akamai.steamstatic.com/steam/apps/1837690/ss_ca6b0711dedbf17bf1b91e3e5de6a6f3e0d04e33.1920x1080.jpg?t=1664573423,https://cdn.akamai.steamstatic.com/steam/apps/1837690/ss_519ae9a9ce712b85883884b4291ddf9abbe7bebf.1920x1080.jpg?t=1664573423,https://cdn.akamai.steamstatic.com/steam/apps/1837690/ss_9faac26c86f4ef3e956f6b8512594fafeabd76e1.1920x1080.jpg?t=1664573423",
    "Slug": "archtower",
    "Meta Title": "Archtower: Sep 30, 2022, Blaster Games Studio and Full Ov...",
    "Meta Description": "Looking for information on Archtower? Check out the release date (Sep 30, 2022), developer insights from Blaster Games Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Archtower game - Steam 1837690",
    "Canonical URL": "https://gusku.site/game/archtower",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Archtower\", \"description\": \"Looking for information on Archtower? Check out the release date (Sep 30, 2022), developer insights from Blaster Games Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blaster Games Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blaster Games Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1837690/header.jpg?t=1664573423\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}