{
    "AppID": 2114830,
    "Name": "Belt Colony",
    "Release date": "Sep 9, 2022",
    "About the game": "The year is 2040. You, an ex-sergeant, have signed a contract with a large mining corporation in the Belt. Mine ore, build out your outpost, travel to nearby asteroids and collaborate with other belters. Mining outpost on an asteroid Operate a mining outpost on an asteroid. Mine valuable ore from large and small rocks on the surface. Sell the ore to earn credits (the currency in the Belt in the future). Build out your mining outpost with a landing pad, drone pad, storage, solar panels, refineries, and more. Mine ore from rocks There are lots of large and small rocks on the surface that can easily be mined for ore. Sell ore &amp; buy upgrades, equipment, buildings, repairs, etc. You can sell the ore that you mine using the management user interface in the outpost. Just click the 'sell ore' button, and you will sell ore at the current market price and earn credits. You can use the credits to buy upgrades, equipment, buildings, repairs, food, water, etc. Buy a spaceship When you have earned enough credits from selling ore, you will be able to buy a spaceship. You can now mine ore more efficiently and travel to other asteroids. Belters As you venture out into the Belt, you will meet others. You can earn credits by doing tasks for others. Space stations There are several space stations scattered throughout the Belt. Most of them are owned by United Space Corporation and Utopia Arura Corporation. Drones Drones are very useful for hauling ore and small equipment. Extractors Extractors are specialized drilling and extraction rigs that can be used to extract different types of ore beneath the surface of the asteroid. Features Mining ores Base building and upgrades Deploy mining rigs and control drones Low gravity and zero gravity physics simulations Spacesuit and spaceship fuel, oxygen and integrity mechanics Explore and mine large asteroids that are 1 to 3 km (0.6 to 2 miles) in diameter Visit and earn credits at the many space stations in the belt Easy to play Chill out on in the Belt Enjoy several hours of gameplay in solitude in the Asteroid Belt, mining for ore, operating your outpost, flying your spaceship, floating in micro-gravity, etc. This may be a good game for you if you like space games and are tired of action-packed shooting games. Asteroid Belt Scattered in an orbit around the sun, just beyond the orbit of Mars, are bits and pieces of rock left over from the dawn of the solar system. The asteroid belt has countless small asteroids, and between 700,000 and 1.7 million asteroids with a diameter of 1 km or more. The game is set somewhere in the Belt where there are several large asteroids in the proximity of each other. We have made many large high-quality asteroids of several kilometers (and several miles) in diameter. You can land on the surface of any of these asteroids and mine them. We have put quite a bit of effort into making the asteroids realistic.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2114830/header.jpg?t=1662754692",
    "Price": 15.99,
    "Developers": "GridSky Software AS",
    "Publishers": "GridSky Software AS",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2114830/ss_90ec632210dce97eaa81c04a5b04d9fc9bc18f65.1920x1080.jpg?t=1662754692,https://cdn.akamai.steamstatic.com/steam/apps/2114830/ss_abe1b69bec4f2ead02ea85728404d95d39b14d13.1920x1080.jpg?t=1662754692,https://cdn.akamai.steamstatic.com/steam/apps/2114830/ss_0b80b157089bcacfbfa0244f7a58ac7fe7faa1db.1920x1080.jpg?t=1662754692,https://cdn.akamai.steamstatic.com/steam/apps/2114830/ss_5f207389c6a273a00b7b5284ca17362222748544.1920x1080.jpg?t=1662754692,https://cdn.akamai.steamstatic.com/steam/apps/2114830/ss_e38cd6abdefc056df8f199347dfb41b34be3d116.1920x1080.jpg?t=1662754692,https://cdn.akamai.steamstatic.com/steam/apps/2114830/ss_e051576672d362477bf6624a35648ee5bcc0e546.1920x1080.jpg?t=1662754692,https://cdn.akamai.steamstatic.com/steam/apps/2114830/ss_0e4124ce3fea7a15c669a76f4910505f7099cb63.1920x1080.jpg?t=1662754692,https://cdn.akamai.steamstatic.com/steam/apps/2114830/ss_8add11a8ba05471b63228ca17b375fda105912a9.1920x1080.jpg?t=1662754692,https://cdn.akamai.steamstatic.com/steam/apps/2114830/ss_1b8ef0dbfc4f79b9d27c85091616af5e0b190f0b.1920x1080.jpg?t=1662754692",
    "Slug": "belt-colony",
    "Meta Title": "Belt Colony: Sep 9, 2022, GridSky Software AS and Full Ov...",
    "Meta Description": "Looking for information on Belt Colony? Check out the release date (Sep 9, 2022), developer insights from GridSky Software AS, and a complete game summary.",
    "Alt Text Image": "Official header image for Belt Colony game - Steam 2114830",
    "Canonical URL": "https://gusku.site/game/belt-colony",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Belt Colony\", \"description\": \"Looking for information on Belt Colony? Check out the release date (Sep 9, 2022), developer insights from GridSky Software AS, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"GridSky Software AS\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GridSky Software AS\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2114830/header.jpg?t=1662754692\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}