{
    "AppID": 2015610,
    "Name": "Blood Hospital",
    "Release date": "Sep 9, 2022",
    "About the game": "This game is exclusive to Steam platform Welcome to follow the official Sina Weibo~ Star &amp; Moon Romance Studio Background Story: When I woke up from this abandoned hospital, I knew the smell of blood I don't know how many times I have been to the morgue. Every time I come here, I feel a strange feeling that I don't belong here I.... And them dissimilarity... I once found a note upstairs that said something about 'Mom' That handwriting feels like it was written by a child , Maybe I should do something for that child? What's going on? That voice is coming again! Since no one else here wants to stay with me, I will follow that voice That voice is my only brother! Ah! damn! I saw something I shouldn't have seen again! I'm tired of avoiding them! I want to leave this place! Introduction to the game Survival Some monsters wander aimlessly in the hospital. If you let them see you, maybe it's not a good thing Those monsters are dangerous and even aggressive. If we don't want to die here, we can only choose to live longer than them Explore This hospital is much larger than we thought, not only the area on the ground, Underground, there are many dark unknown blocks We need to take the elevator to shuttle through all floors Puzzles No matter where we go, there will be a headache on every floor. The puzzle and game playing of each floor are different The pool without blood...Hidden killing and ambush.... Those doors that open and close by themselves The inescapable flames of hell The password box that cannot be unlocked Those video tapes that don't know what to use Those scattered documents The electric switch on the wall that was in disrepair for a long time The office that never gets in There are too many randomness and variables, danger and killing Battle In the face of fear, we should fight back! I believe we can find our own weapons in this hospital! Can't escape! We must be brave!! Repel those terrible monsters! Whether it's chasing, ambushing, confrontation, or intrigue As long as we plan our ammunition and supplies reasonably, we will certainly be able to fight a bloody way! Collection What makes us feel at a loss every time we enter this hospital is Those random weapons,items... How can we use those things Here, I feel we are not so lucky But we can survive,Is the best luck! The game supports Steam Cloud, and more than 50 achievements are waiting for you to complete, The game supports Steam Leaderboard, and your game time will be recorded in history together with global players! I believe in your courage. Let's face all the experiences here.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2015610/header.jpg?t=1662717368",
    "Price": 14.44,
    "Developers": "Star & Moon Romance",
    "Publishers": "Star & Moon Romance",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2015610/ss_1596d7f1d8cad7d8ac2d827a2390f4af63ce2499.1920x1080.jpg?t=1662717368,https://cdn.akamai.steamstatic.com/steam/apps/2015610/ss_7d9a4c9016f07448d6c82d7f870feafb9470d6a5.1920x1080.jpg?t=1662717368,https://cdn.akamai.steamstatic.com/steam/apps/2015610/ss_6935b8b80343116036c9785924669987e658cf04.1920x1080.jpg?t=1662717368,https://cdn.akamai.steamstatic.com/steam/apps/2015610/ss_ed98e28fcf35a32aebbd654be34cb894d385f5b2.1920x1080.jpg?t=1662717368,https://cdn.akamai.steamstatic.com/steam/apps/2015610/ss_ce961b8332e6de7a64a232b435a439e2b048ee99.1920x1080.jpg?t=1662717368,https://cdn.akamai.steamstatic.com/steam/apps/2015610/ss_5b10760e4d0b3096136cd87a5d36cc8f6ff0efb0.1920x1080.jpg?t=1662717368,https://cdn.akamai.steamstatic.com/steam/apps/2015610/ss_267ea7a0a728bd080b1d6b5753c68df30d6fffce.1920x1080.jpg?t=1662717368,https://cdn.akamai.steamstatic.com/steam/apps/2015610/ss_45331715a76ca6246e7001d4f7276892fd9f54a9.1920x1080.jpg?t=1662717368,https://cdn.akamai.steamstatic.com/steam/apps/2015610/ss_005263f1643cb1bf6a6038f9baac06f847a1d85e.1920x1080.jpg?t=1662717368",
    "Slug": "blood-hospital",
    "Meta Title": "Blood Hospital: Sep 9, 2022, Star & Moon Romance and Full...",
    "Meta Description": "Looking for information on Blood Hospital? Check out the release date (Sep 9, 2022), developer insights from Star & Moon Romance, and a complete game su...",
    "Alt Text Image": "Official header image for Blood Hospital game - Steam 2015610",
    "Canonical URL": "https://gusku.site/game/blood-hospital",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Blood Hospital\", \"description\": \"Looking for information on Blood Hospital? Check out the release date (Sep 9, 2022), developer insights from Star & Moon Romance, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Star & Moon Romance\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Star & Moon Romance\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2015610/header.jpg?t=1662717368\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.44, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}