{
    "AppID": 2075050,
    "Name": "Boom Slingers",
    "Release date": "Sep 16, 2022",
    "About the game": "THE MOBILE HIT BOOM SLINGERS IS NOW AVAILABLE ON STEAM! Fight in 1v1 physics-based battles against players around the world! Slingers are small cross-dimensional creatures who discover their universe and journey along the cosmos through epic 1v1 battles. No one knows where they came from or what their motives are, but they will definitely duel until the end of time. Steam Exclusive features Full and permanent Boom Pass access on Steam (Mobile Boom Pass to be purchased separately) No ads Cross-play with mobile players Cross-progress on mobile Steam exclusive perks: FREE 5x New SHARK ATTACK Weapon Card, FREE New m0u5e Character, FREE Mouse hat! 🌎 ONLINE MULTIPLAYER Join over 2 million players and battle against each other all across the globe! 💥 QUICK BATTLES and smooth match making Finding a match is quick and easy and battles only last up to a few minutes, making this the perfect game to play when you have some down time or are on the go! 🌠 BULLET-TIME AND PHYSICS Slow down time and combo your weapons and moves. There are so many different combinations and tricks to discover and master! 🤝 PLAY WITH YOUR FRIENDS Engage in friendly battles against your friends to have fun, practice cool moves, and see who the one true slinger is. 🐶 COLLECT 70+ CHARACTERS Build your team with hats, accessories and unique characters. In Boom Slingers you can be a banana hat wearing coffee cup, or an angry purple space robot donning a fabulous moustache. If our high school maths serves us right, there are 67488 different fashionable combos to discover, with more being added each update! ⚔️ 50+ UNIQUE WEAPONS TO COLLECT Shoot banana beams, throw moving trains and hit your foes with boomerangs. We even have a cow that's being tracked by a UFO... Wonder what happened there. Can you find all the weapons scattered throughout the cosmos? 🖌️ GET CREATIVE IN THE BOOM SLINGERS LABORATORY! If you can imagine it - you can play it. Build your own arenas with the Arena Builder and play on them with friends! You can also design your spaceship art to show off each time you fly into, and out of, battle. 📅 WEEKLY EVENTS with exclusive prizes Rotating game modes every weekend with exclusive prizes! 🎉 FREE AND REGULAR content updates We are constantly working on updating and improving our game to make it the most enjoyable experience for all. Updates include new features, new content, new art, system improvements, bug fixes and more! TECHNICAL You can link your Boom Slingers mobile account with the Steam version and enjoy cross-play on all your devices! Please note: The game runs on live servers. A network connection is required to play the game. Leaderboard rank and trophies are reset at the beginning of each month as a new season begins.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2075050/header.jpg?t=1663416172",
    "Price": 6.29,
    "Developers": "Boom Corp",
    "Publishers": "Boom Corp",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2075050/ss_0cee47485adce22d4dc1b695085c2249aaa78d01.1920x1080.jpg?t=1663416172,https://cdn.akamai.steamstatic.com/steam/apps/2075050/ss_de077fa1a34981957e27f94c4bf0e7e0f0ed2ed8.1920x1080.jpg?t=1663416172,https://cdn.akamai.steamstatic.com/steam/apps/2075050/ss_5c7931283d34f46226adf8d5f8db9adcd55f053b.1920x1080.jpg?t=1663416172,https://cdn.akamai.steamstatic.com/steam/apps/2075050/ss_5049c9b5dc82180d0079c57dbca52277c4db95d5.1920x1080.jpg?t=1663416172,https://cdn.akamai.steamstatic.com/steam/apps/2075050/ss_e45c73631a1cc573ca239ddf2e47ee9e449e10bf.1920x1080.jpg?t=1663416172",
    "Slug": "boom-slingers",
    "Meta Title": "Boom Slingers: Sep 16, 2022, Boom Corp and Full Overview",
    "Meta Description": "Looking for information on Boom Slingers? Check out the release date (Sep 16, 2022), developer insights from Boom Corp, and a complete game summary.",
    "Alt Text Image": "Official header image for Boom Slingers game - Steam 2075050",
    "Canonical URL": "https://gusku.site/game/boom-slingers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Boom Slingers\", \"description\": \"Looking for information on Boom Slingers? Check out the release date (Sep 16, 2022), developer insights from Boom Corp, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Boom Corp\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Boom Corp\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2075050/header.jpg?t=1663416172\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.29, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}