{
    "AppID": 840880,
    "Name": "Camped Out!",
    "Release date": "Sep 22, 2022",
    "About the game": "Camped Out is a frenetic couch co-op game for friends and families where up to four players must work together to set up camp before darkness falls. Work together as a team to complete campsites and unlock further areas in the game world. Each level is a race against the clock where players are required to build tents, construct a campfire, cook enough food and get into bed before darkness falls. THE WORLD IS YOUR OYSTER It's a wide, bountiful world out there, teeming with all the natural resources you'll need to complete your campsite. There's wood to be chopped, stone to be mined and fish to be caught - but don't leave them lying around or they might disappear... TEAMWORK MAKES THE DREAM WORK To set up your camp as efficiently as possible, you'll need to work together. Throw tools to a teammate in need, ferry resources to a blueprint someone else placed, duck out of the way to let a camper through; every little bit of synergy helps. And most importantly, communicate! ROME WASN'T BUILT IN A DAY ...but your campsite must be built by nightfall! Each camper's backpack holds a tent pack, lantern, and some shared tools. There's also a cooking pot to stew a succulent meal. You choose where to place your blueprints, so choose carefully! MEET THE CAMPERS: Quintana - Quintana is the Camp Leader at Roaring Pines Summer Camp. She is the eleven year old daughter of high achieving parents. Her mother, a respected surgeon and father, a psychiatrist. As the first born of two girls, Quintana feels a sense of responsibility to protect her little sister. She’s clever and curious and having achieved leadership status in Mensa for Kids, prefers the company of books to frivolous child’s play. Covington - Covington is ten years old and lost his father when he was only five. Coming from a creative family, Covington's father left him with music in his veins. Covington continues to teach himself to play guitar by watching online videos of his favorite bands. He loves excursions and field trips with his fellow Campers, as he feels a close bond with them and will often serenade them with melodic renditions of his favorite songs. Saffron - Saffron is ten years old and the middle child of seven children. But with her ginger locks and eyes of blue and spirit to match her dazzling appearance she has no trouble standing out amongst the crowd. Living on the expanse of the farm with her six siblings, she is constantly seeking her next adventure and with a freckle to match each of her escapades, she’s unstoppable. Rascal - Rascal is eleven years old and an only child who’s been misunderstood until he was diagnosed with ADHD. His parents had him join Roaring Pines Summer Camp when he was seven, and as his name suggests he has a tendency to create mischief between his peers. Rascal loves to build and will use any material available to bring his imagination and creations to life. Whether it be sailing through stormy seas on a raft made of driftwood or flying through space with meteorite precision, Rascal leaves those around him in the wake of his creative destruction.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/840880/header.jpg?t=1663866023",
    "Price": 19.99,
    "Developers": "INCA Studios",
    "Publishers": "INCA Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/840880/ss_966c7dd20558bfb7a43df861dc14daf21e274243.1920x1080.jpg?t=1663866023,https://cdn.akamai.steamstatic.com/steam/apps/840880/ss_c3585bcfb34b4aab9e00e4abbe03885f02b57dbc.1920x1080.jpg?t=1663866023,https://cdn.akamai.steamstatic.com/steam/apps/840880/ss_b103486453b34a3064e4b72ad4610ff8290a4f9e.1920x1080.jpg?t=1663866023,https://cdn.akamai.steamstatic.com/steam/apps/840880/ss_553800dee8a06eaab4474a379925b5d5595ead3a.1920x1080.jpg?t=1663866023,https://cdn.akamai.steamstatic.com/steam/apps/840880/ss_863534f7be9904c630133cad783f377f523eabfa.1920x1080.jpg?t=1663866023,https://cdn.akamai.steamstatic.com/steam/apps/840880/ss_d803fef7c9e9168dca8f1cd5f552d71a4c2f1be5.1920x1080.jpg?t=1663866023,https://cdn.akamai.steamstatic.com/steam/apps/840880/ss_a4ed3b070cada7299368ff4220db6e92f626d175.1920x1080.jpg?t=1663866023",
    "Slug": "camped-out",
    "Meta Title": "Camped Out!: Sep 22, 2022, INCA Studios and Full Overview",
    "Meta Description": "Looking for information on Camped Out!? Check out the release date (Sep 22, 2022), developer insights from INCA Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Camped Out! game - Steam 840880",
    "Canonical URL": "https://gusku.site/game/camped-out",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Camped Out!\", \"description\": \"Looking for information on Camped Out!? Check out the release date (Sep 22, 2022), developer insights from INCA Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"INCA Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"INCA Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/840880/header.jpg?t=1663866023\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}