{
    "AppID": 1337970,
    "Name": "CatTuber",
    "Release date": "Sep 9, 2022",
    "About the game": "This is an Expandable Application officially licensed by Live2D Inc. ------- Game live broadcast lacks vitality? Want to demonstrate gameplay but don't want to use a camera to shoot your hands? Don't like the cold interface of other software that displays operations? Then you can try CatTuber! *More than the character, mouse and table, a variety of elements can be freely combined! In addition to providing basic elements such as tables, characters, and mouses, the software also provides other functional decorations (such as a 'KPS' that displays the number of keys per second, and a digital pen that has motion tracks). Each element has a certain number of models you can choose freely, you can mix and match as needed, and they will eventually be combined into the window content of the software. The models that come with the software can meet most needs. In addition to the models made for common games , you can find the models needed for typing, audio games, and painting in the software! *Multi-window system Different elements can be placed in different windows as needed. (Currently, only one window can be broadcast live in OBS. In subsequent development, each window can be broadcast live by means of a virtual camera) * Preset system The preset system can back up and archive some settings of the software, the position and size of windows, and the display content in the windows.That is to say, you can save the combination used for scene A and the combination used for scene B into different presets, and you can directly load the preset when needed without re-adding and setting elements. *Custom Live2d models with new model ideas The software will regard the folder as a resource package, and the model file can be recognized by the software by placing it in the specified folder according to the agreed method. The character and the table are modeled independently. As long as the user makes the character model according to the standard, this self-made character model can be used with all the existing tables of the same standard.The same is true for the table models.The same is true for the table model.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1337970/header.jpg?t=1662706978",
    "Price": 4.99,
    "Developers": "MMmmmoko",
    "Publishers": "MMmmmoko",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1337970/ss_d71a50593c44d3439eb3bdf269ca0090b9cba9a2.1920x1080.jpg?t=1662706978,https://cdn.akamai.steamstatic.com/steam/apps/1337970/ss_1f645d9b9cfbaf79dacf3d46d11612828a8ccc81.1920x1080.jpg?t=1662706978,https://cdn.akamai.steamstatic.com/steam/apps/1337970/ss_24b9dd5dc2b291e574d4790926ad2fc988c42b3e.1920x1080.jpg?t=1662706978,https://cdn.akamai.steamstatic.com/steam/apps/1337970/ss_d07f0e6c4ef57c6df26351b2c39c3d880a9fa3b7.1920x1080.jpg?t=1662706978,https://cdn.akamai.steamstatic.com/steam/apps/1337970/ss_f84408e57364ca03c155aae014f4dae47ce0e5f0.1920x1080.jpg?t=1662706978",
    "Slug": "cattuber",
    "Meta Title": "CatTuber: Sep 9, 2022, MMmmmoko and Full Overview",
    "Meta Description": "Looking for information on CatTuber? Check out the release date (Sep 9, 2022), developer insights from MMmmmoko, and a complete game summary.",
    "Alt Text Image": "Official header image for CatTuber game - Steam 1337970",
    "Canonical URL": "https://gusku.site/game/cattuber",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CatTuber\", \"description\": \"Looking for information on CatTuber? Check out the release date (Sep 9, 2022), developer insights from MMmmmoko, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"MMmmmoko\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MMmmmoko\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1337970/header.jpg?t=1662706978\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}