{
    "AppID": 2117790,
    "Name": "Crash Override",
    "Release date": "Sep 14, 2022",
    "About the game": "Overview Crash Override is a cyber roguelite action shooter. The mainframe has been infected by a malicious virus, and you must surf the cybernet, or risk total system infection. Rezz, power up, collect your arsenal, battle hordes of glitches - overpower the virus. Mow down hordes to power up and save the mainframe. Survive a run to save the core, or derezz while trying, and then rezz again. Match weapons and upgrades to create an overpowered build. Play Crash Override as one of 6 avatars against a horde of enemy glitches. Experience the cybernet with its unique visual style and driving retro synthwave soundtrack. Current Features Weapons - 12 weapons to collect - choose which to mix and match. Enemy Onslaught - Shoot, dash, and maneuver to take down hordes of enemy glitches (27+ different enemy types). Power Ups - Wide variety of weapon, health and power upgrades. Become Overpowered - Collect enough weapons and upgrades to demolish any opposition. Choose Your Path - Race ahead of the crash wave - choose from infinitely branching paths. Twitch Voting Mode - Help chat participate when streaming on the Twitch platform. Speed Run Mode - Endless variety of single path courses to test your mastery - challenge others to the same course to see who can get the best time. Estimated play time per run: 20-40 minutes Liberate CPU fragments from glitches in the mainframe. The more CPU fragments collected the faster your avatar becomes, and with enough CPU, the location of the virus is decoded. Reach CPU level 100+ to unlock the location of the virus. RAM fragments can be collected. RAM provides storage for new weapon and upgrade programs. Data fragments can be found. Data provides keys to unlock doors and access to locked caches. New features and content added this week. See Roadmap below. Possible Roadmap ( = Completed, = On-going / In-progress ) New weapon types (12 of ??) Weapon leveling New enemies (27 of ??) New big heads (9 of ??) New mini bosses (9 of ??) New enemy move sets (9 of ??) NG+ difficulty (up to NG+6) Stamina (power use) mechanic with dodge + dash Support for special modules (one in loadout at a time) (3 of ??) Dodge module: Increases maneuverability, and decreases power cost Magnet module: Increases drop pickup distance Repulsor module: Periodically pushes close enemies away Laser weapon Workshop integration (additional languages, etc) New general weapon upgrades (spread, random direction, additional direction NWSE upgrade drops, piercing) New area types (data cache, etc) Make your build with a series of stores and starting RAM at beginning of game mode Start with any weapon option Achievements (46 of ??) 'Wait for vote' option for twitch enabled games (Paused with UI continue button) Character and enemy animations Contextual tutorial (if player hasn't tried dodging mention dodging, etc) w/ toggle button on main menu Speed run random seed (add text as a seed to lock path to a single connection forward for each area) Showcase items that have been collected from previous runs Data fragment (used to open doors, open locked chests, spend between games for new avatars and power ups) Data fragments dropped by mini bosses and found in data caches RAM and data caches End of run review screen Enemy lineup (reveal new enemies in showcase / collection as they are seen from run to run) Full controller / gamepad support Enemy glitches auto-named with Twitch chat usernames",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2117790/header.jpg?t=1663350127",
    "Price": 2.99,
    "Developers": "TMFX Studios",
    "Publishers": "TMFX Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2117790/ss_8168823cce99a3cb0209468119a73ad6e9f659d4.1920x1080.jpg?t=1663350127,https://cdn.akamai.steamstatic.com/steam/apps/2117790/ss_0e16bdd0be5f509805a2d3bae4f569317d6251ae.1920x1080.jpg?t=1663350127,https://cdn.akamai.steamstatic.com/steam/apps/2117790/ss_31be2801a992073f3a7285f7669e90604f066cf0.1920x1080.jpg?t=1663350127,https://cdn.akamai.steamstatic.com/steam/apps/2117790/ss_918a32037be6c767700fa14d3e40823ac3d66ce0.1920x1080.jpg?t=1663350127,https://cdn.akamai.steamstatic.com/steam/apps/2117790/ss_28812eead300d262f7f6eec916a2a941d46a5bc5.1920x1080.jpg?t=1663350127,https://cdn.akamai.steamstatic.com/steam/apps/2117790/ss_5ade29f46631d77ba03a261ac8f630bc601e71c9.1920x1080.jpg?t=1663350127,https://cdn.akamai.steamstatic.com/steam/apps/2117790/ss_c537efa9cc29a78e69eedd14fbb9a5bc5e66faee.1920x1080.jpg?t=1663350127",
    "Slug": "crash-override",
    "Meta Title": "Crash Override: Sep 14, 2022, TMFX Studios and Full Overview",
    "Meta Description": "Looking for information on Crash Override? Check out the release date (Sep 14, 2022), developer insights from TMFX Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Crash Override game - Steam 2117790",
    "Canonical URL": "https://gusku.site/game/crash-override",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crash Override\", \"description\": \"Looking for information on Crash Override? Check out the release date (Sep 14, 2022), developer insights from TMFX Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"TMFX Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TMFX Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2117790/header.jpg?t=1663350127\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}