{
    "AppID": 1191770,
    "Name": "混世萌王喵霸霸 Cute Chaos Demon Nyanbaba",
    "Release date": "Sep 20, 2022",
    "About the game": "The super cute villain Nyanbaba is back again! This time, meow bully invaded 10 new scenes, found all the strange hidden points and cracked the magic of cat ear Nyanbaba! Contains jump out shock (cute)! And super cute Chinese dubbing! More scenes, more voice, more joy! Story background: Nyanbaba from the cat's ear planet came to earth in a flying saucer and burned his tongue with milk tea as soon as he landed. Angry nyambaba, she said she would retaliate against mankind with magic! Introduction to the game: This is a very scary (cute?) Looking for hidden item type click game! The game player plays the weak and stupid human, investigates suspicious hidden objects in various styles, and does not let Nyanbaba's magic trick succeed. Some of the hidden points are illogical or strange, and some may be ancient and strange big monsters (little cute?). Please find all hidden points within the time, otherwise the villain nyanbaba will jump out and scare the players with very, very scary (actually cute) Chinese voice! Playing methods and features: Lovely story setting, lovely art style, lovely Chinese dubbing. It contains 10 different scenes, and each scene contains 20 strange hidden points. Different from the traditional hidden goods game, it is not a reference comparison between the left and right of the two pictures, but a single picture, with a wider field of vision. After playing each scene repeatedly and accumulating 100%, the button to enter the second round mode will appear. Hidden points appear randomly in the first round, and all hidden points appear in the second round. Click error to deduct seconds. Deduct more seconds in the second round. Suitable for family fun of all ages. The rules are simple and there is no language understanding barrier. Hidden achievements are hidden in built-in secrets. Suitable for works, gifts for children and girlfriends, as well as all cat girl fans! Because the personal charm of cat girls may lead to mental retardation of some players, and the symptoms are deliberate failure. 超可愛的反派喵霸霸又回來啦！這次喵霸霸入侵了10個全新的場景，找到全部奇怪的隱藏點，破解貓耳娘喵霸霸的幻術！ 含有跳出式驚嚇（賣萌）！以及超萌的中文配音！更多場景，更多語音，更多歡樂！ 故事背景： 来自猫耳娘星球的喵霸霸驾驶着飞碟来到地球，刚刚降落就在喝奶茶时烫伤了舌头。震怒的喵霸霸表示要用幻術對人類發起抱虎（報復）！ 遊戲介紹： 這是壹款非常可怕（可愛？）的尋找隱藏物品類型的點擊遊戲！ 玩家扮演弱小愚蠢的人類，在各種風格的場景中，調查可疑的隱藏物品，不讓喵霸霸的幻術得逞。 隱藏點有些是不符合邏輯或是奇怪的，有些可能是古靈精怪的大怪獸（小可愛？）。 請在時間之內找到所有隱藏點，否則大反派喵霸霸會跳出來，用非常非常恐怖（嗲萌嗲萌）的中文語音嚇唬玩家！ 玩法和特色： 反差萌的背景設定，可愛的美術風格，嗲萌的中文配音。 包含10個不同的場景，每個場景包含20個奇怪的隱藏點。 不同於大家來找茬，並非2個圖左右參照對比，而是單獨壹幅畫面，視野更加開闊。 反復遊玩每個場景積累到100%後，會出現進入二周目模式的按鈕。 壹周目隨機出現隱藏點，二周目出現全部隱藏點。 點錯會罰秒，二周目罰秒加重。 適合全年齡闔家歡。 規則簡單，無語言理解障礙。 隱藏成就藏在內置秘籍裏。 適合送給小朋友和女朋友，還有所有貓娘控！ 因為貓妖的個人魅力可能導致壹些玩家降智，癥狀表現為故意失敗。",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1191770/header.jpg?t=1663765701",
    "Price": 0.89,
    "Developers": "冷笑黑妖",
    "Publishers": "冷笑黑妖",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1191770/ss_b6f710da59514b147bbaa58235e5a4c89642ae57.1920x1080.jpg?t=1663765701,https://cdn.akamai.steamstatic.com/steam/apps/1191770/ss_1c2de9255a9762d4e9756c2322a2346f9939f408.1920x1080.jpg?t=1663765701,https://cdn.akamai.steamstatic.com/steam/apps/1191770/ss_084768c27fa18c7d7c70658b27400b8ae2c2c009.1920x1080.jpg?t=1663765701,https://cdn.akamai.steamstatic.com/steam/apps/1191770/ss_7e83b856ebab3c5e07247c53f8f1a185255f7fbd.1920x1080.jpg?t=1663765701,https://cdn.akamai.steamstatic.com/steam/apps/1191770/ss_0889f7a0abf02c04acf698513e8e2698cb26ae61.1920x1080.jpg?t=1663765701,https://cdn.akamai.steamstatic.com/steam/apps/1191770/ss_d2af950fa96504a90af4c0f2da2240d2f798e513.1920x1080.jpg?t=1663765701",
    "Slug": "cute-chaos-demon-nyanbaba",
    "Meta Title": "混世萌王喵霸霸 Cute Chaos Demon Nyanbaba: Sep 20, 2022, 冷笑黑妖 and...",
    "Meta Description": "Looking for information on 混世萌王喵霸霸 Cute Chaos Demon Nyanbaba? Check out the release date (Sep 20, 2022), developer insights from 冷笑黑妖, and a complete ga...",
    "Alt Text Image": "Official header image for 混世萌王喵霸霸 Cute Chaos Demon Nyanbaba game - Steam 1191770",
    "Canonical URL": "https://gusku.site/game/cute-chaos-demon-nyanbaba",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6df7\\u4e16\\u840c\\u738b\\u55b5\\u9738\\u9738 Cute Chaos Demon Nyanbaba\", \"description\": \"Looking for information on \\u6df7\\u4e16\\u840c\\u738b\\u55b5\\u9738\\u9738 Cute Chaos Demon Nyanbaba? Check out the release date (Sep 20, 2022), developer insights from \\u51b7\\u7b11\\u9ed1\\u5996, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u51b7\\u7b11\\u9ed1\\u5996\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u51b7\\u7b11\\u9ed1\\u5996\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1191770/header.jpg?t=1663765701\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.89, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}