{
    "AppID": 1911690,
    "Name": "Dallaham",
    "Release date": "Sep 19, 2022",
    "About the game": "This is the first version of Dallaham, which I hopefully expand and improve in the future. Dallaham is a middle age city building game. You begin by building your first settlement to attract citizens. If you satisfy their needs and produce enough ressources, your city will grow and progress, allowing you to unlock new buildings beginning from buildings of the middle age towards the late industrial age. Additionally buildings can expand, depending on the happinness of your people. To increase the number of citizens, build parks and entertainment services in order to make them happy and attract more of them. A large map, tiling free building positioning and free camera movement allow you to freely plan your customized city and fulfill your vision of how it should look like! Ressource management Ressources, beginning with water and bread continuing over clothes to furniture, jewellery and more, serve the needs of your citizens. Additionally, you need to produce stone, coal, bricks and other building materials in order to build newer, larger buildings and expand your cities. Building ressources can only be mined near corresponding deposits. Tiling free construction A large map with planes, forests, mountains and hills gives you much freedom to plan your city. Tiling free construction of streets and building make sure, that you are not limited to rectangular squares. Free camera movement allows you to visit your city from the perspective of a pedestrian. Unlock new buildings by expanding your city You will progress through five development stages of your city from the camp phase over the farm phase, middle age city phase, classical industrialized phase towards the final stage of modern industrialized skyscrapers. Dynamic expansion Provide parks and entertainment buildings in order to make your citizens happy. Then their houses will dynamically expand with higher happinness. This enables you to increase the population density, the efficiency and the height of your city.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1911690/header.jpg?t=1663611004",
    "Price": 9.99,
    "Developers": "Dallaham",
    "Publishers": "Dallaham",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1911690/ss_1f3ed7d8dcd426c995e3724c7d33accc1d7cca42.1920x1080.jpg?t=1663611004,https://cdn.akamai.steamstatic.com/steam/apps/1911690/ss_acb5ca50e63c8a8e5fc723ec1bfc9e249cfa8212.1920x1080.jpg?t=1663611004,https://cdn.akamai.steamstatic.com/steam/apps/1911690/ss_a0591bc1535362904abcee6ecb8285f07d2c1b38.1920x1080.jpg?t=1663611004,https://cdn.akamai.steamstatic.com/steam/apps/1911690/ss_2815a4089b1cf296f92d56cc9c75643fee086d82.1920x1080.jpg?t=1663611004,https://cdn.akamai.steamstatic.com/steam/apps/1911690/ss_0ae14370513d0cf726310daf92dce2c49ad3670f.1920x1080.jpg?t=1663611004,https://cdn.akamai.steamstatic.com/steam/apps/1911690/ss_67a02efbecde165e0e92758958a07baca864698d.1920x1080.jpg?t=1663611004",
    "Slug": "dallaham",
    "Meta Title": "Dallaham: Sep 19, 2022, Dallaham and Full Overview",
    "Meta Description": "Looking for information on Dallaham? Check out the release date (Sep 19, 2022), developer insights from Dallaham, and a complete game summary.",
    "Alt Text Image": "Official header image for Dallaham game - Steam 1911690",
    "Canonical URL": "https://gusku.site/game/dallaham",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dallaham\", \"description\": \"Looking for information on Dallaham? Check out the release date (Sep 19, 2022), developer insights from Dallaham, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dallaham\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dallaham\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1911690/header.jpg?t=1663611004\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}