{
    "AppID": 2102770,
    "Name": "EEvol",
    "Release date": "Sep 16, 2022",
    "About the game": "EEvol - Electronic Evolution Simulator Create your own world, fill it with cells and watch them evolve. Edit DNA-s, monitor population count of species and give food to your favorite ones! EEvol is a super optimized, fast evolution simulator, simulating tens of thousands of cells at once. Game logic (circle physics, fluid simulation, cell behavior) runs entirely on the video card, making it blazing fast even on my low range AMD RX 550! World Generate one using the noise generator or build your own with the edit tools provided. Combine the two for maximal effect! Fluid: There are no early life without the oceans, so naturally EEvol comes with a fluid simulator tightly coupled with other physics. Rock and stones: Found at the bottom of the ocean, rocks are stationary, stones are tumbled by fluid flow as sand does in the bottom of the oceans. Gas bubbles: Inspired by the purple deep sea vents at the bottom of the oceans, which some believe was the origin of the organic life as we know it! Dead cells: Their off white color is the same as marine snow, a shower of organic material falling from upper waters to the deep ocean. Living cells: Each cell has a DNA which controls how it grows and behaves! They have to eat (gas bubbles or dead cells) to collect energy because every action has an energy cost. Organelles: Generate random ones automatically or define by hand! Cells can set their hormone levels, grow flagellum, sense their environment, modify their size, stick to things and many more! DNAs: Use the basic built in ones, create your own by hand or let evolution do the heavy lifting for you! Cells Cells are called blobs in this game. This is for legacy reasons, originally I released the game under the name 'Blob by bela'. This version is a rewritten version where game logic runs on the video card to be blazing fast! Species id: Each species has its own id. Blobs can only communicate with a blob with the same species id. Different species can have the same id, for example when a species is mutating, the resulting species will most likely have the same id. age: If a cell reaches the age of 10000 simulation steps it will die. E: Each blob needs energy to do anything. Can be regenerated by eating. When a blob is created with the egg DNA command it has 1000 E. hp: Hitpoints. Can decrease by tumbling forcefully with rocks or one cell can attack the other. When a blob is created with the egg DNA command it has 10 hp. pc: Program counter, which DNA instruction the blob will do next. pc timer: Cooldown between executing DNA instructions. Hormones: Each cell has 8 different hormone levels. Both DNA execution and behavior can be affected by these. Hormone pumps: Unused, will be removed. If table: Each cell have 8 slots to store conditionals to. DNA opcode 'jump to' is affected by these. Prio table Each cell have 8 slots to store input modifiers to. This affects the behavior of the cell. Each prio table slot identifies an organelle. If that organelle is an input organelle that has input data (for example a sense organelle sensed something) the prio table slot is considered valid. Each output organelle has a starting and ending prio table location ranging from 1 to 8. When it calculates an output it checks if the prio table entry at the starting prio location is valid. If not, it checks at starting prio location + 1. If not checks at starting location + 2. This continues up to the ending prio location. If no valid prio table slot found no output is performed. If a valid prio table slot is found the search stops. The input data is multiplied or added to a constant value and optionally a hormone value. The resulting value is the output value of the organelle. Each organelle type does a different thing with this value. Organelles: Each cell has 8 organelle slots. These can be passive (e.g size), input (e.g sensing) or output (e.g flagellum) organelles. What happens during one sim step Collision resolution: The blob reacts to things it collided with. It tries to connect to things if it has the appropriate connection organelle and it pokes each collided blob with different species id than its own. DNA execution: If the pc timer is 1 the pc-th instruction is executed. Most instructions take 50 simulation steps to execute. Growing a new organelle, fission and egg takes more. Input organelle step: Each input organelle where the cooldown is 0 tries to get input data. Output organelle step: Each output organelle where the cooldown is 0 parses the prio table and tries to get an output. DNA nothing: Does nothing organelle: slot, add/del, which organelle prio table: slot, input organelle slot, +/*, hormone slot, constant, is hormone in the calculation or not hormone: pump or level, slot, set or modify, constant if table: slot, value of what, comparisson, value of what/constant fission: mode, direction, delta h The cell divides into two, halfing the E and hp between the two cells. The new cell will have the same if table, prio table, hormone levels and organelles as the parent cell. absolute: Absolute direction. conn relative: Direction relative to the 'connection' organelle connection direction in the specified slot plus a constant. connect: 'Connection' organelle connecting to the new blob replace: 'Connection' organelle connecting to the new blob even if it is already connected, replacing the connected blob. chain: The new cell connects to the blob connected to the original cell, the original cell connects to the new cell, forming a chain. delta h: The new cell can have one hormone level different than the parent cell. The hormone level in the selected slot will be multiplied with the constans choosen. egg: mode, direction The cell divides into two, creating a new empty cell with 10 hp, 1000 E, age of 0, no if table, no organelles, no prio table, pc set to 0. absolute: Absolute direction. conn relative: Direction relative to the 'connection' organelle connection direction in the specified slot plus a constant. connect: 'Connection' organelle connecting to the new blob replace: 'Connection' organelle connecting to the new blob even if it is already connected, replacing the connected blob. jump to: address, negation, type address: The location to jump in the DNA. If the number specified is bigger than the DNA size it warps. one true: At least one selected if table comparissons needs to be true. False if none selected. all true: All selected if table comparissons needs to be true. True if none selected. suicide: The cells kills itself. mutated: Does nothing. Organelles E per use: How mutch energy it takes to use this organelle when used as an input or output. Cooldown: How many simulation steps it takes to use this organelle as input or output after it was used as one. E to develop: How mutch energy it takes to develop this organelle per simulation step. t to develop: How many simulation steps it takes to develop this organelle. Types hormone Set per organelle: - Given in DNA: slot, prio start, prio end As input: Always valid, current hormone lvl in slot. As output: Sets hormone lvl in slot to output value. Static: - neuron in Set per organelle: - Given in DNA: - As input: The sum of all output values sent to this blob since the organelle development or last read. As output: - Static: - flagellum Set per organelle: force Given in DNA: prio start, prio end As input: - As output: Sets the direction of the force applied. Static: - spikes Set per organelle: atk Given in DNA: - As input: - As output: - Static: Causes all colliding blobs with different species id atk damage. size Set per organelle: delta E max, delta hp max, radius, mass Given in DNA: - As input: - As output: - Static: Increases the max E and hp of the cell. Increases the cell radius and mass with the values provided. cell wall Set per organelle: def Given in DNA: - As input: - As output: - Static: Decreases the damage received from colliding cells with spikes with def. sense circle Set per organelle: type, radius Given in DNA: - As input: Valid if senses a circle with type specified in the radius specified. At world generation there is a variable called max sense r, this multiplied my 5 is the actual maximum sense distance. As output: - Static: - eat dead Set per organelle: bite size Given in DNA: - As input: - As output: - Static: By default all blobs eat E balls representing the gas of deep see vents. With this organelle it can no longer eat E balls but can eat dead blobs, taking bites out of them. connection Connections are work in progress. Set per organelle: connect to what, is rod, h check, is neuron out, is muscle, length, strength Given in DNA: prio start, prio end As input: Valid if connected, value is connection direction. As output: Can act both as muscle and/or neuron out. Static: The cell tries to connect to things it is colliding with. These can be rocks, all blobs, or blobs with the same species id. Strength is the max jerk it can withstand. connection modifiers These organelles are not organelles in their own but rather modify an already existing connection organelle. c h check Set per organelle: - Given in DNA: is checking hormone levels, comparisson, h slot, h val As input: - As output: - Static: Only works when connecting to a blob with same species id. Optional, can be turned on/off. One of the colliding cells hormone levels are checked and only connects if the comparisson is true. c neuron out Set per organelle: is neuron Given in DNA: - As input: - As output: Only works when connecting to a blob with same species id. Optional, can be turned on/off. Using the prio values from the original organelle it sends the output value to the cell connected. Static: - c muscle Set per organelle: - Given in DNA: is mucle, reference As input: - As output: Optional, can be turned on/off. If output value is 0, the connection length will be 0. If the output value is the reference value it will be the length originally given in the original organelle. If it is twice or more the reference amount the length will be twice the one originally given. Static: -",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2102770/header.jpg?t=1663349199",
    "Price": 5.99,
    "Developers": "Mihaly Sisak",
    "Publishers": "Mihaly Sisak",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2102770/ss_96e55b2a8236aeacd0b7d12e6b82fa7ee2a1de67.1920x1080.jpg?t=1663349199,https://cdn.akamai.steamstatic.com/steam/apps/2102770/ss_4b7773407b2884bafcf3b807174a634558f4adfd.1920x1080.jpg?t=1663349199,https://cdn.akamai.steamstatic.com/steam/apps/2102770/ss_813c73e3cfc9083e5aa80a26a72a356b21d96e94.1920x1080.jpg?t=1663349199,https://cdn.akamai.steamstatic.com/steam/apps/2102770/ss_ee864642f96be63e9a1717c8c51b0563cbe86f20.1920x1080.jpg?t=1663349199,https://cdn.akamai.steamstatic.com/steam/apps/2102770/ss_f442ee16dddb2f6b39664d5671ebc186d696ff75.1920x1080.jpg?t=1663349199,https://cdn.akamai.steamstatic.com/steam/apps/2102770/ss_26bb9f28fdf226b3c97a3ee51ad16fe2ea92f631.1920x1080.jpg?t=1663349199",
    "Slug": "eevol",
    "Meta Title": "EEvol: Sep 16, 2022, Mihaly Sisak and Full Overview",
    "Meta Description": "Looking for information on EEvol? Check out the release date (Sep 16, 2022), developer insights from Mihaly Sisak, and a complete game summary.",
    "Alt Text Image": "Official header image for EEvol game - Steam 2102770",
    "Canonical URL": "https://gusku.site/game/eevol",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"EEvol\", \"description\": \"Looking for information on EEvol? Check out the release date (Sep 16, 2022), developer insights from Mihaly Sisak, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mihaly Sisak\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mihaly Sisak\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2102770/header.jpg?t=1663349199\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}