{
    "AppID": 1160920,
    "Name": "Food Truck Simulator",
    "Release date": "Sep 14, 2022",
    "About the game": "/ Your father owned a food truck. Though the vehicle has grown old, it has become a cornerstone of your family's legacy. Now, in the blink of an eye, your father's gone. Now, the food truck belongs to you. Will you walk in your father's footsteps and live up to his name? Only one way to find out. DRIVING You can't take the 'truck' out of 'food truck'. Before you can set your stalls up, you have to actually get from your garage to wherever you decide to vend for the day. Be mindful of traffic, and congestions too! When you feel you're short on time do as your father did and veer off the beaten path. First come, first served! COOKING You might've thought that all there is to this business is fast food, but now that you're on the other side of the counter it's time to think again. Even so much as a slice of cheese can turn a classic burger into a cheeseburger special. So, what will it be, sir? Ketchup or mustard? SERVING Customers can be impatient and needy a lot. You'll find that you don't have all that much time to get them what they want and fit their palate as well. It'll be a challenge, but it's one your father has overcome, and surely so can you. Practice makes perfect, so go and knock them off their feet with your quality food! UPGRADING As your prestige grows, so does your repertoire of tricks and tools. Stay up to date with your fame as you follow your in father's footsteps. Make sure to outfit yourself with the newest, top-of-the-line equipment you (and your wallet) can muster. Ride the wave of fame. CUSTOMIZING The truck belongs to you and as the hands that own it change, so too should its décor. Adjust anything from the exterior's color to the interior layout, the bumpers, lights, and wheels. Show the city you're no less than your father was and hit the streets like you own them. ORDERING Each day is a new adventure, and each adventure requires sufficient provisions. Ingredients aren't permanent and will rot and spoil as the hours tick on by. Remember to stock up on not only the freshest but most desirable produce your clientele might demand of you. CLEANING The truck is dirty and has fallen to disrepair. Honour dad's memory by polishing it one last time. It's been a while since the truck has seen any use. Grab a bucket and a sponge, find a broom and get to cleaning. You'll need to be thorough, and it might take a while to make the truck spick and span, but now you have a duty to fulfill. Get to it! Key Features Renovating and expanding food truck. Wide range of customization options. Large catalogue of equipment options to choose from. Create your own recipes. Driving with traffic system. Detailed cooking system. Different locations across an entire city with different types of customers. Various events. Managing Living city with dynamic day and night cycle.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1160920/header.jpg?t=1663330626",
    "Price": 17.99,
    "Developers": "DRAGO entertainment",
    "Publishers": "DRAGO entertainment,Movie Games S.A.,HeartBeat Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1160920/ss_f1210cf6e280e9e0089ce4a6831b466d7b263b4d.1920x1080.jpg?t=1663330626,https://cdn.akamai.steamstatic.com/steam/apps/1160920/ss_8bad8c65c16a6e2c0e932577e3d93a71641e7390.1920x1080.jpg?t=1663330626,https://cdn.akamai.steamstatic.com/steam/apps/1160920/ss_543d178d23d8d56ebe82e27d452aebd6a2a81d03.1920x1080.jpg?t=1663330626,https://cdn.akamai.steamstatic.com/steam/apps/1160920/ss_08c532465db5fe74c3cd4b326244970ce3137517.1920x1080.jpg?t=1663330626,https://cdn.akamai.steamstatic.com/steam/apps/1160920/ss_1ddb561235be6c15a2b0931b0d7ec01210a82980.1920x1080.jpg?t=1663330626,https://cdn.akamai.steamstatic.com/steam/apps/1160920/ss_73a9ee7a5c7b1aec7527df02aebda7a3b14595a3.1920x1080.jpg?t=1663330626,https://cdn.akamai.steamstatic.com/steam/apps/1160920/ss_5f3002539e50c289e90b3273e42628ff2e662369.1920x1080.jpg?t=1663330626,https://cdn.akamai.steamstatic.com/steam/apps/1160920/ss_54ce6415ed8ec2d229ae295577cef04a70fdccee.1920x1080.jpg?t=1663330626,https://cdn.akamai.steamstatic.com/steam/apps/1160920/ss_85b8044ef61c57b82da6113b0a77aa478e02a44b.1920x1080.jpg?t=1663330626,https://cdn.akamai.steamstatic.com/steam/apps/1160920/ss_961bf0204c014e4343d170c2600ab5aed5f8da71.1920x1080.jpg?t=1663330626",
    "Slug": "food-truck-simulator",
    "Meta Title": "Food Truck Simulator: Sep 14, 2022, DRAGO entertainment a...",
    "Meta Description": "Looking for information on Food Truck Simulator? Check out the release date (Sep 14, 2022), developer insights from DRAGO entertainment, and a complete ...",
    "Alt Text Image": "Official header image for Food Truck Simulator game - Steam 1160920",
    "Canonical URL": "https://gusku.site/game/food-truck-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Food Truck Simulator\", \"description\": \"Looking for information on Food Truck Simulator? Check out the release date (Sep 14, 2022), developer insights from DRAGO entertainment, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"DRAGO entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DRAGO entertainment,Movie Games S.A.,HeartBeat Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1160920/header.jpg?t=1663330626\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}