{
    "AppID": 2127070,
    "Name": "九天傳之封神登九天",
    "Release date": "Sep 22, 2022",
    "About the game": "《九天傳之封神登九天》是一款仙侠题材的游戏，2022仙侠ARPG巅峰之作。上古时期，盘古开天辟地，演化出四海八荒，万物生灵，人族始祖女娲、魔族始祖蚩尤和神族始祖伏羲，创造了三族并在这六界中和平共生。中古初期，各族不断发展，修炼理念开始产生分歧，争端也渐起，到了后期竟势同水火，最终魔族挑起了一场惊天大战。这场旷日持久的大战导致世界四分五裂，最终魔族战败，退到了一个贫瘠的界域，从此再无音信。神族占据了天界，人族留在了人界。然而，人界突然诞生了一个旷世邪魔——帝释天。他大开杀戒，冰封昆仑，一夜之间，扬名天下的昆仑派荡然无存。沉浸在杀戮的快感中，帝释天不满足于此，开始率众妖魔袭击人界各大门派，寻找天帝宝库下落，天帝宝库传为天帝修真之所藏有太初神物，意图用宝库的神力一统天下。青云派亦遭受魔族荼毒，主角收到讯息及时返回青云山，欲助掌门赶跑妖魔。在所有青云弟子的努力下，青云山暂保太平，主角开始踏上了修仙入境，计划重振青云，立志成为一方主神。 游戏一共有3大副本，六大玩法，4种养成系统 1.宝石塔副本 人物达到240级后可以选择进入宝石塔副本进行挑战，挑战成功当前层数可以获的装备以及宝石，宝石可提高玩家身上装备的属性，身上装备的宝石全部到达等级上限后，可激活中间的觉醒宝石增加战力，获得更高的属性。 每20.40.60.80.100层为公共怪物地图，公共层可产出大量稀有道具，等你来拿！ 每日首通100层更有宝石觉醒石相送。 2.材料副本 每当玩家开放新的外观进阶时，都会开放相应的材料副本，如光翼、阵法、仙迹等。 材料副本是进阶材料的主要获取途径，但也能通过野外掉落或商城购买获得进阶材料。 材料副本每种每日只能进入2次，千万不要错过。 3.通天塔 玩家等级达到300级，可根据主线进度解锁通天塔副本。 通天塔挑战胜利可获得海量元宝，需要限时打败所在层数的怪物。此外，元宝主要用于切割升级和伙伴升级的。提升自身战力，更加畅快秒揍怪物。让你体验前所未有的快感。 玩法 1.冲上九重天 九重天活动中，每进入下一层都会获得通关奖励，每日每层奖励只可领取一次，每日开放活动。参与活动可获得大量进阶材料。 战下一层需要云霄令，可以通过九重天地图的BOSS掉落。活动结束未使用的云霄令可在下次活动中使用。 2.护送灵材 镖车运送完成可获得海量经验以及元宝，可通过刷新镖车提升灵材的等级获得的经验与元宝会大大增加。 注意活动的时间哦，在活动期间可获取双倍奖励，对于想提升等级的太合适不过了。 3.激情泡点 在活动期间内可进入，在该地图可获得海量经验收益。想提升等级的太合适不过了。 地图内有2.3.5倍挂机地点，站位时可要看清楚。 4.激战BOSS 野外BOSS地图：可选择当前最高挂机刷怪的地图，击败怪物后可获得收益。 首饰BOSS地图：选择当前修仙段位的怪物地图，击败怪物后可获得装备提升战力。 稀有BOSS地图：击败当前怪物地图，获得怪物碎片，攒够等量碎片后可合成提升坐骑守护，用于轻松挂机。 仙将BOSS地图：击败当前怪物地图，获得仙将碎片，攒够等量碎片后可合成提升战力。 5.龙虎争霸赛 龙虎争霸赛每日晚19:30-19:50开启，玩家120级后可参与活动 进入活动地图后，玩家会随机分为龙、虎两个阵营。活动中死亡不掉落装备，可尽情享受PK。 击败敌对阵营玩家可获得大量积分，助攻、杀怪均可获得额外积分奖励。除此之外，活动期间还可以完成争霸任务获得丰厚奖励。 活动结束后，积分多的一方获胜，根据阵营胜负和个人积分高低可获得丰厚的奖励。 6.天降金龟 150级后可参与击败元宝龟，元宝龟携带大量宝藏，击败可获得海量资源提升战力，进一步巩固自己霸主地位。 击败金龟后可拾取红包，元宝，进一步提升自身属性战力。 养成系统 1.特戒 游戏中包含多种珍贵特戒，不仅包含大量属性，还各自拥有独特的强力技能，可在危机中扭转战局。 以下为特戒所拥有的技能： 麻痹特戒：在攻击敌人时有概率石化对方，使其无法移动、施法、攻击 中毒特戒：可有几率让敌人中毒每秒最大生命值伤害，同时降低攻击和防御 护体特戒：受到玩家攻击时触发，可提供一个可抵挡地方玩家1次伤害的护盾 吸血特戒：当血量低于一定程度时，攻击敌人可吸取大量固定生命值 相同特戒可通过特戒神石升级为更高阶的特戒。特戒装备等阶越高，凑齐后激活的特戒效果越强，凑齐特戒还可以激活特戒地图，助您快速升级特戒！ 2.仙将 可通过运营活动以及仙将BOSS击败掉落仙将碎片合成，激活成功后会增加大量属性，提升仙将每一阶需要等量仙将突破丹，提高到等阶后打开获得了被动技能属性。 集齐套装后会获得特殊属性效果，所有仙将录效果叠加生效。 3.仙器 仙器系统内可以培养仙之腕，仙之带，仙之戒，仙之剑，提高等阶可提供不同的属性。 1.仙之腕 仙之腕升级后可以获得大量的生命值属性提升。 2.仙之带 仙之带升级后可以获得大量的暴击率提升和暴击伤害属性提升 3.仙之戒 仙之带升级后可以增加目标中毒的伤害，降低对方的防御和攻击 4.仙之剑 仙之剑升级后可以获得大量的攻击提升和无视对方防御并且增加伤害 4.坐骑 通过运营活动以及击败稀有BOSS获得坐骑碎片集齐可合成坐骑，消耗坐骑丹可提高坐骑等阶获得大量属性，当阶数达到当量阶数时会激活被动技能。",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2127070/header.jpg?t=1663844985",
    "Price": 0.0,
    "Developers": "九天傳之封神登九天",
    "Publishers": "九天傳之封神登九天",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2127070/ss_3ca01c5c99cb0a451b65b5c766a78593cb9b968d.1920x1080.jpg?t=1663844985,https://cdn.akamai.steamstatic.com/steam/apps/2127070/ss_713285cc039a336ec8605c940d4b27e6b90b7eb0.1920x1080.jpg?t=1663844985,https://cdn.akamai.steamstatic.com/steam/apps/2127070/ss_00108786204219e9954bcc56b595ee6573838f4b.1920x1080.jpg?t=1663844985,https://cdn.akamai.steamstatic.com/steam/apps/2127070/ss_0e5c7a7562619a4af8729de35de1568191e96b7a.1920x1080.jpg?t=1663844985,https://cdn.akamai.steamstatic.com/steam/apps/2127070/ss_0bdbe7d52314005af851c725603e7c722f4ba11c.1920x1080.jpg?t=1663844985",
    "Slug": "",
    "Meta Title": "九天傳之封神登九天: Sep 22, 2022, 九天傳之封神登九天 and Full Overview",
    "Meta Description": "Looking for information on 九天傳之封神登九天? Check out the release date (Sep 22, 2022), developer insights from 九天傳之封神登九天, and a complete game summary.",
    "Alt Text Image": "Official header image for 九天傳之封神登九天 game - Steam 2127070",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u4e5d\\u5929\\u50b3\\u4e4b\\u5c01\\u795e\\u767b\\u4e5d\\u5929\", \"description\": \"Looking for information on \\u4e5d\\u5929\\u50b3\\u4e4b\\u5c01\\u795e\\u767b\\u4e5d\\u5929? Check out the release date (Sep 22, 2022), developer insights from \\u4e5d\\u5929\\u50b3\\u4e4b\\u5c01\\u795e\\u767b\\u4e5d\\u5929, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4e5d\\u5929\\u50b3\\u4e4b\\u5c01\\u795e\\u767b\\u4e5d\\u5929\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u4e5d\\u5929\\u50b3\\u4e4b\\u5c01\\u795e\\u767b\\u4e5d\\u5929\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2127070/header.jpg?t=1663844985\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}