{
    "AppID": 2073920,
    "Name": "百将争霸",
    "Release date": "Sep 5, 2022",
    "About the game": "《百将争霸》是一款架空题材的策略类游戏。游戏讲述了一个在战乱中逃离的年幼王子，在先王的旧部帮助下逐步成长，召集勇士并组建自己的城池，最终打败大魔王，光复王国的故事。玩家在游戏中会收复很多古今中外的历史名城，我们也提供了一些城池简介；会收集许多不同时代的英雄人物，了解他们的背景故事；会与其他玩家一起组建军团，成为志同道合的好朋友，一起协作完成任务等等，《百将争霸》是一款非常健康的游戏，既能体验各种副本关卡乐趣，又能增进历史知识。 游戏玩法介绍 1、主线推图 世界地图的城池随着推图逐渐线性开放，主线副本受当前玩家等级和前置城池通关情况限制。点击有小箭头的城池或者直接点击底部收复按钮定位当前城池去打开城池关卡列表，该列表可以横向滑动，每个关卡也有前后限制，已经通关的关卡会有“已通关”盖章，当前关卡的守关英雄头像正常显示，未开启的关卡上是个问号。这个面板点击任意空白区域关闭。点击当前关卡即可打开布阵面板。 《百将争霸》的战斗为全自动战斗，战斗开始后双方英雄和侍卫开始对决，整场战斗时长为3分钟，当一方英雄和侍卫全部失败视为战斗失败；当战斗时间结束，双方仍然为决出胜负，则视为进攻方失败；在战斗右下侧有战斗加速按钮，随着玩家等级提高，逐步开放2倍，3倍速战斗和跳过战斗按钮，点击跳过战斗后，立即结算战斗胜负；英雄在战斗中会逐渐增加怒气，攻击敌方也会增加怒气，当怒气达到一定数值后会自动释放大招，玩家使用什么样的英雄组合成队伍进行战斗，如何搭配大招和被动技能是游戏战斗的核心策略。 2、 英雄战 点击已经通关的城池或者在主线通关的时候就接受英雄挑战，则会进入英雄战列表界面。 左侧为英雄形象，挑战完成右侧关卡，则可以拜访该英雄，获得该英雄的碎片，当碎片数量满足一定条件即可获得该英雄或者对该英雄升星。 右侧关卡是一系列线性关卡，各个城池的英雄战关卡数量不尽相同。在列表项的左侧是挑战胜利后的奖励，左侧为挑战按钮和挑战消耗的粮草。当玩家挑战胜利后，挑战按钮会转变为扫荡按钮，点击扫荡按钮可打开扫荡界面。 3、城战 沙盘显示规则 1.沙盘界面中，选中左侧圆形单选按钮，对应满足显示要求的城池，会播放提示动画。 2.军团沙盘中，显示的城池按本军团中推进收复最远的城池显示 3.勾选按钮选中取消显示后，对应的城池状态，将不再显示 城池类型： 1.共三种类型:一级城、二级城、三级城、四级城 2.其中三、四级城分为：魔王军团占领、中立城、玩家军团占领 城战开启系件 1.玩家军团占领的三、四级城的城战:需要军团宣战，宣战后倒计时结束后开启攻打； 2.一级、二级城战、无归属和魔王军团占领的三、四级城，可以随时派兵攻打。(免战城池除外) 3.一级、二级城战:随时可以派兵攻打(免战城池除外) 城战的胜负结束规则 　　1.每个城池都有特定数量的城防NPC，城防NPC全灭后，攻击方胜利 　　2.攻击方持续30秒无攻击部队派出，则防守方胜利 　　3.攻击方获胜时，城池进入免战状态，暂不可攻击，且NPC城防军恢复至初始数量 　　4.防守方获胜时，城池不进入免战状态 城池占领规则 　　1.城池的占领主体—军团，即必须加入军团后才能占领 　　2.需要宣战的三、四级城:攻击方胜利时，城池由宣战军团占领 　　3一级城、二级城、无归属和魔王军团占领的三、四级城:攻击方胜利时，若击杀最后一个城防NPC的玩家所属军团拥有与该城池接城的城池(成者该军团未占领城池)且军团统治点满足占领要求，则该军团占领 　　4.防守方获胜不改变城池归属 　　5.占领城池需要消耗军团的“统治点”，所有城池的统治点不能高于军团拥有的统治点上限 　　6.占领不同等级的城池所需要的统治点不同 派兵规则 　　1.进入城战后，玩家只能在攻方、守方中选择一方派遣部队，每只部队必须由5名英雄组成 　　2.玩家军团占领的三、四级城规则 　　·进攻:必须是宣战后，只有宣战的军团成员可派兵进攻 　　·防守:只有占领此城池的军团成员可随时派兵防守 　　·第三方军团势力无法参与三、四级城的城战 　　3.一级城、二级城、无归属和魔王军团占领的三、四级城规则 　　·无论玩家是否加入军团，均可随时向城池派兵 　　·城池属于己方军团时，只能派兵防守 　　·城池不属于己方军团时，可选择进攻或防守，选择一方后，在本次城战结束前无法攻、守转换。 公共规则 　　1.城战开始后，部队无法撤退 　　2.军团成员可以在军团大营驻扎部队，由有派遣军团部队权限的军团官员统一派兵，派出部队的击杀奖励归属部队所属玩家个人 　　3.同一个英雄在同一时间只能参与一场城战，并且只能在一支部队里出现 4.阵亡规则:全部英雄和侍卫全都阵亡后会算作整支部队阵亡 5.阵亡的英雄可以使用特殊道具对整支队伍复活 　　6.处于战斗中的城池信息面板中会显示简略的攻守方势力对比，点击城战信息后可以查看攻守方势力详细数据 　　魔军攻城规则 　　1.魔军势力会在每天固定时间随机对世界上的城池发起进攻、掠夺 　　2.魔军攻城前十分钟开始，玩家只能作为防守方参战 　　3.魔军攻城倒计时十分钟时还在城战的队伍，会立即遣返并把奖励以邮件的形式结算给玩家 　　4.击败魔军攻城的队伍会获得大量奖励 　　军团集火规则 　　1.军团集火只能由有该权限的军团官员设置，一个军团同时只能集火3个城池 　　2.集火会在集火时取集火后的一场城战结束有自动消失，也可以由有权限的官员手动取消 3.沙盘中集火城池会有对应的集火图标显示，上面的数值为当前本军团在此次城战中剩余部队数量 4、竞技场 玩家达到一定等级后开启竞技场，竞技场入口在内城竞技场建筑上。 战斗胜利时，若防守方的排名高于进攻方，排名将对调 战斗时间超时，视为挑战方失败，名次不变 提高历史最高排名后可以获得钻石奖励 竟技场分为初级、中级、高级、传奇四个段位，达到相应等级且排名提升至本段位前十名可以晋级到下一段位 每日可以免费挑战5次，每日5:00重置挑战次数 排名越高，奖励越多，奖励每日21:00通过郎件发送 竞技场商店的道具具有每日限购次数，次数不能购买，只有等待第二日重置。 竞技场奖励的购买次数为终身限购，购买后就不能再次购买了。 5、副本玩法入口-城门 副本入口在内城开启后开放，通过城门进入，副本列表中的各个副本都有开启等级限制，达到等级要求后自动开放，列表可以横向滑动并且列出了各个副本的当日剩余次数和主要奖励。 6、 英雄远征 每日可重置一次可挑战关卡，重置后可以快速速通 重置次数每日凌晨5点刷新 排行榜前30名可获得排名奖励，每日0点结算并通过邮件发放奖励 挑战过一定关卡后，可解锁精英挑战 精英关卡战斗胜利获得星星条件: 一星:战斗胜利 二星:战斗胜利且至少存活4个英雄 三星:战斗胜利且所有英雄存活 7、 巅峰对决 对已有的英雄镜像发起挑战，挑战成功可获得天赋石。有概率刷新出尚未拥有的英雄，可以选择挑战难度，难度越高奖励越好。英雄镜像每日凌晨5点，会自动更新。 8、 兵种副本 玩家30级开启兵种副本，点击中间的英雄形象会获得一定产出，每次点击都会消耗剩余次数，剩余次数随时间不断恢复，最高可以累加到50次，注意这里的剩余次数不会每日重置。当进度条被点完以后，即可挑战该英雄，挑战胜利后可以进入下一个兵种副本。 9、 无尽试炼 玩家达到44级可以参与无尽试炼挑战。每次挑战都会获得奖励，挑战一定关卡后还可以额外获得宝箱。玩家挑战成功不会扣除挑战次数，挑战失败则挑战次数-1，玩家每日挑战次数用完后可以购买，购买价格随着当日购买次数增加而逐渐增加，次日重置。 玩家每日有1次重置无尽试炼的机会，重置后会回到第1关；玩家可以点击扫荡，直达最高关卡，并获得扫荡关卡的所有奖励。",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2073920/header.jpg?t=1662426635",
    "Price": 0.0,
    "Developers": "百将争霸",
    "Publishers": "百将争霸",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2073920/ss_34a12c74e74ba2ffe6a66c4a1fc66100e7bd7e0b.1920x1080.jpg?t=1662426635,https://cdn.akamai.steamstatic.com/steam/apps/2073920/ss_06db252eaa6927085512e4509f259d9283cae05b.1920x1080.jpg?t=1662426635,https://cdn.akamai.steamstatic.com/steam/apps/2073920/ss_9019a1f9cadb3204d024d203685062672b75fc7c.1920x1080.jpg?t=1662426635,https://cdn.akamai.steamstatic.com/steam/apps/2073920/ss_c9431d2145886b40c78904b1a70b51ad1e82a5d1.1920x1080.jpg?t=1662426635,https://cdn.akamai.steamstatic.com/steam/apps/2073920/ss_f2c9dbb35947a07e5f39c69c6f46ab5df18ac4c0.1920x1080.jpg?t=1662426635",
    "Slug": "",
    "Meta Title": "百将争霸: Sep 5, 2022, 百将争霸 and Full Overview",
    "Meta Description": "Looking for information on 百将争霸? Check out the release date (Sep 5, 2022), developer insights from 百将争霸, and a complete game summary.",
    "Alt Text Image": "Official header image for 百将争霸 game - Steam 2073920",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u767e\\u5c06\\u4e89\\u9738\", \"description\": \"Looking for information on \\u767e\\u5c06\\u4e89\\u9738? Check out the release date (Sep 5, 2022), developer insights from \\u767e\\u5c06\\u4e89\\u9738, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 5, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u767e\\u5c06\\u4e89\\u9738\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u767e\\u5c06\\u4e89\\u9738\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2073920/header.jpg?t=1662426635\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}