{
    "AppID": 2126340,
    "Name": "恋ひ焦がるるカミカクシ",
    "Release date": "Sep 12, 2022",
    "About the game": "'Koikogarurukamikakushi' is a visual novel created by 'GloryField'. Story Memories and recollections are irreplaceable. ━ Even if they are painful. Tetsuya Kai sneaks into school at night to pick up a forgotten item and is suddenly attacked by an unidentified monster. In his desperate situation, he is saved by his classmate Tomomi Soshi. Tetsuya joins Tomomi's occult research club by chance, and he pursues the mystery surrounding the 'Shikigami' that attacked him and saved him. Character 'He wants me to join the occult research club. I'm not sure I want to.' Tomomi Soshi A shikigami master who manipulates 'shikigami,' a paper used for centuries in the region where the protagonists live. She is in pursuit of the sorcerer who is said to have unleashed it while defeating the 'black ceremonial paper' that appears and disappears. However, she lives her life as a high school girl as normal and is currently a sophomore. She has quite a sweet tooth and can't live without a sugar stick when drinking coffee. 'You see, I'm an occultist.' Shizuku Uthikawa She is a junior at the high school where the main character attends. She is good-looking, intelligent, and athletic, and is admired throughout the school. She is also a hard-core occult enthusiast, going to various haunted places and attempting to take ghost photographs. She has a natural disposition and is able to interact with everyone without dividing the group. 'No, it's ....... Not really a friend, more of a mean 'senior'.' Mizuki Amano She is a freshman at the high school where the main character attends. For some reason, she is able to use 'Black Shikishi'. She loves books and reads everything, regardless of genre. She rarely converses with others and is a communicator. He is also slightly concerned about it. 'What I'm about to tell you is, in essence, the underside of the world.' Natume Futami A teacher who teaches history at the protagonist's high school. He is nicknamed 'Futamin' by his students. She is the advisor of the occult research club to which Tomomi belongs. She supports the Soshi family, with whom he is related. She dresses too freely in a hoodie and lab coat, but she thinks he looks good. Staff Planning, original drawings, character design : Koki shiba Planning and Program : sekky Scenario : Koshin BGM・SE : jerky BGM : CHERRY Background : mictle UI : Artorias",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2126340/header.jpg?t=1662983463",
    "Price": 10.49,
    "Developers": "GloryField",
    "Publishers": "GloryField",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2126340/ss_36ddac9259c04288b4d4afbc0bb7d97a76748c70.1920x1080.jpg?t=1662983463,https://cdn.akamai.steamstatic.com/steam/apps/2126340/ss_dc3725cae3cbc9481cb796c28a05d90ddf809afc.1920x1080.jpg?t=1662983463,https://cdn.akamai.steamstatic.com/steam/apps/2126340/ss_b24e3ed88829e25faad603bc05a06e77f880755e.1920x1080.jpg?t=1662983463,https://cdn.akamai.steamstatic.com/steam/apps/2126340/ss_de1f2fc0c684bbaf1e8dcabc6f7598a408197bb1.1920x1080.jpg?t=1662983463,https://cdn.akamai.steamstatic.com/steam/apps/2126340/ss_d16e9bc937b00f1774218c96428eb413c43f0071.1920x1080.jpg?t=1662983463,https://cdn.akamai.steamstatic.com/steam/apps/2126340/ss_129ade5de4cbb425acb94091e8ccc9a0b9991a8e.1920x1080.jpg?t=1662983463",
    "Slug": "",
    "Meta Title": "恋ひ焦がるるカミカクシ: Sep 12, 2022, GloryField and Full Overview",
    "Meta Description": "Looking for information on 恋ひ焦がるるカミカクシ? Check out the release date (Sep 12, 2022), developer insights from GloryField, and a complete game summary.",
    "Alt Text Image": "Official header image for 恋ひ焦がるるカミカクシ game - Steam 2126340",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u604b\\u3072\\u7126\\u304c\\u308b\\u308b\\u30ab\\u30df\\u30ab\\u30af\\u30b7\", \"description\": \"Looking for information on \\u604b\\u3072\\u7126\\u304c\\u308b\\u308b\\u30ab\\u30df\\u30ab\\u30af\\u30b7? Check out the release date (Sep 12, 2022), developer insights from GloryField, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"GloryField\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GloryField\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2126340/header.jpg?t=1662983463\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}