{
    "AppID": 2053760,
    "Name": "Haunted Girls",
    "Release date": "Sep 25, 2022",
    "About the game": "Story: As the apprentice of the Necromancer, you've ventured out of the Human Safety Zone in order to conduct research on the Undead. Having lost your way in the woods, you come across a young female Zombie, a Jiangshi, and a Vampire, who then lead you to their demon school where you are to study as their exchange student... About This Game: This gal game combines both horror and romance for an experience overflowing with thrills. What will be your fate? A sweet, happy ending or a truly unspeakable one? Whether you live happily ever after with your Undead female companions is up to you! 'Haunted Girls' is a novel game with multiple endings, in which you will have conversations with three heroines, Floren, Mei Gui, and Amitie, and sometimes make important choices, and enjoy the consequences of each choice. It is up to you to decide whether your love for the heroine will be fulfilled or not! NOTE: You can save and load your progress at any time. Note: Due to the graphic nature of some scenes, this game is not suitable for those under 12 years of age. About the Characters: You (Main character): Though in the unique position of the Necromancer's apprentice, you are just a human. In order to conduct research on the Undead, you've now ventured out of the Human Safety Zone, where the Undead were unable to harm you... Will an encounter with three charming ladies be for the better...or for the worst? It's up to you Floren: A young Vampiress. Strong-willed and domineering. Though she may come off as condescending, she is in fact quite soft-hearted. As you two grow more familiar, she's likely to open up to you even more. But can you meet her expectations? Mei Gui: A young Jiangshi and well-known demon of ancient China. Her appearance hints at her youth, and she is quite friendly with you. Be wary, however, of betraying her trust...unless you wish to see a side of her you never knew. Amitie: A young Zombie maiden. Can you bring to fruition a love that transcends both life and death? This gentle and gracious maiden is capable of becoming frighteningly possessive under certain circumstances. She wishes to possess both your body and your soul, but can you truly cater to her wishes? About Fanfiction and Gameplay Video Uploads: We generally welcome both fanfiction and uploading videos of gameplay, with the exception of anything that violates public morals, any bullying or slander, or anything that detracts from the game experience. We give approval to upload gameplay videos of both the full version and the free demo version. ★Please do not upload videos of gameplay only, with no voice or text commentary from the player. ★When broadcasting or uploading a video, please include the game name in the video title and include the game webpage URL in the video details. ★Please only show 1 character's story in the video/broadcast (do not upload all 3 characters' stories). ★Please be aware that we may request any fanfiction or videos/broadcasts violating our terms be taken down.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2053760/header.jpg?t=1664119960",
    "Price": 4.99,
    "Developers": "ひとりサークル「匙投げ部」",
    "Publishers": "Waku Waku Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2053760/ss_95450a9bca27d090589cd6842b64d5d36336099c.1920x1080.jpg?t=1664119960,https://cdn.akamai.steamstatic.com/steam/apps/2053760/ss_fdc8f2d5b90b0420e16f00d884ce9daac5d175f1.1920x1080.jpg?t=1664119960,https://cdn.akamai.steamstatic.com/steam/apps/2053760/ss_e943b9c5e4dcf3ea0f9569ad7da565181b6256fa.1920x1080.jpg?t=1664119960,https://cdn.akamai.steamstatic.com/steam/apps/2053760/ss_36d36f62c10787bea98089cf4cc891eb6e856416.1920x1080.jpg?t=1664119960,https://cdn.akamai.steamstatic.com/steam/apps/2053760/ss_85d8022c2c5eb94007f441e6ad75c6caf1846b94.1920x1080.jpg?t=1664119960",
    "Slug": "haunted-girls",
    "Meta Title": "Haunted Girls: Sep 25, 2022, ひとりサークル「匙投げ部」 and Full Overview",
    "Meta Description": "Looking for information on Haunted Girls? Check out the release date (Sep 25, 2022), developer insights from ひとりサークル「匙投げ部」, and a complete game summary.",
    "Alt Text Image": "Official header image for Haunted Girls game - Steam 2053760",
    "Canonical URL": "https://gusku.site/game/haunted-girls",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Haunted Girls\", \"description\": \"Looking for information on Haunted Girls? Check out the release date (Sep 25, 2022), developer insights from \\u3072\\u3068\\u308a\\u30b5\\u30fc\\u30af\\u30eb\\u300c\\u5319\\u6295\\u3052\\u90e8\\u300d, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u3072\\u3068\\u308a\\u30b5\\u30fc\\u30af\\u30eb\\u300c\\u5319\\u6295\\u3052\\u90e8\\u300d\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Waku Waku Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2053760/header.jpg?t=1664119960\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}