{
    "AppID": 1946970,
    "Name": "Isle of Arrows",
    "Release date": "Sep 8, 2022",
    "About the game": "Isle of Arrows is a fusion of board game and tower defense, in which you place randomly drawn tiles to build defenses on an ever-growing piece of land. Tile-Placement meets Tower Defense: Isle of Arrows is a unique blend of genres that adds a new strategic puzzle element to the Tower Defense formula. Roguelike structure: Each run is randomly generated with different tiles, enemies, rewards and events. Playing through campaigns unlocks more elements to appear in the game. Modes &amp; modifiers: A variety of game modes, guilds, game modifiers, and challenges make each playthrough unique and add endless replayability. Message from the developer: RNG in Isle of Arrows Isle of Arrows offers near endless replayability by combining Tower Defense with random tile drawing mechanics and roguelike elements. This requires you to plan ahead, but also adapt your strategy each turn. Consider the placement of each tile carefully! The order and type of tiles is randomly generated, but you are guaranteed to draw set amount of towers, paths, and buildings every X tiles. This mimics the luck of the draw mechanics of many board games and is what makes Isle of Arrows unique. Gameplay Each round, you place randomly drawn tiles on the isle. Spending coins allows you to skip a tile. When you're ready, start the next enemy wave and watch your placed defenses in action. Towers attack the invaders. Roads build out the path the enemies walk on. Flags extend the isle, giving you more space to build. Gardens reward you with coins. Taverns boost all adjacent archery towers. And so on. Features 3 game Modes: Campaign, Gauntlet, Daily Defense 3 themed campaigns that each have their own unique set of tiles 4 guilds that each have their own playstyle 70+ tiles 75+ bonus cards and relics 10+ events that can help or hinder you 10+ game modifiers 9 Puzzle style achievements Randomly drawn bonus cards give access to resources, upgrades, and buffs. What Isle of Arrows offers A new spin on the Tower Defense formula Endless replayability through randomly drawn tiles A diverse range of towers, tiles, bonus cards, and events Beautiful minimalist graphics Brutally difficult challenges What Isle of Arrows does not offer Free selection over what towers to build Tower upgrades &amp; manual targeting options Deckbuilding mechanics Multiplayer Skins and customization About the Developer Gridpop is a 1-person game development studio run by Daniel Lutz, a game industry veteran best known for his work as Creative Director for Hitman GO and Lara Croft GO at Square Enix Montreal.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1946970/header.jpg?t=1662641986",
    "Price": 11.69,
    "Developers": "Gridpop",
    "Publishers": "Gridpop",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1946970/ss_0b2fadd7fad9b3507bb18cf4a502452fa9d066d0.1920x1080.jpg?t=1662641986,https://cdn.akamai.steamstatic.com/steam/apps/1946970/ss_136fae1249e72b35cad2dbf6f7c21e91c694d3b3.1920x1080.jpg?t=1662641986,https://cdn.akamai.steamstatic.com/steam/apps/1946970/ss_d5d316d15a011309ce6879be0b33dc87c50a31d6.1920x1080.jpg?t=1662641986,https://cdn.akamai.steamstatic.com/steam/apps/1946970/ss_fcb01dfcdc824f8db8ab8985705ac862a24b3a76.1920x1080.jpg?t=1662641986,https://cdn.akamai.steamstatic.com/steam/apps/1946970/ss_00ac5c508fe608bb2fdabfd8074f808b68d7d080.1920x1080.jpg?t=1662641986,https://cdn.akamai.steamstatic.com/steam/apps/1946970/ss_2525ba3ae84c25490c7f87f05241692b4b5a2827.1920x1080.jpg?t=1662641986,https://cdn.akamai.steamstatic.com/steam/apps/1946970/ss_58882f0ec4203afed5e0062e5c6d4d16ba6d1456.1920x1080.jpg?t=1662641986",
    "Slug": "isle-of-arrows",
    "Meta Title": "Isle of Arrows: Sep 8, 2022, Gridpop and Full Overview",
    "Meta Description": "Looking for information on Isle of Arrows? Check out the release date (Sep 8, 2022), developer insights from Gridpop, and a complete game summary.",
    "Alt Text Image": "Official header image for Isle of Arrows game - Steam 1946970",
    "Canonical URL": "https://gusku.site/game/isle-of-arrows",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Isle of Arrows\", \"description\": \"Looking for information on Isle of Arrows? Check out the release date (Sep 8, 2022), developer insights from Gridpop, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gridpop\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gridpop\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1946970/header.jpg?t=1662641986\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.69, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}