{
    "AppID": 1556790,
    "Name": "Isonzo",
    "Release date": "Sep 13, 2022",
    "About the game": "World War One expands to the mountains of the Italian Front - beautiful but deadly in equal measure. Inspired by the two year struggle for control of the Isonzo river valley and the Alps during World War One, Isonzo elevates the WW1 Games Series, figuratively and literally. From the makers of Verdun and Tannenberg … The new Offensive game mode puts you right in the middle of key historical offensives on the Italian Front. Lead the charge across stunning Italian landscapes as you choose your path to victory - cut paths through barbed wire, flank your enemies by following mountain trails, or man a mortar to blast a way through. Shape a dynamic battlefield by laying sandbags and wire, placing ammo crates, deploying trench periscopes or sniper shields, and more. Take part in historical offensives from the Sixth Battle of the Isonzo to the Strafexpedition. Reflecting the course of the actual battles, as the attackers advance the fighting will shift through vastly different landscapes within a single offensive: from hillside fortresses to mountain trenches and fierce urban combat on city streets. Everything is recreated based on research and field trips, from sound effects and uniforms down to the houses, vineyards and trenches you’ll be fighting over. Call in support with a unique historically accurate flare system: flare guns can mark targets for artillery or biplane flybys, or different colored flares can be used to guide your team. Once the big guns have softened up the enemy, finish the job at close quarters with an Arditi dagger or mountaineer’s pickaxe. Man heavy machine guns, mortars and even mountain guns for more direct fire support. Choose from six classes based on historical combat roles and build your loadout from a selection of weapons, equipment and perks linked to that class, giving flexibility and variety while staying grounded in what real soldiers might have carried. You’ll be operating wire cutters, bandaging yourself and wounded teammates, and blowing the whistle to start an assault. One shot can kill and even lighter injuries can lead to quickly bleeding out. Being an effective soldier in Isonzo is not just about being a good marksman. Mastering the terrain is also key - the mountain can be a friend or foe. Learn how to navigate well to maintain cover and surprise your enemies or support your allies. Finally… watch out for the dreaded poison gas. You’ve never experienced WW1 action quite like this! Isonzo key features include: Mountain warfare: Assaulting mountain fortifications, battling through ruined towns, and fording rivers are just a few of the challenges you’ll face as you fight your way through numerous enemy positions Tactical multiplayer FPS: Choose your role and loadout carefully to survive this high altitude combat - play a sniper to pick off the enemy engineers before they can cut your wire, use rifle grenades to clear enemy machine guns, and much more World War One Gameplay: Historical Offensive game mode based on real battles and focused on the unique challenges of Alpine warfare. Fight with 30+ WW1 weapons, poisonous gas attacks, and intense artillery barrages Build for victory: Place your own wire, sandbags, trench periscopes, and more! Whether you’re digging in or on the attack, shaping the battlefield to your advantage will be key to victory Faces of war: Make every class your own by picking from a variety of historically class-appropriate uniforms, accessories and headgear. As a finishing touch, you can even pick your mustache from several famous period-accurate styles! Authentic WW1 atmosphere: Accuracy in everything from maps and weaponry to music and the uniforms – fight for the Kingdom of Italy or the Austro-Hungarian Dual Monarchy More Games in the Authentic WW1 Game Series Immerse yourself in more WW1 action with our other standalone titles Tannenberg and Verdun . Experience trench warfare on the Western Front in Verdun, or maneuver for control of key sectors in Tannenberg on the Eastern Front. These authentic WW1 shooters let players choose from a range of squads from across the war, as they fight for control of the ever-changing frontlines.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1556790/header_alt_assets_0.jpg?t=1663233747",
    "Price": 26.99,
    "Developers": "M2H,BlackMill Games",
    "Publishers": "BlackMill Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_6591b45dff1523fc3953ff9755b3fcaf9b4edec1.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_b3fb5a70df0bd1af156ea74fa0e68d72cdade28e.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_d15c8956a46fe583714d88da4350952a9be212b6.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_a688da509c460e7199cea4673645e68c8f1b98ee.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_5e4d065b4c81bb5196d0b524c361582fa4fa5c6b.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_2e4091238fe5606ca1b019c8fca0462328fd92a0.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_3a4f67235fc8815303443fd8995399b9693683c8.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_3b3559172afc9042ed38c72b339bfc89a32ee971.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_1be08bf58303eead2bb4f05ddbb734d16fa2e3a5.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_38e81d2bc874e524e0ca956e3070960067a40817.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_7c8ab01c48ea2235d7c85c09edb179017afbc3f5.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_378324486b02d775ca87d5fad976b91eec11e597.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_c2a8e875614b517259bc766d53c5be7a1315f65b.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_1675467cc3b39d5d4c2865bb35ba6ef6bc70dfc1.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_b14de32ed71b4d42c84090d60fad709456a5dd39.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_b6116ade6ea36f4d30a2a91847c6546693b8f3af.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_836ba0ca974a25a7c69e717d6083c72067137280.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_5d7db44c33565215a519353c468e744aaec61939.1920x1080.jpg?t=1663233747,https://cdn.akamai.steamstatic.com/steam/apps/1556790/ss_450dde5f172ef719cedfcb1b7584be6aaa535d56.1920x1080.jpg?t=1663233747",
    "Slug": "isonzo",
    "Meta Title": "Isonzo: Sep 13, 2022, M2H,BlackMill Games and Full Overview",
    "Meta Description": "Looking for information on Isonzo? Check out the release date (Sep 13, 2022), developer insights from M2H,BlackMill Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Isonzo game - Steam 1556790",
    "Canonical URL": "https://gusku.site/game/isonzo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Isonzo\", \"description\": \"Looking for information on Isonzo? Check out the release date (Sep 13, 2022), developer insights from M2H,BlackMill Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"M2H,BlackMill Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BlackMill Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1556790/header_alt_assets_0.jpg?t=1663233747\", \"offers\": {\"@type\": \"Offer\", \"price\": 26.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}