{
    "AppID": 1939910,
    "Name": "Karate Beasts",
    "Release date": "Sep 22, 2022",
    "About the game": "About game: The game Karate Beasts is a 2d game where you train your beast to defeat the villain (Dark Sensei). Basically, he kidnapped the characters' uncle and forced him to become his beasts' trainer and now has 3 beasts ready to win everything in their way. Now you (the player) need to train with 3 masters Master Walid, Master Abu and Master Papa one by one. You can choose any of 3 masters, to be ready to defeat the beast Dark Sensei in the last final fight and win the title of KARATE BEASTS. Everything is simulated (the fights and training) the only thing you need to keep is the balance between power and stamina. Having enough stamina to win. Three masters are here to make you a professional and dutiful fighter. Help Leo to make him the champion of the game. He is the most powerful and well-trained fighter. After completing all stages and levels there will be a mighty fight between Leo and Dark Sensei the villain. You need to be focused and experienced to defeat Dark Sensei so Leo will take revenge and save his family’s pride, honor, and reputation. KARATE BEASTS title is the dream of Leo and you are helping him to make that dream come true. The game has local matches to see if you have the right balance for the tournament fights. With each level you will learn new techniques to fight. Actually these levels will make you the master of fighting. You have 15 tournaments (each one has a different amount of matches starting from 3 going all the way up to 15) and then, one last final fight with the beast of dark sensei. This happens for all 3 beasts, you have 11 beasts to choose from, the more you play the more you train your beats to win the Title Karate Beasts. Features: Karate Beast is an offline 2D game. Players have unlimited lives to beat the evil. 3 trainers/masters for training that offers different exercises. There are 11 characters, players can choose according to their choice. There are 15 tournaments. Each tournament has a set of matches and there is a final battle. You can choose the Master and Your Beast of your choice. Karate Beast is a free offline fun game. You have your own character to fight with evil. Karate beast is the most challenging game. It is a feast for gamers. Nurture your beast that it can give its best the more you play the more your beast gets experienced and wins. Are you guys excited? Download it now!!!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1939910/header.jpg?t=1663852156",
    "Price": 11.99,
    "Developers": "Pagie Portal",
    "Publishers": "Pagie Portal",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1939910/ss_5f8283606f1796bcee93220d1cb676c8490a506b.1920x1080.jpg?t=1663852156,https://cdn.akamai.steamstatic.com/steam/apps/1939910/ss_5a0c9a483b854da10f7631ead02618bad7bb8d14.1920x1080.jpg?t=1663852156,https://cdn.akamai.steamstatic.com/steam/apps/1939910/ss_09050a136b3ea92dd05936568ba26e8c00be9dc7.1920x1080.jpg?t=1663852156,https://cdn.akamai.steamstatic.com/steam/apps/1939910/ss_82599ebbc4562e1d245a665c83ba6710cf7ef9a0.1920x1080.jpg?t=1663852156,https://cdn.akamai.steamstatic.com/steam/apps/1939910/ss_cbc71658ba3fa97e1bb02f6479a77a3aaf274a41.1920x1080.jpg?t=1663852156,https://cdn.akamai.steamstatic.com/steam/apps/1939910/ss_b5e8a7206a30107c3b5cf897e81316c2e8cd945b.1920x1080.jpg?t=1663852156",
    "Slug": "karate-beasts",
    "Meta Title": "Karate Beasts: Sep 22, 2022, Pagie Portal and Full Overview",
    "Meta Description": "Looking for information on Karate Beasts? Check out the release date (Sep 22, 2022), developer insights from Pagie Portal, and a complete game summary.",
    "Alt Text Image": "Official header image for Karate Beasts game - Steam 1939910",
    "Canonical URL": "https://gusku.site/game/karate-beasts",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Karate Beasts\", \"description\": \"Looking for information on Karate Beasts? Check out the release date (Sep 22, 2022), developer insights from Pagie Portal, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pagie Portal\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pagie Portal\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1939910/header.jpg?t=1663852156\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}