{
    "AppID": 1551620,
    "Name": "Letina's Odyssey",
    "Release date": "Sep 16, 2022",
    "About the game": "Women from the Arclight royal family usually join the church, but not Letina. She eschewed tradition and decided to train as a knight to help her people as directly as possible. Her first mission seems fairly straightforward, as an entire company of knights accompanies her, but things worsen when they get separated. She does a beautiful job of holding her own in their absence, but what can she do when the world seems to plot against her? A sudden cave-in sends her tumbling into a different part of Mt. Noble's cave system, and now she and an entire village of people are trapped underground with no way out. The only available path leads up through numerous increasingly dangerous floors. An exit must be found, for her sake as well as that of the villagers... Letina is a trained knight of Arclight, but her lack of field experience makes her as green as most cadets. You'll explore the cave system within Mt. Noble, finding valuable treasure along the way and fighting the many creatures inhabiting each floor... or avoiding them entirely if you feel confident in your combat prowess! Grow stronger with the help of the spirits who dwell in the mountain, unlock shortcuts, find secret passageways, and uncover the mysteries of Mt. Noble's ancient corridors. Luckily, you're not entirely on your own. An entire village of people was trapped underground by the same cave-in, and they're just as eager as you to find their way out before their food stores dwindle. Join the survey team and gain their trust by completing missions and rescuing anyone in danger. They'll help by rewarding you with useful items and even have your back when the time calls. Unfortunately, the caves and their monstrous inhabitants aren't your only obstacles. There's someone else trapped down here. Someone who's after your life. Who is she, and who sent her? More importantly, can she be reasoned with? Classic RPG Exploration and Combat Explore floor after floor of a seemingly endless cave system, facing newer and more powerful enemies with each level you discover. Use pickaxes and explosives to unearth hidden treasure rooms, return to the village to help its people and restock, and grow powerful enough to tackle the increasingly complex challenges ahead. A Living Hub While Letina prefers exploring alone, that doesn't mean she'll have to face the dangers of the caves on her own. An entire village of people are trying to find their way out. As the newest survey team member, they'll offer you items for purchase, helpful advice, and hints, and quests to complete to obtain special rewards and even more precious allies for the final showdown. Organic Skill Acquisition While some of Letina's skills are learned through combat experience, some have to be acquired through unique gear and the abilities they hide within. Equipping gear with a certain skill will allow you to use it immediately, but fight with it long enough and it'll be yours to keep. Some say the most powerful abilities come from mystical spirits, but they only award their gems to those able to best them, so brace yourself for a gauntlet of challenging optional bosses! Choices Matter A member of the survey team is in a pinch! Should you rescue them? Choose carefully because they might be gone forever if you don't. And while dead men tell no tales, a corpse is of little help to anyone. Similarly, be extra careful not to anger the wrong people in the village. The elder will be forced to banish you entirely if your crimes are too severe, leaving you without a safe haven to return to.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1551620/header.jpg?t=1663387210",
    "Price": 13.49,
    "Developers": "Asakiyumemishi",
    "Publishers": "Kagura Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1551620/ss_73bab1be4b5b004f32d39cfc4862a09f842a2ac3.1920x1080.jpg?t=1663387210,https://cdn.akamai.steamstatic.com/steam/apps/1551620/ss_b2e498fb34a6c4d3fc4c612892d9301890592a33.1920x1080.jpg?t=1663387210,https://cdn.akamai.steamstatic.com/steam/apps/1551620/ss_1dda8209d299416eeae0f1385182a671f5ef194e.1920x1080.jpg?t=1663387210,https://cdn.akamai.steamstatic.com/steam/apps/1551620/ss_e52c54ba1809700d2a09f66663453ac9af0afc27.1920x1080.jpg?t=1663387210,https://cdn.akamai.steamstatic.com/steam/apps/1551620/ss_03f84c8862d08da261abf327c840b980dacf9b22.1920x1080.jpg?t=1663387210",
    "Slug": "letina-s-odyssey",
    "Meta Title": "Letina's Odyssey: Sep 16, 2022, Asakiyumemishi and Full O...",
    "Meta Description": "Looking for information on Letina's Odyssey? Check out the release date (Sep 16, 2022), developer insights from Asakiyumemishi, and a complete game summ...",
    "Alt Text Image": "Official header image for Letina's Odyssey game - Steam 1551620",
    "Canonical URL": "https://gusku.site/game/letina-s-odyssey",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Letina's Odyssey\", \"description\": \"Looking for information on Letina's Odyssey? Check out the release date (Sep 16, 2022), developer insights from Asakiyumemishi, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Asakiyumemishi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kagura Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1551620/header.jpg?t=1663387210\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}