{
    "AppID": 2093280,
    "Name": "Lords of Ravage - Chapter 1",
    "Release date": "Sep 8, 2022",
    "About the game": "It is said that only in the darkest of times, true heroes are forged. But others may be lured by this darkness onto a much easier path. Some follow this path out of selfish greed and lust for power, while others do so out of a corrupted sense of duty, stopping at nothing to achieve their higher goals. A few of the most powerful ones have the dubious honor of being proclaimed Lords of Ravage. You'll take on the role of one of these Lords on the brink of their defeat. Search for a great artifact that can change the fate of this world. Deal with any heroes brave or foolish enough to interfere with your plans. Hunt for forgotten artifacts, forge dark alliances, and undertake daring raids to take by force everything your heart desires. * You are the FINAL BOSS: Deal with dangerous heroes, slowly wearing them down before the inevitable fight with the dungeon boss - you. Or take matters into your own hands and appear on the battlefield to aid your less competent followers. * 3 LORDS with unique play styles: Each Lord has different mechanics complementing their theme. As the head of their faction, they are able to unlock the full potential of their units by using access to unique upgrades. * Diverse ENEMIES: Fight a classic hero party, lone summoner, twin barbarians, an entire military expedition - each with their own strengths and weaknesses, defined by their combat mechanics and battlefield conditions. * Develop a shadow EMPIRE: Raid cities, make dark alliances, take possession of cursed artifacts or hunt for secret knowledge. Every aspect of your empire is important and has to be carefully balanced - no element is useless. * Thoughtful and addictive GAMEPLAY: Mix units from different factions into deadly combinations. Wither your enemies with status effects, make a powerful champion who will carry the fight on his own or deploy a horde of undying minions. * REPLAYABILITY: Unlock more potential upgrades and units as you progress. Learn more powerful and creative combinations to try out. Add more flexibility to your units. * Stunning GRAPHICS: The style combines traditional pixel art techniques and modern technology. High-quality art, lighting, and effects are a feast to the eyes. We are a team of people who are passionate about making retro-themed games. We try to use the available resources to release high-quality games within funds, focusing on game mechanics. We are inspired by modern indie games as well as titles from the 90s and 00s. Our goal is to bring some of the spirit of the bygone era into the present. Turn-based strategies take a special place in our hearts, though, alongside unique design decisions and interesting storylines. Do not hesitate to contact us if you have any problems or you want to leave a review or a suggestion:  Synthetic Domain",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2093280/header.jpg?t=1662787678",
    "Price": 0.0,
    "Developers": "Synthetic Domain",
    "Publishers": "Synthetic Domain",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2093280/ss_4d592867960ed5d7a073430cf3e216671f7f5d0a.1920x1080.jpg?t=1662787678,https://cdn.akamai.steamstatic.com/steam/apps/2093280/ss_ec82ad032a6042a4c3e1504592d562a12de4a5d3.1920x1080.jpg?t=1662787678,https://cdn.akamai.steamstatic.com/steam/apps/2093280/ss_56463a4c8e3eed101dd17d75f435b699ed213b57.1920x1080.jpg?t=1662787678,https://cdn.akamai.steamstatic.com/steam/apps/2093280/ss_73ff78c352eb221f179cd9c9b5d51a1847b7ec11.1920x1080.jpg?t=1662787678,https://cdn.akamai.steamstatic.com/steam/apps/2093280/ss_3b142ed207562d51a025cdbbcdd05dc8abd7e244.1920x1080.jpg?t=1662787678,https://cdn.akamai.steamstatic.com/steam/apps/2093280/ss_e497bb5eab3fc1478785f7b8eb27b72037f5ba98.1920x1080.jpg?t=1662787678,https://cdn.akamai.steamstatic.com/steam/apps/2093280/ss_2a1f256b9c0e725c06018c6a759987ed02c85e27.1920x1080.jpg?t=1662787678,https://cdn.akamai.steamstatic.com/steam/apps/2093280/ss_a04c765c20c7047eaf4418fe7a0063dc5b163645.1920x1080.jpg?t=1662787678",
    "Slug": "lords-of-ravage-chapter-1",
    "Meta Title": "Lords of Ravage - Chapter 1: Sep 8, 2022, Synthetic Domai...",
    "Meta Description": "Looking for information on Lords of Ravage - Chapter 1? Check out the release date (Sep 8, 2022), developer insights from Synthetic Domain, and a comple...",
    "Alt Text Image": "Official header image for Lords of Ravage - Chapter 1 game - Steam 2093280",
    "Canonical URL": "https://gusku.site/game/lords-of-ravage-chapter-1",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lords of Ravage - Chapter 1\", \"description\": \"Looking for information on Lords of Ravage - Chapter 1? Check out the release date (Sep 8, 2022), developer insights from Synthetic Domain, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Synthetic Domain\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Synthetic Domain\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2093280/header.jpg?t=1662787678\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}