{
    "AppID": 2058190,
    "Name": "Lost Judgment",
    "Release date": "Sep 14, 2022",
    "About the game": "When a convicted police officer discloses the murder of the student teacher who bullied his son to suicide, the dark secrets of a Yokohama high school rise to the surface. Fight for the truth as detective Takayuki Yagami and go undercover at a prestigious high school to solve a string of twisted bullying cases. But as victims pile up, caught in a cycle of bullying and revenge, will the scales of justice tip in favor of defending the law or enacting vengeance? Crack skulls to crack the case in this action-packed legal thriller. RGG Studio proudly presents Lost Judgment, the sequel to Judgment that weaves investigative sleuthing, noir narrative, and bone-crushing combat into a story like none other. INVESTIGATIVE ACTION Tap into Yagami’s arsenal of private eye tricks to gather clues. Use hi-tech gadgets like drones and listening devices as well as hardboiled gumshoe methods like scaling buildings and tailing suspects to uncover the truth. No stronger evidence than catching a suspect in the act. FREEFORM COMBAT Master Yagami’s three unique, combo-heavy martial arts styles to overcome any situation from group ambushes to single-target takedowns. Plus, expand your arsenal with street signs, bicycles, and more to pack an even bigger punch. DEEP UNDERCOVER Go undercover as a high school club advisor to get to the root of the mystery, and have some fun along the way. Join the Dance Club and groove to the rhythm with your students. Challenge your ingenuity at the Robotics Club. Test your moves against fierce opponents at the boxing gym. You can even join the biker gang, where underground racing is the only way to earn respect. HIT THE STREETS As you comb the cities of Kamurocho and Ijincho in pursuit of the truth, take a break and get to know the unique culture of each city through bars and other nightlife hotspots. It may be worth taking on a Side Case to lend your detective skills to residents in need—you never know what might come of it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2058190/header.jpg?t=1663267544",
    "Price": 59.99,
    "Developers": "Ryu Ga Gotoku Studio",
    "Publishers": "SEGA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2058190/ss_fbc9cbe8c4e5864ed010606ff039e7b0fbc6766a.1920x1080.jpg?t=1663267544,https://cdn.akamai.steamstatic.com/steam/apps/2058190/ss_e8a048bc0b746b5c51e2e705fbaf41a4e3ffa33e.1920x1080.jpg?t=1663267544,https://cdn.akamai.steamstatic.com/steam/apps/2058190/ss_0e6499eea014409ea82d3651afe8280543fb1755.1920x1080.jpg?t=1663267544,https://cdn.akamai.steamstatic.com/steam/apps/2058190/ss_4969eaac269aadba421d7af10b57758b82cba9bd.1920x1080.jpg?t=1663267544,https://cdn.akamai.steamstatic.com/steam/apps/2058190/ss_fba7e988e5e6799694658d7ed28863460e0db327.1920x1080.jpg?t=1663267544",
    "Slug": "lost-judgment",
    "Meta Title": "Lost Judgment: Sep 14, 2022, Ryu Ga Gotoku Studio and Ful...",
    "Meta Description": "Looking for information on Lost Judgment? Check out the release date (Sep 14, 2022), developer insights from Ryu Ga Gotoku Studio, and a complete game s...",
    "Alt Text Image": "Official header image for Lost Judgment game - Steam 2058190",
    "Canonical URL": "https://gusku.site/game/lost-judgment",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lost Judgment\", \"description\": \"Looking for information on Lost Judgment? Check out the release date (Sep 14, 2022), developer insights from Ryu Ga Gotoku Studio, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ryu Ga Gotoku Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SEGA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2058190/header.jpg?t=1663267544\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}