{
    "AppID": 1401400,
    "Name": "Lovecraft's Untold Stories 2",
    "Release date": "Sep 13, 2022",
    "About the game": "Lovecraft’s Untold Stories 2 is an action RPG with rogue-like elements that continues the story where Lovecraft’s Untold Stories left off, taking the characters to a new stage in their fight against the Unknown, in a completely new graphics style. Loot drops of randomized gear and resources to craft your own, explore old and new procedurally generated locations, defend yourself against dozens of different enemies and face off against epic bosses! Beware, for the game is more challenging than ever before, and the tough nightmarish creatures opposing you will not give up easily! A PAINTING FOR CRAZINESS The Surrealist Artist Ardois-Bonnot presented his painting called Dream Landscape in the Paris Spring Salon of 1926. The moment the painting was uncovered, it caused a sudden riot among the public, and people screamed and ran all over the place. Soon after the exhibition, Ardois-Bonnot fell into a strange deep sleep from which no one could wake him up. Rumors abound that shortly before this attack of ‘sleeping sickness’, he was at the verge of completion of his greatest masterpiece which would change the world. 6 DIFFERENT CHARACTERS This time, you will have access to 6 different playable characters, old and new, each one with a different playstyle. The Detective, the Witch, and the Professor from the first part, which continue their fight against the Great Old Ones, and the Medium, the Veteran, and the Alienist who join the group of adventurers. CRAFTING EQUIPMENT One of the new elements that we are including in Lovecraft’s Untold Stories 2 is the possibility of crafting your own equipment. Find blueprints and resources to create and improve new items (clothes, weapons and consumables), and see how every item changes the appearance of your character. ROGUELIKE ELEMENTS The game is not pure roguelike, you will not restart the whole story if you die. Levels are randomly generated and should you die, you will have to start from the beginning of the area, with enemies and loot both reset again. Don’t forget to explore and pick up side quests in order to get as much loot and resources as possible, so you are able to progress in your main story. Fight dozens of different enemies, monsters and terrifying bosses from the Cthulhu Mythos in this intense, challenging action RPG. Ferocious beasts in the Swamps, Asylum lunatics, City thugs and the demonic creatures from the void will test your resolve to uncover the truth! Meet the 6 playable characters - 3 familiar faces from the series and 3 complete newcomers - each with their own weapons, gear and skills. Switch between them freely and pick the one most suited for the task at hand! Collect hundreds of different weapons and clothing items, or craft your own - scour every last room in a level, open every single box and get rewarded with randomized drops of gear, money for trading or resources and blueprints for crafting. Side quests are crucial - you can earn extra resources and items and get that extra bit of advantage you may need to be able to progress in the main story. Don’t forget to trigger side quests every time you encounter them, you don’t have to finish them right away, but keep them for when you need extra loot! Exploit the roguelike elements - level maps are randomly generated, as are all lootdrops. The game is not pure roguelike, if you die or choose to restart the level, you only lose progress in the current area. Use this to your advantage and if you don’t get the loot you wanted, try again!. Make use of Charms and Amulets! Sacred relics which grant strange new abilities. Find those that serve you the best and make your journey unique - but beware, power may come at a cost! Plunge into the world of darkness where every step could be your last . Balance on the brink of madness as you explore the Asylum and various other locales in the city of Arkham, Swamps, Enchanted Forest, even the Underworld and many more mind-bending locations, all in procedurally generated levels!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1401400/header.jpg?t=1663088330",
    "Price": 21.24,
    "Developers": "LLC Blini Games",
    "Publishers": "Fulqrum Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1401400/ss_efba1e14f15eba13688b44f8c98cf72b70bb67d7.1920x1080.jpg?t=1663088330,https://cdn.akamai.steamstatic.com/steam/apps/1401400/ss_7cda473002a1cf293993b42b3545abca9148802a.1920x1080.jpg?t=1663088330,https://cdn.akamai.steamstatic.com/steam/apps/1401400/ss_bed7cbedcc2491975f5546ed39111851c3908e6a.1920x1080.jpg?t=1663088330,https://cdn.akamai.steamstatic.com/steam/apps/1401400/ss_aa57fb1ee566fc7af2a421856130cfa1dd5cb8ba.1920x1080.jpg?t=1663088330,https://cdn.akamai.steamstatic.com/steam/apps/1401400/ss_55d9c1fdbfe46513acfdc6d2e1976e9f1e403252.1920x1080.jpg?t=1663088330,https://cdn.akamai.steamstatic.com/steam/apps/1401400/ss_7f72899bf4736cb7419f15debb28e7eb9772bdb4.1920x1080.jpg?t=1663088330,https://cdn.akamai.steamstatic.com/steam/apps/1401400/ss_c0a1d7660a4c5837ff2d5ebdbb85bce638eee268.1920x1080.jpg?t=1663088330,https://cdn.akamai.steamstatic.com/steam/apps/1401400/ss_69f27a2e3496149e7d2f29dd1f6ce66b9a379eff.1920x1080.jpg?t=1663088330,https://cdn.akamai.steamstatic.com/steam/apps/1401400/ss_4fbcff6939af3bbd7b7bef473bbe001b9cad3bf5.1920x1080.jpg?t=1663088330,https://cdn.akamai.steamstatic.com/steam/apps/1401400/ss_277c489011ef6dae12a218ae60fe225af71eb533.1920x1080.jpg?t=1663088330",
    "Slug": "lovecraft-s-untold-stories-2",
    "Meta Title": "Lovecraft's Untold Stories 2: Sep 13, 2022, LLC Blini Gam...",
    "Meta Description": "Looking for information on Lovecraft's Untold Stories 2? Check out the release date (Sep 13, 2022), developer insights from LLC Blini Games, and a compl...",
    "Alt Text Image": "Official header image for Lovecraft's Untold Stories 2 game - Steam 1401400",
    "Canonical URL": "https://gusku.site/game/lovecraft-s-untold-stories-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lovecraft's Untold Stories 2\", \"description\": \"Looking for information on Lovecraft's Untold Stories 2? Check out the release date (Sep 13, 2022), developer insights from LLC Blini Games, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"LLC Blini Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fulqrum Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1401400/header.jpg?t=1663088330\", \"offers\": {\"@type\": \"Offer\", \"price\": 21.24, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}