{
    "AppID": 2120140,
    "Name": "Marble on Rails",
    "Release date": "Sep 1, 2022",
    "About the game": "How to play 'Marble on Rails' is a marble run simulation application. The application has two modes: View Mode and Edit Mode. View Mode In View Mode, you can view the behavior of the courses you have created so far and sample courses. The viewpoint can be switched using the buttons, and the marbles to be gazed at can be changed. You can change the camera direction by dragging the screen with the mouse. You can use the keyboard (WSADQE, cursor keys) to move the viewpoint as desired. The drawer menu is displayed by pressing the hamburger button in the upper left corner. You can change some settings and modes, and exit the application. Edit Mode You can create your own courses. The rails are placed and edited in the same way as in drawing software. Smooth rails can be generated by setting anchor points and control points in space. Anchor points can be placed within the white line drawn on the ground in the edit screen. There are several states in the edit mode. Add: Press the + button to add a rail with a preset shape, such as straight, curved, or looped. A pink bar is displayed at the position to be added. If there are multiple positions to which rails can be added, press the Add button again to change the add position. You can delete the anchor point at the position of the pink bar by pressing the Del key. If there are no more positions to add (all rails are connected to the elevator), this state will no longer be selectable. If you want to delete a connection to the elevator, put the point of connection to the elevator in Edit state and select 'Disconnect from elevator'. Edit: The anchor point of the rail is displayed as a gray sphere. Click on the sphere to enter anchor point edit mode. Anchor points are displayed as red spheres and Bezier curve control points as yellow spheres. Each sphere can be moved by dragging. The bank angle of the rail can be edited in the window displayed on the right. Cam: You can edit up to five camera positions to be used in View Mode. Use the buttons in the lower right corner to switch camera numbers and move the camera with the mouse or keyboard (WSADQE). About the viewpoint The 'XY', 'YZ', 'XZ', 'SIDE', and 'Reset' buttons in the lower left corner and the seek bar for zoom control the viewpoint. Press 'XY', 'YZ', and 'SIDE' twice to get the view from the back side. The Bezier curve control points move on the visible plane when editing, so proper viewpoint switching is necessary. XZ' or 'SIDE' is recommended. About the Elevator In Edit mode, select the center sphere of the elevator to open the elevator setting window. In this state, the elevator can be moved by dragging. You can select the direction of ejection and the three-way. Connecting to an Elevator Selecting 'Enter Elevator' in Add mode adds a straight line connecting the current position to the nearest elevator point. In order to successfully return the ball to the elevator, the rail must be connected to the elevator and the ball must be controlled to roll in the direction of the elevator. Mouse Controls Drag to move the ball parallel to the screen. Right-click and drag to rotate around the gazing point. If there is no gazing point, rotate the camera. Keyboard shortcuts Escape key cancels a dialog or opens a drawer menu. See below for shortcuts when in edit mode. Miscellaneous You can run Marble for testing by checking the Test checkbox. Differences from the Android version Compared to the Android version, the accuracy of physics calculation has been improved. This allows Marble to run more smoothly. Shadows are drawn Elevator three-way support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2120140/header.jpg?t=1662225502",
    "Price": 5.39,
    "Developers": "dbitware",
    "Publishers": "dbitware",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2120140/ss_3fb6e29fbe2de9c12f5f498524a89a3cd8a42956.1920x1080.jpg?t=1662225502,https://cdn.akamai.steamstatic.com/steam/apps/2120140/ss_8bb9679949efb37a0cb1ff3a78784fab0ade892d.1920x1080.jpg?t=1662225502,https://cdn.akamai.steamstatic.com/steam/apps/2120140/ss_f829bad37f8ad88c572edd39fcd21919fee812cb.1920x1080.jpg?t=1662225502,https://cdn.akamai.steamstatic.com/steam/apps/2120140/ss_e11061ac82ed51a13123a5ebc66fb91b47aa0563.1920x1080.jpg?t=1662225502,https://cdn.akamai.steamstatic.com/steam/apps/2120140/ss_3d0d34047190705a5f822b4e20c52e60ba76d797.1920x1080.jpg?t=1662225502",
    "Slug": "marble-on-rails",
    "Meta Title": "Marble on Rails: Sep 1, 2022, dbitware and Full Overview",
    "Meta Description": "Looking for information on Marble on Rails? Check out the release date (Sep 1, 2022), developer insights from dbitware, and a complete game summary.",
    "Alt Text Image": "Official header image for Marble on Rails game - Steam 2120140",
    "Canonical URL": "https://gusku.site/game/marble-on-rails",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Marble on Rails\", \"description\": \"Looking for information on Marble on Rails? Check out the release date (Sep 1, 2022), developer insights from dbitware, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"dbitware\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"dbitware\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2120140/header.jpg?t=1662225502\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}