{
    "AppID": 1982620,
    "Name": "Mirror War - Reincarnation of Holiness SA",
    "Release date": "Sep 8, 2022",
    "About the game": "About 160 years ago, every race on the Farrow Hill continent entered a war and fight for the hegemony of the Farrow Hill to rule the whole continent. You will be one of the recruited soldiers who belong to one of the sections. With a belief in the faith of a hero, end the 160 years of the war. [Mirror War-Reincarnation of Holiness SA] originated from the novel and it presents a marvelous storyline and unique style of RPG game. Every combat in this game will be played in 3D Arcade Shooting style. You can select 12 different characters and each character has a different type of skills and awakening skills. Also, you can enhance your item and make your character more powerful than before. The continent of Farrow Hill, where war takes place, consists of over 600 stages, where different enemies and demonic barrages continue in each region, but you can achieve victory by using your legendary items and super-controls. The game is a complete package where you can purchase all powerful items with gold. This game was developed based on Korean and it supports Japanese [Key Features] An immense volume of scenario, quests and the stage Based on the original novel [Mirror War], it is a huge volume blockbuster shooting game with over 1300 quests and 600 stages according to each race scenario. All you need to do is enjoy every battle is extraordinary control skills Unique Style of Arcade Shooting RPG Players are required to grow and nurture their character that belongs to one of the sections. Upgrade equipment, and transcend with the quest completion reward. During the battle, players will be in a unique style of games that uses jump evasion and a huge range of AOE skills Select your unique character Beyond the character customization option, players are also allowed to combine basic attacks and special action skills within 12 characters to create a unique style and pattern character. Special action skills consist of various skills such as, close range attack, penetrating attack, paralysis, defense, recovery, curse, explosion, summoning, tracking, and slow which can be set to suit own style when creating a character. Get all cash items for free All the packages that are developed and aimed for the cash purchase have been changed, and players are now able to get those packages for in-game money (gold). Players are allowed to purchase comfort, support items, lucky box, and costume with gold from the cash shop that can be opened anywhere in the village. Comfort single play To gratitude the players who love to play our game, we have removed the co-op party and the system that compares other users to provide a better environment as the single-play game. Do not fear the immense volume of [Mirror War-Reincarnation of Holiness SA] challenge on your own and experience the pleasure of completing the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1982620/header.jpg?t=1662677790",
    "Price": 17.99,
    "Developers": "L＆K Co., Ltd.",
    "Publishers": "L＆K Co., Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1982620/ss_aa178d590b44503b91b119165e7fe4d2e7f1f1b2.1920x1080.jpg?t=1662677790,https://cdn.akamai.steamstatic.com/steam/apps/1982620/ss_3149be9de3739b304627ec69c6921fd0074f4afa.1920x1080.jpg?t=1662677790,https://cdn.akamai.steamstatic.com/steam/apps/1982620/ss_0f9f34b9cc762b4df810dd85f7225aafef686fdf.1920x1080.jpg?t=1662677790,https://cdn.akamai.steamstatic.com/steam/apps/1982620/ss_1c5e66150f2aab82a9259f8bb6361ef6a5a85f79.1920x1080.jpg?t=1662677790,https://cdn.akamai.steamstatic.com/steam/apps/1982620/ss_c303694e7e6cdf626916600f456cc2bf3b891509.1920x1080.jpg?t=1662677790",
    "Slug": "mirror-war-reincarnation-of-holiness-sa",
    "Meta Title": "Mirror War - Reincarnation of Holiness SA: Sep 8, 2022, L...",
    "Meta Description": "Looking for information on Mirror War - Reincarnation of Holiness SA? Check out the release date (Sep 8, 2022), developer insights from L＆K Co., Ltd., a...",
    "Alt Text Image": "Official header image for Mirror War - Reincarnation of Holiness SA game - Steam 1982620",
    "Canonical URL": "https://gusku.site/game/mirror-war-reincarnation-of-holiness-sa",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mirror War - Reincarnation of Holiness SA\", \"description\": \"Looking for information on Mirror War - Reincarnation of Holiness SA? Check out the release date (Sep 8, 2022), developer insights from L\\uff06K Co., Ltd., a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"L\\uff06K Co., Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"L\\uff06K Co., Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1982620/header.jpg?t=1662677790\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}