{
    "AppID": 845890,
    "Name": "Moonbreaker",
    "Release date": "Sep 29, 2022",
    "About the game": "Moonbreaker is a turn-based strategy, tabletop tactics game developed by Unknown Worlds, the team behind the Subnautica series. It is designed to be a true digital miniatures experience, set in an expansive sci-fi universe crafted by best-selling sci-fi and fantasy author, Brandon Sanderson. Through accessible turn-based competitive gameplay, ongoing content releases, and deep customization, Moonbreaker offers a variety of gameplay experiences for all types of players. TURN-BASED STRATEGY Lead your Units in fast-paced, turn-based encounters with a never-ending variety of gameplay possibilities. Outsmart your opponents through strategic use of Ship Assists, Roster makeup, map knowledge, and more. Compete against other players online or play offline in a variety of challenges. It’s quick to pick up, hard to put down. COLLECT UNITS, BUILD ROSTERS All Crew and Captains are unlockable through gameplay. Each Roster consists of Crew, Assists, and a Captain of your choosing. With more than 50 Units, Captains, and Assists at launch – and more added with each Season release – the Roster combinations are endless. REAL MINIATURES, DIGITALLY Every aspect of Moonbreaker is designed to capture the feel of a physical miniatures game without the real-world downsides. Unlock all Units through gameplay, play on maps with a stunning diorama look but none of the cleanup. Paint your Units using traditional painting techniques (but with an undo button!). Alternatively, marvel at beautiful alternate paint jobs created by the development team. EXPRESS YOURSELF Let your imagination run wild. With detailed, constantly evolving painting tools, you can take your Unit customization to the next level. Custom palettes, beautiful finishes, and professional digital painting tools create the perfect space for blissful player expression. Add finishing touches with collectable decals, deploy effects, rarity auras, and more. Participate in Season releases to unlock brand-new limited edition in-game rewards. EVOLVE YOUR SKILLS Hone your Unit Mastery with every passing encounter and earn rewards to prove your skills. Challenge your skills in single-player Cargo Runs with procedurally generated AI encounters. Try unique, upgraded abilities in matches that become increasingly more challenging the longer the Run lasts. Enjoy gameplay that is never the same twice. ABOUT THE DEVELOPMENT TEAM Unknown Worlds (UW) is a globally distributed developer of beloved games. The studio was born of the Half-Life modding scene with Natural Selection. Since then, UW has reached world-wide recognition for the hybrid multiplayer strategy/shooter Natural Selection 2 and underwater adventure survival game Subnautica. WATCH OUT! Moonbreaker is not finished! As an Early Access game, it is in active development: Full of bugs, missing features, and potential performance issues. If you would like to play Moonbreaker when it is finished, sign up to our Development Newsletter for progress and announcements.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/845890/header.jpg?t=1664576279",
    "Price": 29.99,
    "Developers": "Unknown Worlds Entertainment",
    "Publishers": "KRAFTON, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/845890/ss_6608014f0f7091476cd8c952d0ac1b80d4ecc026.1920x1080.jpg?t=1664576279,https://cdn.akamai.steamstatic.com/steam/apps/845890/ss_95ef478a14b903b5f2fb6f9cc0e978f09ccfade3.1920x1080.jpg?t=1664576279,https://cdn.akamai.steamstatic.com/steam/apps/845890/ss_2a41990468fea8c514edcb4f619d1151ac20221f.1920x1080.jpg?t=1664576279,https://cdn.akamai.steamstatic.com/steam/apps/845890/ss_0fc7fe14ab228765c7bc2180bec388f76c535809.1920x1080.jpg?t=1664576279,https://cdn.akamai.steamstatic.com/steam/apps/845890/ss_ee1d23d8b9da30966b55d6995f8a64aa59fdbb6d.1920x1080.jpg?t=1664576279,https://cdn.akamai.steamstatic.com/steam/apps/845890/ss_c5a8e8c1207ca6cde11f4e9a96f5c5e1129778cc.1920x1080.jpg?t=1664576279,https://cdn.akamai.steamstatic.com/steam/apps/845890/ss_286eac7dffbbdaeaef455249211faacf076b07d2.1920x1080.jpg?t=1664576279,https://cdn.akamai.steamstatic.com/steam/apps/845890/ss_1051b064ef1b7b4967022edcb10358971f0547aa.1920x1080.jpg?t=1664576279",
    "Slug": "moonbreaker",
    "Meta Title": "Moonbreaker: Sep 29, 2022, Unknown Worlds Entertainment a...",
    "Meta Description": "Looking for information on Moonbreaker? Check out the release date (Sep 29, 2022), developer insights from Unknown Worlds Entertainment, and a complete ...",
    "Alt Text Image": "Official header image for Moonbreaker game - Steam 845890",
    "Canonical URL": "https://gusku.site/game/moonbreaker",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Moonbreaker\", \"description\": \"Looking for information on Moonbreaker? Check out the release date (Sep 29, 2022), developer insights from Unknown Worlds Entertainment, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Unknown Worlds Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"KRAFTON, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/845890/header.jpg?t=1664576279\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}