{
    "AppID": 830540,
    "Name": "Motocross: Chasing the Dream",
    "Release date": "Aug 30, 2022",
    "About the game": "*Note: the full game and the demo are exactly the same at the moment. Only buy this if you'd like to support our development, otherwise, check out the free demo! The full game will be getting mod support soon whereas the demo will not. Motocross: Chasing the Dream is a game being developed by riders, for riders. With an emphasis on the immense struggle and pure dedication to be successful in this sport, you will discover what it is actually like to be a competing amateur in American motocross as you blaze your own trail to the biggest amateur race of the year. Our Mission As real-life motocross racers and gamers, we have a high standard for authenticity and want to show the world how tough yet rewarding the sport we love so much really is. Eventually, we hope this game will change the current landscape of the motocross gaming genre and encourage not only ourselves, but other companies to implement core details of the sport into their games as well as ours. As we develop Motocross: Chasing the Dream, we won’t always get it right, but community feedback will be our main focus and drive to implement new features and changes to make this the most realistic motocross video game as a whole. Current Features Ride a physically accurate 125cc 2-stroke dirtbike tuned for a realistic arcade experience 3 tracks to play on in one big compound to test out the physics 1 motocross track 1 arenacross track 1 hybrid outdoor supercross track 1 trail that circles the motocross track Ragdoll crash physics 3 camera modes Follow camera Slot camera First-person camera Upcoming Features Content Tracks Bikes Customization options Bike customization Rider customization Unique game features Realistic arcade physics Accurate ragdoll physics using real-world mass Walk/run to your bike after a crash to pick it up off the ground Multiple bike sizes - 50cc, 110cc, 85cc, 125cc, 250cc (4-stroke), 250cc (2-stroke), 450cc Rich story mode Realistic arcade physics Start out as a kid on 50cc motorcycles and work your way up to the 250cc A-class as you get older and gain more experience Take the full privateer path or, do well and gain factory support to outride your competitors Multiplayer Online racing lobbies Custom server support for hosting your own events Modding Mod.io support Custom bike skin support Custom track support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/830540/header.jpg?t=1661877891",
    "Price": 14.99,
    "Developers": "LCQ Studios",
    "Publishers": "LCQ Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/830540/ss_de55b5b274beaab416491052fe345b5f8a3462fc.1920x1080.jpg?t=1661877891,https://cdn.akamai.steamstatic.com/steam/apps/830540/ss_da1b73a71d89791d28a43a08d88e51043094b855.1920x1080.jpg?t=1661877891,https://cdn.akamai.steamstatic.com/steam/apps/830540/ss_070df97bf02da65d30ae2bbf180d599ae9d0b328.1920x1080.jpg?t=1661877891,https://cdn.akamai.steamstatic.com/steam/apps/830540/ss_f983cf2a73b444bd5fe3d362695872ecd381dc19.1920x1080.jpg?t=1661877891,https://cdn.akamai.steamstatic.com/steam/apps/830540/ss_ca3f6db0003aefabcc3354149be916a25d0dc8fd.1920x1080.jpg?t=1661877891,https://cdn.akamai.steamstatic.com/steam/apps/830540/ss_43d223d5f12161ea5f5f2def709523e2e4d8f1b8.1920x1080.jpg?t=1661877891,https://cdn.akamai.steamstatic.com/steam/apps/830540/ss_35f434f33f9fffa548becad04fe220f80e83ef71.1920x1080.jpg?t=1661877891",
    "Slug": "motocross-chasing-the-dream",
    "Meta Title": "Motocross: Chasing the Dream: Aug 30, 2022, LCQ Studios a...",
    "Meta Description": "Looking for information on Motocross: Chasing the Dream? Check out the release date (Aug 30, 2022), developer insights from LCQ Studios, and a complete ...",
    "Alt Text Image": "Official header image for Motocross: Chasing the Dream game - Steam 830540",
    "Canonical URL": "https://gusku.site/game/motocross-chasing-the-dream",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Motocross: Chasing the Dream\", \"description\": \"Looking for information on Motocross: Chasing the Dream? Check out the release date (Aug 30, 2022), developer insights from LCQ Studios, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"LCQ Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LCQ Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/830540/header.jpg?t=1661877891\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}