{
    "AppID": 2005390,
    "Name": "Paper Flight - Super Speed Dash",
    "Release date": "Sep 9, 2022",
    "About the game": "Paper Flight – Super Speed Dash is an interactive game experience that is designed to ease your mind and have fun popping innocent balloons. You jump into the role of a little paper plane that is supposed to rescue the world from little but evil balloon demons by dashing through them. Fast, relaxed, chaotic - You are free to enjoy the game any way you see fit as the only enemies of the game are balloons which generally are not well known for being too dangerous. The movement is fast but the world itself is somewhat peaceful. This enables you to lean back and enjoy the different levels and the sensation of flying. It is an excellent game for relaxing and blowing off some steam after an exhausting day of hassle. The game also features: • 12 different levels • Juicy balloon destruction and exciting dashes • A dash meter that needs to be utilized to save the world • Beautiful visuals and soundtrack • The experience of flying as a paper plane • Intuitive and relaxing gameplay • A moment of inner peace and happiness popping balloons and little balloon demons • A game that is enjoyable but doesn’t take itself too series – lean back and have fun Gameplay Description You start as a tiny paper plane in a giant world. You move continuously forward and are free to fly wherever you want. After you have played around a little and enjoyed the sensation of flying as well as explored the giant environments for the first time you start to discover nearby areas and hidden secrets. Very soon you will find many normal balloons and a whole bunch of huge demon balloons floating around in the environment. The normal balloons are soft and you can easily pop them by simply flying through them. The huge demon balloons on the other hand are somewhat hard and you are unable to destroy them by simply hitting them with your paper plane. Soon you will figure out that there is a solution to the problem. Whenever you pop a small balloon, you receive a little bit of dash power which enables your paper plane to become faster and perform a powerful dash. Using the dash, you are able to pop even the strongest of all balloons and therefore defeat the evil demon balloons. Now everything is a matter of exploration as you need to find all of the demon balloons while keeping an eye on your dash meter. Once you have destroyed all demon balloons in a level, a second wave of them will spawn and later a third wave. Every level is structured in 3 waves and once you have finished all of them you will be able to enter the next level and explore more of the giant world with your small paper plane. While the fast movement and the dashing add a somewhat fast-pace game play to the mix, the overall game is still pretty relaxing as after all your enemies are balloons and do very little to defeat themselves from your attacks. It’s a unique mix of exploration, relaxation and a minimalistic balloon combat system that brings fun without the need of too much thinking or strategizing.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2005390/header.jpg?t=1662722321",
    "Price": 7.99,
    "Developers": "EpiXR Games UG",
    "Publishers": "EpiXR Games UG",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2005390/ss_c948f22ab448f38c99981d99b4980119face69f3.1920x1080.jpg?t=1662722321,https://cdn.akamai.steamstatic.com/steam/apps/2005390/ss_0915c61dc58760226eb0d66c969da7f018485721.1920x1080.jpg?t=1662722321,https://cdn.akamai.steamstatic.com/steam/apps/2005390/ss_259ff94d686ff0135cd7fee358e8d4d9cdd88f45.1920x1080.jpg?t=1662722321,https://cdn.akamai.steamstatic.com/steam/apps/2005390/ss_8a75658931e7e6c558ce36471d92e93a5253b027.1920x1080.jpg?t=1662722321,https://cdn.akamai.steamstatic.com/steam/apps/2005390/ss_890cb096c5285a8e09661b2aeee955906f4207d4.1920x1080.jpg?t=1662722321,https://cdn.akamai.steamstatic.com/steam/apps/2005390/ss_58d82ad94dc824e1cd2b085ae8e86c6ee32113b4.1920x1080.jpg?t=1662722321",
    "Slug": "paper-flight-super-speed-dash",
    "Meta Title": "Paper Flight - Super Speed Dash: Sep 9, 2022, EpiXR Games...",
    "Meta Description": "Looking for information on Paper Flight - Super Speed Dash? Check out the release date (Sep 9, 2022), developer insights from EpiXR Games UG, and a comp...",
    "Alt Text Image": "Official header image for Paper Flight - Super Speed Dash game - Steam 2005390",
    "Canonical URL": "https://gusku.site/game/paper-flight-super-speed-dash",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Paper Flight - Super Speed Dash\", \"description\": \"Looking for information on Paper Flight - Super Speed Dash? Check out the release date (Sep 9, 2022), developer insights from EpiXR Games UG, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"EpiXR Games UG\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"EpiXR Games UG\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2005390/header.jpg?t=1662722321\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}