{
    "AppID": 2144360,
    "Name": "Pretty Girls Tile Match",
    "Release date": "Sep 29, 2022",
    "About the game": "◆ Game content 'Pretty Girls Tile Match' is a classic triple match game where you match 3 identical mahjong tiles and erase them! ◆ Challenge all 120 stages! There are 20 stages for each of the 6 characters, and 120 challenging stages. Earn points by clearing each stage and get new costumes for the Pretty Girls from the dressing room shop! ◆Perfect for brain training! Match 3 mahjong tiles with the same pattern and erase them, and if you can erase the mahjong tiles in the field, the stage will be cleared. Determine the best order of mahjong tiles to erase so that your hand of mahjong tiles does not become full! ◆Enhanced hint function that strongly supports strategy! Powerful help functions such as shuffle and undo are available to assist you in solving puzzles. The hint function will support you in trouble! ◆ 'KAWAII' girls are waiting for you! A total of 6 characters appear! The new costume you get can be changed in the dressing room. All characters have Japanese voices. ◆ Dressing room is powered up! The well-known dressing room has been further enhanced with the ability to save/load scenes created in diorama mode. You can arrange multiple characters at the same time, customize the placement location, facial expressions and costumes of each character, and prepare 10 types of stamps to decorate the scene gorgeously. Create and store your ideal scene! ◆ Character introduction Riara A lightly flirtatious beauty. She is fashionable, dances and models, but she is also a mischievous troublemaker. Makoto Cheerful, athletic and energetic. He is good at dancing, but he is ignorant of fashion. He hates crookedness and has an honest personality. Sizuka A beautiful woman with a beautiful face and a soft demeanor. She was raised as a young lady and is naive, but she is active as a model and in dramas. Mamiko Neat and clean, natural sister system. She has a very kind personality and is maternal, but she is often seen younger than her age. Rui A beautiful woman with a tall and outstanding model figure and beauty. Contrary to her appearance, she is strong-willed and has a caring personality. Honoka A natural beauty with a calm, bright and innocent personality. As her ideal girlfriend, she is often liked by the opposite sex. * Beautiful girl characters are officially licensed and used. *All characters appearing in this game are over the age of 18.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2144360/header.jpg?t=1664498331",
    "Price": 3.99,
    "Developers": "Zoo Corporation",
    "Publishers": "Zoo Corporation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2144360/ss_8ef82a956c965038107f5c612007d4342211a640.1920x1080.jpg?t=1664498331,https://cdn.akamai.steamstatic.com/steam/apps/2144360/ss_afef6c82a8af7ab28c0ed8d21b6af22013a009fb.1920x1080.jpg?t=1664498331,https://cdn.akamai.steamstatic.com/steam/apps/2144360/ss_8cca4a7c7f7c8e01c704a422aa6357471615b6c3.1920x1080.jpg?t=1664498331,https://cdn.akamai.steamstatic.com/steam/apps/2144360/ss_7da0d03a2e10b44135f9ee7eb0c92ef2a21a22db.1920x1080.jpg?t=1664498331,https://cdn.akamai.steamstatic.com/steam/apps/2144360/ss_a9c221f583c6be3f919716a918f5ef7e36c66fbb.1920x1080.jpg?t=1664498331",
    "Slug": "pretty-girls-tile-match",
    "Meta Title": "Pretty Girls Tile Match: Sep 29, 2022, Zoo Corporation an...",
    "Meta Description": "Looking for information on Pretty Girls Tile Match? Check out the release date (Sep 29, 2022), developer insights from Zoo Corporation, and a complete g...",
    "Alt Text Image": "Official header image for Pretty Girls Tile Match game - Steam 2144360",
    "Canonical URL": "https://gusku.site/game/pretty-girls-tile-match",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pretty Girls Tile Match\", \"description\": \"Looking for information on Pretty Girls Tile Match? Check out the release date (Sep 29, 2022), developer insights from Zoo Corporation, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zoo Corporation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zoo Corporation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2144360/header.jpg?t=1664498331\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}