{
    "AppID": 2140770,
    "Name": "千灵大陆-Qianling Mainland",
    "Release date": "Sep 22, 2022",
    "About the game": "About the game You were originally an ordinary young man in the 21st century. But for some reasons you were forced to be sent to a mythical world of immortals and swordsmen accidentally—Qianling mailland. Here, you learnt that your grandfather who has passed away for a long time was one of the three emperors of Qianling mailland! From then on, you were no longer the ordinary youth in the 21st century, but a descendant of the three emperors. And you shouldered the mission of rejuvenating the human race! Since then, you would live a super cool life script in Qianling mailland to lead your friends to fight monsters, go through difficulties and save the human race. Features This is a completely fictitious new world and an excellent stimulation game of immortals and knights with rich plot and high degree of freedom. It will unfold the fantasy adventure journey of mystery world in the mode of map exploration. There are many types of systems for you to freely choose the combat mode, five optional teammates, fixed formula of cultivation experience to upgrade, and no upper limit for level attributes. A number of accessible characters, a large number of exquisite CG, and a touching main plot. High freedom map exploration mode, five super cool large-scale replicas. You can open guilds, assembl legions, recruit unlimitedly, and appoint generals freely. Game play Free combat modes such as single player / team combat (real-time combat) control skill release and use of elixir can be selected. Team fighting (turn system) can skip the fighting process. The main character can get 6 active skills and 3 passive skills. The active skill level has an upper limit and can be shuffled at any time. The passive skill level has no upper limit and cannot be shuffled. The protagonist can wear five pieces of equipment, and teammates and spirit pet can wear one piece of synthetic equipment. A total of 100 kinds of equipment can be obtained by beating monsters, creating, making and trading. The task system is divided into main and sub lines. The main line task is the main factor to promote the plot. Failure of individual tasks will affect the plot. Entrusted tasks are handed over on your own, with monetary and reputation rewards. You can open a guild and choose your own name. It has functions such as expansion, fund deposit, withdrawal, task management, recruitment, and task arrangement. It's necessary to maintain the guild, and it depends on personal preferences to develop the guild. You can open a regiment to identify generals, arrange troops, and fight in the world. Soldiers of the regiment can be transferred with the guild, recruit soldiers indefinitely, and appoint generals freely.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2140770/header.jpg?t=1663837457",
    "Price": 7.19,
    "Developers": "橙光游戏",
    "Publishers": "橙光游戏",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2140770/ss_6ca8ff11e8bfd72f5b4036d1cbabc9f52350da1b.1920x1080.jpg?t=1663837457,https://cdn.akamai.steamstatic.com/steam/apps/2140770/ss_50bf5ca3de65cba0235b15255d9c492502181a8e.1920x1080.jpg?t=1663837457,https://cdn.akamai.steamstatic.com/steam/apps/2140770/ss_c866bca937b6a6aabb8cb5bbee8688374dd59585.1920x1080.jpg?t=1663837457,https://cdn.akamai.steamstatic.com/steam/apps/2140770/ss_8f622c542bb27484163189a15a1cf1204e5cac00.1920x1080.jpg?t=1663837457,https://cdn.akamai.steamstatic.com/steam/apps/2140770/ss_28617da6b54179f139084cf153830c94a0ed78c8.1920x1080.jpg?t=1663837457",
    "Slug": "qianling-mainland",
    "Meta Title": "千灵大陆-Qianling Mainland: Sep 22, 2022, 橙光游戏 and Full Overview",
    "Meta Description": "Looking for information on 千灵大陆-Qianling Mainland? Check out the release date (Sep 22, 2022), developer insights from 橙光游戏, and a complete game summary.",
    "Alt Text Image": "Official header image for 千灵大陆-Qianling Mainland game - Steam 2140770",
    "Canonical URL": "https://gusku.site/game/qianling-mainland",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5343\\u7075\\u5927\\u9646-Qianling Mainland\", \"description\": \"Looking for information on \\u5343\\u7075\\u5927\\u9646-Qianling Mainland? Check out the release date (Sep 22, 2022), developer insights from \\u6a59\\u5149\\u6e38\\u620f, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6a59\\u5149\\u6e38\\u620f\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6a59\\u5149\\u6e38\\u620f\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2140770/header.jpg?t=1663837457\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}