{
    "AppID": 2021690,
    "Name": "Sakura Alien 2",
    "Release date": "Sep 19, 2022",
    "About the game": "In this visual novel Takagi Haru is a normal university student with an abundance of love for the stars. As a member of his university’s astronomy club, alongside the sweet but somewhat ditzy Hiyori, Haru means to devote his life to the stars. He doesn’t have any time to mess around with cute girls… At least, that’s what he always thought – until an alien princess from another planet, Ena, lands on his lap, and declares herself to be his future wife. Haru ends up taking Ena in, as she has nowhere else to go, and Ena and Hiyori soon hit it off. Now, the three of them are good friends (or perhaps something more) – but malevolent forces are seeking to undermine their relationship. A new professor has arrived at Haru’s university. Her name is Professor Sakai, and she composes herself in a beautiful, elegant manner. She is undoubtedly alluring, and Haru is soon drawn to her – but Professor Sakai seems to have her sights set on Ena. Has Professor Sakai discovered Ena’s secret identity as a runaway alien princess – and what does she mean to do with Ena? That’s something Haru has to figure out, else Ena might soon find herself in a sticky situation. Ena is an alien princess who comes from a far-off planet called Corval. She was raised as a member of alien royalty, and she’s used to the finer things in life. She isn’t a snob, however, and she enjoys nothing more than lounging around Haru’s apartment in one of his old button-up shirts, eating snacks and reading manga. Ena is a cheerful, bubbly girl, and she’s capable of brightening up anybody’s day with a single smile. If she wasn’t already an alien princess, she might make a good idol! Hiyori is a kind-natured girl one year Haru’s senior, and the president of the astronomy club. She might be even more obsessed with the stars than Haru, as she seems to believe, owing to a star-shaped birthmark on her chest, that she herself is an extraterrestrial. Hiyori’s parents are both exceedingly wealthy, but she doesn’t seem to get along with them very well. She doesn’t often talk about her family, and would far rather hang out with Haru and Ena. Professor Sakai (given name unknown) is a newbie professor at Haru and Hiyori’s university. She might look cool and mature, with her icy intellect and her dark, sophisticated fashion sense, but she’s actually something of a klutz: a fact she’s very embarrassed about. She seems to have taken an especial interest in Ena: a development which causes Haru no shortage of stress. Professor Sakai might be pretty, but what, exactly, is she plotting…?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2021690/header.jpg?t=1663606334",
    "Price": 7.49,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2021690/ss_acebd3c96b03fec33e584fc8b75e9c8518159e6d.1920x1080.jpg?t=1663606334,https://cdn.akamai.steamstatic.com/steam/apps/2021690/ss_ce875ea3a0a5ae409a35f64ffbdb3d01e36a27b9.1920x1080.jpg?t=1663606334,https://cdn.akamai.steamstatic.com/steam/apps/2021690/ss_e58c2a4c1e963766e0ba42caed825108f6785d7e.1920x1080.jpg?t=1663606334,https://cdn.akamai.steamstatic.com/steam/apps/2021690/ss_0ce5aa12cc0fd82049ff3b73e0d1a96cd9240e1a.1920x1080.jpg?t=1663606334,https://cdn.akamai.steamstatic.com/steam/apps/2021690/ss_750223f5d1016f30fbdc25953a3f11b308fc0948.1920x1080.jpg?t=1663606334,https://cdn.akamai.steamstatic.com/steam/apps/2021690/ss_b29cb7f690e6e84577ba852560c3e056f4a3277b.1920x1080.jpg?t=1663606334,https://cdn.akamai.steamstatic.com/steam/apps/2021690/ss_bfb54e0fa970ea03229d17547c8c4c91b89baaa6.1920x1080.jpg?t=1663606334,https://cdn.akamai.steamstatic.com/steam/apps/2021690/ss_5dce31d09ddc052eb42caeb445966fc0d5ab37df.1920x1080.jpg?t=1663606334",
    "Slug": "sakura-alien-2",
    "Meta Title": "Sakura Alien 2: Sep 19, 2022, Winged Cloud and Full Overview",
    "Meta Description": "Looking for information on Sakura Alien 2? Check out the release date (Sep 19, 2022), developer insights from Winged Cloud, and a complete game summary.",
    "Alt Text Image": "Official header image for Sakura Alien 2 game - Steam 2021690",
    "Canonical URL": "https://gusku.site/game/sakura-alien-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura Alien 2\", \"description\": \"Looking for information on Sakura Alien 2? Check out the release date (Sep 19, 2022), developer insights from Winged Cloud, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2021690/header.jpg?t=1663606334\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}