{
    "AppID": 1602080,
    "Name": "Soulstice",
    "Release date": "Sep 19, 2022",
    "About the game": "The balance of the Holy Kingdom of Keidas is compromised when powerful, feral creatures known as “Wraiths” invade from the other side of the Veil, threatening to consume the living. Wraiths corrupt their victims and can even possess their bodies, turning into unstoppable monsters that prey upon the common folk. The “Chimeras”, hybrid warriors born of the union of two souls, are the only ones who can protect humankind. Briar and Lute are two sisters who have been reborn as a Chimera. The transformation has granted Briar superhuman strength and resilience, while Lute, sacrificed to bind her soul to her sister’s, has become a shade with mystical powers. Voiced by Stefanie Joosten (Metal Gear Solid 5), Briar and Lute are sent on a mission to reclaim a city in ruins that has been ravaged by the Wraiths, only to discover that the Order they belong to has a far more complex plan in mind. Explore a dark world brimming with hidden mysteries, master a diverse combat system, and inhabit the dual forces of two sisters in a coming-of-age dark fantasy story with fast-paced action, vicious enemies, and spectacular boss fights. Key Features Fight in Synergy - Manage sisters Briar and Lute simultaneously. Master melee attacks and combos as Briar and take control of the battlefield with otherworldly abilities as Lute. Combine their strengths to unlock powerful, transformational abilities and tap into their true potential as Chimera. Explore a City in Ruin - A Tear in the Sky has opened above the once-holy city of Ilden. As Briar and Lute fight to reach the Tear, they’ll face challenging puzzles and unveil secrets of the Order while their surroundings become more hostile and twisted. Customize Weapons and Abilities - Weapons are unlocked and upgraded throughout the game and can even be switched on the fly to unleash stylish and highly devastating combo attacks. Battle Different Enemy Classes - A vile mix of Wraiths, Corrupted and Possessed, have poured into the world from beyond the Veil. Utilize Lute’s unique auras to expose or weaken these creatures and adapt to a flow of battle that never feels the same. Learn the Truth of Your Origin - Through a dark story filled with sisterly love and sacrifice, Briar and Lute discover the truth about themselves and their Chimera powers while working together and staying true to their unbreakable bond.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1602080/header.jpg?t=1663781089",
    "Price": 39.99,
    "Developers": "Reply Game Studios",
    "Publishers": "Modus Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1602080/ss_2a586a736a8e58336733d50222966a95462a057c.1920x1080.jpg?t=1663781089,https://cdn.akamai.steamstatic.com/steam/apps/1602080/ss_85cb272e583619562b20a455c3bcb7d84ee7664d.1920x1080.jpg?t=1663781089,https://cdn.akamai.steamstatic.com/steam/apps/1602080/ss_10da647594622308d426abcc5b38b636da13db8f.1920x1080.jpg?t=1663781089,https://cdn.akamai.steamstatic.com/steam/apps/1602080/ss_a8254e89b61079225a212f1b34be5c847f688a19.1920x1080.jpg?t=1663781089,https://cdn.akamai.steamstatic.com/steam/apps/1602080/ss_0a7d883fb5f847e843b7094f093701abf2a1e3d1.1920x1080.jpg?t=1663781089,https://cdn.akamai.steamstatic.com/steam/apps/1602080/ss_a9a7d45f7dd5de27e9f73264e64a246b233c1cac.1920x1080.jpg?t=1663781089,https://cdn.akamai.steamstatic.com/steam/apps/1602080/ss_e5991d52f2f42be4a7613eca7734ad673d23eca9.1920x1080.jpg?t=1663781089",
    "Slug": "soulstice",
    "Meta Title": "Soulstice: Sep 19, 2022, Reply Game Studios and Full Over...",
    "Meta Description": "Looking for information on Soulstice? Check out the release date (Sep 19, 2022), developer insights from Reply Game Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Soulstice game - Steam 1602080",
    "Canonical URL": "https://gusku.site/game/soulstice",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Soulstice\", \"description\": \"Looking for information on Soulstice? Check out the release date (Sep 19, 2022), developer insights from Reply Game Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Reply Game Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Modus Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1602080/header.jpg?t=1663781089\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}