{
    "AppID": 2121100,
    "Name": "The Cabin - Summer Vacation | Episode 1",
    "Release date": "Sep 21, 2022",
    "About the game": "Our project 'The Cabin' is a blend of traditional adult visual novel concepts, and horror elements. It is a story driven AVN complete with full 3D visuals where your choices matter, and includes some twists and turns you may not be expecting. Not all paths will lead to the kind of spicy content you may be expecting, but there will be plenty of chances for that as our protagonist searches for adventure to fill his last summer vacation with. In The Cabin, you begin your adventure as an 20 year old guy who's lamenting his last summer vacation before venturing into adulthood to start a career. Little does he know, when his plans get turned upside down and he finds himself out in the middle of the wilderness, this is likely to be more than he bargained for. Meet new characters, enkindle deeper relationships with existing characters, and most of all, keep them and yourself safe in this AVN where all choices matter. Episode 1 of The Cabin includes, but is not limited to: - Visiting various locales While there won't always be a choice of where you end up (especially in episode 1), we have a wide variety of different environments you will experience throughout the game, such as: relaxing at the nearby lake, visiting various stores and venues in town, or simply exploring the woods and finding hidden local gems. - Meeting 4 romanceable characters (With more to come!) We're taking more of a 'Quality over Quantity' approach to our characters, focusing on creating deeper more relatable personalities and quirks. No two characters should feel alike, and everyone will hopefully find someone, or a few someones to their liking. - 450+ HQ 3D rendered images These are just what are in the first episode, and we estimate each episode bringing an additional 300-500 renders, and more in the way of animations in the future. - Enjoy over 20,000 words of story Again, this is only the first episode, and future episodes should be of similar length. - Future episodes We estimate when the game is complete, it will be around 10-12 episodes. However as new scenes are created, and new branches emerge, this can be difficult to predict, and is subject to change. 10 episodes, around 4000-5000 renders and 200,000 words of story is likely to be the bare minimum. As this game is an adult visual novel, it includes 18+ sexual content. Though Episode 1 is a bit light as it introduces a lot of the characters, and brings the player into the game world, here is some of what you can expect to see as you continue to play, and more episodes are released: -Masturbation -Handjob -Blowjob -Vaginal sex -Anal sex -Exhibitionism -BDSM Please note, the vast majority of sexual content is avoidable, and interactions with the various characters are optional.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2121100/header.jpg?t=1663787786",
    "Price": 3.99,
    "Developers": "CellStudios,Wizard++",
    "Publishers": "CellStudios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2121100/ss_c5c7520742d29383f285e1a8ba20d4d53ca40f5a.1920x1080.jpg?t=1663787786,https://cdn.akamai.steamstatic.com/steam/apps/2121100/ss_1a274dc5e547b8142f84a1db9a7c52b1eab657fc.1920x1080.jpg?t=1663787786,https://cdn.akamai.steamstatic.com/steam/apps/2121100/ss_d6f7222f8db8c8540e6ee1e240a4e5ff65a5ac2d.1920x1080.jpg?t=1663787786,https://cdn.akamai.steamstatic.com/steam/apps/2121100/ss_9b0d002c4cfe131d2010dbf512a10e45e530d816.1920x1080.jpg?t=1663787786,https://cdn.akamai.steamstatic.com/steam/apps/2121100/ss_b19fbb76cd3753d1b99cf63e5638ca6fcb1c7ea8.1920x1080.jpg?t=1663787786,https://cdn.akamai.steamstatic.com/steam/apps/2121100/ss_35c09795feec849152f91b4143dbe1b18253ce2d.1920x1080.jpg?t=1663787786",
    "Slug": "the-cabin-summer-vacation-episode-1",
    "Meta Title": "The Cabin - Summer Vacation | Episode 1: Sep 21, 2022, Ce...",
    "Meta Description": "Looking for information on The Cabin - Summer Vacation | Episode 1? Check out the release date (Sep 21, 2022), developer insights from CellStudios,Wizar...",
    "Alt Text Image": "Official header image for The Cabin - Summer Vacation | Episode 1 game - Steam 2121100",
    "Canonical URL": "https://gusku.site/game/the-cabin-summer-vacation-episode-1",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Cabin - Summer Vacation | Episode 1\", \"description\": \"Looking for information on The Cabin - Summer Vacation | Episode 1? Check out the release date (Sep 21, 2022), developer insights from CellStudios,Wizar...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CellStudios,Wizard++\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CellStudios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2121100/header.jpg?t=1663787786\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}