{
    "AppID": 2025750,
    "Name": "The Shadow Government Simulator: Prologue",
    "Release date": "Sep 7, 2022",
    "About the game": "/ The Shadow Government Simulator: Prologue is just part of the gameplay that awaits you in the full game. Your job in the Prologue of the game is to take a control of a shadow organization dead set on global domination via bribery, intimidation, seduction, and any means necessary. Inspired by old classics like Plague Inc. and modern gems like The Shrouded Isle, this is a challenging game where you infiltrate nations, discover their networks of power, and then reshape them to fit your agenda. The Shadow Government Simulator: Prologue is a turn-based strategy game. The Shadow Government Simulator: Prologue is a part of the full version of The Shadow Government Simulator and is completely free. The most important is that prologue allows you to get into the world of The Shadow Government Simulator so you will be fully ready before the final product release! Turn-based strategic infiltration Every action you take matters on a global scale. When you enter a new nation, you’ll be alone with just a headquarters at your disposal and minimal information. Slowly, you will send your tendrils throughout the region uncovering who are the influential and how much power they truly wield. You'll discover their traits and personalities, earning an understanding of their weaknesses and how to best convert them to your side. Infiltrate nations around the world! More importantly, you'll discover who they are connected to, and thus person by person, you shall take over the whole elite. Having a strong interconnected network is the key to success, but the bigger you get the more visible you are and this could lead to your demise. Manage your network, cut and create connections, to ensure you act from the shadows when the time is right. Evolve your organization The world will be difficult to conquer without growth and adaptation. As you capture new units, you can change their abilities, unlocking new traits and adapting to the necessities of the shadow war. Throughout your campaign for world domination, you'll be able to build your organization with unique traits. Tailor your society and its pawns to fit your grand plan. Conquer the world and you'll be able to unlock different factions such as the Masons and the Templars, with different strengths and weaknesses! Fight for global supremacy As your organization grows and becomes more visible on the global scale the challenges you face will increase. The world’s countries will unite against you and you will face off against rival organizations. Choose wisely which region to infiltrate first, as they will provide different bonuses, but also present different challenges. Each region will offer a distinct play experience with its procedurally generated networks. As time moves forward the regions will acquire unique modifiers to increase the difficulty and diversity of the maps you play on. It might well be worth the risk, however, as nations you take over become yours to command, unlocking new powerful abilities. Be it a person or a country, they shall all become like pawns before you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2025750/header.jpg?t=1662571687",
    "Price": 0.0,
    "Developers": "Chupacabra Game Studios",
    "Publishers": "Games Incubator",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2025750/ss_18639d46396aaba6bb48fd0fe967df4b70e7bb4a.1920x1080.jpg?t=1662571687,https://cdn.akamai.steamstatic.com/steam/apps/2025750/ss_e41b8d2f81da2855ceeda90e88de7b598187103c.1920x1080.jpg?t=1662571687,https://cdn.akamai.steamstatic.com/steam/apps/2025750/ss_d05a0ec5416ceca9bc807d1d92cbcd444281e93d.1920x1080.jpg?t=1662571687,https://cdn.akamai.steamstatic.com/steam/apps/2025750/ss_16dc9aafc8db3d1c8506b44cabaaa1a619436028.1920x1080.jpg?t=1662571687,https://cdn.akamai.steamstatic.com/steam/apps/2025750/ss_3cb51959117b146c5359772218811867fe5a722d.1920x1080.jpg?t=1662571687,https://cdn.akamai.steamstatic.com/steam/apps/2025750/ss_750a15458ad5b1aaa9e11736207cf6466ad0bd20.1920x1080.jpg?t=1662571687",
    "Slug": "the-shadow-government-simulator-prologue",
    "Meta Title": "The Shadow Government Simulator: Prologue: Sep 7, 2022, C...",
    "Meta Description": "Looking for information on The Shadow Government Simulator: Prologue? Check out the release date (Sep 7, 2022), developer insights from Chupacabra Game ...",
    "Alt Text Image": "Official header image for The Shadow Government Simulator: Prologue game - Steam 2025750",
    "Canonical URL": "https://gusku.site/game/the-shadow-government-simulator-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Shadow Government Simulator: Prologue\", \"description\": \"Looking for information on The Shadow Government Simulator: Prologue? Check out the release date (Sep 7, 2022), developer insights from Chupacabra Game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chupacabra Game Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Games Incubator\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2025750/header.jpg?t=1662571687\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}