{
    "AppID": 1936000,
    "Name": "The Infernal Return",
    "Release date": "Sep 10, 2022",
    "About the game": "Overview The design of the environment is based on the ancient Chinese underworld myths and legends. Only this time, we broke the stereotypical idea. Presented to the players is a mixture of ancient, modern, fantastic styles. Story Koward is a timid guy who doesn't dare reveal his feeling to his girlfriend Mangostina. In order to complete the indicators given by Yama, the King of Hell, the two hell messengers Black and White impermanence abducted Koward with an excuse and brought him to the underworld. Koward's spirit was then imprisoned within Fengdu Ghost City. To escape and resurrect, Koward made a deal with the Styx Lord. While satisfying the price offered by the Styx Lord, Koward investigated the cause of his death, gathered two companions, and finally found the way to resurrect. Meanwhile, he discovered that the abduction seemed to have been a well-planned trick... Key features Novel interactive system The protagonist needs to constantly collect wine to fill the 'wine well', which will prevent the devastating moment when the Yama, the King of hell, awakens. In addition, the hero can get stuff from his relatives and friends in the mortal world by dream messaging and the cross-world delivery services. The psychic medium undertaking this operation is borne by the famed Bank of Heaven and Earth. Classic but not exhausting exploration There are always collectable hidden elements. Still, with your desire for more of them, you will find that you are good at discovering those hidden elements in quirky corners, obtaining the sense of achievement in a professional manner. Pay attention to those luminous, missing and regularly arranged places, where there are little ghosts who like to whine and cry! And do revisit the places you have been to for new discoveries! There is a casino in the underworld! Compete against ghosts with fantastic leisure games Inflation becomes a top issue for the underworld due to paper money burning behaviour from human beings. To afford the pricy commodities, a good place to earn money is the Oblivion Casino. Of course, it's also a good way to go broke. Special powers only available in the underworld Summoning a motorcycle, doing the infernal dance, teleporting, telescoping and transforming, etc. Operating instructions The game fully supports joystick controllers and keyboard controls. A joystick enables all direction walk and run while a keyboard only supports 8 directions. Detailed instructions can be found in game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1936000/header.jpg?t=1662930119",
    "Price": 6.59,
    "Developers": "Knifish Games",
    "Publishers": "Knifish Studio,Angel Star Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1936000/ss_7d7703cbec3588ab62006203a04841baf8271571.1920x1080.jpg?t=1662930119,https://cdn.akamai.steamstatic.com/steam/apps/1936000/ss_a5a9dc2685d841e4e387cc81c07cdd39d9a4ad68.1920x1080.jpg?t=1662930119,https://cdn.akamai.steamstatic.com/steam/apps/1936000/ss_27cad869ae3bb5f60243f6d60aed5d75f4f33376.1920x1080.jpg?t=1662930119,https://cdn.akamai.steamstatic.com/steam/apps/1936000/ss_16c8c551d60fb6fc74d039ce4d501e5443e0af2a.1920x1080.jpg?t=1662930119,https://cdn.akamai.steamstatic.com/steam/apps/1936000/ss_569d5d9ad2e997458a3dce375af997443b793746.1920x1080.jpg?t=1662930119,https://cdn.akamai.steamstatic.com/steam/apps/1936000/ss_b99d38fb7413c5628a67bf01b0d99419ceb58700.1920x1080.jpg?t=1662930119,https://cdn.akamai.steamstatic.com/steam/apps/1936000/ss_82f2937c270ad1f16682e435688827428e7f895f.1920x1080.jpg?t=1662930119",
    "Slug": "the-infernal-return",
    "Meta Title": "The Infernal Return: Sep 10, 2022, Knifish Games and Full...",
    "Meta Description": "Looking for information on The Infernal Return? Check out the release date (Sep 10, 2022), developer insights from Knifish Games, and a complete game su...",
    "Alt Text Image": "Official header image for The Infernal Return game - Steam 1936000",
    "Canonical URL": "https://gusku.site/game/the-infernal-return",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Infernal Return\", \"description\": \"Looking for information on The Infernal Return? Check out the release date (Sep 10, 2022), developer insights from Knifish Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Knifish Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Knifish Studio,Angel Star Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1936000/header.jpg?t=1662930119\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}