{
    "AppID": 1350810,
    "Name": "Total Rendition",
    "Release date": "Sep 13, 2022",
    "About the game": "The Game They Don't Want You To Play! In this narrative-driven first-person immersive simulation, you start out with your first day at Knoll NV, a large multinational firm operating in the shady world of 'litigation support' (or to put it plainly, privatized spooks). Among their clients are the van Hoorn family, a prominent Dutch old money dynasty based in 'Holland's Finest Beach' of Noordwijk aan Zee, in turn renowned, or perhaps notorious, for being frequently visited by prominent figures from across the world. Yet, while the van Hoorns themselves are nowhere to be found, you do encounter state-sponsored terrorists masquerading as mere frat boys, dodgy business transactions, pervasive corruption and the rest. Of course, this is only the beginning, leaving you wondering whether you have been set up for a fool's errand. Get ready to set out on an odyssey to discover the truth, as you jump into a parallel world where you encounter the reality behind Europe's urban legends, political scandals and conspiracy theories. In order to survive in a brutal and decadent world, you must use your wits in either covert or violent ways. Total Rendition is set in contemporary times and tells you a story of a world decades in the making as a result of buffoonery, stupidity and complacency. So, what will you do when that world is about to explode? Total Rendition may be the Game They Don't Want You To Play , yet it is perhaps by playing, that you may find out... A Post-Truth Immersive Simulation You are anonymous, an unknown protagonist whose identity can only be decided by you. Uncover terrifyingly plausible political conspiracies at the most unexpected of places. Shoot, strike, sneak, sabotage or s#!t-talk your way into achieving your goals. Pierce through the thinly veiled facade of an ostensibly prosperous and hospitable community. Hyper-immersive first-person gameplay featuring an in-game smartphone which comes with its own Role-Playing Game. (Yes, we're serious!) Interact with nearly everything you find, or don't, as your capacity to carry items and weaponry may prove to be rather limited. Decide on upgrades for your character's skillset to reach objectives your own way. Ponder on difficult decisions to create a different experience with every playthrough. A narrative inspired by the most notorious political scandals to have plagued Europe since the beginning of the 20th century. BONUS: No microtransactions!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1350810/header.jpg?t=1663258113",
    "Price": 4.99,
    "Developers": "Schizotypy Games",
    "Publishers": "Schizotypy Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1350810/ss_b5168b2191bd7b581f7d1dd32b3fa805f10a9155.1920x1080.jpg?t=1663258113,https://cdn.akamai.steamstatic.com/steam/apps/1350810/ss_c598051446ad8abbbc20835eaa0033440179bc5c.1920x1080.jpg?t=1663258113,https://cdn.akamai.steamstatic.com/steam/apps/1350810/ss_5e345017685310ad88a7835360c6a8383ab36f0b.1920x1080.jpg?t=1663258113,https://cdn.akamai.steamstatic.com/steam/apps/1350810/ss_a636dcddc04a11568960ddf2381c171986b03d24.1920x1080.jpg?t=1663258113,https://cdn.akamai.steamstatic.com/steam/apps/1350810/ss_3d32f87b1add0f5391e44e85ecde5335db564227.1920x1080.jpg?t=1663258113,https://cdn.akamai.steamstatic.com/steam/apps/1350810/ss_271f9af46c8ec0ab62fa2d1cea30f4a176df35cd.1920x1080.jpg?t=1663258113",
    "Slug": "total-rendition",
    "Meta Title": "Total Rendition: Sep 13, 2022, Schizotypy Games and Full ...",
    "Meta Description": "Looking for information on Total Rendition? Check out the release date (Sep 13, 2022), developer insights from Schizotypy Games, and a complete game sum...",
    "Alt Text Image": "Official header image for Total Rendition game - Steam 1350810",
    "Canonical URL": "https://gusku.site/game/total-rendition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Total Rendition\", \"description\": \"Looking for information on Total Rendition? Check out the release date (Sep 13, 2022), developer insights from Schizotypy Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Schizotypy Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Schizotypy Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1350810/header.jpg?t=1663258113\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}