{
    "AppID": 2025660,
    "Name": "Trust No Bunny",
    "Release date": "Sep 13, 2022",
    "About the game": "Vote which players you’ll send on guard to protect the town from wolves each night, but beware – some of your fellow townsfolk have been acting strangely. Do they just have secret quirks, or might they be Werebunnies helping take down your defenses from within? You'll need to manage your resources wisely to defend the town from incoming damage (or use them to sabotage the guards instead, if you're a Werebunny), while also taking into account various magical items, quirks, and abilities that can alter the outcome! Choose wisely who to bring and which powers to use – each night could be your last. Split audio voice channels that allow sneaky scheming! Perks &amp; quirks that make every game unique, and no two players the same! Secret quests that keep everyone guessing what your real motives are! Sophisticated tasks that clever players can use to expose the imposter! But wait – there's more! Directly integrated voice &amp; text chat Free costumes &amp; collectibles to customize your personal Pixi avatar Live service &amp; continuous updates Crossplay &amp; mobile app (coming soon!) Meet your new neighbors now on the Friendly Pixel Discord! Find friendly folks to play with, talk directly with the devs, and share your ideas for new Quirks, Items, and Mutations! Hop in the Discord: WINNING Players are divided into two teams, Townsfolk and Werebunnies, each with their own Quirks, Items, and Mutations that influence how they will play the game. Each player will have resources represented by cards which each player will use to defend or destroy the town. Over five rounds, players will vote on who will go on guard against the incoming wolf attacks. Those who do not guard and stay in town will choose from a variety of actions to gain extra cards or vital intel. The game ends and the Werebunnies win if, at the end of any round, the defenses - the Wall and the Tower - drop to zero. The Townsfolk win if they manage to defend the town through to the final night with at least 1 point of defenses remaining. The Townsfolk can also win if at any time they unanimously accuse the correct two players of being Werebunnies. GAMEPLAY The game is played over five rounds, indicated by the phases of the moon. Each round has a day phase in which all players are together and then a night phase in which players are separated into two teams, each with their own separate voice channel for communication. The defenses are attacked by the wolves lurking in the forest surrounding the town, and true Townsfolk will try to bolster the defenses with cards that are worth 1, 2, 3, or 4 points. Meanwhile, the Werebunnies will secretly use those same cards to weaken the defenses instead. All players start the game with three cards in hand, and can gain more over the course of the game; both Townsfolk and Werebunnies can play as many cards as they want on a single night on guard, but must consider if they want to save cards for later nights as well. ACTIONS Each time you stay at home, no matter what action you take, you will gain one card at the end of the night. You can also gain cards at home by Blessing another player also at home to grant them an additional card, or Predicting if the defenses will take damage that night, and if you’re correct, gaining an additional card. SABOTAGE Werebunnies have the extra, powerful, option to Sabotage each night that they are at home. They can pick any player (even the same player!), regardless of whether that player is at home or on guard at the Tower, and try to guess that player’s Quirk. If the Werebunnies are correct, then that player will lose their Item at the end of the night, and both Werebunnies will gain an additional card! QUIRKS Quirks are attributes that Townsfolk have that affect their ability to play or win the game. A Townsfolk must meet the requirements of their Quirk to be considered a winner at the end of the game. In other words – if the game ends in a Townsfolk victory and you have not completed your Quirk, you are not invited to the party! ITEMS Items offer benefits and abilities that, if used well, give Townsfolk and Werebunnies small advantages in the game: revealing more information, gaining more cards, or helping you protect the town more effectively. There are currently five Items, and you have an equal chance of being offered any of them at the start – with the exception of the Mystical Recipe, which is much more rare, and can only appear up to one time at the start of every game. MUTATIONS Mutations are powerful attributes that allow Werebunnies unique paths to victory and sneaky ways to outwit Townsfolk players – like damaging the defenses when they’re not even on guard that night, or gaining an extra card if they can trick a Townsfolk into Blessing them. ACCUSE The Townsfolk have one final path to victory: Accusing. Townsfolk can, at any point, choose to Accuse two other players of being Werebunnies. If, at the end of any phase, ALL Townsfolk have correctly chosen BOTH Werebunnies, the game will immediately end with a Townsfolk victory – regardless of the damage to the town, and whether or not Townsfolk have fulfilled their Quirks. Everyone wins! Except the Werebunnies, that is. ABOUT FRIENDLY PIXEL Friendly Pixel is a new team with experience across massive multiplayer AAA titles (League of Legends), handcrafted games for educational environments (Tanuki Games), and classic board game design (Mechs vs Minions). We have a bunch of different backgrounds, but we found that we have a lot in common when it comes to our favorite games and how they’re designed. Our goal as a team is pretty simple: make the best, most innovative, and satisfying digital version of the party &amp; board game experience we know and love.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2025660/header.jpg?t=1663215999",
    "Price": 4.91,
    "Developers": "Friendly Pixel, Inc.",
    "Publishers": "Friendly Pixel, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2025660/ss_a8a98cccdd080b82597f2b66706f628612761ab7.1920x1080.jpg?t=1663215999,https://cdn.akamai.steamstatic.com/steam/apps/2025660/ss_3f3f2e218dcba063877609ee57e35bf067a63c30.1920x1080.jpg?t=1663215999,https://cdn.akamai.steamstatic.com/steam/apps/2025660/ss_4ba3de8dd66b55eaae134a4dda23a3a0400aaa50.1920x1080.jpg?t=1663215999,https://cdn.akamai.steamstatic.com/steam/apps/2025660/ss_fa7f74c9cf09d2551d37b53697f18ca218f79893.1920x1080.jpg?t=1663215999,https://cdn.akamai.steamstatic.com/steam/apps/2025660/ss_0ddeea227bd1b1cbe16e6b32e42b7d145cb34ee2.1920x1080.jpg?t=1663215999,https://cdn.akamai.steamstatic.com/steam/apps/2025660/ss_1e072a61ed5f88dee105517619c7c4c2667623ec.1920x1080.jpg?t=1663215999",
    "Slug": "trust-no-bunny",
    "Meta Title": "Trust No Bunny: Sep 13, 2022, Friendly Pixel, Inc. and Fu...",
    "Meta Description": "Looking for information on Trust No Bunny? Check out the release date (Sep 13, 2022), developer insights from Friendly Pixel, Inc., and a complete game ...",
    "Alt Text Image": "Official header image for Trust No Bunny game - Steam 2025660",
    "Canonical URL": "https://gusku.site/game/trust-no-bunny",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trust No Bunny\", \"description\": \"Looking for information on Trust No Bunny? Check out the release date (Sep 13, 2022), developer insights from Friendly Pixel, Inc., and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Friendly Pixel, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Friendly Pixel, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2025660/header.jpg?t=1663215999\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.91, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}