{
    "AppID": 1950310,
    "Name": "Until The End",
    "Release date": "Sep 1, 2022",
    "About the game": "In Until The End, you play as Zoe, a young nurse who has just graduated. At the Montagne Institute, you will help her make the best decisions for the well-being of her patients in a palliative care unit. She is counting on you to build healthy and lasting relationships with her team. Accompany people with rich and touching stories until their last breath. Multiples choices Zoe is living an exceptional experience. Confronted with unusual situations, she will have to make choices that are sometimes also out of the ordinary. They will influence the course of the story, but also her relationships with the different protagonists of the adventure : Eliott, her companion, Elisabeth, the head of the department, Mr. Lorius the public figure, and many others. Game Experience Until The End was written with the support of a nurse who has worked in palliative care. It's an experience as close to the real thing as you can get. You don't need any medical knowledge to fully experience the adventure. Until The End is not a Serious Game, the realism of the situations is sprinkled with a touch of esoteric fantasy and sometimes absurd and funny situations. Be Prepared If you think of hospice palliative care as the last stage of life, a dull, sad place from which all notions of joy have escaped, take heart. It is above all a place where life takes its most beautiful impulses, where teams experience strong and sincere emotions. Until The End is not a dark game, it is often joyful. You can count on Zoe to brighten up the emotional moments - Pixel art graphics. - You will meet 8 patients with different personalities, each with a complete file. - Several endings are possible in Until The End, it's up to you to discover them. - A singular and original story in a a service that is not talked about enough in hospitals. - Choices that really influence the story, they all impact your relationships or the course of events. - Laughter, drama and mystery. - A little bit of otherworldly thrill during the nights at the institute. Follow Zoe in this visual novel, accompany the patients until the end and above all, enjoy the moment.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1950310/header.jpg?t=1662030925",
    "Price": 4.99,
    "Developers": "Red Sorel Games",
    "Publishers": "Red Sorel Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1950310/ss_8ba6c3ed2af89c6fcbf17294d0db2c3ef1d3f0ee.1920x1080.jpg?t=1662030925,https://cdn.akamai.steamstatic.com/steam/apps/1950310/ss_18ab78828427c8e050ec50e73cc1e57200676a00.1920x1080.jpg?t=1662030925,https://cdn.akamai.steamstatic.com/steam/apps/1950310/ss_2ca20466e282fd997ac100daa58da055f960879d.1920x1080.jpg?t=1662030925,https://cdn.akamai.steamstatic.com/steam/apps/1950310/ss_7554e2ae618555f5068ef29b9b5c42ade512b0c6.1920x1080.jpg?t=1662030925,https://cdn.akamai.steamstatic.com/steam/apps/1950310/ss_24acc5dc3cd05fcc98b3f50ebaa4d46d2c5ce2d5.1920x1080.jpg?t=1662030925",
    "Slug": "until-the-end",
    "Meta Title": "Until The End: Sep 1, 2022, Red Sorel Games and Full Over...",
    "Meta Description": "Looking for information on Until The End? Check out the release date (Sep 1, 2022), developer insights from Red Sorel Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Until The End game - Steam 1950310",
    "Canonical URL": "https://gusku.site/game/until-the-end",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Until The End\", \"description\": \"Looking for information on Until The End? Check out the release date (Sep 1, 2022), developer insights from Red Sorel Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Red Sorel Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Red Sorel Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1950310/header.jpg?t=1662030925\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}