{
    "AppID": 2153390,
    "Name": "西部幻想 WestFantasy",
    "Release date": "Sep 29, 2022",
    "About the game": "About this game: In the RPG game 'Western Fantasy', players will feel the alternative and interesting cowboy culture and distinctive fighting style. At the beginning of the game, a simple main line is set to guide the plot. After completion, players will be free to explore the whole western continent in their own way. Is it the exciting adventure that follows? Or an elegant and leisurely trip? Is it a life of luxury? Or are you ambitious to reach the peak of world power? Or did you touch some taboo in the world and know the truth? The game sets a variety of playing routes and endings. Players are welcome to explore! Game features: 1. Special Cowboy duel system . In the game, players can get a reward from the police station in each town, find the wanted person according to the clues, and then defeat the enemy by their favorite methods (sneak attack, frontal hard work, duel, etc.) to obtain rewards. Among them, in duel mode, sharp reaction and accurate shooting skills.It will no longer be the only condition for deciding the outcome. The enemy will affect your normal level of play with various strange moves. 2. The enemy of intelligence and personality. In this game, the enemies you meet, no matter the boss or the little monster, all have unique skills, which should not be underestimated. Some are coquettish, some are obscene, some will design ambushes, and some are full of ridicule towards you in their words and deeds. No matter how strong you become, as long as you don't pay attention to it, you may be buried. 3. Diversified weapon systems, players will explore and acquire brand-new weapons in different ways in the game. Each weapon has its own value and use scenario, and when the use proficiency of a certain weapon is sufficient, players can explore and obtain the 'master skill' of the corresponding weapon in the game, so that the combat mode you are good at becomes a unique skill! 4. You can attack all NPCs in the game. If you think this way can make you get what you want faster, or you want to be a mixed devil in the game. Of course, even in the game, indiscriminate killing of innocent people will be punished. Whether you choose friendly or evil behavior, there is a way to the end. 5. Listen to or join the rich side tasks and emotional stories. Most of the stories in the game are described in a humorous tone. Funny sarcasm can always make people relaxed and happy, but don't take it too seriously and put it into reality. 6. Original art, including unique art style and personalized music. 7. Dozens of exotic and interesting games and puzzle solving challenges to win rich rewards. Including original games: The most grand and famous race in the western continent --- horse racing!! Oriental martial arts flavor --- falling leaves throwing dagger! The whole process is tense and energetic --- brave to break into the pigsty! Come, load me with five bullets --- the death revolver, the destiny is set!! Mobile game is exclusively for kryptonians --- killing ten people!! Kill Matt's sentiment --- finger tip dance king!! Life and death speed, hide and seek, luxury houses sneaking in, real estate speculation, and so on And some well-known classic game adaptation methods, such as: Radish pulling, archery master, Huarong Dao, box pushing, coin puzzle, treadmill, slot machine, etc Waiting for players to discover and challenge. 8. Many well-known famous characters and animation game terriers pay tribute to and love them. Maybe players can also feel a lot of resonance in the game. 9. Players can challenge to unlock and obtain dozens of interesting titles in the process of game exploration. Some titles will improve the basic attributes of characters and enhance the strength of characters. 10. Honor value system. In the game, you can accumulate honor points by offering rewards and defeating the wanted in a duel, while indiscriminate killing of innocent people will reduce honor points. Honor value records players' behavior style and will affect the final direction of the game. There are many more. I look forward to your discovery. Author's message: THIS GAME HAS NO English Support in current Version, If you can't understand chinese, Please wait . 'Western Fantasy' is my first independent game work. I have completed all the development, promotion and release of the game myself. Due to the huge personal workload and shallow production experience, players may inevitably encounter some bugs in the early version of the game. Please forgive me. I hope that through EA preemptive experience, players who like western fantasy can join in to experience the game first. At the same time, I will actively follow up the feedback of players, improve and optimize the game content. In the upcoming EA version, players will be able to experience the complete game process, and there is no need to buy the game body repeatedly in the subsequent official version. During the EA test, I will collect players' feedback and suggestions, and introduce more players' favorite playing methods and content. Finally, thank you for your support. Welcome to join my QQ communication group: 761236793.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2153390/header.jpg?t=1664597122",
    "Price": 13.99,
    "Developers": "CHEN HONG SHU",
    "Publishers": "SiriusStudio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_d609cf821e175141a529d041880acde7a4289be9.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_1b3cb539b0ca449a4db16a2718e524b60f128925.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_4556217067d02677d0adc64742b2454a068c33ec.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_781c1ff4d4fa19596ef44e2f3655a034605ace11.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_c79fc12a1489cb6e741b8654a325bd85703ec1b6.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_f7546ff8b7d2f1d40d396bd6e12608d53b9feb90.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_20b4b7e1dd2f4d870e0783648c7bbe5856fb1537.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_d12b5eb8d9e6a16982feede30eb9a85d50e72957.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_f2e00a86a451284070964dbe4d7368016ac5ac01.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_5d0c7c5aec59fb3441967d5c8cec5c3b4d280d87.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_0326d35ad29d27f249e8e682bf8b2353fb3c99f2.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_5161dbedb13fcdd57ece75dabe68bf42e64b33d0.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_ab3b9c25e73caadd1c7f52d279b3904fa2b2caca.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_769d7b055bedbb4349d03c8d7bbc868f82fe3c93.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_d9ef0d4c0864f55def41c35d28cd85b186994e61.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_e3272719490a7ba0f381c32f254ef899d4a2a517.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_4db94bf3d5109230b7b352d945b8a44a0c99d3c5.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_a33c946077aeffb2e954f7cfdee1b83717dc232b.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_d26e4a4c66b2258f96ae897202881ac11ee60658.1920x1080.jpg?t=1664597122,https://cdn.akamai.steamstatic.com/steam/apps/2153390/ss_20999024f2502186bbd3ed5737d0e76b8a74a8ef.1920x1080.jpg?t=1664597122",
    "Slug": "westfantasy",
    "Meta Title": "西部幻想 WestFantasy: Sep 29, 2022, CHEN HONG SHU and Full Ov...",
    "Meta Description": "Looking for information on 西部幻想 WestFantasy? Check out the release date (Sep 29, 2022), developer insights from CHEN HONG SHU, and a complete game summary.",
    "Alt Text Image": "Official header image for 西部幻想 WestFantasy game - Steam 2153390",
    "Canonical URL": "https://gusku.site/game/westfantasy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u897f\\u90e8\\u5e7b\\u60f3 WestFantasy\", \"description\": \"Looking for information on \\u897f\\u90e8\\u5e7b\\u60f3 WestFantasy? Check out the release date (Sep 29, 2022), developer insights from CHEN HONG SHU, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CHEN HONG SHU\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SiriusStudio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2153390/header.jpg?t=1664597122\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}