{
    "AppID": 2066660,
    "Name": "Wits of Gods - Prologue",
    "Release date": "Aug 31, 2022",
    "About the game": "Features Deity: You will play as gods and heroes from different mythologies. Each Deity has 2 skills and 3 attributes (Attack, Armor &amp; Health). Pet: Pets are inspired by mythical creatures and we tried to give them a cute look! Each Pet grants you 1 skill. In a game, you will have 1 Deity and no more than 3 Pets. You are defeated when your deity character dies. Pets can help you build a strategy and create different strategy synergies. Deck Cards. In order to trigger actions of your Deity, you need to play Deck Cards. All Deck Cards are drawn from a Shared Deck, which is generated at the beginning of each game. You do not need to spending time building a deck, and it makes the game fair to all players. Cards 1.Play Action Cards to trigger Deity action. For example, play a “Strike” card to attack. When you’re attacked, you can play a “Defend” card to counter it (even if it’s not your turn). 2.Play Spell Cards to trigger a spell. For example, you can play a “Blaze” card to summon a fireball. Spell Cards can be countered by a card called “Seal”. Most Spell Cards are pretty straightforward, but there are 4 slightly more complex spells inspired by famous myths. They have stronger effects, but they could hurt you if you play them wrong. 3.Play Artifact Cards to equip them on a Deity. Artifact Cards stay in your Artifact Zone after you play them, but you can only hold 2 cards in your Artifact Zone. Artifact Cards are powerful, so you should try to remove enemy artifacts once they’re equipped. Rules There’s so much potential for a variety of gameplay modes based on these cards, and it’s something we want to keep exploring in the future. Most of the early gameplay modes will share a rule — Each player can only launch one attack during one turn. We suggest that you start with the 2V2 mode in the current version. This mode is named after the Pythian Games of Ancient Greece as it’s a fair, fast-paced game. You need to defeat both of your enemies to win. To make things more interesting, we added another rule — When your teammate is defeated, you can inherit their pets, as well as draw more cards and launch more attacks each turn. As there might not be too many players for this version, feel free to invite your friends to start a game! New Gameplay There is also an advanced mode, a 6-player mode called Rebellious Gods. In this mode, there won’t be a clear line between enemies and teammates, and each player has a Role. The Roles and randomly assigned to players at the beginning of each game, and different Roles have different missions. 1 King: The only Role revealed at the beginning. The King has doubled HP, and gains victory by killing all Rebels and the Fallen. 2 Followers: Followers must protect the King from Rebels and the Fallen. Getting killed doesn’t mean being defeated. As long as the King gains final victory, it will be a win for the Followers as well. 3 Rebels: The Rebels need to kill the King and the Fallen to win the game. As long as that is achieved with at least 1 Rebel standing, it will be a win for all 3 Rebels. 1 Fallen: You may have noticed that the 3 starting Roles above account for all 6 players. The Fallen comes after. When there are more than 3 remaining players on the field, any Follower or Rebel could choose to change their Role to the Fallen, which could not be reversed. The Fallen needs to destroy all other players in order to win and claim all rewards. It is an opportunity, but also a risk. To become a Fallen, you need to give up a certain amount of items, which would be rewarded to the winners if you lose. Explore the simple but addictive gameplay, and unlock the Deities and Pets in our game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2066660/header.jpg?t=1662015390",
    "Price": 0.0,
    "Developers": "Cultivation Studio",
    "Publishers": "Playbest",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2066660/ss_b050a9b0033b29666db346c01fd256d69c321f00.1920x1080.jpg?t=1662015390,https://cdn.akamai.steamstatic.com/steam/apps/2066660/ss_46ce849ba9c8ca609fd6859ab3a3318dab29c284.1920x1080.jpg?t=1662015390,https://cdn.akamai.steamstatic.com/steam/apps/2066660/ss_7fc8bcee2e9a640f4946b2919a0077859e175568.1920x1080.jpg?t=1662015390,https://cdn.akamai.steamstatic.com/steam/apps/2066660/ss_c76db8c768dcc3cd1a9fbd0d281e034ef8d881ac.1920x1080.jpg?t=1662015390,https://cdn.akamai.steamstatic.com/steam/apps/2066660/ss_d63b09271a34b8d5055942a42e0f06b528741877.1920x1080.jpg?t=1662015390,https://cdn.akamai.steamstatic.com/steam/apps/2066660/ss_b385079bb54b80dc4761649b1cc176e3ed2b4602.1920x1080.jpg?t=1662015390,https://cdn.akamai.steamstatic.com/steam/apps/2066660/ss_0854976937a12c185ae30ada1b3e6cf9b4f24b5a.1920x1080.jpg?t=1662015390,https://cdn.akamai.steamstatic.com/steam/apps/2066660/ss_32af80f1bdfc6f1735631c62c47f4afe28c0933a.1920x1080.jpg?t=1662015390,https://cdn.akamai.steamstatic.com/steam/apps/2066660/ss_e80b64119352af474120c0ef1fa9b941a8472ae7.1920x1080.jpg?t=1662015390",
    "Slug": "wits-of-gods-prologue",
    "Meta Title": "Wits of Gods - Prologue: Aug 31, 2022, Cultivation Studio...",
    "Meta Description": "Looking for information on Wits of Gods - Prologue? Check out the release date (Aug 31, 2022), developer insights from Cultivation Studio, and a complet...",
    "Alt Text Image": "Official header image for Wits of Gods - Prologue game - Steam 2066660",
    "Canonical URL": "https://gusku.site/game/wits-of-gods-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wits of Gods - Prologue\", \"description\": \"Looking for information on Wits of Gods - Prologue? Check out the release date (Aug 31, 2022), developer insights from Cultivation Studio, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cultivation Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Playbest\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2066660/header.jpg?t=1662015390\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}