{
    "AppID": 2167190,
    "Name": "51:22:51",
    "Release date": "Mar 7, 2023",
    "About the game": "GAMEPLAY 51:22:51 is a multi-reality adventure that blends sci-fi and psychological horror with roguelite elements to form a singular puzzle box mystery. You play as a nameless husband and father confined to an uncanny estate where your primary weapon in the quest to survive long enough to break the game loop is your mind. 51:22:51 is broken up into three sections over five levels with each section containing a different group of principle puzzles that rearrange themselves each time they are launched. As you progress through the game, uncovering its many secrets and solving puzzles to attack, defend, dodge and heal, you unlock the world in ways designed to propel you to the terminal challenge where an interrelated collection of action puzzles await. Everything matters in 51:22:51, from the story detailed in this description to information on and related to the game website to everything you uncover in the game itself. Be thoughtful. Be aware. Be fast. Or fail and begin again. STORY Can you hear me? Can you see me? What’s the last thing you remember? Back. A thunderclap precedes a flash of purple light that fills the void. Stars fall from the sky like snow flurry. The moon hides behind the darkness. Dead black flora. Flatness. Silence. Think harder. Can you see them? Look for them. See them how they were. How you were. Back. A stone dotted creek where she speaks her first word. A sun you warm yourselves under while sharing a meal on a perfectly manicured lawn. A verdant forest surrounding a hilltop estate with its centipedes and hummingbirds and their brothers and sisters and cousins all tucked away in various hideouts and homes. What else do you see? Do you see them? Can you see their faces? Could you ever see their faces? Forward. Can you see them now? How are they? Transformed. Like you, but not like you? Cold. Stiff. Automatic. Can you see their faces? What about their eyes? The truth is in their eyes. Back. You roam the estate alone like an apparition. Yelps and screams intermingle with an unidentifiable blend of bass and ambient commotion that can’t quite find itself. You manipulate your surroundings the only way available to you while lost in a constant state of analysis, trying to better understand, and perhaps reverse engineer, the algorithm that defines you and your world, today and tomorrow. Forward. A door is a door but not a door. A window is a window but not… Can you see them? Yes, you see them now. But do you see their faces? And their eyes? The truth is in their eyes. Who are they? Who are you? What are you? What is happening? Why is it happening? And why does today somehow feel different from any other time ever before? ADDITIONAL INFORMATION This game has no text or dialog and can be played by speakers of any language. This game contains flashing lights that could trigger seizures for individuals with visual sensitivity. The free demo associated with this title represents a highly condensed and accelerated vertical slice of 51:22:51. The introduction and sub-introductions in the demo will replay after every restart. This behavior differs from the main game, where the introduction and sub-introductions play only once after the initial launch of the application.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2167190/header.jpg?t=1678653442",
    "Price": 14.59,
    "Developers": ":truman:",
    "Publishers": "IshiBloom",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2167190/ss_d95f07a81866e47c48b4b804a5d93e3579c732dc.1920x1080.jpg?t=1678653442,https://cdn.akamai.steamstatic.com/steam/apps/2167190/ss_2954df10c2d1289e9b2dc231577a7ae237d7324e.1920x1080.jpg?t=1678653442,https://cdn.akamai.steamstatic.com/steam/apps/2167190/ss_a9603e95994a4121ea995e578d9cff649463952d.1920x1080.jpg?t=1678653442,https://cdn.akamai.steamstatic.com/steam/apps/2167190/ss_9de98990e8b4b0182357dd047956e14cda857b9e.1920x1080.jpg?t=1678653442,https://cdn.akamai.steamstatic.com/steam/apps/2167190/ss_3e0b41fd381479a055e52f9297c94ba53ed1704d.1920x1080.jpg?t=1678653442,https://cdn.akamai.steamstatic.com/steam/apps/2167190/ss_0e344fe55632e0cfd7dcdba03677a300f22175ee.1920x1080.jpg?t=1678653442,https://cdn.akamai.steamstatic.com/steam/apps/2167190/ss_c66ec3ee3dbe2afb315661ef6fbe3d1f372a87f3.1920x1080.jpg?t=1678653442,https://cdn.akamai.steamstatic.com/steam/apps/2167190/ss_f50a47613e57c018ff13399e71463c475ddda87f.1920x1080.jpg?t=1678653442,https://cdn.akamai.steamstatic.com/steam/apps/2167190/ss_d25605d90307877193c32249d3802836250014c7.1920x1080.jpg?t=1678653442,https://cdn.akamai.steamstatic.com/steam/apps/2167190/ss_7108494e25cd0237471d35dd1176876805daf68e.1920x1080.jpg?t=1678653442,https://cdn.akamai.steamstatic.com/steam/apps/2167190/ss_12d357d8649df0113359af0673e43df630452a97.1920x1080.jpg?t=1678653442,https://cdn.akamai.steamstatic.com/steam/apps/2167190/ss_ceaa27d96c0f578b43c4077ecff55827497619f2.1920x1080.jpg?t=1678653442",
    "Slug": "51-22-51",
    "Meta Title": "51:22:51: Mar 7, 2023, :truman: and Full Overview",
    "Meta Description": "Looking for information on 51:22:51? Check out the release date (Mar 7, 2023), developer insights from :truman:, and a complete game summary.",
    "Alt Text Image": "Official header image for 51:22:51 game - Steam 2167190",
    "Canonical URL": "https://gusku.site/game/51-22-51",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"51:22:51\", \"description\": \"Looking for information on 51:22:51? Check out the release date (Mar 7, 2023), developer insights from :truman:, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 7, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \":truman:\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"IshiBloom\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2167190/header.jpg?t=1678653442\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}