{
    "AppID": 2102520,
    "Name": "Apex Point",
    "Release date": "Mar 4, 2023",
    "About the game": "Apex Point is an open world racing simulator that takes place in Japan and is created in Unity 3D. Featuring detailed yet accessible first-person customization and tuning, players can modify their cars to suit any of the multiple available racing types, be it drag racing, drifting, street racing or fully legal track racing. In Apex Point, players can live their automotive dreams, swapping between disciplines at their will, building their career as both a racer and car enthusiast. Important note: Apex Point is an early access which means that it is unfinished and will lack content/might have some bugs that will be fixed ASAP Current Features: Open world gameplay with dynamic environment First person mechanic mode Intelligent traffic system Simulator/Sim-Cade physics system with authentic characteristics for each car Dynamic weather system with day/night cycles, dynamic seasons and celestial events A plethora of performance and cosmetic parts for each car allowing for drift, drag and grip setups Exterior and interior modification Weight and aerodynamic simulation which responds to what is installed on the vehicle Fine tuning for parts including tire pressure, ride height, camber, toe, steering angle, wastegate pressure, ECU and more Dynamic exhaust sounds which respond to the modifications installed Turbo flutter which occurs when running BOV delete setups. Additionally, each BOV has its own sound Echo in tunnels and multi-level car parks Gamepad and wheel + H-Shifter support with force feedback A wide range of settings that allow all players to personalize their driving experience to their tastes, from visual wheel rotation settings to ABS, ESC and TCS Realistic game economy that mirrors real world prices Multiple methods of income generation, from racing to fixing cars and selling them on at a profit or parting unregistered cars out Realistic dyno simulation system that calculates both horsepower and torque at the wheels (WHP &amp; WTQ) based on RPM and engine load after drivetrain power loss Realistic engine swaps and conversions for cars Authentic part wear system that is based on the mileage of the car and other variables Smart tire system that stretches the tire based on rim size so you can have different fitments for different styles Paint booth system where you can paint part by part, including the engine and suspension system + more Photo mode so you can take cool pictures of your awesome builds and make your friends jealous Animated engine parts Animated body parts Working gauges, odometer, stall lights and more Multiple camera settings for each car so you can enjoy driving from your preferred camera angle Road legality check system whereby your car must be road legal if you want to avoid losing money upon selling the car/potential trouble if you are caught driving an illegal vehicle out on the streets. Planned Content: Adding more races with different types Wide variety of cars from different nations Expanding the map to cover the legendary Expressway and nearby cities, with the aim of linking them to tight and technical (Touge) mountain passes Multiplayer Reworking and reorganizing the aftermarket parts shop Improved UI Car registration system to legalize unregistered cars Physical shops available on the map with lower prices than the online parts shop Damage system",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2102520/header.jpg?t=1677997748",
    "Price": 18.99,
    "Developers": "Apex Studio",
    "Publishers": "Apex Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2102520/ss_5bab69ea7676806767f10243c01c6c3e079fd27d.1920x1080.jpg?t=1677997748,https://cdn.akamai.steamstatic.com/steam/apps/2102520/ss_856dea966d18da569ae5c96a2592206dc1008f28.1920x1080.jpg?t=1677997748,https://cdn.akamai.steamstatic.com/steam/apps/2102520/ss_6cff7a89e6f87f655852957958aee2c361e47083.1920x1080.jpg?t=1677997748,https://cdn.akamai.steamstatic.com/steam/apps/2102520/ss_5a02f1456833f96dcb550a0c01e926f609ec741d.1920x1080.jpg?t=1677997748,https://cdn.akamai.steamstatic.com/steam/apps/2102520/ss_5ae0f725787ce91b482fd658a2704897a1cabc33.1920x1080.jpg?t=1677997748,https://cdn.akamai.steamstatic.com/steam/apps/2102520/ss_17d40abecfdc828d0503e93a6fa8b75699aadf5a.1920x1080.jpg?t=1677997748,https://cdn.akamai.steamstatic.com/steam/apps/2102520/ss_73f23b9b5f1ac147fcc78f15f5c2a643ada0dc28.1920x1080.jpg?t=1677997748,https://cdn.akamai.steamstatic.com/steam/apps/2102520/ss_882b140d77d39ec56cc99a1126414773b073c981.1920x1080.jpg?t=1677997748",
    "Slug": "apex-point",
    "Meta Title": "Apex Point: Mar 4, 2023, Apex Studio and Full Overview",
    "Meta Description": "Looking for information on Apex Point? Check out the release date (Mar 4, 2023), developer insights from Apex Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Apex Point game - Steam 2102520",
    "Canonical URL": "https://gusku.site/game/apex-point",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Apex Point\", \"description\": \"Looking for information on Apex Point? Check out the release date (Mar 4, 2023), developer insights from Apex Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 4, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Apex Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Apex Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2102520/header.jpg?t=1677997748\", \"offers\": {\"@type\": \"Offer\", \"price\": 18.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}