{
    "AppID": 2304670,
    "Name": "Ash of Gods: The Way Prologue",
    "Release date": "Mar 9, 2023",
    "About the game": "Try The Prologue for free ahead of the full launch on April 27th! Ash of Gods: The Way tells the story of a young warrior who must infiltrate a neighboring country on the brink of declaring war, and master a card game they use to train their military aristocrats. If he can get close to their commanders, perhaps war can be prevented… one way or another. The Prologue lets you play the full first act of the game with the Berkana Tournament: 6 qualification battles, 5 adjutants to defeat, and one mighty champion. Every qualification and adjutant also has an extra tough optional challenge version of their fight, for additional rewards! Build winning decks of characters, equipment, and spells and use them to tackle a series of carefully crafted challenges. In the full game there are four factions to pick cards from, and you will unlock the ability to buy new cards! You will already learn how to upgrade your favorite cards The Prologue. / As you progress you’ll meet new characters and have opportunities for conversation. The choices you make here can change the course of the future. But success on the field of battle matters too: prepare carefully for key battles with major characters because you’ll only get a few chances before defeat will change the course of the story - though the game continues… The core gameplay is deceptively simple: every turn you can play one warrior, and one support card, then all your units will advance towards the enemy and attack if they can! But the challenge comes in what combinations you choose, how you build your deck, and when you hold back cards for a better opportunity. Your opponents play by the same rules… most of the time. Each battle can have different rules or special features that can be exploited by smart deck building! Warriors range from front line brutes to fragile archers and supporting spellcasters. Equipment cards buff warriors on the battlefield, while spells can aid your fighters or harm the enemy. There’s no one way to play - build a deck that uses tough fighters with armor and healing to grind down your opponents, roll in with high damage archers and poison wielding bandits to put down enemy warriors before they can even react, and much more. With a huge range of cards to choose from, the number of possible combinations is enormous. Explore other games in the Ash of Gods universe! Ash of Gods: The Way is our second game in the Ash of Gods universe — our first game, Ash of Gods: Redemption is a turn-based RPG with tactical combat, CCG elements and a heavily interactive story with major decisions to make which are literally life or death. But even if your leader falls it isn’t the end — the story will continue… / You can join us on Discord for all the latest Ash of Gods updates!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2304670/header.jpg?t=1678448558",
    "Price": 0.0,
    "Developers": "AurumDust",
    "Publishers": "AurumDust,Game Seer Ventures",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2304670/ss_e303c6dc3fd3c7ab71d6af2eaf6920565414fe13.1920x1080.jpg?t=1678448558,https://cdn.akamai.steamstatic.com/steam/apps/2304670/ss_a79474d3de10a9fb07bd7a58439d0b8905658bf3.1920x1080.jpg?t=1678448558,https://cdn.akamai.steamstatic.com/steam/apps/2304670/ss_3d9373cf55c962652c739623986818121cbb3a75.1920x1080.jpg?t=1678448558,https://cdn.akamai.steamstatic.com/steam/apps/2304670/ss_35a23f953bca3ee99dbde9a3303e62dc61f80d38.1920x1080.jpg?t=1678448558,https://cdn.akamai.steamstatic.com/steam/apps/2304670/ss_343231e1ad9b79df94298cf05ab84117376cb2af.1920x1080.jpg?t=1678448558,https://cdn.akamai.steamstatic.com/steam/apps/2304670/ss_9c471f3fa2200e48fcfe6a78a3be9c58c0da51de.1920x1080.jpg?t=1678448558,https://cdn.akamai.steamstatic.com/steam/apps/2304670/ss_3cd2adf53418265f409e40f32cae691c2ab7a167.1920x1080.jpg?t=1678448558,https://cdn.akamai.steamstatic.com/steam/apps/2304670/ss_a41e0225693acfd2037b2bd81d9773e7229c2958.1920x1080.jpg?t=1678448558,https://cdn.akamai.steamstatic.com/steam/apps/2304670/ss_8f4ccbdacbec81e62e71751b89e92233fe2630a3.1920x1080.jpg?t=1678448558,https://cdn.akamai.steamstatic.com/steam/apps/2304670/ss_d3903c038eb7992f479151c2c395fce3225c912e.1920x1080.jpg?t=1678448558",
    "Slug": "ash-of-gods-the-way-prologue",
    "Meta Title": "Ash of Gods: The Way Prologue: Mar 9, 2023, AurumDust and...",
    "Meta Description": "Looking for information on Ash of Gods: The Way Prologue? Check out the release date (Mar 9, 2023), developer insights from AurumDust, and a complete ga...",
    "Alt Text Image": "Official header image for Ash of Gods: The Way Prologue game - Steam 2304670",
    "Canonical URL": "https://gusku.site/game/ash-of-gods-the-way-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ash of Gods: The Way Prologue\", \"description\": \"Looking for information on Ash of Gods: The Way Prologue? Check out the release date (Mar 9, 2023), developer insights from AurumDust, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 9, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"AurumDust\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AurumDust,Game Seer Ventures\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2304670/header.jpg?t=1678448558\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}