{
    "AppID": 2227220,
    "Name": "Ball Animals",
    "Release date": "Feb 23, 2023",
    "About the game": "The Background of Animal Ball Animal Ball is a joyful, local multiplayer, competitive, party game. The story is about small animals. Each player can control a small animal and try to use their belly to collide with the rear of others. Being the last character on the field is your goal. The first player to get three wins will obtain the final victory! Diverse Game Modes The game currently has two game modes, come and choose your favorite! Basic Mode: Play on a fixed map. Endless Mode: Fight on an endless scrolling map. Endangered Animal Characters In the game, you can switch between a variety of animal characters, all of which are endangered species: Golden monkey, crested ibis, panda, monk seal, macaw, elk, Siberian tiger... Various Maps Selection Meteorites, magma, bushes and ice fields Multiple Control Methods This game supports controller and keyboard/mouse. Press and hold to charge, release to attack! ATTENTION! Find the timing of release to achieve super bounce! Behind the Animal Ball... Although the atmosphere of the game seems to be joyful and funny, the story behind it is not peaceful: why do animals of different species fight in the same place and try to stay till the end? If they did have a tolerable environment to live in, who would choose to leave their homeland and fight other creatures in a strange place? What kind of truth is behind these tragedies? Do we humans need to take on certain responsibilities? Protecting the environment and protecting animals is an issue that is so often brought up that it will feel numb when you look at it again. Human beings gradually choose to turn a blind eye because of pain or guilt, and immerse themselves in their own happiness, but all these tragedies are still happening... So we made this free game to bring joy to players, but we also hope that everyone who has experienced this joy can pay attention to and think about the story behind this game, maybe the person who can save them and the world is you. About the Developing Team Animal Ball is developed by a group of friends who love animals. There is a detailed list of all developers in the game. Controllers Required! Ball Animals is a local multiplayer game, you will need one or more controllers to enjoy this game with your friends!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2227220/header.jpg?t=1677165212",
    "Price": 0.0,
    "Developers": "Alfie Luo",
    "Publishers": "Alfie Luo",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2227220/ss_cb1f9491ac8ce34d23bc9bf6c41e972201029658.1920x1080.jpg?t=1677165212,https://cdn.akamai.steamstatic.com/steam/apps/2227220/ss_60340e33cf522628372eb731a783e510a76ecd37.1920x1080.jpg?t=1677165212,https://cdn.akamai.steamstatic.com/steam/apps/2227220/ss_7f7aa81bcf2449f43894db8e48e31558906af9d1.1920x1080.jpg?t=1677165212,https://cdn.akamai.steamstatic.com/steam/apps/2227220/ss_1f8baab8943cffad7ae37b59a3569f7ed68380f2.1920x1080.jpg?t=1677165212,https://cdn.akamai.steamstatic.com/steam/apps/2227220/ss_57a510719376b4765d66005b7fac5fc322eec1d8.1920x1080.jpg?t=1677165212,https://cdn.akamai.steamstatic.com/steam/apps/2227220/ss_393e26ccf5ff9ef4aa36ff5df21f7e1da03f0e4a.1920x1080.jpg?t=1677165212,https://cdn.akamai.steamstatic.com/steam/apps/2227220/ss_0f4a0001007ca578e98211e202d8ec40ce2ea01f.1920x1080.jpg?t=1677165212",
    "Slug": "ball-animals",
    "Meta Title": "Ball Animals: Feb 23, 2023, Alfie Luo and Full Overview",
    "Meta Description": "Looking for information on Ball Animals? Check out the release date (Feb 23, 2023), developer insights from Alfie Luo, and a complete game summary.",
    "Alt Text Image": "Official header image for Ball Animals game - Steam 2227220",
    "Canonical URL": "https://gusku.site/game/ball-animals",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ball Animals\", \"description\": \"Looking for information on Ball Animals? Check out the release date (Feb 23, 2023), developer insights from Alfie Luo, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 23, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alfie Luo\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Alfie Luo\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2227220/header.jpg?t=1677165212\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}