{
    "AppID": 2194560,
    "Name": "BAT HERO",
    "Release date": "Mar 8, 2023",
    "About the game": "In order to reward early customers, by purchasing Bat Hero during the first 3 months after release, you will gain access to the Legendary Edition will all the content shown below unlocked. After those 3 first months the price will be changed and only the base version of the game will be available. BAT HERO - Legendary Edition : This exclusive edition is designed for the people that wish to support me in my future projects, it offers on top of the base game : - Cosmetic pack that contains 4 Sets : Pirate, Steampunk, Viking and an Exclusive Angel Wings &amp; Halo Set. - All future expansions for free : At least 2 new expansions including a new story mode difficulty, new worlds, new game modes (New Challenges, Multiplayer mode), new achievements and new free cosmetics that will be included in those expansions. This Legendary edition will only be available to purchase for the first 3 months after the initial release. Thanks in advance for any early adopters purchasing this pack, working mostly alone on this game, your support is greatly appreciated and will help me in creating all the future projects that i dream i can bring to you someday. ---- Important note : The cosmetic pack sets need to be also unlocked in the game to retain a sense of accomplishment and progression, you will need to clear the first 6 worlds before being able to wear those special cosmetics. Other type of cosmetics that you will earn in the game can be worn when unlocked directly. --------------------------------------------------------------------------------------- BAT HERO is a single player Action Adventure title in which the player embark in an adventure to save Elena who got kidnapped by minions for unknown reasons. Our hero Hadrab with the help of his loyal partner Brutus will travel the world in an attempt to rescue Elena. Using his weapon of choice, a Bat, he will discover mysteries and acquire new powers to help him in his adventures. With a great arcade gameplay, you will enjoy a diverse range of enemies and mechanics sprinkled with RPG elements. With a very new player friendly beginning, the game still has a very high ceiling, especially if you want to complete the game fully and unlock every item. Are you ready for a true challenging adventure ? - Story Mode : Worlds : Travel across 9 Worlds and more than 90 levels, each with its own enemies and mechanics in this extensive story mode, you will also be challenged and if successful you will unlock new powers that will help you for your journey. Powers : By completing Special Stages you will unlock new unique powers that you will need to use according to the enemies you face that will add a diversity of gameplay who will please any fan of more intensive arcade games. Boss Battles : All of those worlds will all have their own unique Boss Battles with each their own mechanics and Super moves. Use your own new found powers to defeat them all. - Challenges : Unlock Challenges to experience the game in whole new game modes like : Sprint : Clear Waves of Extremely Fast projectiles and attain the highest score you can manage ! Marathon : 100 levels of increasing difficulty ending with and infinite point race for the most determined players. Survival : Unlocked after clearing the 100 levels of the Marathon game mode, this deadly and unforgiving mode will punish any mistake you make, how long can you survive ? - Cosmetics Earnable In Game &amp; Achievements : Collect Stars by clearing stages that will unlock cosmetics that you will be able to equip to show your progress with unique style. Also unlock Achievements and get rewarded with even more stars. Certain Cosmetics are only unlocked by specific achievements. Any collector will have his money worth in order to get all those achievements. Swing Away ! Note : The game is not fully controller compatible just yet, a mouse will be required. A full controller support patch will be released very soon.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2194560/header.jpg?t=1678592412",
    "Price": 4.99,
    "Developers": "PHOENIX ENTERTAINMENT",
    "Publishers": "PHOENIX ENTERTAINMENT",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_318b5acff30e2c514ffdac3b8d8080ca23fe625f.1920x1080.jpg?t=1678592412,https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_b68f80cb5bdbc7e7a0f658d0c38f4a4c6516fff9.1920x1080.jpg?t=1678592412,https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_66292d05aba0aec64648c626b686b2f3c83f3b5b.1920x1080.jpg?t=1678592412,https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_ea1793dd1e6846471815476fd7192bba242c50d3.1920x1080.jpg?t=1678592412,https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_c1b703f49061e7dd466968b9df347892740c8cbd.1920x1080.jpg?t=1678592412,https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_6344f9f3baead5686698e2458f3b9e4eee60eadd.1920x1080.jpg?t=1678592412,https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_836eaef1fc7a0313a017852afd2250d59457acb7.1920x1080.jpg?t=1678592412,https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_05adf1a7d35939c83714826ea56f74ee72039479.1920x1080.jpg?t=1678592412,https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_666b2d5aaf8a9b85e164955df8fedf4f903fc700.1920x1080.jpg?t=1678592412,https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_17faaa276301b9e236622fae556417dbc26d52ca.1920x1080.jpg?t=1678592412,https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_4a54c41019ff353a6fa310e2009731749a9906de.1920x1080.jpg?t=1678592412,https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_83deebae3563da05fa978e6566de5871e34bd6eb.1920x1080.jpg?t=1678592412,https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_0cdbc5d0941dbff05b22d44f2b3b11b2fc890cb3.1920x1080.jpg?t=1678592412,https://cdn.akamai.steamstatic.com/steam/apps/2194560/ss_62f317a7822e1dfa367a3fe256e9c75c73ec11f2.1920x1080.jpg?t=1678592412",
    "Slug": "bat-hero",
    "Meta Title": "BAT HERO: Mar 8, 2023, PHOENIX ENTERTAINMENT and Full Ove...",
    "Meta Description": "Looking for information on BAT HERO? Check out the release date (Mar 8, 2023), developer insights from PHOENIX ENTERTAINMENT, and a complete game summary.",
    "Alt Text Image": "Official header image for BAT HERO game - Steam 2194560",
    "Canonical URL": "https://gusku.site/game/bat-hero",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BAT HERO\", \"description\": \"Looking for information on BAT HERO? Check out the release date (Mar 8, 2023), developer insights from PHOENIX ENTERTAINMENT, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 8, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"PHOENIX ENTERTAINMENT\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PHOENIX ENTERTAINMENT\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2194560/header.jpg?t=1678592412\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}