{
    "AppID": 1814230,
    "Name": "Belle Automata: Chronicle I",
    "Release date": "Mar 3, 2023",
    "About the game": "Aureve is an android, content with a life of weaving silk tapestries alongside her master—but when he dies, his family sells her off due to her being a rogue: a self-aware android. Thrown into a new home of refuge for rogues, the newly freed Aureve must find her place amongst them and answer the question once and for all: how does one weave a new identity when the strings to the old have been cut? Inspired by lore from beloved fairytales, Belle Automata is the journey of an android reinventing herself. Join Aureve and the others as they forge their own paths dealing with love, self-acceptance, and grief for a life left behind. CHRONICLE 1 Features A renameable heroine 100,000+ words of professionally written dialogue 7-10 hours of gameplay (depending on reading speed) Full voice acting (English) 2 romanceable characters (Victor &amp; the Nightmare Prince) 6 endings FULL GAME Features 330,000 words of professionally written dialogue 24-30 hours of gameplay (depending on reading speed) Full voice acting (English) 6 romanceable characters 6 routes and 18 endings Characters For Aureve, choices were always a world unknown--but now her life is full of them. Stripped of her purpose and her past, her only choice is to face the future. VA: Zoe Sanders The perfect butler, Victor can do it all. Organizing, cleaning, gardening, yes. But feeling? Now that might be too much to ask... Exclusively a love interest in Belle Automata: Chronicle I. VA: Brandon P. Jenkins. Aureve's reclusive purchaser is known only by his online handle, 'the Nightmare Prince.' What happened to convince this dreamer that he's a nightmare? Exclusively a love interest in Belle Automata: Chronicle I. VA: Noah Belachew. Replaced by an upgrade, Zaffre is a former virtual popstar adjusting to life working behind the scenes. Just... don't call him Zaffrey. Exclusively a love interest in Belle Automata: Chronicle II. VA: Jerron Bacat. The handyman of the house with a mask of cheer, Diego holds a secret. He can fix anything--if only he could fix himself... Exclusively a love interest in Belle Automata: Chronicle II. VA: Tareek Talati. This absent-minded psychologist and mechanic solves everyone's problems but can't figure out his own: why does his strawberry crumble always burn? Exclusively a love interest in Belle Automata: Chronicle III. VA: Daron Oliver. Hard to read and harder to understand, Roman is the charming elder brother of the Nightmare Prince. What guilt hides behind his endearing smile? Exclusively a love interest in Belle Automata: Chronicle III. VA: Maximus Singleton. In the Press Production: Jellyfish Parade Writing: owl. / Shannon Chou Editor: J. Cocco Sprite Art: Keirin CG Art: Sapphire BG Art: Goya Munoz Music: owl. UI: SSAXIFRAGE Audio Engineering: Matt Dear Trailer 1: Foxdrift Studios Trailer 2: owl.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1814230/header.jpg?t=1677885383",
    "Price": 15.99,
    "Developers": "Jellyfish Parade",
    "Publishers": "Jellyfish Parade",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1814230/ss_5ea1e25d7b3c6a226728f046366a453c147a6bf7.1920x1080.jpg?t=1677885383,https://cdn.akamai.steamstatic.com/steam/apps/1814230/ss_a39316dc9c896392dacb9f3a39e44d5971d7200f.1920x1080.jpg?t=1677885383,https://cdn.akamai.steamstatic.com/steam/apps/1814230/ss_c32c6c34ad51e7c2cbde1e5880a3ac5c940c6936.1920x1080.jpg?t=1677885383,https://cdn.akamai.steamstatic.com/steam/apps/1814230/ss_b057821fb2a4a7691d8bd927cea459955b096594.1920x1080.jpg?t=1677885383,https://cdn.akamai.steamstatic.com/steam/apps/1814230/ss_d9d03ee656636d42be5af6a7b80c380f54bde582.1920x1080.jpg?t=1677885383",
    "Slug": "belle-automata-chronicle-i",
    "Meta Title": "Belle Automata: Chronicle I: Mar 3, 2023, Jellyfish Parad...",
    "Meta Description": "Looking for information on Belle Automata: Chronicle I? Check out the release date (Mar 3, 2023), developer insights from Jellyfish Parade, and a comple...",
    "Alt Text Image": "Official header image for Belle Automata: Chronicle I game - Steam 1814230",
    "Canonical URL": "https://gusku.site/game/belle-automata-chronicle-i",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Belle Automata: Chronicle I\", \"description\": \"Looking for information on Belle Automata: Chronicle I? Check out the release date (Mar 3, 2023), developer insights from Jellyfish Parade, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 3, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jellyfish Parade\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jellyfish Parade\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1814230/header.jpg?t=1677885383\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}