{
    "AppID": 1998450,
    "Name": "Black & White",
    "Release date": "Mar 16, 2023",
    "About the game": "'Black &amp; White' is the second game released by ZeroCreation after 'Lay a Beauty to Rest: Dark Peach Blossom Spring'. The game type is visual novel + war chess game. It is like a painting with symmetrical composition, presenting a dystopian world of black and white. 'Black &amp; White' has more than 250,000 words of game text. This is a 'not dystopian' dystopian story. Players will observe the memories of the twelve main characters as they are observing, and continue to communicate with the mysterious girl. - 'The opposite of justice is not evil, but another kind of justice.' This sentence is the most crucial theme of 'Black &amp; White'. In the world of Black &amp; White, you can trust the White Church camp that symbolizes order, fairness, and reason. You can also identify with the Black Cinder Crow camp, which symbolizes freedom, culture, and sensibility. On one side are priests with white hair, possessed by insects, and different personalities. On one side are historical figures who have returned from the dead, died tragically, and are romantic. How would you choose? The art style of 'Black &amp; White' is extremely unique, and all the UI and characters in the game present a contradictory intention. There are nearly 100 characters and more than 400 CG or story maps in the game. We not only carefully sculpted the vertical paintings and CGs of each character with an extremely serious attitude. A branch plot is also set up for each of the twelve characters, and the branch plot will present a large number of story maps in a manner similar to comic interpretation. Compared with our previous work, 'Black &amp; Whitef' has optimized the animation. While ensuring high-quality static art, some art can be animated and lifelike, which can make players feel better. Enter this world! We also put a lot of effort into this game in terms of sound, and strive to achieve the top level of domestic two-dimensional games. Lin Fangzhou, Harper, Xu Luyang and other three composers are mainly responsible for the soundtrack of '', and the sound effects are also produced by special sound engineers, who will control every link. The dubbing director of 'Black &amp; White' is Mr. Mori Zhongren, and the dubbing actors have invited Hanser, Tao Dian, and many dubbing actors from Yuesheng Dubbing Club to cooperate. There are a large number of turn-based war chess level elements in 'Black &amp; White'. We hope that through the war chess level, people can be more immersed in the characters and worldview, understand the plot, and at the same time, we hope to bring more fun to players who like war chess. There are more than 30 level maps in the game, including moving in subways, wilderness, urban areas and other venues. In the first half of the game, players need to constantly unlock the character story, and at the same time clear the less difficult and guiding story levels. In the second half of the game, after players collect 12 characters, players can freely assign characters to form a team, clear 28 challenge levels, and unlock more follow-up plots and game achievements in the challenge levels. The game adopts weak cultivation, in the process of playing the level. Players can unlock new skills of characters by achieving achievements or unlocking plots, and match different gameplay combinations.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1998450/header.jpg?t=1679022128",
    "Price": 13.49,
    "Developers": "零创游戏",
    "Publishers": "方块游戏(CubeGame)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1998450/ss_9fcf3d6dd463f72dd5f8d58ccc243f9f73046dd2.1920x1080.jpg?t=1679022128,https://cdn.akamai.steamstatic.com/steam/apps/1998450/ss_5edafd7d3f3769a502f4c7c871098a702508fa14.1920x1080.jpg?t=1679022128,https://cdn.akamai.steamstatic.com/steam/apps/1998450/ss_c3ab6bbfacf5213ffc8dc285df11aa30b25dc6e3.1920x1080.jpg?t=1679022128,https://cdn.akamai.steamstatic.com/steam/apps/1998450/ss_9e939728513954ca80b3aa16498b72398a7fec5d.1920x1080.jpg?t=1679022128,https://cdn.akamai.steamstatic.com/steam/apps/1998450/ss_ca35e55f6692adf8964b9b8efb9bba48877ab8e8.1920x1080.jpg?t=1679022128,https://cdn.akamai.steamstatic.com/steam/apps/1998450/ss_639cf0e8551d00a61793b4d06c9183cbbb7f8af9.1920x1080.jpg?t=1679022128,https://cdn.akamai.steamstatic.com/steam/apps/1998450/ss_bfb890c616285acdd7f5abb20d08bb66293aa566.1920x1080.jpg?t=1679022128,https://cdn.akamai.steamstatic.com/steam/apps/1998450/ss_d13e256055bcfa29cdd9fef59d45ac8396f2d98c.1920x1080.jpg?t=1679022128,https://cdn.akamai.steamstatic.com/steam/apps/1998450/ss_f9d50bf92b3b23de9a7e72aa8c0295021e6bf3d2.1920x1080.jpg?t=1679022128,https://cdn.akamai.steamstatic.com/steam/apps/1998450/ss_16317db576613fcf5372dca850926783636de8a8.1920x1080.jpg?t=1679022128,https://cdn.akamai.steamstatic.com/steam/apps/1998450/ss_773bf058fb9ef6fda034f603386fc07efbd5ccef.1920x1080.jpg?t=1679022128,https://cdn.akamai.steamstatic.com/steam/apps/1998450/ss_a8f47f73ea284a4f86ec9940f8c825a550a93499.1920x1080.jpg?t=1679022128",
    "Slug": "black-white",
    "Meta Title": "Black & White: Mar 16, 2023, 零创游戏 and Full Overview",
    "Meta Description": "Looking for information on Black & White? Check out the release date (Mar 16, 2023), developer insights from 零创游戏, and a complete game summary.",
    "Alt Text Image": "Official header image for Black & White game - Steam 1998450",
    "Canonical URL": "https://gusku.site/game/black-white",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Black & White\", \"description\": \"Looking for information on Black & White? Check out the release date (Mar 16, 2023), developer insights from \\u96f6\\u521b\\u6e38\\u620f, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 16, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u96f6\\u521b\\u6e38\\u620f\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u65b9\\u5757\\u6e38\\u620f(CubeGame)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1998450/header.jpg?t=1679022128\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}