{
    "AppID": 2299920,
    "Name": "CARTOONITE",
    "Release date": "Mar 3, 2023",
    "About the game": "Are you looking for something new and never seen before? Cartoonite is for you. It offers you a completely innovative sand box racing game experience never seen before. Do the usual games bore you and would you like something fun and competitive at the same time? Cartoonite is for you. It takes you to the discovery of a colorful and fully explorable world in which you can build and collect resources crashing into objects while challenging your friends in multiplayer with a cartoon style. Do you want to have fun in a colorful world and challenge your friends in multiplayer? Cartoonite is for you. Choose your favorite vehicle from an infinite number of possibilities. Decide between offroad, drift with FR legendary cars or choose between all sorts of vehicles. Have fun crashing into objects to collect resources and build your own world. Show your friends what you've built and do stunts with them. Cartoonite is a limitless world full of color and fun. It offers you a box full of tools and toys to enjoy with your friends in multiplayer in this sand box game. Download now to experience the fun: - A FULLY EXPLOREABLE WORLD : you have the freedom to do what you want. You can play with your friends or challenge them to breathtaking races. Exploring a free and colorful cartoon style world. - BUILD AND RESOURCE SYSTEM : A racing game finally joins a survival game. Collect resources by crashing into all sorts of objects and use your resources to build your world. Like any survival game you have to manage your resources well and explore the map to find all sorts of secrets. - ALL SORT OF VEHICLES : You have the option to choose all sorts of vehicles. You can drift with FR legendary cars or get your car dirty with mud from offroad cars. You can choose trucks or supercars. The important thing is that you make them as unique as you are. - MULTIPLAYER SYSTEM : Share your creations with your friends and have fun with them. Race alongside your friends in this survival racing game and become legendary. Download now and enter the world of your dreams through this revolutionary new sand box racing game full of fun and color in a cartoon style.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2299920/header.jpg?t=1677833387",
    "Price": 2.99,
    "Developers": "Tuning Mania",
    "Publishers": "Tuning Mania",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2299920/ss_0ac1e97493ca3283d73e36bb9f00115c6d901a37.1920x1080.jpg?t=1677833387,https://cdn.akamai.steamstatic.com/steam/apps/2299920/ss_645d176075ee0ffc545f23adc5e31ca494811645.1920x1080.jpg?t=1677833387,https://cdn.akamai.steamstatic.com/steam/apps/2299920/ss_23e3a1de35a8378e3e2cbddb8cf74b137e1286eb.1920x1080.jpg?t=1677833387,https://cdn.akamai.steamstatic.com/steam/apps/2299920/ss_33d9b7158ba8ae1019de2bd2277f147ab0032e9a.1920x1080.jpg?t=1677833387,https://cdn.akamai.steamstatic.com/steam/apps/2299920/ss_3740347ab51dbaf23e954b25bc860566d8e0a3f5.1920x1080.jpg?t=1677833387,https://cdn.akamai.steamstatic.com/steam/apps/2299920/ss_0a3f51dc8d1387c051bb0b6239ec3ee2ac2ebd7e.1920x1080.jpg?t=1677833387,https://cdn.akamai.steamstatic.com/steam/apps/2299920/ss_068a09669ef97ddb9c79c2ca29ef7945dccae4d7.1920x1080.jpg?t=1677833387",
    "Slug": "cartoonite",
    "Meta Title": "CARTOONITE: Mar 3, 2023, Tuning Mania and Full Overview",
    "Meta Description": "Looking for information on CARTOONITE? Check out the release date (Mar 3, 2023), developer insights from Tuning Mania, and a complete game summary.",
    "Alt Text Image": "Official header image for CARTOONITE game - Steam 2299920",
    "Canonical URL": "https://gusku.site/game/cartoonite",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CARTOONITE\", \"description\": \"Looking for information on CARTOONITE? Check out the release date (Mar 3, 2023), developer insights from Tuning Mania, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 3, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tuning Mania\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tuning Mania\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2299920/header.jpg?t=1677833387\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}