{
    "AppID": 1677280,
    "Name": "Company of Heroes 3",
    "Release date": "Feb 23, 2023",
    "About the game": "Company of Heroes 3 is out now! Bigger and better than ever, CoH3 is bringing its acclaimed mix of action, tactics, and strategy to millions of fans across the world. Immerse yourself in two epic campaigns, four unique multiplayer &amp; co-op factions, and a breathtaking new theatre spanning from the sweeping deserts of North Africa to the rolling hills of Italy. Join the Fight with new features such as Full Tactical Pause and our Dynamic Campaign Map enable you to take complete control of the battlefield. The Launch Edition is available until March 2nd. Purchase the Launch Edition to receive the following: Devil’s Brigade DLC Pack - A collection of perks inspired by the first commando units of World War 2. US Sniper Cosmetic [Legendary] US Rifleman Cosmetic [Legendary] US Scout Cosmetic [Legendary] M18 Hellcat Cosmetic [Legendary] M8 Greyhound Cosmetic [Legendary] Pioneer Profile &amp; Title [Legendary] The legendary strategy franchise is back! Company of Heroes 3 is the ultimate package of action, tactics and strategy. Take charge in the heat of real-time battle, then command as a General guiding the overall campaign where every decision matters. Overwhelm your opponents with four unique factions and all-new international Battlegroups. Command ground, air and naval forces and build supply lines to crush enemy advances on the new Dynamic Campaign Map - no two playthroughs are ever alike! Play at your own pace across campaign and skirmish modes before diving into blistering multiplayer action. Discover the untold stories of a stunning Mediterranean theatre featuring next-generation destructible environments, all powered by Relic's proprietary Essence Engine. Company of Heroes 3 delivers the next generation of acclaimed tactical gameplay. Beloved combat mechanics collide with authentic new gameplay features, making for the deepest tactical experience to date. ​ Make use of daring flanking moves to expose enemy side armor, experience all new infantry breaching mechanics allowing you to flush enemy units from their garrisons, and master elevation to enhance your line of sight and gain the upper hand. Welcome to the Mediterranean - a breathtaking new theatre filled with untold stories of war. Engage ferocious enemy forces across Italian mountain passes, breathtaking coastal vistas and the sweeping deserts of N Africa. Stunning visuals deliver authentic and highly diverse environments designed to keep you on your toes. ​ Mountainous maps will require uniquely different strategies from coastal towns, with verticality now greatly affecting units’ line of sight (True Sight). Desert plains will call for careful reconnaissance and daring armored maneuvers. On this new frontline, intelligence trumps speed and clever use of local terrain will let you bewilder your opponents and rout them from the field. Experience the biggest single-player campaign in franchise history. The new Dynamic Campaign Map delivers full ‘sandbox-style’ gameplay, allowing players to command the overall war effort and experience an unprecedented level of strategic choice. ​ Establish vital supply lines before deploying rear guard defenses to secure your advance. Launch air and naval strikes to weaken and scatter enemy forces or liberate a nearby town to develop a Partisan spy network. Choose your forces and upgrade your veteran companies to match your playstyle. Meanwhile, the optional Full Tactical Pause feature allows players total control over the pacing of single-player action. Plan your attacks, then effortlessly queue up lethal precision plays that will give you the edge in battle. Company of Heroes 3 promises to delight even the most ardent WW2 enthusiasts thanks to the largest number of launch factions in the series to date. ​ New army customization mechanics will allow you to call in the help of a varied cast of specialist units. Take up the fight with new elite squads including the American-Canadian Special Service Forces, the revered Gurkhas from the Commonwealth and many more. ​ From devastating tank destroyers to clandestine recon vehicles, Company of Heroes 3 features the largest roster in the series to date. The super-light Weasel, the armor-sniping Nashorn, and the Chaffee Light Tank are just a few of the units making their debut. Also, let's not forget revamped classics like the M3 Recovery Vehicle Halftrack, which can now be used to repair and steal abandoned enemy vehicles! Feel the blistering impact of every mortar shell and naval bombardment with Relic's state-of-the-art Essence Engine. In Company of Heroes 3, every location becomes a fully destructible sandbox, opening up limitless tactical gameplay options for you or your enemy to exploit. ​ Bring fortified buildings crashing down onto enemy squads, then witness enhanced destruction mechanics at play as soldiers exploit fresh ruins as dynamic cover. Stunning new rendering and particle FX technology depicts fire, sand and smoke like never before. Brilliant new soldier animations combine with enhanced AI, delivering realistic squad reactions to the battlefield. Optimized for DirectX 12 and multi-core CPUs, Relic's new engine technology will deliver cinematic action to rival any Hollywood blockbuster.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1677280/header.jpg?t=1677265328",
    "Price": 59.99,
    "Developers": "Relic Entertainment",
    "Publishers": "SEGA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_a6d5b12d8ea9d8382db6d2635f275b7f9ec017c5.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_ba1373c26f6b3d39d4c28f430f3d15b218116f5a.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_8e5583ae737cb4a4f979b7cc6b22621708847ee0.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_3b81d7baf466b4a69655e61d5eb7f01c03497592.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_716d3bd39425613f18224d381991c68304e1c3bf.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_b23aa8ee02e2a77dcc793663e9e4c2418c3745bd.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_a93015e06c64b01cc62d75c047ca40d9ba0d4e0b.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_fdb1230845bef7db3f8fe815f0bee569313d6d1f.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_e2cffff4ca7d85cf5d846c6c2dabac62816a0ecb.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_f58a8556ff48d2c1c92be692bd2cae6ba022cafd.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_a6a01238cdc85b286f0fb4c71e5bb19b85380a1a.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_7f1741a60f05aa278331801dbb7299a5af4e8c74.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_d791e306899abadb7275aee310c6940f6207c31d.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_8a539589aed70563c5ec5556124862104e780baf.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_fc84fd9b9d59f074ac625a49b426b4607d25dc95.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_0be9137a49548e57a191864b19c6b856385a57b2.1920x1080.jpg?t=1677265328,https://cdn.akamai.steamstatic.com/steam/apps/1677280/ss_965ae3637c16e256816bf44b7d4a7604405c4e60.1920x1080.jpg?t=1677265328",
    "Slug": "company-of-heroes-3",
    "Meta Title": "Company of Heroes 3: Feb 23, 2023, Relic Entertainment an...",
    "Meta Description": "Looking for information on Company of Heroes 3? Check out the release date (Feb 23, 2023), developer insights from Relic Entertainment, and a complete g...",
    "Alt Text Image": "Official header image for Company of Heroes 3 game - Steam 1677280",
    "Canonical URL": "https://gusku.site/game/company-of-heroes-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Company of Heroes 3\", \"description\": \"Looking for information on Company of Heroes 3? Check out the release date (Feb 23, 2023), developer insights from Relic Entertainment, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 23, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Relic Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SEGA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1677280/header.jpg?t=1677265328\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}