{
    "AppID": 2251420,
    "Name": "Cruise Ship Manager: Prologue - Maiden Voyage",
    "Release date": "Feb 22, 2023",
    "About the game": "Cruise Ship Manager: Prologue - Maiden Voyage is a free version of Cruise Ship Manager. It has limited features but is just as fun! If you want to try the full version, check below: / Fulfill your dreams of watching over a beautiful vessel, a large crew, and all sorts of passengers in Cruise Ship Manager! Take cruises to a next level in this unique management game. Choose how you want your cruise ship to be built, make sure everything runs smoothly, set the prices for the passengers, and become a legend of the high seas! Choosing the layout of the ship is up to you! Decide on the layout, where to place a club for your passengers, and where 5-star restaurants should be. Does a casino strike your fancy or maybe an open pool? And don't forget about rooms for your passengers! Make sure everything is well connected and that you keep enough money for food or fuel. Pick your crew wisely. Their skills will lead to your success or failure. Once you leave the dock, you're stuck with the people you chose so make sure you don't regret hiring an untested rookie over an experienced veteran. Once you settle on the amenities and prepare the necessary equipment, you can finally search for passengers to invite onto your ship. But there's a catch - it's not up to you who buys your tickets. So price your tickets accordingly. You might charge a premium if you do, your passengers will feel entitled to the best service there is and it won't be easy to satisfy them. On the other hand, you could sell the tickets at a low price and improve your budget through other means. For instance, by charging extra for fancy cocktails. As your renown grows, more people will want to experience the thrill of signing up for your cruise. Build your brand and reach a point where people will pay any amount of money, just to say they were on your cruise ship! You have the power to choose the route your cruise ship shall take. Would you rather make some quick cash on a routine, 1-day cruise? Or maybe a long journey through the Mediterranean is what strikes your fancy? You might be paid more for trips to exotic places but beware of the storms. Lives could be at stake if a fire breaks out or engines malfunction. It will be your task to end such a crisis - before it's too late. Features: A cruise ship of your own Resource management Variety of unique passengers with different expectations and behaviors Crew members that have their own needs Route selection Many unique rooms to add to your ship",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2251420/header.jpg?t=1677247297",
    "Price": 0.0,
    "Developers": "Image Power S.A.",
    "Publishers": "Image Power S.A.,PlayWay S.A.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2251420/ss_05d170358e6be7c7354d8ec68243e9a952b69497.1920x1080.jpg?t=1677247297,https://cdn.akamai.steamstatic.com/steam/apps/2251420/ss_16daf83ddb38a9446b2a134d178c4653496d48a1.1920x1080.jpg?t=1677247297,https://cdn.akamai.steamstatic.com/steam/apps/2251420/ss_4796b5f24c2a32e4cf4703dd3029d11b28d91d18.1920x1080.jpg?t=1677247297,https://cdn.akamai.steamstatic.com/steam/apps/2251420/ss_37be925f86f745d7d9953b4e75c158bea0918cca.1920x1080.jpg?t=1677247297,https://cdn.akamai.steamstatic.com/steam/apps/2251420/ss_b683f487b6943c2e0e195c4a195e66cf3d9dd6f8.1920x1080.jpg?t=1677247297,https://cdn.akamai.steamstatic.com/steam/apps/2251420/ss_6344488b5c5286997ac2f70c5777ce28b66db7fa.1920x1080.jpg?t=1677247297",
    "Slug": "cruise-ship-manager-prologue-maiden-voyage",
    "Meta Title": "Cruise Ship Manager: Prologue - Maiden Voyage: Feb 22, 20...",
    "Meta Description": "Looking for information on Cruise Ship Manager: Prologue - Maiden Voyage? Check out the release date (Feb 22, 2023), developer insights from Image Power...",
    "Alt Text Image": "Official header image for Cruise Ship Manager: Prologue - Maiden Voyage game - Steam 2251420",
    "Canonical URL": "https://gusku.site/game/cruise-ship-manager-prologue-maiden-voyage",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cruise Ship Manager: Prologue - Maiden Voyage\", \"description\": \"Looking for information on Cruise Ship Manager: Prologue - Maiden Voyage? Check out the release date (Feb 22, 2023), developer insights from Image Power...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Image Power S.A.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Image Power S.A.,PlayWay S.A.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2251420/header.jpg?t=1677247297\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}