{
    "AppID": 2323710,
    "Name": "Damsels of Vice 2: Project Mesmer",
    "Release date": "Mar 10, 2023",
    "About the game": "The bustling metropolis, Infinity City, is in grave danger once again as rumors of a dangerous, unknown plot called 'Project Mesmer' start to circulate. It's up to two of Infinity City's quirkiest superheroines to step in and save the day... but there's just one problem: their enemies can turn them into giggly, jiggly, sex-crazed BIMBOS! Will they be able to fight against their basest of instincts to conquer evil, or will they give in to become it? Take control of Sister Fister, the super fighting nun, and Copy Kat, the sarcastic cynic, to discover the secret of Project Mesmer before the entire city fall under the control of the evil Dr. Vice! The dysfunctional duo will fight against numerous foes that will attempt to use things like rope or tape to bind them in dangerously kinky states known as Perils, or even seduce them into becoming bimbos! Becoming a bimbo, even in the middle of battle, is not the end! Being a bimbo is tough, but it provides each superheroine with some sexy new and altered skills to get the advantage over their enemies. People and events will change depending on whether or not the superheroines are bimbos, so be careful what form you're in while exploring these unique and dangerous levels! For fans of the first game, both the 'Power Up!' customization systems and the fast paces Action Sequences are back and better than ever! With more options of character customization and enhanced feedback for Action Sequences, battles have never before been so thrilling to play and so satisfying to master. To be or not to be... a BIMBO! - Enemies and traps will transform our heroines into slutty bimbos that affect how they react to certain events/people and how certain events/people react to them. Damsels in Distress! - Heroines will be subjected to kinky Perils like being tied up with rope or having their costume morphed into a rubberized, restrictive, and humiliating version of itself. Struggle and fight to break free and overcome such nefariousness! Power Up! - Beat up enemies to gain Lewda, then use that Lewda to upgrade stats and learn a plethora of powerful new skills! How you wish to level up is completely up to you! Action Sequences like never before!!! - The fast paced, adrenaline pumping Action Sequences are back and completely revamped! With improved feedback and all new attacks, enemies will show no mercy in their attempt to take down our haughty heroines. Speed for everyone. - Too easy? Too hard? You can adjust the difficulty at any time during the game. Enjoy it at your own pace. Controls: Arrow Keys or Left Mouse Click - Move Enter or Z or Left Mouse Click - Confirm Esc or X or Right Mouse Click - Cancel or Menu (Outside of Battle) Shift Key (Hold) - Sprint/Move Fast Tab Key (Hold) - Skip Dialogue Even bimbos know that kink is the ultimate superpower~",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2323710/header.jpg?t=1678480670",
    "Price": 9.99,
    "Developers": "Overlord Empire LLC",
    "Publishers": "Overlord Empire LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2323710/ss_1b4df311b2dd65230f9a1c19969709714b1e3d96.1920x1080.jpg?t=1678480670,https://cdn.akamai.steamstatic.com/steam/apps/2323710/ss_cecf1ba7ecc24ce11d8795b7053152ba8b49d1f4.1920x1080.jpg?t=1678480670,https://cdn.akamai.steamstatic.com/steam/apps/2323710/ss_e79c53a8fcc544a928578d0dba55942631da20cf.1920x1080.jpg?t=1678480670,https://cdn.akamai.steamstatic.com/steam/apps/2323710/ss_8bb628c9b439e6e90e4ff094c62212da36952427.1920x1080.jpg?t=1678480670,https://cdn.akamai.steamstatic.com/steam/apps/2323710/ss_8970c893aa54159c163e8655f67297ef87053389.1920x1080.jpg?t=1678480670,https://cdn.akamai.steamstatic.com/steam/apps/2323710/ss_98135d325e7ed24ab9b5750345443c959dfde672.1920x1080.jpg?t=1678480670,https://cdn.akamai.steamstatic.com/steam/apps/2323710/ss_c2dd30ef20158ff45abc6a3ea77cb0dcefca5589.1920x1080.jpg?t=1678480670,https://cdn.akamai.steamstatic.com/steam/apps/2323710/ss_b9bb7afe08c5576279646350bc920a62995e0369.1920x1080.jpg?t=1678480670,https://cdn.akamai.steamstatic.com/steam/apps/2323710/ss_09de4ee535ff56049ab7e34843c823cb69d8cef5.1920x1080.jpg?t=1678480670,https://cdn.akamai.steamstatic.com/steam/apps/2323710/ss_e221ec2f3737a2ad197327f7d45ec6894957bcd8.1920x1080.jpg?t=1678480670",
    "Slug": "damsels-of-vice-2-project-mesmer",
    "Meta Title": "Damsels of Vice 2: Project Mesmer: Mar 10, 2023, Overlord...",
    "Meta Description": "Looking for information on Damsels of Vice 2: Project Mesmer? Check out the release date (Mar 10, 2023), developer insights from Overlord Empire LLC, an...",
    "Alt Text Image": "Official header image for Damsels of Vice 2: Project Mesmer game - Steam 2323710",
    "Canonical URL": "https://gusku.site/game/damsels-of-vice-2-project-mesmer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Damsels of Vice 2: Project Mesmer\", \"description\": \"Looking for information on Damsels of Vice 2: Project Mesmer? Check out the release date (Mar 10, 2023), developer insights from Overlord Empire LLC, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 10, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Overlord Empire LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Overlord Empire LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2323710/header.jpg?t=1678480670\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}