{
    "AppID": 2252900,
    "Name": "Defending Earth",
    "Release date": "Feb 21, 2023",
    "About the game": "Are you ready to defend Earth from the ultimate asteroid storm? Introducing Defending Earth, the early release of the most thrilling and strategic asteroid-destroying game on the market. As the storm approaches, you'll have to use all your skills and resources to protect the planet from the asteroids using a variety of weapons and tools. With a countdown timer counting down to the storm's arrival, every moment counts. Defending Earth is designed to test your strategy and technique, pushing you to experiment with different weapons and tools to achieve a high score and defense rating. With over a dozen and counting different types of satellites, from the Dual Plasma satellite that automatically shoots plasma shots at asteroids with AI or in manual control, to the Mobile Lab that automatically collects Research Points, to even the Gravity Modifier satellite, which allows you to slow down incoming asteroids, giving you extra time to destroy and prepare, giving you many options on using to defend Earth. In addition to satellites, the game features a Shield that protects the Earth when enabled, but has a limited supply of energy. Use the Upgrade Panel to improve it, expanding its storage and recharging abilities. The Shield and Upgrade Panel will be essential in reaching a high score. We've also included three unique perspectives: 3D View, 2D View, and Fullscreen View. Each offers a different style of play, from the classic bird's-eye view in 2D that allows you to see the planets and asteroids from a distance and prioritize which asteroid to destroy, to the immersive first- or third-person perspective in Fullscreen View where you can take manual control of your satellites, missiles, and ships. In 3D View, you have access to the upgrade and radar systems. Don't miss out on the ultimate asteroid-destroying experience. Download Defending Earth now and visit the game's official BroSimple website for tutorials, updates, and to report any bugs or issues. Help us make the game even more enjoyable for yourself and others. Thank you for your support, let's save Earth together.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2252900/header.jpg?t=1677011229",
    "Price": 4.24,
    "Developers": "Alex Valdes",
    "Publishers": "BROSIMPLE LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2252900/ss_ce279a14c26199368c27b7e2e085ddae41c4d135.1920x1080.jpg?t=1677011229,https://cdn.akamai.steamstatic.com/steam/apps/2252900/ss_573c1be05f270949d8cbcae32a79af0a52cd2ea1.1920x1080.jpg?t=1677011229,https://cdn.akamai.steamstatic.com/steam/apps/2252900/ss_7080485fcce12ef880adffd5e78f4ab2c890b942.1920x1080.jpg?t=1677011229,https://cdn.akamai.steamstatic.com/steam/apps/2252900/ss_f43947f1393fc549f292e2af126a49cfb73bbebb.1920x1080.jpg?t=1677011229,https://cdn.akamai.steamstatic.com/steam/apps/2252900/ss_6edc5bd03f1228cb49127630f628d3230e79859e.1920x1080.jpg?t=1677011229,https://cdn.akamai.steamstatic.com/steam/apps/2252900/ss_3fa2a10b86916a56119ed6a55eb042b754e1701f.1920x1080.jpg?t=1677011229",
    "Slug": "defending-earth",
    "Meta Title": "Defending Earth: Feb 21, 2023, Alex Valdes and Full Overview",
    "Meta Description": "Looking for information on Defending Earth? Check out the release date (Feb 21, 2023), developer insights from Alex Valdes, and a complete game summary.",
    "Alt Text Image": "Official header image for Defending Earth game - Steam 2252900",
    "Canonical URL": "https://gusku.site/game/defending-earth",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Defending Earth\", \"description\": \"Looking for information on Defending Earth? Check out the release date (Feb 21, 2023), developer insights from Alex Valdes, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 21, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alex Valdes\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BROSIMPLE LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2252900/header.jpg?t=1677011229\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.24, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}