{
    "AppID": 1977220,
    "Name": "DELETE AFTER READING",
    "Release date": "Mar 14, 2023",
    "About the game": "DELETE AFTER READING. THE CURSE OF PENGUIN ISLAND. From the creators of Unmemory comes Delete After Reading , a text-based puzzle narrative adventure full of humor, adventure, and mischief. Enjoy a unique mix of literature, puzzles and escape room mechanics with a ragtag bunch of adorable cartoon characters in the adventure of their afterlives – saving the only copy of one of the most influential games ever made from the machinations of Destiny itself, who doesn’t want anyone meddling with reality! On the worst day of your life, you find a strange device with a file named Delete After Reading . It’s a classified document. Nina, Cinco, and Tomate, a clandestine group of kids, want you to join them on a secret mission to fix Destiny’s latest injustice: the despised billionaire Martin Skrilhlex has stolen the only existing copy of the highly coveted video game The Curse of Penguin Island so that only he can play it. Only by joining forces, this group of friends will learn how to shape their own destiny while knowing there are consequences for their actions. There is one small detail, though. Nina is a ghost girl. Cinco is a goblin rapper. Tomate is a rabbit who claims to be the reincarnation of a certain blues brother. And with this peculiar band, you have to find a way to beat one of the wealthiest men in the world and the personification of Destiny itself. Just what you needed to make your day. You’ll have to sneak into the magnate’s mansion and steal back the video game, so kids around the world can enjoy it. Easy as pie, right? If only Destiny didn’t have the power to know everything you’re doing and planning… For this mission to succeed, Destiny can’t discover that you are changing his plans – so never, ever, ever forget to delete after reading! KEY FEATURES THE TEXT IS THE GAMEPLAY: Read a thrilling and hilarious story not just to discover what happens next, but to find the hints and clues you need to solve the puzzles and riddles to move forward. The story can’t advance without you – the kids need you! AN ADVENTURE FUN STORY: A ghost girl, a goblin rapper and some Blues Brother reincarnated as a rabbit. Those are the ones who have to help you recover the most awaited video game from Skrilhlex's mansion. Good luck with that, mate. EYE CANDY VISUALS: Adorable and roguish cartoons. Crazy and weird devices. A stylish, modern layout that invites you to read and feeds your imagination. SOUNDS FROM THE OTHER SIDE: Real voices, effects from another galaxy, and disco music. All together in the same cocktail. Better than piña colada! AN ENGAGING STORYTELLING FORMAT: Delete After Reading entwines puzzle and narrative, audio and game mechanics, to make you feel like the protagonist of the story.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1977220/header.jpg?t=1678781198",
    "Price": 4.99,
    "Developers": "PATRONES & ESCONDITES,TLR Games",
    "Publishers": "PATRONES & ESCONDITES",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1977220/ss_35f518c76cbf3a6b5e00a5bce97841fe9bb43949.1920x1080.jpg?t=1678781198,https://cdn.akamai.steamstatic.com/steam/apps/1977220/ss_2dccef2721752d5a172febc395481c390e26a89d.1920x1080.jpg?t=1678781198,https://cdn.akamai.steamstatic.com/steam/apps/1977220/ss_73db5239560cb96cf5b4fc5e335b0624aa3f6910.1920x1080.jpg?t=1678781198,https://cdn.akamai.steamstatic.com/steam/apps/1977220/ss_b590724ed80049850c903ec81142609f9013a3b8.1920x1080.jpg?t=1678781198,https://cdn.akamai.steamstatic.com/steam/apps/1977220/ss_79686c91efae961a0744535e60b7546b7f722bd9.1920x1080.jpg?t=1678781198,https://cdn.akamai.steamstatic.com/steam/apps/1977220/ss_0c9080a5edc661de6dfaa89afc48a5edb5a8c7e8.1920x1080.jpg?t=1678781198",
    "Slug": "delete-after-reading",
    "Meta Title": "DELETE AFTER READING: Mar 14, 2023, PATRONES & ESCONDITES...",
    "Meta Description": "Looking for information on DELETE AFTER READING? Check out the release date (Mar 14, 2023), developer insights from PATRONES & ESCONDITES,TLR Games, and...",
    "Alt Text Image": "Official header image for DELETE AFTER READING game - Steam 1977220",
    "Canonical URL": "https://gusku.site/game/delete-after-reading",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DELETE AFTER READING\", \"description\": \"Looking for information on DELETE AFTER READING? Check out the release date (Mar 14, 2023), developer insights from PATRONES & ESCONDITES,TLR Games, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 14, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"PATRONES & ESCONDITES,TLR Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PATRONES & ESCONDITES\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1977220/header.jpg?t=1678781198\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}