{
    "AppID": 1825210,
    "Name": "DESTRUCTURE: Among Debris",
    "Release date": "Feb 27, 2023",
    "About the game": "/ In DESTRUCTURE: Among Debris you use the power of (very totally realistic) physics to destroy the world around you. Following a devastating, apocalyptic event, the world is filled with garbage, abandoned structures and angry robot turrets and it is your mission to clean it from this dusty mess. The gameplay revolves around the player-controlled Round Thingy of Destruction that you have a full 360-degree control over, making smashing the iron ball so much more satisfying. But you must remember not to lose your ball. Behind you there’s a metal grinder in each level ready to consume all of the balls (stop giggling, Gregg) you are too slow to repel. But DESTRUCTURE is no ordinary arkanoid-like game, because the levels fight back! Destroy enough structures and you will alert some bloodthirsty turrets, and trust us, they are definitely not happy to see you. Using all your finesse, you must dodge their bullets, missiles, lasers and other looming dangers and the more you destroy, the more you have to dodge. Bullet hell aficionados rejoice! If you’re lucky you might stumble upon mighty weapons and power ups to use in the spur of the moment. It’s like finding a nickel on the side-walk, but the nickel is a rocket launcher or a laser gun and the side-walk is the debris of a structure that once had some semblance of purpose. Progressing through the world of DESTRUCTURE is a tough and unforgiving job. For one, there are evil robots trying to murder you and the environments are filled with various hazards. That’s why your benefactors have provided you with a wide array of unlockable tools, upgrades and perks that should provide enough leverage to give you a fighting chance. They’re not free though, so remember to collect Blue Stuff (whatever it is) that your benefactors will use for very important deeds no one really knows or indeed cares about. You’d be best suited collecting as much as you possibly can. That is, if you don’t get shot while you’re at it! With this Blue Stuff you can purchase exciting new toys like “Zeus’ Blessing”, “Suicidal Turrets“ or just some good old “Napalm Rain“ to ascend the ranks of ordinary, trash-fighting Round Thingys of Destruction! and become the ultimate destroyer of what remains of the dusty, barren worlds of DESTRUCTURE .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1825210/header.jpg?t=1678019488",
    "Price": 7.99,
    "Developers": "Team Instant Defeat",
    "Publishers": "RockGame S.A.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1825210/ss_e44ecd2ba5f90465856b1736e5f50384663c0cc2.1920x1080.jpg?t=1678019488,https://cdn.akamai.steamstatic.com/steam/apps/1825210/ss_f031c6c6494f45da61d22246a8c90291942aadeb.1920x1080.jpg?t=1678019488,https://cdn.akamai.steamstatic.com/steam/apps/1825210/ss_dc1d61a1a59207b11490a8b4eeff59e45828c94b.1920x1080.jpg?t=1678019488,https://cdn.akamai.steamstatic.com/steam/apps/1825210/ss_7ce844ae71358af57c276751bdb0db3117fd37a5.1920x1080.jpg?t=1678019488,https://cdn.akamai.steamstatic.com/steam/apps/1825210/ss_ef9f0ac712878ff86f08ff6babacd3f695a56354.1920x1080.jpg?t=1678019488,https://cdn.akamai.steamstatic.com/steam/apps/1825210/ss_7d7576c6ad8512942e5b88d3d7c46d8b519a6ee3.1920x1080.jpg?t=1678019488",
    "Slug": "destructure-among-debris",
    "Meta Title": "DESTRUCTURE: Among Debris: Feb 27, 2023, Team Instant Def...",
    "Meta Description": "Looking for information on DESTRUCTURE: Among Debris? Check out the release date (Feb 27, 2023), developer insights from Team Instant Defeat, and a comp...",
    "Alt Text Image": "Official header image for DESTRUCTURE: Among Debris game - Steam 1825210",
    "Canonical URL": "https://gusku.site/game/destructure-among-debris",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DESTRUCTURE: Among Debris\", \"description\": \"Looking for information on DESTRUCTURE: Among Debris? Check out the release date (Feb 27, 2023), developer insights from Team Instant Defeat, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 27, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Team Instant Defeat\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"RockGame S.A.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1825210/header.jpg?t=1678019488\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}