{
    "AppID": 1668290,
    "Name": "Dungeons of Aether",
    "Release date": "Feb 28, 2023",
    "About the game": "Dungeons of Aether is a turn-based dungeon crawler designed by Nikita ‘ampersandbear’ Belorusov from the Aether Studios team. Rivals of Aether is known for its intense competition and twitch skills, while Dungeons of Aether allows you to take things at your own pace - but it’s still just as challenging! Every choice you make can lead you deeper into the dungeons or to an early demise. Will you carry out a treasure chest, or be carried out in a pine box? The combat in Dungeons of Aether uses a dice draft system that ensures each battle is unique while challenging the player to adapt the pool of dice each turn. Use fortune to your favor to defeat your foes, collect treasures and shift the odds in your favor... Dungeons of Aether introduces four exciting new heroes to the world of Aether, each with their own unique skills and memorable personalities. Fleet is the self-proclaimed protector of her hometown of Julesvale, although she’s seen as a clumsy menace more than a hero. As the jack of all trades, Fleet is a great character for learning the combat system. Hamir is a former Wall Runner from the mighty Rock Wall. He has made his way to Julesvale in exile after losing his trusted partner. Hamir now finds himself looking for a purpose and the courage to carry on.. Hamir is strong and sturdy, weathering blows until the time is right to crush his foes. Slade is a pirate from the far-off Polekai Islands. He has made his way to Julesvale hunting a mysterious rare mineral unique to Julesvale. Rumor has it the mineral is key to saving his homeland. Slade’s style and swagger allow him to dodge attacks entirely if his speed is high enough. Artemis is a renowned general in the Fire Mora who often fought alongside Zetterburn. She was sent to Julesvale by Emperor Loxodont on a secret mission. Artemis can heal her wounds in battle, showing off her innate regeneration abilities. The world of Aether is expanding and Dungeons of Aether adds a new, fascinating facet to the ever-expanding lore! Travel to the steam-punk town of Julesvale and brave the sprawling caverns underneath it. In Story Mode, you’ll play a roguelite adventure that has you starting each dive from town. There you can interact with towns folk and spend your hard-earned gold to gear up for your next run. Each of the dungeons you’ll dive into have new challenges to face and rewards to collect. As you dive into Julesvale Mines, the Lava Caves, the Underground Oasis and the Mineral Deposits, you’ll be able to collect Journal Entries that reveal even more about Julesvale and its legendary past. For those of you looking for true roguelike difficulty, the Challenge Dungeons are where you will want to test your skills. Each Challenge Dungeon is randomly generated with unique events and fights. Your mission is to go through all of the biomes in the game in a single run. Story Mode gives you a chance to casually prepare, interact with NPCs, and savor the exploration of the world, In Challenge Dungeons it’s all up to you!. The Challenge Dungeons also feature a leaderboard based on how much gold you have at the end of the run. Will you spend your gold to make sure you can get through or are you greedy?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1668290/header.jpg?t=1677652479",
    "Price": 13.49,
    "Developers": "Dan Fornace,ampersandbear",
    "Publishers": "Dan Fornace",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1668290/ss_5a7653c72f4d75db29c7e862a849909bf0935bff.1920x1080.jpg?t=1677652479,https://cdn.akamai.steamstatic.com/steam/apps/1668290/ss_560041050d3aece3f4a4a8ce5989f79eb4d7b1ff.1920x1080.jpg?t=1677652479,https://cdn.akamai.steamstatic.com/steam/apps/1668290/ss_0bcd9954919eae57f1513a7f41de1e6d25d79041.1920x1080.jpg?t=1677652479,https://cdn.akamai.steamstatic.com/steam/apps/1668290/ss_7161a30e3fd2a8f92db47e29f0e0830ffd2000f5.1920x1080.jpg?t=1677652479,https://cdn.akamai.steamstatic.com/steam/apps/1668290/ss_b2ed697d27265d000fe443beaf26c9547373a145.1920x1080.jpg?t=1677652479,https://cdn.akamai.steamstatic.com/steam/apps/1668290/ss_24ccd4719d742844d01853502514f5d46db21d57.1920x1080.jpg?t=1677652479",
    "Slug": "dungeons-of-aether",
    "Meta Title": "Dungeons of Aether: Feb 28, 2023, Dan Fornace,ampersandbe...",
    "Meta Description": "Looking for information on Dungeons of Aether? Check out the release date (Feb 28, 2023), developer insights from Dan Fornace,ampersandbear, and a compl...",
    "Alt Text Image": "Official header image for Dungeons of Aether game - Steam 1668290",
    "Canonical URL": "https://gusku.site/game/dungeons-of-aether",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dungeons of Aether\", \"description\": \"Looking for information on Dungeons of Aether? Check out the release date (Feb 28, 2023), developer insights from Dan Fornace,ampersandbear, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 28, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dan Fornace,ampersandbear\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dan Fornace\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1668290/header.jpg?t=1677652479\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}