{
    "AppID": 923140,
    "Name": "Elven Magic: The Witch, The Elf & The Fairy",
    "Release date": "Aug 30, 2018",
    "About the game": "This story is to be implemented in time and it is based on a book called Elven Magic by Daniel Chay. 'A Game about Elves and Witches. Elven Voices delves deeper into Fae the elven witch's apprentice and there endless struggle to recover their lost spell book from Earthen Lands without drawing any attention to themselves because this is strictly forbidden by the Elven Elders. The story continues into another world and there are many twists and turns for Fae the Elven Girl and the Witch named Ellen that would have Fae be her apprentice to uncover. The imperial guard of the nearby capital city may prove difficult to avoid. It details the rise of a Wyvern Wraith and the plight of a Witch Wraith.' This Game is an RPG Game and its game play is like WOW in that the game has levels of gear and it also has great graphical terrains of desert scenes and beach scenes. This game is still in development. The Objectives still need to be implemented. This has an advanced inventory and it saves progress this is the completed inventory. The 2nd partial inventory will be adapted over time as the code needs to be coded for each individual object and this takes time. Some are coded in this edition and some are not yet implemented. Inventory &amp; Quests keys: J,K,I. Horse Mount Keys: F. Camera: F1,F2,F3. Keys may differ from Mac to Windows Versions. Q. Dragon Fly/Take off. Use 'E' To interact with NPC's. The RPG Game(Elven Magic 2) is coded with Effects working on most builds and allows for the attack, these effects will have relied on without the use of weapons at this stage as melee combat will be introduced later without the use of guns specifically as a weapon. As the game's storyline will not involve guns for the attack of any humanoids, only creatures will be attacked using guns which will not be implemented like a weapon at all, only in the inventory, although it will take time to lock them. Elven Magic FPS is available for prepurchase and at this stage, you can attack and the Inventory works as well as a character sheet and crafting functioning is coming soon as recipes need to be added. You can also ride a horse on the beach in one scene. Things like purchasing of equipment will be added in time, if there is any please don't purchase anything in-game due to weather saving functionality works you can buy the game still as it is in beta not everything is working. The Mac Version of the game Elven Magic 2(MAC ONLY) is now like age of empires and has towers which can attack an army at the castle screen FUNC+F1,F2,F3 sorry guys this does not build on a windows system. What i intended to do is expand the towers and attack path across the whole world in time. To get into this game you will need the graphics settings to low at this stage. This Main Game (ElvenMagicPro) is not Required to load and play Elven Magic 2 and Elven Magic SE which are working well. You can often press Function + F1 or F2 or F3 to change the view for example if you press that in the ElvenMagicPro Game it will switch to another persons head from there you can see the holograms and light shining down., in Elven Magic SE you can now look over the sand dunes and see a train this is Simulation assets working as intended. Please Purchase as a bundle as this is the cheapest way at this stage. Prices may change without prior notice. This game can be implemented with over 100GB of content at this stage each build takes only between 2.5GB(MAC) and 7GB(WINDOWS &amp; MAC) each.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/923140/header.jpg?t=1653853640",
    "Price": 0.79,
    "Developers": "Daniel Chay",
    "Publishers": "Daniel Chay",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/923140/ss_38b477bfbd129f235cb30f4de5cec76db1d6ed26.1920x1080.jpg?t=1653853640,https://cdn.akamai.steamstatic.com/steam/apps/923140/ss_af43d20c64e128726b226be3020ae53a1f4d1b99.1920x1080.jpg?t=1653853640,https://cdn.akamai.steamstatic.com/steam/apps/923140/ss_76849816428eabfee6517bb19d85cba744445e29.1920x1080.jpg?t=1653853640,https://cdn.akamai.steamstatic.com/steam/apps/923140/ss_b0403c7ef2766130a75abcc94648267602626c34.1920x1080.jpg?t=1653853640,https://cdn.akamai.steamstatic.com/steam/apps/923140/ss_114b4815439af4e4472d82e399fde3a67e0b0fd8.1920x1080.jpg?t=1653853640",
    "Slug": "elven-magic-the-witch-the-elf-the-fairy",
    "Meta Title": "Elven Magic: The Witch, The Elf & The Fairy: Aug 30, 2018...",
    "Meta Description": "Looking for information on Elven Magic: The Witch, The Elf & The Fairy? Check out the release date (Aug 30, 2018), developer insights from Daniel Chay, ...",
    "Alt Text Image": "Official header image for Elven Magic: The Witch, The Elf & The Fairy game - Steam 923140",
    "Canonical URL": "https://gusku.site/game/elven-magic-the-witch-the-elf-the-fairy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Elven Magic: The Witch, The Elf & The Fairy\", \"description\": \"Looking for information on Elven Magic: The Witch, The Elf & The Fairy? Check out the release date (Aug 30, 2018), developer insights from Daniel Chay, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 30, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Daniel Chay\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Daniel Chay\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/923140/header.jpg?t=1653853640\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}