{
    "AppID": 2290890,
    "Name": "Endless Dark",
    "Release date": "Feb 22, 2023",
    "About the game": "A refreshing twist on roguelite and storytelling, Endless Dark is a psychological horror game about the pressures of monotony and the purpose of existence. You, the Custodian, are a sentient machine onboard a sleeper colony ship, charged with keeping it intact. No combat, enemies, or NPCs await you - only a myriad of system failures and the decay of your own sanity as you whittle away the decades in isolation. Hundreds of story events and a deep narrative keep each iteration of you intrigued. Customize your own chassis, repair the ship, and keep your passengers alive long enough to win... something. Can you uncover the intent behind your own creation before you slip into robo-dementia? STORY MODE The ship is shadowy in more ways than one. Ancient agreements and long-forgotten understandings conspire against you to keep you in your place. Doing your work. For however long the long-absent conspirators wanted. Explore a deep narrative that evolves over multiple playthroughs, and choose how you deal with each new revelation. Not all truths will set you free, and some things are better left unsaid. ENDLESS MODE For a more mechanical challenge, try the optional endless mode. In this mode, the only objective is to propel the ship as far as you can before you inevitably lose your passengers, your mind, or both. Contend with the confusing oddities of the ship and its myriad catastrophes with a specially written CRISIS CYCLE. Three impending crises, promising grievous and irreparable damage, will be shown to you. Use your intuition, born of your intimate awareness of your vessel, to discern which two crises are lies, and which one is the true threat! Choose wisely - the Crisis will not be gentle if you fail to prepare for it. PLAYABLE... Endless Dark has been designed from the start to be eminently playable for Custodians with their own histories. The game has a specially chosen color palate to be visible for numerous kinds of colorblindness, even full monochromacy. Large, clear text makes messages readable at a glance. All Custodians need only bring their willingness to do, explore, and grow. Busy Custodians also need not fear; distinct, bite-sized turns with effortless autosave allows for drop-in, drop-out play. Control things your way; the game is fully playable with a gamepad only, keyboard only, or mouse and keyboard. ...AND REPLAYABLE With over 50,000 words (and growing!) of random events, spread over dozens of dilemmas, and a finely tuned Director that applies just the right amount of pressure, Endless Dark is designed to never present the same situation twice. Fight and overcome, or struggle and succumb, the next time will always be different.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2290890/header.jpg?t=1677099408",
    "Price": 7.99,
    "Developers": "Little Light Studios, LLC",
    "Publishers": "Little Light Studios, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2290890/ss_66bde547d07d78bbc01b11324feed908c7998896.1920x1080.jpg?t=1677099408,https://cdn.akamai.steamstatic.com/steam/apps/2290890/ss_f814c827a43655c7ef87cb9a3cf2c39ff431c4e0.1920x1080.jpg?t=1677099408,https://cdn.akamai.steamstatic.com/steam/apps/2290890/ss_8e8f1f0dcadf2899058756780595f36d6f8a562c.1920x1080.jpg?t=1677099408,https://cdn.akamai.steamstatic.com/steam/apps/2290890/ss_57a8494470af3cb70732ec1c490540cae3966124.1920x1080.jpg?t=1677099408,https://cdn.akamai.steamstatic.com/steam/apps/2290890/ss_c8de8a102fe604ae2d397b7321eb27c1ad65f9ce.1920x1080.jpg?t=1677099408",
    "Slug": "endless-dark",
    "Meta Title": "Endless Dark: Feb 22, 2023, Little Light Studios, LLC and...",
    "Meta Description": "Looking for information on Endless Dark? Check out the release date (Feb 22, 2023), developer insights from Little Light Studios, LLC, and a complete ga...",
    "Alt Text Image": "Official header image for Endless Dark game - Steam 2290890",
    "Canonical URL": "https://gusku.site/game/endless-dark",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Endless Dark\", \"description\": \"Looking for information on Endless Dark? Check out the release date (Feb 22, 2023), developer insights from Little Light Studios, LLC, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Little Light Studios, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Little Light Studios, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2290890/header.jpg?t=1677099408\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}