{
    "AppID": 2256900,
    "Name": "Frack the World",
    "Release date": "Mar 1, 2023",
    "About the game": "Play Through 10 Unique Scenarios and Over 20 Quick Play Stages Choose From 4 Different Companies , Each with Their Own Strengths Go Bird Watching in your Free Time and Spot Them All Frack the World is a resource management game about successfully running a hydrofracking company while also dealing with the state of the environment. There are several simultaneously moving systems that you, as CEO , need to pay attention to in order to succeed in your capitalist dreams. The oil you are generating, the money you are making, the damage to the environment, and the public opinion of you company - are four of the major drivers of your company. If you choose to ignore one, the entire thing might crumble. In Frack the World you manage a hydrofracking company. This concept boils down to the theme and gameplay principles but isn't intended to be a 1:1 fracking simulation. It's a lite-land management game that can be difficult but easy to just relax with - with matches typically only lasting an average of ten minutes each. Pick it up, put it down. The gameplay for Frack the World exists on two fronts, the Surface and the Underground. In the Underground , you are presented with a strategic puzzle-like game. Hydrofracking is a kind of horizontal well drilling, and as such only your horizontal pipes can draw oil from frack veins. Your pipes will extend deeper and deeper into the Earth, but all pipes cost monthly maintenance fees. The deeper you dig, the better chance at a lucrative frack vein though. The hurdles along the way include the fact that your pipes cannot overlap, rock formations that need to be excavated through extra means, water tables that risk massive environmental damage if broken, and more. On the Surface , your companies facilities are built and spatial awareness must be considered. Some facilities may only take up one grid space, but others can take up to four. You may opt to not use certain facilities at all in certain matches in favor of others. Hurdles on the surface may include protests, facilities constructed or abandoned by other companies, land for sale, and air pollution - among other challenges. When things are running smoothly, you get to chill for a minute and distract yourself with some casual CEO things. Try finding and viewing all of the high-fidelity birds in the sky and go read all about these majestic birds thanks to facts found in a bird book from a thrift store and sometimes Wikipedia! Lose yourself in Bird Mode ! All the joys of bird watching with none of the fracking! Hire staff and have them rattle off tons of info to you in the news scroll. Or keep your eye out for great news stories about how wonderful your business is and how fracking is actually super beneficial to the planet. While every game may eventually end with environmental destruction, at least you can make TONS of money in the meantime. Because, honestly, every match of real life will end with planetary destruction too. But at least in this game you are the CEO !",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2256900/header.jpg?t=1677858796",
    "Price": 3.19,
    "Developers": "Beef Cat",
    "Publishers": "Beef Cat",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2256900/ss_086aec6c3784ca65ab1d76560484f7acc2441340.1920x1080.jpg?t=1677858796,https://cdn.akamai.steamstatic.com/steam/apps/2256900/ss_21906960b59c26ed4615ba37250a586204dd8504.1920x1080.jpg?t=1677858796,https://cdn.akamai.steamstatic.com/steam/apps/2256900/ss_07383d6947343a02797132f2febf01dc16c11587.1920x1080.jpg?t=1677858796,https://cdn.akamai.steamstatic.com/steam/apps/2256900/ss_94157e219fc9b7b870b91e11b0bcce1acef50a56.1920x1080.jpg?t=1677858796,https://cdn.akamai.steamstatic.com/steam/apps/2256900/ss_4b80b0839049dbb10134e883b05059e38b418571.1920x1080.jpg?t=1677858796,https://cdn.akamai.steamstatic.com/steam/apps/2256900/ss_cb9e13896d97833f4e59baf6f96deae705383b58.1920x1080.jpg?t=1677858796",
    "Slug": "frack-the-world",
    "Meta Title": "Frack the World: Mar 1, 2023, Beef Cat and Full Overview",
    "Meta Description": "Looking for information on Frack the World? Check out the release date (Mar 1, 2023), developer insights from Beef Cat, and a complete game summary.",
    "Alt Text Image": "Official header image for Frack the World game - Steam 2256900",
    "Canonical URL": "https://gusku.site/game/frack-the-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Frack the World\", \"description\": \"Looking for information on Frack the World? Check out the release date (Mar 1, 2023), developer insights from Beef Cat, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 1, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Beef Cat\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Beef Cat\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2256900/header.jpg?t=1677858796\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}