{
    "AppID": 2269980,
    "Name": "FUR Squadron",
    "Release date": "Mar 16, 2023",
    "About the game": "About FUR Squadron An arcade space shooter which follows the adventure of a team of elite pilots during what seems at first a routine training in virtual reality. In this mind-blowing journey through retrowave aesthetic environments and synthwave music you will shoot your way through the simulations (or not?) of the units and minions of the evil Skal Empire . FUR Squadron keeps the gameplay of classic 90's on-rails shooters alive, while bringing it up to date with even smoother controls and a refreshingly modern and sleek visual style. An action and narrative-driven on-rails adventure with a classic 90’s shooter flair. Smooth and quick gameplay through levels full of enemies and massive bosses. Unlock their secrets and power-up your star ship for maximum performance. Six Levels. Three levels of difficulty piloting a variety of ships. Original synthesizer soundtrack to match the retrowave aesthetics. Steam Deck compatible. A lovely axolotl! A virtual world The story of FUR Squadron is set in the middle of routine virtual reality training. However, an unknown threat bursts onto the scene and endangers the lives of the team. Could the dreaded Skal Empire be the one behind all of this? The fur_net system developed by Axel Mex shows low poly graphics rendered with a retrowave aesthetic. Of course, the whole adventure is accompanied by a synthwave soundtrack to match the graphics. Because work is best done in style. Meet your squadron Blaze Mustela is the leader of the FUR Squadron. He is brave and determined and is always focused on accomplishing the mission. When the going gets tough, he keeps his cool and helps his team get through the situation. Kiro Nax had an accident that prevented him from flying with his own wings. Determined to take to the skies, he learned to pilot and has shown enormous talent at the controls. Now he is a valuable member of the squadron who likes to show off, even if that can get him into trouble. Axel Mex was abandoned as a tadpole, but ended up being adopted by Blaze and recruited as a member of the FUR Squadron. Her curiosity led her to become an expert in technology. Within the squadron, she serves as their engineer and computer expert as well as a pilot. Always cheerful, she does not hesitate to face the bad guys in order to protect her new family. And... Uh? Who's that?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2269980/header.jpg?t=1678994146",
    "Price": 6.29,
    "Developers": "Raptor Claw",
    "Publishers": "Raptor Claw",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2269980/ss_360faa74a053d95bdc062080ce11a889d755071a.1920x1080.jpg?t=1678994146,https://cdn.akamai.steamstatic.com/steam/apps/2269980/ss_b654276dca03d198e5702310cb503c89d2b43ceb.1920x1080.jpg?t=1678994146,https://cdn.akamai.steamstatic.com/steam/apps/2269980/ss_389803625472668441cf591d79f83c9621353fb8.1920x1080.jpg?t=1678994146,https://cdn.akamai.steamstatic.com/steam/apps/2269980/ss_375f852fd15c50dd25b8fa597267f87b7565814a.1920x1080.jpg?t=1678994146,https://cdn.akamai.steamstatic.com/steam/apps/2269980/ss_db52f51b97d82d2f3159cc9e6387878da3e0fc62.1920x1080.jpg?t=1678994146,https://cdn.akamai.steamstatic.com/steam/apps/2269980/ss_1560a1f34a28d9873bbfe6e01dc22748af503784.1920x1080.jpg?t=1678994146,https://cdn.akamai.steamstatic.com/steam/apps/2269980/ss_ee93ea66594556dc858a2268145246dd6a8907dc.1920x1080.jpg?t=1678994146,https://cdn.akamai.steamstatic.com/steam/apps/2269980/ss_f4bafe402d755bd351b72725e45432c9c7ee1cbb.1920x1080.jpg?t=1678994146",
    "Slug": "fur-squadron",
    "Meta Title": "FUR Squadron: Mar 16, 2023, Raptor Claw and Full Overview",
    "Meta Description": "Looking for information on FUR Squadron? Check out the release date (Mar 16, 2023), developer insights from Raptor Claw, and a complete game summary.",
    "Alt Text Image": "Official header image for FUR Squadron game - Steam 2269980",
    "Canonical URL": "https://gusku.site/game/fur-squadron",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"FUR Squadron\", \"description\": \"Looking for information on FUR Squadron? Check out the release date (Mar 16, 2023), developer insights from Raptor Claw, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 16, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Raptor Claw\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Raptor Claw\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2269980/header.jpg?t=1678994146\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.29, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}