{
    "AppID": 2315680,
    "Name": "Futanari Stepsis",
    "Release date": "Feb 25, 2023",
    "About the game": "Story Ethan and his stepsister Samira are both starting their first year at the same university, but they have very little money. To afford it they decide to live together in an campus apartment to split the cost of accommodation. Ethan is 20 years old and is highly focused on his studies and wants nothing more than to excel in university. He is a straight-A student who spends all of his time studying and participating in extracurricular activities. On the other hand, Samira, who is 21 years old, is wild and likes to have fun and party. She is reckless and disorganized, and often stays out late drinking with friends. Despite their differences, they are both determined to make their living arrangement work. Ethan wants to stay at the university no matter what to get the best education possible, while Samira wants to stay to enjoy the endless frat parties and campus social scene. How will they live together? Are they going to became closer? What will happen once he discovers her naughty secret? Features: - Unique combination of match 3 puzzle gameplay and erotic visual novel scenes. - Incredibly sexy female character - Can be played with one hand. - Realistic and beautiful renders - 22 levels to play with various difficulty - 27 reward renders to unlock Gameplay This game is a combination of a visual novel and a match 3 puzzle. You will play as Ethan and in each level you will have to deal with Samira and the problems arising from your co-living. You will get to know her better and eventually, you will see what is hidden underneath her tight pants. After a short story, you need to win a match 3 level in order to progress in the game. The puzzle is challenging yet not difficult, it will require you to think! You'll need to match 3 or more of the same gems in a row. Each gem has a different meaning and some may harm you. You have to match the right tokens to perform the specific actions, like seducing Samira or restoring your health! You win the level after you seduce her. The game contains also a gallery with unlockable CGs of Samira and later also your naughty adventures together.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2315680/header.jpg?t=1677373212",
    "Price": 3.59,
    "Developers": "Cute Pen Games",
    "Publishers": "Cute Pen Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2315680/ss_3cce6a3638b696a7ef59ec7429d29e18029f0dbf.1920x1080.jpg?t=1677373212,https://cdn.akamai.steamstatic.com/steam/apps/2315680/ss_0f8103537b8f8c301fb3b39a8a82af72c077aadc.1920x1080.jpg?t=1677373212,https://cdn.akamai.steamstatic.com/steam/apps/2315680/ss_398f8d132e5d45565e7d71fb5b178b1174ff90f2.1920x1080.jpg?t=1677373212,https://cdn.akamai.steamstatic.com/steam/apps/2315680/ss_33cbc939100e60357ad088fe10de6bcdf6015999.1920x1080.jpg?t=1677373212,https://cdn.akamai.steamstatic.com/steam/apps/2315680/ss_d4e7e9aa58dd86df103bde3a1c352e006ee7cb5c.1920x1080.jpg?t=1677373212,https://cdn.akamai.steamstatic.com/steam/apps/2315680/ss_31b38491f44421e02d4acbeae0e031d4acce8c94.1920x1080.jpg?t=1677373212",
    "Slug": "futanari-stepsis",
    "Meta Title": "Futanari Stepsis: Feb 25, 2023, Cute Pen Games and Full O...",
    "Meta Description": "Looking for information on Futanari Stepsis? Check out the release date (Feb 25, 2023), developer insights from Cute Pen Games, and a complete game summ...",
    "Alt Text Image": "Official header image for Futanari Stepsis game - Steam 2315680",
    "Canonical URL": "https://gusku.site/game/futanari-stepsis",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Futanari Stepsis\", \"description\": \"Looking for information on Futanari Stepsis? Check out the release date (Feb 25, 2023), developer insights from Cute Pen Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cute Pen Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cute Pen Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2315680/header.jpg?t=1677373212\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}