{
    "AppID": 2326740,
    "Name": "Galactic Empire",
    "Release date": "Mar 9, 2023",
    "About the game": "In Galactic Empire, you will plan the actions of your Empire every turn. Here you will find options such as building upgrades, research, constructing ships and upgrading them. Turn-based battles against other Factions, an original card game, managing defense systems when attacked by other Factions, Diplomacy, population management and much more. Choose your planet type. Each of the planets has different characteristics, such as: resource deposits, food abundance, temperature, building fields, starting population, and even unique buildings. Choose character class: When you start the game, you choose one of three character classes: Architect, Scientist, General. Each of them has a set of unique abilities that you will improve and use during the game. However, nothing stands in the way of buying the other two ability packs. Each class determines your basic resource extraction, reduces costs (buildings/research/ships), which significantly influences the strategy. Specify victory conditions: To complete the game, you will have to meet all the victory conditions you choose. (you can choose more than one) - Technological development - Maximum Reputation with other Factions - Take over all planets - Getting a certain amount of points Buildings / Research / Ships To develop your Empire, you will decide each turn which buildings to upgrade, research and construct spaceships. Level up your Empire to unlock new tech blueprints! Population Management The population in your Empire consists of 4 social classes: unemployed, workers, engineers, clerks. Manage them wisely by giving them the right job. Ship Parts: Each ship has specific slots for parts. Thanks to them, you can significantly change the parameters of ships, completely changing the combat use of a given unit. Original card game In the canteen you can buy a basic deck of cards and play an original card game. Remember to upgrade your deck later! Factions: You have to take into account that your actions affect your reputation with other Factions. Hostile factions will attack you while friendly factions will trade with you and maybe even allow you to colonize their own planets! Build defense systems to manage them while defending your planet. Explore the Universe: When creating a game, you can specify the number of galaxies and solar systems. There can be up to 20 solar systems in each galaxy. There are various objects in each solar system, such as: Planets, Black Holes, Nebulae, Canteens, Asteroid Fields, Pirate Hideouts... Send spy probes and decide how you will use these objects. Acts From time to time, you will receive a variety of laws to sign that will affect the functioning of your Empire. Rating: The game has a built-in leaderboard where you can view all your completed matches and their results. Beat your records and test different strategies! Achievement system built into the game! Beginner friendly! There are tutorials in the game. The missions are designed with beginners in mind, and are designed to familiarize you with the options that appear. As your Empire grows, you'll unlock more and more things. The game offers 4 difficulty levels: Easy, Normal, Hard, Extreme. The game contains over 40 minutes of original soundtrack.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2326740/header.jpg?t=1678653733",
    "Price": 13.49,
    "Developers": "Kielan xD",
    "Publishers": "Kielan xD",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2326740/ss_47b4cb8b95c9067633b5d601500efec5e13ada93.1920x1080.jpg?t=1678653733,https://cdn.akamai.steamstatic.com/steam/apps/2326740/ss_df13784a1a7cc5e20bebbd28a8f8418fe954c8c4.1920x1080.jpg?t=1678653733,https://cdn.akamai.steamstatic.com/steam/apps/2326740/ss_ecefa210cbacda999a5b1ce0aff2181ca6f04e2c.1920x1080.jpg?t=1678653733,https://cdn.akamai.steamstatic.com/steam/apps/2326740/ss_2ca00ffe8ade46ed248e9e1382701f241e5fe418.1920x1080.jpg?t=1678653733,https://cdn.akamai.steamstatic.com/steam/apps/2326740/ss_1c064db6491fdb0623333ab4af35b0d87629af93.1920x1080.jpg?t=1678653733,https://cdn.akamai.steamstatic.com/steam/apps/2326740/ss_27914d9f2f4480579e82145b6b3de4f3803bed40.1920x1080.jpg?t=1678653733,https://cdn.akamai.steamstatic.com/steam/apps/2326740/ss_4dfef05441658be13c4e555b4b00fcf1f79e99a1.1920x1080.jpg?t=1678653733,https://cdn.akamai.steamstatic.com/steam/apps/2326740/ss_dabf57ba11ab8656f3440e0ebdc82dcbcec2bb01.1920x1080.jpg?t=1678653733,https://cdn.akamai.steamstatic.com/steam/apps/2326740/ss_35584a631ed1303237ba09a4fc12df18b0d09019.1920x1080.jpg?t=1678653733,https://cdn.akamai.steamstatic.com/steam/apps/2326740/ss_f956cb881a3fbbb98c3ca87fded85beff7894afe.1920x1080.jpg?t=1678653733,https://cdn.akamai.steamstatic.com/steam/apps/2326740/ss_0bd2be04dc604f05f6d844967826d01db58a5410.1920x1080.jpg?t=1678653733,https://cdn.akamai.steamstatic.com/steam/apps/2326740/ss_d964a6cd0a5fb11e07679cfe88729fde288be050.1920x1080.jpg?t=1678653733",
    "Slug": "galactic-empire",
    "Meta Title": "Galactic Empire: Mar 9, 2023, Kielan xD and Full Overview",
    "Meta Description": "Looking for information on Galactic Empire? Check out the release date (Mar 9, 2023), developer insights from Kielan xD, and a complete game summary.",
    "Alt Text Image": "Official header image for Galactic Empire game - Steam 2326740",
    "Canonical URL": "https://gusku.site/game/galactic-empire",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Galactic Empire\", \"description\": \"Looking for information on Galactic Empire? Check out the release date (Mar 9, 2023), developer insights from Kielan xD, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 9, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kielan xD\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kielan xD\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2326740/header.jpg?t=1678653733\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}