{
    "AppID": 2280270,
    "Name": "炸弹狂欢",
    "Release date": "Mar 9, 2023",
    "About the game": "Bomberfest is a 3D bomberman-style strategy game developed by Unity. In the game, players take their characters on adventures in a world made up of blocks and other elements, using bombs to blast open boxes to collect items, and using bombs to destroy various enemies. Bomberfest is a 3D bomberman-style strategy game developed by Unity. In the game, players take their characters on adventures in a world made up of blocks and other elements, using bombs to blast open boxes to collect items, and using bombs to destroy various enemies. The game includes a variety of characters with different skill styles, who can play to their strengths in different situations. About the new adventure mode: It is said that there is a secret hidden in Level-8. Some say that there are countless rarities, some say that a terrible demon is imprisoned there, others say that it is nothing but a void. There has never been evidence of anything hidden in Level-8, because no one who has been there has ever returned. Of course, they could have died on other levels, and it's all just a myth. You take on the role of one of four optional characters as you embark on an adventure to Level-8, either alone or with your AI teammates, exploring one weird and thrilling Level after another, battling a plethora of enemies and assorted monsters, and trying to survive the roar of bomb blasts. Using the combination of Roguelike and bomb-man game elements, the game scene is presented to the player in a completely 3D screen. Each time the player goes on an adventure, the scene will be different. Note: There is no advertising of any kind, and the game is completely free to play with a variety of characters with different skills and styles, who can use their strengths in different situations. About the new adventure mode: It is said that there is a secret hidden in Level-8. Some say that there are countless rarities, some say that a terrible demon is imprisoned there, others say that it is nothing but a void. There has never been evidence of anything hidden in Level-8, because no one who has been there has ever returned. Of course, they could have died on other levels, and it's all just a myth. You take on the role of one of four optional characters as you embark on an adventure to Level-8, either alone or with your AI teammates, exploring one weird and thrilling Level after another, battling a plethora of enemies and assorted monsters, and trying to survive the roar of bomb blasts. Using the combination of Roguelike and bomb-man game elements, the game scene is presented to the player in a completely 3D screen. Each time the player goes on an adventure, the scene will be different. Note: There are no ads of any kind, and the content is completely free",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2280270/header.jpg?t=1678591086",
    "Price": 1.19,
    "Developers": "乔元成",
    "Publishers": "乔元成",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2280270/ss_e5b60df0a5fd0843d0e6c88b2b6cc7127a6e3015.1920x1080.jpg?t=1678591086,https://cdn.akamai.steamstatic.com/steam/apps/2280270/ss_bd9240ee70ae41afd73d5e9676a9ad3411ae0efc.1920x1080.jpg?t=1678591086,https://cdn.akamai.steamstatic.com/steam/apps/2280270/ss_b47934e56b28aab9a45ab43b4818f0ca49216a15.1920x1080.jpg?t=1678591086,https://cdn.akamai.steamstatic.com/steam/apps/2280270/ss_da554281148509e4e81017880697d46bd68bd53a.1920x1080.jpg?t=1678591086,https://cdn.akamai.steamstatic.com/steam/apps/2280270/ss_8502ef11cb2d5c671fdbb21352e64d8a752f3a76.1920x1080.jpg?t=1678591086,https://cdn.akamai.steamstatic.com/steam/apps/2280270/ss_2ad734a773f4b79820ffcdf98767a91aa2f1b3f6.1920x1080.jpg?t=1678591086",
    "Slug": "",
    "Meta Title": "炸弹狂欢: Mar 9, 2023, 乔元成 and Full Overview",
    "Meta Description": "Looking for information on 炸弹狂欢? Check out the release date (Mar 9, 2023), developer insights from 乔元成, and a complete game summary.",
    "Alt Text Image": "Official header image for 炸弹狂欢 game - Steam 2280270",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u70b8\\u5f39\\u72c2\\u6b22\", \"description\": \"Looking for information on \\u70b8\\u5f39\\u72c2\\u6b22? Check out the release date (Mar 9, 2023), developer insights from \\u4e54\\u5143\\u6210, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 9, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4e54\\u5143\\u6210\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u4e54\\u5143\\u6210\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2280270/header.jpg?t=1678591086\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}