{
    "AppID": 2309800,
    "Name": "ウワガキアイ",
    "Release date": "Feb 25, 2023",
    "About the game": "■Story The protagonist wakes up in a strange place and He wakes up in a strange place and gets caught up in a crazy and inorganic experiment by 'someone'. While fighting against what lurks within and searching for a way to escape and discover the tragedy that took place here. ■Features ･Command You need to use your own actions on the game screen and the four commands on the upper side of the screen to advance the story. and four commands on the upper side of the screen to advance the story. However, the commands are not always However, the commands are not always available. You have to win a game with 'someone' and and take away the commands. ･Riddle Solving Element There are several riddles in front of the main character. The player solves the riddles based on the hints that can be found somewhere in the facility. The 'riddles' will become important to reveal the truth. ･Exploration type game The game is an exploration type game in which the player searches for the truth by examining objects in the map. ･Items There are various items hidden in the map. However, they are not used automatically. You, the player, must specify where to use them. ･The stage The main character searches for escape in a place like a laboratory. ■Before starting this game You need to click on commands, images, etc. in the screen. Normal movement can also be done with the cross keys. This game contains death, dark and grotesque expressions. It also contains some horror scenes. The content of the game is the same as that of the free game. It takes about 5 hours to play and has multiple endings. There is an EXTRA on the title screen, and END hints are provided in it. If you find the game difficult to conquer, please refer to the hints. ■About the live broadcast You are welcome to do so. There is no need to put the name of the work, author, or URL in the video. (The use of in-game data for purposes other than gameplay or distribution is prohibited.)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2309800/header.jpg?t=1677339707",
    "Price": 0.0,
    "Developers": "ツノウサギの家",
    "Publishers": "ツノウサギの家",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2309800/ss_d50fac39edef097af3ad48d6200bd2a7a33701c1.1920x1080.jpg?t=1677339707,https://cdn.akamai.steamstatic.com/steam/apps/2309800/ss_add63641c7f36970f60467d9dbe5e5e93adb4bc9.1920x1080.jpg?t=1677339707,https://cdn.akamai.steamstatic.com/steam/apps/2309800/ss_5f76b84eb263bb6d504bdfff3be965eea4582ce8.1920x1080.jpg?t=1677339707,https://cdn.akamai.steamstatic.com/steam/apps/2309800/ss_9bb0d853947e9a82ec3661caee55622e04da0159.1920x1080.jpg?t=1677339707,https://cdn.akamai.steamstatic.com/steam/apps/2309800/ss_3329c7a04f38ff6b24da0524f9d8f2c2c7f552da.1920x1080.jpg?t=1677339707",
    "Slug": "",
    "Meta Title": "ウワガキアイ: Feb 25, 2023, ツノウサギの家 and Full Overview",
    "Meta Description": "Looking for information on ウワガキアイ? Check out the release date (Feb 25, 2023), developer insights from ツノウサギの家, and a complete game summary.",
    "Alt Text Image": "Official header image for ウワガキアイ game - Steam 2309800",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u30a6\\u30ef\\u30ac\\u30ad\\u30a2\\u30a4\", \"description\": \"Looking for information on \\u30a6\\u30ef\\u30ac\\u30ad\\u30a2\\u30a4? Check out the release date (Feb 25, 2023), developer insights from \\u30c4\\u30ce\\u30a6\\u30b5\\u30ae\\u306e\\u5bb6, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u30c4\\u30ce\\u30a6\\u30b5\\u30ae\\u306e\\u5bb6\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u30c4\\u30ce\\u30a6\\u30b5\\u30ae\\u306e\\u5bb6\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2309800/header.jpg?t=1677339707\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}