{
    "AppID": 2067470,
    "Name": "Idol Hell",
    "Release date": "Mar 2, 2023",
    "About the game": "What is Idol Hell? 🎀Idol Hell is a 2D, Touhou-like, Shoot 'em up, bullet hell game taking inspiration from Japanese school idols and anime tropes. 🎶In Idol Hell, you play as Medli, a robot schoolgirl idol set on a warpath to free her closest friend. Fight through hordes of enemies and other cutesy robot idols in this vibrant, precision-based game. Beginner Friendly Bullet Hell? Our goal with this game was to make a bullet hell that newcomers to the genre and veterans alike could enjoy! Bumble, our lowest difficulty, intends to ease players in so they can become comfortable with the controls and develop their own style of gameplay through a more forgiving experience.🌸 On Humble, the game picks up what we consider to be a proper challenge for players of all levels. We encourage new players to try and try again on Bumble so they may one day play through Humble, a massive accomplishment displaying developed reflexes and coordination at a high level!🎀 Rumble is where things pick up and where long-time fans of the genre should look. Indicated with red hues, this is where the game stops being generous requiring high-speed reactions and clinical navigation to finish.🎵 For a final challenge, Crumble is our “ridiculous” difficulty popular in the genre. We do not recommend players start here until they’ve seen every pattern at least once as Crumble offers little time to learn and works to defeat you at every turn. You have been advised.🎶 Idol Hell’s Game Design For this game, we wanted to design in a way familiar to players of the genre while still developing a unique identity. The general pacing of the game is two waves of enemies introducing you to their attacks, a mid-boss that hints at the boss’ attack, a final wave including a medley of all enemies, and the boss herself. Each boss alternates between a Warm Up attack followed by a Performance attack. Warm Ups are simple in style, typically copying the behavior seen already in the stage, and each consecutive warm-up will be similar to the ones before it in some way. Performances follow a Warm Up and are noted by a change in the background. Performances are very unique with experimental attacks the Idol has come up with herself. This means the nature of the Performances may seem unpredictable at first but can be mastered with understanding and practice. Learning the tempo of waves, Warm-ups and Performances is key to beating the game! The Full Game Includes: 4 Difficulty Levels! 4 Different Game Modes to Play! 6 Chapters! 7 Cute Robot Idols! 14 Songs Filled With Variety! Hundreds Of Bullet Patterns!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2067470/header.jpg?t=1677959329",
    "Price": 14.99,
    "Developers": "Ultimate Developers",
    "Publishers": "MAGIC Spell Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2067470/ss_f4d3726c8e45f981057cdc6c0e48358a4f6cc866.1920x1080.jpg?t=1677959329,https://cdn.akamai.steamstatic.com/steam/apps/2067470/ss_4bb6bec0f18a1e6bfe1219f667b008a1dc313c88.1920x1080.jpg?t=1677959329,https://cdn.akamai.steamstatic.com/steam/apps/2067470/ss_d9fed5715d27ccc5942e7281c9162d145ff1e110.1920x1080.jpg?t=1677959329,https://cdn.akamai.steamstatic.com/steam/apps/2067470/ss_2e7f3fd7becb55105fb1f8f488cc213dca19f6fe.1920x1080.jpg?t=1677959329,https://cdn.akamai.steamstatic.com/steam/apps/2067470/ss_f32a768a612e90d76a0981201d38d1c582b516a3.1920x1080.jpg?t=1677959329",
    "Slug": "idol-hell",
    "Meta Title": "Idol Hell: Mar 2, 2023, Ultimate Developers and Full Over...",
    "Meta Description": "Looking for information on Idol Hell? Check out the release date (Mar 2, 2023), developer insights from Ultimate Developers, and a complete game summary.",
    "Alt Text Image": "Official header image for Idol Hell game - Steam 2067470",
    "Canonical URL": "https://gusku.site/game/idol-hell",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Idol Hell\", \"description\": \"Looking for information on Idol Hell? Check out the release date (Mar 2, 2023), developer insights from Ultimate Developers, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 2, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ultimate Developers\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MAGIC Spell Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2067470/header.jpg?t=1677959329\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}