{
    "AppID": 2217680,
    "Name": "KOP KILLER 22XX",
    "Release date": "Mar 6, 2023",
    "About the game": "GAMEPLAY Get ready to bash some fash in KOP KILLER 22XX! This beat-em up, action platformer features fast-paced, bloody combat with a retro aesthetic. Advanced, AI-controlled enemies hunt you through gritty prisons, hopeless factory towns, and opulent sky-cities as you assemble a team of comrades to take down KAPITAL. Climb fencing, mantle ledges, hang from bars, and leap from walls as you outmaneuver KAPITAL Operatives (KOPs) in search of upgrades to expand your move-set. Punch, kick, and shoot your way through endless hordes of fascist foes. KOP KILLER 22XX is in Early Access and currently features a thrilling ARCADE MODE. Battle your way through randomized arenas as you compete for the high score on global leaderboards. ARCADE MODE presents endless hours of combat against procedurally designed encounters against a diverse rogues’ gallery of KOPs. Between fights, you’ll be able to select power ups and recruit comrades to better face the increasingly difficult hordes of fascist foes. As Early Access progresses, expect exciting new content, QoL updates and balance tweaks based on YOUR feedback! -=COMING SOON! =- KOP KILLER 22XX will add a preview of its carefully crafted STORY MODE. Filled with engaging platforming action and compelling narrative, STORY MODE will offer a fully fleshed out, narrative adventure. Battle bosses, make friends and enemies, and discover the secrets of the fortress-city known as KAPITAL. STORY In the late 23rd century HOPE IS DEAD. A vile conglomerate of oligarchs lord over the fractured territories of the Americas from a floating fortress-city known as KAPITAL. This de facto cartel-state maintains control over the continental populace via KAPITAL OPERATIVES, brutal thugs more commonly known as KOPs. A paramilitary force composed of die-hard loyalists and brainwashed warriors, the KOPs carry out KAPITAL’s bidding while keeping the street gangs and ethno-nationalist warbands tightly under their thumb. They call this violence THE LAW. In KOP KILLER 22XX you are the KOP KILLER, a humble miner turned CYBORG KILLING MACHINE from the toxic pit-town called Acuaverde. A feud among KAPITAL houses renders the digital scrip you’re paid in utterly worthless. To afford the anti-rad meds needed to survive Acuaverde, you and your fellow workers turn to a life of CRIME! Arrested and sold to the highest bidder, you’re sent to Homan Correction, a hellish prison known for human experimentation. The overseers select YOU for the WARRIOR program, where they intend to hack away at your mind and body to transform you into an obedient KAPITAL OPERATIVE. A mysterious accident interrupts the process before they take control of your mind, unleashing you on the Prison to dole out your own brand of JUSTICE. KEY FEATURES Experience white-knuckle arcade action in procedural generated arenas. Battle over a dozen AI enemy-types that jump, climb, and fly to hunt you down. Collect loads of power-ups to customize your build as you advance. Recruit AI comrades with unique abilities to join your fight against KAPITAL Compete globally and with your friends on Steam Leaderboards. Complete achievements to unlock new content. Manage health and ammo through combat choices as you struggle for survival. Play using your favorite controller. Enjoy bashing fascist goons with cyborg fists of steel. EARLY ACCESS ROADMAP",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2217680/header.jpg?t=1678210776",
    "Price": 2.0,
    "Developers": "Morningstar Game Studio,Dr. Shameless Cat Games",
    "Publishers": "Morningstar Game Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2217680/ss_69851e3cdae109bd118e37035b1fec05c5000d37.1920x1080.jpg?t=1678210776,https://cdn.akamai.steamstatic.com/steam/apps/2217680/ss_30f787832039b1ec4f25737e6ef0e9d0cc1415ca.1920x1080.jpg?t=1678210776,https://cdn.akamai.steamstatic.com/steam/apps/2217680/ss_173d2a41b13d3f829e7aeb3b2cae7d45a877b733.1920x1080.jpg?t=1678210776,https://cdn.akamai.steamstatic.com/steam/apps/2217680/ss_3fb5e91ab0613f766c86c21f996d95d77759dd72.1920x1080.jpg?t=1678210776,https://cdn.akamai.steamstatic.com/steam/apps/2217680/ss_3e3bd3f2e0f0da3b6137431960a8ca6029378075.1920x1080.jpg?t=1678210776,https://cdn.akamai.steamstatic.com/steam/apps/2217680/ss_3141ee44ffa456939e7054a4eb6f7c568d5434ee.1920x1080.jpg?t=1678210776,https://cdn.akamai.steamstatic.com/steam/apps/2217680/ss_82e7e554e9172dee1b0c0262835fbe0d59f64784.1920x1080.jpg?t=1678210776,https://cdn.akamai.steamstatic.com/steam/apps/2217680/ss_9926f1e9952671c8e48f3a153cea8a59c34f296a.1920x1080.jpg?t=1678210776,https://cdn.akamai.steamstatic.com/steam/apps/2217680/ss_35c1d8bbcbc68a05c6b8c2977f15d38f1a45fe19.1920x1080.jpg?t=1678210776",
    "Slug": "kop-killer-22xx",
    "Meta Title": "KOP KILLER 22XX: Mar 6, 2023, Morningstar Game Studio,Dr....",
    "Meta Description": "Looking for information on KOP KILLER 22XX? Check out the release date (Mar 6, 2023), developer insights from Morningstar Game Studio,Dr. Shameless Cat ...",
    "Alt Text Image": "Official header image for KOP KILLER 22XX game - Steam 2217680",
    "Canonical URL": "https://gusku.site/game/kop-killer-22xx",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"KOP KILLER 22XX\", \"description\": \"Looking for information on KOP KILLER 22XX? Check out the release date (Mar 6, 2023), developer insights from Morningstar Game Studio,Dr. Shameless Cat ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 6, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Morningstar Game Studio,Dr. Shameless Cat Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Morningstar Game Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2217680/header.jpg?t=1678210776\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}