{
    "AppID": 1366560,
    "Name": "MiLE HiGH TAXi",
    "Release date": "Mar 13, 2023",
    "About the game": "A High-Octane Thrill Ride Get ready to take on the role of the ultimate sci-fi hover taxi driver in this fast-paced adventure! Experience heart-pumping action as you race against the clock in a vibrant, futuristic city inspired by 'The Fifth Element', with arcade-style gameplay reminiscent of 'Crazy Taxi'. This pulse-pounding ride will have you on the edge of your seat. As you speed through the narrow, vibrant skyways, you'll encounter a cast of hilarious and chatty pedestrians, as well as impatient and over-the-top passengers. Every moment counts in this high-stakes all-or-nothing game. Rise to the challenge and come out on top! Gameplay is Simple - Mastering this Game Won't Be! With an “easy” setting and three different game play modes to choose from, you'll have plenty of opportunities to improve your skills and test your limits. Most players can master the controls for a hover taxi in under one hour of intense gameplay and be able to confidently navigate the city streets. Get ready to accept the challenge, take the wheel, and show off your skills as you become a top player in this fast-paced adventure! Different Ways to Play In regular mode, strategize to pick up and drop off passengers in efficient ways, maximizing your earnings and extending your game time and career. In Challenge mode, you'll face increasingly difficult challenges as you deliver passengers sequentially to level up. In Free Roam mode, you'll be able to explore the city with no time limits or passenger pickups, discovering hidden shortcuts and other secrets as you go. Gameplay Prepare for action as you climb into your taxi and start picking up fares from towering skyscrapers. You'll need to deliver your passengers as fast as possible to keep your job and earn bonus time, but don't let your guard down – you never know what obstacles and challenges you might face on the Skyways. Navigate through the city and find hidden customers with the help of your NavCom AI. Once you've mastered the city, take the fast lane by navigating narrow back alleys and use your Hyper Boost to blast through skyway traffic at breakneck speeds of up to 250mph. With over 50 floors to explore, this video game is sure to keep you engaged and on the edge of your seat. MiLE HiGH TAXi is like 'The Fifth Element meets Crazy Taxi'. Deliver Zany Passengers, Dodge Mile-High Skyscrapers, and Blabbermouth Pedestrians in a Fast-Paced Race Against Time. Here are some of the games I'm told are either similar, or that I took some inspiration from: Crazy Taxi, Taxi Chaos, CloudPunk, CyberPunk 2077 (I'm not sure why?), Forza, Grand Theft Auto (maybe because driving into people?), BeamNG.drive, the Coruscant scene from Star Wars, Midnight Club 3 (I'm guessing because of the architecture of the buildings), and last but not least is Taxi Simulator. Created by solo-developer Cassius John-Adams.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1366560/header.jpg?t=1678833231",
    "Price": 14.44,
    "Developers": "Cassius John-Adams",
    "Publishers": "Cassius John-Adams",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1366560/ss_7c90019337c62ee8f5335e266ddd957ea2265d1e.1920x1080.jpg?t=1678833231,https://cdn.akamai.steamstatic.com/steam/apps/1366560/ss_96026172acd810b07b06d9d4f60f5ef3b89e2399.1920x1080.jpg?t=1678833231,https://cdn.akamai.steamstatic.com/steam/apps/1366560/ss_9551816c752220e59f07adfdb87add28f1ab2f63.1920x1080.jpg?t=1678833231,https://cdn.akamai.steamstatic.com/steam/apps/1366560/ss_59ff18be9d60ade2786df491191c41c7318c5dbf.1920x1080.jpg?t=1678833231,https://cdn.akamai.steamstatic.com/steam/apps/1366560/ss_29624c43a1fe423848cda29533788661352a0863.1920x1080.jpg?t=1678833231,https://cdn.akamai.steamstatic.com/steam/apps/1366560/ss_ae377c0c0eb956f96417198f326c56e0c6149bfb.1920x1080.jpg?t=1678833231",
    "Slug": "mile-high-taxi",
    "Meta Title": "MiLE HiGH TAXi: Mar 13, 2023, Cassius John-Adams and Full...",
    "Meta Description": "Looking for information on MiLE HiGH TAXi? Check out the release date (Mar 13, 2023), developer insights from Cassius John-Adams, and a complete game su...",
    "Alt Text Image": "Official header image for MiLE HiGH TAXi game - Steam 1366560",
    "Canonical URL": "https://gusku.site/game/mile-high-taxi",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MiLE HiGH TAXi\", \"description\": \"Looking for information on MiLE HiGH TAXi? Check out the release date (Mar 13, 2023), developer insights from Cassius John-Adams, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 13, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cassius John-Adams\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cassius John-Adams\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1366560/header.jpg?t=1678833231\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.44, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}