{
    "AppID": 2212060,
    "Name": "Ortharion : The Last Battle Prologue",
    "Release date": "Mar 6, 2023",
    "About the game": "This game is the prologue of the following game: / Ortharion: The Last Battle is a hack'n slash RPG set in a medieval fantasy world, The game takes the basics of Ortharion Project by improving them and adding content on top. Story: Join a fantasy world filled with magic and secrets. The great mage Ortharion has chosen you! With his help, restore balance in the world and pursue your own goals! Competitive modes: The game has been designed around several ranking systems, whether it is survival arenas, killing certain bosses as quickly as possible, making a dungeon as quickly as possible. Accumulate points and compare them to your friends or to the community with a season system. Easy to learn, hard to master: An intuitive handling, with several mechanics based on the learning of rules, whether of the world, of the adventurer's guild with management of new adventurers, but also the mechanics of your character or enemies. Over 350 upgradeable spells: Spells must be found and learned, there are 5 types of rarity and they can level up. Learning requires certain statistics and particular classes. Spells that are found and have already been learned are also useful. Class evolution : Start with one of the 3 classes available at the start of the game, gradually choose new classes and subclasses, giving you different advantages to finally choose 7 specialties at the same time among the 39 available in total, for an almost infinite number of possibilities. More than 50 monsters with different abilities: Fight a few monsters at the start and then manage several dozen at the same time on the highest levels. 20 major bosses to face: The bosses are divided into two categories, the normal bosses which will be a small passing challenge and 20 much more powerful bosses leaving you no room for error and where each combat is scheduled to last about ten minutes with several combat phases. Procedural objects : Each object can have particular powers and in addition belong to a set, making the number of combinations more important than on other hack'n slashes. Your best items can also be upgraded with the Blacksmith, Enchantress, or Gems. The statistics are also random and distributed by Third Party. Collect Ortharion Shards : Collect its Shards in mini-trails made up of traps, moving platforms, puzzles and secret areas. Talent Trees : Each Ortharion shard gives you a point in talent trees that will allow you to further personalize your character. The talent trees being specific to each class with very specific points and other more general points. Management of an adventurer's guild: Collect resources, build houses for yourself and future adventurers who want to join your guild, buy new, more qualified merchants, specialize your guild, send your adventurers on a mission or ask them to become your comrades in arms to bring them with you as you explore the world. A skill and crafting system with real learning: Testing craft recipes using mini-games, your character can learn recipes, making it easier for you to create, but if you understand the system you can perfectly create whatever you want without needing your character to use a blueprint. The creation from A to Z of an object is planned, unlike Ortharion Project. Several levels of difficulty adjustable whenever you want",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2212060/header.jpg?t=1678119950",
    "Price": 0.0,
    "Developers": "Ortharion project",
    "Publishers": "Ortharion project",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2212060/ss_1d3cf94a322b707e57214922730562517d5f9d53.1920x1080.jpg?t=1678119950,https://cdn.akamai.steamstatic.com/steam/apps/2212060/ss_6b886ad967110689e89765fa050668a4d0361d33.1920x1080.jpg?t=1678119950,https://cdn.akamai.steamstatic.com/steam/apps/2212060/ss_89ad92f3306aa7686bb6f5229d4d5603e7aa634a.1920x1080.jpg?t=1678119950,https://cdn.akamai.steamstatic.com/steam/apps/2212060/ss_f442784de6f76cea1fad70ba313bb1d1181361e3.1920x1080.jpg?t=1678119950,https://cdn.akamai.steamstatic.com/steam/apps/2212060/ss_3b5cc46dd4bd6dfa3fca1d611705b42738d305da.1920x1080.jpg?t=1678119950,https://cdn.akamai.steamstatic.com/steam/apps/2212060/ss_e02266e34282aaf19cb999b3b42d544bee611c93.1920x1080.jpg?t=1678119950,https://cdn.akamai.steamstatic.com/steam/apps/2212060/ss_505e5ae2dd47eacd456b69c37359fd82e72b8fe7.1920x1080.jpg?t=1678119950,https://cdn.akamai.steamstatic.com/steam/apps/2212060/ss_c50eaaec85dea0d166d5c11c6827c7affc89e61b.1920x1080.jpg?t=1678119950,https://cdn.akamai.steamstatic.com/steam/apps/2212060/ss_460bfcb1e50147bde1791d594ef00e25a1af480e.1920x1080.jpg?t=1678119950,https://cdn.akamai.steamstatic.com/steam/apps/2212060/ss_3384193496f4532c098722690ec38cf676b7317a.1920x1080.jpg?t=1678119950,https://cdn.akamai.steamstatic.com/steam/apps/2212060/ss_e249fc4a0e4dbc1f5704f726bcc8f685cd347fdd.1920x1080.jpg?t=1678119950",
    "Slug": "ortharion-the-last-battle-prologue",
    "Meta Title": "Ortharion : The Last Battle Prologue: Mar 6, 2023, Orthar...",
    "Meta Description": "Looking for information on Ortharion : The Last Battle Prologue? Check out the release date (Mar 6, 2023), developer insights from Ortharion project, an...",
    "Alt Text Image": "Official header image for Ortharion : The Last Battle Prologue game - Steam 2212060",
    "Canonical URL": "https://gusku.site/game/ortharion-the-last-battle-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ortharion : The Last Battle Prologue\", \"description\": \"Looking for information on Ortharion : The Last Battle Prologue? Check out the release date (Mar 6, 2023), developer insights from Ortharion project, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 6, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ortharion project\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ortharion project\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2212060/header.jpg?t=1678119950\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}