{
    "AppID": 2138460,
    "Name": "Ovivim",
    "Release date": "Mar 12, 2023",
    "About the game": "Ovivim é um bichinho virtual para streamers que vive em lives da Twitch por livre e espontânea vontade. Essas criaturinhas possuem muitas formas diferentes, e como elas crescem depende de como você cuida delas. Quem cuida do ovivim não é o streamer, o chat é quem deve adotar um ovim, e cuidar da nova criatura com comida, exercício, muito amor e atenção. Ovivim é de uso exclusivo para transmissões ao vivo na Twitch, todas as atividades do ovivim são controladas por comandos no chat! Esse jogo requer um canal na Twitch para ser jogado. Esse jogo não pode ser jogado sem uma conexão com a internet. DESCUBRA mais de 50 espécies de Ovivim, todas únicas e especiais EXPLORE 32 setores da misteriosa ilha de CAROLINA no modo Aventura CUIDE com amor e carinho de criaturinhas virtuais que dependem da sua atenção para viver SUBMETA os seus ovivim a rígidas rotinas de treino que farão deles imparáveis máquinas de combate CONECTE-SE aos seus iguais contratando membros do chat como ajudantes na sua adoção Os ovivim precisam de você. Eles se alimentam de atenção, e por isso ovim são enviados para streamers de todo o Brasil, na esperança de que seus chats consigam criar o máximo de criaturinhas possível, no máximo de formas que conseguirem. Não há nenhuma motivação sinistra por trás dessa operação. Cuidar do ovivim é sua responsabilidade. Após adotar seu ovim e vê-lo eclodir, seu ovivim estará chorando, desesperado, clamando por comida e saúde. A qualidade e as particularidades da sua atenção moldarão uma criaturinha especial e só sua. O streamer só pode ajudar um pouquinho, às vezes, quando você deixar. Explore as profundezas de CAROLINA. Um paraíso insular perdido meio ao eterno mar doce. Viajando pelos 32 setores da ilha, você conhecerá os habitantes e prisioneiros desse mundo virtual, enfrentará adversários ferozes, e participará da maior guerra revolucionária na história dos jogos de bichinho virtual exclusivos para streamers. Após seguir as instruções do assistente de introdução, que vai te ajudar a conectar o jogo ao seu canal na Twitch, o seu Aparelho Ovivim estará pronto, no modo atração, diante de uma tela verde. Com a tela verde, você pode usar o recurso de Chroma Key no seu software de transmissão para incorporar o Ovivim na composição da sua live. Se você preferir, também pode mudar a cor do fundo nas configurações, ou usar um papel de parede personalizado se preferir não usar esse recurso. Para começar a jogar, os membros do seu chat usam comandos para adotar um ovim, um ovo de ovivim. Apenas um ovivim existe de cada vez, e apenas um membro do chat é o seu Tutor. O Tutor pode contratar outros membros do chat como ajudantes, escolhendo quem pode influenciar no crescimento da criatura. Você pode definir um preço em bits que os jogadores devem pagar para a adotar um novo ovim. Comandos &amp; Instruções. Você pode encontrar a lista completa de comandos e instruções no manual oficial. Esses são alguns comandos fundamentais para começar: !ovivim adotar !ovivim alimentar !ovivim vitaminar !ovivim exercitar !ovivim aventura O comando '!ovivim' sempre exibe informações sobre o estado do jogo e o link direto para o manual oficial. Suas escolhas importam. Dentre 50 espécies diferentes de ovivim, todas vêm do Ovim. Como o seu ovivim vai evoluir depende do seu estilo de cuidar. Você pode treinar o seu ovivim para que ele seja atlético ou adepto em combate, pode mimá-lo e empanturrá-lo, ou pode negligenciar suas responsabilidades e deixar que ele sofra mazelas. Cada um desses métodos afeta o crescimento do seu ovivim, e influencia na sua longevidade e na forma final que ele tomará. Um apelo do autor. É com grande apreço que lhe confio esse jogo. Por favor traga muitos ovivim ao mundo, por favor lhes ofereça gentileza, mas também disciplina; ensine-os a amar, mas também a lutar com tão intensa paixão. Descubra as formas mais misteriosas que essas criaturas podem tomar, os mais distantes substratos de CAROLINA, e forme laços. Forme laços preciosos com os espectadores de suas transmissões, com os seus amigos, com os jogadores desamparados que vagam em busca de santuário, comunidade, semelhança. Acolha, e se deixe acolher. O jogo não é perfeito, eu não tenho muito, mas o meu apelo é sincero. Obrigado por jogar-me o jogo novamente. Ovivim é um Jogo Joia por Virgula Leal (@virgulaleal) ; Arte, design e personagens, Amon Ribeiro (@chatroleta) ; Música tema, Marcolovania (@marcolovania) e Aline Ayub ; Trailer, Júlio da Gaita (@Julio_daGaita) e Drontocore (@drontocore) ; Produção, Henrique Antero (@hernique777) . Experimente outro Jogo Joia, eu preciso do dinheiro: / /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2138460/header.jpg?t=1678676778",
    "Price": 8.99,
    "Developers": "Virgula Leal",
    "Publishers": "Jogo Joia",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2138460/ss_287607b69c88576625f05e68ba757af8307b2aa0.1920x1080.jpg?t=1678676778,https://cdn.akamai.steamstatic.com/steam/apps/2138460/ss_f7ccd1764fa459f8fb0d7f8817fc64e1717907d4.1920x1080.jpg?t=1678676778,https://cdn.akamai.steamstatic.com/steam/apps/2138460/ss_f86dab10b6dbfe901054a9b162da002930dcb316.1920x1080.jpg?t=1678676778,https://cdn.akamai.steamstatic.com/steam/apps/2138460/ss_2f17b06bea7166401542635f01251cf627cab1f4.1920x1080.jpg?t=1678676778,https://cdn.akamai.steamstatic.com/steam/apps/2138460/ss_0377c9384ce49b2fa3659c7e73c825443c35cb33.1920x1080.jpg?t=1678676778,https://cdn.akamai.steamstatic.com/steam/apps/2138460/ss_548fd4dd4f97d86e5f1e19f226a1ebb3f3805172.1920x1080.jpg?t=1678676778,https://cdn.akamai.steamstatic.com/steam/apps/2138460/ss_ecd64cb9875d3c74c531eb904e1f1485e03dc137.1920x1080.jpg?t=1678676778,https://cdn.akamai.steamstatic.com/steam/apps/2138460/ss_39fbaa4c4713fb0f7b8a7b9c4f049e5555c2a828.1920x1080.jpg?t=1678676778,https://cdn.akamai.steamstatic.com/steam/apps/2138460/ss_d3139a8b665f9a538eaae3241ce67a430c4a6d4b.1920x1080.jpg?t=1678676778,https://cdn.akamai.steamstatic.com/steam/apps/2138460/ss_d926c25ab572e15949a51865b67123ee41c090d6.1920x1080.jpg?t=1678676778,https://cdn.akamai.steamstatic.com/steam/apps/2138460/ss_9075a513f22e86b0dcedb8d31c104e278bc49549.1920x1080.jpg?t=1678676778,https://cdn.akamai.steamstatic.com/steam/apps/2138460/ss_ff7cbfd4922d7a776f4300f3ab4314f800271d53.1920x1080.jpg?t=1678676778",
    "Slug": "ovivim",
    "Meta Title": "Ovivim: Mar 12, 2023, Virgula Leal and Full Overview",
    "Meta Description": "Looking for information on Ovivim? Check out the release date (Mar 12, 2023), developer insights from Virgula Leal, and a complete game summary.",
    "Alt Text Image": "Official header image for Ovivim game - Steam 2138460",
    "Canonical URL": "https://gusku.site/game/ovivim",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ovivim\", \"description\": \"Looking for information on Ovivim? Check out the release date (Mar 12, 2023), developer insights from Virgula Leal, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 12, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Virgula Leal\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jogo Joia\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2138460/header.jpg?t=1678676778\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}