{
    "AppID": 1999920,
    "Name": "Red List Girls. -Andean Flamingo-",
    "Release date": "Feb 23, 2023",
    "About the game": "Game Introduction 'Red List Girls.' is a completely original novel game series by a team of Japanese bishojo game creators. In this first installment, the endangered Andean flamingo is anthropomorphized and appears as the heroine of this title. Enjoy this touching story of those struggling to survive in a post-apocalyptic world! Cast Andean Flamingo :Maki Hanagiri Blue-throated Macaw ：Mamiko Noto Amami Rabbit ：Kaede Hondo Navigator ：Ayana Kyo Runner&amp;Lukios ：Maria Naganawa Story The world has changed dramatically since a single war. Humanity, once the supreme power on earth, was swallowed up by the power of the weapons it had created. As a result, the number of human beings has been greatly reduced. Scientific development ceased, and the destruction of nature also ceased. The remaining animals were supposed to be more prosperous ...... than before. But.... The killing by mankind did not stop. The few that survived trampled the animals' lands with their lust. They took their lives without mercy and without mercy. No more nations, no more laws. Killing numerous of our own kind did not Humanity has never changed its way of life. They were so ugly that they came to be known as [HUMAN]. The animals could not resist the mighty power of HUMAN. They were gradually reduced in number and driven to extinction. However,there were a few humans who were concerned about the danger to animals. They created an organization. [Agape],the Organization for the Assistance and Protection of Endangered Animals. Those who love animals and try to protect them in a devastated world. Agape was designed to increase the strength of the animals by transforming the strongest of the individuals into the strength by transforming them into the same form as Human. 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　 Girls who are a cross between animals and people. [[b]Red List Girls.[/b]]. This is the story of the battle waged by animal girls with weapons in their hands to protect their endangered brethren. This is the story of a battle woven by animal girls who take up arms to protect their endangered brethren... Character Andean Flamingo 'I will fight. I will fight to protect you and your friends!' The Andean flamingo is a humanoid animal that became humanoid to protect endangered animals. The Andean flamingo is a warm-natured bird that is not good at fighting, and it is not good at flying despite being a bird. Perhaps because they are not accustomed to their humanoid bodies, they are not good at flying, even though they are birds. Therefore, their fighting ability is very low among the [Red List Girls.]. Blue-throated Macaw 'That's a dependable reply. Shall I stroke you as a reward?' [Red List Girls.] who are charged with the management and defense of the Avian Lab. As their name suggests, they are humanoid avian creatures called Blue-throated macaw. They are the senior members of the Andean Flamingos. Amami Rabbit 'Books are good! They are always full of new discoveries.' The Master and the Andean flamingo meet on the run [Red List Girls.]. Like the Andean flamingos, they are not very good at fighting, probably due to the nature of their native species. Instead, they are highly intelligent and knowledgeable, and they teach the protagonists many things they do not know. Navigator 'It's not a stuffed animal!　That's rude!' The mascot of the film. At first glance, it looks like a stuffed animal, but it is a machine (robot) that can speak. He is in charge of training, managing, and monitoring the Master and [Red List Girls.]. Runner&amp;Lukios Runner:'Andean flamingos will be in our collection from today!' Lukios:'We have lots of sweet treats at our house!' Twins of [HUMAN], nemesis of [Red List Girls.]. On the left is Lunar. On the right is Lukios. Lunar is the strong one. Lukios is the laid-back one. From good morning to good night, they always work in pairs. Staff Planning and Drawing :Mint Yoshida Scenario :Tsubame Amaoka Music :hieta.C Direction and Script :Wagokoro Animation :Higuma Development ：Challengers∞Amusement Lab. Producer ]:Shigeo Yoshida Production ：7th;Mint",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1999920/header.jpg?t=1677161108",
    "Price": 10.39,
    "Developers": "7th;MINT",
    "Publishers": "DoubleChallenge Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1999920/ss_486421ca3826438f78112de2be907f20be2ed8a1.1920x1080.jpg?t=1677161108,https://cdn.akamai.steamstatic.com/steam/apps/1999920/ss_5d10f78e942624ca29a4101194021a34df27b938.1920x1080.jpg?t=1677161108,https://cdn.akamai.steamstatic.com/steam/apps/1999920/ss_cd01669887de426f092d07662a9aa335b2287e57.1920x1080.jpg?t=1677161108,https://cdn.akamai.steamstatic.com/steam/apps/1999920/ss_ac47c4dd847f2b25be09c51d1ed143dc35bf6828.1920x1080.jpg?t=1677161108,https://cdn.akamai.steamstatic.com/steam/apps/1999920/ss_6de2b8aea2518c3f0e99aaca41967aef64673521.1920x1080.jpg?t=1677161108,https://cdn.akamai.steamstatic.com/steam/apps/1999920/ss_9001660c30518268cbfe8e1fbe66a80455f42b63.1920x1080.jpg?t=1677161108",
    "Slug": "red-list-girls-andean-flamingo",
    "Meta Title": "Red List Girls. -Andean Flamingo-: Feb 23, 2023, 7th;MINT...",
    "Meta Description": "Looking for information on Red List Girls. -Andean Flamingo-? Check out the release date (Feb 23, 2023), developer insights from 7th;MINT, and a complet...",
    "Alt Text Image": "Official header image for Red List Girls. -Andean Flamingo- game - Steam 1999920",
    "Canonical URL": "https://gusku.site/game/red-list-girls-andean-flamingo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Red List Girls. -Andean Flamingo-\", \"description\": \"Looking for information on Red List Girls. -Andean Flamingo-? Check out the release date (Feb 23, 2023), developer insights from 7th;MINT, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 23, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"7th;MINT\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DoubleChallenge Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1999920/header.jpg?t=1677161108\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}