{
    "AppID": 2139300,
    "Name": "Redemption Reapers",
    "Release date": "Feb 22, 2023",
    "About the game": "The Story Descending suddenly on the world, the macabre Mort armies destroy nation after nation, leaving humanity decimated in the wake of their overwhelming terror and might. Amid the despair, a small, localized contingent crosses swords with the Mort—the Ashen Hawk Brigade. A cunning band that specializes in surprise attacks, they were once known as the Faithless Reapers and despised by the masses. Little did the public know that this very unit was about to become the only hope in resisting the Mort. Gameplay Redemption Reapers is a dark fantasy simulation game set in a medieval world. Be immersed in the tale of the desperate struggle between the Ashen Hawk Brigade and the terrifying Mort legions. With despair looming as the menacing Mort horde marches ever closer, help your small resistance defeat the enemy masses by bringing together a rich variety of character builds and a meticulous strategy. Experience the exhilaration as you rise up to overcome the odds and achieve victory! Game Features - Conquer fierce battles with tactical expertise. Get to know a small but elite force of five, and figure out how to best utilize each member's unique skills. Carefully manage limited resources, including weapons and recovery items, with an eye on the demands of impending battles. - Forge bonds with the members of the Brigade through both story and strategy. Adapt to every situation by taking advantage of all five members' unique weapons and strengths. Coordinate attacks between members who share the same attack range to join forces and take down powerful opponents! Make full use of each member's special active skills to have each member play their part on the battlefield. However different the Brigade members may seem, all are harboring heartbreak and experiences of loss. Get to know what each member has been through and how they feel to gain insight into the path ahead for the Brigade. - Be transported to a dark medieval fantasy by stunning visuals and effects. Explore a series of strategy maps depicting a doomed and decaying world ravaged by the Mort monstrosities. Be captivated by rich, fully voiced cutscenes and conversations. Resist with all your might against the omnipotent Mort forces as you embark on a journey with no hope in sight! An intense and brutal experience awaits as you put everything on the line to guide the Brigade to the end of their journey.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2139300/header.jpg?t=1677077739",
    "Price": 49.99,
    "Developers": "Adglobe",
    "Publishers": "Binary Haze Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2139300/ss_c0e31400d3ae0d502a05fb4f7894f928ea4c789f.1920x1080.jpg?t=1677077739,https://cdn.akamai.steamstatic.com/steam/apps/2139300/ss_13e63c221e8068af302aff6dc55e1c5d27baa5fd.1920x1080.jpg?t=1677077739,https://cdn.akamai.steamstatic.com/steam/apps/2139300/ss_5d3bc949a308a0d70201e94f21dc561591bf4fd8.1920x1080.jpg?t=1677077739,https://cdn.akamai.steamstatic.com/steam/apps/2139300/ss_80fe0fa510721a3f5e52ace199e29aa8ef3399b7.1920x1080.jpg?t=1677077739,https://cdn.akamai.steamstatic.com/steam/apps/2139300/ss_871c31f9ce9adbea4bb3cf8fd733fcf8116bb920.1920x1080.jpg?t=1677077739,https://cdn.akamai.steamstatic.com/steam/apps/2139300/ss_e6332525c27e1c4bc06fb364136e71a24ba7a3a0.1920x1080.jpg?t=1677077739",
    "Slug": "redemption-reapers",
    "Meta Title": "Redemption Reapers: Feb 22, 2023, Adglobe and Full Overview",
    "Meta Description": "Looking for information on Redemption Reapers? Check out the release date (Feb 22, 2023), developer insights from Adglobe, and a complete game summary.",
    "Alt Text Image": "Official header image for Redemption Reapers game - Steam 2139300",
    "Canonical URL": "https://gusku.site/game/redemption-reapers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Redemption Reapers\", \"description\": \"Looking for information on Redemption Reapers? Check out the release date (Feb 22, 2023), developer insights from Adglobe, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Adglobe\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Binary Haze Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2139300/header.jpg?t=1677077739\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}