{
    "AppID": 2266270,
    "Name": "Rhythm Taichi XR",
    "Release date": "Feb 21, 2023",
    "About the game": "Rhythm Taichi XR is a physical dancing mixed reality rhythm game that turns your smartphone into a motion camera. It is compatible with most custom songs on beatsaver, and requires no specialized hardware. It is also available as a second screen for your phone or as a standalone VR game. 3D Rhythm, reinvented Rhythm Taichi takes a fresh new approach to 3D rhythm games. Slide your fingers gracefully along the paths traced on the screen, following the beats of the music - it's like practicing Taichi with your fingers! Swipe with style, swipe with ease Rhythm Taichi is built from the ground up, optimized for touch input. A carefully crafted pathing algorithm provides a comfortable yet challenging amount of finger travel for each hand. We've also ruthlessly optimized the game's graphics and networking pipeline to ensure that the game responds quickly and smoothly to your actions. Looks good, feels good too The new touch tracking algorithm is more precise then ever - and with the innovative 'rainfall' style timing effects, you get instant feedback on your synchronization performance. Finishing a song is just the beginning - compete against players around the world by perfecting your runs and submitting your scores on the leaderboard! Thousands of supported songs Rhythm Taichi maintains compatibility with the beat saver song format, and provides an in-game integration with the beat saver API for thousands of supported songs. If you don't wish your songs to be indexed within the game, specify that in the description of your song on beatsaver and send us an email with the link. You can also download songs from beatsaver yourself and install them by using the 'import' function from within the game menu or extract directly to the following directory: C:\\Users\\[Your username]\\AppData\\LocalLow\\Tempstudio, LLC\\Rhythm Taichi\\savedsongs It's time to dance in XR Rhythm Taichi's 2.0 update features XR mode support on PC. Powered by the latest advancement in artificial intelligence and machine learning, XR mode turns your phone into a high speed motion camera, without needing any specialized hardware. If you have trouble getting started, make sure to read the manual. Virtual Reality Supported Rhythm Taichi supports desktop VR setups (on Windows). Controller phone is not required, but can be used to sign in to submit scores to the leaderboard. Adjust the in-game height with the settings on the left part of the menu if your position is uncomfortable.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2266270/header.jpg?t=1677031049",
    "Price": 0.0,
    "Developers": "Tempstudio, LLC",
    "Publishers": "Tempstudio, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2266270/ss_3bef6055c1804e2e65a40dcd8588a8f052875b99.1920x1080.jpg?t=1677031049,https://cdn.akamai.steamstatic.com/steam/apps/2266270/ss_bf6873b46e52d3d37a3f9ec2c754ed0f27f403f1.1920x1080.jpg?t=1677031049,https://cdn.akamai.steamstatic.com/steam/apps/2266270/ss_400832e0add6fd18b14e6e90ce257b9900afbf08.1920x1080.jpg?t=1677031049,https://cdn.akamai.steamstatic.com/steam/apps/2266270/ss_f68c3b0fb9f6fe6a4e9973da23ed5fb856e0bc9e.1920x1080.jpg?t=1677031049,https://cdn.akamai.steamstatic.com/steam/apps/2266270/ss_0c75fd36d76ea6736171002b6debef4dd586b452.1920x1080.jpg?t=1677031049,https://cdn.akamai.steamstatic.com/steam/apps/2266270/ss_106e111a61d31fd7ead96b2d30122ed1d461590a.1920x1080.jpg?t=1677031049,https://cdn.akamai.steamstatic.com/steam/apps/2266270/ss_88cc0675960f7e0fdb2816746bb99d9f927da3fc.1920x1080.jpg?t=1677031049",
    "Slug": "rhythm-taichi-xr",
    "Meta Title": "Rhythm Taichi XR: Feb 21, 2023, Tempstudio, LLC and Full ...",
    "Meta Description": "Looking for information on Rhythm Taichi XR? Check out the release date (Feb 21, 2023), developer insights from Tempstudio, LLC, and a complete game sum...",
    "Alt Text Image": "Official header image for Rhythm Taichi XR game - Steam 2266270",
    "Canonical URL": "https://gusku.site/game/rhythm-taichi-xr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rhythm Taichi XR\", \"description\": \"Looking for information on Rhythm Taichi XR? Check out the release date (Feb 21, 2023), developer insights from Tempstudio, LLC, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 21, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tempstudio, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tempstudio, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2266270/header.jpg?t=1677031049\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}