{
    "AppID": 2021710,
    "Name": "Sakura Succubus 7",
    "Release date": "Mar 6, 2023",
    "About the game": "This visual novel is the direct sequel to Sakura Succubus 6. After charming the sweet-natured Astorian princess, Stephania, and her maid, the serious, no-nonsense Elizabeth, Hiroki takes the pair of them on a tour of Tokyo alongside Cosmos, the cheerful e-girl, and Ayu, the grumpy idol. With a gaggle of adoring girls in tow, Hiroki visits a maid café, drinks bubble tea, and goes on a trip to a theme park. His days with Stephania pass by in a blur, each one more exciting than the last… But there’s danger afoot, as Hiroki soon realizes there’s somebody watching him from the shadows: somebody who seems to have taken an unhealthy interest in him and his harem. Who is this mysterious stranger and what do they want? Hiroki is uncertain – but, if left unchecked, this person could cause chaos the likes of which Hiroki has never before known. Stephania is the princess of Astoria: a small European country situated near Germany. Stephania is adored by her doting parents who ensured, throughout her childhood, that she never wanted for anything. Raised in a palace and tended to by droves of servants, Stephania has it all… But, despite her august upbringing, Stephania grew up lonely, without many friends. After meeting Hiroki, she soon falls in love with him, and she quickly seizes on the opportunity to visit him in Japan. This is the first time Stephania has ever left her home country, and she’s incredibly excited by everything Japan has to offer. For Stephania, this really is the trip of a lifetime. Elizabeth is Stephania’s devoted maid who would do almost anything for her lady’s sake. Elizabeth takes her duties as a maid very seriously, and there’s nothing that brings her more joy than making Stephania happy. Elizabeth might act cool and serious, but she is fiercely protective of Stephania. If anything were to happen to her young mistress, her icy exterior would surely shatter, revealing just how passionate she can truly be. Cosmos Moretti is a half-Italian, half-Japanese succubus and a popular internet personality with millions of followers on RapidPound. Cosmos is renowned for taking photographs of herself wearing skimpy clothing, but Cosmos herself is rather naïve, and she doesn’t fully understand why her photos are considered so provocative. A daydreamy airhead who lives in cloud cuckoo land, Cosmos is a romantic at heart, and she fantasizes about one day marrying Hiroki. She is very open and earnest in her affections, which makes her perfect girlfriend material. Ikue Ayu is Japan’s top idol, and she’s also a succubus. Though Ayu acts cute and sweet while performing, she can be vicious about her fans when the cameras aren’t rolling. Ayu is a hard worker who’s prone to pushing herself to improve her craft, which further exacerbates her foul moods. It’s rare she gets any time off, and being under the spotlight 24/7 exhausts her. Ayu spends so much time publicly playing a character for the sake of her fans, she finds it hard to be honest with her true feelings in private. She often snaps at Hiroki, but deep down, she loves him dearly. Secretly, she wishes she could be more openly affectionate like Cosmos, but she’s too much of a tsundere. Maybe one day she’ll learn! Yue is the queen of the succubus realm and the power she wields is second to none. Yue might not be famous in the human world, unlike Cosmos and Ayu, but the respect her subjects bequeath her helps bolster her strength. Yue, much like Cosmos and Ayu, is head over heels for Hiroki, whom she knew before her ascension to the throne, back when she lived in the human realm. Yue has a short temper and she can be rather possessive, but she’s been working to change her ways. Displeased with how clingy she used to be, she’s trying earnestly to become more open to the idea of sharing Hiroki, hard though it might be. It’s difficult to be in love with such a popular man!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2021710/header.jpg?t=1678125060",
    "Price": 7.99,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2021710/ss_0b90737b1456b922bef1eae2f77f39a6b8f7c644.1920x1080.jpg?t=1678125060,https://cdn.akamai.steamstatic.com/steam/apps/2021710/ss_7d53a67c56aeb010db34607caf55401328b29229.1920x1080.jpg?t=1678125060,https://cdn.akamai.steamstatic.com/steam/apps/2021710/ss_85d6ad30407e80b31ad48096d1075e961616499a.1920x1080.jpg?t=1678125060,https://cdn.akamai.steamstatic.com/steam/apps/2021710/ss_a680fe6412090178fe197e1bb22a6d3e82033dae.1920x1080.jpg?t=1678125060,https://cdn.akamai.steamstatic.com/steam/apps/2021710/ss_b09d4d76bf5693eeceaa530c5c3e53d9f49dbc58.1920x1080.jpg?t=1678125060,https://cdn.akamai.steamstatic.com/steam/apps/2021710/ss_7701381b27b470f52d5c35672dd8a12ef1ac5316.1920x1080.jpg?t=1678125060",
    "Slug": "sakura-succubus-7",
    "Meta Title": "Sakura Succubus 7: Mar 6, 2023, Winged Cloud and Full Ove...",
    "Meta Description": "Looking for information on Sakura Succubus 7? Check out the release date (Mar 6, 2023), developer insights from Winged Cloud, and a complete game summary.",
    "Alt Text Image": "Official header image for Sakura Succubus 7 game - Steam 2021710",
    "Canonical URL": "https://gusku.site/game/sakura-succubus-7",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura Succubus 7\", \"description\": \"Looking for information on Sakura Succubus 7? Check out the release date (Mar 6, 2023), developer insights from Winged Cloud, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 6, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2021710/header.jpg?t=1678125060\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}