{
    "AppID": 506140,
    "Name": "Shop Heroes",
    "Release date": "Aug 15, 2016",
    "About the game": "Craft legendary items, gear up your heroes for epic quests, and fight for the top of the Trade Wars and PvP Leaderboards in the original smash hit fantasy tycoon: Shop Heroes! Become a medieval fantasy tycoon! Build, trade, and craft your way to riches and fame. Recruit a team of RPG heroes to fight a dragon, quest for you, and wear your finest weapons and armor in battle. Risk your honor in PvP battles with your strongest heroes. Team up with other player merchants &amp; builders to create the greatest City in all civilization. All of this adventure and more awaits you - join the millions of players that have made Shop Heroes their phone’s design home. What’s that mysterious Relic that you can craft? It seems that the more of them we make, the more powerful they become. Fascinating.. NEW: It is said that war is the forge of empires - now, work together with your City to conquer Shop Heroes’ Trade Wars! Invest in your City’s success, craft and Contribute important items, or Dominate your rivals in a special PvP mode to earn Domination Points for your City. Climb the City Leaderboard to earn valuable rewards for everyone involved! ~~~~~~~~~ BUILD A FANTASY EMPIRE ~~~~~~~~~ ◆ INTERIOR DESIGN your dream item shop with beautiful decorations ◆ CUSTOMIZE your shopkeeper avatar with stylish outfits ◆ CRAFT powerful items to sell to adventurers and players alike ◆ ADVANCE through unique tech trees to discover incredible weapons and armor ◆ TRADE with other players to build your wealth and fame ◆ FUSE items together to unlock the rarest and most powerful equipment ~~~~~~~~~ CONQUER THE KINGDOM ~~~~~~~~~ ◆ RECRUIT and gear up a diverse cast of RPG heroes ◆ LOOT exciting treasures in Aragonia’s many quests and adventures ◆ BATTLE other players in PvP combat for wealth and glory ◆ TEAM up with friends to build a powerful and profitable City ◆ RAID massive dungeons with your City to earn exclusive loot ◆ TRADE WARS give Cities a new axis and allies to consider - will you be victorious? Regular events, updates, and new content are always happening. Meet and love Nikki and all the Shop Heroes characters! Come see what Shop Heroes has in store for you. ~~~~~~~~ SUPPORT ~~~~~~~~ Experiencing any problems? Got some suggestions? We would love to hear from you! You can reach us at for immediate assistance. A persistent network connection is required to play. PLEASE NOTE! Shop Heroes is completely free to play, but you can purchase some game items with real money. If you don’t want to use this feature, you can disable in-app purchases in your device’s settings. Use of this application is governed by the Terms of Service available at -of-service/ Collection and use of data are subject to the Privacy Policy available at -policy/ Like Us: Follow Us:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/506140/header.jpg?t=1677524453",
    "Price": 0.0,
    "Developers": "Cloudcade, Inc.",
    "Publishers": "Cloudcade, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/506140/ss_12895119a69ec46129c3e8be9e8a64631988866a.1920x1080.jpg?t=1677524453,https://cdn.akamai.steamstatic.com/steam/apps/506140/ss_cfba8618821a590bc73837dc3c28fa0c84f26da9.1920x1080.jpg?t=1677524453,https://cdn.akamai.steamstatic.com/steam/apps/506140/ss_8d1a70022d5034491596694456246b53e3c6c953.1920x1080.jpg?t=1677524453,https://cdn.akamai.steamstatic.com/steam/apps/506140/ss_18b4b3ec313185dd7ad50dc3d8d47e333c0991fa.1920x1080.jpg?t=1677524453,https://cdn.akamai.steamstatic.com/steam/apps/506140/ss_ce4d16b7541cc336f0f96e3f861ac0c2e3c08898.1920x1080.jpg?t=1677524453,https://cdn.akamai.steamstatic.com/steam/apps/506140/ss_76f5fe7f9c392f097a6edc9c7dd0ce197615077d.1920x1080.jpg?t=1677524453",
    "Slug": "shop-heroes",
    "Meta Title": "Shop Heroes: Aug 15, 2016, Cloudcade, Inc. and Full Overview",
    "Meta Description": "Looking for information on Shop Heroes? Check out the release date (Aug 15, 2016), developer insights from Cloudcade, Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for Shop Heroes game - Steam 506140",
    "Canonical URL": "https://gusku.site/game/shop-heroes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shop Heroes\", \"description\": \"Looking for information on Shop Heroes? Check out the release date (Aug 15, 2016), developer insights from Cloudcade, Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 15, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cloudcade, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cloudcade, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/506140/header.jpg?t=1677524453\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}