{
    "AppID": 2211840,
    "Name": "Stellar Sovereigns",
    "Release date": "Mar 8, 2023",
    "About the game": "Stellar Sovereigns is a 4X space strategy game with turn based empire management and real time strategic combat set in a procedurally generated customizable 3D star cluster. You will explore solar systems, mine their mineral rich asteroid fields, establish colonies on discovered worlds, build your defences and connect them to civilization via trade routes. The colonies of the empire will grow under your guidance from mere settlements into bustling mega cities as you finance their development and ensure security to gain their approval. You will fight your enemies in epic real time tactical battles with a diverse fleet of capital and escort class vessels each fitted to your design with unique technologies and weapons. You will need your space forces, orbital and ground defences to protect your domain from rival empires and menaces forces like pirate, sectoid and machine ai fleets that roam the stars. You can build shipyards and stations in your systems, to mine and gain research bonuses as well as static defences like orbital weapon platforms to protect them. Empire management in Stellar Sovereigns is all about its population of which size and approval directly affects its wealth, military, industry and its political power. Population growth dependent on the empire's ability to cater for their needs, while effected by environmental, social and political factors. The player can finance the development of colonies to accommodate the needs of its population or can delegate its development to one of four governor types with a set budget. To effect growth the player can set taxes and tariffs or use its political resources to apply stimulus, propaganda and subsidies as well as invest into technologies and empire traits. Empire Traits is a levelling system, in which the player gets to decide which aspects of the empire to strengthen. The empire gains points in various quantities when accomplishing certain tasks and gets to spend those points on levelling up traits. Each trait has a political association, the spent points totalled then plotted onto a political spectrum graph, placing the empire into the range of various governance types to choose from. The residents of colonies will slowly convert into pioneers, a subset of the population that is willing and happy to start a new on another world. These pioneers can be transported in Ark vessels along the necessary materials to discovered worlds to establish new colonies. The player can establish trade routes for domestic and foreign commerce of produced goods as well as for the transfer of resources between colonies. Trade goods are the secondary output of colonial industries and their volume dependent on available planetary resources. Goods produced in one system can be shipped and sold in another system via trade routes on board of freighters constructed and assigned by the player. Trade routes are also an essential part of the empire's logistics, connecting systems in a chain allowing the transfer of resources between any two system within the chain. Resources transferred can be necessities like food for starving colonies or luxuries to improve approval rating. Piracy The freighters of a trade route can be intercepted, destroyed and looted by pirates or rival empires. Fleets can be sent to the midway point of a route or to connected systems and passing by freighters will be intercepted unless countered by defending forces. Stellar Sovereigns has a global Exchange market for purchasing and selling resources. The market price of resources fluctuates based of the empires' demand for those resources. Space Combat in Stellar Sovereigns is played in real time with control over every aspect of its vessels, from subsystems, weapons, repairs, abilities and targeting. The level of control however is up to the player, all these aspects can be delegated to automation options on a vessel by vessel case offering a flexible system for the player. Key Features: Simulated Projectiles that are avoidable, beams that misalign, missiles that miss target. Location based impact damage that can hit individual ship section &amp; turrets. Jamming and Interception Countermeasures. Subsystem power management of Shield, Sensor, Engine and ECM. Repair crew management of damaged ship sections to repair breaches and restore turrets. Line of Sight sensor system based of Power Signature threshold. Turreted or Directional, Guided or Unguided Weaponry and Abilities. Turret and Section targeting to disable Turrets and to target weakened Hulls. Degrade Damages with persistent debuffs until repaired at a shipyard. Duration &amp; Reinforcement: Battles in Stellar Sovereigns have a limited duration, dependent on the percentage of movement execution phase the battle was triggered at. During the movement phase of turn execution fleets can converge on any location triggering a battle upon enemy contact and subsequent fleets that arrive will join the battle in the order and at a relative time from when the battle started. Battles can take up to multiple turns persisting from turn to turn, allowing for strategic decision making in between turns. Salvaging: The result of battles is often the destruction of vessels, which leaves wreckages behind that can be salvaged recovering resources and even technology. Vessels in Stellar Sovereigns are not strictly designed but rather come with their default loadout and can be retrofitted and outfitted with new weapons, modules and alike. Retrofitting allows the player to tune each vessel to their liking and ensures longevity of the vessels, since they can always be refitted with the latest technologies. Test Arena: The player can test vessels in a simulated environment against weapon platforms and menace ships, trying out different tactics to see how the vessels perform. Stellar Sovereign's tech forest has 22 tech trees one for each of its various game features and weapon types. Researching has a cost that can be offset by the accumulation of research bonuses, its pace can be rushed risking setbacks but Eureka moments can instantly complete it. The player can simultaneously research multiple technologies, limited only by its budget. Diplomatic opportunities in Stellar Sovereigns are available based of the relation indicated on the relationship Scala between two empires. One end of the Scala leads to hostilities culminating in declaration of war, while the other end offers the ultimate diplomatic solution a joint victory pact. Relation changes over time based of political compatibility meaning governances on the same political axis are more compatible, their commonality brings them closer. Diplomatic events offer opportunities to purposefully effect relations based of the chosen response, agree or decline, praise or condemn takes the relation in different directions. Other factors like border friction, interceptions or piracy will degreed relations, while gifts and offers of treaties will strengthen it, if the other empire doesn't condemns your advances. Fighting unfriendly forces in neutral territory is allowed if not prohibited by pact or truce, however assault on any rival system can only be conducted after formally declaring war.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2211840/header.jpg?t=1678598542",
    "Price": 24.99,
    "Developers": "Imagined Reality",
    "Publishers": "Imagined Reality",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_de5358120dac2130e133043e7bb0079ce133f874.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_29796d508675a60a6c1c389ddcc0781ce9cf72ea.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_2f78d982e3fd30d6beef9a1da8102a5f8717fec9.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_c4aed1ea6192544e98e5ce43055b8265e56186e2.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_490df930066a1376bbf1a5fcee3cbc57b1912362.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_52e1a83b3678d75bdedaccda4b11369bf1f0cd11.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_fa2d9d485a042658896b754893eb8bd2c2aadbbf.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_50a7344cf9fde3ac6845a7526beb8c99b17bc776.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_363ca5566b3f29e75f74ac407b13f33f1c4bfa48.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_74aba0641cd5a06da5390a8e64000c4491936418.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_f872bff8811849993e1493b222a288792e47fc11.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_c778f1467570580990bea1d872a1a0552a9b8f93.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_9c5869b994a83459de46c59434c1c1cab16b89ec.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_17aa620c273f0fcda6373c76632f982c7ff733ec.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_e66b949a12cd850eb0a113570489c5ace8da8df2.1920x1080.jpg?t=1678598542,https://cdn.akamai.steamstatic.com/steam/apps/2211840/ss_10880cf86d54fcafb9f17c2333fc501d2888eb32.1920x1080.jpg?t=1678598542",
    "Slug": "stellar-sovereigns",
    "Meta Title": "Stellar Sovereigns: Mar 8, 2023, Imagined Reality and Ful...",
    "Meta Description": "Looking for information on Stellar Sovereigns? Check out the release date (Mar 8, 2023), developer insights from Imagined Reality, and a complete game s...",
    "Alt Text Image": "Official header image for Stellar Sovereigns game - Steam 2211840",
    "Canonical URL": "https://gusku.site/game/stellar-sovereigns",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Stellar Sovereigns\", \"description\": \"Looking for information on Stellar Sovereigns? Check out the release date (Mar 8, 2023), developer insights from Imagined Reality, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 8, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Imagined Reality\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Imagined Reality\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2211840/header.jpg?t=1678598542\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}