{
    "AppID": 1068460,
    "Name": "Stuffo the Puzzle Bot",
    "Release date": "Mar 2, 2023",
    "About the game": "Stuffo is the last remaining puzzle bot stuck in a world filled with bite-sized brain-teasers. Help Stuffo to solve the mind-bending puzzles by using various blocks to climb, push and teleport your way to the exit. Key Features Approachable yet smart puzzle gameplay. A laid-back experience that challenges your brain, not your reflexes. Chill out to the deep downtempo beats and ambient atmosphere of the original soundtrack. No story whatsoever but loads of vibes! 65 levels with more to come after release. About the Developer Hapatus is the creative outlet for solo projects of Antti Tiihonen. He is one of the masterminds behind Legend of Grimrock -series of dungeon crawling RPGs where he created tons of puzzles, levels, game design, audio and graphics as a warmup excercise for Stuffo ;). He has also worked on titles such as Noita, Control, Alan Wake and Druidstone. Accessibility Information Controls and mobility The game does not require quick inputs or fast reaction times and can be played at any pace. The controls are simple. Core gameplay uses direction input (four directions) and an action button. The game does not require multiple simultaneous inputs. Controls for keyboard and game controller can be remapped. An alternative input method for mouse or touch screen can also be used. Cognitive Text is minimally used and beyond a few tutorial prints the core gameplay requires no reading. Stuffo is a puzzle game designed to be logically challenging. The game does not offer different skill settings. Vision The graphics are large in scale. The clarity can be further increased by disabling various decorative elements and effects from the settings. The game does not use screen shake and quick camera movements are rare. Large flashing lights are not used. Quick fade outs are used on transitions but they can be toggled off in the settings. Some gameplay information is conveyed with hue and value of colors. The palette cannot be customized but is compatible with red-green color blindness. The game is playable with total color blindness although some of the convenience of color coding is lost. Supports playing in a window or full screen. Aspect ratio can be freely chosen. The view can be zoomed in and out. Hearing The game doesn't feature speech and audio is not needed for playing the game. For a more detailed description of the game's accessibility see +the+Puzzle+Bot",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1068460/header.jpg?t=1677769107",
    "Price": 7.99,
    "Developers": "Hapatus Ltd",
    "Publishers": "Hapatus Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1068460/ss_dea364944aa1588374240f5091011247ad32125a.1920x1080.jpg?t=1677769107,https://cdn.akamai.steamstatic.com/steam/apps/1068460/ss_98753d0ce88f0a62a0b03c395c2606c937e35725.1920x1080.jpg?t=1677769107,https://cdn.akamai.steamstatic.com/steam/apps/1068460/ss_0481de27dfb46603395b48336204e1915b4c21aa.1920x1080.jpg?t=1677769107,https://cdn.akamai.steamstatic.com/steam/apps/1068460/ss_1cbc46b8d6141f0517e84c4fd697e748670a220f.1920x1080.jpg?t=1677769107,https://cdn.akamai.steamstatic.com/steam/apps/1068460/ss_34ab2a77331403c02f8efa3353de83ad9cae2fb6.1920x1080.jpg?t=1677769107,https://cdn.akamai.steamstatic.com/steam/apps/1068460/ss_566d61cff092aa303c5a977960d1163c65005ff8.1920x1080.jpg?t=1677769107",
    "Slug": "stuffo-the-puzzle-bot",
    "Meta Title": "Stuffo the Puzzle Bot: Mar 2, 2023, Hapatus Ltd and Full ...",
    "Meta Description": "Looking for information on Stuffo the Puzzle Bot? Check out the release date (Mar 2, 2023), developer insights from Hapatus Ltd, and a complete game sum...",
    "Alt Text Image": "Official header image for Stuffo the Puzzle Bot game - Steam 1068460",
    "Canonical URL": "https://gusku.site/game/stuffo-the-puzzle-bot",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Stuffo the Puzzle Bot\", \"description\": \"Looking for information on Stuffo the Puzzle Bot? Check out the release date (Mar 2, 2023), developer insights from Hapatus Ltd, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 2, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hapatus Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hapatus Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1068460/header.jpg?t=1677769107\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}