{
    "AppID": 2194940,
    "Name": "Takenoko - Tilt Five AR",
    "Release date": "Feb 28, 2023",
    "About the game": "Can you satisfy the adorable oversized bamboo eating machine that is the sacred panda? Watch the gardens come to holographic life in Takenoko: Tilt Five AR! Experience the plots rise and fall around the board, the water flow from the pond, and the weather rumble and rain directly in front of your very eyes. Adapted from the acclaimed board game, Takenoko, by Antoine Bauza, the Tilt Five version will satiate players who are hungry for a new and exciting way to play this classic. *Actual gameplay recorded with MixCast mixed-reality streaming software Plant, irrigate, and grow bamboo to compete for the complicated task of caring for the Japanese Emperor's sacred– and greedy – panda. Only the gardener with the very best plots of bamboo will be able to appease the voracious appetite of this picky animal. Plant a bamboo forest around the Emperor’s pond. Cultivate and irrigate your plots to grow all the types of bamboo the panda loves. To beat your rival gardeners, make improvements to your plots: build irrigation channels or add fertilizer to accelerate the growth of your bamboo… and pray that the weather is favorable! The player who completes the most objectives wins the game. Only one gardener can win the Emperor’s favor… So grab a rake! *Takenoko: Tilt Five AR requires a Tilt Five system. See system requirements for more information. Experience holographic gameplay and watch the gameboard, gardener, and the picky panda come to life with mind-blowing 3D graphics, right on your table! Simple and tactical gameplay adapted from the acclaimed board game, Takenoko, by Antoine Bauza. Play in single-player mode against the computer or your friends and the rest of the world in local or online multi-player! Quick tutorial to help onboard new players and those who need a refresher. The Tilt Five™ holographic gaming system transforms video games into 3D vibrant holographic environments directly on your tabletop. Using the Tilt Five™ augmented reality (AR) glasses, Gameboard, and Wand controller, you can immerse yourself--and friends--in experiences like never before. Share and enjoy holograms together locally, remotely, or even stream them to your favorite social platforms using MixCast mixed-reality capture software. Visit Tilt Five's website to find out more and to order your Tilt Five system! Experience Takenoko in full holographic 3D today!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2194940/header.jpg?t=1677711820",
    "Price": 16.99,
    "Developers": "Blazing Griffin",
    "Publishers": "Tilt Five Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2194940/ss_8344e0c18f171c2a75830e4d2184e64b75cec714.1920x1080.jpg?t=1677711820,https://cdn.akamai.steamstatic.com/steam/apps/2194940/ss_c5bdea6db88f20a6b04cf23b8475b88b8280b01d.1920x1080.jpg?t=1677711820,https://cdn.akamai.steamstatic.com/steam/apps/2194940/ss_34561a447d63b3e78a67cd3ca4f3d8592490e562.1920x1080.jpg?t=1677711820,https://cdn.akamai.steamstatic.com/steam/apps/2194940/ss_53aa0e2539f648a28c8fc4863121f371ee2fe629.1920x1080.jpg?t=1677711820,https://cdn.akamai.steamstatic.com/steam/apps/2194940/ss_e38afafbdd873cfb0ca590c110e8a736e764a62a.1920x1080.jpg?t=1677711820,https://cdn.akamai.steamstatic.com/steam/apps/2194940/ss_312582592bf7627ee16246c13174e9b374e1873d.1920x1080.jpg?t=1677711820,https://cdn.akamai.steamstatic.com/steam/apps/2194940/ss_8e040bb48bb5a1b0570d991d7a6354097f571771.1920x1080.jpg?t=1677711820",
    "Slug": "takenoko-tilt-five-ar",
    "Meta Title": "Takenoko - Tilt Five AR: Feb 28, 2023, Blazing Griffin an...",
    "Meta Description": "Looking for information on Takenoko - Tilt Five AR? Check out the release date (Feb 28, 2023), developer insights from Blazing Griffin, and a complete g...",
    "Alt Text Image": "Official header image for Takenoko - Tilt Five AR game - Steam 2194940",
    "Canonical URL": "https://gusku.site/game/takenoko-tilt-five-ar",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Takenoko - Tilt Five AR\", \"description\": \"Looking for information on Takenoko - Tilt Five AR? Check out the release date (Feb 28, 2023), developer insights from Blazing Griffin, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 28, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blazing Griffin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tilt Five Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2194940/header.jpg?t=1677711820\", \"offers\": {\"@type\": \"Offer\", \"price\": 16.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}