{
    "AppID": 1630440,
    "Name": "The Hero Journey in Yggdrasil",
    "Release date": "Mar 18, 2023",
    "About the game": "VR The Hero's Journey The Hero's Journey, also known as the mono myth or hero's adventure, is a term for a pattern that occurs in many mythological stories. The phenomenon is described by Joseph Campbell where the main character goes through different phases. During a hero's journey, you leave the known world and go on an adventure, only to return with new knowledge, insight and power! Hjälteskolan's VR game 'The Hero's Journey', is structured according to Campbell's phases, and is also based on exciting figures and environments from Nordic Mythology! Intro to the whole game: The VR game begins in a modern-day classroom. The teacher has just taught the class Nordic Mythology. It calls for a break and fighting and rudeness are heard in the room. The player sits in the middle of the classroom and lingers, dreaming away into the world of fantasy. The Fenriswolf, the wolf enters the room and Eddan; the book on the class bench about Norse mythology, gets bigger and bigger so that the player eventually falls into the book. The fall continues down into Yggdrasil's inner tree trunk where Odin, the Firefall and the Norns reside. Odin's voice warns of doom: You must win the world again, the forces of chaos retreat, a new green peaceful world will arise again. Go from hot to cold. The Norns ask: Who are you? What do you want? How do you want to live? What do you choose? At the bottom of Yggdrasil, the wolf returns and the other Old Norse gods come to life, Völvan's cry echoes in the walls. The player then enters a hall of mirrors and can choose one of three mirrors to challenge their fears: Mirror 1: Here the player is taken to a world where the task is to climb Yggdrasil with the squirrel Ratatosk and fight against nonsense and mean tongues and fight for good words and thoughts. Ratatosk the Squirrel: Do you want to challenge the fear? Challenge the height? Follow the smooth upward path of the bark? Ila high up in the treetops? Mirror 2: Here the player travels to a poisoned environment where the eagle Hräsvelg guards and the player injects vitality into the withered trees so that they start to green again. The eagle Hräsvelg: Do you want to create? Change? Recreate the world? Mirror 3 Here, the player is taken to the caves and roots of Yggdrasil and fights against the dragon snake along with the Bärsärk and frees the wild animals trapped in the underworld. Berserken: Do you have the courage to face evil? Courage to defeat evil and fight for good! In all worlds, the hero's reward is to fly back to the classroom on the rainbow Bifrost. The player can choose to go through the entire game OR to select one part in the hub (R). In the hub there are choices 1,2,3 where the player chooses the worlds mentioned above( the mirrors). The HUB is suitable for simpler headsets as the whole game will be too heavy for the computer otherwise. Sound recording: Ludvig Sersam Voice actors; Oliver Lindman, Susanna Zantrac, Zeljko Santrac, Lisbeth Hagerman. The Hero School aims to use the tools of performing arts to inspire its participants to become heroes in their own lives. We work with a combination of interactive workshops and experiences in Virtual Reality (VR), which creates a playful and exciting platform, where we move around issues of heroism and civil courage. The design has taken place in close collaboration with the target group, which consists of young people and young adults (12-25 years) as well as adults with functional variations. The Hero School model is based on three phases: departure, inauguration and return. We let the participants describe their usual, 'known' world, and then enter a new and unknown world via the departure. This world constitutes the initiation, and consists of exercises and experiences of various kinds. In the end, there is a movement back to the known world – the return – but the participants are now enriched with newfound knowledge, insight and power! FINANSIERAT AV ARVSFONDEN",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1630440/header.jpg?t=1679126579",
    "Price": 0.0,
    "Developers": "VirtualRehabArt4Health,Hjälteskolan,Kreativitetsbanken  VR design Åsa Egnér, Musiker kompositör Jonatan Sersam, Programmerare Johnny Nyman, Jojk sång Anna Fält,Carolina Ask",
    "Publishers": "VirtualRehabArt4Health",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1630440/ss_f07d0f6dad9f1c41413dc9d0490732cbd2d87941.1920x1080.jpg?t=1679126579,https://cdn.akamai.steamstatic.com/steam/apps/1630440/ss_ccf9f58f5ab1500df2be44bcbc55874aed60d83f.1920x1080.jpg?t=1679126579,https://cdn.akamai.steamstatic.com/steam/apps/1630440/ss_3d177f3a8b88693524155abe4b6015b6e4c5b295.1920x1080.jpg?t=1679126579,https://cdn.akamai.steamstatic.com/steam/apps/1630440/ss_263655c5d001f16e2c1043255c49a81dbdaa52cb.1920x1080.jpg?t=1679126579,https://cdn.akamai.steamstatic.com/steam/apps/1630440/ss_df670d90c4e2fda1bc62701317f42e6076e5c9c4.1920x1080.jpg?t=1679126579",
    "Slug": "the-hero-journey-in-yggdrasil",
    "Meta Title": "The Hero Journey in Yggdrasil: Mar 18, 2023, VirtualRehab...",
    "Meta Description": "Looking for information on The Hero Journey in Yggdrasil? Check out the release date (Mar 18, 2023), developer insights from VirtualRehabArt4Health,Hjäl...",
    "Alt Text Image": "Official header image for The Hero Journey in Yggdrasil game - Steam 1630440",
    "Canonical URL": "https://gusku.site/game/the-hero-journey-in-yggdrasil",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Hero Journey in Yggdrasil\", \"description\": \"Looking for information on The Hero Journey in Yggdrasil? Check out the release date (Mar 18, 2023), developer insights from VirtualRehabArt4Health,Hj\\u00e4l...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 18, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"VirtualRehabArt4Health,Hj\\u00e4lteskolan,Kreativitetsbanken  VR design \\u00c5sa Egn\\u00e9r, Musiker komposit\\u00f6r Jonatan Sersam, Programmerare Johnny Nyman, Jojk s\\u00e5ng Anna F\\u00e4lt,Carolina Ask\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VirtualRehabArt4Health\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1630440/header.jpg?t=1679126579\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}