{
    "AppID": 2350480,
    "Name": "The Viriditas Chapel of Perpetual Adoration",
    "Release date": "Mar 13, 2023",
    "About the game": "The Viriditas Chapel of Perpetual Adoration is a virtual reality inspired by visions and music of Saint Hildegard von Bingen, a 14th century abbess and Doctor of the Catholic Church. It is situated in the northern apsidal chapel of Cathedral-in-the-Clouds, an ongoing collection of digital dioramas for contemplation. When the player kneels down to pray, an audio-visual spectacle unfolds, expressing the beauty of creation and the love of God. Only to end in silent contemplation of the Most Holy Eucharist. What was visible and audible before has now been internalized in your heart, aflame in adoration, awe and endless gratitude. Hildegard Von Bingen Hildegard von Bingen was an 12th century abbess in the valley of the Rhine in present day Germany. She was a mystic, a scientist, a composer and a writer. In 2012 she was declared Doctor of the Church, among luminaries such as Theresa of Avila, Thomas Aquinas and Augustine of Hippo. Viriditas is a guiding concept in her thinking. It expresses the vital power of nature, specifically of plants. Within this context, she imagined Jesus Christ to be a flower that blooms on the branch that is the Holy Virgin. It is this idea, combined with her vision of the cosmos in an eternal embrace of the divine, that inspired the Viriditas Chapel. O greenest branch whose breath inspires the wonder of saints. Hail! When you bloom in your branches the heat of the sun flows from you like ointment. In you a beautiful flower blossomed whose fragrance awakened all that was withered. And all emerged in full vigor! Design The structure of The Viriditas Chapel of Perpetual Adoration is based on Hildegard’s visions of the cosmos. In these she would see a geocentric universe embraced by the love of God and animated by the winds of faith and trust. In the Viriditas Chapel this embrace is performed by the Holy Virgin. We find the sphere of fire in the two outer columns and the sphere of water in the inner columns. The central altar piece represents the earth. In another vision, as expressed in multiple poems, Hildegard saw Jesus as a flower on the branch that is the virgin Mary, His mother. This is a variation on the more conventional notion of Jesus being the fruit of her womb. Here both images are combined. The altar bulges slightly forward to represent to belly of the virgin in which the son of God grows. In the opening of what started as a dark niche, ornamental leaves appear in ever greater numbers. This to illustrate what Hildegard referred to as viridity, or the abundant greening power of life on earth. Within that green oasis, a magical flower blooms, the heart of creation, the promise of redemption, love itself. Credits art By Michaël Samyn music By Hildegard Von Bingen Hildegard Von Bingen’s “O viridissima virga ave” as sung by Stevie Wishart’s ensemble Sinfonye in Douai Abbey, England. Recorded by Jim Denley. Producer: Stevie Wishart. Digital Remastering Engineer: Simon Heyworth 2022. copyright © stevie wishart Viola da gamba by Michaël Samyn Additional sounds by Kris Force and mediapaja2009 3D modeling by Michaël Samyn Patrons are Maja Kuzmanovic &amp; Nik Gaffney",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2350480/header.jpg?t=1678693070",
    "Price": 4.99,
    "Developers": "Michael Samyn",
    "Publishers": "Song of Songs,Liminous Editions,Tale of Tales",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2350480/ss_329b6fa6dde925c84b4ed99d5babad9d136ab8a2.1920x1080.jpg?t=1678693070,https://cdn.akamai.steamstatic.com/steam/apps/2350480/ss_fce717289906c3a03f31c675b7e1b0d0cebe0136.1920x1080.jpg?t=1678693070,https://cdn.akamai.steamstatic.com/steam/apps/2350480/ss_f36341879931746ebd64ce1022e9612a78ba49ba.1920x1080.jpg?t=1678693070,https://cdn.akamai.steamstatic.com/steam/apps/2350480/ss_615574b6519ea8943033b01ca647e6c86fe32f28.1920x1080.jpg?t=1678693070,https://cdn.akamai.steamstatic.com/steam/apps/2350480/ss_470c48518d90ee75a98fe643dfbc293196245482.1920x1080.jpg?t=1678693070",
    "Slug": "the-viriditas-chapel-of-perpetual-adoration",
    "Meta Title": "The Viriditas Chapel of Perpetual Adoration: Mar 13, 2023...",
    "Meta Description": "Looking for information on The Viriditas Chapel of Perpetual Adoration? Check out the release date (Mar 13, 2023), developer insights from Michael Samyn...",
    "Alt Text Image": "Official header image for The Viriditas Chapel of Perpetual Adoration game - Steam 2350480",
    "Canonical URL": "https://gusku.site/game/the-viriditas-chapel-of-perpetual-adoration",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Viriditas Chapel of Perpetual Adoration\", \"description\": \"Looking for information on The Viriditas Chapel of Perpetual Adoration? Check out the release date (Mar 13, 2023), developer insights from Michael Samyn...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 13, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Michael Samyn\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Song of Songs,Liminous Editions,Tale of Tales\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2350480/header.jpg?t=1678693070\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}