{
    "AppID": 2252940,
    "Name": "Up To Clouds",
    "Release date": "Mar 7, 2023",
    "About the game": "Do you remember the story of the boy who took magic seeds and grew beans that reached to the sky? Well, this is not that story, although it bears an uncanny resemblance to it. Unfortunately, there are no giants at the top of the vine, and no geese laying golden eggs, but monsters who are desperate to get down and take over the earth. And who rules the world above the clouds? Who must you defeat to save your home? Find out for yourself! Protect the vine with traps and weapons, defeat the bosses and become the saviour of the land! After climbing the tendril, we can see in the world above the clouds that at intervals different monsters try to get down to the ground to destroy our village. Monsters start in random groups. The monsters come in waves and try to get down the tendril for a longer or shorter time, during which we have to prevent the monsters from getting down it. The first step is to get to know our opponents. This is called 'Next Wave Attackers' can be seen on page. Here we can learn about the enemy's weakness and what kind of damage it is resistant to. You can see how many points you get for defeating a monster. A maximum of four different teams can attack at the same time. The second step is to find out where the monsters are coming to the tendril. For this we need to find our way on the map. On the map, we can select the attackers and see the route they take to reach the end. If we observe well, we can also see which traps they pass through, so it is worth building traps in these places. It is important that the damage of the traps is different, so build a trap that does the most damage to the monsters passing through. e.g. Lizardmen are most damaged by lightning, so it is worth placing such a trap along their route. Of course, we can fight the attackers ourselves. For this, we can use the weapons and armor dropped by the monsters, and we can also find special weapons in the various treasure chests. There are five types of weapons: Weapon and Shield Two Handed Weapon Dual Weapon Bow Wand There are twenty-two weapons in the game. There are five types of armor: Helmet Shoulder guard Armor Glove Boots There are nine armor sets available in the game. The game contains seven types of traps. Gold found in chests and dropped by monsters plays a big role in the game. You can use gold to build and upgrade traps. You can open special chests for gold. (Uncommon Chest, Rare Chest, Epic Chest) You can use gold to repair your equipment as it gets damaged during battles. (Forge) You can also see the status of your weapon and armor. You'll also need gold to enchant your weapons. e.g. If you want your bow to have fire damage, you can do that. (Enchanting Shop) If the monsters get down the vine, our village will suffer. Six cottages indicate the state of the village. Each downed creature damages one house. If all houses are destroyed, it's game over. If there is a boss fight, then along with the loss of life, we also lose a cottage, so you have to be very clever so that the game doesn't end too soon. Of course, you have the option to rebuild the houses for gold. Your character has combat values ​​that change with leveling and the use of weapons and armor. (Defense, Attack, Damage, Vitality, Mana, Experience point, Level) If you die, you go to the graveyard away from the tendril. During the game, you get points for defeating creatures and successfully completing waves, which you can use to fight your way up the leaderboard. You can get to the top of the charts with the number of gold and the number of defeated creatures. Protect your village, don't let the monsters climb down the sky-high beans. Buy traps and upgrade them to the highest level. Wear the strongest armor and always use the right weapon to defeat the enemy.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2252940/header.jpg?t=1678189841",
    "Price": 6.39,
    "Developers": "Bela Magyar",
    "Publishers": "Undead Factory",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2252940/ss_d8b322b957f5b0125e9a41091f95ee12a3409612.1920x1080.jpg?t=1678189841,https://cdn.akamai.steamstatic.com/steam/apps/2252940/ss_70b17f360931a4aad4bfaeab095a5e6f3c1b31e6.1920x1080.jpg?t=1678189841,https://cdn.akamai.steamstatic.com/steam/apps/2252940/ss_3f0596dc6cf6e8982b50ad8b3c41a88c1582f9ef.1920x1080.jpg?t=1678189841,https://cdn.akamai.steamstatic.com/steam/apps/2252940/ss_f3c3393278a0e00e889eadc631eed9c952982f71.1920x1080.jpg?t=1678189841,https://cdn.akamai.steamstatic.com/steam/apps/2252940/ss_01dc7c3f43d5164580cf45a70e5dc1095ca5ee1b.1920x1080.jpg?t=1678189841,https://cdn.akamai.steamstatic.com/steam/apps/2252940/ss_f07bcee9dd6eb898504488aadde0a7b666121d81.1920x1080.jpg?t=1678189841,https://cdn.akamai.steamstatic.com/steam/apps/2252940/ss_d8b720f6f16a50d5c806756a056d4c7889ffac86.1920x1080.jpg?t=1678189841",
    "Slug": "up-to-clouds",
    "Meta Title": "Up To Clouds: Mar 7, 2023, Bela Magyar and Full Overview",
    "Meta Description": "Looking for information on Up To Clouds? Check out the release date (Mar 7, 2023), developer insights from Bela Magyar, and a complete game summary.",
    "Alt Text Image": "Official header image for Up To Clouds game - Steam 2252940",
    "Canonical URL": "https://gusku.site/game/up-to-clouds",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Up To Clouds\", \"description\": \"Looking for information on Up To Clouds? Check out the release date (Mar 7, 2023), developer insights from Bela Magyar, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 7, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bela Magyar\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Undead Factory\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2252940/header.jpg?t=1678189841\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}