{
    "AppID": 2210500,
    "Name": "VetVR Veterinary Simulator",
    "Release date": "Mar 6, 2023",
    "About the game": "This is an Early Access version of 'VetVR Veterinary Simulator' being developed by a small but passionate indie studio led by real veterinarians. We're developing this game in association with the Colorado State University Veterinary Teaching Hospital and are excited to incorporate your feedback into the final game. Tell us what you think in our Community Hub ! You got hired straight out of vet school. Your new employer recognized your talent and love for animals, so they've chosen you to help them launch their brand-new vet clinic! Show them everything you’ve learned by providing gold star care to a variety of tailed and scaled clients. Diagnose and treat complex medical conditions, mysterious injuries, and emergency scenarios! Determine what is wrong with your patient based on the animal’s behavior, medical reports, and real-world data such as x-rays and blood tests. Find the right treatments and remember that each decision will positively or negatively impact your patient. Brush up on all your veterinary fundamentals by playing through numerous training levels created by real-life DVM, MSc, PhD Veterinarians. Grow your confidence as a veterinarian regardless of previous knowledge levels and practice making split-second decisions that affect the life or death of your animal patient. Practice using tools, requesting tests, reading charts, and administering drugs to treat and heal animals in various levels of need. Each patient will require real veterinary logic and test your skills. When mistakes are made, rest easy knowing you can restart a scenario at any time. As you successfully complete both high and low-intensity scenarios, don’t forget to look around. You might be surprised by what you find. Discover fun Easter eggs, unlock hidden games, and be rewarded with new and exotic animal cases. Between saving lives, take some time to relax in the lobby and play fetch with the clinic mascot, Bruce. Be careful letting him around the snack bar though, he has a reputation for stealing anything with a carb in it. As you successfully treat everything from minor wounds to unidentified patient illnesses, you will find that your work is really having an impact. Customers are talking about the clinic and even recommending it to others. They’re especially fond of your care for their pets and it seems like the harder you work, the more your clinic’s reputation grows. Get rewarded by unlocking new and exciting scenarios! Did someone say the local zoo was looking for more vets in the area to work with? I guess we’ll find out!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2210500/header.jpg?t=1678138898",
    "Price": 17.99,
    "Developers": "Liekos Studio",
    "Publishers": "Liekos Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2210500/ss_0e5171c64c472e1f1fd4d4d9ae98f159a74f5e09.1920x1080.jpg?t=1678138898,https://cdn.akamai.steamstatic.com/steam/apps/2210500/ss_cfd9eefa544742c61036b5d6ec0fa1d07e4d4eb4.1920x1080.jpg?t=1678138898,https://cdn.akamai.steamstatic.com/steam/apps/2210500/ss_4cb559450d910bcb60fc568129e0fffc39403e97.1920x1080.jpg?t=1678138898,https://cdn.akamai.steamstatic.com/steam/apps/2210500/ss_f6a49a61267274ebda3534b95ba1f322234d25fd.1920x1080.jpg?t=1678138898,https://cdn.akamai.steamstatic.com/steam/apps/2210500/ss_accc8be5d4b2d69ce909835a3ffdf1c8def35663.1920x1080.jpg?t=1678138898",
    "Slug": "vetvr-veterinary-simulator",
    "Meta Title": "VetVR Veterinary Simulator: Mar 6, 2023, Liekos Studio an...",
    "Meta Description": "Looking for information on VetVR Veterinary Simulator? Check out the release date (Mar 6, 2023), developer insights from Liekos Studio, and a complete g...",
    "Alt Text Image": "Official header image for VetVR Veterinary Simulator game - Steam 2210500",
    "Canonical URL": "https://gusku.site/game/vetvr-veterinary-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VetVR Veterinary Simulator\", \"description\": \"Looking for information on VetVR Veterinary Simulator? Check out the release date (Mar 6, 2023), developer insights from Liekos Studio, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 6, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Liekos Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Liekos Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2210500/header.jpg?t=1678138898\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}