{
    "AppID": 2257640,
    "Name": "Virtual Chemistry Lab",
    "Release date": "Feb 27, 2023",
    "About the game": "Virtual Chemistry Lab is a ' Serious Game ' type game, so the game is made for educational purposes. It is intended to enable students to understand the high school chemistry curriculum and to provide equal opportunities. You can use it anywhere and anytime in your schools and classes. The scope of the virtual lab covers experiments within the framework of the entire high school chemistry curriculum. It allows you to experiment in electronic environment and gain experience of learning by doing, some experiments give you a chance to make mistakes, thus allowing you to ask questions and do trial and error. My aim is to produce solutions where the possibilities offered by technologies such as VR, which are expensive for most countries, can be reached by wider audiences such as keyboards and mouse. The Laboratory has 2 different sections. - 1. There is the part where the more traditional click and experiment processes move, which we call 'point and click'. In this section, there are 7 different interactive experiments and sections where you can read the names of the materials. - 2. It's a section that includes 'physics-based interactions', offering a more realistic and near-VR experience. Here you can set up 6 experimental sets and perform the experiments. Since the experiments work on mathematical formulas, they give results closer to reality in this respect. Freely choose your materials for experiments Mark the material you want on the tablet screen and it will come to you. Set up your experimental setups and experiment with the materials you choose. Have the experience of freely setting up experimental rigs and try and observe one-on-one. You can assemble the materials you choose from the screen of your tablet and perform the experiments in a realistic way from the installation process. In order to perform the experiments, you need to perform movements in the 3D world. Use the measuring instruments during the experiments and disassemble the test sets for reuse. When you press the 'E' key, a circular screen appears, on this screen, when you move your mouse and click, you can access measuring instruments and some operations. Learn about experiments from your tablet. The tablet you access with the 'Tab' button contains pages on the setup of the experiments and information in general. You can close the page with the cross on the top right of the pages.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2257640/header.jpg?t=1677750978",
    "Price": 19.99,
    "Developers": "Alpay Akay",
    "Publishers": "Alpay Akay",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2257640/ss_0a6b12d349660995c485367fc6f42e235b231a2a.1920x1080.jpg?t=1677750978,https://cdn.akamai.steamstatic.com/steam/apps/2257640/ss_00ae495b928871f435d7cdb01f0f605171328769.1920x1080.jpg?t=1677750978,https://cdn.akamai.steamstatic.com/steam/apps/2257640/ss_52a06ca1286c0ccce6bd2d1190ad27142b0e2e32.1920x1080.jpg?t=1677750978,https://cdn.akamai.steamstatic.com/steam/apps/2257640/ss_e3be24e7c00420372fa055b270bbdb61f8d01622.1920x1080.jpg?t=1677750978,https://cdn.akamai.steamstatic.com/steam/apps/2257640/ss_d99d143845d57d60264b95dfea8f5f9df06bbb57.1920x1080.jpg?t=1677750978,https://cdn.akamai.steamstatic.com/steam/apps/2257640/ss_5a959a8e6bfd0610083b5acdc9226f436009671b.1920x1080.jpg?t=1677750978,https://cdn.akamai.steamstatic.com/steam/apps/2257640/ss_9be1ccfa6fe2c96ddeb3fb255d77e4982ce6a6f1.1920x1080.jpg?t=1677750978,https://cdn.akamai.steamstatic.com/steam/apps/2257640/ss_06d9e5de9710d65c3b0ef92ed675668f32c525b9.1920x1080.jpg?t=1677750978",
    "Slug": "virtual-chemistry-lab",
    "Meta Title": "Virtual Chemistry Lab: Feb 27, 2023, Alpay Akay and Full ...",
    "Meta Description": "Looking for information on Virtual Chemistry Lab? Check out the release date (Feb 27, 2023), developer insights from Alpay Akay, and a complete game sum...",
    "Alt Text Image": "Official header image for Virtual Chemistry Lab game - Steam 2257640",
    "Canonical URL": "https://gusku.site/game/virtual-chemistry-lab",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Virtual Chemistry Lab\", \"description\": \"Looking for information on Virtual Chemistry Lab? Check out the release date (Feb 27, 2023), developer insights from Alpay Akay, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 27, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alpay Akay\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Alpay Akay\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2257640/header.jpg?t=1677750978\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}