{
    "AppID": 2227180,
    "Name": "Water 2050",
    "Release date": "Mar 16, 2023",
    "About the game": "Water 2050 is a 2d isometric city manager about dealing with water pollution today so that we can have a future tomorrow. Playing as the Major, you’ll run the last inhabitable city in a not-so-distant future in which we turned our planet into a massive polluted landfill. Most water in Water 2050 is very polluted and barely apt for humans; there is a lot of environmental damage that have almost end life on Earth. Nothing that a little time travel can’t fix. Jump in time to the past to implement real-world technologies and behaviours that will reduce water pollution in the future. Deal with natural calamities, contaminated areas, hard choices, and a weirdly long-lived engineer that will assist you as much as possible. The future of Earth can be fixed today. The game is developed in association by the Water Environment Asociation , and aims to raise awareness of current practices and technologies that are being implemented to reduce our water pollution, thus ensuring a better tomorrow for all of us. Part of the money raised with this game is allocated by the WEF to research, dissemination and programs that address solutions to the water crisis. Game Features: Amazing cartoonish 2d isometric graphics. City builder and resource management mechanics. Awesome time traveling tech that enables to manage the city both in the future and in the past. Improving things in the past makes the future better as a consequence. 14 real-world technologies to research and achieve water sustainability Unlock Special buildings as Stadium, Cemetery, Observatory, Space Rocket Launch Site and many more, each with special events to resolve. Natural calamities as heat waves, smog, electric storm, acid rain, drought, blizzards, sandstorms and more will test your ability to keep the city alive. Dozens of events on which to make decisions with an impact on the survival of the city An informative but lighthearted way to address a very serious issue: How to clean and preserve our water. This is an amazing game that takes the adventure, resource management, city building and survival genres, mixing them with the real world water crisis to create a rich and powerful experience that raises awareness about what could happen to water in the future.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2227180/header.jpg?t=1678965285",
    "Price": 3.99,
    "Developers": "Totem Games",
    "Publishers": "Totem Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2227180/ss_fc9f3327d1b7e711008ee3fd9646f4d42a2ee196.1920x1080.jpg?t=1678965285,https://cdn.akamai.steamstatic.com/steam/apps/2227180/ss_76eebf4abb92e64b2f3417b37b25fe787d0f1c08.1920x1080.jpg?t=1678965285,https://cdn.akamai.steamstatic.com/steam/apps/2227180/ss_f7beab7549b28bfb7245be6362910bc3c22b16a2.1920x1080.jpg?t=1678965285,https://cdn.akamai.steamstatic.com/steam/apps/2227180/ss_4c9d95a61f89c384bdbde337b181f017f717331c.1920x1080.jpg?t=1678965285,https://cdn.akamai.steamstatic.com/steam/apps/2227180/ss_1600ab632e677b12821771940ff1e8514831db14.1920x1080.jpg?t=1678965285",
    "Slug": "water-2050",
    "Meta Title": "Water 2050: Mar 16, 2023, Totem Games and Full Overview",
    "Meta Description": "Looking for information on Water 2050? Check out the release date (Mar 16, 2023), developer insights from Totem Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Water 2050 game - Steam 2227180",
    "Canonical URL": "https://gusku.site/game/water-2050",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Water 2050\", \"description\": \"Looking for information on Water 2050? Check out the release date (Mar 16, 2023), developer insights from Totem Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 16, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Totem Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Totem Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2227180/header.jpg?t=1678965285\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}