{
    "AppID": 1448440,
    "Name": "Wo Long: Fallen Dynasty",
    "Release date": "Mar 3, 2023",
    "About the game": "From the depths of darkness, a dragon soars. A new dark fantasy Three Kingdoms action RPG from Team NINJA, the developers of Nioh . 184 AD, Later Han Dynasty China. The land is overcome by chaos and destruction. The imperial dynasty that prospered for many years is now about to collapse. Wo Long: Fallen Dynasty is a dramatic, action-packed story of a nameless militia soldier fighting for survival in a dark fantasy version of the Later Han Dynasty where demons plague the Three Kingdoms. Players fight off deadly creatures and enemy soldiers using swordplay based on the Chinese martial arts, attempting to overcome the odds by awakening the true power from within. Wo Long refers to a crouching dragon, and also refers to a hero or person of greatness who is not yet known. This is the story of officers, who will later become heroes, during their ‘unknown’ period, and also the story of a protagonist’s rise from being a ‘nobody’. Demons in the Kingdom A dark fantasy set during the chaotic Three Kingdoms period, the narrative vividly tells the tale of a militia soldier’s strenuous fight for survival during a Later Han Dynasty infested with demons. It’s madness in the Three Kingdoms like never before! Awaken the Power Within Defeat deadly enemies to boost morale and awaken the power from within! Overcome adversity through unique new strategies, including battle styles based on the “Five Phases”. Live by the Sword Renowned for ruthless strikes that can change the tide of battle in an instant, sword practitioners of the Chinese martial arts gracefully change pace as they shift between offensive and defensive maneuvers. Overwhelm opponents with a flurry of force in a series of intense and bloody battles while learning the precision and skill necessary to become a true master of the sword. Various Play Styles with Weapons and Wizardry Spells -Weapons Choose from a wide variety of weapons, from glaives to dual swords, to discover which fits your fighting style. -Wizardry Spells This secret art draws upon the power of the Five Phases, which allow for attacks using such elements as flames and ice. Upon achieving higher Morale Ranks, you can gain the ability to utilize even more powerful Wizardry Spells. -Divine Beasts Divine Beasts like Zhuque and Baihu are brought forth through alliances with other warriors. By calling upon these Divine Beasts, you are able to perform feats of great power. Note: You must have an internet connection in order to use various content. Note: This is the standard edition of the game. The Digital Deluxe Edition is also available.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1448440/header.jpg?t=1677836173",
    "Price": 59.99,
    "Developers": "KOEI TECMO GAMES CO., LTD.",
    "Publishers": "KOEI TECMO GAMES CO., LTD.,CE-Asia(Asia)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1448440/ss_46d32690392bad490af693cbf3394f8f346890ce.1920x1080.jpg?t=1677836173,https://cdn.akamai.steamstatic.com/steam/apps/1448440/ss_db17363dfa15e14909f975ff768c666e2fe98f63.1920x1080.jpg?t=1677836173,https://cdn.akamai.steamstatic.com/steam/apps/1448440/ss_616f77c0cf7aa9ad801608d72bbaf188696b7438.1920x1080.jpg?t=1677836173,https://cdn.akamai.steamstatic.com/steam/apps/1448440/ss_059a719c1e150ec703459541db853fd2fbf1df55.1920x1080.jpg?t=1677836173,https://cdn.akamai.steamstatic.com/steam/apps/1448440/ss_36a81a85d8f775a29d410d398c59686e81d0c303.1920x1080.jpg?t=1677836173,https://cdn.akamai.steamstatic.com/steam/apps/1448440/ss_cd96ce49fcf8ce741662d8535e44bdaa17a98378.1920x1080.jpg?t=1677836173,https://cdn.akamai.steamstatic.com/steam/apps/1448440/ss_8a5b4063c83ad2216a23134511fe2ab8bb8c06cf.1920x1080.jpg?t=1677836173,https://cdn.akamai.steamstatic.com/steam/apps/1448440/ss_94092c0b508bf16f90ece74338dae524d6f00a35.1920x1080.jpg?t=1677836173,https://cdn.akamai.steamstatic.com/steam/apps/1448440/ss_01435a19c580b3740c82a0ed9bac0638900aca92.1920x1080.jpg?t=1677836173",
    "Slug": "wo-long-fallen-dynasty",
    "Meta Title": "Wo Long: Fallen Dynasty: Mar 3, 2023, KOEI TECMO GAMES CO...",
    "Meta Description": "Looking for information on Wo Long: Fallen Dynasty? Check out the release date (Mar 3, 2023), developer insights from KOEI TECMO GAMES CO., LTD., and a ...",
    "Alt Text Image": "Official header image for Wo Long: Fallen Dynasty game - Steam 1448440",
    "Canonical URL": "https://gusku.site/game/wo-long-fallen-dynasty",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wo Long: Fallen Dynasty\", \"description\": \"Looking for information on Wo Long: Fallen Dynasty? Check out the release date (Mar 3, 2023), developer insights from KOEI TECMO GAMES CO., LTD., and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 3, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"KOEI TECMO GAMES CO., LTD.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"KOEI TECMO GAMES CO., LTD.,CE-Asia(Asia)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1448440/header.jpg?t=1677836173\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}