{
    "AppID": 228180,
    "Name": "Action! - Gameplay Recording and Streaming",
    "Release date": "May 8, 2014",
    "About the game": "Action! - The world's No. 1 gameplay recorder! With Action! you can record and stream your HD/4K/HDR gameplay, full-screen Windows desktop, selected Windows desktop region or application window, web player videos, music, benchmark and display game frame rates, add streaming overlays, live audio commentary, webcams and much more! With outstanding performance, sleek design and easy to use interface Action! provides the best user experience for real-time gameplay recording and streaming software. Top reasons why gamers select Action! Smooth HD/4K/HDR10 gameplay recording up to 240fps ! Monitor you stream/recording status with on-screen HUD (no need for second monitor) Automatic recovery of corrupted MP4 recordings - never lose anything you record or stream. Even on power outage or system crash! The best recording performance and low CPU usage ! Support for web browser overlays (streaming alerts)! Live preview of video composition! Easy to use and stylish user interface! Video recording directly to MP4 (H.264/AVC or H.265/HEVC) with hardware acceleration Microphone audio commentary and webcams support! Fast export directly to YouTube and Facebook ! LIVE Streaming to Twitch.tv, Facebook, YouTube, Smashcast and any custom RTMP destination! Supports hardware capture devices Key features: Recording gameplay of DirectX 8/9/10/11/12/OpenGL/Vulkan/UWP games LIVE Streaming games to Twitch.tv, YouTube, Smashcast, Facebook and many more services! Multi-layer HUD with chat overlay over any streamed game! Display and benchmark FPS and average FPS for games Direct gameplay recording to MP4 (H.264/AVC or H.265/HEVC) format with Intel Quick Sync Video, NVIDIA NVENC and AMD AMF acceleration! Adding webcam to gameplay recordings with optional background removal Support for 4K webcams with hardware acceleration (like Brio 4K)! Recording 60P fullscreen Windows desktop with full support for Windows 7, Windows 8, Windows 8.1 and Windows 10 Recording selected region of Windows desktop Recording web player videos Real Time On-Screen Drawing Panel in any borderless windowed games! Save game benchmark results to .CSV or .HTML file Recordings pause/resume option Adding custom logo/overlay graphics Logitech G13/G15/G19 keyboards LCD display support Live audio commentary with a microphone Microphone mixing level adjustment Advanced microphone denoising Record audio only files in WAV/M4A format Capture microphone and system sounds into two separate audio tracks or files Full-screen games and desktop screenshots to JPG, PNG or BMP Capturing selected desktop region screenshots Option to detect framerate of source web player video Exporting video recordings to popular formats and devices Upload to YouTube Smooth and easy recording playback with built-in Action! player Ultimate performance, low CPU usage, and high FPS video recording Mouse clicks visualizations Recorded webcams preview on Action! HUD Custom hotkeys Displaying detected 3D engine for games and applications Multicore CPU support for best performance",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/228180/header.jpg?t=1594129556",
    "Price": 29.99,
    "Developers": "Mirillis",
    "Publishers": "Mirillis",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/228180/ss_d6a80c01c9435a391c797355f36906de94160faa.1920x1080.jpg?t=1594129556,https://cdn.akamai.steamstatic.com/steam/apps/228180/ss_f59d0176f5753c8b18f5c24c04a3310b23e12fe5.1920x1080.jpg?t=1594129556,https://cdn.akamai.steamstatic.com/steam/apps/228180/ss_bbac9c2055c87a29ba071c594eb7cce132367435.1920x1080.jpg?t=1594129556,https://cdn.akamai.steamstatic.com/steam/apps/228180/ss_529ad9a3f148a22a385d341db7b35b67728d76c7.1920x1080.jpg?t=1594129556,https://cdn.akamai.steamstatic.com/steam/apps/228180/ss_e4629a77dc6debc59c347149ea181dfe154ac027.1920x1080.jpg?t=1594129556,https://cdn.akamai.steamstatic.com/steam/apps/228180/ss_3e8453e382c1a5fb6a56da9bc442439a1a9224ba.1920x1080.jpg?t=1594129556",
    "Slug": "action-gameplay-recording-and-streaming",
    "Meta Title": "Action! - Gameplay Recording and Streaming: May 8, 2014, ...",
    "Meta Description": "Looking for information on Action! - Gameplay Recording and Streaming? Check out the release date (May 8, 2014), developer insights from Mirillis, and a...",
    "Alt Text Image": "Official header image for Action! - Gameplay Recording and Streaming game - Steam 228180",
    "Canonical URL": "https://gusku.site/game/action-gameplay-recording-and-streaming",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Action! - Gameplay Recording and Streaming\", \"description\": \"Looking for information on Action! - Gameplay Recording and Streaming? Check out the release date (May 8, 2014), developer insights from Mirillis, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 8, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mirillis\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mirillis\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/228180/header.jpg?t=1594129556\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}