{
    "AppID": 449700,
    "Name": "Ariel",
    "Release date": "Jul 11, 2017",
    "About the game": "Ariel is a First/Third person survival experience, story based, Sci-Fi adventure. Be ready to experience a unique survival adventure as Ferdinand Ludec, a mathematician who is suddenly kidnapped and forced into a drama. Professor Ludec arrives in Ariel, one of Uranus' moons, only to find an entire crew of scientists dead. He is an expert in Electro Mono-Pole theory, and somehow, this knowledge puts him in an extreme situation which will test his inner endurance. Ariel is the name of a black budget project funded by a mysterious group of men. The space station is desolated; all the crew members from the first and second expeditions are dead; you find yourself alone. With a partially procedurally generated world, along with different endings to the story ( Future Implementation ), Ariel takes into account the replayability as one of its assets. Hunger, getting tired and avoiding insanity will only be some of the threats to face. Ariel - There is no way out - FEATURES Survival Mechanics Dozens of items, enemies to hunt down and survival skills will be needed to succeed and escape the isolated moon. Different types of weapons and upgrades.( Future Implemention ) Internal Stats are displayed in the player's interface, so you can always be aware of your hunger, dehydration, mood etc. Pressurized station systems, Food and liquid Processors; Manage your resources. Open World A full open world with mysteries to explore, get lost in Ariel. Weathers Events; Ariel's climate is always changing. Environment that reacts according to your decisions. Space Terror Different levels of difficulty are considered for the experienced players. Both First and Third Person modes ( Third Person to be implemented in an Early Update ). VR would be implemented in a future update. Ariel is taking into account the whole VR experience. ( Future Implementation ) Sound Design The sound design has been carefully created in accordance to the project's atmosphere and storyline. The composer wanted to pour down mixed feelings; A Sci-fi OST which was unique, not limiting itself to the standards. Many experimental, as well as classical sounds merge to find the right atmosphere. THE TEAM Ariel is being developed by a small team. - The lead programmer has worked on various projects in the past, such as Kerbal Space Program. - The second developer is a musician who has experience on Playstation releases. He worked on the 3D models, sound effects, music and story line. He is the producer of the game as well. Many skilled people have helped us along the way. Ariel is the result of much dedication and commitment. We are very happy with the results, and we can't wait for you to experience the game. With a tiny budged and a lot of passion, Ariel stands as an indie videogame that we want everybody to play; we think the price range will allow this, encouraging players into Ariel's experience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/449700/header.jpg?t=1576966259",
    "Price": 9.99,
    "Developers": "Nuclear Fiction",
    "Publishers": "Nuclear Fiction",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/449700/ss_a0a18b55a48bfa9053d3fe9c284e523cba790a80.1920x1080.jpg?t=1576966259,https://cdn.akamai.steamstatic.com/steam/apps/449700/ss_5eba2b56f9390fb3bfb5ed7847322753c65929dd.1920x1080.jpg?t=1576966259,https://cdn.akamai.steamstatic.com/steam/apps/449700/ss_9b65e17f9cb6421566a1891b3dc488ea59c9d231.1920x1080.jpg?t=1576966259,https://cdn.akamai.steamstatic.com/steam/apps/449700/ss_7a99508a50c8f5b7b6d7228d25ea2fe78fb7eb4b.1920x1080.jpg?t=1576966259,https://cdn.akamai.steamstatic.com/steam/apps/449700/ss_b1588ca0825c92f6f7030c7da16d874a852e5f34.1920x1080.jpg?t=1576966259,https://cdn.akamai.steamstatic.com/steam/apps/449700/ss_dba8c760ee50cdd0fe0bf7bde48133bef7668182.1920x1080.jpg?t=1576966259,https://cdn.akamai.steamstatic.com/steam/apps/449700/ss_090a490316034615d0c99953b143d866fb25169d.1920x1080.jpg?t=1576966259,https://cdn.akamai.steamstatic.com/steam/apps/449700/ss_ca42b98dd5959388d4d2b6dde90e17958dd712ea.1920x1080.jpg?t=1576966259,https://cdn.akamai.steamstatic.com/steam/apps/449700/ss_030660b882bd18b878b84623f732cf02967f808b.1920x1080.jpg?t=1576966259",
    "Slug": "ariel",
    "Meta Title": "Ariel: Jul 11, 2017, Nuclear Fiction and Full Overview",
    "Meta Description": "Looking for information on Ariel? Check out the release date (Jul 11, 2017), developer insights from Nuclear Fiction, and a complete game summary.",
    "Alt Text Image": "Official header image for Ariel game - Steam 449700",
    "Canonical URL": "https://gusku.site/game/ariel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ariel\", \"description\": \"Looking for information on Ariel? Check out the release date (Jul 11, 2017), developer insights from Nuclear Fiction, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 11, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nuclear Fiction\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nuclear Fiction\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/449700/header.jpg?t=1576966259\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}