{
    "AppID": 744460,
    "Name": "BE THE HERO",
    "Release date": "Aug 25, 2018",
    "About the game": "INTENSE VR ACTION MEETS VIRTUAL COMIC Ever wanted to be as fast as the flash, as agile as spiderman, or as supreme as one punch man? Now's the time, time to Be the Hero! Our mission was to create an experience that throws you into the extraordinary reality of a Hero, much like the heroes and heroines we grew up reading about in various manga, as Japanese. - GAMEPLAY - Embody the powers of “KUROGANE” and blaze through the metropolis at hyperspeed with our fluid combat locomotion! Scale walls, leap across rooftops, and reign justice from any angle you please to sever the enemies power. Will you learn to harness the true power of a hero? - GAME FEATURES - Fast-paced locomotion WITH Combat! Unlike other titles, we’ve made it our mission to merge a great combat system with fast yet fluid locomotion. Using our new system, 'IDATEN Locomotion,' run at hyperspeed whilst still maneuvering in the ways that feel natural. A unique VR storytelling! Ever read a comic late at night only to fall asleep and dream about becoming that hero!? We’ve transitioned that nostalgia into an immersive VR experience, blending comic book with intense VR action and fluid locomotion. At the climax of the story, you will dive into the comic and play out the actions of a Hero! Epic BOSS BATTLES! Not only will you have to traverse the environment to battle but also the opponent itself. Some of our boss battles run on the larger side :P - STORY - Long in the distant past, there was an era where humanity flourished not via the marvels of science but through the might of the supernatural. The island nation farthest to the east was ruled by a people called The Masked. They possessed the magic to create masks which allowed the wearers to draw out and manipulate their mental energy. With miraculous power came greed, and feuds soon developed into wars. Many warriors rose and fell. By the time The Masked had defeated their enemies, they were left at the brink of extinction. Kurogane, the sole survivor of the Masked's warriors, and the priestess Sakuya, managed to corner the mastermind of the wars and their greatest enemy, Asura, after much hardship--- - CURRENTLY AVAILABLE - [STORY MODE] - VR Comic : 1 episode (3 chapters) - Action Stage: 2 stages - Playable time: 2 hours [CHALLENGE MODE] - Mini game: 'Shoot the Target!' - Playable time: a few minutes A time attack game in which you run to the goal while hitting the targets. You'll get a time penalty if you miss any targets. [ACHIVES] - VR COMIC MOVIES: Re-edited movies of VR Comic chapters - Music: You can listen to the original music pieces of BE THE HERO - UPCOMING UPDATES - We are planning to have the following updates. [Ancient Era ver.2.1] - New enemy Enki -Type Archer - Special Attack Update (both of the sword and the bow) [Present Day ver.1.0] - New story and characters - New City Stages - New mini games (Challenge mode) - OUR GOAL - We aim to create an experience that gives you that nostalgia and wow factor from your childhood. The trouble is refining that experience; please help us by providing us with your valuable feedback, thanks. We deeply consider feedback during this Early Access period (6-9 months). We implore players to share their feedback, suggestions on the Steam forums and SNS to create the best user experience possible. STAY IN TOUCH Twitter: Instagram: / Facebook: / Reddit: / Discord: Website: /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/744460/header.jpg?t=1572412679",
    "Price": 19.99,
    "Developers": "EXPVR Inc.",
    "Publishers": "EXPVR Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/744460/ss_a1a7050f66bbec3b4130b2895bc9a2a8ec8dcc82.1920x1080.jpg?t=1572412679,https://cdn.akamai.steamstatic.com/steam/apps/744460/ss_fffca3adb50160802423d0981207a464c4f9dce4.1920x1080.jpg?t=1572412679,https://cdn.akamai.steamstatic.com/steam/apps/744460/ss_cf6a46a70b7f2b254293750412d49b0e8650bbfd.1920x1080.jpg?t=1572412679,https://cdn.akamai.steamstatic.com/steam/apps/744460/ss_22284b8d6fc757c96a53400f5808fee98e380a5f.1920x1080.jpg?t=1572412679,https://cdn.akamai.steamstatic.com/steam/apps/744460/ss_5b6df901ea9ee81b954c8cc36f974ed4c969415c.1920x1080.jpg?t=1572412679,https://cdn.akamai.steamstatic.com/steam/apps/744460/ss_58508c9a135224584f773c0792f4e1e0962e81fc.1920x1080.jpg?t=1572412679,https://cdn.akamai.steamstatic.com/steam/apps/744460/ss_d2fdbd8ead4a342350f6d07ae4083c890fa55d2c.1920x1080.jpg?t=1572412679,https://cdn.akamai.steamstatic.com/steam/apps/744460/ss_9e5ce1fc8fddd01903e5a9cc75f86f7257e7572f.1920x1080.jpg?t=1572412679,https://cdn.akamai.steamstatic.com/steam/apps/744460/ss_12e05d2727402a440d57b9e01c7932f3782eabb1.1920x1080.jpg?t=1572412679,https://cdn.akamai.steamstatic.com/steam/apps/744460/ss_9995add38b9806e9eba3d3829d4b53566fb1fbc0.1920x1080.jpg?t=1572412679,https://cdn.akamai.steamstatic.com/steam/apps/744460/ss_6f0648f1461b0747cc099c81c821355a92a097c5.1920x1080.jpg?t=1572412679,https://cdn.akamai.steamstatic.com/steam/apps/744460/ss_07a087f0e3c8807d85750941cdf740fc1621bfc8.1920x1080.jpg?t=1572412679,https://cdn.akamai.steamstatic.com/steam/apps/744460/ss_e80bb3546f9c778d9cce913e2cffa8c25d8e4626.1920x1080.jpg?t=1572412679",
    "Slug": "be-the-hero",
    "Meta Title": "BE THE HERO: Aug 25, 2018, EXPVR Inc. and Full Overview",
    "Meta Description": "Looking for information on BE THE HERO? Check out the release date (Aug 25, 2018), developer insights from EXPVR Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for BE THE HERO game - Steam 744460",
    "Canonical URL": "https://gusku.site/game/be-the-hero",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BE THE HERO\", \"description\": \"Looking for information on BE THE HERO? Check out the release date (Aug 25, 2018), developer insights from EXPVR Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 25, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"EXPVR Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"EXPVR Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/744460/header.jpg?t=1572412679\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}