{
    "AppID": 269590,
    "Name": "Claustrophobia: The Downward Struggle",
    "Release date": "Sep 9, 2014",
    "About the game": "Grab your weapon of choice, polish your Rogue senses, and get ready to be thrown into the dark and oppressing dungeons of Claustrophobia! Experience deep character development, fast-paced tactical combat, and mountains of epic loot. Here begins a roguelike quest for glory, slaughter, and anything shiny! Claustrophobia: The Downward Struggle is a Tactical RPG Roguelike, most heavily inspired by the combination of procedural gear and enemy generation found in games such as Diablo and Torchlight, with traditional Roguelike features found in games such as NetHack and Dungeon Crawl Stone Soup. Gameplay revolves around a classless, stat and gear-based progression system, procedural dungeon exploration, and unforgiving tactical combat. Current Features Unending Procedurally Generated content: Procedurally generated gear, enemies, and terrain makes for infinite progression and adventure. Classless Character Development: Build the character you wish to play, and develop them through in-depth stat and ability customization. Tons of Loot: Collect vast amounts of weapons, armour, and active items, whose powerful abilities, stats, and passive bonuses enhance your gameplay. Fast-paced, Tactical Turn-Based Combat: Use positioning, clever skill use, and observation to best your enemies. Face Hoards of Challenging Enemies: From simple critters to deadly Elite Units, face off against a variety of monsters, each with their own set of abilities. Enemy Modifiers such as Teleportation, Invisibility, Lifesteal, and more, ensure that there’s always a new type of enemy to slaughter. Traditional Roguelike Features: Permadeath, a little luck, and unforgiving gameplay means your hero’s life is firmly in your hands. Scoring &amp; Leaderboards: To remember all those poor souls who didn’t make it. Simple, easy to use Interface: All the details and functionality you need, without the clutter. Features Coming Soon Multiple Dungeons: Featuring all new dungeon designs, enemies, rooms, loot, and more. Story mode: Dungeons will chain together for longer, more varied gameplay, and progression towards a final, endgame goal. More Character Development Options: More Class Roles, more Abilities, more talents. Further Item &amp; Enemy Development: A much greater range of Item Abilities and Enemy Modifiers. Traps &amp; Puzzles: More special room types will offer greater variation to exploration. Bosses: Extremely powerful monsters who reside on the final floor of each dungeon, who must be defeated before you can progress. Gear Crafting: Collect materials and salvage old gear to craft powerful new items. Achievements &amp; Unlockables: New content unlocked for courageous feats of strength!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/269590/header.jpg?t=1447359771",
    "Price": 4.99,
    "Developers": "The Indie Forge",
    "Publishers": "The Indie Forge",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/269590/ss_57a53eab2587e5d5f64b93ecc5fc453aa48db2ed.1920x1080.jpg?t=1447359771,https://cdn.akamai.steamstatic.com/steam/apps/269590/ss_7491aa4ddef0c348802fdde0c9b8bd9c543a1237.1920x1080.jpg?t=1447359771,https://cdn.akamai.steamstatic.com/steam/apps/269590/ss_cd7d652e09815858cc0f426aafa71a5a4f22d09b.1920x1080.jpg?t=1447359771,https://cdn.akamai.steamstatic.com/steam/apps/269590/ss_5407795fb30e71a414f59bd1b44c9bf965a49217.1920x1080.jpg?t=1447359771,https://cdn.akamai.steamstatic.com/steam/apps/269590/ss_1608fae4e8e6837707e2918b6eae426a33b643d4.1920x1080.jpg?t=1447359771,https://cdn.akamai.steamstatic.com/steam/apps/269590/ss_d6fdb23a9f91afc1092d0a7e48cd95f366f2f59f.1920x1080.jpg?t=1447359771,https://cdn.akamai.steamstatic.com/steam/apps/269590/ss_d17d26a42cba6b67bf2223c10d2b01c7badbb3ab.1920x1080.jpg?t=1447359771,https://cdn.akamai.steamstatic.com/steam/apps/269590/ss_be57bbca50d817d4c8ac52ceab4c913debe0c2ad.1920x1080.jpg?t=1447359771,https://cdn.akamai.steamstatic.com/steam/apps/269590/ss_ed5ee75b8fc7b71ce733ccd499a985a990b698a3.1920x1080.jpg?t=1447359771",
    "Slug": "claustrophobia-the-downward-struggle",
    "Meta Title": "Claustrophobia: The Downward Struggle: Sep 9, 2014, The I...",
    "Meta Description": "Looking for information on Claustrophobia: The Downward Struggle? Check out the release date (Sep 9, 2014), developer insights from The Indie Forge, and...",
    "Alt Text Image": "Official header image for Claustrophobia: The Downward Struggle game - Steam 269590",
    "Canonical URL": "https://gusku.site/game/claustrophobia-the-downward-struggle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Claustrophobia: The Downward Struggle\", \"description\": \"Looking for information on Claustrophobia: The Downward Struggle? Check out the release date (Sep 9, 2014), developer insights from The Indie Forge, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Indie Forge\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Indie Forge\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/269590/header.jpg?t=1447359771\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}