{
    "AppID": 1171140,
    "Name": "Countersnipe",
    "Release date": "Dec 5, 2019",
    "About the game": "It's an all out war between the agents of Axiom, those self-appointed defenders of global stability, and the operatives of Havoc, the champions of a new world order. Choose your faction, customize your weapon, then scour the map for hidden enemy agents and take them out! Join up with 3 other players for quick, intense four-versus-four matches. Featuring a unique blend of target seeking and skill-based shooting, every game is a new challenge as agents appear randomly across hundreds of possible locations on each map. Set up custom builds of weapon, upgrades, agent, skills, activated items, armor, and ammo type to suit your play style, and team up with friends to create your ultimate 4 person squad. Victory means more rewards plus progress through episodic unlocks that include powerful in-game items and rare cosmetic upgrades for guns and agents. CRAFTED GAMEPLAY * 3 distinct maps with hundreds of possible agent locations, distractions, and destroyable objects * Balanced variation - spawn points change each game but are shared by both teams to ensure each match is fair * Target seeking is key to victory - quick scanning, pattern recognition, movement sense, and memory can give your team the edge * Wide spectrum of gun handling and scopes, further modified by upgrades, attachments, agent skills, and mastery, which allows for nuance and refinement with each weapon * Balanced multiplayer - squad formation and match selection factor in gun tier and agent level to find the fairest match MASSIVE DEPTH * 4 gun manufacturers, each with their own styles - Griffin, Blackburn, LAO, and K&amp;B * 25 guns across 5 tiers of power, 280+ upgrades, and 28 attachments for incredible variety in handling and play * 180 levels of Mastery in 9 critical areas for each gun allows expert fine tuning * 8 Agents with 10 upgrades each and an assortment of 24 skills that can amplify offense or defense * 100+ awesome unlockable rewards each Episode * Plus 80+ achievements, Gun Training, Events, new Episodes and tons more! Jump in and try the most fun, competitive, and surprising free-to-play sniper game out there. Then see how much more fun it is when your squad of friends pulls off that epic, down to the last elimination, come from behind win! Download Countersnipe and play for free now!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1171140/header.jpg?t=1575596070",
    "Price": 0.0,
    "Developers": "Ninja Kiwi",
    "Publishers": "Ninja Kiwi",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1171140/ss_ddd3a6c97dc6a4932beb3df4cd403451329c1e45.1920x1080.jpg?t=1575596070,https://cdn.akamai.steamstatic.com/steam/apps/1171140/ss_9497fe7ea25c69f87da43d3bc09c77a26a902577.1920x1080.jpg?t=1575596070,https://cdn.akamai.steamstatic.com/steam/apps/1171140/ss_35b3389793f5856d4f5273ac57ecf42e084b775e.1920x1080.jpg?t=1575596070,https://cdn.akamai.steamstatic.com/steam/apps/1171140/ss_d5f0debfc4c91d8827e6cb2851d56cccceb751d4.1920x1080.jpg?t=1575596070,https://cdn.akamai.steamstatic.com/steam/apps/1171140/ss_be215e7073a22ed92880cae91e4834c77e17c1a4.1920x1080.jpg?t=1575596070,https://cdn.akamai.steamstatic.com/steam/apps/1171140/ss_3a1dde39418027928fbe75868b455dc90b4accfa.1920x1080.jpg?t=1575596070",
    "Slug": "countersnipe",
    "Meta Title": "Countersnipe: Dec 5, 2019, Ninja Kiwi and Full Overview",
    "Meta Description": "Looking for information on Countersnipe? Check out the release date (Dec 5, 2019), developer insights from Ninja Kiwi, and a complete game summary.",
    "Alt Text Image": "Official header image for Countersnipe game - Steam 1171140",
    "Canonical URL": "https://gusku.site/game/countersnipe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Countersnipe\", \"description\": \"Looking for information on Countersnipe? Check out the release date (Dec 5, 2019), developer insights from Ninja Kiwi, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 5, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ninja Kiwi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ninja Kiwi\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1171140/header.jpg?t=1575596070\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}