{
    "AppID": 688910,
    "Name": "CUBE-C: VR Game Collection",
    "Release date": "Nov 9, 2017",
    "About the game": "This is a Brand New, Fun, Casual VR Game! If your VR device is lying there for a long time, welcome to try CUBE-C, A game specially designed for VR. Although there is no exquisite realistic scene and longtime gameplay here, hope the new experience will make you satisfied! (VIVE only now, more VR devices support will be updated) VRCubeWorld Gameplay 360 Video1 VRCubeWorld Gameplay 360 Video2 Easy Game Walkthrough of VRCubeWorld CUBE-C include 3 mini-games: VR Cube World 720° Racing Pile Up VR VR Cube World This is a very relaxing game, without any difficulty (you may need to be familiar with VR controls) and you can destroy almost everything you can see! You will be completely immersed in this game, and you can experience to interact with all environmental objects!！ The purpose of designing such a game is to make a VR game that is for all ages and free from dizziness. Many people say that this game can 'release stress', you can try is there has such an effect : ). Game update progress notice CUBE-C is making a tutorial level now, please look forward to it! The Gameplay is simple: Grab the Cube in front of you and throw it to smash something else! Throwing it with a little force, so what you hit will become a bunch of Cubes! Your goal is to accumulate more Cubes to upgrade, things that can be eliminated will gradually increase after the upgrade... CUBE-C v0.0.7 New Help File! Advanced play: Throw the Cube or Fireball out and aim the smaller targets in the distance to get the Stars. Getting the Stars will became more difficult, access is not much, you can see how much you can get. Now the way to get rewards has not been determined, the plan is the highest score of networking comparison, I hope you can give me comment on this. Three different weapons are currently available at the beginning of the game, including: Cube, Fireball and Light Saber! ! But at the end of the Early Access weapons will not be appear so easy. 720° Racing (This game is compatible with PC / VR and gamecontroller) Coming Soon... Pile Up VR Coming Soon... Early Access is includes VR Cube World only CUBE-C's Future Improvement Plan 1. Improve the VR Cube World‘s optimization and gameplay. Now because of the dynamic items are too much and the game mechanism to go higher level will cause stutter, so I did not open the whole map now, the problem will be solved before the end of Early Access; 2. Complete the 3 mini games. 720-degree car has basically completed, but some new features also need further improvements, such as car floating. In addition, due to limited technical capacity, I can not let the car drift, hoping to further achieve; Pile Up VR have a lot of things need to finish, but with the final completion of the VR Cube World, I believe some of the problems that exist now can be easily solved. 3. Complete the Steam Achievements system. Achievements system planned from the beginning, but the game is not finished yet, so temporarily it is unable. 4. Add more game elements, such as maps, models and more. 5. Due to the limited of one man's time and energy, and too few friends who can understand and support VR game now. Especially at this year, it is so hard to stick with it. Wish I can get more support than the above plan can be finally completed! Contact Me: Twiiter [/i]",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/688910/header.jpg?t=1521286806",
    "Price": 11.99,
    "Developers": "momo",
    "Publishers": "Rational Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/688910/ss_d5d5d38aeab0528dc4d8ce832ce066a513dff5ee.1920x1080.jpg?t=1521286806,https://cdn.akamai.steamstatic.com/steam/apps/688910/ss_801263f38ffcf434e9d16e4fadc0e89e7d742f95.1920x1080.jpg?t=1521286806,https://cdn.akamai.steamstatic.com/steam/apps/688910/ss_2b431251f125dca755cc59d1f261f7402d106c5d.1920x1080.jpg?t=1521286806,https://cdn.akamai.steamstatic.com/steam/apps/688910/ss_69ad0f511dd34824e7156b1e68f2597caef12b89.1920x1080.jpg?t=1521286806,https://cdn.akamai.steamstatic.com/steam/apps/688910/ss_f9706a90952904b28908a152cb947e86bae58a16.1920x1080.jpg?t=1521286806,https://cdn.akamai.steamstatic.com/steam/apps/688910/ss_35016ead3973392b8ca3a4654af66d101422cf98.1920x1080.jpg?t=1521286806",
    "Slug": "cube-c-vr-game-collection",
    "Meta Title": "CUBE-C: VR Game Collection: Nov 9, 2017, momo and Full Ov...",
    "Meta Description": "Looking for information on CUBE-C: VR Game Collection? Check out the release date (Nov 9, 2017), developer insights from momo, and a complete game summary.",
    "Alt Text Image": "Official header image for CUBE-C: VR Game Collection game - Steam 688910",
    "Canonical URL": "https://gusku.site/game/cube-c-vr-game-collection",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CUBE-C: VR Game Collection\", \"description\": \"Looking for information on CUBE-C: VR Game Collection? Check out the release date (Nov 9, 2017), developer insights from momo, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 9, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"momo\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rational Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/688910/header.jpg?t=1521286806\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}