{
    "AppID": 1780530,
    "Name": "Cyber Sweep",
    "Release date": "May 27, 2022",
    "About the game": "Mines are randomly distributed. Find where they are by removing blocks. Beacons will guide you by showing how many adjacent Mines there are, if any. You win when all Mines have either been surrounded or have been removed. Be careful not to hit a Mine! Modes Choose between two game modes: Mine - Remove all Blocks until only the Mines remain. Sweep - Remove all Mines instead. Difficulty Choose between the following sizes: Rookie 5x5x5 Blocks with 10 Mines Professional 7x7x7 Blocks with 33 Mines (Unlocked by winning above) Operative : 8x8x8 Blocks with 50 Mines (Unlocked by winning above) Elite : 9x9x9 Blocks with 70 Mines (Unlocked by winning above) Legend : 10x10x10 Blocks with 99 Mines (Unlocked by winning above) Steam Features Stats : Your progress is saved and can be used for unlocking higher difficulties and other goodies. Achievements : There are 19 Achievements available. All should be able to be obtained after a few hours of play-through. Leaderboards : Your best Time on specific Game Mode and Difficulty is uploaded and can be compared with others. Graphics Overall Quality settings using: Low , Medium , High , Epic , Cinematic Anti-aliasing and Super Sampling using: FXAA - Fast Approximate Anti-Aliasing (Improves quality (old)) TAA - Temporal Approximate Anti-Aliasing (Improves performance) TSR - Temporal Super Resolution (Improves motion clarity) Use the built-in Benchmark to see worst-case scenario. How to Play A B C D E A. Block: Remove Blocks by clicking the Left Mouse button. It can be empty inside, contain a Beacon, or a Mine. B. Mine: Mine mode: If you hit a Mine it's Game Over. Sweep mode: Right Mouse click to remove the Mine. When all Mines are cleared you've won. C. Beacon: Tells if there are adjacent Mines. Pay attention to all directions including diagonally. The number and color will indicate how many adjacent Mines there are. D. Marker: Set a Marker with the Right Mouse button if you are suspecting a Mine there. Any numbers of Markers is allowed. E. Shield: A Shield is awarded once a day, but you can have no more than 10 in total. Only one shield can be used per match. The Shield will prevent you from hitting a Mine. Secrets You've read this far and deserve to know the secrets. Achievement: Play Rookie and Operative difficulties on Sweep Mode to unlock two separate backgrounds. Achievement: Click on the Fuyu Games Logo (Main Menu) to visit our homepage. Feel free to look into our other games! Easter Egg: Find the lost item from our previous game and click on it. Appears in Space when in Main Menu. Easter Egg: Find the lost item from our previous game and click on it. Appears after 13 minutes and 37 seconds, in the right corner.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1780530/header.jpg?t=1653641354",
    "Price": 1.99,
    "Developers": "Fuyu Games AB",
    "Publishers": "Fuyu Games AB",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1780530/ss_cd77f4d1e3aaec670377cb146c026801173c6385.1920x1080.jpg?t=1653641354,https://cdn.akamai.steamstatic.com/steam/apps/1780530/ss_ce258f546ee57ee14b554003a5a68cbe5fb95921.1920x1080.jpg?t=1653641354,https://cdn.akamai.steamstatic.com/steam/apps/1780530/ss_41b215664a309b8a380a71a243f16ce7e6e2b328.1920x1080.jpg?t=1653641354,https://cdn.akamai.steamstatic.com/steam/apps/1780530/ss_348df6e5f080ad5ce6df5f1ad18d102d4d006770.1920x1080.jpg?t=1653641354,https://cdn.akamai.steamstatic.com/steam/apps/1780530/ss_0b5982d04f61329acbc0cf94b7ead3864cb5d607.1920x1080.jpg?t=1653641354",
    "Slug": "cyber-sweep",
    "Meta Title": "Cyber Sweep: May 27, 2022, Fuyu Games AB and Full Overview",
    "Meta Description": "Looking for information on Cyber Sweep? Check out the release date (May 27, 2022), developer insights from Fuyu Games AB, and a complete game summary.",
    "Alt Text Image": "Official header image for Cyber Sweep game - Steam 1780530",
    "Canonical URL": "https://gusku.site/game/cyber-sweep",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cyber Sweep\", \"description\": \"Looking for information on Cyber Sweep? Check out the release date (May 27, 2022), developer insights from Fuyu Games AB, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fuyu Games AB\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fuyu Games AB\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1780530/header.jpg?t=1653641354\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}