{
    "AppID": 1873960,
    "Name": "Dungeon Crawler",
    "Release date": "Feb 25, 2022",
    "About the game": "Dungeon Crawler is a round-based, third-person, rogue-like, fantasy-style, atmospheric indie game. You are on your quest for fame, diving diligently into a dungeon full of hostile creatures to free mankind from an ancient evil that is told to dwell in the deepest depth of these caves. On your journey you will slay monsters, loot equipment and gain XP to level up and access perks that let you grow and sustain. GAME MODE You will be asked to pick a Game Mode at start. We recommend to pick Easy for new players. No worries, you can switch to higher modes later on if you have learnt the ropes and are up for a tougher challenge. MOVEMENT Navigate by clicking the highlighted ground tiles. Not all tiles will be accessible at all times as they can be blocked by creatures or need to be activated by passing rooms that are generated procedurally. ROUND-BASED This is a round based journey. You perform one action per round (walk, guard, attack or cast a spell - if you acquired magic perk). Once your round is finished, creatures will take actions... DEATH On death, you respawn at the deungeon entrance, ready for your next trial. Sadly, items and equipment are lost, however experience, level and perks remain, increasing your power slowly but surely over time. HITPOINTS You start with 2 hitpoints (HP) and lose one on each hit taken. Once HP reach zero, you die and restart, unless you have a health potion equipped, which restores HP to its max. COMBAT Attack creatures by clicking their tile. Pay attention to combat stats shown on the pillars and callouts - you might find some hints on hidden mechanics to improve your combat tactics and sustainability. DICE Combat is performed using stats and dice. A die can hold up to 5 'success' sides (but at least has 1 'fail' side). If stats exceed 5, you will get further dice (2 dice = up to 10, 3 dice = up to 15 success sides, etc). Attackers roll first and if successful, defenders rolls to check if the attack can be blocked or evaded. EXPERIENCE Gain experience by killing creatures and clearing rooms. Once a certain threshold is met, you will level up and gain access to apply permanent perks. PERKS On each level up, you will pick from mighty perks that will remain even upon death, so better pick wisely! Perks can be reset when resetting your complete progress in the main menu. Combination of perks are key to impact the way you play, like making you tankier or taking an assassins path. LOOT Loot can be healing potions, spells and equipment. Chests provide random equipment. When picking up equipment, stats will be rolled. If stats are higher than the current ones, you keep the new equipment. The deeper you move into the dungeon, the higher the stats of rolls. ACHIEVEMENTS There are currently 87 Steam achievements waiting for you to be explored and unlocked. Happy hunting! FEATURES • Type: Casual Round-Based Rogue-Like Dungeon Crawler • Weapons: Sword (Melee), Bow (Ranged), Shield (Defense), Spells • Size: Tutorial, 1 Dungeon with 4 Stages • Encounters: Zombies, Skeleton-Crossbows, -Warriors, -Mages, Demon • Progression: up to Level 20, up to 22 perks (since Update 1.02) • Controls: All you need to play is a mouse to point and click • Language: In-Game language is English, however there's not too much text at all DISCORD For any feedbacks, discussions, help needed or bug reports, come visit our discord and share with us: Good luck and safe travels! Keep in mind, death is not ultimate...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1873960/header.jpg?t=1651560679",
    "Price": 5.99,
    "Developers": "Jinxi",
    "Publishers": "Jinxi",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1873960/ss_7ba075668d6b11e8ad51dfaae70bb082bc22cde5.1920x1080.jpg?t=1651560679,https://cdn.akamai.steamstatic.com/steam/apps/1873960/ss_f76514f5f7a60421356de936780ad0673a4c35df.1920x1080.jpg?t=1651560679,https://cdn.akamai.steamstatic.com/steam/apps/1873960/ss_b933f519a002f85d23ebf7d7265072ceeef7b957.1920x1080.jpg?t=1651560679,https://cdn.akamai.steamstatic.com/steam/apps/1873960/ss_6eaa313164194d14bddb90a2eab54b65b5b5c468.1920x1080.jpg?t=1651560679,https://cdn.akamai.steamstatic.com/steam/apps/1873960/ss_70cddf3ba89bd5a408de47f9fbfe1c99a4e69a7a.1920x1080.jpg?t=1651560679",
    "Slug": "dungeon-crawler",
    "Meta Title": "Dungeon Crawler: Feb 25, 2022, Jinxi and Full Overview",
    "Meta Description": "Looking for information on Dungeon Crawler? Check out the release date (Feb 25, 2022), developer insights from Jinxi, and a complete game summary.",
    "Alt Text Image": "Official header image for Dungeon Crawler game - Steam 1873960",
    "Canonical URL": "https://gusku.site/game/dungeon-crawler",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dungeon Crawler\", \"description\": \"Looking for information on Dungeon Crawler? Check out the release date (Feb 25, 2022), developer insights from Jinxi, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jinxi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jinxi\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1873960/header.jpg?t=1651560679\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}