{
    "AppID": 563490,
    "Name": "Earth Liberation",
    "Release date": "Dec 15, 2016",
    "About the game": "If you are human and reading this - it’s time to push back those ugly reptile invaders from our planet! A year ago they arrived in our skies, while scattered governments could do nothing but fall before them. With the old world gone, all our strifes perished as well - and now the remnants of humanity shall stand united to take our Home back... Or die trying. No more fear - upon the ruins of our civilization - the Resistance arises. We have the soldiers, we have the weapons… All we need are commanders. If you are one with intellect and reflexes, don’t hesitate, Earth Liberation awaits! In a nutshell, Earth Liberation is a short sessioned highly intense RTS, fast-paced with an old-school taste. The focus is on combat rather than on base development or complex economy. The game challenges skilled players without introducing new brain twisting mechanics into the genre. As a Commander of the Resistance, you have to cut through a series of fierce close quarter battles. In Earth Liberation hell drops on you instantly - and your only keys to victory are tactics and rapid decision making. SIR, MASSACRE, SIR! Paint the ground with invader’s guts NO WARM-UP IN HELL Feel the constant enemy pressure almost right away TRIUMPH NON-STOP Average mission time - 30 minutes BASE OF BASICS Less building, economy and exploration, more combat! MORE THAN WAR A deep and multilayered background story supplemented with a novel by an award-winning sci-fi writer Earth Liberation is a debut game by PoRovoz Studios, founded by Vladimir Polozkov and Nikolai Rovneiko who have been friends for the last three decades, and for the last two - huge RTS worshipers. They never dreamed of careers in game development, but while becoming successful in finance and the oil and gas sector, there was a yearning for something more, something from their past. They wanted to relive through the happiness of annihilating enemy bases with an army of units. However, since the RTS genre was almost ousted by MOBAs over the last years, a crazy idea came to them: “Let’s make our own perfect RTS like in the good old times, but with some fresh focus on action”. Having no gamedev background and lead only by their passion, these two insane dreamers put their careers on hold and began working on Earth Liberation . A foolish decision? Perhaps. The guys are confident: “Wherever this road will bring us - the risk is worth it. For Earth! For Humanity!” Completed Objectives: 7 singleplayer campaign missions 1 playable faction - Resistance (Humanity) сustomizable defensive and offensive tactics ground &amp; aerial units ballance variety of battle landscapes Active Objectives: Polishing and improving ballance &amp; game meachanics - daily, hourly Improved visuals - Jan-May 2017 More units, missions and landscapes - Jan-May 2017 Steam Achievements - Feb 2017 Steam Trading Cards - Feb 2017 Larger maps for more massive battles - Mar 2017 Cooperative mode - May 2017 Competitive PvP mode (play as humans or invaders) - May 2017 Special units upgrade system - TBA New audio design - TBA One year before the game begins, in 2077, a reptile-like alien race called Khraster almost eliminates нumanity. We had no chance. We were unprepared. We couldn’t know. Or could we… Were there warnings from the ancient ages? “Earth Liberation: The Novel - Part 1” reveals the frightening depth of the in-game conflict by taking you back through Earth’s history. To the times called ‘primal’ by modern scientists. The price for such blindness was Earth.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/563490/header.jpg?t=1482963186",
    "Price": 6.99,
    "Developers": "PoRovoz Studios",
    "Publishers": "PoRovoz Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/563490/ss_cc9d1090b37ab1cf27657a1acf4648562a02042f.1920x1080.jpg?t=1482963186,https://cdn.akamai.steamstatic.com/steam/apps/563490/ss_cd58e7cf31faab0d83d20f9e5349b24ef4b8e83f.1920x1080.jpg?t=1482963186,https://cdn.akamai.steamstatic.com/steam/apps/563490/ss_b234b69bf413662d522ad8ea2c007932146cf802.1920x1080.jpg?t=1482963186,https://cdn.akamai.steamstatic.com/steam/apps/563490/ss_72bf560bfeb84804f10b5baf69f3034a6bec99ed.1920x1080.jpg?t=1482963186,https://cdn.akamai.steamstatic.com/steam/apps/563490/ss_f34a0cb2a86663eff30dadfd0597fbcae4d090f0.1920x1080.jpg?t=1482963186,https://cdn.akamai.steamstatic.com/steam/apps/563490/ss_c37c034380689c96a746d39dee6ab17f3f9590ce.1920x1080.jpg?t=1482963186,https://cdn.akamai.steamstatic.com/steam/apps/563490/ss_2e43a90cc302871002bc7770680ca919ae079160.1920x1080.jpg?t=1482963186,https://cdn.akamai.steamstatic.com/steam/apps/563490/ss_e654c8c9085f077f7dc5df06e9b4c875f5dcf4d2.1920x1080.jpg?t=1482963186,https://cdn.akamai.steamstatic.com/steam/apps/563490/ss_88294c749cd7052bf1d88696e690087ca27211b7.1920x1080.jpg?t=1482963186,https://cdn.akamai.steamstatic.com/steam/apps/563490/ss_4e97b9a608d3b0e66b1c80b3c57a5815d71d454a.1920x1080.jpg?t=1482963186",
    "Slug": "earth-liberation",
    "Meta Title": "Earth Liberation: Dec 15, 2016, PoRovoz Studios and Full ...",
    "Meta Description": "Looking for information on Earth Liberation? Check out the release date (Dec 15, 2016), developer insights from PoRovoz Studios, and a complete game sum...",
    "Alt Text Image": "Official header image for Earth Liberation game - Steam 563490",
    "Canonical URL": "https://gusku.site/game/earth-liberation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Earth Liberation\", \"description\": \"Looking for information on Earth Liberation? Check out the release date (Dec 15, 2016), developer insights from PoRovoz Studios, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 15, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"PoRovoz Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PoRovoz Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/563490/header.jpg?t=1482963186\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}