{
    "AppID": 1527710,
    "Name": "Earth Elements",
    "Release date": "Apr 24, 2022",
    "About the game": "Earth Elements You play with group of game characters RoundOnes. Yours first objective is to modify map in that way so RoundOnes scattered initially on map can work together. They will do tasks: first and most important dig tiles called in game Elements. Every tile on map with some effort could be accessible to digging. Next after that they can mix Elements in MIXERS, BUILD improvements on map to easier access more tiles, use MACHINES which will speed up process of digging. RoundOnes are very busy doing all those tasks, therefore theirs: FOOD and SLEEP level is getting lower. Those vitals have impact on RoundOnes health. There is a solution for all those aspects. You need to place BUILDS to fix and replenish, those builds are: sleep beds and food storages. Finally they need to protect those BUILDS from enemy and wild animals building defensive structures. To use better game BUILDS, and more efficient MACHINES Yours RoundOnes needs to advance in EPOCHs, kind of like Mankind going from stone age to bronze, metal, industry age up to futuristic age. Almost every BUILD group has MONUMENTAL builds, like: Great Kohakia Mounds, Stonehenge, Machu Picchu, and of course Great Pyramid. After completion of MONUMENTAL BUILDS bonus is added. Digging map can bring some surprises after you will discover permafrost you can defrost new unit: Yeti. Advancing in Epoch is crucial for gameplay. For example after you reach Super Biology Epoch you will be able to use DNA rebuilder - to recreate Dinosaurs. Or maybe you are technology fan than create Droid unit from Computer Chip. In game you can take different game route every time you start new session. Game has over hundred Builds to get specifics result on map: ladders, elevators, walls, food storages, relays etc. More than 40 unique tiles on map - which you can Mix in Mixers to get more Elements; Three different game character types: RoundOne, Yeti, Droid. Plenty of animals to manage or hunt for meat - you decide. My Main idea during creating game is to give you freedom of choices - game is NOT linear, there are a lot of different ways to progress in game. All work of Yours game characters has one main goal: to collect specific amount of Uranium. That will grant you a title of WINNER of this game. Map Is randomly generated, giving you possibility to enjoy game for long time. Playing session can vary depending on map size from 30 min to a few hours.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1527710/header.jpg?t=1651443191",
    "Price": 7.99,
    "Developers": "Jack G",
    "Publishers": "Jack G",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1527710/ss_4b7cc4d85f8a67e3cc405fff2a8e5542f41f03fb.1920x1080.jpg?t=1651443191,https://cdn.akamai.steamstatic.com/steam/apps/1527710/ss_35dc295972a9811309d9affaa77d67b0d884d02f.1920x1080.jpg?t=1651443191,https://cdn.akamai.steamstatic.com/steam/apps/1527710/ss_70ca021a575210b7e920f3beec0bdb619989b455.1920x1080.jpg?t=1651443191,https://cdn.akamai.steamstatic.com/steam/apps/1527710/ss_eb4cc7cb24430ca28829654265f467c0e091f1bf.1920x1080.jpg?t=1651443191,https://cdn.akamai.steamstatic.com/steam/apps/1527710/ss_7c898b9a14adc42bae7e076e1b175de1420b6659.1920x1080.jpg?t=1651443191,https://cdn.akamai.steamstatic.com/steam/apps/1527710/ss_15e16ff530127a60dfa89459acf65567b7fd7862.1920x1080.jpg?t=1651443191,https://cdn.akamai.steamstatic.com/steam/apps/1527710/ss_27dbc6e004f46add9907f7c870a6e2585d8bbaf1.1920x1080.jpg?t=1651443191",
    "Slug": "earth-elements",
    "Meta Title": "Earth Elements: Apr 24, 2022, Jack G and Full Overview",
    "Meta Description": "Looking for information on Earth Elements? Check out the release date (Apr 24, 2022), developer insights from Jack G, and a complete game summary.",
    "Alt Text Image": "Official header image for Earth Elements game - Steam 1527710",
    "Canonical URL": "https://gusku.site/game/earth-elements",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Earth Elements\", \"description\": \"Looking for information on Earth Elements? Check out the release date (Apr 24, 2022), developer insights from Jack G, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jack G\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jack G\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1527710/header.jpg?t=1651443191\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}