{
    "AppID": 1241440,
    "Name": "Elfin Clay",
    "Release date": "Dec 2, 2021",
    "About the game": "Mysterious and friendly online game 'Elfin Clay' 'Elfin Clay' is a collaborative battle game in which thieves made of magic clay collect a lot of treasures. There is also a free edition that you can play easily You can play with your friends who have paid edition. Free edition specifications No restrictions on matching. Data can be transferred by upgrading to the paid edition. There are some limitations on the ability to acquire and use items such as shields and treasure. Mysterious Elfin Clay born from magic clay. This is just a small part of what we will be revealing in this release. There are still many mysteries left in their lives. Please look forward to future updates! Items currently under research and development New stages (ruins, farm) New weapons and actions New treasure New ways to play (????) What is 'Elfin Clay' First of all, I would like to tell you something important. This game is Not a difficult competitive action game Not aimed at competing for wins or losses A loose game that is gentle, gentle, and enjoys the cuteness and forgiveness of a good old adult to play like a 3-year-old child. There are only three basic rules in this game: 1. Let's get along with many friends 2. Collaborate with your friends to collect a lot of treasure 3. If someone is crying or angry, comfort them. Yes, this game is a 'friendly world'. However, since this is a game, there are of course some elements of competition. I will introduce it below. You are manipulating a creature called Elfin Clay made of magical clay. They love collecting things. However, they are too shy to carry things unless their faces are hidden. Let's wear something on their heads. The game is a 3-on-3 team battle. In 5 minutes, the team that collects a lot of items on the stage wins. You collect items in toy boxes prepared for each team. When I looked up, the whale lifted the top of the toy box. When the game is over, it will collect the item. Intercepting from the other team is one of the strategies... Special actions that change with the hat Elfin Clays love to wear hats. Depending on what they're wearing, they can perform special actions. The charm of the game is that not all of the actions will give you an advantage in the game. Some of the special actions are meaningful, some are not. It's okay if you don't win the game. Attract them with cool actions and become a hero to everyone. In addition, they accidentally fall down and cry. When they are crying, Let's pet them to cheer them up.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1241440/header.jpg?t=1638489794",
    "Price": 16.99,
    "Developers": "unCompany games",
    "Publishers": "Sonorite",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1241440/ss_f9a4817d7d41cac21c577dad7b2406a76755e61f.1920x1080.jpg?t=1638489794,https://cdn.akamai.steamstatic.com/steam/apps/1241440/ss_1b720f4a27f12f7f3584404c4a68a09d4dcccfc7.1920x1080.jpg?t=1638489794,https://cdn.akamai.steamstatic.com/steam/apps/1241440/ss_90a8e66b455bdb0dadc260b4e0339e484fdd1b24.1920x1080.jpg?t=1638489794,https://cdn.akamai.steamstatic.com/steam/apps/1241440/ss_09752bb1654931516f2d14d29e2716618d49b213.1920x1080.jpg?t=1638489794,https://cdn.akamai.steamstatic.com/steam/apps/1241440/ss_de1e35ed23140faf4f3acb5602886442ac3b54b7.1920x1080.jpg?t=1638489794",
    "Slug": "elfin-clay",
    "Meta Title": "Elfin Clay: Dec 2, 2021, unCompany games and Full Overview",
    "Meta Description": "Looking for information on Elfin Clay? Check out the release date (Dec 2, 2021), developer insights from unCompany games, and a complete game summary.",
    "Alt Text Image": "Official header image for Elfin Clay game - Steam 1241440",
    "Canonical URL": "https://gusku.site/game/elfin-clay",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Elfin Clay\", \"description\": \"Looking for information on Elfin Clay? Check out the release date (Dec 2, 2021), developer insights from unCompany games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"unCompany games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sonorite\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1241440/header.jpg?t=1638489794\", \"offers\": {\"@type\": \"Offer\", \"price\": 16.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}