{
    "AppID": 1414240,
    "Name": "Evolution of a Mini World: Physics Wonderland",
    "Release date": "Feb 13, 2021",
    "About the game": "Current observations have proven that two halves of the celestial sphere divided by the Milky Way are exactly the same in human vision, including the distances measured by the upper and lower hemispheres. The Hubble velocities of the galaxies away from us, given a similar distance, are also almost the same. From the current state of understanding, the universe is a round pie with a radius of 13.7 billion light years, and the Milky Way is located at the physical center of the observable universe. But why? Are human beings really lucky to be born at the center of the universe? Human beings are not that lucky, unless any observer is at the center of the universe! Which means, the universe may not be flat, but on the surface of a bigger sphere, just as we are on the earth, everyone is standing at the center of the planet. The universe is not a round pie envisaged in the standard model, but a four-dimensional space-time boundary similar to a three-dimensional sphere. This three-dimensional space-time boundary is not flat. Far away, three dimensions will gradually bend, and each dimension is a circle. Dr. Valentino, a researcher from the University of Manchester, recently revealed through the analysis of the observational data of the Planck satellite that the universe may not be as flat as a bed sheet, but a closed three-dimensional sphere similar to a huge balloon. Hubble expansion is the process of expanding the entire balloon; everything is increasing in size.The paper is recently published on Nature: Di Valentino, E., Melchiorri, A. &amp; Silk, J. Nat Astron 4, 196–203 (2020). Our story begins here. Today, our Milky Way, similar to all other galaxies, sits on the sphere of the universe equally and ordinary. However, it is not an ordinary three-dimensional sphere, but a four-dimensional one. The spherical surface of a three-dimensional sphere is two-dimensional, similar to our surface; that of a four-dimensional sphere is three-dimensional, and every dimension is curved in the distance. The four-dimensional space-time boundary looks like as follows: Given the existence of a fourth dimension, wormholes can be observed. As revealed during The Strings Conference 2020, wormholes are actually common. Time travel is possible. As time goes by, all scales become large. If a past civilization exists, then it is smaller than it is now. If the past civilization passed through wormholes and came to today's time, would it not be a small world? Let's start the game and explore lives within such mini civilizations. This is a game for physics lovers and history lovers. Its UI menu interface reflected its own scientific attributes: planets moving on the curvature of space-time caused by gravitational fields. Then you can choose a star/planet, such as the Moon or the Mars, for a landing-on adventure on an expedition rover, or you can navigate the space from the perspective of a spacecraft. But if you think this game is just such a space simulator, then you underestimate it. The aforementioned contents are only 5% of the game. In fact, this game has very rich time and space travel and space exploration functions, and it has great fun: You can drive a spaceship, explore different kinds of extraterrestrial planets, and in a far away galaxy called Magda Nebula, you will fight the alien fleet and experience the space battle described in the 'Independence Day' movie. You can also build your own world, in the center of the earth, like many Minecraft-like voxel games, you will create a paradise of Verne fantasy. You can also decrypt the secrets of the Relativity, and observe the world seen by a traveler riding a photon by flying at 90% speed of light. You can also travel through wormholes, and come to some lost historical periods: Ancient Rome, Ancient Egypt, Medieval Dark Ages, etc., and to defend their civilization with your fighting system. It is not a prefect game yet, but this is our endeavor to introduce real physics into games.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1414240/header.jpg?t=1658816180",
    "Price": 9.99,
    "Developers": "William at Oxford",
    "Publishers": "William at Oxford",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_1503e6a81f67fdb33959a939418dd84832482d86.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_b9fc999205a46bb38cf39eaf2ef8611eda6f01f6.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_9caa6d90122894309d665889a8c04cf50bf677a1.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_041c9b2f52208f11ff9b6f35dff4bd7903089e85.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_7e1ea23a4d86a0e6012a1b9feb6b290db0de8132.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_5942c83c7e169a4e8485e100fae1a9daf4b09e10.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_cf5c89edd52ba8f4562b56620a4cfdee9ded5bcf.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_301f30d76d41b3cccbca15b23e7010f7918df9b7.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_f9667b2e027b6ebe78254edb33a1dcee7311785d.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_eab2aec8f83cd58f4180894b25cea658f8ace84b.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_c7ad6428a32c42f425a875345e4a9679114a522e.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_ea46edcf16a507a4c7e18f854d39f914034386d7.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_8684ec9452ce24bc5008acffbe0a4c35ccab00c4.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_08ec79b93c3b61909c802ca88db3434a6213af8b.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_00fd1d4588b8cdd8ac6acd9543c7ce651b47715a.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_94ad1c4af2d66843705174dc3d1542dd1c2b6458.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_eb060204bb34213cadd9868f551edab2bb268324.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_a0e36e36dac73ee54514620b3e9784e64ce53c1b.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_6d4ad429ca2c20e5fd4d9f5851e0b8e9e4ecaf5b.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_474bd0b6d65d0db663af1455f69a2705e6b6c5c5.1920x1080.jpg?t=1658816180,https://cdn.akamai.steamstatic.com/steam/apps/1414240/ss_518b11694dbdf498b3a62796130e93be8b5ea411.1920x1080.jpg?t=1658816180",
    "Slug": "evolution-of-a-mini-world-physics-wonderland",
    "Meta Title": "Evolution of a Mini World: Physics Wonderland: Feb 13, 20...",
    "Meta Description": "Looking for information on Evolution of a Mini World: Physics Wonderland? Check out the release date (Feb 13, 2021), developer insights from William at ...",
    "Alt Text Image": "Official header image for Evolution of a Mini World: Physics Wonderland game - Steam 1414240",
    "Canonical URL": "https://gusku.site/game/evolution-of-a-mini-world-physics-wonderland",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Evolution of a Mini World: Physics Wonderland\", \"description\": \"Looking for information on Evolution of a Mini World: Physics Wonderland? Check out the release date (Feb 13, 2021), developer insights from William at ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 13, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"William at Oxford\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"William at Oxford\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1414240/header.jpg?t=1658816180\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}