{
    "AppID": 1617640,
    "Name": "剑道仙语",
    "Release date": "May 12, 2021",
    "About the game": "亲爱的合作伙伴您好：     目前活跃用户和生态较低，符合平台关服游戏需求。现申请关服和下架事宜，感谢各位对该游戏的支持与工作上的配合。 以下为关服事宜： 1、关服公告发布日期：2022年6月1日； 2、2022年7月1日10:00整 正式停止充值服务，禁止新用户注册该游戏，页面入口隐藏； 3、2022年8月1日10:00整 正式停止游戏运营，所有服务器关闭 ★剑道仙语客服★ 官方客服QQ：3468443840，添加客服QQ即可领取游戏大礼包，同时可以获得的福利更多，返利更多，惊喜不断。 PS：添加时记得备注游戏名和角色名！ 特殊提示 因为中国大陆访问steam网络波动厉害，steam官网也时常发生打不开现象。如果充值页面或者其他与steam相关的打不开，推荐使用UU加速器，雷神加速器等工具免费加速steam商店。 白银大礼包-装备寻宝钥匙*10、背包钥匙*5、英雄帖*3、养元液2（加群即可领取） 黄金大礼包-内经令牌*1、三级红宝石*2、三级蓝宝石*2、绑元*200（畅玩游戏2小时以上可领取） 白金大礼包-三级太初龙魂*1、三级九转凤灵*1、三级凤灵*1、三级龙魂*1（畅玩游戏20小时以上可领取） 有任何游戏问题也可加群联系游戏客服处理。 《剑道仙语》-全民仙侠无双神魔手转端游戏,太古乾坤武神武动天下,神仙大陆凡人遮天,完美古风奇幻世界游戏。 完美全新经典修仙世界，富且有趣的培养系统翅膀、时装、兵器不仅可以提升战力，还可以通过幻化来带不同的炫酷外观； 装备独创了升星进阶系统，让培养战力的过程也充满乐趣与成就感； 灵宠不仅可以增加战力，还可以随时跟随，并对敌人攻击； 独特的炼丹炉经脉修炼，异火炼化； 聚灵、封神、诛仙、飞升……三主角选择，开启你的专属修仙之旅。 游历人间，寻山访水，机缘尽在掌握。精美细致的修炼历程，展现出以凡人之身逆而争锋，踏出一条长生大道的逆天修仙之路。 苍生之于世间，如落叶纷纷奔向大地。我若成仙，御神剑杀尽妖魔。仙不容我，杀千人我便是魔。 【游戏特色】 ☉重唱经典 随缘修仙 众生皆苦，放下自在，随缘修仙。全新放置挂机修仙玩法，让你完全沉浸在一个另类的修仙世界中。三大角色酷炫技能特效，血脉觉醒华丽变身玩法，无双收割筑梦仙盟！独创4段式轻功御剑飞行，专属职业全屏秒怪技能，享受屏幕炸裂的超级杀戮感，全天候世界BOSS挑战玩法，时装、神器100倍掉率，好玩不肝，离线升级、上班可玩、搭车也嗨、解放天性，360度全视角，坐上坐骑享受全境飞行，领略仙灵奇景的全感官体验。修天地之道，品人生百味，高自由度的修真世界，邀您共结仙缘！仙盟结交志同道合的兄弟姐妹，仙侣邂逅浪漫的仙界恋情。抒写属于你的精彩人生！ ☉游历人间 渡劫历练 海量精心设计历练任务，充满机关陷阱、万妖埋伏，让每一处的角落皆可遇上出乎意料之外的仙境奇遇冒险。 ☉天才地宝 聚灵铸器 聚灵采玉，强化精练铸上古神器，神装幻化，洪荒异种，玲琅满目。 ☉机遇奇缘 神罚绝学 修得上古神技，全屏葬神音阵秀翻天。如此机缘，我不成仙谁成仙。仙缘未了，奇遇不断，只要你肯努力，必能助你以平凡资质笑傲三界！ ☉参天悟道 位列仙班 修仙不易，法侣财地一样都不能少，探索未知区域、挑战全新关卡，千辛万苦，诸般神奇，只为早日飞升。变幻无穷仙术，环环相扣成长体系，百种天书、上古法宝、神秘灵宠收入囊中，早日得道成仙坐拥神职，位列仙班，梦想就在眼前。 ☉人间兴事 仙侣奇缘 仙侣红颜知己常伴，双修共炼守护神剑，共同铸就神仙眷侣。真实多向情缘系统，等待有缘之人，牵手一生所爱，爱一人守一城，邂逅你的战国之恋。寻找到心仪的那个TA，举行一场隆重的婚礼，从此生死与共，仗剑天涯。 ☉秘境挂机 万仙杀劫 百倍经验副本，奇幻秘境挂机冒险。万魔祖地，畅快淋漓尽显仙侠传说。 ☉切磋斗法 合作屠魔 跨服BOSS，万人同屏，切磋斗法，御剑斩妖，组队屠魔，强力门客，王者争霸，斩妖蛇，平龙怒。精良组队副本，风云再起英雄齐聚，封神，称王，体验王特权，享受万人朝拜。还大家一个全新的仙侠世界！ ☉海量豪礼 免费福利 海量福利免费放，每日签到，累积登录，火符神兵、图鉴神职等，轻松参加活动领取超多福利。灵宠神御、百变仙羽、上古妖魔。仙途漫漫，顺为凡，逆为仙，了却凡尘一念间。 碧海仙境摇摇欲坠，百妖滋生。斩妖除魔之人出世，天理循环。 龙凤云境起风云，蛇龙震怒，斩妖蛇，平龙怒，祸不及苍生。 幽冥之路无常起乱，鬼怪附和，平定幽冥七爷俯首，妖邪尽诛。 方离幽冥十里，荒郊遇险情，灵妖尽出无穷无尽，白骨累累。 天地从霜白，却见冰石精雕细琢，发须随风摆，还有杀心斩妖除魔。 八方幽静桃香幽幽杀机暗伏，妖影绰绰转眼之间刀剑临头。 荒蛮之地无人之处，上古秘镜现形，蛮恶之地更有凶险无数。 震山巨灵封于南海九万里下，邪魔肆虐封印已解，为祸天下。 传闻极境冰坛印有飞升之道，八方客来齐聚冰坛之巅。 蓬莱仙境百年一开，正邪齐聚，仙境开，杀戮起！ 《剑道仙语》是以古龙武侠小说《天涯明月刀》为基础构建的武侠世界，力图重现古龙武侠的真正味道。游戏中有全自由的轻功，加上全3D的自由视角，玩家可以使用轻功上屋顶，飞跃各种地形，探索游戏中的任意角落。结合爽快的战斗，激烈的PK，自由的交易，给玩家带来一个真正的江湖 一、职业介绍 1.华山派 性别：男 武器：剑 特性：平衡、近距离输出 操作难度：☆☆☆ 门派绝学：华山剑法、狂风快剑、游龙剑法、真·太极慧剑、剑主天地、柔云剑法、春风化雨、万剑归宗（绝技） 背景简介：剑锋证侠情，青芒照丹心；西岳峥嵘何壮哉，黄河如丝天际来。华山派为五岳剑派中实力最强的一脉，其武学磅礴处势若飞龙，圆融处静如处子，虽因多年之前的变故分化为剑、气两宗，但不论剑宗的以剑养气，还是气宗的以气御剑，都令武林各派不敢小觑。剑宗秘传独孤九剑，气宗绝学紫霞神功，令华山隐有执武林牛耳之势 2.移花宫 性别：女 武器：伞 特性：控制、中距离输出 操作难度：☆☆☆☆ 门派绝学：移花伞技、花杀一念、归来去兮、真·天地醉心、五韵韶华、踏雪寻梅、天水明玉、花间酌（绝技） 背景简介：盈盈持剑舞，佳影自留香；玉笛临风，醉心入梦，红尘移花归去，沧海踏歌而来。移花乃东海子桑氏开创之门派，中原移花亦出自东海一脉。千年之来遗世独立，是八荒之中最为出尘风雅，写意逍遥之门派 3.六扇门 性别：男 武器：枪 特性：群攻强、近距离输出 操作难度：☆☆☆ 门派绝学：官方枪法、七探盘蛇枪、燎原枪法、真·无双乱舞、百鸟朝凤枪、蛟龙出海、铁血丹心、霸王枪决（绝技） 背景简介：银枪破四海，豪情现无双；明朝万历年间，朝廷为了处理有关国家大事的案件，专门成立了一个集武林高手、密探、捕快和杀手于一体的秘密组织。因为这个组织的秘密性，又因为总部大殿是一个又是一个坐北朝南、东南西三面开门、每面两扇门总共六扇，所以叫做“六扇门” 4.血刀门 性别：女 武器：刀 特性：攻击强、近距离输出 操作难度：☆☆☆ 门派绝学：血刀刀法、铁血斩、血刀·燕返、真·奇门三才刀、反两仪刀法、血刀乱舞、血魔心经、血刀心经（绝技） 背景简介：赤影莲华梦，血海渡凡尘；血刀门素来杀戮盛行，嗜血如魔。有秘辛将敌人精血养于棺中随身携带，以血育棺、以棺养刀，方能成就更高境界。所以如遇到背负血棺的血刀门人，还是绕道而行吧。",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1617640/header.jpg?t=1654136192",
    "Price": 0.0,
    "Developers": "剑道仙语",
    "Publishers": "剑道仙语",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1617640/ss_039f02f42db1bf399d05d2a31dc2a2d25d62a2a1.1920x1080.jpg?t=1654136192,https://cdn.akamai.steamstatic.com/steam/apps/1617640/ss_c83e275f144f33dc124a6d84da1426e9a9ad5b43.1920x1080.jpg?t=1654136192,https://cdn.akamai.steamstatic.com/steam/apps/1617640/ss_1d7490014aad999e74d74a963e27e78409b28d33.1920x1080.jpg?t=1654136192,https://cdn.akamai.steamstatic.com/steam/apps/1617640/ss_7716306945a18de8a8e6e8f4a3df8d1edfa98e71.1920x1080.jpg?t=1654136192,https://cdn.akamai.steamstatic.com/steam/apps/1617640/ss_b577bb30659b90155d8ec83a4816933eab0f092f.1920x1080.jpg?t=1654136192",
    "Slug": "",
    "Meta Title": "剑道仙语: May 12, 2021, 剑道仙语 and Full Overview",
    "Meta Description": "Looking for information on 剑道仙语? Check out the release date (May 12, 2021), developer insights from 剑道仙语, and a complete game summary.",
    "Alt Text Image": "Official header image for 剑道仙语 game - Steam 1617640",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5251\\u9053\\u4ed9\\u8bed\", \"description\": \"Looking for information on \\u5251\\u9053\\u4ed9\\u8bed? Check out the release date (May 12, 2021), developer insights from \\u5251\\u9053\\u4ed9\\u8bed, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u5251\\u9053\\u4ed9\\u8bed\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u5251\\u9053\\u4ed9\\u8bed\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1617640/header.jpg?t=1654136192\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}