{
    "AppID": 1247290,
    "Name": "GameGuru MAX",
    "Release date": "Mar 25, 2022",
    "About the game": "GameGuru MAX makes the creation of your game simple, quick and easy – no coding required! GameGuru MAX is a 3D game-maker that makes the creation of your game simple, quick and easy – no coding required! With all the tools and assets you need in one place you can start making your dream game in minutes! Dream it ∙ Build it ∙ Play it FEATURES USER INTERFACE GameGuru MAX features a fully customizable game-making user interface that's ideal for rapid design and level creation. The menus, toolbar and dock-able windows are responsive and smooth, and easy to use for seasoned game-makers and novices alike. With integrated video tutorials and quick key shortcut help users will get to grips with GameGuru MAX in no time. EASY TO USE LEVEL EDITOR The main 3D Level Editor is where you design your games. We've made it super easy to use without being over complicated. The editor features a game object library, game element controls, terrain editing, character creator, importer, visual effects, weather, shooter game logic and lots more! PROCEDURAL BASED TERRAIN SYSTEM With the procedural based terrain generator creating your game world has never been easier. Using fractal mathematics it can create random terrains in an instant. When making a new level you first choose a biome style for your level and then, using a range of sliders, you can define the general layout of your game level. Finer control is then possible with terrain sculpting and texture painting tools. Levels can be up to five kilometre squared in size with further procedural drawn terrain rolling majestically into the far horizon. Biomes styles include Forest, Desert, Arctic, Canyon, Mountain, Rainforest and Plains. TREE AND VEGETATION RENDERING Trees and vegetation can be auto-populated into your game. With one click you can add whole forests and grasses to your level. Finer control is available with the easy to use tree and vegetation tools. NEW CHARACTER CREATION AND BEHAVIORS Game characters can be designed using the built-in Character Creator. Make characters to fight with you as allies or against you as enemies. Choose male, female or zombie style characters and then style how they look with many different choices of head, hair, facial features, head gear, eye-glasses, body, legs and feet. Characters come AI ready with high quality animations for walking, running, gesturing, fighting, shooting and more. Male and female Zombies are easy to create from their component parts, ideal for a Horror Zombie game. There's a selection of different clothing choices and a range of animations from slow meandering walks to fast running Zombies. REALISTIC PHYSICS Game physics are handled with the integration of the acclaimed Bullet Physics Engine. The physics simulation manages the player and character controllers, game object collisions, impact forces and rag doll death. With the support of convex hull shapes the physics processing is kept fast and efficient. GAME STORYBOARD EDITOR Every aspect of your game can be controlled by you. From the loading splash screen to how the various game levels link together. The Game Storyboard editor lets you link these different areas by just connecting them up with visual wires. It's from here you can edit any screens and levels. Test your game from this editor as well as save it as a standalone executable that can be played by you and your friends without the need to own GameGuru MAX. Once GameGuru MAX leaves Early Access you can even publish the games and you don't have to pay any licence fees! VISUAL LOGIC With the Visual Logic system there's absolutely no coding or scripting required. Link objects together and choose how they interact. From an enemy patrol area that uses flag way-points to guide the NPCs, to keys linking to doors that they can open. Lines show the links between the connected objects with all the logic handled internally. Key values from scripts are exposed as values that you can change such as the speed of an enemy fighter. AWESOME GRAPHICAL FIDELITY! GameGuru MAX supports correct real-time lighting, PBR rendering shadows and more - bringing a greater sense of realism to your game creations. SCENE VISUALS You have easy access and control to every visual and weather setting for your game levels. Sun Clouds Water Filter effects Post process effects Shadows Fog Rain Snow GAME GENRE This Early Access version is focused on the First Person Shooter (FPS) game genre but we're already working on RPG and Puzzle genres, along with MultiPlayer and full VR support to come out later in the year!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1247290/header.jpg?t=1657031522",
    "Price": 49.99,
    "Developers": "TheGameCreators",
    "Publishers": "TheGameCreators",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1247290/ss_dd89b06a97e67f2b0f094de65e509036f4a49136.1920x1080.jpg?t=1657031522,https://cdn.akamai.steamstatic.com/steam/apps/1247290/ss_49f6e8f47410d35a1e8644c2c36f01ad18e7fec2.1920x1080.jpg?t=1657031522,https://cdn.akamai.steamstatic.com/steam/apps/1247290/ss_ef1842118f18e663927a05ab2ec1cd14e5115ded.1920x1080.jpg?t=1657031522,https://cdn.akamai.steamstatic.com/steam/apps/1247290/ss_28a253c2de81d74a8ec7088431940eed36911a5c.1920x1080.jpg?t=1657031522,https://cdn.akamai.steamstatic.com/steam/apps/1247290/ss_a0f040347bcd09209c12de7c114881135fc8e654.1920x1080.jpg?t=1657031522,https://cdn.akamai.steamstatic.com/steam/apps/1247290/ss_0841b74ff50b502b06c7c5b8c50c3891841513e5.1920x1080.jpg?t=1657031522,https://cdn.akamai.steamstatic.com/steam/apps/1247290/ss_8ae8b102b0daa2da97a7fd57de555b9348d772e4.1920x1080.jpg?t=1657031522,https://cdn.akamai.steamstatic.com/steam/apps/1247290/ss_5d9243e50ba31aa5e452150aaca8563a8604cc9e.1920x1080.jpg?t=1657031522,https://cdn.akamai.steamstatic.com/steam/apps/1247290/ss_a2b32131ba23febc5d99a16e867edc349980c2da.1920x1080.jpg?t=1657031522,https://cdn.akamai.steamstatic.com/steam/apps/1247290/ss_a68d800b0385faddc553f1746cf9e6042b6ed0cb.1920x1080.jpg?t=1657031522,https://cdn.akamai.steamstatic.com/steam/apps/1247290/ss_bedc55277cc7e166fee2afc35040520a8ccab170.1920x1080.jpg?t=1657031522",
    "Slug": "gameguru-max",
    "Meta Title": "GameGuru MAX: Mar 25, 2022, TheGameCreators and Full Over...",
    "Meta Description": "Looking for information on GameGuru MAX? Check out the release date (Mar 25, 2022), developer insights from TheGameCreators, and a complete game summary.",
    "Alt Text Image": "Official header image for GameGuru MAX game - Steam 1247290",
    "Canonical URL": "https://gusku.site/game/gameguru-max",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"GameGuru MAX\", \"description\": \"Looking for information on GameGuru MAX? Check out the release date (Mar 25, 2022), developer insights from TheGameCreators, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"TheGameCreators\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TheGameCreators\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1247290/header.jpg?t=1657031522\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}