{
    "AppID": 1031140,
    "Name": "Horus Heresy: Legions",
    "Release date": "Mar 28, 2019",
    "About the game": "A BRUTAL CARD GAME BASED ON WARHAMMER: THE HORUS HERESY! Enter the Age of Darkness! Grab your bolter, build an unstoppable deck, and take part in the civil war that plunged the Empire of Mankind into turmoil. Collect all the major armies of the era, from the Space Marines Legions to the forces of Mars and the minions of Chaos, each with unique mechanics and fighting styles. Fight in the most important battles of the Horus Heresy as you make your way to Terra. Your actions shape the evolution of the game, so get ready to make history! ========================= GAME MECHANICS ========================= CHOOSE FROM OVER 100 LEGENDARY WARLORDS Your warlord leads your army from the front. There are dozens to choose from, each with unique abilities, special cards and dramatic voice lines. Your selection will determine your options and influence your strategy and your path to victory. Will you stay loyal and defend the Imperium of Mankind, or join the traitor forces of the Warmaster? Choose your allegiance! BUILD THE STRONGEST DECK FOR YOUR ARMY Choose your favourite army from among all the major factions of the Horus Heresy. Discover the different Astartes Legions, the Custodes and Sisters of Silence fighting for the Imperium, the Knight Houses and other servants of the Omnissiah, as well as the Daemons of the Ruinstorm and other minions of Chaos. Enjoy the stunning artwork. With over 1,300 cards to choose from, the possibilities are endless! MASTER DEEP MECHANICS, TAILORED TO THE LORE OF EACH ARMY Each army features distinct traits representing its unique approach to war. From the complex tactics of the Emperor’s Children seeking a perfect turn to the straightforward and bloody approach of the World Eaters, each match-up tells a different story. Find the one that fits your style! ========================== GAME MODES ========================== RANKED MODE: CAN YOU BECOME THE WARMASTER? Ascend through the major battlegrounds of the Horus Heresy, from Isstvan to Calth. Finally, reach Terra and fight to become the Warmaster! Prove your mettle in monthly seasons to earn big rewards and exclusive card backs to showcase your dominance. SINGLE-PLAYER CAMPAIGNS: DISCOVER THE LORE AND KICK-START YOUR COLLECTION Relive key battles from the best-selling novels and prove yourself in the major clashes between Loyalists and Traitors across the galaxy. Start with a deck of 15 cards and face a series of enemies of rising difficulty. Unlock new warlords, cards and upgrades along the way, as you get ready to face an epic final enemy! DRAFT MODE: TIME-LIMITED ARENAS BASED ON FAMOUS BATTLES FROM THE LORE Prove your drafting skills in time-limited scenarios based on major battles from the Horus Heresy. Each event features different warlords, including event-exclusive ones. Earn individual rewards and help your Lodge dominate the event leaderboard! Furthermore, your victories contribute points to either the loyalists or traitors, depending on which warlord you play as. The outcome of each event determines which new content will be added to the game! =================== OTHER NOTEWORTHY FEATURES =================== JOIN A LODGE WITH OTHER PLAYERS Team up with players from all over the galaxy with the lodge system. Enjoy a private chat room to share deck-lists, strategy tips and play practice matches to get ready for the battle. Rank to the top of the event’s leaderboard to win amazing rewards and take part in community-led lodge tournaments! FULLY CROSS-PLATFORM ACROSS DESKTOP AND MOBILE Register your account to play seamless from multiple devices. Enjoy a long session of competitive matches from your home, or step in for a quick practice match from your mobile device while on the go. Your full collection and progress goes with you! COMMUNICATE ACROSS THE GALAXY Take part in a global chat room with all other players from across the Galaxy. Tapping on any message will automatically translate it to your own language, allowing you to communicate with humans and xenos alike. ENDLESS ACHIEVEMENTS AND CHALLENGES There are hundreds of milestones and achievements to complete, guiding you through the early stages of the game and providing long-term goals to aim for even for the most veteran players.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1031140/header.jpg?t=1654786530",
    "Price": 0.0,
    "Developers": "Everguild Ltd.",
    "Publishers": "Everguild Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1031140/ss_50fde1b5a0f4be61753d1a2c007afa1007629523.1920x1080.jpg?t=1654786530,https://cdn.akamai.steamstatic.com/steam/apps/1031140/ss_eaa65f7c9f30de592ae9cccebf2fbb8d2df2c6b2.1920x1080.jpg?t=1654786530,https://cdn.akamai.steamstatic.com/steam/apps/1031140/ss_a801034136d86ef76f7d6340f5170b354c1333da.1920x1080.jpg?t=1654786530,https://cdn.akamai.steamstatic.com/steam/apps/1031140/ss_18e196534b6dfa5c58094af692d73b6c367aa5bd.1920x1080.jpg?t=1654786530,https://cdn.akamai.steamstatic.com/steam/apps/1031140/ss_ea9389b4bcfcc64a87067cf398acbe0281f47088.1920x1080.jpg?t=1654786530,https://cdn.akamai.steamstatic.com/steam/apps/1031140/ss_2a6b8df9d3d9ceec2132d9962dd32da3beb30fd9.1920x1080.jpg?t=1654786530,https://cdn.akamai.steamstatic.com/steam/apps/1031140/ss_cf2f6f6a599a3edf90f7f7a2ea29c08594d3d6d3.1920x1080.jpg?t=1654786530,https://cdn.akamai.steamstatic.com/steam/apps/1031140/ss_445c70445a94721c186cf76707e43261f7f05c80.1920x1080.jpg?t=1654786530",
    "Slug": "horus-heresy-legions",
    "Meta Title": "Horus Heresy: Legions: Mar 28, 2019, Everguild Ltd. and F...",
    "Meta Description": "Looking for information on Horus Heresy: Legions? Check out the release date (Mar 28, 2019), developer insights from Everguild Ltd., and a complete game...",
    "Alt Text Image": "Official header image for Horus Heresy: Legions game - Steam 1031140",
    "Canonical URL": "https://gusku.site/game/horus-heresy-legions",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Horus Heresy: Legions\", \"description\": \"Looking for information on Horus Heresy: Legions? Check out the release date (Mar 28, 2019), developer insights from Everguild Ltd., and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 28, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Everguild Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Everguild Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1031140/header.jpg?t=1654786530\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}