{
    "AppID": 1865080,
    "Name": "Idol Queens Production",
    "Release date": "Apr 29, 2022",
    "About the game": "An idol making simulation game, Idol Queens! Produce your own idols in the way the real k-pop idols are produced! 🔥 The most realistic idol making game Train your idols just like the real k-pop entertainment agencies do! Be a producer, recruit and train trainees, and manage the agency as a business executive! Expand your company internationally with your management strategy and produce a million-selling artist! 🎤 The world of idols in 3D Recruit trainees and form a sub-unit to see their best performance! The idols you produce will appear on the stage in 3D! Enjoy your idols in the realistic 3D graphics. 📈 Systematic idol training system Various training programs to grow your trainees into the global superstars! Schedule management, vocal training, dance training, and acting training to upgrade their talent and charms! Make them popular stars who perform not only in concert, but also various broadcasting programs such as movie, drama, musical, and mukbang! 💌 Special communication with your idols Don't forget to communicate with your trainees after recruiting them! The closer they're to the producer, the better idols the trainees become. Use the [Diary] function to see the special story and SNS photos of your idols. 👗 Dress them up in different styles Put cute dresses on your idols, dye their hair, and mix and match accessories! Each part can be freely changed! Make your idol a fashionista! 🛏️ Decorate the dormitory for your idols Make a room where your idols can stay cozy. The furniture items affect the idols. They help the idols release their stress and relax their minds. Also, you can have your friends over in the dormitory. 🗳️ Voting competition Enjoy the real-time network pvp with other users! Your rank is determined based on the regional score. Various rewards are distributed based on the rank! 📅 Many events to enjoy! Other than training, there are many things need to be done for your successful idol producing and agency management. Make an album, create a streaming channel for gaming/restaurant reviews/cooking, manage the merchandise store (pop up shop), do the promotion test and fandom quest to complete the missions and raise the affinity of the idols while gaining the stockholder's trust!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1865080/header.jpg?t=1651297487",
    "Price": 24.99,
    "Developers": "SUNBEESOFT",
    "Publishers": "SUNBEESOFT",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1865080/ss_1073abb71299099f6e3264ce22616781865bb9df.1920x1080.jpg?t=1651297487,https://cdn.akamai.steamstatic.com/steam/apps/1865080/ss_d31c34efa5ba747a86c41aebebda8aa1ca83f3e7.1920x1080.jpg?t=1651297487,https://cdn.akamai.steamstatic.com/steam/apps/1865080/ss_d598ad65252ad0719ed31e422033cbd3061e9eea.1920x1080.jpg?t=1651297487,https://cdn.akamai.steamstatic.com/steam/apps/1865080/ss_72420c4205436669e1d8ecd0da4e8130ec634e03.1920x1080.jpg?t=1651297487,https://cdn.akamai.steamstatic.com/steam/apps/1865080/ss_4b0ef8550a00821078cac04c1c5ca01b433c3e17.1920x1080.jpg?t=1651297487",
    "Slug": "idol-queens-production",
    "Meta Title": "Idol Queens Production: Apr 29, 2022, SUNBEESOFT and Full...",
    "Meta Description": "Looking for information on Idol Queens Production? Check out the release date (Apr 29, 2022), developer insights from SUNBEESOFT, and a complete game su...",
    "Alt Text Image": "Official header image for Idol Queens Production game - Steam 1865080",
    "Canonical URL": "https://gusku.site/game/idol-queens-production",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Idol Queens Production\", \"description\": \"Looking for information on Idol Queens Production? Check out the release date (Apr 29, 2022), developer insights from SUNBEESOFT, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"SUNBEESOFT\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SUNBEESOFT\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1865080/header.jpg?t=1651297487\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}