{
    "AppID": 1405780,
    "Name": "Interactive Empathy",
    "Release date": "Dec 4, 2020",
    "About the game": "Two small experimental games made as part of a one-week game workshop in Zagreb, Croatia, as part of a project called 'Interactive Empathy - Citizenship &amp; Storytelling in Video Games'. Inside is also a documentary video about the workshop, as well as a booklet about the whole project. Games available in: - English - French - German The participants of the workshop were artists (not gamedev professionals), and they used Gamechuck's 'Interactive Comics Editor' to create their own interactive projects in this one week. The two games playable here were also exhibited in the Institut français de Zagreb in November 2020. These are the short summaries of each interactive comic / game: The first game, 'Empathy Path', is a horror video game in the form of an interactive comic, permeated with notions of morality and philosophical quotations. It is based on the theory of Heidi Maibom who divides empathy into affective (for example, when we cry because we see someone else crying) and cognitive empathy (when we put ourselves into other people’s shoes by reflecting). The players of this game will find themselves in a slaughter house with five characters: a trapped girl, a suicidal clown, a pig, a butcher and artificial intelligence. In order to free the girl, the players need to empathize with all the characters, since all of them play a role in her liberation. By empathizing with individual characters, the player must literally delve into their perspective, which turns the character - an object - into the subject. Such changes of perspective and “empathy paths” lead the players to the initial position. However, we must warn the players of the responsibility before them, because the “empathy path” continues within them. Art and story by Andrea Pleša and Matija Vigato. The second game, 'There Is No Cure (And That's Okay)' is conceived as a simulator of first-person experience, based on the stories and experiences of people suffering from mild and severe mental illnesses. It deals with the conditions in which they find themselves and the changes of their perception of the world during the performance of ordinary activities. As the player explores the world around them and interacts with it, glitches, i.e. discrepancies in the perception of reality occur. Interaction with the world can be (de)motivating, depending on objects and persons in the given situation. The aim of the game is to make players aware that mental illnesses are not and should not be a taboo and that everyone deserves a chance and other people’s understanding in these sometimes sadly immutable situations. However, the latter can be controlled, thus maintaining the quality of life, if individuals and their environment invest a great deal of effort and willingness. Art and story by Alma Trtovac.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1405780/header.jpg?t=1610568491",
    "Price": 0.0,
    "Developers": "Animafest Workshop 2019",
    "Publishers": "Goethe Institute in Croatia and French Institute in Croatia and Gamechuck",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1405780/ss_18d6ff47941ba4353bef6e50de6291b1ac7a1e8f.1920x1080.jpg?t=1610568491,https://cdn.akamai.steamstatic.com/steam/apps/1405780/ss_4d8b2c78ea492b5c42d3ac85a01965394be04ea4.1920x1080.jpg?t=1610568491,https://cdn.akamai.steamstatic.com/steam/apps/1405780/ss_cfebeb9fc2ffe7a804f8141b3cd190b69aabe191.1920x1080.jpg?t=1610568491,https://cdn.akamai.steamstatic.com/steam/apps/1405780/ss_07b1c270f08792aa4079c909edf1b50ad474871f.1920x1080.jpg?t=1610568491,https://cdn.akamai.steamstatic.com/steam/apps/1405780/ss_ea829fc5a3a59e9d1e6a2fbd476085bc44538d0c.1920x1080.jpg?t=1610568491",
    "Slug": "interactive-empathy",
    "Meta Title": "Interactive Empathy: Dec 4, 2020, Animafest Workshop 2019...",
    "Meta Description": "Looking for information on Interactive Empathy? Check out the release date (Dec 4, 2020), developer insights from Animafest Workshop 2019, and a complet...",
    "Alt Text Image": "Official header image for Interactive Empathy game - Steam 1405780",
    "Canonical URL": "https://gusku.site/game/interactive-empathy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Interactive Empathy\", \"description\": \"Looking for information on Interactive Empathy? Check out the release date (Dec 4, 2020), developer insights from Animafest Workshop 2019, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Animafest Workshop 2019\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Goethe Institute in Croatia and French Institute in Croatia and Gamechuck\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1405780/header.jpg?t=1610568491\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}