{
    "AppID": 455020,
    "Name": "Jackpot Poker by PokerStars",
    "Release date": "Mar 20, 2017",
    "About the game": "Jackpot Poker by PokerStars - the world’s largest online poker brand Enjoy non-stop casino poker action. Jackpot Poker offers a huge range of tables from the biggest name in poker, PokerStars. With hundreds of tables and thousands of real poker players, you can experience more gambling excitement, more betting thrills, more poker! Jackpot Poker is home to fast format Spin and Go Jackpot Poker Tournaments – a rapid 3-Player Poker jackpot tournament in which players can win up to 3,000 times their initial gamble using play-money chips! And best of all its free-to-play, with multiple ways of gaining free chips and a daily allocation to keep you in the action. The Official Spin &amp; Go Poker Game Choose a tournament, spin the bonus wheel and get a Jackpot reward multiplier. Build the strongest poker hand or bluff your way to victory as you beat your opponents and win millions of chips. Our Spin &amp; Go Texas Hold’em Poker tournaments takes you around the world and all have different buy-in levels - so you can start off small and gradually build your Texas poker skills. Win Endless Free Poker Chips We give away up to 100 million Free Bonus Poker Chips every week! Get regular chip bonuses every four hours and participate in our free coin giveaways as you play. Better than any Poker Tour, more riveting than any Poker Casino! Want to Mix it with the High Rollers from Day-One? Purchase a Chip Bundle through your Steam Wallet and get to the big action in an instant. Additional Features to Enhance your Poker Experience Authentic: Nothing but real poker players, no machines, no computers. We never use bots and you always play against the best poker players in the world. Poker Quizzes: Solve poker questions and riddles &amp; win free chips Liquidity: With over 400,000 PokerStars daily players - a huge range of tournaments and traditional game buy-ins Progress: Progress through game levels and edge your way to the top tables as you become a true Texas Hold’em Poker master Hundreds of thousands of Poker players play Jackpot Poker every day – can you beat them? This product is intended for use by those 18 or older for amusement purposes only. Chips do not represent a real money cash value – this is a play-money poker game and no cash-out is available. Practice or success at social casino gaming does not imply future success at real money gambling.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/455020/header.jpg?t=1492010559",
    "Price": 0.0,
    "Developers": "PokerStars Mobile Limited",
    "Publishers": "PokerStars Mobile Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/455020/ss_4fa64139b7a1a150a12d4c1e3d21378d4bd25c12.1920x1080.jpg?t=1492010559,https://cdn.akamai.steamstatic.com/steam/apps/455020/ss_01102d3bfef8bd53656813b2af837c8dec7a1957.1920x1080.jpg?t=1492010559,https://cdn.akamai.steamstatic.com/steam/apps/455020/ss_34d2e126d545001727256493534b3de6f47ad831.1920x1080.jpg?t=1492010559,https://cdn.akamai.steamstatic.com/steam/apps/455020/ss_da113fec111fa574388adf9d8b21f9d70c599370.1920x1080.jpg?t=1492010559,https://cdn.akamai.steamstatic.com/steam/apps/455020/ss_beb3a5bf25b806ca3cf5ca5c5d6f44b45f89e852.1920x1080.jpg?t=1492010559",
    "Slug": "jackpot-poker-by-pokerstars",
    "Meta Title": "Jackpot Poker by PokerStars: Mar 20, 2017, PokerStars Mob...",
    "Meta Description": "Looking for information on Jackpot Poker by PokerStars? Check out the release date (Mar 20, 2017), developer insights from PokerStars Mobile Limited, an...",
    "Alt Text Image": "Official header image for Jackpot Poker by PokerStars game - Steam 455020",
    "Canonical URL": "https://gusku.site/game/jackpot-poker-by-pokerstars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Jackpot Poker by PokerStars\", \"description\": \"Looking for information on Jackpot Poker by PokerStars? Check out the release date (Mar 20, 2017), developer insights from PokerStars Mobile Limited, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"PokerStars Mobile Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PokerStars Mobile Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/455020/header.jpg?t=1492010559\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}