{
    "AppID": 496300,
    "Name": "Kingdom: New Lands",
    "Release date": "Aug 9, 2016",
    "About the game": "Tales spread of far off isles with mysteries waiting to be discovered. Rulers will need all the strength of their subjects to sail away and find new kingdoms in these New Lands. Kingdom: New Lands builds upon the award-winning gameplay and mystery of Kingdom by introducing an abundance of new content to the IGF-nominated title while maintaining the simplicity and depth that legions of monarchs have come to experience and enjoy. Travel to the New Lands and welcome the deluge of new mounts, merchants, and vagrants that call these isles home, but be wary of the new obstacles that threaten your arrival -- for not just the greedy creatures block your way but even the environment itself can defeat you. Kingdom: New Lands asks you to puzzle things out on your own. You'll come across items, NPCs, and mysterious statues to help you but you'll have to figure out just how exactly they'll aide you in building and defending your Kingdom. Kingdom: New Lands is about exploration, discovery, survival and that awesome feeling that you get, when you figure something out, on your own. When multiple pieces all of a sudden come together to form a whole – a basis for a new strategy or an understanding how something in the world of Kingdom: New Lands truly works. It is about tenacity and overcoming obstacles – even when they seem to be unsurmountable. Pulling through, against all odds. Rebuilding and recovering. And that huge internal high-five when you succeed. It is about figuring out how best to manage your little Kingdom and tie everything together in a fashion where the game doesn’t play you – you play the game. It’s also beautiful, tranquil, melancholy, frantic, stressful and wonderful. It delivers a spectrum of emotions that combine into a unique experience. It's a minimalist strategy game where you need to discover the rules of how the world behaves before you can rule effectively. It's also a little bit whimsical, it's pretty, and it can be frustrating but it won't hold your hand. Kingdom: New Lands features: ● One ruler, their horse, and a bag of coins ● Greedy creatures trying to take your coins and crown every night (stop them!) ● Loyal subjects who will help build, attack and defend your Kingdom ● Multiple upgrades for your homestead, different unit types to attack and defend, and secrets littered throughout the land ● Beautiful soundtrack that has received two honorable mentions from the Independent Games Festival Be brave, ruler, and fight to the bitter end, lest these New Lands conquer you instead.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/496300/header.jpg?t=1655469189",
    "Price": 14.99,
    "Developers": "Noio",
    "Publishers": "Raw Fury",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/496300/ss_1585b78b6f58ec3ad9f6b7b8a48f01064952ba4b.1920x1080.jpg?t=1655469189,https://cdn.akamai.steamstatic.com/steam/apps/496300/ss_a47feaf983b58fc4901d356015e86dc93b4a990b.1920x1080.jpg?t=1655469189,https://cdn.akamai.steamstatic.com/steam/apps/496300/ss_39be32c53e6129bdc754a12cd626d44ba530f10a.1920x1080.jpg?t=1655469189,https://cdn.akamai.steamstatic.com/steam/apps/496300/ss_3cf818049f7414b2d4d0b76e4d9ce265644c129b.1920x1080.jpg?t=1655469189,https://cdn.akamai.steamstatic.com/steam/apps/496300/ss_12071cdc0e7088e2730681c573a4f6021127b09c.1920x1080.jpg?t=1655469189,https://cdn.akamai.steamstatic.com/steam/apps/496300/ss_365cc31710820045b4d9438f34f6113c035299c6.1920x1080.jpg?t=1655469189,https://cdn.akamai.steamstatic.com/steam/apps/496300/ss_fdec4b69c2ac7891ead48a5e57f07c54d39992e9.1920x1080.jpg?t=1655469189,https://cdn.akamai.steamstatic.com/steam/apps/496300/ss_2accab99f642d3eb50a9886d32689d6fc65b0cc0.1920x1080.jpg?t=1655469189,https://cdn.akamai.steamstatic.com/steam/apps/496300/ss_f5d25c6ed39113da5b34461eb7b322e0854c8386.1920x1080.jpg?t=1655469189",
    "Slug": "kingdom-new-lands",
    "Meta Title": "Kingdom: New Lands: Aug 9, 2016, Noio and Full Overview",
    "Meta Description": "Looking for information on Kingdom: New Lands? Check out the release date (Aug 9, 2016), developer insights from Noio, and a complete game summary.",
    "Alt Text Image": "Official header image for Kingdom: New Lands game - Steam 496300",
    "Canonical URL": "https://gusku.site/game/kingdom-new-lands",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kingdom: New Lands\", \"description\": \"Looking for information on Kingdom: New Lands? Check out the release date (Aug 9, 2016), developer insights from Noio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Noio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Raw Fury\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/496300/header.jpg?t=1655469189\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}