{
    "AppID": 733500,
    "Name": "LOGistICAL: Russia",
    "Release date": "Feb 8, 2018",
    "About the game": "Sacada is proud to introduce LOGistICAL: Russia. A new improved version of LOGistICAL with a huge amount of interface upgrades, new functionality and new transports. LOGistICAL is a large open-world, strategy, puzzle game where you transport different cargoes to complete all the towns throughout real maps of different countries. LOGistICAL: Russia adds: - airplanes, airports, airways, airport trucks and airport zones - even more statistics - end of region and end of game data - town completion dates - broken road icons - a large amount of user interface updates including dragging without clicking and mouse over town availability - a large amount of function optimizations including multi-truck route creation optimization and find town code - more puzzles ... and the best thing is, that with Sacada's progressive development updating methodology, all these functions are also now available for all the current LOGistICAL games, including the original LOGistICAL, all the DLCs and all the standalone games... just not the planes. LOGistICAL: Russia is huge. It is over 4 times bigger than the original LOGistICAL. It is a stand alone game allowing you to just jump straight into the game. Begin with the tutorial and 'Isle of Man' module (included free and includes a game speedup) to get to know some of the LOGistICAL concepts. Then jump into LOGistICAL: Russia and start by solving the many road puzzles and follow some contracts for some in-game awards. Also begin solving the huge amount of towns. Over 5,800 towns to complete. LOGistICAL: Russia is a large open-world, strategy, puzzle game where you transport different cargoes to complete all the towns throughout the country. * Supply and finish many large cities * Work your way through the long complex maze of road enhancements to finally allow all your large trucks access across the state * Many, many other small and large puzzles and situations to complete. LOGistICAL: Russia brings you all the fun and puzzling of LOGistICAL with even more towns, more puzzles and much more to do. THIS GAME DOES NOT REQUIRE THE ORIGINAL LOGISTICAL GAME TO PLAY. Over 5800 towns to Complete. LOGistICAL: Russia game covers the country of Russia including cities like Moscow, Mokba, Saint Petersburg, Yekaterinburg, Siberia and many, many more. There are many new obstacles and deliveries to make. ... LOGistICAL: Russia is an independent, standalone game independent from the main LOGistICAL game (and other add-ons). It has its own money, trucks and of course, challenges. ... LOGistICAL is a large open-world, strategy, puzzle game where you transport different cargoes to complete all the towns throughout the country. The whole game is a huge puzzle while each town is its own little piece of puzzling. There are over 1,000 towns to complete. Plenty of towns are easy enough. Some take complex planning. Do them in your own order. Get bonuses for completing regions and contracts. Some cargoes are easy to get. Others you have to create in industries. Use existing industries and build your own. The further you get from the start the more strategies you have to use. Pimp up your trucks with bonuses. Last truck delivering gets the bonus. The towns and map are to scale. Current or historical industry placement. You could even say that playing is educational. There is plenty more to keep you on your toes. Towns consume the cargoes you are trying to get to completion. Big trucks are great for moving lots of stuff, but can't travel everywhere. There are lots of broken roads that need deliveries. Upgrade the industries for better exponential throughput. Cargo stores can sure come in handy. What! I can't take my big trucks across the water on a ferry. ... and what is with those quarantine checkpoints? Complete towns, roads, industries, contracts, regions and states for lots of in-game and Steam achievements.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/733500/header.jpg?t=1531397320",
    "Price": 19.99,
    "Developers": "Sacada",
    "Publishers": "Sacada",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/733500/ss_f194b238d055ffabb91a5ef1fbc838869e473d2b.1920x1080.jpg?t=1531397320,https://cdn.akamai.steamstatic.com/steam/apps/733500/ss_2af932c7cabef90f67fea77d9df4dbf338b0c5a7.1920x1080.jpg?t=1531397320,https://cdn.akamai.steamstatic.com/steam/apps/733500/ss_27dd89242c996323b2dd6b7658635e1c29c81a8b.1920x1080.jpg?t=1531397320,https://cdn.akamai.steamstatic.com/steam/apps/733500/ss_d9c2f130398455f26fca006ad38c0e9552cedad6.1920x1080.jpg?t=1531397320,https://cdn.akamai.steamstatic.com/steam/apps/733500/ss_292bfd1f52a68f1d850d28a47e1c9d83001dd0b0.1920x1080.jpg?t=1531397320,https://cdn.akamai.steamstatic.com/steam/apps/733500/ss_c0eef1d5becffd9ce60569bab5cd857d439d864e.1920x1080.jpg?t=1531397320,https://cdn.akamai.steamstatic.com/steam/apps/733500/ss_29f13358bd1c151847026990f978be237405ec5c.1920x1080.jpg?t=1531397320,https://cdn.akamai.steamstatic.com/steam/apps/733500/ss_6324f58862d5d8a4b5d65deb1fe6eb87236b2791.1920x1080.jpg?t=1531397320,https://cdn.akamai.steamstatic.com/steam/apps/733500/ss_a29760fb94d578f81f1d729a0599c807677b32c5.1920x1080.jpg?t=1531397320,https://cdn.akamai.steamstatic.com/steam/apps/733500/ss_b04a5d4a29080d01a872781a5e560143a7bd4a51.1920x1080.jpg?t=1531397320,https://cdn.akamai.steamstatic.com/steam/apps/733500/ss_33baf18698bec7adf28823e2f7a7b26835c35d9a.1920x1080.jpg?t=1531397320",
    "Slug": "logistical-russia",
    "Meta Title": "LOGistICAL: Russia: Feb 8, 2018, Sacada and Full Overview",
    "Meta Description": "Looking for information on LOGistICAL: Russia? Check out the release date (Feb 8, 2018), developer insights from Sacada, and a complete game summary.",
    "Alt Text Image": "Official header image for LOGistICAL: Russia game - Steam 733500",
    "Canonical URL": "https://gusku.site/game/logistical-russia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LOGistICAL: Russia\", \"description\": \"Looking for information on LOGistICAL: Russia? Check out the release date (Feb 8, 2018), developer insights from Sacada, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/733500/header.jpg?t=1531397320\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}