{
    "AppID": 875610,
    "Name": "Loop-Loop DX",
    "Release date": "Apr 20, 2020",
    "About the game": "What is Loop-Loop DX? Loop-Loop DX is a retro-style space shooter that makes extensive use of one simple idea: Going off one side of the screen and coming out the other. With the advanced tech of the spectacular 'Loop Gun', your bullets may also loop around the screen! Use this devastating weapon to blast away all who oppose you! Now... I know what you're thinking... Can I Shoot Myself With This 'Loop Gun'? Yes! This is where the minor puzzle elements come into play. Once all enemies have been defeated on-screen, you must then utilize that big brain of yours to fire the bullets around the screen and right back into you! Successfully calculating the perfectly angled shot progresses you to the next screen! So far, these are just the base elements of the game. What about the... GAMEMODES!?! This game features many game modes in which to show off your looping prowess! Adventure Mode - The main attraction! A tale of redemption and justice! You play as Commander Carl, space traveler and the esteemed Commander of... nothing. After being convicted of a minor space felony, Carl is locked up in an intergalactic super-prison known as 'The Prisom'. The only way to get out of here is to loop your way out. Prepare to take on the ruthless prison staff, as well as some of the most dangerous galactic criminals to take back your freedom! Bullet Hell Mode - The masochist's delight! Your Loop Gun has been revoked! The enemies continue their never-ending assault. Time to prove your capabilities as a professional navigator. You must dodge through a constant barrage of bullets. How long will you last? So What Makes This Game 'DX'? Years before 'Loop-Loop DX'... there was only 'Loop-Loop'. The non-DX version contained only two game modes. These game modes are being brought back in the DX version so that you can see what the game was like from way back when! Legacy Mode - The quest to discover what lies beyond! Play through the game normally and travel downwards starting from Layer 50. Discover what lies beyond Layer 0! Legacy Bullet Mode - The old masochist's delight! Dip n' dodge around bullets through the old version of Bullet Hell Mode! In this version, the bullets loop around the screen forever and constantly build up. You do not loop around the screen. Stay in that box! What Else Is There? What's that? Do you want MORE? Ok, how about all this: An INCREDIBLE Soundtrack by the excellent E-Lie! Achievements! Everybody loves these! 7 boss fights in adventure mode! 7 wildly varying zones to travel through. A bodily function as a powerup! A Rat named 'Cheese'! Lasers! Explosions! A Floppy Disk!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/875610/header.jpg?t=1587408844",
    "Price": 0.0,
    "Developers": "Alex Carpenter",
    "Publishers": "Alex Carpenter",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/875610/ss_83cefcd156d370f1bc547821f8786a3688316c68.1920x1080.jpg?t=1587408844,https://cdn.akamai.steamstatic.com/steam/apps/875610/ss_efc6f447f7cdf0feaa8611bc6fe46c72478b0b4a.1920x1080.jpg?t=1587408844,https://cdn.akamai.steamstatic.com/steam/apps/875610/ss_2702cbd140269c1fca173fbf36d11bcba79a1a72.1920x1080.jpg?t=1587408844,https://cdn.akamai.steamstatic.com/steam/apps/875610/ss_6eefbd32d7df1b23c7c396a65e67fcf6c8890737.1920x1080.jpg?t=1587408844,https://cdn.akamai.steamstatic.com/steam/apps/875610/ss_f393edcf86199b6e87f8461871f265bc120e7c2c.1920x1080.jpg?t=1587408844,https://cdn.akamai.steamstatic.com/steam/apps/875610/ss_934189ca67d1ad729931ba7c897c0663b901a691.1920x1080.jpg?t=1587408844,https://cdn.akamai.steamstatic.com/steam/apps/875610/ss_b5116660c3a3a8492f41ed86364f2d9172cb165f.1920x1080.jpg?t=1587408844,https://cdn.akamai.steamstatic.com/steam/apps/875610/ss_8179ae1bf2f20d98864ff89b6c185333fc849a4f.1920x1080.jpg?t=1587408844",
    "Slug": "loop-loop-dx",
    "Meta Title": "Loop-Loop DX: Apr 20, 2020, Alex Carpenter and Full Overview",
    "Meta Description": "Looking for information on Loop-Loop DX? Check out the release date (Apr 20, 2020), developer insights from Alex Carpenter, and a complete game summary.",
    "Alt Text Image": "Official header image for Loop-Loop DX game - Steam 875610",
    "Canonical URL": "https://gusku.site/game/loop-loop-dx",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Loop-Loop DX\", \"description\": \"Looking for information on Loop-Loop DX? Check out the release date (Apr 20, 2020), developer insights from Alex Carpenter, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alex Carpenter\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Alex Carpenter\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/875610/header.jpg?t=1587408844\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}