{
    "AppID": 1511040,
    "Name": "LOVE BAKUDAN",
    "Release date": "Jan 25, 2021",
    "About the game": "LOVE BAKUDAN is an 18+ erotic yuri dramedy, focusing on the life of Haruka Mishima. When she returns to her coastal hometown of Akiyama after a long time away, she finds that there’s much more waiting for her than just inheriting her family’s erotic bookstore, Bakudan Books. But between romancing girls and selling erotica to the locals, Haruka finds that she’s in for an even wilder ride than she expected... With the option of dating the beautiful lovelorn bartender, your cheerful best friend, a dangerous mobster, a drop-dead gorgeous firefighter, a mysterious Korean idol or a shy mangaka in the making, which girl will steal your heart away? Six unique romance routes! With an incredibly colourful cast of girls, there’s no way you won’t find yourself latching on to a favourite quickly. No two routes are the same - each route is a brand-new experience, with no repeated scenes whatsoever. Even the books and extra unlockables you get differ! Unlock and read erotic books! What would a bookstore be without its merchandise? Between twenty unlockable stories across thirty volumes, you’ll get your fill of many different erotic premises. Even if she's around it all day, the erotica that Haruka sells sometimes even catches her eye; and she loves taking the books upstairs to, uh… appreciate . They're real page-turners! 640,000+ words! Thought War and Peace was long? LOVE BAKUDAN is longer. No, seriously . That's a real statistic - this yuri-fest is huge . Between the prologue, seven unique routes, twenty erotic stories, twenty-four unlockable extras and steamy NSFW CG scenes, you will get your money’s worth. An all yuri cast across main and side characters! From the demure shrine maidens all the way to the grannies that hang out at Haruka’s store, every woman in this game loves girls. A lot. An extra special route! With a huge thanks to our most generous Kickstarter backer, we wrote up a seventh non-romanceable route for a character of their creation; the elusive Gabby Saito! Introducing a slightly more ominous tone to LOVE BAKUDAN, what will she bring upon her mysterious return back to Akiyama? We're sure it's not what anyone expects... Plot with porn! As though this wasn’t a given already, LOVE BAKUDAN places an exciting, addictive focus on individual relationships, and the eroticism that comes with each one. Between Yuki, Sei, Himeko, Teru, Angel and Akane all having their own personal problems and needs, just what lies ahead for our darling Haruka? Tons of sound effects, animations, and more! With pixel art, transitions, unique book covers, backgrounds and story-enhancing sound effects, you’ll feel totally immersed in Haruka’s daily life. Streamer mode! Want to show your friends Yuki’s cleavage and not get banned? How about your book club that meets at the library every Sunday? Don’t worry, we’ve got you (and them) covered. There will be only censored indecency here, if you enable it. Akane’s muscles! Did we mention she’s shredded? No? Okay.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1511040/header.jpg?t=1611612371",
    "Price": 19.99,
    "Developers": "Noodletub Games",
    "Publishers": "Noodletub Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1511040/ss_7d6c6b25f7c28c4c0dd28fb4baa2c704e9f1e2d4.1920x1080.jpg?t=1611612371,https://cdn.akamai.steamstatic.com/steam/apps/1511040/ss_2eefdcc52373922f128b2c10d13db87abe755222.1920x1080.jpg?t=1611612371,https://cdn.akamai.steamstatic.com/steam/apps/1511040/ss_32cdac0e8c57a5e1337be17d9fb4e5aa108d53dd.1920x1080.jpg?t=1611612371,https://cdn.akamai.steamstatic.com/steam/apps/1511040/ss_305fb50217a9b200ed266458e3d4f504934fd4fb.1920x1080.jpg?t=1611612371,https://cdn.akamai.steamstatic.com/steam/apps/1511040/ss_43372fd3547522aa55c4b39d771c6b3df0171818.1920x1080.jpg?t=1611612371,https://cdn.akamai.steamstatic.com/steam/apps/1511040/ss_d0f2fe54b8be0c0f7855e4bb7c3c4db9d5e218be.1920x1080.jpg?t=1611612371,https://cdn.akamai.steamstatic.com/steam/apps/1511040/ss_fce82d8e3483d8f820c92fe8b92a35df8b515751.1920x1080.jpg?t=1611612371",
    "Slug": "love-bakudan",
    "Meta Title": "LOVE BAKUDAN: Jan 25, 2021, Noodletub Games and Full Over...",
    "Meta Description": "Looking for information on LOVE BAKUDAN? Check out the release date (Jan 25, 2021), developer insights from Noodletub Games, and a complete game summary.",
    "Alt Text Image": "Official header image for LOVE BAKUDAN game - Steam 1511040",
    "Canonical URL": "https://gusku.site/game/love-bakudan",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LOVE BAKUDAN\", \"description\": \"Looking for information on LOVE BAKUDAN? Check out the release date (Jan 25, 2021), developer insights from Noodletub Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Noodletub Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Noodletub Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1511040/header.jpg?t=1611612371\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}