{
    "AppID": 1128910,
    "Name": "Magic Quest: TCG",
    "Release date": "Sep 3, 2019",
    "About the game": "Welcome Summoner! Create your Hero and summon minions to defeat your enemies in this Epic Adventure! There are tons of different classes to discover an infinite number of different cards to collect! What are you waiting for? Choose and level up your hero! Gather and collect minions to summon on your battles Fight Cross-platform PvP battles against your friends or random players all around the world Fight through a never ending campaign, constantly updated and with awesome rewards! Join a Guild! Fight Raid Battles solo or with your Guild mates Complete Dungeons to get special awards “You wake up dazed at dawn; your back is still moist from sleeping on the withered moss of Emerald Forest. With the first rays of light, the dew on the plants leafs of the forest looks better than ever, no one would say what happened here a few hours ago… You feel some pain in the ankles and arms, you have undoubtedly been bound hands and feet for some hours and have been stripped of all your creatures and your gold, someone has to pay for this; someone will pay for this. It’s time to start from scratch and get your revenge.” Magic Quest: TCG tells the story of a Summoner who is snatched away of all his belongings and seeks revenge. You will be able to choose among an extended list of Classes such as Warrior, Mage, Hunter, etc… Level up throughout the campaign and build Armies of Creatures that you will summon in Battle; discover the ruins of Sunfury Kingdom or become a Knight of the Radiant Army, the world of Magorbis awaits you! Key Features: Cross Platform: Mobile, Browser and Desktop platforms together, the more players; the funnier it gets! Competitive PvP: Play against random Summoners and climb up the ladders to reach the 1st position Guilds: Join a Guild and get special rewards! Dungeons &amp; Raids: Play solo or with your Guild mates. Craft: Upgrade cards to their final phase! Classes: Choose among 11 different classes, level them up and get Unique rewards! Weekly / Monthly Tournaments (PvP/Dungeons): Your efforts will be rewarded! Deck Builder: Build your own decks for different Classes. Exclusive Cards Artwork: Beautiful pieces of art for your enjoyment! A Magic Quest is waiting for you, wait no more!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1128910/header.jpg?t=1623163196",
    "Price": 0.0,
    "Developers": "FrozenShard Games",
    "Publishers": "FrozenShard Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1128910/ss_90e61c6e835a927670bb2baef3f7b43aa5f2543d.1920x1080.jpg?t=1623163196,https://cdn.akamai.steamstatic.com/steam/apps/1128910/ss_602c026b82131127d58dac4d021808ed0e298ca9.1920x1080.jpg?t=1623163196,https://cdn.akamai.steamstatic.com/steam/apps/1128910/ss_2bf1972e65b4c79c692f436d898ebf3888743f1f.1920x1080.jpg?t=1623163196,https://cdn.akamai.steamstatic.com/steam/apps/1128910/ss_5f1f0d547c0ac9fe51e8c3b3d5e08fc891cb6ca0.1920x1080.jpg?t=1623163196,https://cdn.akamai.steamstatic.com/steam/apps/1128910/ss_d9b041aadd53345fe9d746ae32917984914b1cda.1920x1080.jpg?t=1623163196",
    "Slug": "magic-quest-tcg",
    "Meta Title": "Magic Quest: TCG: Sep 3, 2019, FrozenShard Games and Full...",
    "Meta Description": "Looking for information on Magic Quest: TCG? Check out the release date (Sep 3, 2019), developer insights from FrozenShard Games, and a complete game su...",
    "Alt Text Image": "Official header image for Magic Quest: TCG game - Steam 1128910",
    "Canonical URL": "https://gusku.site/game/magic-quest-tcg",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Magic Quest: TCG\", \"description\": \"Looking for information on Magic Quest: TCG? Check out the release date (Sep 3, 2019), developer insights from FrozenShard Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 3, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"FrozenShard Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FrozenShard Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1128910/header.jpg?t=1623163196\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}