{
    "AppID": 1152160,
    "Name": "Might is Right",
    "Release date": "Feb 19, 2021",
    "About the game": "Might is Right is an old-school turn-based strategy game. It has simple controls and deep complex mechanics. You take control of a squad of up to 6 characters, including your hero and 5 mercenaries. You explore a huge world fighting your way through the troops of numerous enemies. Each character gains experience in combat, as well as new levels, increasing parameters and receiving talent points. The number of levels is unlimited. Each character has their own talent tree, offering completely different play styles. The talents allow you to develop tactical roles in combat – or even change them. For example, fragile mages can turn into full-fledged tanks, harmless healers are able to return decent damage, and damage dealers can heal their allies effectively. Tactical combat games can be simple and fun, but they often lack depth and customization. For example, you can have 4 fighters to choose from and each of them might have, say, 4 perks that only slightly diversifies their abilities. 'Only' is the keyword here. We wanted to change that, so we made a game that brings simple and fun tactical squad combat and combines it with character customization and mechanical depth found in RPGs to make something completely new. The game features two familiar modes that you can switch between: Adventure mode Your squad freely moves across the map, collects treasures, visits various settlements and completes quests. Combat mode While exploring the world, you regularly encounter enemy units. The game switches to combat mode, and then everything depends on your tactical and strategic skills. You will win... or you will lose. If things get too tough, you can always run away. Game Features ~16-hour campaign with procedurally generated enemies 8 heroes, 18 mercenaries with different abilities, and 3 unique mercenaries who can be recruited during the game more than 200 unique talents complex talent trees for each character 8 unique boss battles 183 equipment items to discover 13 item sets with different set bonuses 87 consumable items (food, potions, scrolls, books, grindstones, defense enhancers, and unique items that permanently increase parameters) fast and powerful state-of-the-art AI, able to adapt to any (without exaggeration) situation turn-based tactical combat contextual tutorial that delicately gives useful advice as you explore the world achievement system (more than 80 achievements) 40 NPCs who are eager to give your hero their tasks and willingly provide him with information robbers and racketeers of all kinds who are ready to attack you at the most inopportune moment and demand a ransom Talents Each character gains experience in combat and earns new levels. At each level, your hero and all units receive talent points to spend, the same applies to enemies. Every character has their own talent tree. It allows you to develop it in a variety of tactical directions. Every character has their own talent tree with options that offer very distinct play-styles. Thus, one and the same archer can be turned into a fast and unkillable tank or a slow and fragile killer; into a specialist in the destruction of armored warriors or an elemental and witch hunter; into a real nightmare for all healers and magicians or a debuffer hated by enemies. Challenge In Might is Right, you have to make a lot of decisions and choices. The game features state-of-the-art AI that adequately responds to your mistakes and risky strategies. This, together with careful hand-tuning of the world, guarantees that you will have your own adventure with a selection of challenges designed specifically for you. Might is Right is non-linear, so if it gets too hard or too easy, you can always take a different road. And each experience will not be like the previous one.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1152160/header.jpg?t=1653596070",
    "Price": 9.99,
    "Developers": "Lazy Kitty",
    "Publishers": "Lazy Kitty",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1152160/ss_e3247009a11b15a7f20f858ecdb6428104357267.1920x1080.jpg?t=1653596070,https://cdn.akamai.steamstatic.com/steam/apps/1152160/ss_ab9a1c8b575d8bef3892074302eacc0342116c3d.1920x1080.jpg?t=1653596070,https://cdn.akamai.steamstatic.com/steam/apps/1152160/ss_484c4cc95fa20a050d58c42f90264659635ce756.1920x1080.jpg?t=1653596070,https://cdn.akamai.steamstatic.com/steam/apps/1152160/ss_1dcc4a032341a8b3df90733893c8636d050e33e0.1920x1080.jpg?t=1653596070,https://cdn.akamai.steamstatic.com/steam/apps/1152160/ss_5d9677f8483931fd4e7ae56bdce70b978c381a13.1920x1080.jpg?t=1653596070,https://cdn.akamai.steamstatic.com/steam/apps/1152160/ss_4c040a14f661fc20566670c64b89b265415ab0a0.1920x1080.jpg?t=1653596070,https://cdn.akamai.steamstatic.com/steam/apps/1152160/ss_e18ae4b28f62a71159d631df6f1004a5958672a1.1920x1080.jpg?t=1653596070,https://cdn.akamai.steamstatic.com/steam/apps/1152160/ss_73139d941daef483f345e84c3e2e90ca8a7d410b.1920x1080.jpg?t=1653596070,https://cdn.akamai.steamstatic.com/steam/apps/1152160/ss_5c40d6e84fb4f295f3b9e34710d97e23255a4e13.1920x1080.jpg?t=1653596070,https://cdn.akamai.steamstatic.com/steam/apps/1152160/ss_9e5cc97032cf26bcc408daaff5d09a5f1049c68f.1920x1080.jpg?t=1653596070,https://cdn.akamai.steamstatic.com/steam/apps/1152160/ss_ddae746316140dbac344b3aed85f0d408eb637a5.1920x1080.jpg?t=1653596070",
    "Slug": "might-is-right",
    "Meta Title": "Might is Right: Feb 19, 2021, Lazy Kitty and Full Overview",
    "Meta Description": "Looking for information on Might is Right? Check out the release date (Feb 19, 2021), developer insights from Lazy Kitty, and a complete game summary.",
    "Alt Text Image": "Official header image for Might is Right game - Steam 1152160",
    "Canonical URL": "https://gusku.site/game/might-is-right",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Might is Right\", \"description\": \"Looking for information on Might is Right? Check out the release date (Feb 19, 2021), developer insights from Lazy Kitty, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lazy Kitty\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lazy Kitty\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1152160/header.jpg?t=1653596070\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}