{
    "AppID": 1371800,
    "Name": "My Nuclear Octopus",
    "Release date": "Aug 4, 2020",
    "About the game": "If you love old style, pure of heart out-and-out arcade gaming, you and My Nuclear Octopus may just be on the verge of a beautiful friendship. NOTE: Due to a lot of flashing lights, this game is NOT recommended for folks with any photosensitive medical conditions. Walking into an amusement arcade during the 1980's overwhelmed your senses. The audio from every arcade machine screamed out for attention, each one fighting to grab the passer by, begging for you to feed it with coins. My Nuclear Octopus is what might have happened had I been born a few years earlier and landed a job designing arcade games in 1984. It's loud, it's simple to pick up and it's tough as old badgers. The graphics are crunchy old sprites, something you might see in an old Commodore 64 game, a BBC Micro game or maybe even an 80's arcade. The logic is simple - you play for a few minutes, you get as far as you can, the game ends. Next time, you play again and try to beat your score. Somewhere along the way, the rest of the world disappears and you find yourself one with the Octopus, in some kind of harmony with the game as, for a short time at least, 100% of your focus goes into keeping back the marauders from another dimension. Lose yourself for a short time, just like we did in the old days. The story so far: Octopi is under attack! A space dimension portal has been opened and strange beasts from the 1% dimension are getting through. It's all up to my Nuclear Octopus to save the universe, using its magical ink to send them back to their own dimension. How to play? Move up and down, fire left or right. Defeat all enemies to go to the next level. Beat level 42. Defeat 'The Boss'. Bask in your awesomeness. Features: The original 2014 hit OUYA game is now turbocharged with an engine upgrade, new enemies and features. It's an undiscovered gem from an undiscovered platform! Visuals that will make your eyes blow up Keyboard or game controller Retro chunky pixel graphics at 60fps Achievements!? ('back in my day, we didn't have achievements..') An online leaderboard 42 challenging levels and a tough boss battle! Multi-coloured explodipus! 80's arcade style sound effects A giant eyeball in the middle of the play area Keyboard controls: -Use A and D to choose firing direction left or right. -UP and DOWN arrow keys move.. yep, up and down. -Press SPACE to activate multi coloured explodipus. You get one *per level*. Xbox controller controls: -Hold right stick left or right to fire. -Left stick up or down to move up or down. -Press X,Y,B or A to activate multicoloured explodipus. You get one *per level*",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1371800/header.jpg?t=1626916959",
    "Price": 1.99,
    "Developers": "Tea Monster Games,PsychicParrot",
    "Publishers": "Tea Monster Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1371800/ss_5e3dbc2b638cf9176c40d1184561cde539b453a7.1920x1080.jpg?t=1626916959,https://cdn.akamai.steamstatic.com/steam/apps/1371800/ss_3542cfdb629425ab920366f36a2e88eb78e7f3c5.1920x1080.jpg?t=1626916959,https://cdn.akamai.steamstatic.com/steam/apps/1371800/ss_79d7d61c37d0e9aeb3d7343bae4dd92207e8d93f.1920x1080.jpg?t=1626916959,https://cdn.akamai.steamstatic.com/steam/apps/1371800/ss_f8cc753cf38f2c6a96cb44d2bc7c28c2e3521fd7.1920x1080.jpg?t=1626916959,https://cdn.akamai.steamstatic.com/steam/apps/1371800/ss_3d816201d7dc1913dbf305cf6efb96751b11c890.1920x1080.jpg?t=1626916959",
    "Slug": "my-nuclear-octopus",
    "Meta Title": "My Nuclear Octopus: Aug 4, 2020, Tea Monster Games,Psychi...",
    "Meta Description": "Looking for information on My Nuclear Octopus? Check out the release date (Aug 4, 2020), developer insights from Tea Monster Games,PsychicParrot, and a ...",
    "Alt Text Image": "Official header image for My Nuclear Octopus game - Steam 1371800",
    "Canonical URL": "https://gusku.site/game/my-nuclear-octopus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"My Nuclear Octopus\", \"description\": \"Looking for information on My Nuclear Octopus? Check out the release date (Aug 4, 2020), developer insights from Tea Monster Games,PsychicParrot, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tea Monster Games,PsychicParrot\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tea Monster Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1371800/header.jpg?t=1626916959\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}