{
    "AppID": 558110,
    "Name": "Odyssey - The Story of Science",
    "Release date": "Apr 19, 2017",
    "About the game": "Odyssey is a unique science adventure game where you need to navigate across a group of islands in search of a 13-year old girl Kai and her family trapped and waiting to be rescued. The game has an explicit purpose of teaching astronomy and mechanics from the ancient Greeks to Galileo. It does so by taking the player through an intellectual journey as the player is physically navigating through the islands. Gaming is seamlessly integrated with a historical approach to science and storytelling, through Kai's in-game journal from which the player learns the story and the science content, which are needed to solve the puzzles. Players can expect a significant amount of reading. The game is aligned to the Next Generation Science Standards and is ideal for middle school and high school students and for adults who like to read about science. 'Imaginative and compelling' -- Noam Chomsky, Professor Emeritus of Linguistics and Philosophy, MIT 'An extraordinary step for science education' -- Bryan Brown, Associate Professor of Science Education, Stanford University. 'An innovative historical approach to teaching science' -- Jonathan Osborne, Professor of Science Education, Stanford University 'A wonderful 21st century meld of ideas' -- David Mumford, Fields Medalist, National Medal of Science Winner and Professor Emeritus at Brown and Harvard Universities Details: Drawn to one of the remote and uninhabited Wretched islands (in the Caribbean) by the distress call of 13- year old Kai, you find that all across the islands are barricades set up by her family, who are expecting a small group of unscrupulous sailors (pirates) to return to haunt them on the islands. At the same time, the family wants to allow rescuers to reach them. So while they expect the barricades to keep away the pirates at least for some time, they hope that a rescuer would be able to get through, with the help of clues planted by Kai inside fragments of text that the player would find scattered across the islands. These fragments are pages from her journal that she wrote during her stay on the uninhabited islands, while her archaeologist Dad worked hard to excavate valuable Carib artifacts from the islands. She not only recorded the events that happened in her journal, but also her intellectual journey across 2000 years of astronomy and physics through Socratic dialogues with Dad, and her own observations and experiments guided by those conversations. She and her brother Sid also build a number of physical models as she debates, critiques and argues for her point of view with Dad. All of that is recorded in her journal. But after a few unpleasant encounters with some nosy sailors, the last of which leaves the family stranded on the islands with their boat and radio smashed, and only a few days of time given to them to turn in all the valuable artifacts (including treasure) that the sailors believe Dad has found, they decide to plant barricades all over the islands to buy some time, since Dad's graduate students are expected to arrive within a month. To leave them clues about how to solve the puzzles, Kai tears up her journal and plants fragments all over the islands, so that the fragment in each place has clues relevant to the puzzle at that place. The puzzles are arranged in a sequence that mirrors the chronological progression of ideas in astronomy and mechanics. So the player would be learning the history of astronomy and mechanics in a systematic sequence as he/she navigates through the islands. The first game which is being released in Early Access covers Chapters 1-3 of the adventure. Chapter 1 covers the origins of science, and the shift from the flat earth of the Pre-socratics to the spherical earth and physics of Aristotle. Chapter 2 covers the shift from the geocentric universe of Ptolemy to the heliocentric universe of Copernicus and Galileo. Chapter 3 covers the tussle between Galileo and the followers of Aristotle on free fall motion. The third chapter ends midway through Galileo's physics and we plan to continue the story in a sequel game, which would cover the following chapters: Chapter 4 would cover the mathematics of uniformly accelerated motion as developed by Galileo (1D kinematics). Chapter 5 would cover Galileo's ideas about inertia and the mathematics of projectile motion (2D kinematics) . Chapter 6 would complete the birth of a new physics with the construction of the three Laws of Motion and Universal Gravitation by Newton. Meant for ages 11+.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/558110/header.jpg?t=1527435860",
    "Price": 14.99,
    "Developers": "The Young Socratics",
    "Publishers": "The Young Socratics",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_0faf0af4472f099ea29fa58884a5e37aa6b1feb2.1920x1080.jpg?t=1527435860,https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_eb85c53832de0c1e877e8affc9d0fbd017c0cfb1.1920x1080.jpg?t=1527435860,https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_ac44c1375bb6ccc823663475cc2b4e1107d617f9.1920x1080.jpg?t=1527435860,https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_75089a84fe305704e4f509a28a586591446324a3.1920x1080.jpg?t=1527435860,https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_7119bc5fcf9366a7bd6d3d557cdfffbf8a9407c8.1920x1080.jpg?t=1527435860,https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_d0978ff66e4c9a381d871e967cb2b80f7bbf848a.1920x1080.jpg?t=1527435860,https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_595887153b17c74dd3cc0b8c730bd37a2a3466d5.1920x1080.jpg?t=1527435860,https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_f81b96e29f3a24938e6cf842e051866dde152f34.1920x1080.jpg?t=1527435860,https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_a5d6cf18683d7b9de46ccf98b95ed014db661d2f.1920x1080.jpg?t=1527435860,https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_a44d275d395fe5a6d4088819f81e643321764c73.1920x1080.jpg?t=1527435860,https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_a633c60b32a69663991896cf28babd2ccef2f6da.1920x1080.jpg?t=1527435860,https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_2b3ab1dbc64dbdc92292e10b1144bb087dbdeb67.1920x1080.jpg?t=1527435860,https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_01b9c18746b7e5b25a19bc9ddb1e0a1c59f5327a.1920x1080.jpg?t=1527435860,https://cdn.akamai.steamstatic.com/steam/apps/558110/ss_5d2a00a29bd83f04c3bd16bbb96a03ca3c1eec10.1920x1080.jpg?t=1527435860",
    "Slug": "odyssey-the-story-of-science",
    "Meta Title": "Odyssey - The Story of Science: Apr 19, 2017, The Young S...",
    "Meta Description": "Looking for information on Odyssey - The Story of Science? Check out the release date (Apr 19, 2017), developer insights from The Young Socratics, and a...",
    "Alt Text Image": "Official header image for Odyssey - The Story of Science game - Steam 558110",
    "Canonical URL": "https://gusku.site/game/odyssey-the-story-of-science",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Odyssey - The Story of Science\", \"description\": \"Looking for information on Odyssey - The Story of Science? Check out the release date (Apr 19, 2017), developer insights from The Young Socratics, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 19, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Young Socratics\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Young Socratics\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/558110/header.jpg?t=1527435860\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}