{
    "AppID": 936930,
    "Name": "Oil Baron",
    "Release date": "Sep 20, 2018",
    "About the game": "The game has 7 locations with special tasks. You must fulfill them until the end of the day. It can be used to collect N amount of oil or earn several thousand $. To start playing, you need to choose the complexity of the game. There are 5 difficulty levels (easy-normal-difficult-very complicated-insane). It is recommend to put it on easy or normal to start. After selecting the difficulty, you are moved to the location selection. At each of the locations there is a different atmosphere. When you hit the location you are given the opportunity to look around, after which you can hire a geologist for $ 200, which shows the approximate location of the oil. Or you can manually guess the source. At light levels of complexity, oil is often seen on the surface, so the complexity within the search is minimized. Buy an oil rig for $ 1000, and immediately after you can buy an oil storage tank. After installing the tank, you choose the depth of the well. The deeper, the more money you need to spend. You can be lucky and get an oil, but you if missed a bit - you can hit the edge of the source. Every second the oil source becomes smaller, and as a result, the oil rig stops working. At this point the game is not FINISHED. You can sell the current tower for $ 400 together with the tank and set a NEW one. You can buy an unlimited number of towers, but at one location there can't be no more ONE. After the tank has the right amount of oil you put it in a bucket and carry it for sale. Do not put the tower too far from the market. Time is important here. The rate can random pop up between 0.20 $ / 1 unit of oil (in one bucket without pumping 15 units of oil). Wait for a better course ($ 3-4) and then sell. For each oil sale you get 15 units of experience, when you reach the right amount, you level-up. You get improvements for each level. You spend them on a bunch buns that improve the gameplay and make it more dynamic, everything happens faster. Features: -achievements; -pleasant graphics; -simple management; -interesting gameplay; -light music; -unforgettable adventures; -available in 2 languages; Control F for the full screen.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/936930/header.jpg?t=1555770375",
    "Price": 1.99,
    "Developers": "GiBar",
    "Publishers": "RoBot",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/936930/ss_0200897495ee5c8bf6626c335c92798a68ae8439.1920x1080.jpg?t=1555770375,https://cdn.akamai.steamstatic.com/steam/apps/936930/ss_5982f3a05d98dfd9f6302835eac3bf689d6fe030.1920x1080.jpg?t=1555770375,https://cdn.akamai.steamstatic.com/steam/apps/936930/ss_b76b4761b2644237a4bc1ca893b2884aa1a2b7c0.1920x1080.jpg?t=1555770375,https://cdn.akamai.steamstatic.com/steam/apps/936930/ss_00b7415ec090bc01605e88023123af78339d10e8.1920x1080.jpg?t=1555770375,https://cdn.akamai.steamstatic.com/steam/apps/936930/ss_d401adfd955669794b38842aaa41c8b3bf133dd9.1920x1080.jpg?t=1555770375,https://cdn.akamai.steamstatic.com/steam/apps/936930/ss_d3dc5734541a998643332fc2b92950174d75cfae.1920x1080.jpg?t=1555770375",
    "Slug": "oil-baron",
    "Meta Title": "Oil Baron: Sep 20, 2018, GiBar and Full Overview",
    "Meta Description": "Looking for information on Oil Baron? Check out the release date (Sep 20, 2018), developer insights from GiBar, and a complete game summary.",
    "Alt Text Image": "Official header image for Oil Baron game - Steam 936930",
    "Canonical URL": "https://gusku.site/game/oil-baron",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Oil Baron\", \"description\": \"Looking for information on Oil Baron? Check out the release date (Sep 20, 2018), developer insights from GiBar, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 20, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"GiBar\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"RoBot\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/936930/header.jpg?t=1555770375\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}