{
    "AppID": 347950,
    "Name": "Palace of Cards",
    "Release date": "Dec 14, 2017",
    "About the game": "Palace of Cards is the online platform for card game enthusiasts of classic card games. Play 6 distinct games: Rummy, Solitaire, Mau-Mau (Crazy 8s), Skat, Sheepshead and Doppelkopf, each with its own community and ranking systems. Play with or against your friends or meet new people in the game. Join clubs to discuss the game and reach the top in our club league or fight on your own in the solo leagues. Each game comes with a variety of customizable rules so that you can play the games the way that you like them best. We offer statistics that give you valuable insights to help you improve your skill, tournaments if you like a challenge, help and tutorials to get you started, private tables with friends, live awards for the best players and much more. RUMMY Rummy, the game for your whole family. Collect and match groups of cards and be the first to play all their cards in melds. The pacing is relaxed and you will have plenty of time to finish your turn. If you prefer you can join a private table with additional rules like “Knocking”, “No Jokers”, “Cyclic Laying” or any combination of the available custom rules. Play Rummy the way you like it. SOLITAIRE Solitaire is the world famous casual puzzle game. But what seems to be a quite lonesome activity on other platforms is a multiplayer experience you shouldn't miss out. Every player will receive the same set of cards and the one to solve it in the most efficient way wins the game. Take some time and consider your move. In the end, this move can separate the losers from the winners. And if the standard game is not your taste, try some custom rules, for example “Turn Three”, “Relaxed” (all cards revealed) or “Jokers”. Or give a try to “Easthaven”, the hardest Solitaire variant we could find. MAU-MAU ( CRAZY EIGHTS ) Who doesn’t know it, the game with which you bring your friends to the boiling point? Your opponent places a Seven? Bad for him, you also have one – draw 4 cards from the stack, my friend. Mau-Mau (Crazy Eights) has always put your friendships to a test but also bound them even more. At the Palace of Cards, you will meet new and old friends alike. Don't like our default rule set? Play with “Jack on Jack”, “Idiot Mau-Mau”, 'Nines Switch Direction”, “Extra turn on Ace” and many more. We don’t really care, as long you have fun. We promise you will. SKAT The pub classic is famous, especially in Germany. This game has received the highest score for any card game on boardgamegeek.com and there is a reason why. Strategy and tactical thinking are required if you want to take on the ladder in the Palace. The standard tables follow the international Skat tournament ruleset but you also can try our custom rules like “Contra and Re”, “Ramsch” and many other famous variants. Join a club to discuss and learn with advanced players or analyze your games in our replay feature. You can always improve your skills by keeping track with your statistics or talking to other players to get the best tips and tricks. So, take your cards and join a table! SHEEPSHEAD If you love Bavaria this game is for you. As the ancestor of Skat, Sheepshead is the favorite card game of Bavarians and Franconians and is perceived as cultural heritage. It is usually played with the Bavarian or Franconian card deck, which look very different to regular card decks. This tradition adds a unique flair to the game. Thus it fits perfectly that Sheepshead features a whole lot of mostly funny pearls of wisdom like: “Schene Leit ham scho oiwei schiache Kartn”. Well, you could try to translate this (and fail) but you also could join the game and ask a real Bavarian. Take your cards to the hand and play up! DOPPELKOPF Doppelkopf is a trick-taking card game with a twist. Four players compete against each other in teams of two, but the teams are unknown at the beginning of every round. Each card exists twice and the players with the queens of clubs are playing together. Only when the first queen of clubs has been played, the second player knows his partner and can start to give him hints with his cards. Can you identify your partner fast enough before the game is lost? But don't let your opponents deceive you... By downloading our game you agree to our terms &amp; conditions and our privacy policy. Terms &amp; conditions: -palast.de/terms-conditions/ Privacy policy: -palast.de/privacy-policy-apps/",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/347950/header.jpg?t=1546969988",
    "Price": 0.0,
    "Developers": "Spiele-Palast GmbH",
    "Publishers": "Spiele-Palast GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/347950/ss_f4fe7f2e9def5bf42ea13bca2b76c3fe9a30c9f9.1920x1080.jpg?t=1546969988,https://cdn.akamai.steamstatic.com/steam/apps/347950/ss_a468e6e93106d72be0449457027f039f5e820716.1920x1080.jpg?t=1546969988,https://cdn.akamai.steamstatic.com/steam/apps/347950/ss_176cf566d514495323dc25939a11b9149f75e06b.1920x1080.jpg?t=1546969988,https://cdn.akamai.steamstatic.com/steam/apps/347950/ss_290bfeb38371ed30a214e25d4359da9e1cd5c04e.1920x1080.jpg?t=1546969988,https://cdn.akamai.steamstatic.com/steam/apps/347950/ss_8b8c7ca390ff3d489f7a4272eaf49b8e4a327afb.1920x1080.jpg?t=1546969988,https://cdn.akamai.steamstatic.com/steam/apps/347950/ss_b5041ab2bd2a826506bdd80d0e553d39f035e7a1.1920x1080.jpg?t=1546969988,https://cdn.akamai.steamstatic.com/steam/apps/347950/ss_894a81bca8c6becd18f669fd4af1deab094fbdc2.1920x1080.jpg?t=1546969988,https://cdn.akamai.steamstatic.com/steam/apps/347950/ss_ad5f63ea2d1e95be19906f3da4c71c386b706240.1920x1080.jpg?t=1546969988,https://cdn.akamai.steamstatic.com/steam/apps/347950/ss_c2a7a7d205b87dabc72da898bae0d584774e29d9.1920x1080.jpg?t=1546969988,https://cdn.akamai.steamstatic.com/steam/apps/347950/ss_ef94d05cb3c838690eff83f39e83fb2cf2cfc044.1920x1080.jpg?t=1546969988",
    "Slug": "palace-of-cards",
    "Meta Title": "Palace of Cards: Dec 14, 2017, Spiele-Palast GmbH and Ful...",
    "Meta Description": "Looking for information on Palace of Cards? Check out the release date (Dec 14, 2017), developer insights from Spiele-Palast GmbH, and a complete game s...",
    "Alt Text Image": "Official header image for Palace of Cards game - Steam 347950",
    "Canonical URL": "https://gusku.site/game/palace-of-cards",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Palace of Cards\", \"description\": \"Looking for information on Palace of Cards? Check out the release date (Dec 14, 2017), developer insights from Spiele-Palast GmbH, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Spiele-Palast GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Spiele-Palast GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/347950/header.jpg?t=1546969988\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}