{
    "AppID": 668320,
    "Name": "Perilous Warp",
    "Release date": "Oct 20, 2020",
    "About the game": "Perilous Warp is a fast-paced indie 3D-action, a retro-shooter with a pretty simple but still intriguing storyline. Get ready to meet the new perilous world of a mysterious desolated extraterrestrial Colony. But is the Colony abandoned indeed? Game Features Optional Storyline: either learn everything about the tragic events that took place at the base, or skip the boring stuff and plunge into the action. Classic Combat System: find new deadly weapons at the base, from a classic shotgun to an advanced railgun, as well as a way to upgrade each gun. Diverse Bestiary: your enemies will run, swim, pounce or dig out; they will be anything but a piece of cake. Explore the World: look for stashes and secret places, visit optional offshoots, and get Steam achievements. Scalable Graphics: our game engine implements many modern graphics technologies, but at the same time it can support weak systems. Save Anywhere: in Perilous Warp you can save your progress wherever you like, and as often as you like; there are also autosaves. Accept the Challenge: for certain gamers, the game can be real hardcore - no health regeneration, no navigation arrows, no bullshit! Is it Retro Indeed? Looking for real immersion into the roaring nineties? Perilous Warp is here to fulfil your dreams! Go to the graphics options ('Settings' → 'Graphics' → 'Advanced Graphics Settings') and choose one of the Retro Mode presets. Now you can paint walls with pixelated blood, just like in the good old days. True oldschool fans should also enable 8-bit/11kHz audio in the sound options. The Story 2047 a.d. Within a distant stellar system, astronomers find an Earth-like exoplanet. It turns out that a composition of its atmosphere is similar to Earth's, and it could be suitable for humans. However existing space technologies do not allow reaching the planet in the near future. 2049 a.d. A meteorite consisting of an unknown mineral hits the Earth. Its shape and internal structure suggests that its nature is artificial, so it is probably a fragment of some extraterrestrial object. Attention of scientists is drawn to extremely unusual properties of the crysterite, as they called the mineral: it can create 'warps', or hyperspace rifts. The first teleporters have been constructed, and then, a bit later, an experimental hyperspace engine for an insterstellar spacecraft. However it is one of a kind, due to extreme shortage of crysterite. Thorough search for the precious mineral is immediately initiated. Finally, traces are found in an emission spectrum of the exoplanet discovered two years ago. There are no doubts in the decision to send an expedition to the planet. 2050 a.d. A spaceship equipped with the hyperspace engine, with scientists, builders, security guards, necessary equipment and materials onboard, makes its way to the planet, to found a colony. People successfully land on the planet, build a base, discover crysterite mines and start their development. Six months have passed according to a plan, the first shipment of the mineral is about to be sent back to Earth, but suddenly the communication with the Colony has been interrupted. The immense crysterite amounts at the Colony resulted in vast teleportation network throughout the base - but it was not the case for Earth. The only physical connection with the colony is an emergency input teleporter; the output counterpart is located at the Colonial base. Its low capacity only allows sending a small amount of vital cargo... or one fully equipped soldier - you. You, as an experienced space marine, get an important task: go to the exoplanet through the emergency teleporter and find out what has happened to the Colony. Most likely you also have to find the spaceship - a fortified citadel - and try to reestablish the uplink. You don your favourite armour, take your trusty army knife, and bravely step into the teleporter with the desire for glorious adventures. Sources of Inspiration We do love classic old-school 3D-shooters from late 1990s and early 2000s. The development of Perilous Warp was inspired by such masterpieces as Quake II, Half-Life, Unreal, Doom III, and certainly the brilliant game Chasm: The Rift. Old school players will discover numerous references, but even if you are not in your thirties yet - rest assured that you won't be bored!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/668320/header.jpg?t=1616988854",
    "Price": 14.99,
    "Developers": "Crystice Softworks",
    "Publishers": "Crystice Softworks",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/668320/ss_ac85367299c1316ba458cdd81d776adf0afafbbb.1920x1080.jpg?t=1616988854,https://cdn.akamai.steamstatic.com/steam/apps/668320/ss_f6c90d004ebc8accf9b65dbcbd2e24236b3e523f.1920x1080.jpg?t=1616988854,https://cdn.akamai.steamstatic.com/steam/apps/668320/ss_6dceec6d09c0db8badcf8de4e8bf459f8ce43898.1920x1080.jpg?t=1616988854,https://cdn.akamai.steamstatic.com/steam/apps/668320/ss_e93ee381a1fca85bcde302aedce662d9c03d25fe.1920x1080.jpg?t=1616988854,https://cdn.akamai.steamstatic.com/steam/apps/668320/ss_25b32af47f35c596df5c588a53885e7319d47dfe.1920x1080.jpg?t=1616988854,https://cdn.akamai.steamstatic.com/steam/apps/668320/ss_c4df73ff956ff003f09edffd464ea7f383703235.1920x1080.jpg?t=1616988854,https://cdn.akamai.steamstatic.com/steam/apps/668320/ss_3a192cbc84059c6c11099e2cc6fb4711c7de5711.1920x1080.jpg?t=1616988854,https://cdn.akamai.steamstatic.com/steam/apps/668320/ss_9e4151a3981ba25e4dcb15b3d63ad19d4860618a.1920x1080.jpg?t=1616988854,https://cdn.akamai.steamstatic.com/steam/apps/668320/ss_684bfe1a756912bf590c262fade39b81f6135e92.1920x1080.jpg?t=1616988854,https://cdn.akamai.steamstatic.com/steam/apps/668320/ss_3cda0bf79cb82993fb63ca33b9c27658a1481318.1920x1080.jpg?t=1616988854,https://cdn.akamai.steamstatic.com/steam/apps/668320/ss_a26d0ca005ad350186f8bf3a566c762d01b3198e.1920x1080.jpg?t=1616988854,https://cdn.akamai.steamstatic.com/steam/apps/668320/ss_bd5a76065d0397f013a070b251d8f4bef016cd70.1920x1080.jpg?t=1616988854",
    "Slug": "perilous-warp",
    "Meta Title": "Perilous Warp: Oct 20, 2020, Crystice Softworks and Full ...",
    "Meta Description": "Looking for information on Perilous Warp? Check out the release date (Oct 20, 2020), developer insights from Crystice Softworks, and a complete game sum...",
    "Alt Text Image": "Official header image for Perilous Warp game - Steam 668320",
    "Canonical URL": "https://gusku.site/game/perilous-warp",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Perilous Warp\", \"description\": \"Looking for information on Perilous Warp? Check out the release date (Oct 20, 2020), developer insights from Crystice Softworks, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crystice Softworks\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crystice Softworks\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/668320/header.jpg?t=1616988854\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}