{
    "AppID": 289240,
    "Name": "Perimeter: Emperor's Testament",
    "Release date": "May 22, 2014",
    "About the game": "In the near future a new Exodus begins, the remnants of human civilization have to leave the perishing Earth and start traveling into the Psychosphere. The ones who call themselves the Spirits - new pastors of the human race, believe that a new planet, suitable for living, will be found in the Psychosphere. Colossal towns-arks, carrying hundreds of colonists, have been traveling for centuries through hostile worlds of Psychosphere under the guidance of Spirits. Their destination was the New Earth that was to replace their old home. All passed worlds have been connected by portals, that is how the Chain of Worlds has been created. But the end of the hard tests is not in sight, and finally due to the despotism of Spirits and the underground intrigues Exodus went to pieces. New factions have arisen - the Empire and the Harkback. Each faction had their own goals and philosophy. The Harkbacks believed that the old Earth has not died, and the Empire - the most mysterious faction - believed that humans should stay in the Chain of Worlds. The antagonism boiled into a war that has been going on for many decades in many worlds. Whereas the Spirits are on the way to their destination and the Harkbacks are seeking the mythical Earth, the Emperor builds up his Sponge Empire using automatic bases - his Vice Frames. He does not believe in the old or in the new Earth. Secretly the Emperor creates the Mechanical Spirit - a super mechanism to help him discover new Worlds. Only the Emperor's mortal foes the Spirits could discover new worlds, and that was the source of their power. But now the new time has come. One of the Vice frames starts testing this mechanism, it leads to the appearance of a super mind - Mechanical Messiah and the discovery of the parallel Chain of the Psycho-sphere Worlds. We also meet the 'lost' Exodus Frames and find traces of the mysterious alien race. The three sides are in the middle of the deadly battle: the Scourge against the Emperor's Slaves, Lash of the Spirits against the Calling of Messiah, a dead truth against a newborn lie. Who are the Spirits - savers or killers of the human race? Who is Messiah judge or a puppet? Who is the Emperor? Who will win? The player will find out the answer during the spectacular single player campaign in Perimeter: Emperor's Testament. 'I feel hungry tension of the highest spheres. Flesh and blood of the Sponge have been set in motion; they are pulsating around the world in which the Emperor is creating a new history of the great Chain.' Fast paced Real-Time-Strategy action Construct or destroy the very gameworld environments themselves using terraforming Vast singleplayer campaign expanding the story of the original Perimeter New special units, buildings and soundtrack Perimeter: Emperor's Testament is affected by the GameSpy shutdown on the 31st of May. You can continue to play the game through LAN, DirectIP and GameRanger.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/289240/header.jpg?t=1656588820",
    "Price": 3.99,
    "Developers": "K-D Lab",
    "Publishers": "Fulqrum Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/289240/ss_f9e26adeb1c6cd3a84716b5e91cf096d2fea915c.1920x1080.jpg?t=1656588820,https://cdn.akamai.steamstatic.com/steam/apps/289240/ss_25ed162ad237a160b199b6081d2374c5b6613cd7.1920x1080.jpg?t=1656588820,https://cdn.akamai.steamstatic.com/steam/apps/289240/ss_b27f9eebd42c1b00fa78990b83763895833f4ed2.1920x1080.jpg?t=1656588820,https://cdn.akamai.steamstatic.com/steam/apps/289240/ss_a539e77722e298a4d356f5de301d892f08518477.1920x1080.jpg?t=1656588820,https://cdn.akamai.steamstatic.com/steam/apps/289240/ss_bc92dbdfe463650bf7f92fd274742a77296a5eca.1920x1080.jpg?t=1656588820,https://cdn.akamai.steamstatic.com/steam/apps/289240/ss_60cab65cbbbffeaf990fc05b21ae10d662fbb0d0.1920x1080.jpg?t=1656588820,https://cdn.akamai.steamstatic.com/steam/apps/289240/ss_1e1e9c80b421548bc02e434eb4251ce8c5df5bfe.1920x1080.jpg?t=1656588820,https://cdn.akamai.steamstatic.com/steam/apps/289240/ss_63f09401cf148c339db96787afda1cc4e77fc9b9.1920x1080.jpg?t=1656588820,https://cdn.akamai.steamstatic.com/steam/apps/289240/ss_3cf76d328bd7c9cc255e23a169ae935c558e6c03.1920x1080.jpg?t=1656588820",
    "Slug": "perimeter-emperor-s-testament",
    "Meta Title": "Perimeter: Emperor's Testament: May 22, 2014, K-D Lab and...",
    "Meta Description": "Looking for information on Perimeter: Emperor's Testament? Check out the release date (May 22, 2014), developer insights from K-D Lab, and a complete ga...",
    "Alt Text Image": "Official header image for Perimeter: Emperor's Testament game - Steam 289240",
    "Canonical URL": "https://gusku.site/game/perimeter-emperor-s-testament",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Perimeter: Emperor's Testament\", \"description\": \"Looking for information on Perimeter: Emperor's Testament? Check out the release date (May 22, 2014), developer insights from K-D Lab, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 22, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"K-D Lab\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fulqrum Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/289240/header.jpg?t=1656588820\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}