{
    "AppID": 494430,
    "Name": "Praey for the Gods",
    "Release date": "Dec 14, 2021",
    "About the game": "Praey for the Gods is a boss climbing open world adventure game where you play as a lone hero sent to the edge of a dying frozen world to discover the mystery behind a never-ending winter. Arriving with only the clothes on your back, you must survive the colossal dangers that you encounter. To restore balance and reclaim the land from the brink, you will be faced with questions that not even a God knows the answer to. Scale Massive Beasts Overcome impossible odds to climb atop and defeat the massive beasts that are bound to this land. Climb, Glide, Swim You can climb on virtually anything you can get your hands on, from ruins and mountains to the massive beasts that inhabit the land. Ascend to the tops of mountains and then glide over the open world to reach previously inaccessible locations. Swim in frigid water to uncover hidden locations that contain secrets and treasure, but don't stay in too long or your swim could become your last. Explore, Craft, and Survive You'll arrive on a frozen island with only the clothes on your back -- it's up to you to survive. Make fires, hunt for food, and find the equipment you need to make it through an eternal winter. Nature isn't the only danger, so craft weapons, defeat minions for better gear, and venture into long forgotten caves to discover their secrets. Triumphing over these trials will prepare you for the impossible odds that wait. Make Your Path Praey for the Gods is a non-linear game where you choose who you battle and how. While destiny will give you a nudge, virtually all the large beasts can be attempted in any order allowing you to set the course. Unravel the Mystery Why won't the winter stop? Why has no one returned? Cryptic paintings left behind allude to a story once thought forgotten. To restore balance and reclaim the land, you will be faced with questions that not even the gods know the answer to. A Beautifully Frigid World Explore a landscape of unending winter framed by snow-capped peaks and crawling fog. The remnants of an ancient civilization lie before you, but don't let awe turn into carelessness -- snow storms can crop up at any moment and bury you in a blizzard. Luckily, you can leave footprints in the snow and follow your footsteps back if you are lost. About the Development Team Praey for the Gods is being created by No Matter Studios a tiny studio of 3. Brian Parnell, Tim Wiese (glasses) and Hung-Chien Liao. In 2014, the friends began working after-hours on their first game. By January 2016, they had enough confidence in their progress to leave game-studio jobs in San Francisco and move to Seattle. Working in Parnell’s basement, they pursued an all-or-nothing dream to make the game of their dreams.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/494430/header.jpg?t=1645913843",
    "Price": 29.99,
    "Developers": "No Matter Studios",
    "Publishers": "No Matter Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/494430/ss_8e97c5c8d8e1eb9cd43ac1bea6f0cc72612224db.1920x1080.jpg?t=1645913843,https://cdn.akamai.steamstatic.com/steam/apps/494430/ss_43e7b7df69f79d7de9e0cb5a426ecc02f1610f15.1920x1080.jpg?t=1645913843,https://cdn.akamai.steamstatic.com/steam/apps/494430/ss_70a5723b1b1045f298f728a28f56777a9b2ec1e5.1920x1080.jpg?t=1645913843,https://cdn.akamai.steamstatic.com/steam/apps/494430/ss_ed9d6d002fa111524b87a395c67f32ade4476bb0.1920x1080.jpg?t=1645913843,https://cdn.akamai.steamstatic.com/steam/apps/494430/ss_968bf3a109092bd3ec393f9d3091d65c44eb50b8.1920x1080.jpg?t=1645913843,https://cdn.akamai.steamstatic.com/steam/apps/494430/ss_b995c95d05d87b15730d4bd981cef9660f86873f.1920x1080.jpg?t=1645913843,https://cdn.akamai.steamstatic.com/steam/apps/494430/ss_0f32c58d6a0eb88d883cb0f6217ba2ccd66be9d1.1920x1080.jpg?t=1645913843,https://cdn.akamai.steamstatic.com/steam/apps/494430/ss_7091f5f392e03a0eb376eb551944fd29901185c9.1920x1080.jpg?t=1645913843,https://cdn.akamai.steamstatic.com/steam/apps/494430/ss_455a6ea2342afb6f1d77c115b2e2db88576d381b.1920x1080.jpg?t=1645913843,https://cdn.akamai.steamstatic.com/steam/apps/494430/ss_8dcf11bc3bf832f1d2da2b0d500fbbeab69a55e3.1920x1080.jpg?t=1645913843",
    "Slug": "praey-for-the-gods",
    "Meta Title": "Praey for the Gods: Dec 14, 2021, No Matter Studios and F...",
    "Meta Description": "Looking for information on Praey for the Gods? Check out the release date (Dec 14, 2021), developer insights from No Matter Studios, and a complete game...",
    "Alt Text Image": "Official header image for Praey for the Gods game - Steam 494430",
    "Canonical URL": "https://gusku.site/game/praey-for-the-gods",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Praey for the Gods\", \"description\": \"Looking for information on Praey for the Gods? Check out the release date (Dec 14, 2021), developer insights from No Matter Studios, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"No Matter Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"No Matter Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/494430/header.jpg?t=1645913843\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}