{
    "AppID": 1023550,
    "Name": "Rogue Star Rescue",
    "Release date": "Feb 4, 2021",
    "About the game": "A New Kind of Roguelite Shooter. It's time to bring roguelites to the next level! Rogue Star Rescue is a unique mix of bullet hell roguelite and tower defense games. We've added strong strategy elements to the all-out insanity of bullet hell shooters. The action is smooth, the gameplay is challenging, the story is complex and nonlinear. It's a game you'll get sucked into and will end up spending months exploring the multiple intricacies and outcomes. Keeping the game fun well past the 50-hour mark is our core design focus. Online Co-op! Games like this are better with friends. Connect with our community online to explore the RSR galaxy with up to 4 people simultaneously! You won't find this feature in the other popular roguelite shooters. Progress with your friends and unlock the secrets of the galaxy as a team. Along with exclusive multiplayer content, there will always be something new to discover. Couch Co-op! Having a friend over? Team up with them the old fashioned way! Share a screen and blast your way through the RSR universe. Max. 2 players. No internet connection required. Fight with your Team! You won't be able to stop the Rogue Star alone. Rescue your teammates along the way and they'll fight beside you against the evil aliens. Even in single-player mode, your quest is interactive and full of hilarious dialogue, not just another lonely solo-mission. The Rogue Star. A massive Rogue Star has formed from the cosmos and is on a direct collision path with us! It threatens to vaporize everything. Leaders from planets around the galaxy have assembled a top team of fighters to stop the Rogue Star at all costs. Choose your own non-linear path through the galaxy and explore each of the 10+ planets carefully. Your Choices, Your Ending. Choose which planets to travel to and make important decisions that decide the fate of the galaxy! Depending on the path you take, there are dozens of different outcomes. The Rogue Star can destroy the entire galaxy, be reflected to the enemy's galaxy, swallowed by a black hole, sent far away through a galactic wormhole, and dozens of other hilarious possibilities in between. It's really up to you to make the right decisions based on the outcome you want to see, and who you want to rescue. Traps and Defense. While exploring each planet you must gather traps and resources to face an epic mini-boss and his waves of minions at the end of each level. Strategically placed traps slow, block, push, spike, burn, freeze, and shoot at enemies. Traps can be upgraded to make themselves stronger. Managing trap inventory and usage intelligently is critical to your success in the game, especially during the later levels. Heroes. Choose from one of the elite team members with a unique set of special abilities, each with a personal drive to save their home planet from annihilation. Unlock new players by achieving specific outcomes. Level Up! Unlike traditional roguelikes, we've added a persistent leveling up system. With each level you earn attribute points that can improve strength, speed, health, traps, and luck. The more you fight, the more experience points you earn, the stronger you get. Build your player wisely. Guns and Items. Discover and unlock hundreds of unique items! We're thrilled to present a wide variety of guns from advanced space weaponry, to historical weapons, and everything in between. On top of carrying your main gun, you'll have an arsenal of powerful grenades ready at the tap of a button. You'll also be accompanied by upgradeable buddies, each with their own unique fighting abilities (Did you know there are dragons in space?). Three modes of difficulty. Whether you're a beginner or a seasoned dungeon explorer, we've got you covered! Choose Wimpy, Normal, or Insane mode to challenge your skills and to keep the fun going. Note for the avid bullet-hell gamers: even the developers have a hard time beating the game on Insane mode ;) Time is ticking, can you stop this galactic doomsday before it's too late?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1023550/header.jpg?t=1621544950",
    "Price": 10.49,
    "Developers": "Chute Apps",
    "Publishers": "Chute Apps",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1023550/ss_972638feacfc2b7d0ff05034c169ebde1185e952.1920x1080.jpg?t=1621544950,https://cdn.akamai.steamstatic.com/steam/apps/1023550/ss_c42a89ace602db84bfb8a9224fa8f6d64fced497.1920x1080.jpg?t=1621544950,https://cdn.akamai.steamstatic.com/steam/apps/1023550/ss_eaf7d1df9c714a7182ea00f4eace332eda31481e.1920x1080.jpg?t=1621544950,https://cdn.akamai.steamstatic.com/steam/apps/1023550/ss_d710ce834d4b6472f75fcf97f6f0002242989d28.1920x1080.jpg?t=1621544950,https://cdn.akamai.steamstatic.com/steam/apps/1023550/ss_94b5068b85af6449b50509188de1f3889c045198.1920x1080.jpg?t=1621544950,https://cdn.akamai.steamstatic.com/steam/apps/1023550/ss_64a391a3c4656c184e93c7d5a10c18b9368edc1c.1920x1080.jpg?t=1621544950,https://cdn.akamai.steamstatic.com/steam/apps/1023550/ss_1c8b11f1a0d12dc2c322b939fb9686046049f215.1920x1080.jpg?t=1621544950,https://cdn.akamai.steamstatic.com/steam/apps/1023550/ss_f1aba0534c86d2e410256dfadb7ec75078ff919e.1920x1080.jpg?t=1621544950,https://cdn.akamai.steamstatic.com/steam/apps/1023550/ss_43dc17c58c10bcbef9a34ce74e0a95f614907faf.1920x1080.jpg?t=1621544950,https://cdn.akamai.steamstatic.com/steam/apps/1023550/ss_6c6ae4a94267005e22c50f29fdea9939fe59f3fb.1920x1080.jpg?t=1621544950",
    "Slug": "rogue-star-rescue",
    "Meta Title": "Rogue Star Rescue: Feb 4, 2021, Chute Apps and Full Overview",
    "Meta Description": "Looking for information on Rogue Star Rescue? Check out the release date (Feb 4, 2021), developer insights from Chute Apps, and a complete game summary.",
    "Alt Text Image": "Official header image for Rogue Star Rescue game - Steam 1023550",
    "Canonical URL": "https://gusku.site/game/rogue-star-rescue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rogue Star Rescue\", \"description\": \"Looking for information on Rogue Star Rescue? Check out the release date (Feb 4, 2021), developer insights from Chute Apps, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chute Apps\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Chute Apps\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1023550/header.jpg?t=1621544950\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}