{
    "AppID": 1105660,
    "Name": "Stay Safe: Labyrinth of the Mad",
    "Release date": "Aug 13, 2019",
    "About the game": "Break out the deep prison and escape this subterranean dungeon 35 floors underground. Explore Each play session is different, explore every inch of the map for precious loot, trinkets and gems with added effects to help you on your journey to the top. Fight Battle you way through each floor using a variety of ranged and melee weapons or spells. Over 50+ different creatures to encounter, coming at you with evil intent. Magic Find magic scrolls and unleash strange powers upon your enemies or yourself. Use scrolls often to learn them permanently, casting them from your own spellbook without the need of a scroll! Craft Create better gear, tools, arrows for your bows and more. Craft a variety of items to increase your odds at surviving, or even to make a little coin. Every so often, you'll meet face to face with another escapee - a copy of another real player. Don't worry, it's not real-time... Their playthrough, gear, items, the progress they had: it's all there. Ready to fight you! Defeating this copy of another player will then make you the new champion of that floor! Now you, your copy, will be encountered by other players! Survive, and make sure nobody else does. Above all else, stay safe. 35 floors of turn-based roguelike challenge, variety of monsters, items and spells. And more, every update. Plus, every playthrough matters: your progress is recorded in a leaderboard! Unique generation system! Use files on your PC, key presses on your keyboard or buttons on the controller to create your random dungeon, items and gems! Randomized characters! Start off with a random weapon, spells and helpful items, different each time. Leaderboards! Record your gear, level, kills, alive time... How did you do? Additionally... Colorblind mode! Deuteranopia, Tritanopia and Protanpoia all supported! Offline mode for when you'd rather not encounter other players. Rebind every action for your keyboard or controller! Let the game tweet out your sweet victory in the form of a screenshot on our official Twitter page (@StaySafeGame)! Enable it in the settings! Earn trophies as you play! Despite some claims, you can save your game to progress later! Every 5 floors, make sure to interact with a dragon-esque statue...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1105660/header.jpg?t=1629599040",
    "Price": 5.99,
    "Developers": "Yellowcake Games",
    "Publishers": "Yellowcake Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1105660/ss_e60ef35dd86da01c446dfb9b76d5bf783786d311.1920x1080.jpg?t=1629599040,https://cdn.akamai.steamstatic.com/steam/apps/1105660/ss_ddfff4ba14af402b666b5e3a263532c684ffde2f.1920x1080.jpg?t=1629599040,https://cdn.akamai.steamstatic.com/steam/apps/1105660/ss_37cfa4ed7c6db99ba5174f661feb9bb4b9d6ec19.1920x1080.jpg?t=1629599040,https://cdn.akamai.steamstatic.com/steam/apps/1105660/ss_aa2e36d12f8d36b5f0f839297f076bff5cae78a7.1920x1080.jpg?t=1629599040,https://cdn.akamai.steamstatic.com/steam/apps/1105660/ss_4a13b1b5d0a3c5ed00fc3a905cd08dffc41711f5.1920x1080.jpg?t=1629599040,https://cdn.akamai.steamstatic.com/steam/apps/1105660/ss_dcfd50b9e3f85613dc0576d77712757866a7cf3d.1920x1080.jpg?t=1629599040,https://cdn.akamai.steamstatic.com/steam/apps/1105660/ss_d8a8106c69270fe2701c636eda56fbe156d61e5b.1920x1080.jpg?t=1629599040",
    "Slug": "stay-safe-labyrinth-of-the-mad",
    "Meta Title": "Stay Safe: Labyrinth of the Mad: Aug 13, 2019, Yellowcake...",
    "Meta Description": "Looking for information on Stay Safe: Labyrinth of the Mad? Check out the release date (Aug 13, 2019), developer insights from Yellowcake Games, and a c...",
    "Alt Text Image": "Official header image for Stay Safe: Labyrinth of the Mad game - Steam 1105660",
    "Canonical URL": "https://gusku.site/game/stay-safe-labyrinth-of-the-mad",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Stay Safe: Labyrinth of the Mad\", \"description\": \"Looking for information on Stay Safe: Labyrinth of the Mad? Check out the release date (Aug 13, 2019), developer insights from Yellowcake Games, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 13, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Yellowcake Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Yellowcake Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1105660/header.jpg?t=1629599040\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}