{
    "AppID": 1262890,
    "Name": "Tidal Shock",
    "Release date": "May 4, 2020",
    "About the game": "ABOUT THIS GAME Set deep underwater Tidal Shock is fast-paced, easy to pick up and hard to master. That’s right, the Tidal Shock arena is submerged and not confined to gravity. Bullets will rain down, snipers will lurk below and attacks can come from any angle. There’re respawns but no loadouts – shields, weapons and charge are pickups that you’ll drop on death. The question is, are you hunting for more or protecting what you have? Tidal Shock has a winner take all objective. The player who slams 100 charge onto the ever-moving reactor will “tidalshock” the competition and earn a coveted “Charge Cube” KEY FEATURES 4-8 multiplayer arena with one king of the hill objective 7 aquatic weapons classes with 5 rarity levels Dashes, blocking walls and a rideable torpedo sled! Balanced for respawning, winner-takes-all tension Free for all matches with all your Steam friends Match stats and leaderboard Flashy taunts! REACTOR Scattered around the map are charge cells that you’ll need to collect and bring to the Reactor, a glowing beacon that changes position every 60 seconds. The first player to fully charge the Reactor wins. Each Reactor position creates a new battleground, with different obstacles, map features and item spawns. Fittingly, you can also collect charge from fallen players, so sometimes the best offense is… a good offense. How you approach the Reactor will decide your fate. Will you race to it immediately to get there first? Will you attempt to predict its next location and set up camp? Will you try to intercept oblivious on their way to deliver charge? Or will you dive in guns blazing and test your mettle directly? Or will you mix it up, and choose your strategy based on your current weapon loadout? We can’t wait to see how gameplay emerges throughout the Tidal Shock Arena. Share your strategies on our Discord please. SKINS, WEAPONS &amp; ENVIRONMENT The skins in Tidal Shock don’t represent classes or have powers, but they do represent you. The skin you wear, the weapon you carry and your position in the environment matter. When you shoot or move you glow. The more Reactor charge you carry, the more you glow as well. The environment is foggy and moody with both dark and light areas. There are 5 skins you can earn in-game and 8 that can be purchased via DLC. As a small indie studio, we chose a DLC skins model to keep the base Tidal Shock game competitively priced. EMERGENT GAMEPLAY Tidal Shock is different. We didn’t have a bunch of rules to follow or examples to copy when designing a 360 Degree Aquatic Arena . We set a dynamic stage with clear objectives and (hopefully) balanced combat mechanics. How Tidal Shock matches unfold, the winning strategies and styles of play will be set by players – you. MATURE CONTENT DESCRIPTION It's set in a sci-fi bathtub. You don't get cleaner than that.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1262890/header.jpg?t=1592590999",
    "Price": 7.99,
    "Developers": "Moonray Studios",
    "Publishers": "Moonray Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1262890/ss_420d2347df031dd55ef2ff866d11eedd6ce6201c.1920x1080.jpg?t=1592590999,https://cdn.akamai.steamstatic.com/steam/apps/1262890/ss_fb469f682a4c3156155c35c1d0effce679983668.1920x1080.jpg?t=1592590999,https://cdn.akamai.steamstatic.com/steam/apps/1262890/ss_12da825ebc7f09e7575ca0b05fd5495f238c3f01.1920x1080.jpg?t=1592590999,https://cdn.akamai.steamstatic.com/steam/apps/1262890/ss_1862a125e190634ab216f5b3f311ab0b1b7e7e1b.1920x1080.jpg?t=1592590999,https://cdn.akamai.steamstatic.com/steam/apps/1262890/ss_533c0b677e7d58d8b8f3b251a0934f87942fb754.1920x1080.jpg?t=1592590999,https://cdn.akamai.steamstatic.com/steam/apps/1262890/ss_b54b9631cadc1059949fd31eca58a86717dc2fd1.1920x1080.jpg?t=1592590999,https://cdn.akamai.steamstatic.com/steam/apps/1262890/ss_d0d07986a2b14ce6b0dd2680d3e68c531f390308.1920x1080.jpg?t=1592590999,https://cdn.akamai.steamstatic.com/steam/apps/1262890/ss_d0ffcd91040a6f482ab516b9a9b3f4aac9efa292.1920x1080.jpg?t=1592590999",
    "Slug": "tidal-shock",
    "Meta Title": "Tidal Shock: May 4, 2020, Moonray Studios and Full Overview",
    "Meta Description": "Looking for information on Tidal Shock? Check out the release date (May 4, 2020), developer insights from Moonray Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Tidal Shock game - Steam 1262890",
    "Canonical URL": "https://gusku.site/game/tidal-shock",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tidal Shock\", \"description\": \"Looking for information on Tidal Shock? Check out the release date (May 4, 2020), developer insights from Moonray Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Moonray Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Moonray Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1262890/header.jpg?t=1592590999\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}