{
    "AppID": 1569120,
    "Name": "Towards the Sky",
    "Release date": "Jul 15, 2021",
    "About the game": "Towards the Sky is a relaxing and minimalistic 3D platformer that’s all about reaching the top of the level. You jump from platform to platform while collecting coloured orbs with different bonusses and effects. Yellow orbs give you a speedboost, green ones allow you to double jump, and red ones launch you into the air. It's up to you as the player how you will get through the level, as there is no wrong way to do it. Now there are many platformers out there. What makes Towards the sky different? Random level generation ensures that no level will ever be the same. Our algorithms ensure that our players will constantly be given new, interesting levels, allowing for a nearly endless amount of gameplay. Minimalistic design was one of the things we were really focused on including during development. Many games these days focus on being as graphically perfect as possible, but in the end, it all comes down to cubes and spheres, of which we have plenty. Sound free experience . Towards the Sky does not feature any kind of audio, allowing players to select their own favourite music, shows, or audiobooks, in order to fully immerse themselves into the relaxing gameplay. What can you expect to find in Towards the Sky? Fun gamemodes to suit every playstyle! Towards the Sky has 3 gamemodes, allowing players to choose from our relaxing 'Launch' gamemode, where they peacefully bounce from platform to platform, or the 'Random' gamemode for those who feel very lucky indeed. For those more interested in the vanilla experience, there is always the default gamemode for a fun mix of relaxation and challenging gameplay. Speedrun timers! Do you enjoy speedrunning, and shaving off those important seconds off your time? All levels feature a timer at the victory point, along with the option of displaying it on the ingame UI during play. Not sure about the game? Here's some quotes from our players, streamers, and viewers! 'Towards the Sky is the perfect chat game. You can just have it up on the screen while you're streaming and chatting to your viewers, or while you're in a call with friends.' - ItsPhenixx, Twitch Streamer. 'This game looks like a fever dream, but in a good way' - Anonymous Twitch Viewer 'There is really no game like it. There's plenty of platform games, but none have really captured the zen-like feeling you get while playing Towards the Sky.' - Anonymous player If you're still reading this, thank you for checking out Towards the Sky. Even if you aren't planning on buying the game, I still appreciate you taking the time to read through this. If you are planning on buying the game, I hope you have as great a time playing it, as I have had developing it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1569120/header.jpg?t=1626545586",
    "Price": 0.99,
    "Developers": "Unus Lupus",
    "Publishers": "Unus Lupus",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1569120/ss_2db7ebbd2f87fa1c16131e2913bbbdb564f0b73e.1920x1080.jpg?t=1626545586,https://cdn.akamai.steamstatic.com/steam/apps/1569120/ss_9e068ab4e921544efe4f5f1da0d428fbc84319b3.1920x1080.jpg?t=1626545586,https://cdn.akamai.steamstatic.com/steam/apps/1569120/ss_350cf7d3585702609a2ff0b2679b54869c55be56.1920x1080.jpg?t=1626545586,https://cdn.akamai.steamstatic.com/steam/apps/1569120/ss_bbf72d84f57b06130d92c05f1b279a3d1198eb0d.1920x1080.jpg?t=1626545586,https://cdn.akamai.steamstatic.com/steam/apps/1569120/ss_b8fc69d0b89325d3f4193bc13f3bfa46e3693dc6.1920x1080.jpg?t=1626545586,https://cdn.akamai.steamstatic.com/steam/apps/1569120/ss_4bf57f9cdb3c1f7bcbbbc0fab47701e6ffcf81e8.1920x1080.jpg?t=1626545586",
    "Slug": "towards-the-sky",
    "Meta Title": "Towards the Sky: Jul 15, 2021, Unus Lupus and Full Overview",
    "Meta Description": "Looking for information on Towards the Sky? Check out the release date (Jul 15, 2021), developer insights from Unus Lupus, and a complete game summary.",
    "Alt Text Image": "Official header image for Towards the Sky game - Steam 1569120",
    "Canonical URL": "https://gusku.site/game/towards-the-sky",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Towards the Sky\", \"description\": \"Looking for information on Towards the Sky? Check out the release date (Jul 15, 2021), developer insights from Unus Lupus, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Unus Lupus\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Unus Lupus\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1569120/header.jpg?t=1626545586\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}