{
    "AppID": 1236900,
    "Name": "Verdant Village",
    "Release date": "Aug 4, 2020",
    "About the game": "Take on the challenges of living a life in the rustic medieval town of Amberglen. You've washed up on a quiet beach with nothing to your name, not even your memories. You're in luck however as locals are quick to find you, and nurse you back to health. The king himself is kind enough to allow you to stay on a piece of abandoned property to make your living. With nothing more than a few rusty tools turn strike out and attempt to breathe life back into this old land! Features Create A Thriving Farm: Start with nothing, and with little more than the sweat of your brow turn your property into a bustling farmstead. Master Skills As You Progress: No one starts out as a master. Level up your skills as you work. Complete specific tasks to gain powerful perks to help you succeed. Brew With The Best: Take advantage of an extensive fermentation system to craft your own unique brews. Uncover Lost Mysteries: Search throughout the land for hidden artifacts to piece together. The Empyrean Vale is vast and full of history to learn and history to unearth. Make A House A Home: Decorate your new property with a variety of different objects. Place whatever you want where ever you want it and truly create your own slice of heaven. Meet The Townsfolk: Interact and speak with over 40 characters living in Amberglen and beyond. Each character has a personality and story to tell. Cast A Line: Visit the multitude of different fishing spots spread across the vale. There are over 100 fish to catch, split between different environments, seasons, and times. Nock An Arrow: Stalk the surrounding wilderness for a variety of animals. Hunt creatures with your trusty bow and arrow. Have A Taste: Learn to cook a litany of different meals. Get the locals to teach you different recipes and become the best chef in Amberglen. Stir The Cauldron: Try your hand at alchemy. Create ingredients from the world around you and blend them together into a variety of potions and items. Lend A Helping Hand: Find and complete a variety of tasks for villagers. You'll find that everyone needs something done. Most are willing to teach you something in return as well. No Restarts: Take advantage of the patching system to play early. Your saves will carry over between new patches for a cohesive experience. Features To Come Combat: Battle your way past any threat you come across. Marriage: Find a spouse and court them. Sailing: Build a ship and sail the bay. Much much more",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1236900/header.jpg?t=1654008462",
    "Price": 14.99,
    "Developers": "Exodus Software",
    "Publishers": "Exodus Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1236900/ss_7fbc40a7acd3a5d1a48d4f558baca6fc04be32cb.1920x1080.jpg?t=1654008462,https://cdn.akamai.steamstatic.com/steam/apps/1236900/ss_b8687efde066882d506063bff07318f921ab775b.1920x1080.jpg?t=1654008462,https://cdn.akamai.steamstatic.com/steam/apps/1236900/ss_ed374d20f2592f4043438ba218c66f8d042d6ce7.1920x1080.jpg?t=1654008462,https://cdn.akamai.steamstatic.com/steam/apps/1236900/ss_e1b4ecc9726c33cec6ff4a6d1771e8bc45152054.1920x1080.jpg?t=1654008462,https://cdn.akamai.steamstatic.com/steam/apps/1236900/ss_ab91c0ea8b9dc8f34b0327b7db4496fb3f1b07ab.1920x1080.jpg?t=1654008462,https://cdn.akamai.steamstatic.com/steam/apps/1236900/ss_edd431e34bfae459db8faa232e37fb7718f1abc9.1920x1080.jpg?t=1654008462,https://cdn.akamai.steamstatic.com/steam/apps/1236900/ss_2394c3525f0beac500c9932d86bf18a20c409eb3.1920x1080.jpg?t=1654008462,https://cdn.akamai.steamstatic.com/steam/apps/1236900/ss_a9607b8d9ccac0470f9971e1122ad6a3d77ffcad.1920x1080.jpg?t=1654008462",
    "Slug": "verdant-village",
    "Meta Title": "Verdant Village: Aug 4, 2020, Exodus Software and Full Ov...",
    "Meta Description": "Looking for information on Verdant Village? Check out the release date (Aug 4, 2020), developer insights from Exodus Software, and a complete game summary.",
    "Alt Text Image": "Official header image for Verdant Village game - Steam 1236900",
    "Canonical URL": "https://gusku.site/game/verdant-village",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Verdant Village\", \"description\": \"Looking for information on Verdant Village? Check out the release date (Aug 4, 2020), developer insights from Exodus Software, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Exodus Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Exodus Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1236900/header.jpg?t=1654008462\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}