{
    "AppID": 1562930,
    "Name": "World for Two",
    "Release date": "Jul 16, 2021",
    "About the game": "A sudden catastrophe has led life on Earth to the verge of extinction. The Professor, the only survivor, spent years performing research in an underground laboratory trying to recreate life to no avail. The resources he needs to do this can only be harvested outdoors, where he himself cannot go. He therefore created an android to help him: you. Plants are the only living things left in this world where human civilization is no more. It is cruel, but beautiful. The Professor and the android embark on a quest to bring animals back to the planet. EXPLORE A STUNNING PIXEL-ART WORLD Experience the highly emotive journey of an android created to bring back life, and change desolate wastelands into lush, populated habitats. Bask in breathtaking visual spectacles; from the Sun rising across an increasingly vibrant landscape, to the clouds gently rolling across the night sky, everything is reflected in the glistening water below. HARVEST RESOURCES TO FUEL CREATION Gather natural energy from Starflames, and the DNA from living creatures (once you’ve solved puzzles to understand their genetic patterns) to continue your creation. Upgrade the lab's technology with Starflames to unlock new biomes and resources. Be prepared for the emotional burdens that creating life brings, as all things must have their end. CREATE THEM ALL! Through trial and error, discover and create unique 60 creatures. Start with the lowly amoeba, and end with brightly coloured whales and manta ray. Perhaps there are creatures beyond? Mix and match to complete the genetic tree and retrace evolution. Travel across the four uniquely coloured and distinctive biomes - Bog, Forest, Dunes and Ruins; each with their own creatures and soundtrack. CHAPTER 0 Once you have completed the main storyline, enjoy access to “Chapter 0”; a special story that includes new art and music. Learn what happened before you were created, and understand the Professor’s past and what led to the events surrounding the game’s plot and the near-destruction of our world. As an added bonus, unlock the main soundtrack remastered, played by a piano quintet - taking the soundtrack to new, beautiful heights.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1562930/header.jpg?t=1644419942",
    "Price": 13.99,
    "Developers": "Seventh rank",
    "Publishers": "PQube,room6",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1562930/ss_02cd29e1700198a23ea52d14d395a02e8de89eaf.1920x1080.jpg?t=1644419942,https://cdn.akamai.steamstatic.com/steam/apps/1562930/ss_a21aad67e13f296695df0fc450f269f878714b16.1920x1080.jpg?t=1644419942,https://cdn.akamai.steamstatic.com/steam/apps/1562930/ss_2eaf4813e2396af1a1f079654d25541ea8362477.1920x1080.jpg?t=1644419942,https://cdn.akamai.steamstatic.com/steam/apps/1562930/ss_e21622a3b5654f98886f4f8e838d325129543ed6.1920x1080.jpg?t=1644419942,https://cdn.akamai.steamstatic.com/steam/apps/1562930/ss_048757ac31132ca48a7419f01cd6550da16ffa8c.1920x1080.jpg?t=1644419942,https://cdn.akamai.steamstatic.com/steam/apps/1562930/ss_78aa12d04da0fab4570b15109ca13940846715c8.1920x1080.jpg?t=1644419942",
    "Slug": "world-for-two",
    "Meta Title": "World for Two: Jul 16, 2021, Seventh rank and Full Overview",
    "Meta Description": "Looking for information on World for Two? Check out the release date (Jul 16, 2021), developer insights from Seventh rank, and a complete game summary.",
    "Alt Text Image": "Official header image for World for Two game - Steam 1562930",
    "Canonical URL": "https://gusku.site/game/world-for-two",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"World for Two\", \"description\": \"Looking for information on World for Two? Check out the release date (Jul 16, 2021), developer insights from Seventh rank, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Seventh rank\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PQube,room6\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1562930/header.jpg?t=1644419942\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}