{
    "AppID": 529950,
    "Name": "12 orbits",
    "Release date": "Oct 24, 2016",
    "About the game": "12 orbits is the only local multiplayer game for 2-12 people at once, no matter what you play on. If you can read this, be it on a PC, a laptop or even a tablet, you probably have everything you need. Additional controllers are supported, but not required unless you prefer to have a little more elbow room. The game can be set up in seconds, even for 12 players at once. Rounds take about 5 minutes each. 12 orbits is friendly, competitive and a little chaotic. It is simple enough to quickly teach a group how to play it, but varied and deep enough to keep them entertained for a long time. You can choose from 4 game modes, two of them for teams, with each one focused on a different playstyle. All of them adjust to any number of players from 2 - 12, so you can start small and add players as they come along. Features Competitive local multiplayer for everyone at once. Anywhere. On anything. 4 vastly different game modes to choose from Setup takes seconds, even for 12 players at once The basic mechanics are simple and can be taught to a group quickly ...yet they provide you with a lot of room for mastery and competition One Switch accessible Game Modes ▶ Arena Fill the arena with spheres of your own color and avoid those of your opponents. A bullet hell game that constantly grows more intense. ▶ Multiball (Teams) Kind of like football, but with exploding goals and multiple balls at once, which change color all the time. ▶ Trails Collect spheres to grow longer than your opponents. Then block their path and pay attention to your own. And should the other players try to keep their distance, just fling your spheres at them. ▶ Blizzard (Teams) Defend against a whole shower of spheres at once, and send them right back where they came from. FAQ My keyboard / touchscreen supports only 3 – 5 inputs at a time. Will this even work? Yes! 12 orbits needs only one button per player, and never requires button mashing or keeping that button pressed down. This makes it highly unlikely for too many buttons to ever be pressed during the same frame, even with 12 players at once. There is only partial controller support. Does this mean I cannot play from my couch / in Big Picture Mode? The game can be controlled entirely with a gamepad. But you will have to press Enter once to skip the launcher, that's why I cannot say it has full controller support. Sorry about that. Is there a colorblind mode? Yes. It is based on black and white symbols, so it should work for any type of color blindness. Since this is a one-button game, does it also support One Switch inputs? Yes, including the menus. More information on this can be found here",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/529950/header.jpg?t=1628962405",
    "Price": 1.99,
    "Developers": "Roman Uhlig",
    "Publishers": "Roman Uhlig",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/529950/ss_2c615395af201749e91384c7e4b81624284d3ecb.1920x1080.jpg?t=1628962405,https://cdn.akamai.steamstatic.com/steam/apps/529950/ss_6dd4141c7b77fcbe1d2a863178502edb204316db.1920x1080.jpg?t=1628962405,https://cdn.akamai.steamstatic.com/steam/apps/529950/ss_5aadda320f17ecef85cb03d4748b4c72efe93d14.1920x1080.jpg?t=1628962405,https://cdn.akamai.steamstatic.com/steam/apps/529950/ss_31d5af8038fc99862e5e91760c93e7768d49ed78.1920x1080.jpg?t=1628962405,https://cdn.akamai.steamstatic.com/steam/apps/529950/ss_17dde4ce578f8e272922044b11781d611e81f5bc.1920x1080.jpg?t=1628962405,https://cdn.akamai.steamstatic.com/steam/apps/529950/ss_6996103e2c996bb7effa3fe77e5185d4fca5013f.1920x1080.jpg?t=1628962405,https://cdn.akamai.steamstatic.com/steam/apps/529950/ss_2004a19fc521e8c668782667d1dcb6f50e8e40ab.1920x1080.jpg?t=1628962405",
    "Slug": "12-orbits",
    "Meta Title": "12 orbits: Oct 24, 2016, Roman Uhlig and Full Overview",
    "Meta Description": "Looking for information on 12 orbits? Check out the release date (Oct 24, 2016), developer insights from Roman Uhlig, and a complete game summary.",
    "Alt Text Image": "Official header image for 12 orbits game - Steam 529950",
    "Canonical URL": "https://gusku.site/game/12-orbits",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"12 orbits\", \"description\": \"Looking for information on 12 orbits? Check out the release date (Oct 24, 2016), developer insights from Roman Uhlig, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 24, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Roman Uhlig\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Roman Uhlig\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/529950/header.jpg?t=1628962405\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}