{
    "AppID": 1272860,
    "Name": "Absolute Alchemical Potion",
    "Release date": "Sep 28, 2020",
    "About the game": "Visual novel, ADV, fantasy, romance, otome, 3-4+ hours Behold: the great scientist-alchemist Celsia. She has made innumerable discoveries that have helped this world, but many more have caused destruction. A set of circumstances she refuses to speak of has caused her to be banished into exile. Now the sorceress has to endure the chilly welcome of the hot sands in the Barren Lands. But Celsia knows how to get out of this oppressive place! The most brilliant and mightiest scientist in the world found a way to make an Elixir of Immortality, and produced it. She immediately reported to the Ministry of Mages of her success. Now those snobbish sorcerers will be sure to fall at her feet and permit her to return to civilization. Everything would’ve been wonderful, if not for a couple of insignificant - as the young woman says - nuances. The potion hasn’t been concocted yet, and her latest attempt to make it failed due to unknown reasons. An unexpected side effect occurred in addition to it all - Celsia’s power got sealed off thanks to a curse, and her body shrank to half size. What can possibly be done when the person who’s supposed to confirm the phenomenal discovery is at the door, the potion is yet to be made, the powers are gone, and the serious promise being broken is going to end in the death penalty? Exciting, sometimes dangerous, but mostly fun adventures in this magical world full of unusual laws are waiting for you. Help the protagonist recover her power and brew the potion that’ll change the world, or find true and eternal love. Uncover all of the secrets of 3 young men available for romance: the Mage, the Demon and the Golem. Develop the characteristics of the characters around you. The protagonist’s replies in dialogues will affect her own personality and the traits of other characters. Make notes in your notepad - special book you can peek in, to find out more about the world around you.. Collect ingredients and put them into your bag - an additional in-game window that will let you take a closer look at the interesting items you are going to find throughout the game. More than 55 colourful illustrations that will be unlocked as you progress through the game: romantic, casual, comical. More than 15 tracks matching the mood and the dynamics of the scene. Also, don’t forget that sometimes things are not what they seem in this world, and the mask of endless jokes and humor might be hiding personal issues of the characters that are rather sad if you really think about them.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1272860/header.jpg?t=1647609107",
    "Price": 6.99,
    "Developers": "Lotos Project",
    "Publishers": "Lotos Project",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1272860/ss_d2db5d91dca3a19b3d21b4087ee40f3f4cb8f42b.1920x1080.jpg?t=1647609107,https://cdn.akamai.steamstatic.com/steam/apps/1272860/ss_87898c32b6ddd5a6ea5796986577242d561e2ec5.1920x1080.jpg?t=1647609107,https://cdn.akamai.steamstatic.com/steam/apps/1272860/ss_213b973ed559a11afa0eb39bc47ccf9ccb4f0d0e.1920x1080.jpg?t=1647609107,https://cdn.akamai.steamstatic.com/steam/apps/1272860/ss_5006c77df622e1c41543c8dea196dbcf248d4c0a.1920x1080.jpg?t=1647609107,https://cdn.akamai.steamstatic.com/steam/apps/1272860/ss_54f126e16748d20b50f46c5a3f5bc1679d63ff46.1920x1080.jpg?t=1647609107,https://cdn.akamai.steamstatic.com/steam/apps/1272860/ss_64969b70d6f89cd3a1a4452d6f09603159e06fac.1920x1080.jpg?t=1647609107,https://cdn.akamai.steamstatic.com/steam/apps/1272860/ss_ecbaf7020464cd351f961a0e629b7c8616c6dffb.1920x1080.jpg?t=1647609107",
    "Slug": "absolute-alchemical-potion",
    "Meta Title": "Absolute Alchemical Potion: Sep 28, 2020, Lotos Project a...",
    "Meta Description": "Looking for information on Absolute Alchemical Potion? Check out the release date (Sep 28, 2020), developer insights from Lotos Project, and a complete ...",
    "Alt Text Image": "Official header image for Absolute Alchemical Potion game - Steam 1272860",
    "Canonical URL": "https://gusku.site/game/absolute-alchemical-potion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Absolute Alchemical Potion\", \"description\": \"Looking for information on Absolute Alchemical Potion? Check out the release date (Sep 28, 2020), developer insights from Lotos Project, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 28, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lotos Project\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lotos Project\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1272860/header.jpg?t=1647609107\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}