{
    "AppID": 1203760,
    "Name": "Builder VR",
    "Release date": "Dec 27, 2019",
    "About the game": "Welcome nice, you can entertain yourself in a variety of ways in the VR Builder game. Create things according to imagination, invent creative and sporting activity, or just to have fun by your ideas. Nothing here is impossible! As it happens in life, is sometimes necessary to think about how to make your dream come true. Find the right procedure, can use supporting construction. The following resources are available: ' Free ' parts menu These blocks have physical properties as in reality. You can manipulate with them freely, store side-by-side, on itself, anywhere, throw them, or do whatever comes to your mind. You can place more then thousand of these objects in the scene. You can use some block also to align others objects. ' Joint ' parts offer These objects have a shape and properties that allow two or more blocks to join together. At first it may look difficult, but after some tryes you will it do better. Patience, precision and regular saving of the game will help you. It is importrant to adhere to the proper joining procedure: Grasp the part by pressing the button on the control, immobilize it completely and carefully place the second part into it. Finally, release both buttons and you so to create the assembling. It is possible to move the connected parts by using another block or by open hand. Today computers can handle about one hundred and fifty these objects in the scene. Special features For simplicity, these parts always have a black color and are marked with the letter 'S'. By incorporating these objects into the construction is possible to make moving construction. The parts perform rotary and sliding movements. It is possible to combine different types of movements. Switching these functions on and off is done by the 'special feature' button. ' Color ' menu Before creating a block you can choose a color or later you can repaint the parts using the tool on your left hand finger. All basic colors plus translucent material are available. Delete Individual parts can be removed with the tool that appears after pressing the “delete” button. It is also possible to delete all objects in the scene at once and start building again. Save, Load You can save your scene at any time. There are 12 slots available. Frequent saving of your work is certainly recommended. SaveGame files are located in a folder with Builder VR/Builder_Data installed. It is possible to find them and backup them, eventually transfer them to another computer. Community If you mind something in the game, please let us know in the discussion so we can respond. This will help improve your game. We will be pleased if you post videos or photos of your activity at community website. Yours sincerely, Fungamesvr team wish you creative construction success. Post Scriptum : If you buy a game and find that you do not have enough imagination or skill, return it (or have someone else try). I promise not to get angry :) I'll be glad you tried. Purchasing the game will allow further development.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1203760/header.jpg?t=1588944267",
    "Price": 3.99,
    "Developers": "Daniel Rychlý,Milan Matonok",
    "Publishers": "Fungamesvr",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1203760/ss_08d3f056052c0312f45a42547be696ebd84855c4.1920x1080.jpg?t=1588944267,https://cdn.akamai.steamstatic.com/steam/apps/1203760/ss_9717f292eb6da560585d3f3c032356d11e5ec7d4.1920x1080.jpg?t=1588944267,https://cdn.akamai.steamstatic.com/steam/apps/1203760/ss_3d2525a8ce2b814374f505def6d47a815dac1f78.1920x1080.jpg?t=1588944267,https://cdn.akamai.steamstatic.com/steam/apps/1203760/ss_1a8a291f64e907976c3f52f73ee6afc7e8ef7db9.1920x1080.jpg?t=1588944267,https://cdn.akamai.steamstatic.com/steam/apps/1203760/ss_281d0f1c1e756f9293d92ccf24d4251ef978248f.1920x1080.jpg?t=1588944267,https://cdn.akamai.steamstatic.com/steam/apps/1203760/ss_6aa7d80b3382b7c0dd96a025302f71ff36359c23.1920x1080.jpg?t=1588944267",
    "Slug": "builder-vr",
    "Meta Title": "Builder VR: Dec 27, 2019, Daniel Rychlý,Milan Matonok and...",
    "Meta Description": "Looking for information on Builder VR? Check out the release date (Dec 27, 2019), developer insights from Daniel Rychlý,Milan Matonok, and a complete ga...",
    "Alt Text Image": "Official header image for Builder VR game - Steam 1203760",
    "Canonical URL": "https://gusku.site/game/builder-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Builder VR\", \"description\": \"Looking for information on Builder VR? Check out the release date (Dec 27, 2019), developer insights from Daniel Rychl\\u00fd,Milan Matonok, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 27, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Daniel Rychl\\u00fd,Milan Matonok\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fungamesvr\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1203760/header.jpg?t=1588944267\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}