{
    "AppID": 689980,
    "Name": "Car Trader Simulator",
    "Release date": "Nov 4, 2020",
    "About the game": "ABOUT THIS GAME Welcome to the Car Trader Simulator! It's here where you'll be able to play the role of the American car dealer who is going to make his business famous in the whole city. You yourself will be able to decide how are you going to do it through a complex campaign. This game will let you achieve this goal in 27 different ways and all of them will depend solely on your choices! Game difficulty - how to rely on your intuition during your car trading adventure? You can choose one of 3 difficulty levels in game. The easy and medium ones are the best choice for people starting their adventure with games of this type and preferring a peaceful gameplay while enjoying the plot and campaign, and the highest level has been designed for economic simulators veterans meaning that even a simple mission during the adventure might turn out to be quite demanding. The latter is distinguished by a complete lack of hints during your play session, which leaves the player to depend on his instinct and experience alone. The dream employee - how do you find one? While your company grows and the story progress you will also need new people to work for you. An extensive system of employment and staffing will facilitate your work and accelerate the company's growth. Employees that we will be able to hire throughout the game will differ based on their experience, specialization and employment cost. Complex storyline with the possibility to make your own choices The story of the game is very extensive and allows you to go through the campaign in 27 different ways resulting in game bringing you many hours of great fun. You can be a law-abiding and responsible dealer who, using the experience gained while working with his uncle in his youth, will dynamically expand the business and ensure the satisfaction of his customers. The opposite choice will allow you to take a 'mafia' route where you will use the cheapest solutions when repairing and selling cars to deceive your customers and earn large amounts of cash as soon as possible. There will also be the possibility of stealing a vehicle at the request of shady customers. Game economy - is it better to invest in advertisement or repairs? There are many economic choices ahead of you. Invest in new employees, repair some cars for additional profit or maybe advertise? This system will allow you to feel like a real business owner, one that in many situations has difficult choices to make on how to invest his earned fortune to double it in the future. A random event system has been implemented in the game that will from time to time impact your business - positively or negatively - and you will be able to experience it during the campaign. Map handling system and personnel management. Car Trader Simulator has a map management and employee management systems. You can specify exactly which streets can be traveled by our employees who will transport and repair purchased (or stolen) cars. In addition, the events system will allow you to diversify the game with unexpected events or activities taking place in the city. To make it easier to navigate the map, it has been divided into mechanically distinctive sections (and that refer to the names of widely known districts of the USA). Real cars The game has a gigantic (purchased) library of real car photos (over 1000 cars in many different variants). Each set of photos is a complete set with vintages and models of a given car, additionally available in any color combination. By playing through the main campaign plotline we will also be able to spot some of the very unique model of cars. Auctions - key to success when developing a business There are many cars available in the game that you will be able to negotiate for or buy directly on the internet auctions. Every few minutes new cars will appear on auction alongside a group of people willing to pay for the best models. Not only will you need to have cash, but you will also have to bid wisely to get the most from the auctioned vehicle. Direct sales - contacting the customer Having a good car for sale is only half the battle, the other half is dealing with the customer and meeting his expectations. With each conversation, you will get guidelines on what the customer expects from you and your task is not only to sell the car but also to make the buyer happy and ensure our reputation to not fall. Coupled with our progress in the campaign customers will appear more often at our doors and our decisions regarding the appropriate car selection will have to become more accurate.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/689980/header.jpg?t=1658237228",
    "Price": 9.99,
    "Developers": "Live Motion Games",
    "Publishers": "Live Motion Games,PlayWay S.A.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/689980/ss_f580b20d1f907e9a92ee829ad7b2880f91888baf.1920x1080.jpg?t=1658237228,https://cdn.akamai.steamstatic.com/steam/apps/689980/ss_c3d8bb8e754c1f749869201170b457659594ec09.1920x1080.jpg?t=1658237228,https://cdn.akamai.steamstatic.com/steam/apps/689980/ss_185142445886b5c4acc7f63b13fe7e8d3cedb316.1920x1080.jpg?t=1658237228,https://cdn.akamai.steamstatic.com/steam/apps/689980/ss_8da17be8cde6be35797efac9626cbf807c8cd278.1920x1080.jpg?t=1658237228,https://cdn.akamai.steamstatic.com/steam/apps/689980/ss_fc7057f6f4296cc1704f86e4a19d25b85bacd2c7.1920x1080.jpg?t=1658237228,https://cdn.akamai.steamstatic.com/steam/apps/689980/ss_385114cc41b6a29ee719a0789764dcb9ea38ef9f.1920x1080.jpg?t=1658237228,https://cdn.akamai.steamstatic.com/steam/apps/689980/ss_c70ef2ed192e7cbc7bf6cf2e16b664421afdd851.1920x1080.jpg?t=1658237228,https://cdn.akamai.steamstatic.com/steam/apps/689980/ss_3601a3371ea6c4406a76b62099883c272a78f160.1920x1080.jpg?t=1658237228,https://cdn.akamai.steamstatic.com/steam/apps/689980/ss_56a557b1f142da27e78e41e423d57df76d60d6e1.1920x1080.jpg?t=1658237228,https://cdn.akamai.steamstatic.com/steam/apps/689980/ss_d3f53f2a1a6d257cbc6e90be8474ab1fb4ee0560.1920x1080.jpg?t=1658237228",
    "Slug": "car-trader-simulator",
    "Meta Title": "Car Trader Simulator: Nov 4, 2020, Live Motion Games and ...",
    "Meta Description": "Looking for information on Car Trader Simulator? Check out the release date (Nov 4, 2020), developer insights from Live Motion Games, and a complete gam...",
    "Alt Text Image": "Official header image for Car Trader Simulator game - Steam 689980",
    "Canonical URL": "https://gusku.site/game/car-trader-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Car Trader Simulator\", \"description\": \"Looking for information on Car Trader Simulator? Check out the release date (Nov 4, 2020), developer insights from Live Motion Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Live Motion Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Live Motion Games,PlayWay S.A.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/689980/header.jpg?t=1658237228\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}