{
    "AppID": 544730,
    "Name": "Catan Universe",
    "Release date": "Apr 25, 2017",
    "About the game": "Play your favorite game CATAN anytime and anywhere: the original board game, the card game, the expansions and ‘CATAN – Rise of the Inkas‘, all in one app! After a long voyage of great deprivation, your ships have finally reached the coast of an uncharted island. However, other explorers have also landed on Catan: The race to settle the island has begun! Build roads and cities, trade skillfully and become Lord or Lady of Catan! Go on a journey to the Catan universe, and compete in exciting duels against players from all over the world. The board game classic and the Catan card game bring a real tabletop feeling to your screen! Play with your Catan Universe account on the device of your choice: You can use your login on numerous desktop and mobile platforms! Become part of the huge worldwide Catan community, and compete against players from all over the world, and on all supported platforms. The board game: Play the basic board game in multiplayer mode! Join two of your friends for a maximum of three players and face all the challenges in “Arrival on Catan”. Make things even more exciting by unlocking the full basic game and the expansions “Cities &amp; Knights” and “Seafarers”, each for up to six players. The special scenario pack containing the scenarios “Enchanted Land” and “The Great Canal” adds even more variety to your games. The game edition ‘Rise of the Inkas‘ is another exciting challenge for you, as your settlements are doomed in their heyday. The jungle swallows the signs of human civilization, and your opponents seize their chance to build their settlement at the location they crave for. The card game: Play the introductory game of the popular 2 player card game “Catan – The Duel” online free of charge or master the free “Arrival on Catan”, to permanently unlock the single player mode against the AI. Get the complete card game as an in-game purchase to play three different theme sets against friends, other fans friends or different AI opponents and submerge yourself into the bustling life on Catan. Basic game free matches against two other human players Introductory game free matches Catan – The Duel against a human player “Arrival on Catan”: Master the challenges in all areas of the game to get more red Catan suns. You can use Catan suns to play against the computer. Your yellow suns recharge on their own. Trade – build – settle – Become Lord of Catan! Play on all your devices with one account. Faithful to the original version of the board game “Catan”, as well as the card game “Catan – The Duel” (aka “Rivals for Catan”) Create your own Avatar Chat with other players and form guilds Participate in seasons and win amazing prizes. Play to earn numerous achievements and unlock rewards. Get additional expansions and game modes as in-app purchases Get started really easily with the comprehensive tutorial Catan Universe uses an in-game currency called “Catan Gold”. You can unlock expansions using Catan Gold for unlimited play time. Bought expansions are linked to your account. You can log in on another device, the iOS or Android App and use your purchases there, too! Various bundles are available in the shop for a great value.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/544730/header.jpg?t=1648645817",
    "Price": 0.0,
    "Developers": "Endava",
    "Publishers": "USM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/544730/ss_4d2b63fe8096080fe698fc909f13cd2b45eeddcf.1920x1080.jpg?t=1648645817,https://cdn.akamai.steamstatic.com/steam/apps/544730/ss_c715bdd40e199c0bdcfbb734fb6e9c2fbc40fc10.1920x1080.jpg?t=1648645817,https://cdn.akamai.steamstatic.com/steam/apps/544730/ss_d76c21f24431e006937a4346e89b79b52e88fb02.1920x1080.jpg?t=1648645817,https://cdn.akamai.steamstatic.com/steam/apps/544730/ss_03bd48eabb022891b25fe93c2aa6c7f6e1499a6b.1920x1080.jpg?t=1648645817,https://cdn.akamai.steamstatic.com/steam/apps/544730/ss_584697d3ddc3753ec1aeaea424c33d711e7c6225.1920x1080.jpg?t=1648645817,https://cdn.akamai.steamstatic.com/steam/apps/544730/ss_ad82c719b43f6df105add62108f3bec3d7b6fc7b.1920x1080.jpg?t=1648645817,https://cdn.akamai.steamstatic.com/steam/apps/544730/ss_455f010ce9f7984165c15f0cf1de14a84bfc5467.1920x1080.jpg?t=1648645817,https://cdn.akamai.steamstatic.com/steam/apps/544730/ss_f5a2ba6420e85118c274f6751f82d4cb0ce4012e.1920x1080.jpg?t=1648645817",
    "Slug": "catan-universe",
    "Meta Title": "Catan Universe: Apr 25, 2017, Endava and Full Overview",
    "Meta Description": "Looking for information on Catan Universe? Check out the release date (Apr 25, 2017), developer insights from Endava, and a complete game summary.",
    "Alt Text Image": "Official header image for Catan Universe game - Steam 544730",
    "Canonical URL": "https://gusku.site/game/catan-universe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Catan Universe\", \"description\": \"Looking for information on Catan Universe? Check out the release date (Apr 25, 2017), developer insights from Endava, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 25, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Endava\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"USM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/544730/header.jpg?t=1648645817\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}