{
    "AppID": 1028730,
    "Name": "Creo God Simulator",
    "Release date": "Mar 2, 2019",
    "About the game": "BUILD. SMITE. REPEAT. Creo God Simulator is a game of city-building, resource management, survival, and a ton of peasant smiting. As the divinely-selected Creostrider, it's your job to build a society bit by bit, while convincing your new population to believe in you as their one true god. During your time as the Creostrider, you will discover new powers to use and more advanced buildings to place, but beware, as you progress, the randomized events that afflict your town will become more difficult, not to mention that a larger population presents a myriad of engaging challenges to overcome. Can you prove yourself as the new true God, or will you slowly fade from the memory of the people you led? FEATURES With God Powers come God Responsibilities In Creo God Simulator, you are the Creostrider, a being chosen by the Gods to become like them. You are given incredible power to build great cities and smite the lowliest peasant. Here are some of the features regarding your newly-found godhood: Name your Religion and God Name Faith/Fear System: Your actions affect your follower's opinions of you Awesome God Powers: Meteors, lightning, rain - the power's in your hands Town villagers have the ability to convert each other without your influence or approval (just like in the real world!) Build a Great Civilization Creo's unique building system allows you to place buildings in any position you want. Do you want a new shopping center? Go for it! Or perhaps a ghetto surrounding your mines? What about tons of tightly-packed homes that will totally not be a fire hazard? In addition to the initially-available buildings, Creo God Simulator also has an inspiration system/tech-tree that you can use to unlock new and more powerful buildings! With Creo's building and inspiration system, your imagination is the limit! Free-form building placement A variety of building types and models Creo-specific architecture style An ever-expanding inspiration system/tech-tree A New Gaming Experience with Every Playthrough Creo God Simulator boasts a procedurally generated world, quests, and events! No two playthroughs will ever be the same. Things could be going smoothly for your town when suddenly, an earthquake erupts, and locusts swarms descend upon your farms. Once those are dealt with, peace reigns once again, until an angry herd of cats decides that your town will be its new home—this is just one example of the limitless stories that you can experience in Creo. A Procedurally-generated map Various Types of Positive and Negative Events Cat Herds A regularly updated list of challenging new quests to accomplish",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1028730/header.jpg?t=1646978622",
    "Price": 0.0,
    "Developers": "MKSM Design LLC",
    "Publishers": "MKSM Design LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1028730/ss_d89d8e116ed325ab512a0e029a26ba82ca3f2dd4.1920x1080.jpg?t=1646978622,https://cdn.akamai.steamstatic.com/steam/apps/1028730/ss_9d2fb37ca02ab0ffe7125fcc481804e925294b4f.1920x1080.jpg?t=1646978622,https://cdn.akamai.steamstatic.com/steam/apps/1028730/ss_e54329da32e1623c1bf03a8d9224c4ef831e0896.1920x1080.jpg?t=1646978622,https://cdn.akamai.steamstatic.com/steam/apps/1028730/ss_778c2983052057d6df3d41c77ade1ca484806772.1920x1080.jpg?t=1646978622,https://cdn.akamai.steamstatic.com/steam/apps/1028730/ss_91da4ca1e59db35b2ea97ac4a36fa82a529127dc.1920x1080.jpg?t=1646978622,https://cdn.akamai.steamstatic.com/steam/apps/1028730/ss_119581d00604bfc9eb75dcc2e9855cc03057cadc.1920x1080.jpg?t=1646978622,https://cdn.akamai.steamstatic.com/steam/apps/1028730/ss_abc75447ce815fd90cedc25670275a4d72a68ba4.1920x1080.jpg?t=1646978622",
    "Slug": "creo-god-simulator",
    "Meta Title": "Creo God Simulator: Mar 2, 2019, MKSM Design LLC and Full...",
    "Meta Description": "Looking for information on Creo God Simulator? Check out the release date (Mar 2, 2019), developer insights from MKSM Design LLC, and a complete game su...",
    "Alt Text Image": "Official header image for Creo God Simulator game - Steam 1028730",
    "Canonical URL": "https://gusku.site/game/creo-god-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Creo God Simulator\", \"description\": \"Looking for information on Creo God Simulator? Check out the release date (Mar 2, 2019), developer insights from MKSM Design LLC, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 2, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"MKSM Design LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MKSM Design LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1028730/header.jpg?t=1646978622\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}