{
    "AppID": 1888120,
    "Name": "Crypchania",
    "Release date": "Mar 8, 2022",
    "About the game": "About the game: Enjoy a fresh old school classic 2D multiplayer RPG with an active turn-based battle system. Crypchania is a game that is focussing on story, exploring, lore, puzzles, and battles. The main story is about 40 hours long and with the side quests you have over 120 hours of gameplay. The game does have some platforming elements like dodging the canon ball's, mini game's, and alot of side quests and secrets to find. Story You thought that you were a simple courier that delivers packages from town to town in the world of Crypchania. But to be honest, you are one of a kind. When rescuing a girl named Eveey and taking her safely back to her uncle's house, her uncle tells a story about a stranger that crashed down in his yard and died a few days ago. The stranger had some special gear with him but also a package with an address. Not knowing what to do, you are asked to deliver the package, you are a courier after all. From this moment on your big adventure awaits. But on your way, strange things are happening and you face many obstacles before you reach your destination. Along the way, It does make you curious about what is inside this package, and why some are after it. Choose your looks: It does make a difference if you are changed into a girl or a boy. Because you can alter the Tetrastream you can change your looks through mirrors. You sometimes change yourself to a small rodent to get you in secret places. Some equipment can only be worn by boys or girls and visa versa. Dialogue will be different and it does change the outcome of some side quests and the ending of the game. The more you progress the game the more skins you can choose from and also find hidden skins to show of to other online players. Login / register: The first time enter the world through the Tetrastream you need to register an account (name - password and some random letters / numbers). Keep in mind that the password cannot be retrieved or changed at any moment so make sure you remember it well together with your account name. When ready you can login and if you have saved your game, you take off from this point with all the items and SQUARES. MultiPlayer Co-Op: You need other players to progress on some side quests, secrets, and some challenges. So make sure that you have a friend nearby when starting to play. There are also special pvp-battles that allows you to fight a special enemies (not turn based) like the giant cathapiller from the trailer, there are also trails that let you challenge each other for example who pops the most balloons, find the treasure first and also puzzles to solve with and against each other. Enemies and battles: Enemies are visible on the map, when you get touched by them or you walk into them a turn-based battle will start. When your level is too high for a certain area, the enemy gets knocked over and there is no battle, however, it will cut away some hp and you still receive less exp for leveling up. Inside battles, you can use Magix, summons, skills, and attacks. When you progress the story and you help new friends they are willing to help you and let them be summoned in battle. Enemies have elements on them, using ice magix does more damage to fire enemies. There are 20 summons for you to find, 25 skills and 45 magix spells. Weapons and armor have random generated stats with marges, so always compare them when you find new gear. Most of the battles are turn based where you use your attack for a melee attack and magix on the enemies. When you are at a certain level the enemies of that area are attacked straight away without entering the turn-based battle system. This is explained in the game for players to speed things up. These battles will let you receive experience and the loss of HP (keep an eye on the Hud) to heal yourself but won’t give you items. Boss battles or special battles are always turn based. On some occasions you will enter a battle scene where you are on a small map and you fight enemies without entering the battle system. You can’t heal yourself with potions so you need to catch the butterflies for your hp to recover. Magix needs MP to cast. You can flee normal battles, except boss fights, you can defend before a powerful strike hit you. When you die in battle, you return to the inn of the corresponding area and most of the time you lose your package at the same place where you have been Ko'd except when fighting a boss, you keep the package with you. If you get KO'd again without retrieving the package you are transported to the inn and you have lost 10 levels but lucky you, your package is back. Also Keep in mind to when you get Ko'd, without an anti-ko, your character will also lose 5 levels. So always walk with a few anti-ko and the package before you are going to battle. If not, all the leveling was for nothing. Saving your progress: The progress of the game is saved with save-crystals. You start your adventure with 50 save crystals and you find plenty along the way. Most of the inns have a Tetrastream machines, just put in a save crystal and your progress is stored on the Tetrastream. If you want to save mid-game you can do so by going into the menu. Saving from the menu cost you an extra save-crystal. Calander system: Real-life dates are triggering events all over Crypchania. So make sure to check back once in a while, to find some cool surprises. Dates like Halloween for example, always ask Mia at one of the inns you cross. Play everyday to find all of these events. Menu: In the menu, you find a couple of options, Turn on or off light sources (if you are experiencing lag), Message speed, Volume, game controller settings, keyboard settings for binding key's, battle speed, battle animation, etc... Use the Scotties Beam to enter a six numbered code and receive some additional items freebies, and tips that would help you on your quests.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1888120/header.jpg?t=1646812187",
    "Price": 8.99,
    "Developers": "Martin Bauer",
    "Publishers": "Squareware",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_9c99f5ddcdf32964396d9ead4f51d6214719d057.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_9c073f770bef5b216324e5d585aa35886109f80c.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_1334d10c23c601ebb7677fa8333bbd7bf3c601c7.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_54d307c46e2a8fd5adcac913e26160e6c3743f38.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_763161ea274c4aaf0e10e2eff1ee66cda8136fec.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_f3ba8ffd2487a1e30351f6da0d92a6024d8574a7.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_c65d0939583fbd738bc10edd987a67b82d0076e4.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_48fc8c884ed1f923eb6bae57f9a1a0c72b60e46b.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_83b428b95ff5a083c7f29a465d7ef526205e4af9.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_ca661cae1b199f19fe634a01512717ab72e4332f.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_44fc94b6b3e2b5aee8ec78aba57e4d485c811e72.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_114d6b28432b383ef1d7b20e5a60f7243406a5df.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_7af9b0237f659fb4aba4e4092f0854fd906376a6.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_9af2b8c381af55cdedce8174734518b8f397687f.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_9f54256bc3c548d22be81dc107e0b815e6a5ebf3.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_563d629dd4b2aa848df0531351d538cc833d4ff8.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_84677c561b2415829c2461f70bc897326006d80a.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_225b51c9181876bf101900a99e940389a78a4de4.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_47a73c1967d7d1ce67a29504225b083a9ff3dc51.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_d2ca38d3bff2f933c885df0e39bc3e13c9b201b9.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_6d959a9d2f4cc847096e8bc554afaf43b4f8e5e2.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_c7dcebf267fb8b34b2d1ecb12800de73e4c6594a.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_561b4468cc8dd5682b7cc6cefd75b9ad5bb94766.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_a099d08f1b3e92e4764652a8e141952134a54322.1920x1080.jpg?t=1646812187,https://cdn.akamai.steamstatic.com/steam/apps/1888120/ss_7d99219387db97d5340fbde5bb0b60bd3983226a.1920x1080.jpg?t=1646812187",
    "Slug": "crypchania",
    "Meta Title": "Crypchania: Mar 8, 2022, Martin Bauer and Full Overview",
    "Meta Description": "Looking for information on Crypchania? Check out the release date (Mar 8, 2022), developer insights from Martin Bauer, and a complete game summary.",
    "Alt Text Image": "Official header image for Crypchania game - Steam 1888120",
    "Canonical URL": "https://gusku.site/game/crypchania",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crypchania\", \"description\": \"Looking for information on Crypchania? Check out the release date (Mar 8, 2022), developer insights from Martin Bauer, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Martin Bauer\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Squareware\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1888120/header.jpg?t=1646812187\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}