{
    "AppID": 1799140,
    "Name": "Detective Agency: Murder at the Manor",
    "Release date": "Jul 25, 2022",
    "About the game": "Welcome to join our QQ group: 519072161 to discuss games together. Game Introduction 'Detective Master's House' is a real-life detective puzzle game. You will play the role of detective 'Henry', shuttle through the murder scenes of various Blizzard Mountains, and investigate each intricate case in depth. In Manor Mystery , you will experience the twists and turns of the murder and find out the ugly truth behind the death of the owner of the Rose Manor in the back room! Gameplay Search evidence In order to gain clues to the case, you will visit the crime scene to search for evidence and solve ingenious puzzles. Don't miss every clue of the scene! Those seemingly ordinary objects, under reasonable logical reasoning, may become irrefutable evidence to lock the real murderer! information Is it a confusing lie? Or the unmistakable truth? Carefully examine the confessions of the suspects and capture the keyword information that the case really needs. This is the foundation of a detective! reasoning When complex and interrelated fragmented clues are in front of you, how to connect them to form a complete logical chain to make correct inferences? Everything needs to use your strong logical reasoning ability! Destroy the murderer You have seen the truth of the case, but the culprit has denied it. Use your ingenious and astonishing reasoning to bring out his irrefutable hard evidence and smash his undisguised lies! Replay When the real culprit is reported, this is not the final victory. Step-by-step interpretation of the details of the case, to verify whether your reasoning is accurate, to restore the complicated and confusing truth of the case! Game Features Immersive detective tour Real-life case detection, on-site evidence collection, and trial of suspects... Rich reasoning links, in-depth experience of the whole process of a detective's case detection. Complicated cases The logic of the case is rigorous, the case is ups and downs, the classic case of Blizzard Mountain Villa, and experience the original reasoning. Featured reasoning system The visualization of the reasoning logic chain can help you clarify your thoughts in the complex clues, and find the real culprit. About our studio We are 'Ji Xiang Ru Yi', an independent game studio from Chengdu. There are currently four team members, two planners, one program, and one artist. The inspiration for making this game came from an accidental whim when playing a script to kill. How about turning these evidence-gathering links into actual scenarios? Can you restore every link of the detective's case-solving in a more immersive way? When I first came up with this idea, every member of the team was very excited. Although everyone had never tried a puzzle-solving game, everyone played Ace Attorney and watched The Kindaichi Case Files grow up. We spent a lot of time on this product, from project approval to a little bit of implementation, we painfully found that the game we made was quite different from the original imagination. After two or three overthrows and redoes, it finally ended in face is presented before you. This is not a perfect work, but an exploratory attempt by our studio is an explanation for the small idea at the beginning, the determination to do what it says, and the serious work for so long. I would like to thank every friend in the studio for their hard work and dedication after countless quarrels; I would like to thank all the classic reasoning games we have played for the inspiration, and I would like to thank all the family members and family members who have helped in the process of making the game. Friends, thanks to all players!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1799140/header.jpg?t=1658798525",
    "Price": 3.19,
    "Developers": "吉祥如意工作室",
    "Publishers": "吉祥如意工作室",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1799140/ss_f2090bd2773f4250e99eb7e9769f2068d94ba52f.1920x1080.jpg?t=1658798525,https://cdn.akamai.steamstatic.com/steam/apps/1799140/ss_23e57db25595c8855ed348450fb4d6988601b059.1920x1080.jpg?t=1658798525,https://cdn.akamai.steamstatic.com/steam/apps/1799140/ss_2175de26f3014f996458600b4ffc3c91bd61cc6e.1920x1080.jpg?t=1658798525,https://cdn.akamai.steamstatic.com/steam/apps/1799140/ss_0deef3bf1cda34b2b896fd7dde53087096e0dccf.1920x1080.jpg?t=1658798525,https://cdn.akamai.steamstatic.com/steam/apps/1799140/ss_073d70565ae3054289b5a7b646b51f448fe3396f.1920x1080.jpg?t=1658798525,https://cdn.akamai.steamstatic.com/steam/apps/1799140/ss_36905d793986752f61da62b11c847aed38bd7b90.1920x1080.jpg?t=1658798525,https://cdn.akamai.steamstatic.com/steam/apps/1799140/ss_ef291a13daba4b22e6de0e38d7255785dab84fe0.1920x1080.jpg?t=1658798525,https://cdn.akamai.steamstatic.com/steam/apps/1799140/ss_afe8fe884a269f6c8e9d413001404db560dce4ae.1920x1080.jpg?t=1658798525,https://cdn.akamai.steamstatic.com/steam/apps/1799140/ss_057f56d338cec2a316b415f902203ab6b35a3538.1920x1080.jpg?t=1658798525,https://cdn.akamai.steamstatic.com/steam/apps/1799140/ss_9da07ba2603441c6c6f8d2df960f7f8f65091c96.1920x1080.jpg?t=1658798525",
    "Slug": "detective-agency-murder-at-the-manor",
    "Meta Title": "Detective Agency: Murder at the Manor: Jul 25, 2022, 吉祥如意...",
    "Meta Description": "Looking for information on Detective Agency: Murder at the Manor? Check out the release date (Jul 25, 2022), developer insights from 吉祥如意工作室, and a comp...",
    "Alt Text Image": "Official header image for Detective Agency: Murder at the Manor game - Steam 1799140",
    "Canonical URL": "https://gusku.site/game/detective-agency-murder-at-the-manor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Detective Agency: Murder at the Manor\", \"description\": \"Looking for information on Detective Agency: Murder at the Manor? Check out the release date (Jul 25, 2022), developer insights from \\u5409\\u7965\\u5982\\u610f\\u5de5\\u4f5c\\u5ba4, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u5409\\u7965\\u5982\\u610f\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u5409\\u7965\\u5982\\u610f\\u5de5\\u4f5c\\u5ba4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1799140/header.jpg?t=1658798525\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}