{
    "AppID": 1552040,
    "Name": "Dominant Mind",
    "Release date": "May 18, 2021",
    "About the game": "Dominant Mind is a Steam version of one of the most popular board games ever!! If you are a lover of logic games, this is the right game for you! People have always been interested in challenging the mind with mind games and exercise the brain with brain training games. Our brain is a muscle and just like every other muscle. It needs exercise to develop and keep fit! Try in two playing modes to break the code: - easy mode with 4 pins - hard mode with 5 pins The logic and Dominant Mind game rules are very similar to a mind game called Bulls and Cows that was played with a pencil on paper. Ready to get your brain training?   *** Game Rules *** Dominant Mind is a mind game that is played on a decoding board with a shield covering four colored pins. The goal is to guess the code and recreate the hidden row. Below the shield, there are eight horizontal rows where the player, the code breaker, is able to guess the color and placing of the covered pins. On the right side of each horizontal row there are holes for pegs where the software will provide feedback for the code breaker after every attempt made to guess the code:   ⚫ black peg indicates right color pin in right place ⚪  white peg indicates right color pin in wrong place 🔴  no peg indicates wrong color and place ❓ two playing modes - 4 pins easy mode and 5 pins hard mode  The code breaker only gets one peg for every covered color that they guess right. If there are two pins of the same color hidden behind the shield, and the player guesses that there are three pins of that same color, the player can still only get two pegs indicating the right color. Once the feedback has been provided the code breaker has a new attempt to guess the color/placing and break the code, with the help of the feedback and logical thinking. As the numbers of rows indicate, you only have eight attempts to guess the code. You will be awarded points when you guess the color right and extra bonus points when you crack the code. Extra points are also awarded if you break the code in an early stage of this logic game.  Have fun, enjoy the game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1552040/header.jpg?t=1621323565",
    "Price": 4.99,
    "Developers": "Peaksel",
    "Publishers": "Peaksel",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1552040/ss_6d96d81d919306bf8aafbb50e29a341b67b575b3.1920x1080.jpg?t=1621323565,https://cdn.akamai.steamstatic.com/steam/apps/1552040/ss_4817c9b574b29f5e4756863db932227985726c4c.1920x1080.jpg?t=1621323565,https://cdn.akamai.steamstatic.com/steam/apps/1552040/ss_a9111434dc5bc378855a8ec5f58c71781b198dc3.1920x1080.jpg?t=1621323565,https://cdn.akamai.steamstatic.com/steam/apps/1552040/ss_14e410de2953c6988f662e44e7772b0ae24d2e31.1920x1080.jpg?t=1621323565,https://cdn.akamai.steamstatic.com/steam/apps/1552040/ss_8017a03c6a38e09cf6e71307701aa3dca0e5da3f.1920x1080.jpg?t=1621323565",
    "Slug": "dominant-mind",
    "Meta Title": "Dominant Mind: May 18, 2021, Peaksel and Full Overview",
    "Meta Description": "Looking for information on Dominant Mind? Check out the release date (May 18, 2021), developer insights from Peaksel, and a complete game summary.",
    "Alt Text Image": "Official header image for Dominant Mind game - Steam 1552040",
    "Canonical URL": "https://gusku.site/game/dominant-mind",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dominant Mind\", \"description\": \"Looking for information on Dominant Mind? Check out the release date (May 18, 2021), developer insights from Peaksel, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 18, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Peaksel\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Peaksel\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1552040/header.jpg?t=1621323565\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}