{
    "AppID": 1127540,
    "Name": "Eden's Ritter - Paladins of Ecstasy",
    "Release date": "Jul 31, 2020",
    "About the game": "Eden’s Ritter: Paladins of Ecstasy is a darkly erotic medieval fantasy visual novel developed by Waffle. Join Princess Cecily in her desperate struggle against the forces of evil that seek to overthrow her holy kingdom and thrust the world into carnal chaos! Features Narrative-based visual novel with multiple endings. A wide variety of vulgar monsters to defeat... or be defeated by. Hours of additional content in two side stories centering on villains Xenoarachne and Doppelganger. Stunning, high-resolution art from renowned artists Q-Gaku and Mogudan. Story The sacred kingdom of Ellerald is at war with the endless hordes of wretched monsters known as Lustfiends. Keeping them at bay are the mighty warriors of the Holy Guard, led by their fearless commander Noein—but when the Holy Guard are sent away to stem a suspiciously well-coordinated invasion, the capital is terrorized nightly by the foulest of beasts. Underdefended, the heart of the kingdom is on the brink of ruin. Desperate to save her people from suffering, Princess Cecily Ellerald makes a difficult decision. She forms a pact with the god-tree, Sephirot, granting Cecily the power to transform into a heavenly warrior capable of single-handedly curbing the lustfiend threat! Her divine powers as Eden's Ritter Lucifel are formidable, but costly, for the longer she uses them, the stronger her bodily urges become. Over the course of her adventure, Cecily must learn how to master her powers, lest her demonic foes should master her instead. To make matters worse, an even greater foe lurks in the shadows... the vile order of the Xenobides, who plot to use Princess Cecily’s newfound powers against her and usurp her kingdom. Their tentacles are everywhere, and their army of monsters will push our heroine to her limits... in more ways than one! Will Cecily succeed in defending the kingdom—or will her dark desires get the better of her, and seduce her to succumb to utter ecstasy? Characters Princess Cecily As heir to the throne and royal priestess of the Elleraldian faith, Cecily is a well-loved and well-endowed figurehead of her kingdom. Though she cares deeply for her people and wishes to help them in any way she can, she secretly resents her own weakness and envies the brave warrior Noein. Seizing the chance to gain power and defend her subjects, she becomes Eden’s Ritter Lucifel, a powerful magic-wielding warrior. But due to the forbidden nature of her new abilities, she must keep her identity a secret from the people she has sworn to protect. Commander Noein The leader of the Holy Guard, Noein is a hardened war veteran, adored by people far and wide. Not only has she devoted her blade to Princess Cecily, but the two have been close friends since childhood; to this day, to this knight, no sacrifice is too great to protect her princess. As the bulwark and buttress of the capital's defenses, her reluctant absence has left a gaping hole. How long can the city stand until she makes her return? And will her sword alone suffice for her to safeguard what she loves? Rudolf The archbishop of the Elleraldian faith. When the king falls ill with a mysterious ailment, Rudolf must accept the heavy burden of leading the kingdom during this time of peril—most reluctantly, of course. Though his leadership is admired by most members of the kingdom’s war council, others remain unconvinced, Noein included. Luxeria A mysterious nun with a bewitching smile. Though she adorns herself with a necklace bearing the symbol of the Elleraldian faith, her actions are unusual for a woman of her perceived status. What mysteries is she hiding in the darkness underneath her robes? Xenoarachne One of the numerous lustfiends that terrorize the kingdom. Half spider, half demon, all sadist, Xenoarachne is a cruel and malicious seductress, capable of hypnotizing her prey and trapping them in her webs. No amount of forbidden power can prepare Cecily for the transformative consequences of their encounter.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1127540/header.jpg?t=1620979417",
    "Price": 29.99,
    "Developers": "Waffle",
    "Publishers": "HOBIBOX,Shiravune",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1127540/ss_4e596d4bb2f83d9dadf6b6c25210d7092e9b86de.1920x1080.jpg?t=1620979417,https://cdn.akamai.steamstatic.com/steam/apps/1127540/ss_163f5b3b33e764ccd413c5a188eeb558f5539471.1920x1080.jpg?t=1620979417,https://cdn.akamai.steamstatic.com/steam/apps/1127540/ss_221c3fa9c13e4e3fd30a227abe8d143bacc522ff.1920x1080.jpg?t=1620979417,https://cdn.akamai.steamstatic.com/steam/apps/1127540/ss_d1f027853bc68532cb0e9f8636ca9fe4e296490a.1920x1080.jpg?t=1620979417,https://cdn.akamai.steamstatic.com/steam/apps/1127540/ss_ccb1ff12124d1e1491464a4e6cbec1c4e78fc3c1.1920x1080.jpg?t=1620979417,https://cdn.akamai.steamstatic.com/steam/apps/1127540/ss_820eedb082f3cbfc252b9a10f7ef1527467722ed.1920x1080.jpg?t=1620979417,https://cdn.akamai.steamstatic.com/steam/apps/1127540/ss_904fa02bce7f63b4761dfe01cdd5cdcd716fb766.1920x1080.jpg?t=1620979417,https://cdn.akamai.steamstatic.com/steam/apps/1127540/ss_0d921182d66f25b1a3e005365aed4c4664616715.1920x1080.jpg?t=1620979417,https://cdn.akamai.steamstatic.com/steam/apps/1127540/ss_1cf6c1e8d14489f089050f0cac9361b9ac1a41da.1920x1080.jpg?t=1620979417,https://cdn.akamai.steamstatic.com/steam/apps/1127540/ss_9a0ef6011433c1c8e538abe1e8963cd30696609f.1920x1080.jpg?t=1620979417,https://cdn.akamai.steamstatic.com/steam/apps/1127540/ss_b38eb51072dc55b26217e9e5e449cfb3e21a2621.1920x1080.jpg?t=1620979417",
    "Slug": "eden-s-ritter-paladins-of-ecstasy",
    "Meta Title": "Eden's Ritter - Paladins of Ecstasy: Jul 31, 2020, Waffle...",
    "Meta Description": "Looking for information on Eden's Ritter - Paladins of Ecstasy? Check out the release date (Jul 31, 2020), developer insights from Waffle, and a complet...",
    "Alt Text Image": "Official header image for Eden's Ritter - Paladins of Ecstasy game - Steam 1127540",
    "Canonical URL": "https://gusku.site/game/eden-s-ritter-paladins-of-ecstasy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Eden's Ritter - Paladins of Ecstasy\", \"description\": \"Looking for information on Eden's Ritter - Paladins of Ecstasy? Check out the release date (Jul 31, 2020), developer insights from Waffle, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 31, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Waffle\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HOBIBOX,Shiravune\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1127540/header.jpg?t=1620979417\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}