{
    "AppID": 244590,
    "Name": "Epigenesis",
    "Release date": "Aug 1, 2014",
    "About the game": "Epigenesis is an online multiplayer sports/FPS game in which two sides are locked in a never-ending fight for world domination by playing ball. In this non-lethal ballgame of the future, players leap across platforms suspended high up in the air trying to get a ball located in the middle of the arena and score goals against their opponents. Each player carries a gravity cannon capable of pushing enemies (and friends) down from the heights of the arena. When a player scores, he receives a genetically modified super-seed and gets the opportunity to plant it onto a platform to capture it. To win the game you must capture towers and construct a node system from your goal post all the way to your opponents' goal post. If this hasn't happened by the time that the clock reaches zero, the team with the most scores win! Teamwork, tactics and precision is key to win eternal glory in a game of Epigenesis ! Visit our official website , facebook and twitter for regular updates and news about Epigenesis! Remember to visit our official youtube channel for more in-depth tutorials on how to play Epigenesis! Now with Trading Cards! Get trading cards and craft badges for cool emoticon and background rewards! New Feature: HATS! Complete daily missions and earn Mission Points to spend in the store! Get some swag for your favourite team and show it off in-game! No micro-transactions, only cool hats. Join the Community Join the growing Epigenesis community and find people to play with on the official Epigenesis Steam forum! Remember to join the community driven Epigenesis Community Group EpiGenCG here on Steam to find more people to play with! What people are saying 'When you see the trailer you’ll understand why it won this year’s Make Something Unreal contest: it looks brill.' - PCGamesN 'It’s just crazy enough to work, and where it wasn’t crazy enough of its own accord, developer Dead Shark Triplepunch (yes, that’s their real name) just added tornadoes. Done and done.' - Rock Paper Shotgun 'Judges praised Epigenesis for its ingenious concept, engaging gameplay and clever use of a scientific concept inspired by the theme for this year’s competition.' - UnrealEngine Key Features Ball Sport of the Future Play a ball as well as a domination 5-on-5 game on top of tall towers and platforms! Fast-paced high-altitude Action Equipped with jumping-jets, players will have to time their jumps or suffer steep falls. Non-lethal combat with surgical precision All weapons used are non-lethal force-based gear. Push your opponents down from the platforms and boost your friends towards the goal! One-time use pickup abilities Tactically use the Grapple, Dash or Shockwave to further advance your goal-scoring conquest! Customize your loadouts There are 6 plants with unique abilites as well as 5 different passive stat-boosts for you and your team. Discuss combinations with your team and choose the plants that best fit your playstyle! 6 unique maps Play ball on 6 different arenas constructed across the world of Epigenesis, featuring snowy mountains, lush forests and desolate cities! In-game cosmetics shop Earn in-game currency by proving your worth in daily missions and spend it on cosmetic items such as Plant skins and Hats! Single-player and bots Internet downed or just want to hone your skills? Face-off against the bots of Epigenesis or have them join your multiplayer matches!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/244590/header.jpg?t=1466107831",
    "Price": 0.0,
    "Developers": "Dead Shark Triplepunch",
    "Publishers": "Dead Shark Triplepunch",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/244590/ss_812870fd6f46b80955acf1337f1dade120343548.1920x1080.jpg?t=1466107831,https://cdn.akamai.steamstatic.com/steam/apps/244590/ss_f2d7afd022a5a98db5c9af1c5a91a03185a5eb58.1920x1080.jpg?t=1466107831,https://cdn.akamai.steamstatic.com/steam/apps/244590/ss_f373bc072bb8e6474edc86eb2c40218add32f175.1920x1080.jpg?t=1466107831,https://cdn.akamai.steamstatic.com/steam/apps/244590/ss_0ef90cdcc244bea7908c1ea7fd83bc016ab2ac73.1920x1080.jpg?t=1466107831,https://cdn.akamai.steamstatic.com/steam/apps/244590/ss_19b2690126b49a3a8f3bc9753885cecddb40b66a.1920x1080.jpg?t=1466107831,https://cdn.akamai.steamstatic.com/steam/apps/244590/ss_12a0fcf945f3809b39d0e45e6523d025c954397e.1920x1080.jpg?t=1466107831",
    "Slug": "epigenesis",
    "Meta Title": "Epigenesis: Aug 1, 2014, Dead Shark Triplepunch and Full ...",
    "Meta Description": "Looking for information on Epigenesis? Check out the release date (Aug 1, 2014), developer insights from Dead Shark Triplepunch, and a complete game sum...",
    "Alt Text Image": "Official header image for Epigenesis game - Steam 244590",
    "Canonical URL": "https://gusku.site/game/epigenesis",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Epigenesis\", \"description\": \"Looking for information on Epigenesis? Check out the release date (Aug 1, 2014), developer insights from Dead Shark Triplepunch, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 1, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dead Shark Triplepunch\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dead Shark Triplepunch\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/244590/header.jpg?t=1466107831\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}