{
    "AppID": 1841400,
    "Name": "灵途",
    "Release date": "Jan 20, 2022",
    "About the game": "'Spiritual path' is a round game driven by the plot with the world view of immortal Xia. The story of this work takes place in a fascinating fairy Xia world, and there are common elements and characters in ancient Chinese myths. From the beginning of the game, you will face the choice of career, which will determine your martial arts ways and career positioning in the game. You can build better equipment and capture stronger pets by constantly accumulating materials and collecting fragments. Use your strategy to fight with players and NPCs. Game features Clear career system At the beginning of the game, players will be faced with career choices. Players can choose by viewing skills and career descriptions. This will determine the player's school skills in subsequent games, the configuration of attribute points and their own positioning in PVP. Terran: the strongest control, with three forms of control skills Protoss: the strongest attack, master three output elements Demon clan: the strongest auxiliary, which is a great trouble for teammates and enemies War clan: omnipotent role, can attack and defend, comprehensive and changeable Spirit clan: the chief of object attack, which can double attack the enemy A fascinating plot line There are rich main and branch plots in the game. The player will trigger a new plot after completing a certain plot. The main plot is continuous and linked, and there are many branches. Under each branch, players will play the protagonists in different plots, so as to feel the experience and surprise we have carefully prepared for players Rich combat assistance system There are 53 babies and 15 partners in the game. According to the quality of babies, the attributes, talent skills and the number of skill slots will be different. The more qualified babies will also have different positioning and training directions. Partners can be divided into different factions through skills. Players can carry up to 4 partners at the same time. Through various combinations, players will bring more surprises and experiences. Players can also adjust and improve their partners' talents and skills as needed. Players can build a strong team for themselves by improving their babies and partners. Various equipment and dressing systems The protagonist has a total of 9 parts that can be used to build equipment. The equipment in different parts will provide different attribute values. The equipment can also be continuously strengthened by refining and upgrading. There are 3 positions for dressing up. Players can dress up according to their favorite. Highly free market system Players can sell all kinds of items by setting up stalls in the market, and players can also buy items sold by other players in the market. Item trading includes babies, equipment, skill books and a series of materials. At the same time, players can choose the currency they want to recycle during trading, so as to truly realize the free trading of players. Diverse play system In addition to daily activities and tasks, it also contains many fun playing methods. When the player reaches a certain level, it will first provide the player with a new play guidance task to help the player get familiar with the play. In the follow-up, there are not only traditional playing methods such as catching ghosts, suppressing demons, sealing demons and demon kings, but also novel three world ghost kings, nine palaces and eight trigrams, heavenly masters subduing demons, etc. There are simple and easy single task, complex and difficult team PK and copy. At a specific time, the game will also open the limited time playing method, which also includes the playing methods of PVP and PVE. There are more than 40 ways to play the game. I believe it can bring rich and wonderful experience to every player who loves to explore. Welcome all players who like this kind of game to join us. You can enjoy the fun of training in daily life and the game with your opponent in battle. We hope that more players can enjoy the fun of strategy winning, and look forward to the addition of generalists in each round.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1841400/header.jpg?t=1642679990",
    "Price": 1.99,
    "Developers": "山东天之眼网络",
    "Publishers": "成都光之旅途工作室",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_cc729a6ee00cbbf9769b0fdb4ee0cf42f99c092b.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_0a604cd4420ac35494a792b50cb8a202de25d11f.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_bf5c93796e8e24a9fee7dcd6aebbec6ff6e3465a.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_ff5df2927976b3edf87e56c41f32e72bd5dbd978.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_8c02c8c5319422177574379582ff7e9f3e61a64b.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_739edeeda6cbed3f81aaa9d7ee1d80d887bd94cb.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_12970e317bfc40ec22ae44ff8abeab2558e29490.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_81f0c34358223d134bd3998e5be007db41c5932d.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_c8d5c3b0a4f2e5582e91aa925d1676de7f423e4f.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_88ccb35886aad3ee96453f563d5efd1f5a8effa3.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_19b2a55530126084bd1370c0017bbaa24db7c8e4.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_62cd9e3439dd8612074e463f692d43ed1ede591f.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_4ed076b9c3b31658817abf3969e060777d21959c.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_125767f9f4ee61c5a93ebc7a763ea50376eff9f3.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_7ef331b0556114029094fe912ca39acd3d48bb94.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_868d5d518586d0853bafce026f38cb21769c31ac.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_96ceec8ea5df91006c7ab84dd5ce216d22d97384.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_5d224424976cbfbe0828540fbe37ba8955855f7a.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_eedda27e18274a2c72aae9fae2735e6be0f28a54.1920x1080.jpg?t=1642679990,https://cdn.akamai.steamstatic.com/steam/apps/1841400/ss_48b65ed095b9228b45917ab5ac07a46e4d4178c2.1920x1080.jpg?t=1642679990",
    "Slug": "",
    "Meta Title": "灵途: Jan 20, 2022, 山东天之眼网络 and Full Overview",
    "Meta Description": "Looking for information on 灵途? Check out the release date (Jan 20, 2022), developer insights from 山东天之眼网络, and a complete game summary.",
    "Alt Text Image": "Official header image for 灵途 game - Steam 1841400",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u7075\\u9014\", \"description\": \"Looking for information on \\u7075\\u9014? Check out the release date (Jan 20, 2022), developer insights from \\u5c71\\u4e1c\\u5929\\u4e4b\\u773c\\u7f51\\u7edc, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u5c71\\u4e1c\\u5929\\u4e4b\\u773c\\u7f51\\u7edc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6210\\u90fd\\u5149\\u4e4b\\u65c5\\u9014\\u5de5\\u4f5c\\u5ba4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1841400/header.jpg?t=1642679990\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}