{
    "AppID": 1388700,
    "Name": "Gunderdome",
    "Release date": "Oct 19, 2020",
    "About the game": "Gunderdome is a fast pace survival FPS set in a Sci-Fi era. Players will be able to pick from three maps to play on. The aim of the game is to survive for as long as possible. As the game goes own for each bullet hit on an enemy and kill will increase you total points score. Earn as many points as you can in order to get number 1 on the leaderboard. Once the game begins players will start with an Assault Rifle and a Pistol. Attack the enemies as they follow and use the pick ups and weapon pads to your disposal. During your playthrough you are going to find three different pads which you can pick up. The first pad is a green health pad. This will heal you by 20HP. These can also be picked up at random from enemies killed. The second pad is a weapons pad. Shown in red with bullets rotating over this is the only way you can get weapons in the game. With no reloading and limited ammo in each weapon the only way to carry on is hit the weapon pad and whatever you receive use it to survive. The first enemy type you'll face is the standard enemy type. It'll chase you and deal 20hp damage per touch. The second enemy type is the explosive ball. This ball is fast and deadly dealing 30hp on impact, however it is very weak and easy to kill. The third enemy type is the slow down ball. This ball won't hurt you in HP but will reduce your speed, which could be the different between survival or not. The final enemy type is the turret ball. This is the tank of the enemies. The large ball has the slowest movement speed but has a turret which will shoot at you from long range. When you kill the enemies there is a chance you could be rewarded with a pick up item. The first pick item is a health item. As well as the green pads on the map players have the chance to pick up an extra 20HP from an enemy they kill. The second pick up item is a Wolf. This Wolf AI will help you by attacking AI's for 30 seconds. The Wolf's attack will Insta kill all enemy types. Players can have a maximum of two Wolves on the map at a time. PC Controls: Arrows or WASD - Moving Left Mouse Click - Shoot Space - Jump Mouse - Menu Interactions &amp; Camera movement Alt+Enter - Toggle fullscreen Swap Weapons - Scroll Wheel Pause Game - ESC",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1388700/header.jpg?t=1603097780",
    "Price": 1.99,
    "Developers": "Foxydudestudios",
    "Publishers": "Foxydudestudios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1388700/ss_5497b8502b7512667d2bfbf65e181e9c4e8a5f32.1920x1080.jpg?t=1603097780,https://cdn.akamai.steamstatic.com/steam/apps/1388700/ss_5b63348f79f2dc64a778fdf9b4c4e552f14e309a.1920x1080.jpg?t=1603097780,https://cdn.akamai.steamstatic.com/steam/apps/1388700/ss_32e758d901e5123d17c17e09ee09f9806d238174.1920x1080.jpg?t=1603097780,https://cdn.akamai.steamstatic.com/steam/apps/1388700/ss_efde199c79b0847f6bc4daae06e09e8b894e0ef7.1920x1080.jpg?t=1603097780,https://cdn.akamai.steamstatic.com/steam/apps/1388700/ss_71428ba1dd299ae8f36a7833e4819c1c8f14c32c.1920x1080.jpg?t=1603097780,https://cdn.akamai.steamstatic.com/steam/apps/1388700/ss_402b9a65a28dbce6ff29cc441b9d58ecefcfbc7c.1920x1080.jpg?t=1603097780",
    "Slug": "gunderdome",
    "Meta Title": "Gunderdome: Oct 19, 2020, Foxydudestudios and Full Overview",
    "Meta Description": "Looking for information on Gunderdome? Check out the release date (Oct 19, 2020), developer insights from Foxydudestudios, and a complete game summary.",
    "Alt Text Image": "Official header image for Gunderdome game - Steam 1388700",
    "Canonical URL": "https://gusku.site/game/gunderdome",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gunderdome\", \"description\": \"Looking for information on Gunderdome? Check out the release date (Oct 19, 2020), developer insights from Foxydudestudios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 19, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Foxydudestudios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Foxydudestudios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1388700/header.jpg?t=1603097780\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}