{
    "AppID": 1325730,
    "Name": "Keysight",
    "Release date": "Jun 30, 2020",
    "About the game": "'Keysight' is an Unreal Engine powered real-time MIDI visualization platform aimed at piano-focused video creators and streamers. It aims to provide the most comprehensive, configurable and feature-rich set of visualization options in a single piece of software. Please be aware that this program is purely a visualizer for content creation, and does not produce sound. Keysight is not a virtual instrument or learning tool. Features Render-to-video Export your MIDI files to perfect quality .MP4 video files. Supports audio file down-mixing, branding image overlays, resolutions up to 4kUHD, and framerates up to 120 FPS. Customization Configure everything down to the finest detail and make your own truly unique visual style, complete with custom image support. No effect is mandatory; add some simple glowing edges to your midi roll or go wild with hue-shifting backgrounds, millions of particles, GIFs and light bars. Augmented reality Keysight is fully 3D and accurately modelled. Freely position the camera and enable semi-transparency to achieve 'magic piano' style AR visuals; no image-based 3D warps necessary. Remote control Use websocket connections to remotely automate preset changes, camera angle switches, or a number of other actions. Take live-stream chat interaction to another level with chat-controlled visualization. (Requires implementation on the part of the user. See Steam guides.) Randomizer Generate new visual styles in a single button press with the randomizer. Tune the generation to your needs with 96 configurable chance branches and the ability to re-roll specific effects within a preset. Simulation Bring out every detail in your music with rich simulation. Every effect can be altered in intensity with note velocity, particles can be blown around by note activity, and all three pedals contribute to activity calculation. A note from the developer Hello! My name is Jack (although I typically go by Egglyberts) and I'm the sole developer for Keysight. Back in June 2019 I began playing with MIDI integration in Unreal Engine 4. Keysight development began in earnest in January 2020 on the request of a few streamer friends, and it released on Steam on June 30th that same year. While originally targeted at streaming, Keysight has now grown into a powerful, flexible MIDI visualization tool that can serve many purposes... But I'm not finished yet! This is not 'early access' software, nor a subscription; you buy it and it's yours to do whatever you want with, forever. Nevertheless, Keysight is not in its final form and both the menu and features will continue to evolve as time goes on. If you have ideas or requests, I'd love to hear from you in the Community forums or over in the Official Discord! Oh, and if you're interested, give the demo a go! The only demo restriction is that 50% of note-on events are dropped at random; all features are present and anything created in the demo carries over into the full version.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1325730/header.jpg?t=1657110319",
    "Price": 29.99,
    "Developers": "Jack Sweet",
    "Publishers": "Jack Sweet",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1325730/ss_22cde665cb965685841aef0eb21fbbeff10fc717.1920x1080.jpg?t=1657110319,https://cdn.akamai.steamstatic.com/steam/apps/1325730/ss_1e1e2b0ea9cd7d93d33e50651acea674ff011a8e.1920x1080.jpg?t=1657110319,https://cdn.akamai.steamstatic.com/steam/apps/1325730/ss_c1cd16ca0e7bf45da9bc5e2e167ff07e8fda5d1f.1920x1080.jpg?t=1657110319,https://cdn.akamai.steamstatic.com/steam/apps/1325730/ss_050eed77c20caa5065a46c54e86341cc2208a7c9.1920x1080.jpg?t=1657110319,https://cdn.akamai.steamstatic.com/steam/apps/1325730/ss_68b7a52de61261a30936a4a3e16d2bbf25f0d382.1920x1080.jpg?t=1657110319,https://cdn.akamai.steamstatic.com/steam/apps/1325730/ss_988d9ec50d5bceb2681f24f211c754e1232f004b.1920x1080.jpg?t=1657110319,https://cdn.akamai.steamstatic.com/steam/apps/1325730/ss_1618ad77540c0235389cf5277721d496cd280035.1920x1080.jpg?t=1657110319",
    "Slug": "keysight",
    "Meta Title": "Keysight: Jun 30, 2020, Jack Sweet and Full Overview",
    "Meta Description": "Looking for information on Keysight? Check out the release date (Jun 30, 2020), developer insights from Jack Sweet, and a complete game summary.",
    "Alt Text Image": "Official header image for Keysight game - Steam 1325730",
    "Canonical URL": "https://gusku.site/game/keysight",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Keysight\", \"description\": \"Looking for information on Keysight? Check out the release date (Jun 30, 2020), developer insights from Jack Sweet, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jack Sweet\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jack Sweet\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1325730/header.jpg?t=1657110319\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}