{
    "AppID": 1506610,
    "Name": "King's Cup: The online multiplayer drinking game",
    "Release date": "Jan 16, 2021",
    "About the game": "King's Cup is a drinking game played online with friends. A player pulls a card from the card circle and places it on top of the cup in the center face side up. Based on the card that player or all players must take an action, usually leading to one or more people taking a drink. It is recommended to have 3 or more players before starting the game and to use a VoIP chatting service like Discord. Controls: Thumbs up: Right Click or Space Heaven: W or Up-arrow Date: Left click the heart next to another player's name Drag a card: Left click and hold, move your mouse to move the card. (You can only drag card when it is your turn) Flip a card: Drag it over the cup, release left click and it will flip (You can only flip a card when it is your turn) Rename your player: Click your name, then type the new name you would like. Press enter when finished. Rules for cards The default rules are listed below. You can also create your own rules and change the text and minigames started by each card. Ace - Waterfall, everyone begins chugging at the same time. Players can only stop drinking when the person in front of them stops, the first person to stop is the person who pulled the card. 2 - You, choose someone to drink 3 - Me, the person who pulled the card drinks 4 - Whores, all the girls drink 5 - Thumbmaster, the person who pulled this card is the Thumbmaster. At any point, the Thumbmaster can thumbs up (right click). This starts a mini-game where all other players must thumbs up (right click). The last person who hasn't thumbs-upped has to drink. The Thumbmaster can do this at any point during the game (until someone else is the Thumbmaster). 6 - Dicks, the guys drink 7 - Heaven, everyone must point up (press W or the up-arrow) as fast as possible. The last person remaining who hasn't pointed up has to drink. 8 - Date, the person who pulled the card chooses a date. If either person in this date has to drink, both must drink. Some players allow only one couple at a time, some allow multiple couples and/or a person to be in 2+ couples at a time. This is up to the players in the game. 9 - Rhyme, the person who pulled the card says a word. Going in order, everyone must rhyme with this word. If everyone rhymes, the rhyme keeps going in order from the top of the player list until someone cannot rhyme. This person drinks and the game resumes. Duplicate words are not allowed. 10 - Categories, person who pulled the card says a category (e.g. car manufacturers). Everyone must name something in this category (e.g. Ford, Chevy), starting with the person who pulled the card and going in order according to the player list. This continues until someone cannot name something in the category (no duplicates). That person drinks and the game resumes. J - Rule, the person who pulled the card creates a new rule everyone must follow. For example, 'everyone must speak in a German accent'. Some players allow multiple rules, some only keep one rule at a time. This is up to the players. Q - Questionmaster, anyone who answers (or responds to) a question asked by the Questionmaster must drink. The Questionmaster should try to trick players by occasionally asking questions like 'Whose turn is it?'. Only one Questionmaster exists at a time. K - King, when the 1st, 2nd and 3rd King is pulled that person takes a drink. When the 4th and final King is pulled, that person is crowned King and must take a ceremonial shot. The game typically ends here, but if you want to keep going until no cards remain you can.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1506610/header.jpg?t=1612749964",
    "Price": 0.99,
    "Developers": "Lin Meyer",
    "Publishers": "Lin Meyer",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1506610/ss_98f393d497db15e5eb8608afea6ba5edea99122a.1920x1080.jpg?t=1612749964,https://cdn.akamai.steamstatic.com/steam/apps/1506610/ss_1c8cbf93221f672de074941589d824a769180ec0.1920x1080.jpg?t=1612749964,https://cdn.akamai.steamstatic.com/steam/apps/1506610/ss_a752b90ed0990f31d54d88825d28d0e7873f166e.1920x1080.jpg?t=1612749964,https://cdn.akamai.steamstatic.com/steam/apps/1506610/ss_23e92b4455b8c82fb57b9843a5f33f4b7e6ccb75.1920x1080.jpg?t=1612749964,https://cdn.akamai.steamstatic.com/steam/apps/1506610/ss_1306335fc7eaaba8e6c9bee230c936cd28b9c62b.1920x1080.jpg?t=1612749964",
    "Slug": "king-s-cup-the-online-multiplayer-drinking-game",
    "Meta Title": "King's Cup: The online multiplayer drinking game: Jan 16,...",
    "Meta Description": "Looking for information on King's Cup: The online multiplayer drinking game? Check out the release date (Jan 16, 2021), developer insights from Lin Meye...",
    "Alt Text Image": "Official header image for King's Cup: The online multiplayer drinking game game - Steam 1506610",
    "Canonical URL": "https://gusku.site/game/king-s-cup-the-online-multiplayer-drinking-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"King's Cup: The online multiplayer drinking game\", \"description\": \"Looking for information on King's Cup: The online multiplayer drinking game? Check out the release date (Jan 16, 2021), developer insights from Lin Meye...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lin Meyer\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lin Meyer\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1506610/header.jpg?t=1612749964\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}