{
    "AppID": 1301210,
    "Name": "Knockout City™",
    "Release date": "May 21, 2021",
    "About the game": "Knockout City is now Free-to-Play, inviting brawlers everywhere to experience the frantic, non-stop action of dodgebrawl. Team up and duke it out with rival Crews in Knockout City**, where you settle the score with epic dodgeball battles. Brace yourself for outrageous fun and intense competition in an all-new take on team-based multiplayer games. Customize your character and form a Crew with friends to start your Knockout City takeover. Knock out opponents with trick shots and coordinated teamwork while dodging and catching balls flying across the map. No ball? No problem! You can literally ball up, roll into a teammate’s hands and become the ultimate weapon. A variety of outlandish ball types, locations and game modes keep it exciting. Plus, each season introduces new maps, ball types, rewards, events and challenges. Throw, catch, pass, dodge and tackle your way to dodgeball dominance. KEY FEATURES Frantic and Fun — Rule the city through lightning-fast multiplayer matches featuring mind-blowing dodgeball mechanics. Increase your attack by passing to power up dodgeballs, targeting your opponents with a variety of specialized balls or “balling up” at any time to get thrown by teammates. Crew Up — Assemble an all-star dodgeball Crew with your friends for multiplayer matches in a seamless cross-play experience. Together, knock out opponents in 3v3, 4v4 or free-for-all matches. Pass, throw and strategize as a team to dominate and unlock distinctive, Crew-only rewards. Define Your Style — Show off your status and unique look through character and Crew designs with expansive character creation options. Customize your appearance, gear and attitude — from body type and hairstyle to a custom glider and Crew vehicle to win, lose and taunt animations. Take On Knockout City — Battle it out with other Crews across dynamic maps all over the city. Each map’s special features make every match an intense, unexpected experience. Dodgeball thrives in back alleys with pneumatic tubes, on skyscraper rooftops, across busy streets and even at the local burger joint and construction sites. While you’re dodging dodgeballs, watch out for moving cars, rooftop drops, and even a wrecking ball or two. Strikingly Fresh Yet Familiar — It’s easy to pick up and play thanks to familiar controls, but practice is key to becoming a champion. On a level playing field, only the most skilled ballers stand out from the crowd. Use your knowledge to master the intricacies of the game for spectacular KOs. KEY FEATURES Frantic and Fun — Rule the city through lightning-fast multiplayer matches featuring mind-blowing dodgeball mechanics. Increase your attack by passing to power up dodgeballs, targeting your opponents with a variety of specialized balls or “balling up” at any time to get thrown by teammates. Crew Up — Assemble an all-star dodgeball Crew with your friends for multiplayer matches in a seamless cross-play experience. Together, knock out opponents in 3v3, 4v4 or free-for-all matches. Pass, throw and strategize as a team to dominate and unlock distinctive, Crew-only rewards. Define Your Style — Show off your status and unique look through character and Crew designs with expansive character creation options. Customize your appearance, gear and attitude — from body type and hairstyle to a custom glider and Crew vehicle to win, lose and taunt animations. Take On Knockout City — Battle it out with other Crews across dynamic maps all over the city. Each map’s special features make every match an intense, unexpected experience. Dodgeball thrives in back alleys with pneumatic tubes, on skyscraper rooftops, across busy streets and even at the local burger joint and construction sites. While you’re dodging dodgeballs, watch out for moving cars, rooftop drops, and even a wrecking ball or two. Strikingly Fresh Yet Familiar — It’s easy to pick up and play thanks to familiar controls, but practice is key to becoming a champion. On a level playing field, only the most skilled ballers stand out from the crowd. Use your knowledge to master the intricacies of the game for spectacular KOs.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1301210/header.jpg?t=1658869031",
    "Price": 0.0,
    "Developers": "Velan Studios",
    "Publishers": "Velan Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1301210/ss_bbebae38169625f0878f1e768427ca83b2eb1bad.1920x1080.jpg?t=1658869031,https://cdn.akamai.steamstatic.com/steam/apps/1301210/ss_425a58367e030557f478e36620986ce7d15ddc07.1920x1080.jpg?t=1658869031,https://cdn.akamai.steamstatic.com/steam/apps/1301210/ss_ba32932400b1b3999f8188023aa5495b89048fea.1920x1080.jpg?t=1658869031,https://cdn.akamai.steamstatic.com/steam/apps/1301210/ss_187049e4460b9c83ccf42e5613cdc6d7ceaa89a2.1920x1080.jpg?t=1658869031,https://cdn.akamai.steamstatic.com/steam/apps/1301210/ss_68b6f71d53feca9d0322a829b9f406bb4e63186c.1920x1080.jpg?t=1658869031,https://cdn.akamai.steamstatic.com/steam/apps/1301210/ss_1fecf8e1abba4f279d41e2bb891209efe0ca7ae2.1920x1080.jpg?t=1658869031,https://cdn.akamai.steamstatic.com/steam/apps/1301210/ss_f01c2b28d4491096f39e9e789dd2b1fe34c237cf.1920x1080.jpg?t=1658869031",
    "Slug": "knockout-city",
    "Meta Title": "Knockout City™: May 21, 2021, Velan Studios and Full Over...",
    "Meta Description": "Looking for information on Knockout City™? Check out the release date (May 21, 2021), developer insights from Velan Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Knockout City™ game - Steam 1301210",
    "Canonical URL": "https://gusku.site/game/knockout-city",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Knockout City\\u2122\", \"description\": \"Looking for information on Knockout City\\u2122? Check out the release date (May 21, 2021), developer insights from Velan Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 21, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Velan Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Velan Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1301210/header.jpg?t=1658869031\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}