{
    "AppID": 1222250,
    "Name": "La Historia De",
    "Release date": "Feb 25, 2020",
    "About the game": "Have you ever wanted to play a tableboard rpg with your friends, but there was no way you could match? This game is for you. I want to do something different from the current systems. Make it easy and customizable. Quick to use and learn. And that allows the GM (Game Master, Master of the game) to create the world he wants. The main thing about the game is the immersion when playing. That, if GM creates some good maps and characters, you feel that you are in a Video Game. This is an application that serves as a board to play tableboard rpg. You will need at least one Game Master to play. You need to create your own content or use content from internet or Workshop. Check this guide: / The base game only contain one map and a few contents for the tutorial on that guide. If you have any problem with the game post it in the discussion forums or contact me.I will answer you as soon as possible. As a Game Master [/] If you are a GM. You will have to create your content and upload it to the workshop or share it with your players so they can join you correctly. I will be adding content in the workshop and as a free dlc for the game as well. It's very easy, you just have to create png files with the content you want with the right size and name them correctly. Once you have placed player tokens. Your players can now select them and join. As a master you are the one who puts everything on the map. You can: Check the tokens of all players. Put player cards, maps, npc, enemies, lights, decoration. Play music to everyone or independently with the floor tiles (players do not see them) Put light setting at all or independently with floor tiles (players do not see them) Put animated effects on the HUD, such as snow, rain, etc. at all or independently with floor tiles (Players do not see them) Speak like any of the players. Turn on the light of any tab. Create teleporters to, for example, enter a house. The players do not see them. Use them with imagination Save everything on the board for later use. [/] As a player [/] Move your file Roll dice as your token Use your torch Use your flashlight [/] These images are from the perspective of the master: This game has no text. So, you didnt need to understand english to play it. if its your first time playing, i recommend you to use the guide. Press the ? at the down left corner to open it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1222250/header.jpg?t=1583417201",
    "Price": 6.99,
    "Developers": "K26 Games",
    "Publishers": "K26 Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1222250/ss_1e3a8b591384557e435fc01487f2af708c798123.1920x1080.jpg?t=1583417201,https://cdn.akamai.steamstatic.com/steam/apps/1222250/ss_17b1c8a489234a7c3f552d21dc8166dc916d43aa.1920x1080.jpg?t=1583417201,https://cdn.akamai.steamstatic.com/steam/apps/1222250/ss_bde6644e15ee936560a80877d1c5f3b22fcd4542.1920x1080.jpg?t=1583417201,https://cdn.akamai.steamstatic.com/steam/apps/1222250/ss_b5cdbc2449b598961c70d41e188616c5d0afc231.1920x1080.jpg?t=1583417201,https://cdn.akamai.steamstatic.com/steam/apps/1222250/ss_1ba560b8c4b135046cfd083c2b0c662a84474410.1920x1080.jpg?t=1583417201,https://cdn.akamai.steamstatic.com/steam/apps/1222250/ss_b81101a265754078d1f550c27ed548faf1dccb28.1920x1080.jpg?t=1583417201,https://cdn.akamai.steamstatic.com/steam/apps/1222250/ss_74eaa25015225466dc9afb09e98880d0155c41bb.1920x1080.jpg?t=1583417201",
    "Slug": "la-historia-de",
    "Meta Title": "La Historia De: Feb 25, 2020, K26 Games and Full Overview",
    "Meta Description": "Looking for information on La Historia De? Check out the release date (Feb 25, 2020), developer insights from K26 Games, and a complete game summary.",
    "Alt Text Image": "Official header image for La Historia De game - Steam 1222250",
    "Canonical URL": "https://gusku.site/game/la-historia-de",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"La Historia De\", \"description\": \"Looking for information on La Historia De? Check out the release date (Feb 25, 2020), developer insights from K26 Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"K26 Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"K26 Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1222250/header.jpg?t=1583417201\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}