{
    "AppID": 1129730,
    "Name": "Lost Existence",
    "Release date": "Jan 7, 2021",
    "About the game": "Explore vast, forgotten lands, cryptic abandoned ruins, and mysterious caverns, in this open-world voxel action-RPG. Create your own uniquely crafted class. Build multiplayer dungeon, PvP, or siege experiences. Run, vault, and leap effortlessly across endless wilderness, or delve deep underground. Key features: - Choose Your Classes: Incinerate your enemies with Pyromancy, purify the undead with Piety's holy light, or eviscerate your enemies with the dual blades of Fury. Use any two in combination for special effects and synergies; the choice is yours! - Customize Your Abilities: With Lost Existence's unique 'Fusion' system, you can create a class flavor of your very own! Choose from two of three base classes, then combine and manipulate them, allowing hundreds of different character builds. When you need a change of pace, try a different setup for no cost at all! Whether you wish to imbue your swords with shadowflame, corrupt your holy spells with the power of rage, or simply empower your fireballs, there's a playstyle for everybody. - Custom Dungeons and Fortresses: Activate creative mode to fly and build wherever you wish. Use the powerful build tool system create anything from dungeons to castles with a few simple clicks. Add 'spawn points' or 'monster 'apocalypse' mode to challenge fellow adventurers. - Flawless Multiplayer: Play alone, or bring your Steam friends! Lost Existence has an extremely robust, richly customizable world engine, ready to support all of your adventures. Supports any number of players! (Additional configuration could be required). - Customizable Game Settings: Explore procedurally generated worlds inhabited by dangerous creatures, spirits, and otherworldly horrors. Choose your difficulty, and up to four combinable game-modes. For even more in-depth customization, tweak each and every setting for difficulty, spell power, drop rates, and world generation in the server settings. Each experience is unique! - Dynamic Soundtrack: Each zone is equipped with its own unique music set and ambience, adjusting on the fly to set the stage for your adventures. - Complete Control: Customize the in-game options to your preference, with completely adjustable keybinds, mouse and camera sensitivity, user interface settings. and more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1129730/header.jpg?t=1610045205",
    "Price": 0.0,
    "Developers": "Lurid Spectre Games",
    "Publishers": "Lurid Spectre Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1129730/ss_aa911852bfc6bae75135ff3fa97ae42772a98377.1920x1080.jpg?t=1610045205,https://cdn.akamai.steamstatic.com/steam/apps/1129730/ss_d227a2102f79b00c842f140aa9e3288f22ed8259.1920x1080.jpg?t=1610045205,https://cdn.akamai.steamstatic.com/steam/apps/1129730/ss_f2cca2fcbdfda1d8eb5657b1bc3df398c70b5a5f.1920x1080.jpg?t=1610045205,https://cdn.akamai.steamstatic.com/steam/apps/1129730/ss_52787fd6fd3d38761e964df64a2dba5e9282b43e.1920x1080.jpg?t=1610045205,https://cdn.akamai.steamstatic.com/steam/apps/1129730/ss_70670a7d7cca6acec52fcd654454e2325dde80ef.1920x1080.jpg?t=1610045205,https://cdn.akamai.steamstatic.com/steam/apps/1129730/ss_05ca9267d2f08e4b8d948684a993212b6f95ab22.1920x1080.jpg?t=1610045205",
    "Slug": "lost-existence",
    "Meta Title": "Lost Existence: Jan 7, 2021, Lurid Spectre Games and Full...",
    "Meta Description": "Looking for information on Lost Existence? Check out the release date (Jan 7, 2021), developer insights from Lurid Spectre Games, and a complete game su...",
    "Alt Text Image": "Official header image for Lost Existence game - Steam 1129730",
    "Canonical URL": "https://gusku.site/game/lost-existence",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lost Existence\", \"description\": \"Looking for information on Lost Existence? Check out the release date (Jan 7, 2021), developer insights from Lurid Spectre Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lurid Spectre Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lurid Spectre Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1129730/header.jpg?t=1610045205\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}