{
    "AppID": 1552240,
    "Name": "Lux, City of Secrets",
    "Release date": "May 6, 2021",
    "About the game": "Welcome to ​ Lux, City of Secrets ​,​ the third book in​ The Evertree Saga!​ It's time to make a name for yourself in the city of Lux. In this first half of a two-part epic, you will discover a vibrant and dynamic metropolis full of mysteries. Meet and mingle with characters old and new, uncover clues and solve cases, wield weapons and magic, and rise to the top before the city drags you under! Lux, City of Secrets ​ is a 500,000 word immersive interactive experience by Thom Baylay. It’s entirely text-based--without graphics or sound effects--and fueled by the vast unstoppable power of your imagination. The mayor of Lux believes someone is trying to kill him, and he has chosen you to save his life. But protecting the Luxican aristocracy is not your only priority. Will you be able to balance the responsibilities of life in the big city or will you be swallowed up by an unforgiving urban jungle? Will you prioritise your friends, your reputation, your career? In an open world where, more than ever, the choices you ignore matter as much as the ones you explore, you will need to choose carefully if you are to survive. Reunite with old friends and enemies, continue to build the relationships you started in​ Evertree Inn ​ and​ Sordwin​ , or abandon it all in pursuit of something new. It's time to find out if you have what it takes to uncover the mysteries of ​ Lux, City of Secrets! ​ • Continue a story started in Evertree Inn/Sordwin or play as a brand new adventurer. • Explore the city of Lux over several days: pursue a career, investigate chilling mysteries, or head out into the local wilds in search of adventure. • Customize your character’s experience, including five different houses and twenty different professions, each with their own stories to be discovered. • Build a reputation among the clergy, the Watch and the aristocracy; become a champion of the poor or pursue a life of crime. • Stick to a plan, or be constantly side-tracked by a myriad of mysteries. More than ever, the choices you ignore matter as much as the ones you explore! • Meet a cast of vibrant new characters, and reunite with acquaintances from past adventures. • Develop a romance from Evertree and Sordwin or seek new experiences in the Luxican taverns. • Play as male, female or non-binary. • Play as gay, straight, bisexual or asexual. Lux, City of Secrets ​​ is the first half of a two part adventure which will be concluded in ​ Lux, City of Lies. ​​",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1552240/header.jpg?t=1620308785",
    "Price": 6.99,
    "Developers": "Hosted Games",
    "Publishers": "Hosted Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1552240/ss_ecf4672ecf4742c8cd4b84e3c0bc4f21431ae164.1920x1080.jpg?t=1620308785,https://cdn.akamai.steamstatic.com/steam/apps/1552240/ss_94d10d305ff0482c9abdd00d5e2be234e99a4181.1920x1080.jpg?t=1620308785,https://cdn.akamai.steamstatic.com/steam/apps/1552240/ss_9fe5fa0dd820699c2be92c48212b86e53b387ee8.1920x1080.jpg?t=1620308785,https://cdn.akamai.steamstatic.com/steam/apps/1552240/ss_485d9dfe0ea3696c11b9888c29c27c0c77e53d0d.1920x1080.jpg?t=1620308785,https://cdn.akamai.steamstatic.com/steam/apps/1552240/ss_bd7daf3c7f7d0374a8793d77e06f0a33eb46647c.1920x1080.jpg?t=1620308785",
    "Slug": "lux-city-of-secrets",
    "Meta Title": "Lux, City of Secrets: May 6, 2021, Hosted Games and Full ...",
    "Meta Description": "Looking for information on Lux, City of Secrets? Check out the release date (May 6, 2021), developer insights from Hosted Games, and a complete game sum...",
    "Alt Text Image": "Official header image for Lux, City of Secrets game - Steam 1552240",
    "Canonical URL": "https://gusku.site/game/lux-city-of-secrets",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lux, City of Secrets\", \"description\": \"Looking for information on Lux, City of Secrets? Check out the release date (May 6, 2021), developer insights from Hosted Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 6, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hosted Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hosted Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1552240/header.jpg?t=1620308785\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}