{
    "AppID": 677480,
    "Name": "Outpost Zero",
    "Release date": "Jul 25, 2019",
    "About the game": "Outpost Zero blends the genres of Multiplayer Base Building Survival and Simulation games in a Sci-Fi universe. You and your robotic crewmates were sent to this planet for one purpose - to prepare a working habitat for the future waves of human colonists eager to escape the dying earth. Gaiya's untold natural resources are a juicy target for interstellar big business. Healthy competition among competing corporations drive the dangerous expeditions. Will you succeed in establishing a profitable foothold on this mysterious world, or will the perils of Gaiya and the ruthless corporations out to exploit her natural resources be too much for you to handle? Command. Colonize. Survive. Fight against a variety of native alien creatures, and defend your base against roving bands of pirates and enemy raiders. Attack rival players’ strongholds to destroy their operations and loot their resources. Craft upgraded weapons and armor, and lead AI squadmates into battle against your enemies. With skill and cunning, this hostile planet can be transformed into a thriving colony with a fully functioning society of AI robots. Setup mining outposts, harvest resources, create supply chains, and build a stable economy with automated factories to create essential goods for your survival. Create a base for safe refuge and infrastructure to keep your AI outfitted, healthy, and happy. Construct robots and train them to defend your outpost. Keep your Outpost running at peak efficiency by crafting gear and assigning jobs to your crewmates. Build them luxurious quarters and raise their morale by entertaining them and satisfying their needs. Lead them into battle, and set them up to defend your base from invaders. Build a society of happy, efficient, and powerful robot citizens. Contend with the threatening world of Gaiya as it continually tries to destroy everything you've built. Weather dangerous sandstorms, take shelter from meteor showers, survive deadly earthquakes, and cower before the might of an erupting volcano. Use your engineering skills to build a base that can withstand anything this dangerous planet can throw at it, from pirate raids to rampaging beasts, and keep yourself and your crewmates safe and sound in the sheltering walls of your outpost. As you evolve your colony from survival to dominate the local ecosystem, you will have access to higher tiers of items. A full RPG stat system gives you limitless possibilities in how you outfit yourself and your AI robots. Build railguns, powered armor, jetpacks, mining lasers, gliders, jump boots, shield generators, massive battery packs, and more as you augment your robotic frame to be the ultimate power on the planet. Create, train, and outfit expert weapon and armorsmith robots that can craft super-powered weaponry and gear for your forces. Then take the fight to the deadly creatures populating the most hostile areas of the world, and take down prehistoric monsters undreamed of on Earth, as well as rival Outposts and pirate hideouts swarming with unfriendly foes. Form a corporation and invite your friends to join, giving them all control of the robots and automated facilities in the base. Set other corporations to allied, neutral, or rival status, and wage war against them. Measure your corporation's worth on the server in leaderboards that indicate who is currently winning the economic war on Gaiya. Contend with anarchist space pirates intent on stealing your hard won natural resources, and fend off higher and higher level attacks as your outpost value skyrockets, weathering constant raids against you when you become the leading power on the server.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/677480/header.jpg?t=1588204205",
    "Price": 19.99,
    "Developers": "Symmetric Games",
    "Publishers": "tinyBuild",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/677480/ss_72a4001e92a06398b67a2eabf3d326a2e40561b7.1920x1080.jpg?t=1588204205,https://cdn.akamai.steamstatic.com/steam/apps/677480/ss_862f22c9776834a67caa561e58cc3eb7f9872e9e.1920x1080.jpg?t=1588204205,https://cdn.akamai.steamstatic.com/steam/apps/677480/ss_f441c5ba8eefa90e423a7959c0d9c6100f989d72.1920x1080.jpg?t=1588204205,https://cdn.akamai.steamstatic.com/steam/apps/677480/ss_f3edb59c71c2480cb9d0711c2df0c48427b4291a.1920x1080.jpg?t=1588204205,https://cdn.akamai.steamstatic.com/steam/apps/677480/ss_cb7ebd1b8a8bc5ecfcff166681298c03d36616dc.1920x1080.jpg?t=1588204205,https://cdn.akamai.steamstatic.com/steam/apps/677480/ss_e025595ac5c7d25f397fea4844829b43478e9a74.1920x1080.jpg?t=1588204205,https://cdn.akamai.steamstatic.com/steam/apps/677480/ss_f7defc48f733805c2efd15d1d07b35ae63bb9715.1920x1080.jpg?t=1588204205,https://cdn.akamai.steamstatic.com/steam/apps/677480/ss_ba6a423e84e0018b10613539994f7f3aff276a42.1920x1080.jpg?t=1588204205,https://cdn.akamai.steamstatic.com/steam/apps/677480/ss_be04f4b8ad21b7fd5c66ecea85effed218a43cd1.1920x1080.jpg?t=1588204205",
    "Slug": "outpost-zero",
    "Meta Title": "Outpost Zero: Jul 25, 2019, Symmetric Games and Full Over...",
    "Meta Description": "Looking for information on Outpost Zero? Check out the release date (Jul 25, 2019), developer insights from Symmetric Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Outpost Zero game - Steam 677480",
    "Canonical URL": "https://gusku.site/game/outpost-zero",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Outpost Zero\", \"description\": \"Looking for information on Outpost Zero? Check out the release date (Jul 25, 2019), developer insights from Symmetric Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 25, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Symmetric Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"tinyBuild\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/677480/header.jpg?t=1588204205\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}