{
    "AppID": 1949650,
    "Name": "OZ Chord Player",
    "Release date": "May 2, 2022",
    "About the game": "OZ Chord Player is a very simple tool for playing chords. When composing with Computer Music, you can easily find and try chords that match your melody. You can easily check the sound of chords with OZ Chord Player even if you don't have an instrument. Main target Mainly useful for composing Computer Music. Those who want to try composing. Those who want to know the sounds that make up a chord. Those who are not good at finding chords that match their own melody. Those who want to easily check the chord progression without an instrument. Features Screen layout All the prepared chords are displayed on one screen. To play the chord, just press the button on the chord in front of you. This allows you to hear the sound of various chords without disturbing your inspiration. Piano keyboard When you play a chord, you can check which note is playing on the piano keyboard. This allows you to reflect the constituent notes of the chord in your own composition. Chord search By selecting a switch with a note name such as 'C' or 'D', all chords using that note will be focused. You can also search by combining multiple switches. By selecting the note name you are playing on the melody line, you can easily find the chord that matches that note. Diatonic chord search Focus on the major scale diatonic chord. You can easily find the best chord for the scale of your song. Sound source The instruments that can be used are 'piano', 'acoustic guitar', 'electric guitar', 'stringed instrument - fast', 'stringed instrument - slow', and 'brass instrument'. Arpeggio You can stagger the individual notes of the chords. Ideal for slow tempo songs, mainly on piano and guitar. Chord playing style There are two types of chord styles to play, 'standard' and 'guitar', and you can switch between them. In 'Standard', 3 types of chords with different octaves are prepared for each chord. In 'Guitar', 3 to 5 types of chords with different ways of playing guitar chords are prepared for each chord. Play chords You can play by arranging multiple chords side by side on the timeline. This makes it easy to check the chord progression. When playing, you can set the tempo and time signature (2/4 to 5/4 time signature). Save/Load Chords placed side by side on the timeline can be saved. Export MIDI File The chords placed side by side on the timeline can be exported as a MIDI file. (Volume settings and arpeggios are not reflected.) User's Guide The operation method is displayed at the bottom of the tool screen and you will not be confused about the operation. The operation method is displayed by moving the mouse cursor to the part you want to know. Change screen size You can change the screen size of OZ Chord Player. The minimum resolution that can be set is 848 * 600. The maximum resolution that can be set is limited so that it does not exceed the resolution of the monitor you are using. The default screen resolution is 1130 * 800. If the resolution is smaller than the default setting, the image will be slightly degraded. Key Bindings Key binding is possible.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1949650/header_alt_assets_3.jpg?t=1658549126",
    "Price": 6.99,
    "Developers": "ChuckDoo",
    "Publishers": "ChuckDoo",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1949650/ss_744a25eca8c834a1964a0d467b2e61a21a1cfbdb.1920x1080.jpg?t=1658549126,https://cdn.akamai.steamstatic.com/steam/apps/1949650/ss_b07ac2448f3a75d33a676ed2712b76ed3e4c8a1b.1920x1080.jpg?t=1658549126,https://cdn.akamai.steamstatic.com/steam/apps/1949650/ss_b8dbba61ed52c2ac0bf9cae1db785df42dfa9406.1920x1080.jpg?t=1658549126,https://cdn.akamai.steamstatic.com/steam/apps/1949650/ss_d37ab105fb6b937f0e1f88df967890a5bcbdcb55.1920x1080.jpg?t=1658549126,https://cdn.akamai.steamstatic.com/steam/apps/1949650/ss_e34be3fb812f85da02a28298dc6b35d4b5d52fdc.1920x1080.jpg?t=1658549126,https://cdn.akamai.steamstatic.com/steam/apps/1949650/ss_4ac0306392e75471acc4f6e06ac07548dec8d534.1920x1080.jpg?t=1658549126,https://cdn.akamai.steamstatic.com/steam/apps/1949650/ss_d7cf86f4552bd97703a074e1fa1b14212b215b79.1920x1080.jpg?t=1658549126",
    "Slug": "oz-chord-player",
    "Meta Title": "OZ Chord Player: May 2, 2022, ChuckDoo and Full Overview",
    "Meta Description": "Looking for information on OZ Chord Player? Check out the release date (May 2, 2022), developer insights from ChuckDoo, and a complete game summary.",
    "Alt Text Image": "Official header image for OZ Chord Player game - Steam 1949650",
    "Canonical URL": "https://gusku.site/game/oz-chord-player",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"OZ Chord Player\", \"description\": \"Looking for information on OZ Chord Player? Check out the release date (May 2, 2022), developer insights from ChuckDoo, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"ChuckDoo\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ChuckDoo\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1949650/header_alt_assets_3.jpg?t=1658549126\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}