{
    "AppID": 797040,
    "Name": "Reboant - Endless Dawn",
    "Release date": "Apr 13, 2018",
    "About the game": "Summary : Reboant: Endless dawn is a first person shooting game set in a futuristic star war background. In the near future, human start to step into Stellar Civilization out of Solar, during when interstellar migration of one ancient race drift onto the earth and persuade government into carrying out an interstellar expedition. Thereupon, a mercenary army with complicated backgrounds land on the distant unknown planet, holding a secret mission. And you are one of them! About this game: Based on a long historical Sci-fi theme, this game aims to provide you a real immersive alien planet adventure experience by its cinematic art performance, global leading full IK technology, creative gameplay, etc. Background story introduction: As one teammate of Blunt Nail Army under the mysterious organization Adenous, player starts to explore the unknown planet Nuhort by following Captain Sarge and gradually involve into the complicated battles among native habitants and their highly civilized colonist Talos race. From rounds of battles and exploration, player not only be able to appreciate the alien creatures, mysterious alien civilizations, astonished intestellar spectacles, he also come to find out his deliberately sealed true life story, discover this big army schemes behind this adventure and discern the extensive connections between this mysterious race and human civilization. Along with plots going on, more civilization races connected with human history begin to debut in player's journey with hidden trace of acient war scars. And then new chapter for a war just unfold..... Features: - AAA standard graphics - Creative gameplay especially designed for VR - Advanced interactions and physical reactions - Full arm IK - Fascinationg story plots - Venture with your crew - HTC Vive / Oculus fully supported About Early Access: What's to be expected afterwards: - Full content of 'Endless Dawn' - Stability improvement - Performance optimization - Achievement system - More languages supported - Difficulty - Player data adaption Content update plan: 1) Following contents will be added in the interim version: · Double levels and more undisclosed interactive experience · Snipper mode can be activated on rifles to blast enemies' head together with 2 to 3 new weapons · Fight together with upgraded AI teammated against tough monsters during which battle strategies are highly required. 2）Following contents will be added in the comprehensive completed version: · Prior to current and interim versions, new game levels and narrative plots will take you 3 to 4 hours to win one round · More interaction with environment: mechanical arms can be used to drag down large stones to smash enemies, remove their shields, destroy barriers and so on. · You'll finally face with the BOSS which has appeared in previous levels and the unprecedented VR BOSS fight which is only presented in AAA masterpiece will be waiting for you",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/797040/header.jpg?t=1529742711",
    "Price": 1.99,
    "Developers": "Darklord Ltd., China",
    "Publishers": "Darklord Ltd., China",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/797040/ss_2933a97c6c920d5a1302fc66b6a32a373e4dd570.1920x1080.jpg?t=1529742711,https://cdn.akamai.steamstatic.com/steam/apps/797040/ss_e03d47cf38df2d478222c88318d9910dcb2819e0.1920x1080.jpg?t=1529742711,https://cdn.akamai.steamstatic.com/steam/apps/797040/ss_d74b85c03bdd838201c913a585b4bcbb5aa6ab17.1920x1080.jpg?t=1529742711,https://cdn.akamai.steamstatic.com/steam/apps/797040/ss_b52c54dd497ef0daccd9fa1fbe18fac23a134fa5.1920x1080.jpg?t=1529742711,https://cdn.akamai.steamstatic.com/steam/apps/797040/ss_c351e736675e2ae2537c73fa7ee0e52f615bd7a6.1920x1080.jpg?t=1529742711",
    "Slug": "reboant-endless-dawn",
    "Meta Title": "Reboant - Endless Dawn: Apr 13, 2018, Darklord Ltd., Chin...",
    "Meta Description": "Looking for information on Reboant - Endless Dawn? Check out the release date (Apr 13, 2018), developer insights from Darklord Ltd., China, and a comple...",
    "Alt Text Image": "Official header image for Reboant - Endless Dawn game - Steam 797040",
    "Canonical URL": "https://gusku.site/game/reboant-endless-dawn",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Reboant - Endless Dawn\", \"description\": \"Looking for information on Reboant - Endless Dawn? Check out the release date (Apr 13, 2018), developer insights from Darklord Ltd., China, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Darklord Ltd., China\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Darklord Ltd., China\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/797040/header.jpg?t=1529742711\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}