{
    "AppID": 911680,
    "Name": "REZ PLZ",
    "Release date": "Jul 15, 2020",
    "About the game": "Human Sacrifices, Very Poor Magic and More! Join apprentice wizard brothers Arcan and Zeph as they fight the forces of Dark Arcanum armed with little more than the Resurrection Scroll, a tool they can use to bring each other back to life. While traversing through platforming challenges and solving puzzles, you will encounter dangerous monsters and traps that require you to KILL one of the brothers in order to advance. But thanks to the magical scroll, you can resurrect the brothers from a multitude of one-hit deaths, ranging from being sliced in half, eaten by creatures, burned alive and more. While progressing through the game, you will unlock new spells that grant abilities to conquer the increasingly difficult challenges ahead. As you progress, you will unlock new spells that grant diverse abilities to conquer the increasingly difficult challenges ahead. Be careful because these brothers are poor at magic and one bad spell can mean death! FEATURES Co-op Play REZ PLZ puts a unique spin on the traditional co-op concept. Instead of trying to keep each player alive through each level, you must strategically kill each other to solve puzzles and defeat enemies. Use the Resurrection Scroll to bring Arcan and Zeph back to life. Death Around Every Corner Death is everywhere in REZ PLZ, and can come from a multitude of one-hit deaths, ranging from being sliced in half, eaten by creatures, burned alive and more. Unlock Magical Spells Unlock new spells to conquer the increasingly difficult challenges ahead, but be careful because these brothers are poor at magic and one bad spell can mean death! Unlockables Explore and find a bevy of unlockable cosmetic items and unlockable challenging gauntlet levels to customize your gameplay. Challenge yourself further with bonus modes such as PVP foot race. Story REZ PLZ tells the story of Arcan and Zeph, two young apprentice wizards. When their school is overrun by evil forces, the duo has to work together to defeat the evil wizards of Dark Arcanum. The catch: They’re both terrible at magic. Although Arcan and Zeph learn spells along the way, their progress is slow. When they die, the Resurrection Scroll brings them back to life.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/911680/header.jpg?t=1628613404",
    "Price": 14.99,
    "Developers": "Long Neck Games",
    "Publishers": "Graffiti Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/911680/ss_37155ecbf2d25537a58438363b0f9f50281372e2.1920x1080.jpg?t=1628613404,https://cdn.akamai.steamstatic.com/steam/apps/911680/ss_eced30c36af1550d8d28bb718e8394a5703c34ea.1920x1080.jpg?t=1628613404,https://cdn.akamai.steamstatic.com/steam/apps/911680/ss_b077cd9c9c9abbe2d3411c5bf9403cea2ef2bc41.1920x1080.jpg?t=1628613404,https://cdn.akamai.steamstatic.com/steam/apps/911680/ss_a30d4a00ee64b390c7c9e581c1c2502d57ac4514.1920x1080.jpg?t=1628613404,https://cdn.akamai.steamstatic.com/steam/apps/911680/ss_7ba7ebab7ece617be319f6709e5280b6d25a921c.1920x1080.jpg?t=1628613404,https://cdn.akamai.steamstatic.com/steam/apps/911680/ss_871aa4bf42f4f5331e0a3cb93f26ddb0f5a2d931.1920x1080.jpg?t=1628613404,https://cdn.akamai.steamstatic.com/steam/apps/911680/ss_b84c520bec098b3879fbb133881f75a12af5d7d2.1920x1080.jpg?t=1628613404",
    "Slug": "rez-plz",
    "Meta Title": "REZ PLZ: Jul 15, 2020, Long Neck Games and Full Overview",
    "Meta Description": "Looking for information on REZ PLZ? Check out the release date (Jul 15, 2020), developer insights from Long Neck Games, and a complete game summary.",
    "Alt Text Image": "Official header image for REZ PLZ game - Steam 911680",
    "Canonical URL": "https://gusku.site/game/rez-plz",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"REZ PLZ\", \"description\": \"Looking for information on REZ PLZ? Check out the release date (Jul 15, 2020), developer insights from Long Neck Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 15, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Long Neck Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Graffiti Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/911680/header.jpg?t=1628613404\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}