{
    "AppID": 1524650,
    "Name": "Sakura Forest Girls",
    "Release date": "Apr 19, 2021",
    "About the game": "Yaya, Aiyana, and Koko were childhood friends. Born in the same village, they spent their days in peace, and they vowed to always stay together. This all changed on one fateful night, however, when an army of strange monsters attacked their village. Families were scattered and, in the chaos, Yaya and Aiyana were parted from Koko. Three years later, on Yaya's twenty-first birthday, she and Aiyana vow to find the missing Koko. They leave their village and wander the dense forest that surrounds it, searching for a sign of their friend's whereabouts. After several months, their travels lead them to a mysterious witch, Maia, who claims to be all-powerful. Maia says she can help Yaya and Aiyana, but her help comes at a cost. Before Maia will consider lifting a finger for their sakes, she has Yaya and Aiyana prove their loyalty to her through a series of menial chores and embarrassing tasks. Yaya is prepared to endure any indignity to find Koko (even being used as a human chair) - but can she really trust Maia? Yaya is uncertain... But, as time wears on, she finds herself inexplicably drawn to Maia. Now, why could that be? Yaya is the main character of the story. Her parents were both hunters, and she prides herself on her skills with her spear. Cheerful and optimistic, Yaya is unfailingly certain that she'll find Koko again. She is fiercely protective of Aiyana, and will challenge anybody who dares make her uncomfortable - even a powerful witch like Maia. Aiyana is a shy, softly-spoken girl born to a family of shamans. Her hair is pure white, which is unusual in the village from where she hails. As a result of her strange looks, she was often bullied during her youth. Aiyana has no fighting prowess, and has a weak constitution. She tires easily, and often needs to rely on Yaya, to her embarrassment. She worries frequently about burdening Yaya, but Yaya is quick to reassure her. Unbeknownst to Aiyana, it is because of her steadfast support that Yaya is able to remain so eternally optimistic. Maia is a sneaky, devious witch of an indeterminable age. She speaks rarely of her past, and is shrouded in mystery, which makes her hard to trust. She is exceedingly powerful (or so she claims), and can accomplish truly impressive feats with her magic... But that is only if she feels like it. Maia loves flirting with cute girls more than anything, and she's very hands-on. She and Yaya often butt heads over this, and they can often be found bickering. Join Yaya and Aiyana on their journey to find their friend Koko in this lovely visual novel Small choices influence your ending",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1524650/header.jpg?t=1618922208",
    "Price": 9.99,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1524650/ss_6aa0e8c6c2250acc1042af51c7f4cbbc1b8cb40d.1920x1080.jpg?t=1618922208,https://cdn.akamai.steamstatic.com/steam/apps/1524650/ss_ceaed3fa5e7840f0abba599035891f3d2aade3be.1920x1080.jpg?t=1618922208,https://cdn.akamai.steamstatic.com/steam/apps/1524650/ss_627d67343e842cefd291ae8656214cee2a254708.1920x1080.jpg?t=1618922208,https://cdn.akamai.steamstatic.com/steam/apps/1524650/ss_018b4ed3312dc1b7b9e20ba991facb23f1297a93.1920x1080.jpg?t=1618922208,https://cdn.akamai.steamstatic.com/steam/apps/1524650/ss_9f7b3ff4186f413ac1901f8a4c7e41059706779d.1920x1080.jpg?t=1618922208,https://cdn.akamai.steamstatic.com/steam/apps/1524650/ss_dc98c795445ec53d61f12929fe8c89236cd388dc.1920x1080.jpg?t=1618922208,https://cdn.akamai.steamstatic.com/steam/apps/1524650/ss_ce8b0fff98ceea6d2039d84fcbe81e1501b7a337.1920x1080.jpg?t=1618922208",
    "Slug": "sakura-forest-girls",
    "Meta Title": "Sakura Forest Girls: Apr 19, 2021, Winged Cloud and Full ...",
    "Meta Description": "Looking for information on Sakura Forest Girls? Check out the release date (Apr 19, 2021), developer insights from Winged Cloud, and a complete game sum...",
    "Alt Text Image": "Official header image for Sakura Forest Girls game - Steam 1524650",
    "Canonical URL": "https://gusku.site/game/sakura-forest-girls",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura Forest Girls\", \"description\": \"Looking for information on Sakura Forest Girls? Check out the release date (Apr 19, 2021), developer insights from Winged Cloud, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1524650/header.jpg?t=1618922208\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}