{
    "AppID": 1304510,
    "Name": "SCP: Nine-Tailed Fox",
    "Release date": "Feb 2, 2022",
    "About the game": "Experience the horrors of being the one supposed to be in control amidst seemingly unsalvagable chaos. You are a leader of Foxtrot Unit 1 'Nine-Tailed Fox', a highly trained force tasked with re-containing a multitude of terrifying anomalous monsters that have broken loose inside of a top-secret research facility. SCP: Nine-Tailed Fox is a free survival horror game, based on SCP - Containment Breach. The events of the game take place in a containment site of The SCP Foundation, a secret organization dedicated to containing and researching anomalous artifacts and entities referred to as SCPs that threaten the normalcy of the world. Whenever things go wrong a highly specialized Mobile Task Force is always at the ready to quickly and effortlessly restore order, but what if the scale of chaos exceeds anything ever seen before? Who am I? You're thrown into the boots of a Mobile Task Force commander. Equipped with military grade weaponry and specialized technology you and your squad must fight their way through what appears to be the worst containment breach to date. Re-contain the SCPs: There are numerous sentient and more often than not violent anomalies that have escaped their containment. You must contain them, but beware, you should also value their integrity, as they are very valuable to the Foundation and science as a whole! You should only fall back to force if absolutely necessary. Terminate the escapees: D-Class subjects are disposable personnel that strictly consists of death row inmates. Given the situation they can be expected to be potentially armed and violent. Considering their potential possession of Foundation intelligence, the hassle associated with dealing with them in any other way and their general worthlessness, they are supposed to be terminated on sight. Alternatively.. Team Deathmatch (MTF vs CI): The Chaos Insurgency is a group that used to belong to the Foundation but went A.W.O.L. not long after their creation. They also have a peculiar interest in anomalous objects and is looking towards taking advantage of the.. unfavorable situation one of the Foundation's biggest sites is currently facing. Might they even have something to do with all of this?.. Either fight for them or defend the facility against them! Waves (PvE Mode): A rare, aggressive strain of SCP-008 has infected a large sector of the facility! Grab a team of friends (or strangers) and fend off against waves of them together with a number of other anomalies that has gotten loose!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1304510/header.jpg?t=1656276590",
    "Price": 0.0,
    "Developers": "Third Subdivision Studios",
    "Publishers": "Third Subdivision Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1304510/ss_c40be32b6a0ebebf5dcd1119d4b6fa76fb8a0f19.1920x1080.jpg?t=1656276590,https://cdn.akamai.steamstatic.com/steam/apps/1304510/ss_d0aa12e07882bb0f8d81f589e0f5830ef3480be9.1920x1080.jpg?t=1656276590,https://cdn.akamai.steamstatic.com/steam/apps/1304510/ss_93a1e06fe7a37fdd9e3c4b9ab0bf3403be22878a.1920x1080.jpg?t=1656276590,https://cdn.akamai.steamstatic.com/steam/apps/1304510/ss_d59e0a088de8ba1e9432ffae8ee73b04b4830ba4.1920x1080.jpg?t=1656276590,https://cdn.akamai.steamstatic.com/steam/apps/1304510/ss_b1f5cf0989a319f4df8e23cc1df531fb5cf0eb13.1920x1080.jpg?t=1656276590,https://cdn.akamai.steamstatic.com/steam/apps/1304510/ss_0d458ef27b24dce8f9f060e0fa252cbd033d7215.1920x1080.jpg?t=1656276590,https://cdn.akamai.steamstatic.com/steam/apps/1304510/ss_d00f1937cfd98f2b6a6dcd3e4f0e42af4b2a09ee.1920x1080.jpg?t=1656276590,https://cdn.akamai.steamstatic.com/steam/apps/1304510/ss_88dec37c98758927c1c43de61369f98cae4cd281.1920x1080.jpg?t=1656276590,https://cdn.akamai.steamstatic.com/steam/apps/1304510/ss_6b452a58a593eef89937829c7cb7e5796d36fb7f.1920x1080.jpg?t=1656276590",
    "Slug": "scp-nine-tailed-fox",
    "Meta Title": "SCP: Nine-Tailed Fox: Feb 2, 2022, Third Subdivision Stud...",
    "Meta Description": "Looking for information on SCP: Nine-Tailed Fox? Check out the release date (Feb 2, 2022), developer insights from Third Subdivision Studios, and a comp...",
    "Alt Text Image": "Official header image for SCP: Nine-Tailed Fox game - Steam 1304510",
    "Canonical URL": "https://gusku.site/game/scp-nine-tailed-fox",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SCP: Nine-Tailed Fox\", \"description\": \"Looking for information on SCP: Nine-Tailed Fox? Check out the release date (Feb 2, 2022), developer insights from Third Subdivision Studios, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Third Subdivision Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Third Subdivision Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1304510/header.jpg?t=1656276590\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}