{
    "AppID": 1500760,
    "Name": "Scraplers",
    "Release date": "Feb 19, 2021",
    "About the game": "Humanity did not have time to develop technologies to conquer space before all the resources on the planet were exhausted. As a result, people were thrown back in development, and a struggle began for the ancient artifacts of the past and scarce remnants of resources. The game is a 2D hardcore top-down open world sandbox where you are on your own from the start and free to do whatever you want. The game is saved automatically, so anything that happens to you will be irreversible. The gameplay consists of traveling around the world in the form of a point on the global map and exploring a detailed map of the terrain on which the player controls his vehicle-crawler, giving orders to increase / decrease speed, turns, select a target for attack and interact with surrounding objects. During the journey, various events will take place with the player (an attack by pirates, cultists, monsters, a meeting with a trading caravan, a slave trader, ordinary travelers, getting into a sandstorm, and others), or the player can stop himself to explore the selected area in more detail to find loot in abandoned buildings, caves, mines, as well as for visiting cities for the purpose of repair, trade, hiring a crew, customizing a crawler or buying a new one. The battles take place in the form of an artillery firefight between the crawlers, and the player does not aim independently, but only gives an order at which point or enemy to fire, aiming and shooting occurs in automatic mode. Also in the game there is a mechanic of boarding and assault on crawlers and buildings, which is an auto-fight between the player's team and the enemy's team, so the outcome of the battle depends on how well your team is equipped. The player needs to monitor the state of his transport, the amount of fuel, the availability of guns, shells for it, as well as recruit new fighters to his team, buy weapons, equipment, provisions, medicines for them. Most of the events, maps, enemies, loot are procedurally randomly generated, but there is also a small chance of finding unique locations with special rewards. The game has a reputation system with factions, you can establish relations with one of the factions, but this may cause discontent in others. You choose with whom to be friends and with whom to quarrel.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1500760/header.jpg?t=1613754724",
    "Price": 1.99,
    "Developers": "Cryoshark",
    "Publishers": "Cryoshark",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1500760/ss_62ed74bee871ef0f4ee04d1cb3dffa22afb1b4c4.1920x1080.jpg?t=1613754724,https://cdn.akamai.steamstatic.com/steam/apps/1500760/ss_eab23006b8d21ea97e1146a082a7c8df14941270.1920x1080.jpg?t=1613754724,https://cdn.akamai.steamstatic.com/steam/apps/1500760/ss_c921090472bd4ac8ec67efed7ef57f58d7d671fc.1920x1080.jpg?t=1613754724,https://cdn.akamai.steamstatic.com/steam/apps/1500760/ss_53a8ff743475dd28782488c3285c9dda294239d5.1920x1080.jpg?t=1613754724,https://cdn.akamai.steamstatic.com/steam/apps/1500760/ss_411c32e574db72186ea3fbaecd9f324a212494a3.1920x1080.jpg?t=1613754724,https://cdn.akamai.steamstatic.com/steam/apps/1500760/ss_3ff34bb90032274d6747579a375ac42f78c3036a.1920x1080.jpg?t=1613754724",
    "Slug": "scraplers",
    "Meta Title": "Scraplers: Feb 19, 2021, Cryoshark and Full Overview",
    "Meta Description": "Looking for information on Scraplers? Check out the release date (Feb 19, 2021), developer insights from Cryoshark, and a complete game summary.",
    "Alt Text Image": "Official header image for Scraplers game - Steam 1500760",
    "Canonical URL": "https://gusku.site/game/scraplers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Scraplers\", \"description\": \"Looking for information on Scraplers? Check out the release date (Feb 19, 2021), developer insights from Cryoshark, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cryoshark\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cryoshark\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1500760/header.jpg?t=1613754724\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}