{
    "AppID": 882150,
    "Name": "Sky Link",
    "Release date": "Aug 16, 2019",
    "About the game": "Formerly known as Drone Strike Force, Sky Link is a groundbreaking aerial shooter that aims to be the fastest online game in existence. Skylink gives you unparalleled freedom as you control powerful UAVs such as the tank-like Megadon or the stealthy tactical Shade Z1 to defeat your opponents and win the day. Sky Link is designed to be easy to pick up and play, but difficult to master. Grapple, afterburn, and expertly maneuver your way across varied war-torn battlefields in a fight for the world’s most valuable resource - information. More than Just Fly and Gun… Introducing UPLOAD The main game mode in Skylink is UPLOAD - a tactical 3V3 competition where two teams fight to take a cache of sensitive data to specific upload zones within a given map. The attackers must either upload the entire package before the time runs out, or eliminate their opponents. Meanwhile, the defending team must destroy their attackers or prevent them from being able to get the upload to 100 percent. The first team to win the required number of rounds wins the day and the digital glory. With a renewed focus on aerial combat not yet seen in other games, Skylink pushes the boundaries of spatial awareness and high maneuverability with the sheer freedom of three-dimensional gameplay at your fingertips. Experience intense high-speed combat (up to 250 PMH!) seldom experienced in a game like this! Easy to learn, difficult to master movement mechanics such as: Air Grapple System (AGS) - Be a robotic Spider-Man in a dystopian battlefield! Punch your foes, swing across the cityscape, and steal the cache from the enemy. Instant Engine Cut Off - Got a bogey on your tail? Cut your engines, and lose ‘em fast. 360 Degree Warfare - Fights can happen literally anywhere in the map - above, behind, below. No space is safe. The New Weapons of Warfare With devastating tech at your disposal, you’ll have plenty of options when it comes to not only how you look, but what role and loadouts work best for your playstyle. Each tactical UAV has a role to play and its own set of weapons and skills to help their teams win the day. Tactical usage of various unique abilities allows you to push the limits of what each aircraft can do. There’s no shortage of interesting skills across our selection of aircraft. From a devastating remote-controlled missile to an electromagnetic pulse that pushes enemies into their surroundings, possibly exploding them on impact. There’s a plasma leash that can double both as a weapon and a repair beam, as well as a turret that can attach itself to any surface and create a deadly choke point between buildings. Each different craft has its own strengths and weaknesses - it’s up to you to find your preferred champion. Join the Community, Become an Ace! |",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/882150/header.jpg?t=1631197856",
    "Price": 19.99,
    "Developers": "Odisi Games",
    "Publishers": "Odisi Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/882150/ss_5df6551d3a9a7f16ce20b9e0af7e7c7f42e9a8d7.1920x1080.jpg?t=1631197856,https://cdn.akamai.steamstatic.com/steam/apps/882150/ss_70d4a2047681409b4058e66182d4c1abd31f8946.1920x1080.jpg?t=1631197856,https://cdn.akamai.steamstatic.com/steam/apps/882150/ss_c14a935a2d6d11aa39954640b3d63fcac9d26f8b.1920x1080.jpg?t=1631197856,https://cdn.akamai.steamstatic.com/steam/apps/882150/ss_8cd4cd554123aec5974eda9ecea2324a50213583.1920x1080.jpg?t=1631197856,https://cdn.akamai.steamstatic.com/steam/apps/882150/ss_6c9f557b3de425ef9d86afbe0dd64235331fd8bb.1920x1080.jpg?t=1631197856,https://cdn.akamai.steamstatic.com/steam/apps/882150/ss_d452269e69d7533fbbfe7b306eda5b467a39aaf6.1920x1080.jpg?t=1631197856,https://cdn.akamai.steamstatic.com/steam/apps/882150/ss_9288b7f76662879679baa202f74a4add3c0bf33e.1920x1080.jpg?t=1631197856,https://cdn.akamai.steamstatic.com/steam/apps/882150/ss_45dd04112438a98bfcc710dbef799c85b3f05b11.1920x1080.jpg?t=1631197856,https://cdn.akamai.steamstatic.com/steam/apps/882150/ss_f0e63898261975ab5ca1ce996e9c8258d9df6963.1920x1080.jpg?t=1631197856",
    "Slug": "sky-link",
    "Meta Title": "Sky Link: Aug 16, 2019, Odisi Games and Full Overview",
    "Meta Description": "Looking for information on Sky Link? Check out the release date (Aug 16, 2019), developer insights from Odisi Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Sky Link game - Steam 882150",
    "Canonical URL": "https://gusku.site/game/sky-link",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sky Link\", \"description\": \"Looking for information on Sky Link? Check out the release date (Aug 16, 2019), developer insights from Odisi Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 16, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Odisi Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Odisi Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/882150/header.jpg?t=1631197856\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}