{
    "AppID": 1571040,
    "Name": "恶搞赛车 湿身吧！ Splash To Wild Kids",
    "Release date": "Aug 10, 2021",
    "About the game": "Important note: This is only a very cheap game. Due to the limited development funds of one person, more player support is needed to continue to develop to the ideal state Please don't download it for friends who require high quality, it is not easy to develop, thank you! Let the beautiful girl get wet! ! ! Some game features: Fresh, unknown, challenging, interesting and spoofing Unprecedented game mode Vivid NPC interaction, featured background music Open game time and accurate scoring system Shocking and vivid game audio Game introduction: In real life, racing in rainy towns is very dangerous and not allowed No, no, no! You don't have to be blamed for worrying about splashing water from puddles on passers-by when you can feel the passion and speed in the rain. On the contrary, in 'Spoofing Racing', you can only get corresponding scores over others if you splash passion on passers-by! Starting from here, we can experience infinite stimulation and addictive pleasure. Feel the pleasure of wheels colliding with rain! Feel the passion of friction between SUV and town roads! Feel unfettered, drive BUS through town! Only here is the tranquility of the rainy day and the mania of the rainstorm. Show your super driving skills with the splash of the wheels and the extreme roads Novel play, brand-new mode, passionate waves, unrestrained racing! ! ! Game play: Choose your favorite vehicle to start a dynamic and exciting game Achieve the corresponding goals and unlock new vehicles and road scenes While avoiding passers-by and obstacles, we must also control the vehicles to run over the puddles in the road and splash them on NPC to get the corresponding game scores Rank by the scoring method in the game Avoid passers-by and obstacles in the road End the game with the player's vehicle colliding with obstacles or passers-by in the road Game features: Fresh, unknown, challenging, interesting and spoofing Unprecedented game mode Vivid NPC interaction, featured background music Open game time and accurate scoring system Shocking and vivid game audio Realistic weather MOD control system An easy-to-use operating system A clear score list A system that triggers interesting events of people Diversity of road scenes Clear and simple game mode All kinds of dazzling cars Different vehicles will bring different pleasures to Chengdu Cool game special effects Exquisite and cool dashboard Clear and humanized UI interface ? thrilling game operation And its dynamic game interaction Simple style, free choice, convenient and humanized interactive design. Simple and easy game experience. Message: This is an unprecedented and exciting experience of spoofing racing cars. You will overcome difficulties and become the elite in spoofing racing cars in the wonderful contest between the drops of water brought by speeding vehicles and passers-by. The noisy vehicles and people's revelry are all in 'Spoofing Car Splash To Wild Kids'! ! ! Developers use all the experience and technology they have learned to create innovative racing games, and more interesting features are being produced ... This is a simple and exciting racing game. In the game, players can experience an extremely exciting driving experience through simple operation. In the game, there are various exciting elements for you to experience. In the rain town, the water drops brought by the speeding vehicles compete with passers-by, and experience the pleasure of being a Xiong Haizi ~",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1571040/header.jpg?t=1628669565",
    "Price": 1.99,
    "Developers": "Super funny game",
    "Publishers": "Super funny game",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1571040/ss_4fdaac596bda810bf7578ad6f43626b0a577573b.1920x1080.jpg?t=1628669565,https://cdn.akamai.steamstatic.com/steam/apps/1571040/ss_3115fe08bef76a4a56c7fb306c79f4e86571b438.1920x1080.jpg?t=1628669565,https://cdn.akamai.steamstatic.com/steam/apps/1571040/ss_5b2c1737dbae30ddb96338fe566f8b53e04a69f5.1920x1080.jpg?t=1628669565,https://cdn.akamai.steamstatic.com/steam/apps/1571040/ss_aac353b1ba5bf21b9a136971373b8786f68d98d6.1920x1080.jpg?t=1628669565,https://cdn.akamai.steamstatic.com/steam/apps/1571040/ss_aea46c8ce53e5d666632749962076e76adc5adf5.1920x1080.jpg?t=1628669565,https://cdn.akamai.steamstatic.com/steam/apps/1571040/ss_363123554fe0e5962f323977b872f55c94e662e5.1920x1080.jpg?t=1628669565,https://cdn.akamai.steamstatic.com/steam/apps/1571040/ss_f2c4c73df8a2e6ad5c91c92fc3fcf1f7c3523542.1920x1080.jpg?t=1628669565",
    "Slug": "splash-to-wild-kids",
    "Meta Title": "恶搞赛车 湿身吧！ Splash To Wild Kids: Aug 10, 2021, Super funny ...",
    "Meta Description": "Looking for information on 恶搞赛车 湿身吧！ Splash To Wild Kids? Check out the release date (Aug 10, 2021), developer insights from Super funny game, and a com...",
    "Alt Text Image": "Official header image for 恶搞赛车 湿身吧！ Splash To Wild Kids game - Steam 1571040",
    "Canonical URL": "https://gusku.site/game/splash-to-wild-kids",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6076\\u641e\\u8d5b\\u8f66 \\u6e7f\\u8eab\\u5427\\uff01 Splash To Wild Kids\", \"description\": \"Looking for information on \\u6076\\u641e\\u8d5b\\u8f66 \\u6e7f\\u8eab\\u5427\\uff01 Splash To Wild Kids? Check out the release date (Aug 10, 2021), developer insights from Super funny game, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Super funny game\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Super funny game\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1571040/header.jpg?t=1628669565\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}