{
    "AppID": 1815230,
    "Name": "Summum Aeterna",
    "Release date": "Jun 16, 2022",
    "About the game": "Summum Aeterna, the prequel to Aeterna Noctis, is a Roguelite game that combines world crawler mechanics never seen before in the genre with a fast-paced combat system and a unique 2D art style. Taking the role of the King of Darkness, a mighty, powerful, and badass warlord condemned to eternal life, you'll explore uncharted territories populated with treasures, traps, hordes of enemies, and powerful bosses. Explore wild territories, descend into the most dangerous deeps of Aeterna, and fight your way to the end of each world... If you can! Classic Roguelite vibes The King of Darkness may be immortal... But he can still be defeated. You will start your adventure over and over again, that's how this kind of games works, right? Don't panic, even if you're defeated, you still keep some of the stuff and upgrades you earned the last time you lived... Some of them, at least. Summum Aeterna allows players to keep their progress, featuring a permanent character and world upgrade system. No matter how many times you’re defeated, your progression in the skill tree will be saved, as well as the world improvements you unlocked will last forever. Random worlds Summum Aeterna includes a unique world generator system never seen before in the genre, the Seed Mechanic... Each one generates a unique world with different enemy behaviour, special events, and even a larger map size, depending on the rarity and the genes contained in the germinated seed. The world modifiers, so-called “seed genes” are positive and negative attributes included in each seed you find. They will determine the dangers, encounters and rewards waiting for you once you start playing. Seeds create worlds and genes make each seed different from the last, and so will the worlds generated from them! Brutal fast-paced combat and frantic action The key to surviving in Summum Aeterna is killing every single living (or undead, depending on the enemy) being you encounter. How to achieve that? Well, you play as a cursed monarch… Your weapons are crafted for a king! Show no mercy, use your swords, pistols, and scythes to make them beg for their miserable lives before they do the same to you... You will choose a starting weapon at the beginning of each world, but you can switch it for a better one, whatever its type... It’s up to you and your skills! Summum Aeterna also includes weapon customization options thanks to the gems, precious stones that increase weapon attributes and add cool upgrades. Add new offensive and passive capabilities and improve the combat performance of your weapons by embedding gems. Rarity is a virtue Every weapon, seed, and gem you find in Summum Aeterna has a rarity level: Common, Uncommon, Rare, Epic, Legendary, Mythic, and Relic. The higher the rarity of an item, the more benefits it provides to the player. A weapon's rarity determines the number of gems that can be embedded in it, among other things such as damage level. Gems with higher rarity make higher upgrades to your tools of destruction. And as for the seeds… You guessed it, the less common it is, the greater rewards and dangers on the other side of the portal! Custom adventures In Summum Aeterna you can define your own adventure. Each world will give you lots of rewards, including new seeds and currencies to upgrade your character skills, unlock new weapons, make the ones you already have even more deadly, and, of course, improve the attributes of the world. You can unlock new special rooms, increase the rarity of the ítems you find, and alter the world conditions by the world upgrade menu. You can also modify the rarity of your current seeds by mutating their genes or recycling the ones you don't want to get a seed with a higher rarity... Everything is set up to make each adventure different from the last! Beautiful art style Each asset, enemy, NPC and animation has been hand-drawn using traditional 2D animation techniques... Everything you see in Summum Aeterna, from the smallest chest to the most colossal boss, is possible thanks to countless hours of hard drawing work. The visuals speak for themselves, the game looks amazing! Major Update 1 - 'Demons' Mother' July 2022 Challenge rooms Certain chambers in Summum Aeterna have a particular reward or mechanic. Idalith Shrines are rooms dedicated to the Mother of Demons and hide a special offering. You want it? Easy, you just need to defeat a random member of the Grim Horde, Idalith's minions, who guard these shrines and will exterminate any braves who desecrate the memory of their infernal lady. Valatuk, Lord of the Wars, Samnindas, Plage Beaber, and Ledasios, High Inquisitor, are the currently available acolytes, each one featuring a unique combat style. The Grim Horde will expand in future updates with more lethal members. There are also plans to include more types of challenge rooms. NPCs with unique mechanics The seed expert allows you to use his machines for germinating seeds and mutating genes, but there’re also other NPCs in Famished Town like the dummy and the seller wearing a hat. Dummytama is a being incapable of feeling pain, you can test all your weapons on it as long as they are unlocked. Show no mercy! Rasen Lupine is a merchant that trades items of dubious origin, allowing you to buy seeds of different types and levels quickly and safely. He uses runes as currency.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1815230/header.jpg?t=1658840381",
    "Price": 14.39,
    "Developers": "Aeternum Game Studios S.L",
    "Publishers": "Aeternum Game Studios S.L",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_eb0882542b8dcec5cd19e881e350e832fc6f1c33.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_9ccba79e87a858c77a13d5860cab7cdc6c3cf8b2.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_a4b315a8cd6d680a1347746a5886c2c84ad6ad1b.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_408c739edfce6e0779414373d66ffab6ce0e1f0f.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_f0461b7ed5bb410f71baf364df2653a599918b40.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_af1757c6fda421a6c0d7a6c1b8d5290bf3edee98.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_c48ab0e9b7de7a11ed3088c250b384fce764eda5.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_124b4fe226e624f0fda0b1d15ddc604d9b914b3b.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_89fdf3fbacc5ac55ac2c9c83e7ba07b19838f9c1.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_bbabf066ce09104213fae8a526096275060f96e9.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_dabf1dff2c06305f459f9acbd47a07df89771607.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_a19660b0ec6c8d4bf82bb814f37be2fdc6dff260.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_d64a8a8b23844fa9586c107c9112e327213bae55.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_34ead7e0f0ef89b937d926a16b75cfccc469373c.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_962077e900ad799dbde65f8f2e736683b856ad8a.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_226fcb4a22a7744f33510d8bdb1279c85cf1c3f6.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_9f42d31c65c0546ae35be8ba436abaa2ea978dcb.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_c3967280164b16684caa77c22b4e35e757b8a7d6.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_6a66c71d88867fc57f9f30fef9863ef3d866119a.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_1d9e1dcf56c33d82e0558943197407b4410dd38a.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_0414ee70d190f8f91fc5b7ffd6a84283bd52116c.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_c1430bd46f518057d8219c81536cfa160f5a0297.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_1eda5ac76c10a7ff22b2194bd14bb22682a458d2.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_a1d52eff32130ec196601d85676d4e9de2b6c4e0.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_8dc1de71974aa87ed09163a56dd45e0e2ec8c2c9.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_65f125d463f467eb87cb6266b4bf3501c04f4cc6.1920x1080.jpg?t=1658840381,https://cdn.akamai.steamstatic.com/steam/apps/1815230/ss_e9775f3553b22e2fb30c7f0ff4f9c9046e6276d2.1920x1080.jpg?t=1658840381",
    "Slug": "summum-aeterna",
    "Meta Title": "Summum Aeterna: Jun 16, 2022, Aeternum Game Studios S.L a...",
    "Meta Description": "Looking for information on Summum Aeterna? Check out the release date (Jun 16, 2022), developer insights from Aeternum Game Studios S.L, and a complete ...",
    "Alt Text Image": "Official header image for Summum Aeterna game - Steam 1815230",
    "Canonical URL": "https://gusku.site/game/summum-aeterna",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Summum Aeterna\", \"description\": \"Looking for information on Summum Aeterna? Check out the release date (Jun 16, 2022), developer insights from Aeternum Game Studios S.L, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aeternum Game Studios S.L\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aeternum Game Studios S.L\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1815230/header.jpg?t=1658840381\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}