{
    "AppID": 632100,
    "Name": "The Last Sigil",
    "Release date": "Mar 28, 2019",
    "About the game": "The Last Sigil is a roguelite action RPG. Create your guild, hire randomly generated characters with different traits, stats and skills, and enter the Sigils to vanquish an ancient evil and his army of monsters. Fight hordes of enemies in procedural generated dungeons, hunt for rare loot, find pets, trade and gamble with merchants, craft your own items and upgrade and enchant them using tools, magic scrolls and jewels. Distribute stat points and customize your guild through passive upgrades; earn exp and fame, level up, hire new members, become more powerful and reach the Last Sigil. SHORT DESCRIPTION - Procedurally generated exteriors and dungeons with different enemies, traps and bosses. - Three difficulties, normal, hard and very hard. - Randomly generated characters with different traits, statistics and skills and the possibility to rename them as you like. - Ten classes (fire mage, ice mage, blood witch, necromancer, cleric, paladin, amazon, ranger, berserker and juggernaut), each one with different combat abilities, a quick movement skill, an active block skill to mitigate the damage and a summonable banner which grants temporary buffs. - 50 levels, stats points to distribute between power, energy and vitality and upgrade points to spend in passive skills. - Items of different qualities, normal, magic, rare, epic and mythic (the latter with special effects), crafting materials, tools to upgrade and add sockets to your equipment, magic scrolls to enchant your items and craftable jewels to insert in sockets and further customize your equipment. - Trading, gambling, crafting and enchating. - Summonable banners which grant you temporary buffs. - Pets to bring with you and fight along your side. LONG DESCRIPTION DUNGEONS AND ENEMIES There are currently eight procedurally generated dungeons or Sigils, which you can enter through portals spawned in a procedurally generated world. Each dungeon is filled with different enemies, traps and bosses and consists of three levels and a boss room linked with portals. There are three types of enemies: - minions which are weak and easy to kill - elites which are tougher, stronger, with special passive bonuses and skills - bosses which you will encounter at the end of each dungeon All of them have got normal and special attacks, you can face-tank the normal ones, but you should try to avoid or block the latter, especially if you are fighting against elites and bosses or you are not playing at normal difficulty. On top of that, only few bosses are tank&amp;spank, most of them have got also particular mechanics which might kill you if you fail to counter them. DIFFICULTIES There are three difficulties, Normal, Hard and Very Hard, with the first one for beginner and the latter for experienced players; you have to complete the game at Normal to unlock Hard, and finish it at Hard to unlock Very Hard. Increasing the difficulty will increase your gold and magic find cap but it will also make the enemies stronger and tougher and you will have less time to avoid the enemies special attacks. TRAVELLING The exteriors and the dungeons are connected through exits, portals and waypoints; you can unlock the latter by clicking on them and they allow you to travel from a location to another in no time. In addition you can also teleport to the encampment (the town-hub) whenever you want, as long as you are out of combat, and you can use a portal to go back to your previous location. CHARACTERS The members of your guild are randomly generated, they have a rank, an expertise, a trait, four statistics (strength, endurance, constitution and luck) and a set of skills. You can't create the perfect character, you have to play with what the game offers you and do your best with it. At the beginning of the game and after every dungeon, you will be able to recruit new members and select one of them to play with. You can't change their passive abilities, nor their active skills, but you can increase some of their bonuses by killing the bosses inside the dungeons and staying alive..because when you die, you will lose the character you were playing with. If you have a change of mind and you no longer like a specific character that you have hired before, you can always kick him/her from the guild and hire a new one. You can also rename the members of your guild, maybe after some of your idols or your friends or your subscribers (if you are a streamer). CLASSES AND SKILLS Currently there are ten classes: fire mage, ice mage, blood witch, necromancer, cleric, paladin, amazon, ranger, berserker and juggernaut; each one with different combat abilities, a quick movement skill, an active block skill to mitigate the damage and a summonable banner which grants temporary buffs. There are many types of skills, ranged, melee, piercing projectiles, explosive projectiles, channelings, frontal AOE, 360° AOE, single target DOT, AOE DOT, summonings, etc. You can boost them with passive upgrades and you can add special effects too by using mythic items. LEVELS, STATISTICS AND UPGRADES By killing enemies you will earn experience and level up until level 50. You can reach the maximum level in every difficulty, so if you just want to relax and play only at Normal, you can stick to it all the way. Each level awards you some statistic points to distribute between power, energy and vitality which are in common among all the members of your guild and they are boosted from the statistics of the character you're currently using. You also gain one upgrade point, which you can spend to select and improve some passive abilities and if you have a change of mind you can reset everything for free. Each character has also got a statistic called luck, this bonus gives a chance to double your loot every time you kill an enemy or break/open a container; on top of that you can also stack magic and gold find through the bonuses of your equipment and the passive upgrades to gain more gold and increase the chance to find rare items. ITEMS The equipment consists of 14 slots: helmet, chest, gloves, pants, boots, amulet, two rings, three type of weapon (melee, ranged and magic), a shield, a banner and a pet. You can hunt for rare items by killing enemies or looting containers and treasure chests. You can also buy and sell from/to merchants in the encampment and gamble for unidentified items; or if you like to craft, you can gather materials and craft your own equipment at the forge. There are five qualities of items, normal, magic, rare, epic and mythic; all the items but the normal ones (which are needed for crafting), increase your character's statistics and add some passive bonuses. The better quality, the more and stronger are the bonuses. On top of that mythic items come with a special effect which will greatly enhance your character. PETS When you equip a pet it will be summoned at your side and it will follow you and fight with you. Your pet will attack any enemy on sight but you can call it back to you whenever you want and set it to passive mode. Some pets are melee, other are ranged and all of them have got a special ability. Like items, pets come in different qualities, from normal to mythic, and you can also boost them by spending upgrade points in the relative skills.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/632100/header.jpg?t=1572335784",
    "Price": 7.99,
    "Developers": "Redden",
    "Publishers": "Redden",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_c95d0bbafeb468a83d2274120d166a8a8b5c7976.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_54147631d7506e47f4c41c378640d1d21c763c9f.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_0aa1b1c0f1af4879ddcec647b7b27dcdba727c8f.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_7990c0ccc0cfe3d7b08a618f05975c7440af67ac.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_b429c36275b66282b69aa8d3b4710be1dacb292a.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_bfda9db141239c9b627288c67a7e016ff28b0400.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_356af79cf5f859129d5961b7ca23f021df69186a.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_89dcb96450c08e2b297a43f9ee3a170a0dae3b87.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_358790f29ca551593a73c190d854eaf91027d12c.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_ee134bd3bbc6a985d93ca50ccf1fc679c6c9df74.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_cdbf422c86481c881fe6b6f2d36aef375807b231.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_17b6ea19c71d790ee3f57a5c3c793f238fa4aac2.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_b234bfd954daa5469de9736b08b7c40f16f666ba.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_b8a490ab3ecfd3f14297b78317681385e903374f.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_d760f4be09d91b0977b00b307962bc452eab2732.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_0bcafaf59283689bdab4357f3731782821c766ac.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_3f29d4b5a31952722108ba75492b2cfb7d931c43.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_dfc950b5aab997cd68b3953b2ae085fc3e2e53e7.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_f9694bda120a793ed9f0facaca5b4f2e03c21131.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_f83e9182eed769b03ed13a207792cdad7393311b.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_daaddbaf9767c112c8fd5f793faaa3212d3efabb.1920x1080.jpg?t=1572335784,https://cdn.akamai.steamstatic.com/steam/apps/632100/ss_9c7e9f08451ecc88134da514fe5025de79f65813.1920x1080.jpg?t=1572335784",
    "Slug": "the-last-sigil",
    "Meta Title": "The Last Sigil: Mar 28, 2019, Redden and Full Overview",
    "Meta Description": "Looking for information on The Last Sigil? Check out the release date (Mar 28, 2019), developer insights from Redden, and a complete game summary.",
    "Alt Text Image": "Official header image for The Last Sigil game - Steam 632100",
    "Canonical URL": "https://gusku.site/game/the-last-sigil",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Last Sigil\", \"description\": \"Looking for information on The Last Sigil? Check out the release date (Mar 28, 2019), developer insights from Redden, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 28, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Redden\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Redden\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/632100/header.jpg?t=1572335784\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}