{
    "AppID": 873230,
    "Name": "The King's Request: Physiology and Anatomy Revision Game",
    "Release date": "Jun 24, 2018",
    "About the game": "Are you studying Physiology or Anatomy or interested in the human body, science, biology, medicine, biomedicine, biomedical science, nursing, pharmacy, health or exercise science? This short adventure game will help you work through questions surrounding some of the major concepts in physiology, anatomy and the study of the human body. There's no negative if you get a question wrong - so answer the call and save the kingdom!! It's completely free, with no adds or anything else... so jump in and give the game a go! After you play the game: to learn more anatomy &amp; Physiology, or see some great content on health, the human body and disease, subscribe to my YouTube Channel: Physiology with Dr Christian for more FREE learning content! Click ' Visit the website ' on the right sidebar for quick access! Features within the game: Adventure RPG with a questline to save the castle and help the king Battles use your knowledge of Physiology, Anatomy, Biology and Health Sciences to defeat the bosses Engaging virtual world with nearly all features, items and components interactive Gold system: Find gold, uncover treasure, explore the map and use the currency within the in-game shop Walk, run, or take a boat out to the open ocean as you reach all corners of the kingdom Hidden bosses, secrets and fun things to uncover throughout Sassy, silly humorous encounters, characters and events All questions and content fully approved and curated by scientists, clinicians, and medical educators A unique method to revise and understand human physiology and anatomy TOTALLY FREE! No adds, no costs, yours to experience - it's a short adventure game and you may learn something - why not have a go!! I developed this small game to encourage anyone interested in a range of health sciences or medicine courses to revise content covered in Physiology and Anatomy (~Year 1 uni level) - but will be relevant to anyone learning about the human body. It's also an experiment in gamifying content and making more educational resources available online. If the community finds this useful, I'd love to produce more of these types of resources, in a range of subjects with no cost ever: They'll always be free to install, share and use. Let me know in the reviews if gamifying learning content and revision questions in this way is something that you think may have potential. Thanks for playing !!! 'I'm done revising.. how can I LEARN new stuff?!?!' Well...additional FREE physiology and anatomy video content is covered on my YouTube channel: ' Physiology with Dr Christian ': - Check it out by clicking ' Visit the website ' on the right sidebar. PS: I'm on Instagram too - visit and say hi: @physiologywithchristian",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/873230/header.jpg?t=1533675601",
    "Price": 0.0,
    "Developers": "Physiology with Dr Christian",
    "Publishers": "Physiology with Dr Christian",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/873230/ss_ac2068d84e1f53981a2cd86c39f749976508f03f.1920x1080.jpg?t=1533675601,https://cdn.akamai.steamstatic.com/steam/apps/873230/ss_1f062c7338d10434499a8060aeac0997d87daab0.1920x1080.jpg?t=1533675601,https://cdn.akamai.steamstatic.com/steam/apps/873230/ss_cc350674e73928aabb511ee97a216a7fc716fb95.1920x1080.jpg?t=1533675601,https://cdn.akamai.steamstatic.com/steam/apps/873230/ss_f86e5c0cdf01705ed1f06d90e46ea5549f5dd6ec.1920x1080.jpg?t=1533675601,https://cdn.akamai.steamstatic.com/steam/apps/873230/ss_ffe50130f419e9ed0b5507bceffb6410b1f4d558.1920x1080.jpg?t=1533675601,https://cdn.akamai.steamstatic.com/steam/apps/873230/ss_52479551161907246441fb96c389c571dc2e18c7.1920x1080.jpg?t=1533675601,https://cdn.akamai.steamstatic.com/steam/apps/873230/ss_66103584a197cb301cb09335dc5e2545ae1e44a7.1920x1080.jpg?t=1533675601,https://cdn.akamai.steamstatic.com/steam/apps/873230/ss_e79def0f7c28e036dfb6cc62a1244f7ff43906ba.1920x1080.jpg?t=1533675601",
    "Slug": "the-king-s-request-physiology-and-anatomy-revision-game",
    "Meta Title": "The King's Request: Physiology and Anatomy Revision Game:...",
    "Meta Description": "Looking for information on The King's Request: Physiology and Anatomy Revision Game? Check out the release date (Jun 24, 2018), developer insights from ...",
    "Alt Text Image": "Official header image for The King's Request: Physiology and Anatomy Revision Game game - Steam 873230",
    "Canonical URL": "https://gusku.site/game/the-king-s-request-physiology-and-anatomy-revision-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The King's Request: Physiology and Anatomy Revision Game\", \"description\": \"Looking for information on The King's Request: Physiology and Anatomy Revision Game? Check out the release date (Jun 24, 2018), developer insights from ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 24, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Physiology with Dr Christian\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Physiology with Dr Christian\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/873230/header.jpg?t=1533675601\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}