{
    "AppID": 501320,
    "Name": "The Shrouded Isle",
    "Release date": "Aug 4, 2017",
    "About the game": "As the high priest, uncover and purge heretics to prepare for the awakening of your beloved god beneath the waves. Now including the Sunken Sins expansion with a more robust inquiry system, lengthened campaign mode, and a new purification tower mechanic, cinematic ending, art, additional events, personality traits and… madness...? Villagers with secret, randomly assigned virtues and vices create a different strategy every time. Carefully choose who to serve as your advisors, as one of them must be your sacrifice at season’s end. Rename villagers at whim, and thereby sacrifice simulacrums of your friends, family, or followers. 6 different colour schemes available. Search out the true heretics with unforgivable sins, to quiet the voices in your dreams. Find all seven cinematic endings and meet your Lord’s expectations of purity. It is a mistake to assume danger only lies within your island - beware the seas that surround you. A mysterious spiritual contagion has washed upon the shores of your village and contaminated your citizenry. Lock the infected away in the purification tower and allow the holy salt water to wash away their sins, but know such treatment can have ill effects on the healthy… The free Sunken Sins expansion spawns several major improvements to the game: A more strategic inquiry system and longer campaign New purification tower game mechanic Additional events, personality traits, art, animation, and ending ....Contagions...? For the past 495 years, a secluded island village has adhered to bloody yet sacred traditions. They speak of a sleeping God beneath the waves, whose awakening shall birth a new era for the worthy. In this cult manager, there are sinners aplenty, and not all are eager to confess. Each member of your community has 2 hidden traits - one virtuous, one heretical. If you’ve earned the favor of their House, you may investigate their reputation. Be alert as you may find strange occurrences among your devotees due to a new mysterious contagion . Ensure you lock the infected away and allow the salt water to wash away their sins. Otherwise, you may appoint them to your seasonal council and watch their work for clues. Five powerful aristocratic families help maintain the village, seeking salvation through book burning, monument building, and heretical investigations. Choose one advisor from each family to assist in their ancient appointed task. However, every season, you must make the ultimate choice, designating a human sacrifice. Closely examine your citizenry to find the best strategy for your people and beliefs, knowing that nobody wants their child sacrificed, even for the greater good. When our Lord awakens, will He find you worthy? The five families of The Shrouded Isle each supervise a different aspect of the community. Be cautious, as their loyalties are fickle as the tide. House Kegnni manages the farmlands of the village, and is charged with protecting the sacred ignorance of the community. Matron Kegnni trains her sons and daughters in the art of book-burning, erasing any trace of the old world and its many sins. House Iosefka are the village builders, using carpentry and masonry to create grand structures that ensure our Fervor may never be extinguished. Adjudicator Iosefka has designed a variety of monuments over the years, and is said to favor pyromaniacs, as their ritual fires burn brightest. House Efferson are the judges of our souls, wielding the whips that punish sinners and ensure Penitence. To confess to Vicar Efferson is to discover the newest and most effective flagellation techniques to appease our Lord. House Cadwell carefully count the wealth of the village, made up primarily of merchants and miners, and enforce Discipline. Lord Cadwell and his sons and daughters scour the village for forbidden delights that might distract from prayer and (we trust) dispose of them appropriately. Everyone in the village dreads House Blackborn, the guards and enforcers of Obedience. Stories abound of the dungeons of Inquisitor Blackborn, but lawful, peace-keeping citizens have nothing to fear.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/501320/header.jpg?t=1590784482",
    "Price": 9.99,
    "Developers": "Jongwoo Kim,Erica Lahaie,FX Bilodeau,Tanya Short",
    "Publishers": "Kitfox Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/501320/ss_8b0fe63310851096f164c1160ded6cd59dcd69fb.1920x1080.jpg?t=1590784482,https://cdn.akamai.steamstatic.com/steam/apps/501320/ss_c49551bc122a5133ed968a31dbdb11fab09e7f64.1920x1080.jpg?t=1590784482,https://cdn.akamai.steamstatic.com/steam/apps/501320/ss_e30be056fbd31ce0189310cb833530888e4592e0.1920x1080.jpg?t=1590784482,https://cdn.akamai.steamstatic.com/steam/apps/501320/ss_cda604b1242be0e74dc065e5bcb0b074d19605d6.1920x1080.jpg?t=1590784482,https://cdn.akamai.steamstatic.com/steam/apps/501320/ss_8329fa4624ed097073b8e7fb5216bc0bc5df4a83.1920x1080.jpg?t=1590784482,https://cdn.akamai.steamstatic.com/steam/apps/501320/ss_89703997912d94bf176d67c5a3bc8773eea032e2.1920x1080.jpg?t=1590784482",
    "Slug": "the-shrouded-isle",
    "Meta Title": "The Shrouded Isle: Aug 4, 2017, Jongwoo Kim,Erica Lahaie,...",
    "Meta Description": "Looking for information on The Shrouded Isle? Check out the release date (Aug 4, 2017), developer insights from Jongwoo Kim,Erica Lahaie,FX Bilodeau,Tan...",
    "Alt Text Image": "Official header image for The Shrouded Isle game - Steam 501320",
    "Canonical URL": "https://gusku.site/game/the-shrouded-isle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Shrouded Isle\", \"description\": \"Looking for information on The Shrouded Isle? Check out the release date (Aug 4, 2017), developer insights from Jongwoo Kim,Erica Lahaie,FX Bilodeau,Tan...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 4, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jongwoo Kim,Erica Lahaie,FX Bilodeau,Tanya Short\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kitfox Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/501320/header.jpg?t=1590784482\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}