{
    "AppID": 600610,
    "Name": "The Hand of Merlin",
    "Release date": "Jun 14, 2022",
    "About the game": "The Hand of Merlin is a turn-based rogue-lite RPG in which Arthurian legend clashes with cosmic horror. Recruit a company of up to three mortal heroes and guide them in spirit on a desperate journey from Albion to Jerusalem. Explore a richly-imagined medieval setting on the brink of apocalypse. Trade with merchants, improve your heroes and unearth ancient relics. Search for the lost fragments of your soul, scattered across the multiverse - and save as many worlds as you can. Enjoy a compelling story inspired by Arthurian legend, the Matter of France, and the history of Al-Andalus - with an unusual twist. Make choices in interactive encounters that change every time you play. Written by Jonas Kyratzes (The Talos Principle, Serious Sam 4) and Verena Kyratzes (The Lands of Dream, Serious Sam 4). Master the tactics of squad-based and turn-based combat to conquer both human and demonic foes. Your enemies will be tough and ruthless; make use of cover, set up ambushes and coordinated attacks, harness synergies between different Hero classes and skills. Carve a path across the lands of Albion, Marca Hispanica and Al-Andalus. Will you take a dangerous route, risking life and limb in pursuit of a legendary relic? Or will you choose a safer path? Plan and prepare. Negotiate, barter, fight. Tackle challenges. Suffer losses. Recruit new Heroes. Earn Gold, Supplies and Renown. Be careful: your choices are permanent, as is death. But don't tarry - evil never rests. Use Renown to level up your Heroes, and choose between a randomized set of new skills or improved attributes. But choose wisely! Select skills with great synergy and balance your party for the road ahead. As you jump from one parallel dimension to the next, history is reshaped. Different kings rule the land, changing the encounters, characters, and events. No two worlds are ever quite the same, and each journey will be unique. And should your heroes fall, remember: defeat is not the end, only a new beginning. Seek out towns to improve your arms and armor, or stumble upon hermit artisans in the wild. With every day that passes, the world plunges deeper into darkness, and you will need all the equipment gold can buy. From a peasant's humble luck charm to the legendary sword wielded by Arthur himself, items imbued with magical power are scattered about the world. Some you will be able to purchase from merchants and collectors, but others will have to be earned through acts of heroism - or displays of wit. Rain thunder and brimstone upon your foes! Seek out and gather Soulstones to restore your power and unlock new Spells. Even if defeated, your spirit will retain all of your collected arcane knowledge as you jump into the next dimension. There are as many worlds as there are stars in the sky. In each stands Camelot; in each there is a Grail. But there is only one Merlin, and his eternal burden is to stand against the horror from beyond. Each world that is saved is saved forever; each world that is lost is lost for good. /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/600610/header.jpg?t=1656358207",
    "Price": 24.99,
    "Developers": "Room-C Games,Croteam",
    "Publishers": "Versus Evil",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/600610/ss_b18d3f39bfd28c69eddb26cc877f7cebae78285e.1920x1080.jpg?t=1656358207,https://cdn.akamai.steamstatic.com/steam/apps/600610/ss_d0ee459bad3932bd749b86cbceb08f5f72889af8.1920x1080.jpg?t=1656358207,https://cdn.akamai.steamstatic.com/steam/apps/600610/ss_1e1b6364a08af6263b375ee1ebb8211a9fcb47f5.1920x1080.jpg?t=1656358207,https://cdn.akamai.steamstatic.com/steam/apps/600610/ss_5f76304036a35f8cdd2d49226ba7cee11a1469b4.1920x1080.jpg?t=1656358207,https://cdn.akamai.steamstatic.com/steam/apps/600610/ss_897cd1fde8f554ef84cb34b1f1438a88d8161ffa.1920x1080.jpg?t=1656358207,https://cdn.akamai.steamstatic.com/steam/apps/600610/ss_928752a1cf2e45856563ec60cb96ef6daa8013fb.1920x1080.jpg?t=1656358207,https://cdn.akamai.steamstatic.com/steam/apps/600610/ss_6e7da32e512be34a9554e5c22ea6923ff9a6d4b0.1920x1080.jpg?t=1656358207,https://cdn.akamai.steamstatic.com/steam/apps/600610/ss_602e6e9070475b57233f00d3c875d3abeb511f8c.1920x1080.jpg?t=1656358207",
    "Slug": "the-hand-of-merlin",
    "Meta Title": "The Hand of Merlin: Jun 14, 2022, Room-C Games,Croteam an...",
    "Meta Description": "Looking for information on The Hand of Merlin? Check out the release date (Jun 14, 2022), developer insights from Room-C Games,Croteam, and a complete g...",
    "Alt Text Image": "Official header image for The Hand of Merlin game - Steam 600610",
    "Canonical URL": "https://gusku.site/game/the-hand-of-merlin",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Hand of Merlin\", \"description\": \"Looking for information on The Hand of Merlin? Check out the release date (Jun 14, 2022), developer insights from Room-C Games,Croteam, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Room-C Games,Croteam\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Versus Evil\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/600610/header.jpg?t=1656358207\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}