{
    "AppID": 436260,
    "Name": "Ultimate Arena FPS",
    "Release date": "Sep 5, 2016",
    "About the game": "Ultimate Arena is a competitive first person shooter arena game. Compete against other players online to prove your worth, wielding a loadout of 12 brutal weapons and wrecking total havoc within the arenas! Control health, armor and weapon pickups throughout the map to gain an advantage against your foes. Prepare to frag like you never have! Weapons: Gauntlet You spawn with it. This short ranged melee blade will hack and prune anyone dumb enough to get too close up and personal. Pistol You spawn with it. The long range and moderate firing rate will allow you to pick off enemies at both medium and long distances, providing they don't overtake you with heavier firepower. Secondary fire uses ice charges which are able to temporary freeze opponents, bogging them down. Shotgun The pump action shotgun inflicts considerable damage at close range. Double Shotgun Slower than the pump action shotgun but twice as deadly at close range. Assault Rifle A special hybrid automatic rifle which peppers foes with 16mm rounds even at long range without ever having the need to reload. Lethal if you have an accurate aim. Shredder This unique and nasty tool fires a pair of circular blades in quick succession. You can ricochet them off walls and slice foes who are out of your line of sight. Rocket Launcher Blow stuff up. Solve problems. Grenade Launcher This particular model is able to detonate your grenades at any given moment by using secondary fire. Laser Prism The electric beam is able to harm targets at medium range. Your accuracy will determine the outcome of the fight. Plasma Cannon Designed to sweep large areas with plasma projectiles. You'll need to properly predict the enemies movement in order to get the best out of this weapon. Gas Rifle This thing spews foulness all over the place. Good for crowd control. The low damage is heavily compensated by the large area of effect. Crossbow Primary fire shoots deadly bolts at high speed. Secondary fire also consumes electricity ammo but allows higher range and damage by using electrified arrows.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/436260/header.jpg?t=1653640604",
    "Price": 17.99,
    "Developers": "Kenneth Caselli,Gianmarco Rocco",
    "Publishers": "AceGamer Network",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/436260/ss_98d361ef82758a0746e61fe883db9b43b5eb1e35.1920x1080.jpg?t=1653640604,https://cdn.akamai.steamstatic.com/steam/apps/436260/ss_48dbd075f4ea84e17d2c412ab2bc83a6689eeda0.1920x1080.jpg?t=1653640604,https://cdn.akamai.steamstatic.com/steam/apps/436260/ss_79bfa862c19661b5474ba20899b110ab90aa0820.1920x1080.jpg?t=1653640604,https://cdn.akamai.steamstatic.com/steam/apps/436260/ss_aa3e62a87cb8aa6eaba267e9df9a4bb3d0fe0e5e.1920x1080.jpg?t=1653640604,https://cdn.akamai.steamstatic.com/steam/apps/436260/ss_63805a8df5e181d492ff1c251b6ddda03c268f57.1920x1080.jpg?t=1653640604",
    "Slug": "ultimate-arena-fps",
    "Meta Title": "Ultimate Arena FPS: Sep 5, 2016, Kenneth Caselli,Gianmarc...",
    "Meta Description": "Looking for information on Ultimate Arena FPS? Check out the release date (Sep 5, 2016), developer insights from Kenneth Caselli,Gianmarco Rocco, and a ...",
    "Alt Text Image": "Official header image for Ultimate Arena FPS game - Steam 436260",
    "Canonical URL": "https://gusku.site/game/ultimate-arena-fps",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ultimate Arena FPS\", \"description\": \"Looking for information on Ultimate Arena FPS? Check out the release date (Sep 5, 2016), developer insights from Kenneth Caselli,Gianmarco Rocco, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 5, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kenneth Caselli,Gianmarco Rocco\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AceGamer Network\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/436260/header.jpg?t=1653640604\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}