{
    "AppID": 506870,
    "Name": "Unexplored",
    "Release date": "Feb 22, 2017",
    "About the game": "Real-time Roguelite Dungeon Crawling at its Very Best! Unexplored is the roguelite that feels like a roguelike. An accessible yet challenging action rpg, praised for its fantastic level generator, real-time combat and a surprising amount of content and depth. Plus: free dlc which adds even more variety! Explore dangerous dungeons, solve mysterious puzzles and engage hundreds of foes, big and small, in intense melee combat. Easy to Play, Easy to Die Fantastic Generated Dungeons (using brand new tech) Real Emergent Gameplay with many Tactical Options Intense, Real-time, Dual Wielding Melee Combat Stealth Mechanics (dungeon crawling like a real rogue…) Over 50 dangerous bosses Challenging, generated puzzles Adaptive, original soundtrack Watch this video to understand how Unexplored creates its dungeons: -6P3Q In the Words Of A Player: What Do You Feel Makes the Game Stand Out? Misery, one of Unexplored’s Early Access players, thought our description didn’t do the game justice. So, we asked: “What do you feel makes the game stand out?” We really liked what Misery wrote, so here’s a summary: 1. the Dungeon Generation 2. It uses a ton of traditional roguelike concepts, but in non-annoying ways The fact that the game FEELS like a traditional one while still being real-time is a pretty major thing as far as I see it. 3. The combat is pretty fun, yeah Lots going on there, particularly once things like potions and staves or whatever are thrown into the mix. Feels more tactical than the usual 'shoot everything' sort. 4. Pausing the game Being able to pause the game and deal with your inventory, use items, and examine things, without actually leaving the game screen, that's a big one. It all really opens up a lot of options for tactical play. 5. The Puzzles [The puzzles] feel like the sorts that the old Zelda games used to use. That same satisfaction from that is here overall. 6. The hub floors Ended up being a great feature. 7. The huge variety of enemies Not just bosses, but monsters and traps and all sorts of stuff. I've been constantly impressed by this. Even after so much time with the game there's still plenty I haven't even seen yet. 8. And of course the whole 'lock and key' concept. You can read the entire comment here: #comment_content_135509472113184826 We continue with our own, inferior description: The goal of Unexplored The goal of Unexplored is to find the dragon in the depths of the dungeon of doom, slay it to claim the Amulet of Yendor and bring it back to the surface. Every run, the game will create an intricate map of dungeons, hinting at foes to come and solutions for puzzles you’ll face. Lots Of Bosses During your adventure through the dungeons, you’ll regularly face off with one of over fifty possible bosses. These range from the Queen Ant, to the Balrog and, yes, several menacing Dragons. Some of these bosses can only be slain with the right weapons, so make sure not to miss those on the previous levels. Uncover Secret Items In the spirit of roguelikes, the game does not tell you which potions will save you, and which will kill you. You’ll have to find out yourself either by taking risk or using the right Magic Scrolls. Same story for the Enchanted Weapons: are they blessed with divine powers or cursed with deadly spells? Puzzles Pitted throughout the dungeons you’ll encounter strange statues. Some of these are part of puzzles and solving those may reap great rewards. So, you may want to pick up and read the books you’ll see lying around. They may feature hints on how to solve a puzzle, even one a few levels deeper. Weapons You’ll be able to equip two items and wield them both. In the darkest deeps you might want to hold a burning torch beside your axe. Bats tend to be killed easily from a distance by throwing daggers at them, so why not equip them in both slots? Or wield a whip, no better, the Flaming Whip you just plucked from that Balrog you managed to finally kill. Or… perhaps it’s best you start with a shield. A big, enchanted shield. Yes. Armor Your starting armor may not seem like much, but that’s only because… well, because it IS not that much. It will keep you safe from the bites of bats, but don’t try your luck with an Orc. Beat the right foes to collect their leather breastplates or chainmail. Or… equip the right cloak on go stealth… Wait, Stealth? Yes, that is an option. You can go unnoticed for a long time and execute surprise attacks for added damage. Like everything in Unexplored, it’s up to you to weigh the rewards versus the risk. Because a surprise attack on a Necromancer may sound like a terrific idea, but it’ll probably survive your first strike, leaving you quite vulnerable in your cloak of cloth. Progression Unexplored features several kinds of progression for you and your character. The most important is simple: experience. Expect to die a lot in the beginning, whilst learning exactly how to play the game. But you will learn and before you know, you reach a deeper level every run. However, there’s more than just experience. Within each run, you’ll find Potions of Strength, drink those and your power increases for as long as your stays alive. A Potion of Life not only completely heals your hero, it increases the amount of Hit Points. Upgrading your equipment by combining it with certain magic items on an anvil will grant you perks for the time being. Offer to the Gods, and you may receive another upgrade. However, if you die, your powers die with you. Unexplored is a game featuring perma-death. Nevertheless, some upgrades are permanent. When you unlock achievements, you unlock equipment and items you can purchase before you start a new run. You pay for these items with the other permanent feature: gold. Your hero will inherit all the gold your previous one owned. So it is always an absolutely fabulous idea to try an open as many chests as possible, you might get rich trying. Or, just spend it all during your run when you meet one of the vendors. Yes, you heard that correctly: during the game you will be able to spend your gold on new equipment and potions. Obviously, if you subsequently fail, all that gold is lost. Like in forever. Crafting and Mixing The deeper you go, the more dangerous the dungeons will be. So, make sure to pick up the right equipment, potions and scrolls along the way. You can even craft better items and mix healthy or plain deadly drinks. Foreshadowing…? Part of Unexplored’s allure is the way it generates the dungeons. Not just the levels themselves (see this video about Cyclic Dungeon Generation), but all the dungeons in their entirety. The game knows what you’ll face on the deepest levels even before you start wandering the first one. So, it will provide you with hints, keys and notes about what to expect down the line. Best keep an eye out for those. That’s It? No, of course not. Unexplored is a game filled with content, with lava and water, plants and trees (flammable trees that is), with hidden doors and locked doors (use lockpicks!), with small bosses and big bosses and with so much more. But we won’t spoil everything here. It’s up to you to find out! So, go have yourself an adventure! You’ll love it! *************************************** community Unexplored has a fantastic community of players helping each other out. They have been an integral part of the development of this game. So, if you're really stuck, let us know in the Steam forum, and we, or one of the other players, will try and help you out.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/506870/header.jpg?t=1658064503",
    "Price": 9.99,
    "Developers": "Ludomotion",
    "Publishers": "Ludomotion",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_31149be2b4b02d38536a49560f6d89129a91740d.1920x1080.jpg?t=1658064503,https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_f06499f058f9a46c967f765a65e58d4a48674d44.1920x1080.jpg?t=1658064503,https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_5c58ad35ea12370991f1dd215656caa2d24f1edd.1920x1080.jpg?t=1658064503,https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_0389773b806df6cbea828ae9b04b1fe32f131b9d.1920x1080.jpg?t=1658064503,https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_2d1d87347548383dbdf906a43b80f03fde03f02b.1920x1080.jpg?t=1658064503,https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_629061018df6c670ef379ec28e38a88acd576294.1920x1080.jpg?t=1658064503,https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_dd4412f217af8330fa1d6c6e369074cde439756e.1920x1080.jpg?t=1658064503,https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_5e14de0c155ce0570cc33834f033139f6c8b287f.1920x1080.jpg?t=1658064503,https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_1b9d81dcf4bec77390790e5ba2cb19d6431d4a03.1920x1080.jpg?t=1658064503,https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_8dec14dba020df1f647d42d2b21523091602d174.1920x1080.jpg?t=1658064503,https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_7cba5002e58aa02aeb03393e1275d7e95e07a8ea.1920x1080.jpg?t=1658064503,https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_a3e559e83bd051558fb1064a3a7e73d573b50a74.1920x1080.jpg?t=1658064503,https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_af6440b995f113d35999af111e0e0e80aa77c53b.1920x1080.jpg?t=1658064503,https://cdn.akamai.steamstatic.com/steam/apps/506870/ss_e64a073eaadfa685f13d8a757175d23a603e300f.1920x1080.jpg?t=1658064503",
    "Slug": "unexplored",
    "Meta Title": "Unexplored: Feb 22, 2017, Ludomotion and Full Overview",
    "Meta Description": "Looking for information on Unexplored? Check out the release date (Feb 22, 2017), developer insights from Ludomotion, and a complete game summary.",
    "Alt Text Image": "Official header image for Unexplored game - Steam 506870",
    "Canonical URL": "https://gusku.site/game/unexplored",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Unexplored\", \"description\": \"Looking for information on Unexplored? Check out the release date (Feb 22, 2017), developer insights from Ludomotion, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ludomotion\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ludomotion\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/506870/header.jpg?t=1658064503\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}