{
    "AppID": 1871510,
    "Name": "Within Skerry",
    "Release date": "Feb 8, 2022",
    "About the game": "Within Skerry is a short horror development that places significant emphasis on creating an atmosphere of great terror, suspense, and anticipation for the player. Within Skerry also features a dark and twisted storyline with events and audio that will send shivers down your spine. The Accumulation of Evil is an ancient book stating that if enough evil energy is concentrated in a single area, a dark force may be born. Located on a skerry is a large mansion used to meet with many of the world’s top leaders. Is it rumored that during these meetings, world leaders - people of power and wealth - would engage in all sorts of horrific transactions. Some of these transactions are rumored to include weapons and drug trading, human trafficking, and murder. It’s been several weeks since anyone has heard from some of these world leaders. Nobody can get a hold of them, and nobody can find them. However, many people who follow this story online suspect that these people have all been murdered on their infamous skerry. Many referenced The Accumulation of Evil, and others call it a misunderstanding. But who is to truly know? I intend to visit the skerry and see for myself. It’s not too far off from the mainland, so I will check it out then leave. *Within Skerry contains flashing lights. Within Skerry is also a horror game with significant elements of horror and scares that can increase blood pressure, anxiety, and stress. Please proceed at your own risk. For the best experience, use headphones and play alone in the dark* *Within Skerry is a short horror game with an estimated single completion time of ~60 minutes . As such, Within Skerry DOES NOT offer save-game functionality. Within Skerry must be completed in a SINGLE SITTING. Within Skerry is a short explorative horror game. You will venture throughout the island and discover items, solve puzzles, and learn about the dark story encompassing the island and its inhabitants. You will do all of this while being on edge, as you are stalked by the current residents of the estate. Within Skerry includes several endings, all of which depend on the final choices you make within the game. The more items you collect, and the more story you uncover, the closer you may get to unlocking the final, true ending. Do you have what it takes to escape the Skerry? Within Skerry was an absolute joy to develop. It all started out with a house I've seen and said to myself ' I kind of want to build this house and make a scary game out of it'. So, I began putting a rough blueprint together, and began developing the house (With a few changes, here and there). To be honest, my vision for the game at the preliminary stages is extremely different from what the game is right now. For one, it was supposed to be sunny outside, and the entire house was supposed to be lightmapped with no plywood blocking off the windows. Unfortunately, I am horrible with lightmapping and every time I did something with lightmapping, things broke, or things just looked ugly altogether. It was a struggle, that's for sure. But as time went on, new ideas popped into my head, and I began to implement these new ideas into the game - ultimately forming what we have here, today. I am also really pleased to finally offer multiple language support. Though, this is my first crack at it, so please be warned, grammar errors may exist :) To this day, I believe within Skerry is my best and scariest game. If you decide to give the game a go, I hope you pop on some headphones, turn the lights off, and enjoy the ride. Please, whether you enjoyed or disliked the game, please leave a review, as all reviews truly help me gage where my games stand, in terms of popularity. Tell me what you like, what you disliked, and even what spooked you out! All your responses will be greatly appreciated. As always, I want to thank you all for the support. Your kindness and support of the games I release are what drive me to want to keep releasing more and more games. Cheers, everyone, and happy gaming! Stan. T",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1871510/header.jpg?t=1644343261",
    "Price": 4.99,
    "Developers": "Stanislaw Truchowski",
    "Publishers": "TurnVex",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1871510/ss_6c28e0682d0a1647b4eb71226bc873d44845a29c.1920x1080.jpg?t=1644343261,https://cdn.akamai.steamstatic.com/steam/apps/1871510/ss_e646041b853be12038417e5ec235241eb89424e6.1920x1080.jpg?t=1644343261,https://cdn.akamai.steamstatic.com/steam/apps/1871510/ss_4bf714f29ed08f8a8f3fe99e02a8b8c2e8aca09f.1920x1080.jpg?t=1644343261,https://cdn.akamai.steamstatic.com/steam/apps/1871510/ss_7ba90b196e66b4a5a17411660fa9df5382e1d1c6.1920x1080.jpg?t=1644343261,https://cdn.akamai.steamstatic.com/steam/apps/1871510/ss_0aa957990a0944e74d54e85d954b09cd92518f4d.1920x1080.jpg?t=1644343261,https://cdn.akamai.steamstatic.com/steam/apps/1871510/ss_80cb7701d0b63f2fea90a4a6bd4ad195ab43e86f.1920x1080.jpg?t=1644343261,https://cdn.akamai.steamstatic.com/steam/apps/1871510/ss_3b4ebebd5b08d2bfaaead32bfe87cfad7c60745e.1920x1080.jpg?t=1644343261,https://cdn.akamai.steamstatic.com/steam/apps/1871510/ss_22874f5141102f4b769dbe458ca3f4fffbe439dd.1920x1080.jpg?t=1644343261,https://cdn.akamai.steamstatic.com/steam/apps/1871510/ss_e60c98de080b0b7edb60054f36eeb43b25654f6a.1920x1080.jpg?t=1644343261,https://cdn.akamai.steamstatic.com/steam/apps/1871510/ss_c6781c5a6d90c2d8e2fe4814f61e1efe9c1da916.1920x1080.jpg?t=1644343261,https://cdn.akamai.steamstatic.com/steam/apps/1871510/ss_2ffe734a7c612109b56268edb3f05d3639c7457f.1920x1080.jpg?t=1644343261,https://cdn.akamai.steamstatic.com/steam/apps/1871510/ss_f783d5b341f5fc5213208d3f445f0ef1a977fa76.1920x1080.jpg?t=1644343261,https://cdn.akamai.steamstatic.com/steam/apps/1871510/ss_caaaf1e2c315b6fad596b015ee9eb3d64b0e230c.1920x1080.jpg?t=1644343261",
    "Slug": "within-skerry",
    "Meta Title": "Within Skerry: Feb 8, 2022, Stanislaw Truchowski and Full...",
    "Meta Description": "Looking for information on Within Skerry? Check out the release date (Feb 8, 2022), developer insights from Stanislaw Truchowski, and a complete game su...",
    "Alt Text Image": "Official header image for Within Skerry game - Steam 1871510",
    "Canonical URL": "https://gusku.site/game/within-skerry",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Within Skerry\", \"description\": \"Looking for information on Within Skerry? Check out the release date (Feb 8, 2022), developer insights from Stanislaw Truchowski, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Stanislaw Truchowski\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TurnVex\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1871510/header.jpg?t=1644343261\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}