{
    "AppID": 688350,
    "Name": "Wrath of the Goliaths: Dinosaurs",
    "Release date": "Sep 13, 2018",
    "About the game": "DISCLAIMER: This project is in early access. We ask that if you choose to support us, to note that their may be interruptions to game play and as such interruptions occur we will attempt to make a public announcement before hand. We also ask that you inform us of any bugs found during typical gameplay. Wrath of the Goliaths: Dinosaurs is a first person dinosaur hunting simulator set in a distopian future ruled by terrifying beasts, reanimated from a pre-historic era. In this unfortunate future where mankind is all but extinct, hunters undergo intense military training to become one of the elite few allowed access to the hunting grounds. Their aim, to collect vital information and minimize the threat that dinosaurs pose to humanity. You are one of the chosen ones. You are a hunter. Will you kill, or be killed? Hunters are granted access to a limited array of weapons and will need to hunt in order to unlock the best Perma can offer. All hunters are given a side-arm for each hunt, but will soon find that having many more to aid in their mission of minimizing the dinosaur population is necessary. For each kill you will be awarded “Perma-Money”. The more Perma-Money available, the higher your status and the more dangerous and rare your marks will become. Death surrounds you as you hunt through various environments, from a stealthy crocodilian monster, to a towering beast who can destroy you with a flick of their tail. Do you dare join the hunt? What To Expect As hunting games go, you will be thrown into the literal jaws of death as you take down natures biggest beasts! To begin hunting, you will need to start off slow and work your way up. Entering a hunt is as easy as filling out a form, and being sent off to take down the selected hunts. Note that the hunts you select may have a chance at not appearing at all, fear not, your perma-points do not go away after beginning a hunt. They can only go up after each successful hunt! What Is In Game So Far All of these features are implemented, but they may still contain bugs, errors, or mistakes that will be fixed through updates. Several dinosaurs to hunt such as Carnotaurus and Allosaurus, with a few to unlock Several powerful weapons to choose from with more advanced ones to be discovered Trophy collecting Dinosaur AI, dinosaurs will change their current behavior based on their perceived threat, hunger and thirst, however! Like our predecessors, if you run into any of the dinosaurs, you are as good as dead Several different maps to choose from, from a section in a redwood forest, to a hot and massive desert! Observation mode, allowing you to get up close with the dinosaurs and discover their behaviors and patterns. Discover what alerts them in this mode! Wrath of the Goliaths: Dinosaurs has been a passion project from the start and always will be; therefore we hope to bring to you a game that is the spiritual successor to dinosaur hunting games of yesteryear. Mod Support Although, mod support is not available currently, we strongly acknowledge and believe mod support does help a games longevity. That is why we will work hard to implement the features provided by Steamworks to incorporate mod support through Unreal Engine 4 in the future. Community members will be able to download a free copy of Unreal Engine 4 from Epic's website, and through the Steam Workshop, develop, create, and share all sorts of mods. From new dinosaurs, modes, custom skins, and maps is what we hope to eventually allow users to create and implement. We hope you enjoy playing Wrath of the Goliaths: Dinosaurs, and we thank you for your support!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/688350/header.jpg?t=1631325261",
    "Price": 9.99,
    "Developers": "Ascendence Studios",
    "Publishers": "Ascendence Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/688350/ss_fb41af8ffbe65611669e7c0b51f2ce4ad08e52a9.1920x1080.jpg?t=1631325261,https://cdn.akamai.steamstatic.com/steam/apps/688350/ss_4e6190e3ddb248944206d3f202888c30bb50c0d1.1920x1080.jpg?t=1631325261,https://cdn.akamai.steamstatic.com/steam/apps/688350/ss_c193f761cd89d820069724a9a1fa75b819238f6d.1920x1080.jpg?t=1631325261,https://cdn.akamai.steamstatic.com/steam/apps/688350/ss_6a2085d78a2920d9199a770df0e3c6f328a896c5.1920x1080.jpg?t=1631325261,https://cdn.akamai.steamstatic.com/steam/apps/688350/ss_34f55de1ddec6b277a0a1709d2ca54d6252a5056.1920x1080.jpg?t=1631325261,https://cdn.akamai.steamstatic.com/steam/apps/688350/ss_695c1a2b7503685128a85ecf24d476c95ed9e8a8.1920x1080.jpg?t=1631325261,https://cdn.akamai.steamstatic.com/steam/apps/688350/ss_67f072ba71cad1005b745afb4a793591a5889223.1920x1080.jpg?t=1631325261,https://cdn.akamai.steamstatic.com/steam/apps/688350/ss_6aaaaa0fcf008e6922baf984cae62f0996246dce.1920x1080.jpg?t=1631325261,https://cdn.akamai.steamstatic.com/steam/apps/688350/ss_6ac6468b1a19d43329d906af987c08d26bb303d9.1920x1080.jpg?t=1631325261,https://cdn.akamai.steamstatic.com/steam/apps/688350/ss_9b40402b0a5142ca9cd65105f4f8ea855c58de1f.1920x1080.jpg?t=1631325261,https://cdn.akamai.steamstatic.com/steam/apps/688350/ss_fe891fdcb018307c802232cddf603eab1c3db116.1920x1080.jpg?t=1631325261,https://cdn.akamai.steamstatic.com/steam/apps/688350/ss_c6620952554b5ab4ac2d3862e180b7356b27271f.1920x1080.jpg?t=1631325261,https://cdn.akamai.steamstatic.com/steam/apps/688350/ss_59f6863c55449d1204ca25ae449b4080d80c7799.1920x1080.jpg?t=1631325261",
    "Slug": "wrath-of-the-goliaths-dinosaurs",
    "Meta Title": "Wrath of the Goliaths: Dinosaurs: Sep 13, 2018, Ascendenc...",
    "Meta Description": "Looking for information on Wrath of the Goliaths: Dinosaurs? Check out the release date (Sep 13, 2018), developer insights from Ascendence Studios, and ...",
    "Alt Text Image": "Official header image for Wrath of the Goliaths: Dinosaurs game - Steam 688350",
    "Canonical URL": "https://gusku.site/game/wrath-of-the-goliaths-dinosaurs",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wrath of the Goliaths: Dinosaurs\", \"description\": \"Looking for information on Wrath of the Goliaths: Dinosaurs? Check out the release date (Sep 13, 2018), developer insights from Ascendence Studios, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ascendence Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ascendence Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/688350/header.jpg?t=1631325261\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}