{
    "AppID": 1343750,
    "Name": "Z-Race",
    "Release date": "Dec 10, 2021",
    "About the game": "THE NEXT GENERATION OF VR RACING You're a racer in the future. Speed ​​is your passion and purpose in life. Super-fast racing ships, futuristic racing tracks, and a thirst for victory make this game an unforgettable experience. Improve your skills, unlock new ships, and compete with the world, and your friends, on the leaderboards. The anti-gravity system and driving models are based on real-world physics: each turn, slope, brake, and burst of acceleration is represented. The most comfortable VR arcade racing game We are continuously testing Z-RACE to make sure that it is the most comfortable VR racing game ever. From track design to vehicle control, to visual effects, we go the extra mile to ensure that our game can be played by almost anyone. We especially chose the third-person view to ensure the comfort of our players. EXPERIENCE A NEW GENRE OF RACING In this racing game, your ship can do anything. Use it to collect nitro boosts and coins, avoid energy traps and obstacles, and steer past the competition as you strive to become the best racer in all of Z-Race. With carefully crafted controls, Z-Race provides the most unique virtual reality racing experience of all time, assuring minimal motion sickness. ASYNCHRONOUS GLOBAL MULTIPLAYER Go head to head against anyone in the world in our asynchronous multiplayer experience. Upgrade your ships speed, agility, and nitro capacity so you can top our global leaderboards. Unlock new speed tiers by completely upgrading your ship to go even faster. Will you be the best Z-Racer? Z-RACE TOURNAMENTS! Win real money in Z-Race tournaments! To reward pilots for their hard work in the game, we’ve also started the tradition of quarterly, cross-platform tournaments which provide cash prizes to the top 10 participants! ANTI-GRAV RACERS Z-RACE isn't complete without our unique set of high-speed anti-grav racers. With limitless potential, these racers and their shiny finishes can get you from one end of a track to another in no time. You might see some familiar faces and names on them, too. We want Z-Race to feel like it is part of the VR universe, which means you'll see other parts of the VR world become a part of ours. FULLY IMMERSIVE AUDIO What's a VR racing experience without some intense music to keep the heart rate up? We've carefully selected the in-game music to assure that you as a player will feel the pace of the game pumping through your veins. You'll feel the pressure mounting as the music's intensity elevates and won't back down. We've also included a unique coach for each anti-grav racing team, featuring the voices of some of your favorite VR personalities! TRACKS Our Z-RACE hyper tunnels are built from the ground up with two things in mind: make them look good, and make sure that players can go fast in them. Each new design stems from a new inspiration. Whether that's the far reaches of outer space, the heavens above, or frozen arctic tundra. Z-RACE is sure to bring you to all corners of the universe in your exciting and fast-paced journey.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1343750/header.jpg?t=1652703937",
    "Price": 14.99,
    "Developers": "XOCUS",
    "Publishers": "XOCUS",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1343750/ss_660d1ca442a0ac3cc12a6fc3a2f45830a262284a.1920x1080.jpg?t=1652703937,https://cdn.akamai.steamstatic.com/steam/apps/1343750/ss_45ba27a9867df834258e447657e8cf4695fb8ab5.1920x1080.jpg?t=1652703937,https://cdn.akamai.steamstatic.com/steam/apps/1343750/ss_67173ef0816bd8669d6399e85e29c84ef1684929.1920x1080.jpg?t=1652703937,https://cdn.akamai.steamstatic.com/steam/apps/1343750/ss_4ef8b057e17056f55c5baa9ddf4b8d8e3631d5c3.1920x1080.jpg?t=1652703937,https://cdn.akamai.steamstatic.com/steam/apps/1343750/ss_3c1ac1b488cdbdfba9460785f9d3a097afa21183.1920x1080.jpg?t=1652703937,https://cdn.akamai.steamstatic.com/steam/apps/1343750/ss_7b17c2c0543378a6dd2683fb7a42e39c664384b7.1920x1080.jpg?t=1652703937,https://cdn.akamai.steamstatic.com/steam/apps/1343750/ss_eb13d74b1ed0bf692b5d3079435bae58780b8f3c.1920x1080.jpg?t=1652703937",
    "Slug": "z-race",
    "Meta Title": "Z-Race: Dec 10, 2021, XOCUS and Full Overview",
    "Meta Description": "Looking for information on Z-Race? Check out the release date (Dec 10, 2021), developer insights from XOCUS, and a complete game summary.",
    "Alt Text Image": "Official header image for Z-Race game - Steam 1343750",
    "Canonical URL": "https://gusku.site/game/z-race",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Z-Race\", \"description\": \"Looking for information on Z-Race? Check out the release date (Dec 10, 2021), developer insights from XOCUS, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"XOCUS\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"XOCUS\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1343750/header.jpg?t=1652703937\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}