{
    "AppID": 1095260,
    "Name": "Airtight City 密闭之城1.0",
    "Release date": "Jul 8, 2021",
    "About the game": "Special Thanks Thank you very much for the generous help of the following friends. Let my game support languages other than Chinese. You have given me great spiritual power, allowing me to be more motivated to make better games. Thank you~~~~ Italian translation - DavideEDN Italian translation - Mr Froby Special Note Due to insufficient funds, I had to sell this old version. The income generated will be used to maintain the development of [Airtight City 2.0]. Whether the game is fun is the only criterion for supporting it. 1.0 The process is short, even after customs clearance, there is still time to refund. Thank you for your attention and tolerance. I will continue to work hard to let everyone witness my progress. The reason for selling this version Hello everyone, I am an independent game producer.Airtight City 1.0 is my maiden game work. This game landed on the Steam platform for a free trial one and a half years ago. Won a relatively good game evaluation. But more importantly, the various problems exposed in the game gave me a deep understanding of the serious shortcomings of my own ability. I did not choose to continue developing this novice-level work. Instead, it made a series of very bold or irrational decisions. I archived most of the content of this project, and only extracted its main program architecture. And started a new round of development process. Project Airtight City 2.0 In the next 15 months, [1] I refactored more than 50% of the core code in the game, so that the internal stability and scalability of the game have been significantly improved. [2] Learned modeling and material production from scratch, and rebuilt all scene models in the game. Try to get rid of the cheap splicing texture of independent 3D games. [3] Refactored the game's plot setting and planning copywriting, allowing the game to obtain more original content. [4] 100% refactoring and upgrading have been carried out for the operation feel / shooting feel / light and shadow effect / interface design. Today's Airtight City 2.0 project has completed 90% of the main function production, and part of the scene construction. Laying out the game plot will be the main work direction for the next one to two years. Through more than a year of project reconstruction and systematic learning. At this time, both the game effect and my ability itself have been qualitatively improved. However, no matter how full the ideal is, it must be reflected in the reality. My development funds have been exhausted. It's hard to maintain my development career. So I can only sell this little game on the Steam platform, hoping to generate some income and help me maintain my dream. Hope this can help me through the difficulties. All the above English translations are from Google. We speak different languages and live in different countries. But in the gaming world, we are the same people. thank you all.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1095260/header.jpg?t=1629774466",
    "Price": 1.99,
    "Developers": "豆丁儿独立游戏工作室",
    "Publishers": "Little Bean Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1095260/ss_23c94ad3322ff5cd0c3a142904873cbc4155f060.1920x1080.jpg?t=1629774466,https://cdn.akamai.steamstatic.com/steam/apps/1095260/ss_49572157430de179be5cfc530547b080c633259b.1920x1080.jpg?t=1629774466,https://cdn.akamai.steamstatic.com/steam/apps/1095260/ss_e052e51a3ad5af883f9060087f5ca20600dfb088.1920x1080.jpg?t=1629774466,https://cdn.akamai.steamstatic.com/steam/apps/1095260/ss_97a0156512b1f6b181251ed49aaf5871575f45f8.1920x1080.jpg?t=1629774466,https://cdn.akamai.steamstatic.com/steam/apps/1095260/ss_76c4352209fc54d86f25a1402af3fadd13c6a4a7.1920x1080.jpg?t=1629774466,https://cdn.akamai.steamstatic.com/steam/apps/1095260/ss_39350983018e426e4e95ea35f65b19815bf0ed92.1920x1080.jpg?t=1629774466,https://cdn.akamai.steamstatic.com/steam/apps/1095260/ss_5880c9cd96e2d397d2f854e237922743fe35efe9.1920x1080.jpg?t=1629774466,https://cdn.akamai.steamstatic.com/steam/apps/1095260/ss_a41be9b94df79b649f1b1ef165c52f5d30975e94.1920x1080.jpg?t=1629774466,https://cdn.akamai.steamstatic.com/steam/apps/1095260/ss_d40d84976d810cf6445f6cf8d74de61ff3c0e715.1920x1080.jpg?t=1629774466",
    "Slug": "airtight-city-1-0",
    "Meta Title": "Airtight City 密闭之城1.0: Jul 8, 2021, 豆丁儿独立游戏工作室 and Full O...",
    "Meta Description": "Looking for information on Airtight City 密闭之城1.0? Check out the release date (Jul 8, 2021), developer insights from 豆丁儿独立游戏工作室, and a complete game summ...",
    "Alt Text Image": "Official header image for Airtight City 密闭之城1.0 game - Steam 1095260",
    "Canonical URL": "https://gusku.site/game/airtight-city-1-0",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Airtight City \\u5bc6\\u95ed\\u4e4b\\u57ce1.0\", \"description\": \"Looking for information on Airtight City \\u5bc6\\u95ed\\u4e4b\\u57ce1.0? Check out the release date (Jul 8, 2021), developer insights from \\u8c46\\u4e01\\u513f\\u72ec\\u7acb\\u6e38\\u620f\\u5de5\\u4f5c\\u5ba4, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 8, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u8c46\\u4e01\\u513f\\u72ec\\u7acb\\u6e38\\u620f\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Little Bean Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1095260/header.jpg?t=1629774466\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}