{
    "AppID": 1169780,
    "Name": "Ambienz",
    "Release date": "Dec 18, 2019",
    "About the game": "Ambienz: States of Mind is a vision quest experience through worlds of seemingly endless variety and moods. Choose how you’re feeling when you start, and you’ll be floating through procedurally-generated spaces, with an AI composer generating music to accompany you. Every experience is unique. Find and collect gems, evade and hide from enemies in challenges against time, or enter zen mode and fly and float in complete freedom.It’s hypnotic and entrancing. It’s all about your state of mind. FOR ANYONE It’s an open journey where the interface is simple and intuitive. Made for all ages and experience levels. CHOOSE YOUR STATE OF MIND On launching, the experience will ask you, “How are you feeling right now?” Your answer will plunge you into environments that match the mood you’re in, and slowly, world-by-world, let you experience a progression of other states of mind. DIVERSE CONTENT Fly and float through spaces simple and complex, colorful and rich, and inspired by a myriad of aesthetics and styles. The worlds are procedurally generated, which means there’s no end to the number of possibilities that await you. HYPNOTIC MUSIC The AI composer adapts to your chosen state of mind and comes up with the appropriate music to guide you along your vision quest. Letter from the publisher: Hi there, this is the publisher. Thanks for buying Ambienz, we hope you enjoy the experience. We wanted to let you know some of the background behind this game and why we chose to publish it. It was developed by just two people. Byron, a very experienced game developer in the UK who’s worked for games studios like EA, Sega, and Lionhead, and Joseph, a Professor working at a school in the USA teaching game development to the next generation of game developers. In other words, this wasn’t made by some faceless corporation pumping out mass market games but an artisanal approach to game development, made by hand by two people who cared about it a lot. Byron wrote the code while Joseph designed the levels. Joseph is a child of the 60’s, which might go some way to explain some of the ‘trippier’ levels. To both of them, Ambienz is an attempt at providing an antidote to the turmoil and hate that the world seems to be going through at the moment. It’s designed to be something you can pick up and chill out to rather than be fast paced and adrenaline-filled. You won’t find any violence in this game, just abstract procedurally generated levels to explore and relax in. One of the other reasons we decided to publish this game was the technology behind it. On the outside it may look humble but on the inside there’s a lot going on. Each level is procedurally generated which means technically, if you wanted to, you could go on playing forever. Then there’s the music. It sounds simple but the music is being composed in real-time using an ‘AI’ procedural music generator. It’s like having a live musician improvising a tune right next to you - that’s what the music generator in Ambienz is doing. It’s impressive technology. So, we hope you enjoy it and if you do, please leave us a review!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1169780/header.jpg?t=1605059214",
    "Price": 9.99,
    "Developers": "Byron Atkinson-Jones,Joseph Jolton",
    "Publishers": "Joseph Jolton",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1169780/ss_38b7f67eb679049de461b54148288959ee87fd7a.1920x1080.jpg?t=1605059214,https://cdn.akamai.steamstatic.com/steam/apps/1169780/ss_03d03e4bc5292441246a62876da1cf4caa267212.1920x1080.jpg?t=1605059214,https://cdn.akamai.steamstatic.com/steam/apps/1169780/ss_3a550c4c8ac45584c15d9c7eb837190652fe223e.1920x1080.jpg?t=1605059214,https://cdn.akamai.steamstatic.com/steam/apps/1169780/ss_7c2828866b860083009e43f23d81c3183902a781.1920x1080.jpg?t=1605059214,https://cdn.akamai.steamstatic.com/steam/apps/1169780/ss_a638d215067386361309efd8fc472202df67ca49.1920x1080.jpg?t=1605059214,https://cdn.akamai.steamstatic.com/steam/apps/1169780/ss_713092e7c76793b31b938b7c4d785b5194a73b9a.1920x1080.jpg?t=1605059214,https://cdn.akamai.steamstatic.com/steam/apps/1169780/ss_ce5af23a75b929c16eeaf756a61087341c1428fe.1920x1080.jpg?t=1605059214,https://cdn.akamai.steamstatic.com/steam/apps/1169780/ss_6788b67d178067221ca0db36ba39803cbf53e21f.1920x1080.jpg?t=1605059214,https://cdn.akamai.steamstatic.com/steam/apps/1169780/ss_b37a473cd76b1def96d5be4b8c55d21162a61c0c.1920x1080.jpg?t=1605059214",
    "Slug": "ambienz",
    "Meta Title": "Ambienz: Dec 18, 2019, Byron Atkinson-Jones,Joseph Jolton...",
    "Meta Description": "Looking for information on Ambienz? Check out the release date (Dec 18, 2019), developer insights from Byron Atkinson-Jones,Joseph Jolton, and a complet...",
    "Alt Text Image": "Official header image for Ambienz game - Steam 1169780",
    "Canonical URL": "https://gusku.site/game/ambienz",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ambienz\", \"description\": \"Looking for information on Ambienz? Check out the release date (Dec 18, 2019), developer insights from Byron Atkinson-Jones,Joseph Jolton, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 18, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Byron Atkinson-Jones,Joseph Jolton\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Joseph Jolton\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1169780/header.jpg?t=1605059214\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}