{
    "AppID": 1576720,
    "Name": "Armageddon Empires",
    "Release date": "Apr 16, 2021",
    "About the game": "NOTICE: This game was originally published in 2007. The screen resolution is fixed at 1024 by 768 and best played in a windowed mode. A full screen executable is included in the game's installation folder; it will stretch to fit wide screen monitors. Incudes: Cults of the Wasteland and Tip of the Spear expansions. Armageddon Empires is a computer turn based strategy game that takes the best elements of collectable card games (don’t worry there are no cards to chase you get them all), board games, and computer games and brings them all together to provide a unique interactive strategy war game experience. You can choose a normal size map and battle in a death match with a single AI opponent finishing within an hour or select a huge map and slug it out with the other 3 factions in a game of epic proportions. Players start by choosing one of four factions and building their playing decks. Each faction has its own play-style, strengths and weaknesses. There are 7 main card types: Heroes, Units, Facilities, Attack (Aircraft, Helo/Hover and Missile), Attachments, Munitions, Tactics. The game map is created randomly each time you play and seeded with resources and independent units and facilities. Your cards are played by drawing on your resource stockpiles. 4 basic resources are necessary to build your empire in the harsh new world. Humans, Materials, Energy and Technology are all strewn across the playing board. Some are concentrated in the ruins of human cities; others are found in the junk heaps of forgotten battlefields or simply lying buried in the vast wastes. Once the game is underway, you will want to deploy your heroes and units and explore the map. Some hexes will contain resources; some will harbor independents. These units and facilities range from human slavers, raiders and mercenaries to alien warlords, rogue machine masterminds and mutated monsters. Depending on your faction some will offer to join your cause (maybe for a price) while others will fight you to the death. With the map scouted out, your enemies located and your armies formed up, you will want to unleash the dogs of war. Everything costs Action Points, so plan your moves well. You might want to use some air power to soften up the enemy first. Attack cards are played from your hand and can strike enemy armies within range of your stronghold and outposts. Drag the Aircraft, Missile or Helo (Hover Ship) card and drop it on an enemy formation and the battle is joined. Your card’s attack strength is represented by die on the horizontal rolling area. The target’s defense strength is represented below yours by the die on the lower rolling area. Each die has 3 sides with the faction’s symbol denoting a success and 3 sides that are blank denoting failure. Both players roll their dice, count up their successes and then try and modify the results. Some aircraft as well as all heroes have fate points they can spend to re-roll Air to groundany die that failed. Tactic cards can be played to drastically change the results…add positive die to your pool, re-roll opponent’s die, turn them to failures, or even remove them. If the attacker rolls higher than the defender then the difference is applied as damage. Armies are represented by rectangular playing pieces on the board. Each army can contain 1 hero and up to 8 units (cards) but you will have to be careful not to exceed your hero’s command rating or their attack, defense and movement will suffer. When two non-stealthed armies meet in a hex a battle ensues. These battles can encompass multiple stacks of armies so you are first given the chance to determine the order in which they will fight. Battles are army versus army until one side is destroyed, gutted (only a leader remains) or retreated by their owner. The player remaining on the battle field with a combat capable army is the winner and gains control of the hex. Any surviving defeated units are subjected to a retreat attack if they opted to retreat and their heroes may be captured or killed in the rout. Capturing enemy heroes is particularly advantageous as they are interred in the nearest friendly stronghold or outpost and generate 1 bonus Action Point per player turn. Ground Combat is a brutal affair. Just like air attacks, your card’s attack strength is represented by die on the horizontal rolling area. The target’s defense strength is represented below yours by the die on the lower rolling area. Both players roll their die, count the successes and then try and modify the results. If the attack roll is greater than the defense roll then the difference is applied as damage to the defender. Once a unit attacks or performs a special ability it is marked as committed and may not take any further actions until the next round. Players take turns attacking or playing abilities until the end of the round is reached. Both players then have the chance to assess the situation and either withdraw the currently active armyground combat (each unit is subjected to a free attack), retreat all armies (again a free attack is taken as well as a capture/kill attempt for any heroes without units in their army) or continue the fight. If both sides elect to retreat than no free attacks are taken. To win the struggle for the wasteland you must occupy or destroy each of your enemies’ strongholds. It sounds simple enough but there are many paths to achieve that objective. You can wage a brutal straight forward ground campaign, develop a secret weapon in your laboratories and vaporize your enemy, or use stealth and sabotage to eliminate your enemy. The choice is up to you but keep in mind your enemies will be moving against you as well. All it takes is one good nuke to ruin your day.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1576720/header.jpg?t=1618584989",
    "Price": 9.99,
    "Developers": "Cryptic Comet Games",
    "Publishers": "Cryptic Comet Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1576720/ss_6eef6cc9bb187d3024c6cb7521ba3ddd32714304.1920x1080.jpg?t=1618584989,https://cdn.akamai.steamstatic.com/steam/apps/1576720/ss_4723f72ce263d8f6d832be750825f14410fad219.1920x1080.jpg?t=1618584989,https://cdn.akamai.steamstatic.com/steam/apps/1576720/ss_7cf27ff3099425ec5374829b7d8558fc154763bb.1920x1080.jpg?t=1618584989,https://cdn.akamai.steamstatic.com/steam/apps/1576720/ss_8b0ec6ec4516ebdf645cf90e3bd6dc948118bf10.1920x1080.jpg?t=1618584989,https://cdn.akamai.steamstatic.com/steam/apps/1576720/ss_7733a48a08432b91d3937925bc3898a97b77db1b.1920x1080.jpg?t=1618584989,https://cdn.akamai.steamstatic.com/steam/apps/1576720/ss_599a7cb25f8a9f97b23772d97e1830b3403f7d7e.1920x1080.jpg?t=1618584989,https://cdn.akamai.steamstatic.com/steam/apps/1576720/ss_487ccd6dc028547540b1b6d89068c2cf5b3e70d8.1920x1080.jpg?t=1618584989,https://cdn.akamai.steamstatic.com/steam/apps/1576720/ss_c187188ba8e44b81770f0ba9a437cadcc232a649.1920x1080.jpg?t=1618584989",
    "Slug": "armageddon-empires",
    "Meta Title": "Armageddon Empires: Apr 16, 2021, Cryptic Comet Games and...",
    "Meta Description": "Looking for information on Armageddon Empires? Check out the release date (Apr 16, 2021), developer insights from Cryptic Comet Games, and a complete ga...",
    "Alt Text Image": "Official header image for Armageddon Empires game - Steam 1576720",
    "Canonical URL": "https://gusku.site/game/armageddon-empires",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Armageddon Empires\", \"description\": \"Looking for information on Armageddon Empires? Check out the release date (Apr 16, 2021), developer insights from Cryptic Comet Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cryptic Comet Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cryptic Comet Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1576720/header.jpg?t=1618584989\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}