{
    "AppID": 1259570,
    "Name": "Around the Fire",
    "Release date": "Mar 20, 2020",
    "About the game": "Just as in life, we don't know everything - we must learn. You are thrown into the world, knowing nothing, nothing at all. As more and more attempts go by slowly you begin to evolve your knowledge. Until you are able to actually do something. Use common sense, and you should find its not difficult. As always in life, unless you have some very serious medical condition, there are no health bars. No tutorials, no heads up displays, nothing. When you die, that's it, game over; get better or something I don't know. So here's the thing, the game is a story being told, 'around the fire', each attempt is a new story from which you gain knowledge and experience to further progress next time. The game visuals are what you 'imagine' as the story is told. The artwork is just fits the theme of cave people and whatnot. Features A randomly generated wilderness to explore, so every game is new. A wide variety of animals to encounter through out your journey Hunt, or be hunted by the fauna Interact with the flora Fun sounds. Cave painting like art style. Changing weather to assist or hinder your situation. Trees and swaying in the wind Custom colours Needlessly long credits Caves. and more. Controls WASD - move Shift - sprint Q - Drop held item/Throw held item E - Pick up/Craft X - Communicate/Puke or whatever Left Mouse - Attack/Use Item Middle Mouse - Inspect As per real life, there is no crafting menu. Crafting is done by carrying an item, and bringing it to other items with intention to craft with. Hold down the craft button, and it can be accelerated by clicking the attack button. Animals can be tamed. Spending time with animals, such as wolves, then not being eaten by them. They will begin to be more domesticated and eventually be pets for you. Find other humans. Doing well, making a well established settlement and having food supplies. This may attract more humans that will help you in your hunts. Destroying nature is cruel. If you want to cut down a tree, don't use your fists, it will hurt you more than it hurts the tree. I recommend finding a tool or, you know, something. Food is found by both slaughtering animals and harvesting plants. Food can deteriorate and will attract wildlife, better eat it quickly. It can also be cooked to provide a healthier meal. Just, don't die Death comes in many forms. Make sure to eat, stay warm, don't mauled to death, and just - be smart. Play the flute Find, or craft a flute. And play it, see what happens... The rest is up to you...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1259570/header.jpg?t=1584687763",
    "Price": 6.99,
    "Developers": "Sean Marty",
    "Publishers": "Sean Marty",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1259570/ss_f589de24387e20bdd099f689eb89d8dd3e157c78.1920x1080.jpg?t=1584687763,https://cdn.akamai.steamstatic.com/steam/apps/1259570/ss_29e1a4b094404be0e7905af103c1f82a76e86980.1920x1080.jpg?t=1584687763,https://cdn.akamai.steamstatic.com/steam/apps/1259570/ss_fb424b02fc6d11061361103bd47e213d6266bcb4.1920x1080.jpg?t=1584687763,https://cdn.akamai.steamstatic.com/steam/apps/1259570/ss_f65ebc837add7fb7e9b75ab05ed6407414eaea7a.1920x1080.jpg?t=1584687763,https://cdn.akamai.steamstatic.com/steam/apps/1259570/ss_116a2bd49650b603464ef31bc49a349336835ed0.1920x1080.jpg?t=1584687763",
    "Slug": "around-the-fire",
    "Meta Title": "Around the Fire: Mar 20, 2020, Sean Marty and Full Overview",
    "Meta Description": "Looking for information on Around the Fire? Check out the release date (Mar 20, 2020), developer insights from Sean Marty, and a complete game summary.",
    "Alt Text Image": "Official header image for Around the Fire game - Steam 1259570",
    "Canonical URL": "https://gusku.site/game/around-the-fire",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Around the Fire\", \"description\": \"Looking for information on Around the Fire? Check out the release date (Mar 20, 2020), developer insights from Sean Marty, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sean Marty\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sean Marty\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1259570/header.jpg?t=1584687763\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}