{
    "AppID": 603100,
    "Name": "ATOMINE",
    "Release date": "May 4, 2017",
    "About the game": "Atomine is a twin stick procedural shooter rogue-lite set in a virtual world with minimalist design, where the player recounts on the screen the real events of STUXNET, the first weapon ever created in the form of computer virus. In every run the player has to clear the level area from all the enemies in order to unlock the portal to the next level. During the run every killed enemy will leave on the ground XPs, energy and/or weapon modules. Fast and Fun Atomine is fast. There are a lot of enemies and you have to kill all of them to complete the levels. But don't worry, you have infinite ammo and a (great) modular weapon system. Weapon System In Atomine the player can modify his weapon using special modules that can be find in the game. The modules have effect to specific parts of the weapons: type of bullet, number of bullets, rate of fire and other mutators. Procedural Generated / Roguelite The world of Atomine is composed by levels procedurally-generated. Every level has different type of enemy and environment. The player has to complete all levels with only one life. If Atomine is destroyed, the game is over. Counter Hacking During a run, the system can detect the intrusion and modify the game, so player must act quickly! If the player fails to hijack the counter hacking maneuver, the challenge will become really tough. Boss Battle There are not only 'small' enemies. Atomine must also defeat big and powerful bosses. In 2011, Sergey Ulasen, discovered STUXNET, a malicious computer worm, initially spreaded via Microsoft Windows, and targeted Siemens industrial control systems, defined as a sleeping threat, waiting for a trigger to start its activation. STUXNET is the first discovered malware that spies on and subverts industrial systems, and the first to include a programmable logic controller (PLC) rootkit. The worm has been founded infecting especially nuclear power plants and oil drilling systems. Atomine, like STUXNET, is a virus who needs to get stronger in order to reach and eventually infect and compile itself into the target source code. The electronic voice in the background and many element on screen, tell to the player what's the target of the run. Unique Weapon System: The player can program his/her own Weapon that better fits the personal gameplay style. Every run is different and procedurally generated. Tons of unlockable items, enemies, bosses and more. Steam Trading Card Controller Support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/603100/header.jpg?t=1645020115",
    "Price": 0.99,
    "Developers": "Broken Arms Games",
    "Publishers": "Broken Arms Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/603100/ss_5f3794d9e90df612a1d6c91f57c586e7d493db86.1920x1080.jpg?t=1645020115,https://cdn.akamai.steamstatic.com/steam/apps/603100/ss_21011d3c6cc947d0858004a79e1c019df15facdb.1920x1080.jpg?t=1645020115,https://cdn.akamai.steamstatic.com/steam/apps/603100/ss_63963bb1142bc999c074c6e18741c9778888d649.1920x1080.jpg?t=1645020115,https://cdn.akamai.steamstatic.com/steam/apps/603100/ss_ec667d33e5f62f3152b9f45ce98f74c3cba91c3f.1920x1080.jpg?t=1645020115,https://cdn.akamai.steamstatic.com/steam/apps/603100/ss_fbb09bbc7cc8b8081e5395517c983dd5a14d67fa.1920x1080.jpg?t=1645020115,https://cdn.akamai.steamstatic.com/steam/apps/603100/ss_82903035e244180be3b8bafba807d1e3cb44f953.1920x1080.jpg?t=1645020115,https://cdn.akamai.steamstatic.com/steam/apps/603100/ss_e99eace11e1f8f36bf2b7a9803b8346d7f99683f.1920x1080.jpg?t=1645020115,https://cdn.akamai.steamstatic.com/steam/apps/603100/ss_3ae1c1a24ceecb07939c3b2c90818502f1f8062b.1920x1080.jpg?t=1645020115",
    "Slug": "atomine",
    "Meta Title": "ATOMINE: May 4, 2017, Broken Arms Games and Full Overview",
    "Meta Description": "Looking for information on ATOMINE? Check out the release date (May 4, 2017), developer insights from Broken Arms Games, and a complete game summary.",
    "Alt Text Image": "Official header image for ATOMINE game - Steam 603100",
    "Canonical URL": "https://gusku.site/game/atomine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ATOMINE\", \"description\": \"Looking for information on ATOMINE? Check out the release date (May 4, 2017), developer insights from Broken Arms Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 4, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Broken Arms Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Broken Arms Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/603100/header.jpg?t=1645020115\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}