{
    "AppID": 685910,
    "Name": "Battlefleet Engineer",
    "Release date": "Aug 18, 2017",
    "About the game": "Battlefleet Engineer is a game about smart ship design, fleet composition and tactical control in real-time battles. Fully physics-based movement, detailed damage model, and ship resource system make designing ships an engineering puzzle where you need to compromize between maneuverability, defence and firepower. This leads to interesting emergent behaviors and specialized ship designs that counter others, providing endless combinations and possibilities. In the battles you need to choose and time your engagements carefully, exploiting your fleet's advantages against the enemy and countering theirs. If you are more casually inclined, the game comes with a library of ready-made ship designs to use in randomized and custom battles. You can be watching ships tear each other apart or flying around shooting at enemies yourself with just a few clicks. Features RTS-style battles with up to dozens of ships per side. Doesn't include building of units or resource management mechanics. Ships are made of and entirely defined by their modules. The modules such as generators, thrusters, weapons, armor etc. form the structure and define the behavior of the ship. Ships can have anywhere between 5 to over 1000 modules. Detailed damage model that simulates armor plates and tracks damage to armor segments and each module individually. Ships can get partially disabled and split in two. Projectiles can penetrate or ricochet from armor then pass through multiple modules or whole ship, shields are volumetric instead of simple barriers etc. Ship and level editors. Create new ship designs and levels from scratch or by editing any that come with the game using in-game editors. No-cheating Newtonian physics. All movement is driven by forces from thrusters and other actuators, and there is no friction or dampening. Ships and other objects are simulated as rigid bodies with accurate collision geometries and inertia. Ship resource system. Most modules have a single function such as power generation or heat dissipation. The resource system gathers, stores and distributes resources such as electricity, heat and fuel between modules on every frame. This makes the ships' fire rate, shields and maneuverability dynamic. Gameplay Designing efficient (or wacky) ships is an important part of the game, but it is not required. Setting up random and custom battles is made easy, and your ships have basic combat AI so the game can also be played very casually. During battle you can also take full or partial control over any one of your ships to fly them manually, fire weapons etc. You can design and test ships, then use them in premade challenge levels that give a score when completed, or in custom battles where you define the fleets and level parameters. The game is single player only against a combat AI in independent battles. Progression mechanics from battle to battle are not yet implemented. To defeat your enemy, you will need to keep on top of the rapidly evolving combat situation and select targets for your ships based on weapon ranges, maneuverability and defences of both your own and the enemy ships. Positioning and timing of engagements is important because different weapons have very different effective ranges and ships usually only have heavy armor at the front. Keeping your fleet close together maximizes your concentrated damage output, but risks getting surrounded by the enemy. Using specialized ships such as 'tanks' and 'snipers' effectively can often decide the outcome of the battle. Current content Over 35 premade ship designs. 12 handmade challenge levels. These include fleet design challenges for different kinds of battles, tactical fighting using a single ship, and flying with manual control through obstacle courses. 13 distinct module types (+variants), each with specific purpose. 5 distinct weapon types.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/685910/header.jpg?t=1568792763",
    "Price": 11.99,
    "Developers": "Tomi Syväjärvi",
    "Publishers": "Tomi Syväjärvi",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/685910/ss_4f247088a7e0ea947788577271bdb66db4e175ed.1920x1080.jpg?t=1568792763,https://cdn.akamai.steamstatic.com/steam/apps/685910/ss_1755223b31c5277d7693b000402ebc3104849267.1920x1080.jpg?t=1568792763,https://cdn.akamai.steamstatic.com/steam/apps/685910/ss_2f8e146f789bd8d59ea813cb56a5e224778beb43.1920x1080.jpg?t=1568792763,https://cdn.akamai.steamstatic.com/steam/apps/685910/ss_9eec9aa61b8fbd74219b900e1852343227a07b44.1920x1080.jpg?t=1568792763,https://cdn.akamai.steamstatic.com/steam/apps/685910/ss_44953d7dde19b7b870780c704085c5d5c51f8916.1920x1080.jpg?t=1568792763,https://cdn.akamai.steamstatic.com/steam/apps/685910/ss_ebeaddaf8db5793fc9fac7d521c59b19be0af955.1920x1080.jpg?t=1568792763,https://cdn.akamai.steamstatic.com/steam/apps/685910/ss_bf6384f633a59388a8f36ef295690c8c148f4469.1920x1080.jpg?t=1568792763,https://cdn.akamai.steamstatic.com/steam/apps/685910/ss_8f6cb3bddb5f079e9e142ac13d5d16ac95d5654d.1920x1080.jpg?t=1568792763,https://cdn.akamai.steamstatic.com/steam/apps/685910/ss_1fb88154add34d0de7c68748c996098f03d871c6.1920x1080.jpg?t=1568792763",
    "Slug": "battlefleet-engineer",
    "Meta Title": "Battlefleet Engineer: Aug 18, 2017, Tomi Syväjärvi and Fu...",
    "Meta Description": "Looking for information on Battlefleet Engineer? Check out the release date (Aug 18, 2017), developer insights from Tomi Syväjärvi, and a complete game ...",
    "Alt Text Image": "Official header image for Battlefleet Engineer game - Steam 685910",
    "Canonical URL": "https://gusku.site/game/battlefleet-engineer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Battlefleet Engineer\", \"description\": \"Looking for information on Battlefleet Engineer? Check out the release date (Aug 18, 2017), developer insights from Tomi Syv\\u00e4j\\u00e4rvi, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 18, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tomi Syv\\u00e4j\\u00e4rvi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tomi Syv\\u00e4j\\u00e4rvi\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/685910/header.jpg?t=1568792763\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}