{
    "AppID": 865980,
    "Name": "BOSSGARD",
    "Release date": "May 21, 2020",
    "About the game": "WHO’S THE BOSS? Well, it’s finally you! So grab your friends and get ready for the craziest fights in our fast-paced asymmetrical multiplayer game. The meanest? The baddest? The silliest? Choose from a variety of unique bosses that are yours to command! Strike fear in your enemies as a mighty fortress or keep them on edge as an angry slice of bread, it all depends on how bossy you feel today! Or perhaps you're more of a team player and slaying giants is your business. Say no more, we have you covered. Join a party of Vikings and take on the nastiest titans you've ever seen. Just make sure you help your buddies, healing, protecting, buffing them, releasing minions and laying down turrets when necessary! Being the big bad guy feels great! A 1 v 5 asymmetrical multiplayer game, where we pit ONE BIG PLAYABLE BOSS against a colorful cast of cartoony Vikings Supports up to 6 players! We hope you brought company because Bossgard is best played on a crowded couch or over noisy online multiplayer sessions! Support for both online and local multiplayer Play in any combination you want! From local party set-ups to online matches with friends (or friends-to-be), Bossgard is best played with others! Couch Versus Couch support You and your friends can play locally against or with online players! Bot support No friends? No problem! Our bots are more than capable of giving you a hard time? Too hard? No worries, their difficulty can be scaled up or down! Unique bosses with distinct mechanics Each Boss looks, plays and feels completely different. What would you rather be? A cyclopean slice of toast? Maybe a giant evil plunger? Minions, traps, special powers The Boss can employ a large array of weapons and tricks against the Vikings. Nobody said this was going to be fair. Party composition is key Healing powers, turrets, shields, buffs , each Viking has its own ability on top of which they can choose a Rage attack, basically forming a 'class' Team synergy The Vikings' abilities are designed to work together. Shield that healer long enough till the whole team is brought back for one last final assault against the Boss. Vikings from all around the world These warriors hail not just from the North, but from everywhere else as well! Canadian, Jamaican, British and Japanese Vikings are just some of the warriors building up an already bright and colorful roster. Keyboard &amp; Mouse or Gamepad, it's up to you! We really want you to be able to play Bossgard in any way you want. Travel to colorful, foreign lands... ...and make a beautiful mess! Sharks, streams of hot coffee and alien plasma cannons will stand between the Vikings and the Boss. Each arena comes with its own theme, soundtrack and Boss-controlled trap! Streamer friendly! Are you a streamer? Great! Bossgard comes with built-in stream-specific mechanics! Let your followers join the battle, allowing them to deal damage, aid or even drop in minions to fight for whomever the audience dictates! Community-driven design We have big dreams for Bossgard and that includes having you guys helping us shape future content! New Bosses, Vikings, Maps and Traps, our vision is that of turning the design process into an open, collective, community-focused one No paid DLC, no microtransactions, no lootboxes By Thor, we'll keep Bossgard growing, but we won't ever hide new content behind paywalls. Regular updates We love this project and we want to take it places, as soon as possible! New content such as Bosses, Vikings, Maps, Traps and even game modes are already on our production line. It looks pretty The world of Bossgard is bright, varied and alive! We worked extra hard to deliver a colorful and polished experience! But enough chit-chat, what we ask is that you jump in, pick a character and...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/865980/header.jpg?t=1590135170",
    "Price": 19.99,
    "Developers": "Sand Sailor Studio",
    "Publishers": "Sand Sailor Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_a78022fee068aac726b16f1697743e308ff920b6.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_bbf4f86ea4442f7195fccb9fca34671b458a3a79.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_b3e9f79693c5471f9ee401cc953b99f3b140a061.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_62c2e731d355d61e00df8563645e3b1825cce7df.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_872a02de4e4eb9a9bc01411015da581abac7bcc7.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_a78c21221f8d7b2905747b3c7330181dc8636759.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_2cd47059307682840a0db901e8e7942d42b04b9a.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_bca30382fafd01f35cebafda895f7c2a498e07b1.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_5cea9e4a2bb8d40a15d0adf0e5b0a131cf603b3c.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_e075586632035fbeda8a0b75799236f34af2731a.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_897a0ba24aeec0b4a26ffe663696aadf60d4fb31.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_1ec0196a00bd414e97d536464b78e7d3c15a28f2.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_ecacb76ec2bbf514ac42561c5ea2a2cc90689407.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_e67fe4b7e0edb51d7ad5d8e5d6f7ed428363764c.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_11aec53065fed38ca253fd00c211db6cd768455e.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_c8b2467d00cbea84d5b97320142367b0f89f0c59.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_86409f1d3daca8808f150f1f67096797e6d70537.1920x1080.jpg?t=1590135170,https://cdn.akamai.steamstatic.com/steam/apps/865980/ss_472ee32df2e6b2d25026131a65bdcaa7ee4d88d0.1920x1080.jpg?t=1590135170",
    "Slug": "bossgard",
    "Meta Title": "BOSSGARD: May 21, 2020, Sand Sailor Studio and Full Overview",
    "Meta Description": "Looking for information on BOSSGARD? Check out the release date (May 21, 2020), developer insights from Sand Sailor Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for BOSSGARD game - Steam 865980",
    "Canonical URL": "https://gusku.site/game/bossgard",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BOSSGARD\", \"description\": \"Looking for information on BOSSGARD? Check out the release date (May 21, 2020), developer insights from Sand Sailor Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sand Sailor Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sand Sailor Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/865980/header.jpg?t=1590135170\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}