{
    "AppID": 1828700,
    "Name": "Celestial Project",
    "Release date": "Jun 21, 2022",
    "About the game": "Celestial Project Discord Discord: Roguelike, WarChess &amp; SCI-Cartoon 'Celestial Project' is a Roguelike WarChess game. It is the first game of the story 'Celestial'. In 2069, unknown alien creatures from space suddenly attacked the Earth, killing more than half of the population of major cities in the world within seven days. The governments and giant technology companies of various countries on the earth have decided to invest all human resources to build five giant starships that can propagate civilization before the human population is extinct, so as to spread the human kind of fire into the universe. Command the role to defend the starship Players choose to command the special operations forces of the Human Revolutionary Federation, the White Bear Heavy Industry and the UNION. There are currently a total of 9 different roles, forming a three-person team. Take the shuttle to fight the alien creatures on the earth and destroy them before the alien creatures destroy the built starship! Defend the completion of five giant starships and set sail. Every battle takes place on a 9x9 war chess map. Commanding roles make full use of terrain obstacles and equipment characteristics to complete battles that win more with less. More than 24 types of equipment The game contains four different types of weapons, including sharpness, skill, reloading, and science, as well as general props and equipment, with a total of more than 24 types. There are also hidden weapons produced by capturing alien creatures. Each character can carry two weapons into battle, and arm the squad through a reasonable combination. More than 81 chips and skills Three chips can be inserted into each weapon, and some rare chips provide powerful capabilities that the weapon itself does not have. The right role is matched with the right weapon, and the powerful chip combination can raise the combat effectiveness to a higher dimension. Scene and starship The shapes and construction methods of the five starships are completely different. One directly transform urban buildings as part of the interior of the starship, with a large number of facilities. One directly use ice and frozen soil as the hull of the spacecraft on the snow-capped mountains, latitude launch saves energy, and at the same time comes with a lot of fresh water. One use the energy of lava on the side of volcanoes for construction and energy storage. Different starships and scenes have different styles of alien enemies and loot rewards. The hidden earth forces and its undisclosed sixth starship under construction are waiting to be discovered by the commander.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1828700/header.jpg?t=1655870358",
    "Price": 9.99,
    "Developers": "KumaPaw",
    "Publishers": "KumaPaw",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1828700/ss_10c739b75b7192894709fd269fc241df72e1882f.1920x1080.jpg?t=1655870358,https://cdn.akamai.steamstatic.com/steam/apps/1828700/ss_bf19e77ba5af88d8b27ebdc449858bb0734656a3.1920x1080.jpg?t=1655870358,https://cdn.akamai.steamstatic.com/steam/apps/1828700/ss_0e8de99f5987bf9eae52389928550843e75323a2.1920x1080.jpg?t=1655870358,https://cdn.akamai.steamstatic.com/steam/apps/1828700/ss_c7d9be84d0562065ca55a68f0587235d580d0533.1920x1080.jpg?t=1655870358,https://cdn.akamai.steamstatic.com/steam/apps/1828700/ss_2bb673e7444b436b5e20c9290cfb50efae99ae14.1920x1080.jpg?t=1655870358,https://cdn.akamai.steamstatic.com/steam/apps/1828700/ss_8b59480768071be80e4a09ef921c928919b985fb.1920x1080.jpg?t=1655870358,https://cdn.akamai.steamstatic.com/steam/apps/1828700/ss_ec3dc527e76fb74bd1bc076f39dde8b417acd42b.1920x1080.jpg?t=1655870358,https://cdn.akamai.steamstatic.com/steam/apps/1828700/ss_4ab736422a27e56d7b2952ef0924bb7b4d9951bc.1920x1080.jpg?t=1655870358",
    "Slug": "celestial-project",
    "Meta Title": "Celestial Project: Jun 21, 2022, KumaPaw and Full Overview",
    "Meta Description": "Looking for information on Celestial Project? Check out the release date (Jun 21, 2022), developer insights from KumaPaw, and a complete game summary.",
    "Alt Text Image": "Official header image for Celestial Project game - Steam 1828700",
    "Canonical URL": "https://gusku.site/game/celestial-project",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Celestial Project\", \"description\": \"Looking for information on Celestial Project? Check out the release date (Jun 21, 2022), developer insights from KumaPaw, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"KumaPaw\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"KumaPaw\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1828700/header.jpg?t=1655870358\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}