{
    "AppID": 1612950,
    "Name": "Comic Company Manager",
    "Release date": "Jun 23, 2021",
    "About the game": "Run a comic publishing company Comic Company Manager is a comics themed management game. Create your own comic publishing company. Design your own comics. Manage printing and marketing of the comics. Hire and manage artists to create comics for you. Grow to dominate the industry The aim of Comic Company Manager is to be a deep management game that will provide many hours of content for fans of the genre. Create your comics In Comic Company Manager you can create your dream comics by combining tropes and concepts into an idea. From this idea you can create comics, merchandise and even get it adapted into a video game or movie. Pick from selection genres, select the price and print settings and market the comic to right age group to guarantee your success. Or let the game pick for you if you feel like it. Worker management Design your player character and choose your own strengths. Do you want to be master writer or a great pencils artist? Its all up to you. To expand your company you hire workers that all have their own skills and specializations. Monitor your workers to find best teams as not all creators work well together. Remember to keep people happy too or their work suffers Manage your company Running a comic publisher is more than just creating comics. You must manage your marketing department, human resources and printing of your comics. Focus on your marketing department to better sell your comics or merchandise. Upgrade your human resources to find better workers and give them better training. Compete in a dynamic market Compete against computer controlled companies that create a tough competition for your comics. Find genres and age groups that don't have enough comic to read and make money off them! Keep track of popular tropes to create the right franchises to maximize your profits. Watch your competition go bankrupt and buy their franchises off them Current Features Hire writers, artists, inkers and colorists Manage teams to find people who work best together Design your own comic franchise from large selection of tropes Create comic series in multiple genres and adjust they settings to what you think will sell Complex market system with competition that determines what comics will sell well Expand your company by renting extra offices Make and customize player character Design and create covers and logos Grow the company from small indie studio to mainstream giant Manage marketing department and marketing push of your comics Manage printing of your comics with paper and color qualities Discover reader tastes trough market research Merchandise your franchises for more money Get your comics adapted into movies and video games Many more to come! Early Access Roadmap This may change based on feedback",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1612950/header.jpg?t=1652276064",
    "Price": 7.99,
    "Developers": "Substandard Shrimp",
    "Publishers": "Substandard Shrimp",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1612950/ss_1cafb6caa02eb086c18fe96e8b78c988472b928a.1920x1080.jpg?t=1652276064,https://cdn.akamai.steamstatic.com/steam/apps/1612950/ss_704c2b7f8afad403bc4a2240ece052c1fe61050b.1920x1080.jpg?t=1652276064,https://cdn.akamai.steamstatic.com/steam/apps/1612950/ss_2bedd57c37a23c690bbc9808f29641201b20d669.1920x1080.jpg?t=1652276064,https://cdn.akamai.steamstatic.com/steam/apps/1612950/ss_0f9564ed05b39def25f5918e109dc849de41e33c.1920x1080.jpg?t=1652276064,https://cdn.akamai.steamstatic.com/steam/apps/1612950/ss_2a78728934889a2920b2ae161e90ade80cc32b98.1920x1080.jpg?t=1652276064,https://cdn.akamai.steamstatic.com/steam/apps/1612950/ss_35065139f2f3591f75c23179495767ca720dcc17.1920x1080.jpg?t=1652276064,https://cdn.akamai.steamstatic.com/steam/apps/1612950/ss_459494f4f3e0645c49d7c25bdc1cecea95f7d66e.1920x1080.jpg?t=1652276064,https://cdn.akamai.steamstatic.com/steam/apps/1612950/ss_fb842e18c1804cf2bd9b752008d17679a7a20763.1920x1080.jpg?t=1652276064,https://cdn.akamai.steamstatic.com/steam/apps/1612950/ss_5dbd148d177eb8140153d27945f32bcb02ef9f23.1920x1080.jpg?t=1652276064,https://cdn.akamai.steamstatic.com/steam/apps/1612950/ss_41f0d78cee6f643de658b500ebef49507adf51c3.1920x1080.jpg?t=1652276064",
    "Slug": "comic-company-manager",
    "Meta Title": "Comic Company Manager: Jun 23, 2021, Substandard Shrimp a...",
    "Meta Description": "Looking for information on Comic Company Manager? Check out the release date (Jun 23, 2021), developer insights from Substandard Shrimp, and a complete ...",
    "Alt Text Image": "Official header image for Comic Company Manager game - Steam 1612950",
    "Canonical URL": "https://gusku.site/game/comic-company-manager",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Comic Company Manager\", \"description\": \"Looking for information on Comic Company Manager? Check out the release date (Jun 23, 2021), developer insights from Substandard Shrimp, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 23, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Substandard Shrimp\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Substandard Shrimp\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1612950/header.jpg?t=1652276064\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}