{
    "AppID": 1795440,
    "Name": "Cosmic Invasion",
    "Release date": "Feb 22, 2022",
    "About the game": "Cosmic Invasion is a combination of strategy mixed in with quick frantic battles against fleets that contain many ships. The strategic layer is a 20 X 30 grid of sectors which creates 600 sectors in all. You move your ships around trying to protect your home planet and space stations from the invading fleets of UFO ships. You are also trying to collect resources from asteroid fields, nebulas and crystalline planets, and collecting ships modules at certain planets. Use these modules to increase your ships stats. The Invasion The space around your planet is being invaded by vast hordes of alien UFO fleets. You must protect your planet at any cost as losing it will end the game. You also have 4 space stations scattered around your quadrant of space. Try to hold on to these space stations as they serve as a great place to repair your ships, and they greatly add to your score. Your Ships You are not left defenseless as you will start the game with 5 ships, one at each of the 4 space stations and one at your home planet. You can build more ships by collecting metals. You can collect modules from most types of planets, and you use these to upgrade the stats of your ships. There are 9 different types of modules with 3 levels of each of them. Resources The game only contains 3 types of resources, metal, science and crystals. Metals are used to build new ships and to create repair kits for your ships. Science is used mostly for researching new technologies. Crystals are used for installing modules onto your ships. You can collect metals by searching asteroid fields. Science and be found by searching nebulas and crystals are found on crystalline planets. Technology As you collect science from nebulas, you use them to research technologies that will greatly improve your chances to hold off the invading fleets a bit longer. These technologies will increase your repair rates and reduce the time it takes you to move and search areas. Alien UFO Fleets Early in the game the size of the alien fleets will be 3-4 ships, and they will just be scout ships. These are the slowest and weakest of the 5 alien UFO ship types. But as the game progresses the fleet size will grow as will the types of ships they contain. Seeing fleets of 15-20 ships will be common during the late part of the game. UFO Spawn Locations The game will start with 3 to 6 spawn locations and a new spawn location will appear every 7 to 10 turns depending on the skill level you started the game with. Its this progression that will eventually lead to you losing the game... but keep in mind your goal is to get the highest score possible! Combat Combat is very unique and has a very quick pace to it. UFO ships will start to appear and move while shooting both bullets and missiles. They will dance around the skies and then disappear just as quickly as they appeared. You will move your ships aimer around the screen and fire both machine gun bullets and missiles. Ending The Game The game ends when you have either lost your home planet, or you have lost all of your ships. You score points each turn for the remaining armor of your space stations and home planet, so even just taking damage to them will reduce your score each turn. You also score points for destroying UFO's during combat.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1795440/header.jpg?t=1653340952",
    "Price": 4.99,
    "Developers": "Blue Blaze Gaming Inc",
    "Publishers": "Blue Blaze Gaming Inc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1795440/ss_ae9e0456482cd9310ad7a91757ffe95b390162f8.1920x1080.jpg?t=1653340952,https://cdn.akamai.steamstatic.com/steam/apps/1795440/ss_69e42ceb930f5c3935808a9fb466d5dd563316ff.1920x1080.jpg?t=1653340952,https://cdn.akamai.steamstatic.com/steam/apps/1795440/ss_52d5406a8c37b19d6dca9523551b9f1173e897fc.1920x1080.jpg?t=1653340952,https://cdn.akamai.steamstatic.com/steam/apps/1795440/ss_d61bce841b78fffd96417ca7bb661ff7eddb378c.1920x1080.jpg?t=1653340952,https://cdn.akamai.steamstatic.com/steam/apps/1795440/ss_92de608ac73ec71d876447a4e5d3525b0e16f7b3.1920x1080.jpg?t=1653340952,https://cdn.akamai.steamstatic.com/steam/apps/1795440/ss_7efffafe06d2904491a1b76110b0b7ef329e9a47.1920x1080.jpg?t=1653340952,https://cdn.akamai.steamstatic.com/steam/apps/1795440/ss_e2bf67bc3a4385613a09b2bc1b686732e2b1ee97.1920x1080.jpg?t=1653340952,https://cdn.akamai.steamstatic.com/steam/apps/1795440/ss_8153ce21f497411ad89f00f0e1b53489ef638b6f.1920x1080.jpg?t=1653340952,https://cdn.akamai.steamstatic.com/steam/apps/1795440/ss_138eed23fb75b686246cddbbe4d1efb6464a274e.1920x1080.jpg?t=1653340952,https://cdn.akamai.steamstatic.com/steam/apps/1795440/ss_d86a30d7782152c134267bd7679979cf2e745635.1920x1080.jpg?t=1653340952,https://cdn.akamai.steamstatic.com/steam/apps/1795440/ss_b4a730d83529583ebff7e0c32f5606d3ad3dcf3b.1920x1080.jpg?t=1653340952",
    "Slug": "cosmic-invasion",
    "Meta Title": "Cosmic Invasion: Feb 22, 2022, Blue Blaze Gaming Inc and ...",
    "Meta Description": "Looking for information on Cosmic Invasion? Check out the release date (Feb 22, 2022), developer insights from Blue Blaze Gaming Inc, and a complete gam...",
    "Alt Text Image": "Official header image for Cosmic Invasion game - Steam 1795440",
    "Canonical URL": "https://gusku.site/game/cosmic-invasion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cosmic Invasion\", \"description\": \"Looking for information on Cosmic Invasion? Check out the release date (Feb 22, 2022), developer insights from Blue Blaze Gaming Inc, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blue Blaze Gaming Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blue Blaze Gaming Inc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1795440/header.jpg?t=1653340952\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}