{
    "AppID": 668660,
    "Name": "CUR3D Steam Edition",
    "Release date": "Jul 26, 2017",
    "About the game": "CUR3D Maker Edition (with Steam) is dead; long live the CUR3D Steam Edition! What's new? Actually everything. No stone is upside down anymore. Steam Edition and Professional Edition are now state of the art. For the CUR3D Steam Edition there will be updates in the same rhythm as for the CUR3D Maker Edition (without Steam) and CUR3D Professional. When is the CUR3D Steam Edition the right choice? If you have faulty 3D data that should be 3D printed If you want to quickly convert 1: 1 large 3D CAD data into 3D printable models If you do illustrative model making If you want to 3D print architectural models If Autodesk netfabb, Materialize Magics and other tools are too complicated and time consuming or cannot repair a 3D model If you don't want to spend money on 3D data repairs at 3D printing service providers ... and and and ... 3D printing as easy as printing on a white piece of paper CUR3D, the first real 3D printing prepress, will revolutionize your workflow with 3D printers. No matter what type of vision models you want to print, CUR3D will revolutionize, accelerate and simplify your work with 3D printers. Now you can concentrate on the essentials and CUR3D does the rest. Thus a high level of productivity, quality gain, cost and time savings is achieved. „Now it’s printable, because it’s CUR3D!“ The first real 3D printing prepress Most CAD data are not printable out of the box. Usually several hours of preparation of the drawings are necessary: thin walls and overlapping surfaces must be corrected, as well as wrong normals. The filling of cavities and holes takes much time, too. And if the scaling factor also deviates from the original data, frustration is pre-programmed. RUHRSOURCE CUR3D (spoken: cured) reduces the amount of work from many hours to a few minutes. The Gutenberg-revolution for additive manufacturing: No matter what type of vision models you want to print, CUR3D will revolutionize your work with 3D printers and, above all, speed up the process. Now you can concentrate on the essentials and CUR3D does the rest. Some before-and-after examples Generative StructureSynth design: Technical 3D model of an extruder: Model of a brick car with interior: Medical scan of a urinary tract: Data Input – Magic Box – Data Output CUR3D scales 3D models without loss, thickens surfaces to a printable minimum, corrects overlapping surfaces as well as improper normals and closes gaps. CUR3D operates completely automatic, fast and absolutely secure. You determine a file to be made printable, set the appropriate dimensions and a desired resolution, CUR3D does the rest, and you can take care of other things. And the best: CUR3D runs perfectly local on your computer system. There is no cloud; None of your data end up in foreign hands, but stay with you! CUR3D is the first real 3D printing prepress, making it the first software on the market to prepare every model for 3D printing. CUR3D supports every 3d printing process and 3d printer. FAQ: What are the CUR3D Maker Edition features? Quite simply: everything the maker’s heart desires. 3D printing data preparation by measure in different quality levels for all printing processes Quickly process the data in seconds Easy to use and almost no learning process Import of STL, OBJ and 3MF files Export in STL format Is it a subscription model or do I have to pay for CUR3D Steam Edition only once? It is a one time payment . For the CUR3D Steam Edition (for private individuals) there will be no subscription ! Can I use the CUR3D Steam Edition commercially? No. But there is a DLC that grants the buyer the rights to use the CUR3D Steam Edition commercially. Can I open project files from the professional version in CUR3D Steam Edition? No.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/668660/header.jpg?t=1636418312",
    "Price": 49.99,
    "Developers": "CUR3D UG",
    "Publishers": "CUR3D UG",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/668660/ss_be144b91708143d8f9667e1599553faaddac2a8e.1920x1080.jpg?t=1636418312,https://cdn.akamai.steamstatic.com/steam/apps/668660/ss_1c919444adb7309a0ff7fbccd104196945f17522.1920x1080.jpg?t=1636418312,https://cdn.akamai.steamstatic.com/steam/apps/668660/ss_76009ab81a65af677207e6bea63e8272ea5b60da.1920x1080.jpg?t=1636418312,https://cdn.akamai.steamstatic.com/steam/apps/668660/ss_dbd672eaaa754f05154aa600ac45d6b86ea89a24.1920x1080.jpg?t=1636418312,https://cdn.akamai.steamstatic.com/steam/apps/668660/ss_1f0f5363c63b2ce0eb0ca7e74b23786cb2566c68.1920x1080.jpg?t=1636418312,https://cdn.akamai.steamstatic.com/steam/apps/668660/ss_d36cc8aee021a91ff78c6c8fd807434df3ae2d3f.1920x1080.jpg?t=1636418312,https://cdn.akamai.steamstatic.com/steam/apps/668660/ss_e3be298729bf6b07553eed57456f39b6da0c0d67.1920x1080.jpg?t=1636418312",
    "Slug": "cur3d-steam-edition",
    "Meta Title": "CUR3D Steam Edition: Jul 26, 2017, CUR3D UG and Full Over...",
    "Meta Description": "Looking for information on CUR3D Steam Edition? Check out the release date (Jul 26, 2017), developer insights from CUR3D UG, and a complete game summary.",
    "Alt Text Image": "Official header image for CUR3D Steam Edition game - Steam 668660",
    "Canonical URL": "https://gusku.site/game/cur3d-steam-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CUR3D Steam Edition\", \"description\": \"Looking for information on CUR3D Steam Edition? Check out the release date (Jul 26, 2017), developer insights from CUR3D UG, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 26, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"CUR3D UG\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CUR3D UG\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/668660/header.jpg?t=1636418312\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}