{
    "AppID": 1800480,
    "Name": "Defend from Candyland!",
    "Release date": "Jan 9, 2022",
    "About the game": "The trees are under attack from the evil candy, you need to Defend from Candyland! Build up a plant based defence to protect the trees from both land and air. Try to overwhelm them by planting the whole field with your defences, or prioritize a few choice plants and level them up, the choice is yours! Characters There are different characters within Defend from Candyland, so lets meet some of them! Oracle Tree The Oracle Tree is a very wise leader to the tree village. He has requested help from the outside world in dealing with this candy threat. He will help you understand the rules of the battlefield. Miss Applebee Miss Applebee is a sweet young Apple tree who runs the local shop. She can upgrade your trees or unlock new types for you to use but it'll cost you some apples! Towers In this Tower Defence game you need to use your different trees to build mazes to slow down and destroy the onslaught of attacking candy. You have different trees at your disposal, each with their own strengths. Peashooter The Peashooter is cheap to plant, with low damage and quick firing. The Peashooter can target both ground and air sweets. Slow Banana The Banana tree does no damage but it slows down all of the enemies it hits. The Banana can only target ground sweets. Cherry Tree The Cherry tree is expensive to plant, with high damage and slow firing. The Cherry Bombs that get thrown explode and damage all the sweets within the area. The Cherry Tree can only target ground sweets. Carrot Field The Carrot Field does moderate damage at a moderate speed. The Carrots can only target air sweets. Boreal Tree The Boreal Tree is one of the trees that can be purchased from Miss Applebee. Snow encircles the tree slowing all the sweets that try to pass through it. Pollen Trap The Pollen Trap is one of the trees that can be purchased from Miss Applebee. The Pollen Trap lays out pollen constantly, which causes all of the sweets with faces, within its area, to sneeze, stopping them briefly. Candies There are multiple different enemy candies that will attack you, these have their own strengths and weaknesses too. Little Jellies The little Jellies are slow but weak ground enemies. Their path is shaped by the trees you plant as well as the blocks that already exist within the level. Jelly Beans The Jelly Beans are faster but still weak ground enemies. Their path is shaped by the trees you plant as well as the blocks that already exist within the level. Gummy Bears The Gummy Bears are slow but powerful ground enemies. When defeated, these gummy bears split into seperate head and legs, watch out! Their path is shaped by the trees you plant as well as the blocks that already exist within the level. The Gummy Bear heads are slow but powerful ground enemies. Their path is shaped by the trees you plant as well as the blocks that already exist within the level. The Gummy Bear legs are slow but powerful ground enemies. Their path is shaped by the trees you plant as well as the blocks that already exist within the level. Flying Saucers The flying saucers are moderate paced and powerful air enemies. These will fly over all forms of blocks and take the quickes path to your tree bases, be careful! Tree Bases In every level there is at least 1 tree base, this is what you need to protect. The enemy candies will travel towards the tree bases and will deal damage to you once they reach them. Stop them at all costs! Health When an enemy sweet hits your tree bases, you health will go down. This tree shows you your health, try to stop it from getting destroyed! Work your way through the levels to try your skills against numerous preset map layouts and minion waves, or head into endless mode, where the waves are endless, and the board is completely clear for you to make your own, how long can you last? This top down tower defence game will keep you occupied for hours, and with the cute pixel graphics it is suitable for all ages. Music has been done by Arman Mkhitaryan of /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1800480/header.jpg?t=1657466762",
    "Price": 10.99,
    "Developers": "MI Pixel Ltd",
    "Publishers": "MI Pixel Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1800480/ss_a4626c07339db00006f14da76a42825297672a5c.1920x1080.jpg?t=1657466762,https://cdn.akamai.steamstatic.com/steam/apps/1800480/ss_30331225020b93afd628ae45e8c0e1cbcae8fbf4.1920x1080.jpg?t=1657466762,https://cdn.akamai.steamstatic.com/steam/apps/1800480/ss_21ab0fdc4060412e3bd19784364e390351861cfa.1920x1080.jpg?t=1657466762,https://cdn.akamai.steamstatic.com/steam/apps/1800480/ss_9b7cda7c1fd15829c9a8da40c1a606c35f303a65.1920x1080.jpg?t=1657466762,https://cdn.akamai.steamstatic.com/steam/apps/1800480/ss_4f6d4919ed81e7595b1b77796afe6e9322643785.1920x1080.jpg?t=1657466762,https://cdn.akamai.steamstatic.com/steam/apps/1800480/ss_0a97f537a095e3fd43a5ed16e18ab63710ed3f2b.1920x1080.jpg?t=1657466762",
    "Slug": "defend-from-candyland",
    "Meta Title": "Defend from Candyland!: Jan 9, 2022, MI Pixel Ltd and Ful...",
    "Meta Description": "Looking for information on Defend from Candyland!? Check out the release date (Jan 9, 2022), developer insights from MI Pixel Ltd, and a complete game s...",
    "Alt Text Image": "Official header image for Defend from Candyland! game - Steam 1800480",
    "Canonical URL": "https://gusku.site/game/defend-from-candyland",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Defend from Candyland!\", \"description\": \"Looking for information on Defend from Candyland!? Check out the release date (Jan 9, 2022), developer insights from MI Pixel Ltd, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"MI Pixel Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MI Pixel Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1800480/header.jpg?t=1657466762\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}