{
    "AppID": 715760,
    "Name": "DOJAGI: The Korean Pottery",
    "Release date": "Dec 9, 2018",
    "About the game": "“DOJAGI” in Korean means “Pottery”. You can create pottery with your both hands in virtual reality led by “DOJAGI”. “DOJAGI” is a totally new simulation game. You can touch, throw, and break stuff as well as make pottery of your own design. There are no monsters to fight against, no weapons to equip yourself with, but you can use various tools actually used for the art of pottery for a realistic indirect experience. Use your imagination! You can create pottery with both your hands just like in real life. Turn on the actual-sized electric pottery wheel, place the clay on the wheel, and make a pottery. Don’t forget to apply water as you work. Use the Trimming Tool to trim the surface of your pottery, or you can also measure the size of it with a vernier caliper. You can paint pictures on the pottery with a brush, or make wonderful patterns on the surface of it using a graver. Not terribly talented in drawing? Then, there are more than 50 stamps in the game prepared for you to engrave the patterns of your liking. Or do you wish to do something which is more in your own style? You can also use a stamp with a pattern designed all by yourself in the game. DOJAGI is the world’s first pottery wheel simulation, and is a pottery-making game with real feelings. Make your own space! You can design your own workplace to your liking in virtual reality. You can decorate your workplace with pottery tools, furniture, home appliances, and many other objects. The songs on your PC are available on an in-game Bluetooth speaker, and the virtual-reality earphones actually work. You may decorate your own space by changing the furniture in parts, and some are available for setting the position, direction, or its height. Fun as a game! DOJAGI is not educational software, it is purely game software meant for entertainment. The game has a Korean national contest, International contest, and various episodes happening at the pottery club. The episodes progress by video phone and text messages on the smartphone given to you in the game. 5 characters provide various missions for you. There is also a workshop mode if you’re not up for a story. In this game mode, you can immerse yourself in the limitless activity of creation. And, of course, you can learn about the art of pottery. Other Functions You can share with the website, which enables you to enjoy DOJAGI in real-time 3D with no plug-ins. You can Export DOJAGI in 3D file format. STL, OBJ files and Texture files will be created, and you can make additional creations with these files. A separate camera for internet broadcasting will be provided. This provides a better angle for the audience to watch, and supports additional subtitles for easy viewing on the broadcast screen. (However, systems with higher performance than the recommended speculations are required for using this function.)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/715760/header.jpg?t=1571628182",
    "Price": 14.99,
    "Developers": "UTPlus Interactive, Inc.",
    "Publishers": "UTPlus Interactive, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/715760/ss_8642d199ba66374943f5f4294bd208d0eff057ac.1920x1080.jpg?t=1571628182,https://cdn.akamai.steamstatic.com/steam/apps/715760/ss_30403a067254eedd5a63acc8a326ae2545396e3b.1920x1080.jpg?t=1571628182,https://cdn.akamai.steamstatic.com/steam/apps/715760/ss_6dc6198b6bca77581b88e1fbc5356d05817d71e7.1920x1080.jpg?t=1571628182,https://cdn.akamai.steamstatic.com/steam/apps/715760/ss_038fdbb67bdb57288099d9fbbeb3e902fffbda9d.1920x1080.jpg?t=1571628182,https://cdn.akamai.steamstatic.com/steam/apps/715760/ss_6b15b806240023cfed6f6493b1dbc8371d58006d.1920x1080.jpg?t=1571628182",
    "Slug": "dojagi-the-korean-pottery",
    "Meta Title": "DOJAGI: The Korean Pottery: Dec 9, 2018, UTPlus Interacti...",
    "Meta Description": "Looking for information on DOJAGI: The Korean Pottery? Check out the release date (Dec 9, 2018), developer insights from UTPlus Interactive, Inc., and a...",
    "Alt Text Image": "Official header image for DOJAGI: The Korean Pottery game - Steam 715760",
    "Canonical URL": "https://gusku.site/game/dojagi-the-korean-pottery",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DOJAGI: The Korean Pottery\", \"description\": \"Looking for information on DOJAGI: The Korean Pottery? Check out the release date (Dec 9, 2018), developer insights from UTPlus Interactive, Inc., and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"UTPlus Interactive, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"UTPlus Interactive, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/715760/header.jpg?t=1571628182\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}