{
    "AppID": 1385300,
    "Name": "Eternal Quest - 2D MMORPG",
    "Release date": "Aug 26, 2021",
    "About the game": "Play together with your friends and other players from your PC or Mobile. Choose a profession and craft epic items starting at level 10, fight raid bosses in global server events that occurs 4x a day. Fight other players in a fast paced action PVP combat and explore a beautiful fantasy open-world. 🖥 CROSS-PLATFORM - Eternal Quest is a cross-platform MMO and you can play on mobile or PC using the same account on the same server as everyone. 👾 RAID BOSSES - A random boss will respawn 4x every day and everyone online can join the battle against it. 🏹 TRAINING AND ATTRIBUTES - You can choose between three training modes: EXP Focused, Balanced and AXP Focused - If you want to evolve your base level, you can focus only in EXP, that means 100% of monsters EXP will be used directly on your character's level - If you want to evolve your attributes, you can focus only in AXP (Attribute XP), that means 100% of monsters EXP will be used on your character's attributes, like Power, Toughness, Agility, Precision and Vitality - And If you want to evolve both, you can choose the balanced mode, where 50% of monsters EXP will be used on your base level and the other 50% will be used on attributes ⚔️ PVP AND PK - Fight other players starting at level 25. The game have different area types, some are PVE and other are PVP that allows players to start a fight between theirselves. - Any unjustified kill, the player will get a 'PK' status and will need to reduce some karma points by killing monsters in order to remove it. - After 7 unjustified kills, the player will get a 'Outlaw' status and will need to do a redemption quest in order to remove it. 🛡 CRAFT AND PROFESSIONS - At level 10 you can choose a profession to start your crafting journey. - The profession are: Blacksmith, Armorsmith and Alchemist - Blacksmith can forge weapons, shields and ammunitions - Armorsmith can create all armor pieces for all classes - Alchemist can create magic items and scrolls, normally used to upgrade items and enchant skills 🌪 LEARN AND ENCHANT SKILLS - Learn new skills purchasing or dropping spellbooks - Enchant your skills and get a cooldown time reduction on them 🗡 BOOST AND UPGRADE ITEMS - You can boost an item up to +21 and everytime the item will get strong. It can be done to weapon, shields, ammunitions and armors - You can also upgrade the level of an item, so if you have an previously boosted item you can keep using it on a higher level 📜 QUESTS AND TASKS - Complete quests that will help on your character evolution and evolve your mastery level - Daily Tasks will grant you items that you need to craft powerful epic items 🙋🏻‍♂️ PARTY - Share EXP playing alongside with your party. - Get EXP bonuses for each different classe you have on your party",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1385300/header.jpg?t=1647977845",
    "Price": 0.0,
    "Developers": "Xtreaming",
    "Publishers": "Xtreaming",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1385300/ss_a18fc6e794bda4291b0c42d5cec70faa95187019.1920x1080.jpg?t=1647977845,https://cdn.akamai.steamstatic.com/steam/apps/1385300/ss_bde07c4b6da3ce2f02acf173c127532b662f0120.1920x1080.jpg?t=1647977845,https://cdn.akamai.steamstatic.com/steam/apps/1385300/ss_309c8afc4cd1da35528eba779d955940cee1db8f.1920x1080.jpg?t=1647977845,https://cdn.akamai.steamstatic.com/steam/apps/1385300/ss_c9fffc4a356782029d58d1a8263b396e2a7a3ef1.1920x1080.jpg?t=1647977845,https://cdn.akamai.steamstatic.com/steam/apps/1385300/ss_e7bf189f53ebc8a4a8ea11b049ef2ecc7f9b6074.1920x1080.jpg?t=1647977845,https://cdn.akamai.steamstatic.com/steam/apps/1385300/ss_5ec80220d20c78fcb216bd9f5ed8b16da32e2759.1920x1080.jpg?t=1647977845,https://cdn.akamai.steamstatic.com/steam/apps/1385300/ss_d95bb444c24b3e8a4b051db8d2c21a9fbdb06a0b.1920x1080.jpg?t=1647977845,https://cdn.akamai.steamstatic.com/steam/apps/1385300/ss_ea8e00b5dcda9d5be0cf4045849c0b419257da46.1920x1080.jpg?t=1647977845",
    "Slug": "eternal-quest-2d-mmorpg",
    "Meta Title": "Eternal Quest - 2D MMORPG: Aug 26, 2021, Xtreaming and Fu...",
    "Meta Description": "Looking for information on Eternal Quest - 2D MMORPG? Check out the release date (Aug 26, 2021), developer insights from Xtreaming, and a complete game ...",
    "Alt Text Image": "Official header image for Eternal Quest - 2D MMORPG game - Steam 1385300",
    "Canonical URL": "https://gusku.site/game/eternal-quest-2d-mmorpg",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Eternal Quest - 2D MMORPG\", \"description\": \"Looking for information on Eternal Quest - 2D MMORPG? Check out the release date (Aug 26, 2021), developer insights from Xtreaming, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 26, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Xtreaming\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Xtreaming\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1385300/header.jpg?t=1647977845\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}