{
    "AppID": 856880,
    "Name": "Fighting Fantasy Classics",
    "Release date": "Jun 5, 2018",
    "About the game": "Ready your sword, pack your provisions and prepare to embark upon nostalgic quests of epic proportions where YOU choose what happens next! Journey a magical realm, fighting monsters and unravelling mysteries in Fighting Fantasy Classics – text-based roleplaying adventures remastered. Originally presented by Steve Jackson &amp; Ian Livingstone in the 80s and 90s, Fighting Fantasy Classics brings these timeless tales back to your gaming library. FEATURES Every player recieves Jonathan Green's swashbuckling pirate adventure - Bloodbones - free with their download. Titles available to purchase include Caverns of the Snow Witch, Citadel of Chaos, City of Thieves, Deathtrap Dungeon, The Forest of Doom, Island of the Lizard King, and The Warlock of Firetop Mountain (original gamebook version), with more books planned for future updates. Make the gamebooks as easy or hard as you like and even turn on a special 'Free Read' mode to play the book like an old-school cheater! Map feature makes it easy to keep track of everywhere you have explored during current and previous playthroughs. Unlimited Bookmarks allow you to revisit difficult sections as many times as desired. Classic, original artwork from Iain McCaig, Russ Nicholson, Malcolm Barter, Ian Miller and more! All viewable through a collectable artwork gallery. Automated Adventure Sheet that keeps track of your stats, inventory and knowledge gained during your journey. Specially composed, atmospheric soundtrack and effects. History of Fighting Fantasy and Rulebook titles, included as free books on the shelf for all players. Traverse the realm of Allansia, using your might and magic to hunt down evil sorcerers. Brave the dangers of Darkwood Forest to help save a doomed village of dwarves. Seek vengeance from the Pirate Lord who murdered your family and destroyed your life many moons ago. Save a port-town from the wrath of an undead lord and his ghostly hound minions! Part story, part game, in these adventures YOU ARE THE HERO!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/856880/header.jpg?t=1658458451",
    "Price": 0.0,
    "Developers": "Tin Man Games",
    "Publishers": "Tin Man Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/856880/ss_ef5938abacf9fedbe1592dabee72125c22732cec.1920x1080.jpg?t=1658458451,https://cdn.akamai.steamstatic.com/steam/apps/856880/ss_160463f912e28e60184e4dcd13f9c4d9e3f358d3.1920x1080.jpg?t=1658458451,https://cdn.akamai.steamstatic.com/steam/apps/856880/ss_98e35d7687d21e0419339139dc57f74a007ea173.1920x1080.jpg?t=1658458451,https://cdn.akamai.steamstatic.com/steam/apps/856880/ss_5ef14b457f99b4e998ad346bf9f3227499018328.1920x1080.jpg?t=1658458451,https://cdn.akamai.steamstatic.com/steam/apps/856880/ss_9f1677197c35efc3ed16654b65feef27fe2d87f2.1920x1080.jpg?t=1658458451",
    "Slug": "fighting-fantasy-classics",
    "Meta Title": "Fighting Fantasy Classics: Jun 5, 2018, Tin Man Games and...",
    "Meta Description": "Looking for information on Fighting Fantasy Classics? Check out the release date (Jun 5, 2018), developer insights from Tin Man Games, and a complete ga...",
    "Alt Text Image": "Official header image for Fighting Fantasy Classics game - Steam 856880",
    "Canonical URL": "https://gusku.site/game/fighting-fantasy-classics",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fighting Fantasy Classics\", \"description\": \"Looking for information on Fighting Fantasy Classics? Check out the release date (Jun 5, 2018), developer insights from Tin Man Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 5, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tin Man Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tin Man Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/856880/header.jpg?t=1658458451\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}