{
    "AppID": 689020,
    "Name": "final m00n - Defender of the Cubes",
    "Release date": "Jan 30, 2019",
    "About the game": "final m00n is a horizontal bidirectional 2.75D shooter like no other before! A space shooter a million years ahead of our time. Get ready for an experience like you've never had before! Combine strategic thinking, quick reaction, and making decisions about life and death. KEY ELEMENTS Influence time in different ways. Use your protective sphere. Try to combine everything that this bleak environment gives you to escape the aliens once more. Protect (&amp; heal) your three cubes &amp; your own ship &amp; if you can &amp; the price does not seem too high, save a few survivors ... This is not a simple shoot 'em up. It is a strategic experience with countless ideas, types of action &amp; decisions that you have to make. Survive the deadliest &amp; most unreal environments in an apocalyptic future scenario that has never been seen before. Save the last of your species and sacrifice precious resources or endure your moral conflicts by leaving them to their fate to save your own skin ... More than 20 Levels with hours over hours full of fun and thrilling gameplay filled with secrets awaiting to be discovered, levels are never the same and opponents and surivors always have random behaviour patterns. A detailed tutorial that gives you a step by step walkthrough of what has changed in over a million years, and what you need to understand to find a way to survive. Choose between three different spaceships with different characteristics (such as speed, nimbleness, turn-speed, destructive capacity, weapon energy storage, protection, 'TimeSc0pe', and 'Spheres') that make your journey a different challenge every time. Use the different difficulty-settings &amp; game-modes like: The 'Hardcore Mode' that leaves the cubes and their protection up to you and your healing skills for the whole journey. The 'arcade mode' that takes you back to the good old days before 1980. There are no 'Save-Games' here, no holding hands and no Easy-Mode, here you really need 'skill' to achieve something ... And if you reach it: The final m00n! One last,endless m00n. A challenge that never ends ... Background What happens, if, in more than a million years, the last humans have to fight for their survival. Uninhabitable planets and a far superiour alien race from which they hide on m00ns. Your only chance at survival is to protect the three devices that make your m00n inhabitable. Cube alpha gives energy, cube beta gives food, cube gamma gives oxygen. If you lose one, you lose your life… The last humans, forced by the uninhabitable environments of the planets, commute from m00n to m00n. Is it time for you to die too? Like all the other millions of humans, their nameless bodies still aimlessly floating through space... ... where once upon a time was the earth - and now only a few rock chunks. And what if... What if... you could slow down time itself? What if... you could nearly stop the time, for the whole galaxy but not for you? What if... you could generate a 'Sphere' which stay in place for a short while and protects everything in it ... And what if you could combine all these things? Can you be everywhere at the same time? Can two simultaneous points be protected at the same time? Can you overtake your own laser? And by the way: how relative is 'short' if you can manipulate time? In final m00n, with the art of manipulating time, this and much more becomes possible. Could you survive and reach final m00n? In one way or another - One m00n will be your final m00n. And never forget: You are not alone. The 'highest form of life' is never far Her technique, her thinking and her entire civilization are a million years ahead of you. And you will not be undetected for a long time even on the smallest of m00ns... Are you up to it? Can you reach the final m00n..? Oh, and if you meet a survivor: Think better of you and your survival. Believe me- d on't try to be a hero!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/689020/header.jpg?t=1612701766",
    "Price": 4.99,
    "Developers": "Frank Gallinsky,Yuri Bechthold",
    "Publishers": "f.y.g.b. Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_8d6503386cae4f9991bf1c2eba92d45dc4fc23f9.1920x1080.jpg?t=1612701766,https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_28c832ba572d08752e627b5a43fd9d9fe568c242.1920x1080.jpg?t=1612701766,https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_9d9a9658de9b6c8317a82f2ad793c6d7ddb20cee.1920x1080.jpg?t=1612701766,https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_85e7a608fc6c8248f2ba65d4e62c9351c92454de.1920x1080.jpg?t=1612701766,https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_9eecf7350355badd7dd6ed89f0fa6d4bbd9d50e5.1920x1080.jpg?t=1612701766,https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_8853a1bffef97307a2f9a9159416e00e8109bcd9.1920x1080.jpg?t=1612701766,https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_640672099fe3e5a6f98185f5524589428529c69e.1920x1080.jpg?t=1612701766,https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_8ecf05356b68f7f24393741425e1eaf70b027743.1920x1080.jpg?t=1612701766,https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_739720d795692013a0e7306c1df38abe30e2207f.1920x1080.jpg?t=1612701766,https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_8a40a820b32c0e682435ff905684e391989a5487.1920x1080.jpg?t=1612701766,https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_b6017d06135c73b5d9b84e926b461ca72a9d5028.1920x1080.jpg?t=1612701766,https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_d88e8fd1dc781cadd5e46b65c9f452c88cfad1ae.1920x1080.jpg?t=1612701766,https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_ae07c2939b5196766e824aff51fc644e16c752a7.1920x1080.jpg?t=1612701766,https://cdn.akamai.steamstatic.com/steam/apps/689020/ss_934cfb91c1368ccd96c94d76fe75a05c15eda2a7.1920x1080.jpg?t=1612701766",
    "Slug": "final-m00n-defender-of-the-cubes",
    "Meta Title": "final m00n - Defender of the Cubes: Jan 30, 2019, Frank G...",
    "Meta Description": "Looking for information on final m00n - Defender of the Cubes? Check out the release date (Jan 30, 2019), developer insights from Frank Gallinsky,Yuri B...",
    "Alt Text Image": "Official header image for final m00n - Defender of the Cubes game - Steam 689020",
    "Canonical URL": "https://gusku.site/game/final-m00n-defender-of-the-cubes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"final m00n - Defender of the Cubes\", \"description\": \"Looking for information on final m00n - Defender of the Cubes? Check out the release date (Jan 30, 2019), developer insights from Frank Gallinsky,Yuri B...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 30, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Frank Gallinsky,Yuri Bechthold\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"f.y.g.b. Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/689020/header.jpg?t=1612701766\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}