{
    "AppID": 1110580,
    "Name": "Flex - Figure Reference",
    "Release date": "Aug 1, 2019",
    "About the game": "FLEX is a fast and versatile figure reference tool designed for all types of creatives. Built on a cutting edge character creation platform, FLEX provides you with the same avatar customization of video games combined with powerful figure posing and lighting tools. Kiss your wooden mannequin model goodbye! FLEX ’s realistic and customizable models, clothing, and hairstyles allow you to bring what’s in your imagination to life – for anything from figure reference and illustration, to storyboarding, architectural visualizations, and more. Once your unique character has taken form, it’s time to make them FLEX . Incorporating 60 static poses and over 120 animations, FLEX allows you to find the perfect pose pronto. Creating your own more extreme poses with the articulated joint gizmos is intuitive and fluid. Lights, camera, action! Visualize your character in the right light with FLEX 's 3-point lighting system. Before you capture your creation, make adjustments to the camera settings until it’s picture perfect. With the ability to export your posed figure on a transparent background, FLEX makes it simple to incorporate your creation into your other creative projects. See your creations come to life in real-time! Select a male or female base model and you’re ready to start crafting your character. Uniquely morph your mannequin with the ability to quickly change skin tone, muscularity, and proportions. Muscle map, flat-grey, and topology textures highlight the contours of the physique, or further customize your model with a variety of modern wardrobe and hairstyle options. Achieve the perfect pose with ease! Select one of over 60 preset poses to get you started. Want a pose that suggests a little more motion? Chose from over 100 animation clips, ranging from basic gestures to more complex locomotion. Slide through each animation’s timeline to capture the perfect moment in time. Fine tune the pose by dragging the joint gizmos to position your character's body and hands with precision. Set the scene with realistic 3-point lighting! Adjust the key, fill, and rim lighting in real-time, while using the preview window to see your character from all angles. Adjust the tint, shadow strength, and global rotation of the lighting sources to create realistic shadows and highlights. When everything is picture perfect, save your image in up to 4K resolution. FLEX characters can be captured on a transparent background for use in other creative projects. FLEX is designed for fast and friendly figure drawing reference, no 3D model export is available.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1110580/header.jpg?t=1658522282",
    "Price": 7.99,
    "Developers": "The Dada Factory",
    "Publishers": "The Dada Factory",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1110580/ss_9b09a12def3e5084a8f9dddc7c7d3dea1d91f24c.1920x1080.jpg?t=1658522282,https://cdn.akamai.steamstatic.com/steam/apps/1110580/ss_d114fa93071fd1671701d8650c0f310d3b591de2.1920x1080.jpg?t=1658522282,https://cdn.akamai.steamstatic.com/steam/apps/1110580/ss_014b202417f4d13bfdb1bb3eb0b4ee2002539319.1920x1080.jpg?t=1658522282,https://cdn.akamai.steamstatic.com/steam/apps/1110580/ss_a1e83f7cc2a7e68d2df4fcad8891278956353a58.1920x1080.jpg?t=1658522282,https://cdn.akamai.steamstatic.com/steam/apps/1110580/ss_a90cc92dcc47e0cc2832d4d3ae873bf3fc3ad250.1920x1080.jpg?t=1658522282,https://cdn.akamai.steamstatic.com/steam/apps/1110580/ss_663a9f75c395e941fd722a36171dcca6d5f8486e.1920x1080.jpg?t=1658522282",
    "Slug": "flex-figure-reference",
    "Meta Title": "Flex - Figure Reference: Aug 1, 2019, The Dada Factory an...",
    "Meta Description": "Looking for information on Flex - Figure Reference? Check out the release date (Aug 1, 2019), developer insights from The Dada Factory, and a complete g...",
    "Alt Text Image": "Official header image for Flex - Figure Reference game - Steam 1110580",
    "Canonical URL": "https://gusku.site/game/flex-figure-reference",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Flex - Figure Reference\", \"description\": \"Looking for information on Flex - Figure Reference? Check out the release date (Aug 1, 2019), developer insights from The Dada Factory, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 1, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Dada Factory\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Dada Factory\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1110580/header.jpg?t=1658522282\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}