{
    "AppID": 1597040,
    "Name": "Fossilfuel",
    "Release date": "Aug 20, 2021",
    "About the game": "CAUTION: THIS GAME IS HARD AND FULL OF JUMP SCARES OPERATION FOSSILFUEL Deep under the Great Sitkin Island in Alaska, you find yourself in the heart of one of the greatest scientific research facilities on Earth! Genetic researchers have bred mutant dinosaurs! But things go bad when the base is invaded by shadowy special forces, looking to steal the dino DNA. You grab your guns and your ammo and prepare for a fight... Spanning several genres, the game starts as horror, turns into a shooter, and then finally an open-world adventure. For multiplayer, Fossilfuel features an intense HORDE mode , that pits you and your friend against man and beast with achievements to win. JURASSIC SURVIVAL HORROR At its core, Fossilfuel is a survival horror game. The player is trapped in a massive underground facility, Sierra, located in a remote location in Alaska. The player must use their head to find clues and solve puzzles to escape the facility. MULTI ENDINGS The game features several massive maps that the player can play in any way they want. Their decisions will decide the ending of the game. Once the player escapes the depths of Sierra, they are faced with the sprawling landscape that is, the Great Sitkin Island. The main story campaign will be a solid length of around 6 to 10 hours of gameplay depending on your skill level. POWER TRIP Experience a massive arsenal of weapons as you plow through a huge library of enemies. The game features a wide range of weapons that are not just traditional firearms, your standard FPS arsenal of Shotguns and rifles, but also weapons of science fiction! Weapons that can warp physics and crush your enemies' bones in seconds! The game runs on the power of the Unreal Engine, enabling crazy particle effects and physics as well as difficult enemy squad AI that tries to flank the player and calls for reinforcements as the situation dynamically calls for it. Enemy dinosaurs will use all their sense to track the player as well. A Velociraptor on the other side of the base is there...hunting you...always coming. MULTIPLAYER Team up and fight with your friends in an intense online horde mode! Battle waves of enemies and unlock achievements as you and your friends test your skills against not just Dinosaurs but Special Forces as well. Also included is COOP Missions mode , where you and your friends can play objective-based missions together. CHALLENGING ENEMIES The game enemies also span into our Homosapien brothers. The enemy soldiers will call for reinforcements, radio ahead to comrades on the other side of the map to prep for the player, talk to each other, provide covering fire, flank manoeuvers, can spot dead comrades, watch and listen for the player to make sounds, and even spot the player clicking on their flashlight. These guys are tough but the player can cut them down with fun weapons like the black hole gun! The Dinosaur AI is likewise very aggressive. Velociraptors have incredible eyesight and can hear every move you make. They tend to travel in pairs and love to perform flanking maneuvers as well. Raptors, however, are not the only baddies you will encounter. But you will have to play to find out! Players are encouraged to record, make twitch, or youtube videos about Fossilfuel. Make sure you link to the game if you do so. A FREE Demo featuring the terrifying introduction level is also on the Steam store. For Speedrunners and completionists Fossilfuel features a wide range of achievements. Time and experience are tracked while playing and players will get a rank at the end of the game. High rankings are tied to achievements as well. Fossilfuel Rank S - Finish under 1 hour, with XP over 500 Rank A - Finish under 2 hours Rank B - Finish under 3 hours Rank C - Finish under 4 hours Rank D - Finish over 4 hours Fossilfuel Demo Rank S - Finish under 15 minutes, with XP over 75 Rank A - Finish under 20 min Rank B - Finish under 30 min Rank C - Finish under 60 min Rank D - Finish over 60 min (Note the Demo does not have achievements) There are two achievements specifically put in the game to challenge completionists. 1. Super Hardcore - beat the game on Hard, and get an S rank. 2. Wave 50 - Complete 50 Waves in multiplayer.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1597040/header.jpg?t=1651206462",
    "Price": 19.99,
    "Developers": "DangerousBob Studio LLC",
    "Publishers": "DangerousBob Studio LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1597040/ss_edecd8e42343b910d626eec6f444edc3f36e5a32.1920x1080.jpg?t=1651206462,https://cdn.akamai.steamstatic.com/steam/apps/1597040/ss_c852e4e955754baad8473f0ecb68d08df8745832.1920x1080.jpg?t=1651206462,https://cdn.akamai.steamstatic.com/steam/apps/1597040/ss_6a3aed2fd3bc7331007a8e988b5fe615cd6c09b8.1920x1080.jpg?t=1651206462,https://cdn.akamai.steamstatic.com/steam/apps/1597040/ss_a8744797b7657089c0ec8c6a2f6e23f5e1574261.1920x1080.jpg?t=1651206462,https://cdn.akamai.steamstatic.com/steam/apps/1597040/ss_9ecfa19cd77451863243c3256bf85a9c9fbfa788.1920x1080.jpg?t=1651206462,https://cdn.akamai.steamstatic.com/steam/apps/1597040/ss_526ae5173115908d2dff20607b989b61cd867324.1920x1080.jpg?t=1651206462",
    "Slug": "fossilfuel",
    "Meta Title": "Fossilfuel: Aug 20, 2021, DangerousBob Studio LLC and Ful...",
    "Meta Description": "Looking for information on Fossilfuel? Check out the release date (Aug 20, 2021), developer insights from DangerousBob Studio LLC, and a complete game s...",
    "Alt Text Image": "Official header image for Fossilfuel game - Steam 1597040",
    "Canonical URL": "https://gusku.site/game/fossilfuel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fossilfuel\", \"description\": \"Looking for information on Fossilfuel? Check out the release date (Aug 20, 2021), developer insights from DangerousBob Studio LLC, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"DangerousBob Studio LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DangerousBob Studio LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1597040/header.jpg?t=1651206462\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}