{
    "AppID": 226860,
    "Name": "Galactic Civilizations III",
    "Release date": "May 14, 2015",
    "About the game": "What if one day, humans woke up to find that they weren’t alone in the galaxy? They make their way into space and discover other alien civilizations with their own histories and motivations looking to make a name for themselves. Choose your race - Human, Drengin, Altarian, and so many more - and lead your civilization into a golden age in one of the largest 4X strategy games ever made! Research new technology, design starships, and colonize new worlds as you face threats and conquer challenges from new and mysterious sources. Negotiate trade and treaties, wage wars, spy on your enemies, and promote outstanding citizens. And when you've finished that, play again as one of the many included alien civilizations each with its own history, technology tree, ship components, and more. Galactic Civilizations III now bundles in the Crusade and Retribution expansions, plus the Mega Events add-on content for an even greater gameplay experience! Join the ranks of galactic leaders today, and answer the question: how will you rule your galaxy? NEVER THE SAME GAME TWICE Each new game offers an array of options as you set it up - choose your map size, abundance of planets and resources, frequency of events, and more for a unique play experience every time. Galactic Civilizations III also removes linear victory conditions and offers you multiple objectives that you can choose to pursue in order to win, such as military conquest, cultural domination, technological ascension, or political alliances. The new multiplayer capabilities also allow you to expand your challenges and fights beyond an AI in order to face off against fellow players. All of this, topped with a rich and in-depth custom ship designer ensure an immersive and exciting experience as you decide how to rule your galaxy. CORE FEATURES: BASE GAME The ultimate sandbox experience: Each game has a unique map, worlds, and challenges to face -- all on a massive scale. Play against 16 to 100 opponents. Multiple paths to victory: Win through military conquest, cultural domination, technological ascension, or political alliance. Create your own history: Each sandbox game lets you create a new future history for your civilization. Story-based campaign: Learn the ancient histories of the alien civilizations and one possible future for the human race. Massive technology tree: Research a technology tree with immense breadth and depth. Each playable faction has their own unique specializations. Your choice determines how you play and win. Faction &amp; Ship Customization: Create a civilization with its own look, ships, technologies, and even options for how the AI will use them. Multiplayer: Play online with friends with full support for custom civilizations, saved multiplayer games, and much more. A deep economy: Every world is unique with many different resources that can change the course of your strategy each game. Planetary Governors: Utilize individual planetary leaders to govern your worlds, deciding what improvements to build and when, which leaves you to focus on larger strategic goals. RETRIBUTION EXPANSION Artifacts: Powerful items buried on planets across the galaxy will give your civilization instant-access to new abilities. Hypergates: Construct powerful gateways that, when linked, allow your fleets to travel even faster across hyperspace. Major Civilizations - Drath and Korath: The manipulative Drath pull the strings across the galaxy, while the Korath rely on extermination. Each has its own set of special abilities, bonuses, and ship parts. Supply ships: Deliver goods and services to your other planets using supply ships in order to aid in their development. Updated Technology Tree: A top to bottom overhaul of the technology tree adds depth and sharpens the strategic choices in your research options. Retribution Campaign: The malevolent Drengin Empire thought humans were soft and peace-loving. They made a terrible mistake that may now end in their extinction. CRUSADE EXPANSION Civilization Builder: Create a custom faction complete with leader, ideology, and abilities. Customize your own galactic navy and create unique dialogue for your faction. Invasions: Train your citizens to be soldiers and invade enemy worlds. Carefully plan your attacks, and don’t forget to leave your homeworld defended, too! Espionage: Spies can steal technologies, circulate rumors to create civil unrest, sabotage enemy worlds, or even go so far as to assassinate enemy citizens. Galactic Citizens: Shape the course of your civilization’s destiny with talented individuals called citizens. Choose from over a dozen unique roles - commander, engineer, farmer, celebrity, and more. MEGA EVENTS Complex Decisions: Use skill and strategy to overcome unexpected challenges Galaxy-wide Events: Deal with issues on a galactic scale Guide your Civilization: Comfort your people through assassinations of beloved leaders, choose how to handle the discovery of a mysterious alien artifact, face down the Dread Lords, and more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/226860/header.jpg?t=1637248541",
    "Price": 39.99,
    "Developers": "Stardock Entertainment",
    "Publishers": "Stardock Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/226860/ss_0945f26d081d7512a5ae2bcbaef14ace7219e418.1920x1080.jpg?t=1637248541,https://cdn.akamai.steamstatic.com/steam/apps/226860/ss_a6daa5e62563e729d8c98e6ef2a4030b7e6290be.1920x1080.jpg?t=1637248541,https://cdn.akamai.steamstatic.com/steam/apps/226860/ss_be78faf9f66866b08665c1c69acad66bdbe54e02.1920x1080.jpg?t=1637248541,https://cdn.akamai.steamstatic.com/steam/apps/226860/ss_837b2595968d24ba56a77c3773da9355d2811751.1920x1080.jpg?t=1637248541,https://cdn.akamai.steamstatic.com/steam/apps/226860/ss_add89808172f9af3a4a6bcfdf562750d2e70bea5.1920x1080.jpg?t=1637248541,https://cdn.akamai.steamstatic.com/steam/apps/226860/ss_c19892155d54a556793db2a0e1723d8dcec77f13.1920x1080.jpg?t=1637248541",
    "Slug": "galactic-civilizations-iii",
    "Meta Title": "Galactic Civilizations III: May 14, 2015, Stardock Entert...",
    "Meta Description": "Looking for information on Galactic Civilizations III? Check out the release date (May 14, 2015), developer insights from Stardock Entertainment, and a ...",
    "Alt Text Image": "Official header image for Galactic Civilizations III game - Steam 226860",
    "Canonical URL": "https://gusku.site/game/galactic-civilizations-iii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Galactic Civilizations III\", \"description\": \"Looking for information on Galactic Civilizations III? Check out the release date (May 14, 2015), developer insights from Stardock Entertainment, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 14, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Stardock Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Stardock Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/226860/header.jpg?t=1637248541\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}