{
    "AppID": 736480,
    "Name": "Glory & Honor",
    "Release date": "Nov 16, 2018",
    "About the game": "In Glory&amp;Honor your mission is to lead a team of gladiators of different races into success. The battles are fought out on a 7x5 battlefield, where your jov is to find out the enemies weaknesses and use your strengths against them. You can use different races and their racial abilities to your advantage. You can start from the bottom from the worst league and slowly climb your way towards the top. Additionally, you can battle in different CUP's. To succeed, you must ensure financial security. You can sell stocks of your team to investors of apply for loans from the bank. On top of that, you can sign sponsorships to help you financially. Ticket sales play an important role as well. Financial planning Aquire sponsors and ticket sales to generate stable income. On top of that you can recruit juniors who you can train and boost to aid you or to sell to another team for a profit. If the situation seems bad, yo ucan always sell stocks to investors or convert loans from the benk into stakes in the company. Different races The different races are human, minotaur, troll and wizard. Every race has its strengths. The human is a neutral race. It doesnt really gave any weaknesses and it can wield weapons and armor. The minotaur's strenth is brute force. The more wounded a minotaur is, the more powerful it becomes. Minotaur can't wield anything however. The troll's strength is fortification. The troll can enter a defencive stance which makes it really difficult for the enemies to strike any damage through or get past him. Additionally, the troll can wield a club to cause damage. Wizards are a magical race. The wizard can cast different kinds of spells from a long range. Additionally the wizard can buff his allies using his magical powers. Other stuff The game has 6 different leagues and 3 different CUP's. Each league-tier has 6 different teams competing in them. Whoever wins a league advances to the next tier and whoever finishes last in a league gets dropped one tier down. Additionally the teams have a board of managers that has to be kept satisfied. The management wants the team to succeed and the investors wish for financial gains. The teams also have different kinds of spaces which influence their success, namely training, recovery and academical spaces.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/736480/header.jpg?t=1542411117",
    "Price": 9.99,
    "Developers": "SugGames",
    "Publishers": "SugGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/736480/ss_34f6c8d7bfd79c720cf7453b08bb1c307d8ce6ff.1920x1080.jpg?t=1542411117,https://cdn.akamai.steamstatic.com/steam/apps/736480/ss_7c09380d9fcb1c43d8c38f1d5f13c69209f1d220.1920x1080.jpg?t=1542411117,https://cdn.akamai.steamstatic.com/steam/apps/736480/ss_f58d64f73876dee156043d74b07d0b5b7742ec37.1920x1080.jpg?t=1542411117,https://cdn.akamai.steamstatic.com/steam/apps/736480/ss_79c477fe174515f4f5dc03bee4097436d8c45fd4.1920x1080.jpg?t=1542411117,https://cdn.akamai.steamstatic.com/steam/apps/736480/ss_3a41b40211e292a9c7eaf1018c706c1e9142a8ab.1920x1080.jpg?t=1542411117,https://cdn.akamai.steamstatic.com/steam/apps/736480/ss_1b4f974cc33e200d65925996067b086dd45433fc.1920x1080.jpg?t=1542411117,https://cdn.akamai.steamstatic.com/steam/apps/736480/ss_f4d83b0782f65cbd2bd308cca3d2dc95269e341d.1920x1080.jpg?t=1542411117",
    "Slug": "glory-honor",
    "Meta Title": "Glory & Honor: Nov 16, 2018, SugGames and Full Overview",
    "Meta Description": "Looking for information on Glory & Honor? Check out the release date (Nov 16, 2018), developer insights from SugGames, and a complete game summary.",
    "Alt Text Image": "Official header image for Glory & Honor game - Steam 736480",
    "Canonical URL": "https://gusku.site/game/glory-honor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Glory & Honor\", \"description\": \"Looking for information on Glory & Honor? Check out the release date (Nov 16, 2018), developer insights from SugGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 16, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"SugGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SugGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/736480/header.jpg?t=1542411117\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}