{
    "AppID": 606500,
    "Name": "HellSign",
    "Release date": "Feb 24, 2021",
    "About the game": "Hunt your nightmares You're a Hunter, the last line of defense between our world and the savage creatures that lurk just outside. By investigating the world around you and reading the evidence you’ll learn more about what you’re hunting and how to kill it. Use your wits, your experience and your arsenal of monster-hunting tools to rid the world of ghouls, ghosts, demons and everything that goes bump in the night - for the right price of course. Story Woken up with the vague memory of having died the night before in a drug-induced state of delirium while on a dangerous job. There is a fresh brand upon your skin, a brand you do not remember but which causes you great unease. You find yourself following a bloody track where strange sightings have been recorded, from spectral women beckoning people into the fog, to spiders as large as wolves, Australia is a dangerous place to live in… Become a Hunter Tricks of the trade Start your journey with a flickering torch, rusty gun and a whole lot of guts. Complete jobs to develop your skills and learn more about the monsters that haunt the night. Develop your character and build your arsenal through a detailed RPG and job system. Become an elite hunter and get your revenge. Choose your contracts There are all manner of creatures prowling the streets, from ghosts to hellhounds, monstrous spiders and demons. Which contracts you take are up to you, and each will play differently to the previous in unexpected ways. Hunt, or be hunted How you hunt your prey is up to you. You can go in guns blazing and let your shotgun do the talking, or you can plan and research your targets to use their weaknesses against them. Study your prey As a hunter, knowledge is one of your greatest weapons. By reading your environment and uncovering the weaknesses of the creatures you're hunting, you can make it a little easier to slay them. The Cryptonomicon is your hunter guidebook, tracking the creatures you’ve slain and the clues you’ve collected. Use your tools From shotguns and booby traps, to silver nitrate rounds and high tech gadgets - there are many tools in your arsenal that can help you fight the darkness. Choosing what to bring with you, and when to use it can be the difference between victory and a grizzly defeat.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/606500/header.jpg?t=1614201954",
    "Price": 19.99,
    "Developers": "Ballistic Interactive",
    "Publishers": "Ballistic Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/606500/ss_743e2de26532f222e6c0e1d990bb2fb4fc03cc1a.1920x1080.jpg?t=1614201954,https://cdn.akamai.steamstatic.com/steam/apps/606500/ss_4efcd10b38bd6c1d8636a01a56a642f29849f0a8.1920x1080.jpg?t=1614201954,https://cdn.akamai.steamstatic.com/steam/apps/606500/ss_21749fcbf297b8f76da9d0377f7e98f5d4d4e191.1920x1080.jpg?t=1614201954,https://cdn.akamai.steamstatic.com/steam/apps/606500/ss_a0fc8b957479754011e2276c9091d87b4754f9d6.1920x1080.jpg?t=1614201954,https://cdn.akamai.steamstatic.com/steam/apps/606500/ss_3a4db2450bafb48fdbdc39633ed4221c7df158ee.1920x1080.jpg?t=1614201954,https://cdn.akamai.steamstatic.com/steam/apps/606500/ss_b948b1352929cef1b94fa8918e20f02c7e55fa87.1920x1080.jpg?t=1614201954,https://cdn.akamai.steamstatic.com/steam/apps/606500/ss_271604c5fb47169fc78674d54691ae3b9cc0f7d3.1920x1080.jpg?t=1614201954,https://cdn.akamai.steamstatic.com/steam/apps/606500/ss_70b77234aa21389171fd9830ff22472c4478a968.1920x1080.jpg?t=1614201954",
    "Slug": "hellsign",
    "Meta Title": "HellSign: Feb 24, 2021, Ballistic Interactive and Full Ov...",
    "Meta Description": "Looking for information on HellSign? Check out the release date (Feb 24, 2021), developer insights from Ballistic Interactive, and a complete game summary.",
    "Alt Text Image": "Official header image for HellSign game - Steam 606500",
    "Canonical URL": "https://gusku.site/game/hellsign",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"HellSign\", \"description\": \"Looking for information on HellSign? Check out the release date (Feb 24, 2021), developer insights from Ballistic Interactive, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 24, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ballistic Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ballistic Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/606500/header.jpg?t=1614201954\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}