{
    "AppID": 1334010,
    "Name": "Last Room",
    "Release date": "Jun 14, 2021",
    "About the game": "Are you looking for a new game in which you can happily while away more than one evening, or maybe pinch until the morning? Looking for a mixture of horror, fantasy and dark elements? Then the Last Room game is exactly what you were looking for. A key attribute that every player needs in the Last Room game is logic and the ability to quickly solve a puzzle in order to successfully move to a new location. Do not hesitate, the game is worth every minute spent, because the music is here, gloomy rooms will clap your nerves. Since the game positions itself as a puzzle, a puzzle, which means the ability to think and make informed decisions, you will need to go through room after room. With each new level, the difficulty will increase, thereby spurring the player to develop logic, intuition and the ability to see the smallest details, which will be key when passing the level. If you are not afraid of skeletons, bones, dark shadows, heartbreaking sounds and be always ready. Go for it, then the game is just for you. This is not a passing puzzle, which has already become boring with numerous versions of games, everything is new here, the creators took into account all the wishes of critics and made the game unforgettable. The ability to solve the puzzle correctly at the location will allow you to go further, if not, alas, but you are stuck. The game itself pushes you to find a solution, but this is at first glance. Finding clues and clues is extremely difficult, which makes the game exciting. What stands out? Gloomy rooms, where a riddle on a riddle reigns, horror and cold that penetrates right to the bone, driving fear into everyone who dares to enter the game. A room with riddles will become a real test of your mind, ingenuity, logic, and also in the skill of hand motor skills, because a lot depends on the reaction speed here. Go for it, a room with riddles is already waiting for you. Not everyone can solve this puzzle, the developers have taken care of this. Decisive actions to quickly pass several difficult levels Drag and drop items with subsequent decision Challenging overcoming lasers Finding items to open portals Exciting jumps to reach the goal Solution of logic puzzles to open doors, Rooms are filled with medieval objects, some of them are used to find paths for passing games Decision with the consequence of the end of the game Secret levels allowing you to go back in search of other ways of passing the game",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1334010/header.jpg?t=1656857105",
    "Price": 2.99,
    "Developers": "RelluRealGames",
    "Publishers": "gigantumgames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1334010/ss_bd322f1b617c3cf8cd6a67c755b4794172d1ddd5.1920x1080.jpg?t=1656857105,https://cdn.akamai.steamstatic.com/steam/apps/1334010/ss_d5d2e5f8ac46066343c94dab47e5b18a9c24c666.1920x1080.jpg?t=1656857105,https://cdn.akamai.steamstatic.com/steam/apps/1334010/ss_21e14d17d8312ba05719fbdb2d42a861d4a55f49.1920x1080.jpg?t=1656857105,https://cdn.akamai.steamstatic.com/steam/apps/1334010/ss_b66ac766fa6b4218d0d1b855edac1ffab6607006.1920x1080.jpg?t=1656857105,https://cdn.akamai.steamstatic.com/steam/apps/1334010/ss_10ce241aec01aa07448f340014a352c79930c20b.1920x1080.jpg?t=1656857105",
    "Slug": "last-room",
    "Meta Title": "Last Room: Jun 14, 2021, RelluRealGames and Full Overview",
    "Meta Description": "Looking for information on Last Room? Check out the release date (Jun 14, 2021), developer insights from RelluRealGames, and a complete game summary.",
    "Alt Text Image": "Official header image for Last Room game - Steam 1334010",
    "Canonical URL": "https://gusku.site/game/last-room",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Last Room\", \"description\": \"Looking for information on Last Room? Check out the release date (Jun 14, 2021), developer insights from RelluRealGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"RelluRealGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"gigantumgames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1334010/header.jpg?t=1656857105\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}