{
    "AppID": 568220,
    "Name": "Lobotomy Corporation | Monster Management Simulation",
    "Release date": "Apr 9, 2018",
    "About the game": "Monsters beyond your imagination, and you: The Manager. Monsters beyond your imagination, and you: The Manager. Monsters beyond your imagination, and you: The Manager. A roguelite monster-management simulation inspired by the likes of the SCP Foundation, Cabin in the Woods, and Warehouse 13. Order your employees to perform work with the creatures and watch as it unfolds; harness greater energy, and expand the facility. One disaster will lead to another, until everything has fallen into chaos. “I give you a warm welcome to Lobotomy Corporation.” Lobotomy Corporation is a roguelite monster-management simulation. Our game was inspired by the monsters birthed of various inspirations featured in games, film, and series, such as the SCP Foundation, Cabin in the Woods, and Warehouse 13. Going further, it was developed with this thought: “What if those monsters were real, and your job were to manage them?” You will be playing as the Manager of Lobotomy Corporation, a company in which such creatures are contained and managed. Order your employees to perform work with and on the creatures and watch the results expectantly. Gather energy produced by the monsters and fulfill the quota each day, expand the facility, and manage even more strange beings. In this game, the player will face an ever-present sense of tension and dread as they progress through each day. “Our new technology will bring salvation to humanity.” Lobotomy Corporation is a newly established energy company that isolates Abnormalities and extracts an infinite amount of energy from them by using independently developed technology , or so it seems on the outside. Join the corporation, and witness the true reality with your own eyes. Lobotomy Corp. consists of several departments, much like any other company. You will have access to various departments as you harness more energy. The more departments you have unlocked, the more efficient the management of Abnormalities will become. Furthermore, AIs such as Angela and the ‘Sephirot’ will be at your side to provide all the assistance you need for smooth progression. Beings that you must constantly research and observe. We dubbed the creatures that reside in Lobotomy Corporation, ‘Abnormalities’. You will have to try your best to keep your employees out of danger while extracting as much energy as possible from the Abnormalities. However, you must learn what types of work you should and shouldn’t perform via trial and error. You start with zero information on the Abnormalities. At first, your eyes, ears, and the in-game manual will be your only hints. Let your intuition pick the work type that might suit the Abnormality best. After that, order the employee who is best suited for the job to work on the Abnormality, and wait for the results. In the process of managing Abnormalities, you will gain the power of information. The amount of energy you can acquire from Abnormalities will depend heavily on the type of work your employees perform. This is NOT a tycoon. As mentioned before, Abnormalities are beings that need to be treated with great care. Some might dislike the idea of being locked inside a Containment Unit, and may sometimes attempt to breach containment. A breaching Abnormality will attack every employee in sight and disrupt the facility’s systems. Worse still, it could open up other units and cause more Abnormalities to escape. Furthermore, employees eroded or corrupted by certain Abnormalities will have a greatly adverse influence on other employees. Employees brainwashed by Abnormalities might randomly attack those around them, wholly oblivious to what they are doing. In addition, employees may go insane from serious psychic trauma, disobeying your orders and damaging the psyche of other employees around them. One disaster leads to another, until everything has fallen into chaos. If you fail to resolve a situation immediately, it will ultimately spiral out of control and throw the whole facility into chaos. When such a situation does occur, you will have to gather employees to suppress any threat and regain control of the situation, or give up parts of the facility to ensure the company’s safety. “Tell me, manager. Do you have any wishes?” The game consists of two main portions: Monster Management and visual Story Segments. Once a day of managing Abnormalities and producing energy ends, the story segment will follow right afterward. In the Story Segments, dialogue with Angela (the AI you’ll also be seeing occasionally in the management portion of the game) and the Sephirot will play. As you progress through the missions they give, you will come closer to the truth hidden deep in the company. You may have to ask questions, or answer questions from others. Here, you will uncover the secrets surrounding the company and yourself, and mayhaps even more. “Hello, X.” “I give you a warm welcome to Lobotomy Corporation.”",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/568220/header.jpg?t=1636694188",
    "Price": 24.99,
    "Developers": "ProjectMoon",
    "Publishers": "ProjectMoon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/568220/ss_7f8118a7b224505b397f481e8187fb647a3a42c6.1920x1080.jpg?t=1636694188,https://cdn.akamai.steamstatic.com/steam/apps/568220/ss_71db0d954dcec5585f201a781db6dac2df041b85.1920x1080.jpg?t=1636694188,https://cdn.akamai.steamstatic.com/steam/apps/568220/ss_1ca2f5995f459084b023233f2fa47e315185ce4f.1920x1080.jpg?t=1636694188,https://cdn.akamai.steamstatic.com/steam/apps/568220/ss_d295f58d94c133fc702af1f12bacae8e7bd9383b.1920x1080.jpg?t=1636694188,https://cdn.akamai.steamstatic.com/steam/apps/568220/ss_54183ee9d7dc3d125df090c2fb69bc32c8bc50bc.1920x1080.jpg?t=1636694188,https://cdn.akamai.steamstatic.com/steam/apps/568220/ss_dd44ba11a1851db49b983d54060f6a3b57f14eaf.1920x1080.jpg?t=1636694188,https://cdn.akamai.steamstatic.com/steam/apps/568220/ss_f00e83202b9c6380442edc63a580afd6ea1beb0a.1920x1080.jpg?t=1636694188,https://cdn.akamai.steamstatic.com/steam/apps/568220/ss_0ca0024cb5a0b6605fa644d85ec639cc7c1f5f21.1920x1080.jpg?t=1636694188,https://cdn.akamai.steamstatic.com/steam/apps/568220/ss_08a8b2d2a7d90b2fcbc0ad7bd3acbc9ec47c200f.1920x1080.jpg?t=1636694188",
    "Slug": "lobotomy-corporation-monster-management-simulation",
    "Meta Title": "Lobotomy Corporation | Monster Management Simulation: Apr...",
    "Meta Description": "Looking for information on Lobotomy Corporation | Monster Management Simulation? Check out the release date (Apr 9, 2018), developer insights from Proje...",
    "Alt Text Image": "Official header image for Lobotomy Corporation | Monster Management Simulation game - Steam 568220",
    "Canonical URL": "https://gusku.site/game/lobotomy-corporation-monster-management-simulation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lobotomy Corporation | Monster Management Simulation\", \"description\": \"Looking for information on Lobotomy Corporation | Monster Management Simulation? Check out the release date (Apr 9, 2018), developer insights from Proje...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"ProjectMoon\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ProjectMoon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/568220/header.jpg?t=1636694188\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}