{
    "AppID": 871420,
    "Name": "Lovecraft's Untold Stories",
    "Release date": "Jan 31, 2019",
    "About the game": "Lovecraft’s Untold Stories is an action rogue-lite with RPG elements. You explore randomly generated levels based in H.P. Lovecraft stories, fighting cultists and all kinds of monsters from the Mythos, improving your weapons and gear, solving puzzles and challenges, and looking for clues and knowledge to defeat the Great Old Ones and the Outer Gods. LIVE H.P. LOVECRAFT’S STORIES Lovecraft’s Untold Stories is based on H.P. Lovecraft’s stories. You will experience first-hand the cosmic horror created by the genius of Providence. Every character will go through an investigation that will take them through different locations, from the creepy old Victorian mansion to the abandoned hospital where forbidden experiments take place or the jungle where lost tribes celebrate forgotten rituals, just to name a few. Levels are randomly generated: it will be a different experience every time you play. Also, they vary depending on the character you’re playing with. Look for items and clues to unlock secrets and new stories! 5 CHARACTERS, 5 WAYS OF FIGHTING THE MYTHOS You can play as 5 different characters, each with a different playstyle and storyline. A private detective, a witch, a thief, a professor, and even a ghoul—each with different stats, weapons, and combat moves, creating five entirely different gameplay experiences. The Detective offers a balanced playstyle, with average Health and Stamina. The Professor is a specialist in ranged combat, with less Health and a special shield granted by his weapon, the Tillinghast. The Witch does a lot of damage, has teleport abilities and elemental shields of fire and ice, but also a very low Health. The Thief is a specialist in melée combat that takes advantage of its stealth to maximize her damage. The ghoul does a lot of melée damage, has a high Health and regenerates itself, but can’t use medkits at all. DISCOVER THE SECRETS OF THE GREAT OLD ONES The truth of the dark horrors that inhabit the universe is unbearable for any human mind. In the end, you can’t win against the Old Ones. Madness or death await you. But maybe you can delay the inevitable… If you face the Great Old Ones without any knowledge about them, you will go mad just by looking at their hideous features. But spread across every level you will find special items with information about the Great Old Ones. The more you know about them, the stronger your mind shall become – but knowledge is not easy to find, and if you are not thorough in your investigation you might get to the end of a storyline without finding everything that is to know. You will have to play with all the characters if you want to find all the information about every Great Old One! MADNESS AWAITS Insanity crawls behind every corner for those who face the Mythos. In your investigations, you will face different situations where you have to choose what to do – make the wrong decision and you will start losing your mind. In order to face the Great Old Ones, you need knowledge, and to find it you have to explore – but the more you explore the more events that shake your sanity you will find… Those who go mad under the influence of the Mythos take their own life to escape the eternal terror they are now looking at. Not all hope is lost, though – there are some ways to recover your sanity… KEY FEATURES Fight hundreds of different monsters from the Cthulhu Mythos in this intense action roguelite Explore Lovecraft’s stories: every character has a storyline that crosses randomly generated levels set in different locations from Lovecraft’s stories, such as the hospital, the jungle, or the port city just to name a few Face the Great Old Ones: Great Cthulhu, Nyarlathotep, Dagon, Shub-Niggurath, and Azathoth await you in special levels Investigate thoroughly: explore every corner to find secret levels and knowledge about the Great Old Ones Learn about the Mythos to fight them: to have a chance at fighting the Great Old Ones you need to acquire knowledge about them, or their mere presence will drive you insane Madness awaits: in the course of your adventures you will have to make some decisions, and taking the wrong ones will shake your sanity. If it gets too low, you will start losing your mind – and if you go mad you will take your own life to escape the horror Pick your hero: Choose between 5 different characters, detective, the thief, the professor, the witch, and the ghoul Different playstyles: every investigator has a different combat style and skills, but levels also vary depending on who you’re playing them with – so the gameplay experience is totally different Collect and improve weapons, items, and artifacts. Each character has a set of weapons and items, and there are hundreds of other items you can find and use! Look for clues and special items to unlock secrets and new stories",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/871420/header.jpg?t=1656591457",
    "Price": 14.99,
    "Developers": "LLC Blini Games",
    "Publishers": "Fulqrum Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_b55988571ab848692b8b45b28f7fa4f3d9dbe75b.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_e4684b46aa0d4898ad7a8b3610ba6fbc5dc3fafc.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_0a02ef2dab6253d2503691c4a538e1427b06a8a0.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_32b82c769ef7dffd1ef39dcc3a60ad4066f3ddb5.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_d77a607e7030e45d3bcb8c3c0d1db20d8def8d22.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_398059ef93b99fd04180f217fdc86ea3756096cb.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_bb7e7de8c7686372f7ab14587e3037c3b5270b01.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_5d3bf48c9b632fe8e425714705cc71de13cc49ae.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_2f0e751676b7b2485ab4ca427cccafdf5cf3135c.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_066c3a00d9fbbdcd59143954316ebffe1621f6ec.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_207d0db48474478c4eabf00d30fec22f3c1df683.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_ba7cf967228561b786c12d79269ea42b1a9c3b4b.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_89bb1976ac30e16eef053025393e3062235b9e73.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_007630d2f0bc3fa5fd7879c88f5405d909ea00b0.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_840fb75c8e7181ecb7625914b48465852683f565.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_ee7b6b19c54f856986463866b99b6d440d6d3b37.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_70650238501820fc1543f9fdc5f92d0483e8ae48.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_529e557cf144beb4c9c77d23b62ca80877613255.1920x1080.jpg?t=1656591457,https://cdn.akamai.steamstatic.com/steam/apps/871420/ss_ee43e4f4ae19f00175e04872d7a5d442cb8a9ce4.1920x1080.jpg?t=1656591457",
    "Slug": "lovecraft-s-untold-stories",
    "Meta Title": "Lovecraft's Untold Stories: Jan 31, 2019, LLC Blini Games...",
    "Meta Description": "Looking for information on Lovecraft's Untold Stories? Check out the release date (Jan 31, 2019), developer insights from LLC Blini Games, and a complet...",
    "Alt Text Image": "Official header image for Lovecraft's Untold Stories game - Steam 871420",
    "Canonical URL": "https://gusku.site/game/lovecraft-s-untold-stories",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lovecraft's Untold Stories\", \"description\": \"Looking for information on Lovecraft's Untold Stories? Check out the release date (Jan 31, 2019), developer insights from LLC Blini Games, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"LLC Blini Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fulqrum Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/871420/header.jpg?t=1656591457\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}