{
    "AppID": 1552630,
    "Name": "MOONWAVE OVERDRIVE",
    "Release date": "Jul 28, 2021",
    "About the game": "WELCOME TO EYRE CITY After your street gang in Outer Adelaide goes bust you're left with nothing but a few credits and a car. Arriving in Eyre City after a hasty escape you find yourself work as a driver for the less-than-reputable Moonwave Cruiser Company. Around town the Company is known for its discretion in return for good pay. Question is can you survive in the City without falling back into the world you just escaped, or will the reapers of the past come back to finish you off? Each night you patrol the mean streets of the latest in Australia's Megacities, a place where life is expensive and failure means being thrown to the wastes beyond the walls. Calls come in, scarce details about who you are helping and why are given and it's up to you to either take the contract or to decline. Either option will affect your standing with multiple of the game's characters as well as your own organisation, Moonwave doesn't want drivers that never take a contract after all. Your contact rarely gives you more than a time and a place, and it's up to you to get there and get out as quickly and efficiently as possible, the quicker the job the better the pay. This means learning the trench-like streets of Eyre City, it's suburbs and major attractions to help you get from A to B without running around in circles. As the sun rises over the Eyre your working day comes to an end. The company cut is taken from your earnings and you better hope you took enough contracts to cover the expenses of life within the walls. Our nocturnal hero goes to rest for now, as the fallout of who they helped and didn't help ripples through the city. A reputation cuts both ways in Eyre City, it helps gain access to more lucrative jobs but could also lead to trouble from any number of people who may come to want you off the streets. Moonwave Overdrive is a game about maintaining balance in a neon-lit whirlpool trying to pull you off track. Balance your reputation and standing with multiple characters, balance your finances to stay in the game and balance the kind of contracts you take to get you these things. See the sights of Eyre City, expand your fleet of cruisers and upgrade the ones you already have. Find a way to thrive in between the conflicts of the Megapolis' power players and find a way to survive the demands of the city. There are no heroes in Eyre City. 5 UNIQUE, CUSTOMISABLE VEHICLES 6 SUBURBS TO EXPLORE A 'FREE-RUNNER' ARCADE MODE AN 'EXONET' MINI-GAME MORE THAN 150 UNIQUE CONTRACTS 2 RADIO STATIONS UP TO 20 PLAYER-ADDED SONGS 5 DIFFERENT CHARACTER STORYLINES A VOLATILE REPUTATION SYSTEM A VERSATILE PHOTO MODE The Moonwave Cruiser Company, you're just a cog in the machine and the machine needs oil. Your primary contact at the company is Vance, part of the management. Complete jobs for him and any of your other colleagues to stay in the Company's good graces and earn some extra cash. 'An association of concerned citizens', the elusive but fairly-minded 'private caller' and the organisation they represent is on a crusade to turn the forces of corruption against each other in the city, how long you stick around for the ride is up to you. Agent Yoshida North is an agent of one of the many omnipotent federal agencies quickly losing their power outside the capital, his assignment in Eyre City hasn't made him a lot of friends in the local wildlife, but he does have contacts in high places. An egotistical and straightforward gambler on the local stock market, whatever Mack wants he needs and he needs it fast. Work with Mack guarantees return on investment, and as he'll tell you, nothing else really matters in the cruiser business. The Ronin are one of the many gangs that have set up in Eyre City, outcasts pushed out of the other megacities they have learned to thrive on their West-Parkes turf. Your main contact with the Ronin is Oda, facilitate the Ronin's jobs around Eyre City through him and find your loyalty rewarded, but assist in their misfortune and find yourself on the wrong end of a katana. The Crimson Vanguard, an unusual gang located in William Point's lower west, your contact with this collective is a street kid called hex. Internally split between militants and diplomats, they are all dedicated to the warped ideals of long-dead philosophers and more importantly their aesthetics, work with the Vanguard won't put you in the good graces of anyone else in the city but for our weary traveller they might just offer the best way out of the thick of the local underworld's conflicts. Information Incorporated, the sole source of information for the majority of the country. Jobs with them (while dangerous and largely unfair) will keep you safe from outside attack, at least while they still have a use for you. EDEN Augmentations, perhaps the only single entity in the country that could rival the power of Information Incorporated, at least if their boards didn't share so many directors. It has long been the wealthiest corporation in the southern hemisphere. Profiting off of foreign conflict, bush-gang wars and border security efforts EDEN has earned a reputation as a benevolent power everyone would rather keep profitable, happy and largely uninvolved. The Eyre City Chancellery, carrying on the last scraps of democracy in the country with a corrupt City-Chancellor at the helm. Not the best situation for the locals, but you're yet to take up that title. Where there's compromise in Town Hall, there's credits to be made. The Centralia Police Force, technically their jurisdiction extends to the whole state, but Eyre City doesn't have security walls for nothing, you'll find the bulk of their presence on the streets you'll be working. While certainly not the feared force of justice they used to be, it's still usually better to have these guys off your back. The 'young money' faction of the secretive United Oasis Association, a collective of the local elites few understand. Fewer know of the internal factions, but doing work in a city like this requires a certain bit of knowledge about the local environment. Work with these guys is rarely direct but staying on their good side is imperative for survival in the city. The 'old money' faction of the United Oasis Association, much like the young money faction, staying out of their way and in their good graces is imperative for survival in the corporate-dominated city.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1552630/header.jpg?t=1633002438",
    "Price": 4.99,
    "Developers": "Virtual Edition",
    "Publishers": "Virtual Edition",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1552630/ss_2fcbe50b7ef3cfe26912bf74c3f3587055cb6e76.1920x1080.jpg?t=1633002438,https://cdn.akamai.steamstatic.com/steam/apps/1552630/ss_92523bffa07099846a5b4b6c522f1cf2d1991a33.1920x1080.jpg?t=1633002438,https://cdn.akamai.steamstatic.com/steam/apps/1552630/ss_ec1bd5e1e0f486a0b4b13156c9e2ff49dceb12ab.1920x1080.jpg?t=1633002438,https://cdn.akamai.steamstatic.com/steam/apps/1552630/ss_f732353d17ca08fc1e59b124faa77cc565e39a90.1920x1080.jpg?t=1633002438,https://cdn.akamai.steamstatic.com/steam/apps/1552630/ss_e4a8fa4051068b4fe028ec91d4515453fc8d3db1.1920x1080.jpg?t=1633002438,https://cdn.akamai.steamstatic.com/steam/apps/1552630/ss_5245ace564bc068d302a78f97ed5e486b385b3ec.1920x1080.jpg?t=1633002438,https://cdn.akamai.steamstatic.com/steam/apps/1552630/ss_fe60940aa01d271d4dd8c41272dbb7d81c183494.1920x1080.jpg?t=1633002438,https://cdn.akamai.steamstatic.com/steam/apps/1552630/ss_171ba937642f40e924db986dc6016329e95ff2f8.1920x1080.jpg?t=1633002438",
    "Slug": "moonwave-overdrive",
    "Meta Title": "MOONWAVE OVERDRIVE: Jul 28, 2021, Virtual Edition and Ful...",
    "Meta Description": "Looking for information on MOONWAVE OVERDRIVE? Check out the release date (Jul 28, 2021), developer insights from Virtual Edition, and a complete game s...",
    "Alt Text Image": "Official header image for MOONWAVE OVERDRIVE game - Steam 1552630",
    "Canonical URL": "https://gusku.site/game/moonwave-overdrive",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MOONWAVE OVERDRIVE\", \"description\": \"Looking for information on MOONWAVE OVERDRIVE? Check out the release date (Jul 28, 2021), developer insights from Virtual Edition, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Virtual Edition\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Virtual Edition\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1552630/header.jpg?t=1633002438\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}