{
    "AppID": 1232610,
    "Name": "Panic Station VR",
    "Release date": "Feb 27, 2020",
    "About the game": "-Game content- Shoot the gun and break the enemies! This is a shooting game within 10 minutes of play time that only focuses on gameplay with a one-way. Prove your skills with powerful weapons against powerful enemies. -Background story- You are an agent of Sentinel, an organization that stops demons from all over the fictional modern world. One day, Sentinel is subject to a massive invasion of enemies. They heads to their respective destinations according to the urgent order. The content of the game is a middle story, and the player runs a train chase after passing the subway. -Project description- Panic Station VR is created as a short-term project to test the experimental elements of combat system at VR FPS by a team of students. Please express it in a review if there was something good or bad things about the game. Feedback is very helpful for game development. -Compatibility- Only HTC Vive controller and Oculus touch controller.are verified for compatibility. For other HMDs and controllers, the actual behavior test is not possible, but due to the possibility of key binding to an external program, the exemption setting is turned off. -How to operate- Move -Click the track pad on the left controller Teleport -Click the shoulder button on the left controller Rotate (click) -Click the track pad on the right controller Rotate (drag) -Press the shoulder button on the right controller and move the controller left or right in the HMD. Hold weapon - Grip button or trigger button Weapoon storage -Place the controller behind the head and press the grip button Weapon sub grip -Hold the controller with nothing on the secondary handle of the weapon and press the trigger button or grip button Weapon sub grip release - Grip button on sub gripped controller Aim lock on /off - Trigger button of sub gripped controller Weapon use -SMG : Continuous shooting by holding down the trigger button -Rifle: single shot by clicking the trigger button - The higher the overheat level displayed by the UI on the left side of the gun, the shooting is restricted, otherwise the overheating value is reduced - If you continue to fire, the direction of the muzzle will be greatly increased due to the fire recoil. Total special function operation 1. SMG - Auto targeting -Long press and release the grip button to enter auto aim mode based on skill charge - The skill charge displayed by the UI to the right of the gun is automatically restored, recovered by knocking down the enemy, and recovered by killing the enemy 2. Rifle - Impact bullet -One hand grip --Press and hold the grip button and quickly lift the controller up -Sub gripped --Press the grip button of main gripped controller 3. Rifle - Chaser bullet -Long press and release the trigger button to fire chaser bullet what passing through enemies - Overheat is increased to max, consumes all the impact bullets shown on the right side of the gun by UI, and increases the number of bounces and damage depending on the number of impact bullets remaining. -How to play the game- 1. Put on the HMD, turn on the game. When the game is turned on, the front of the HMD is set to the original front of the game, so if you turn the game up with the HMD upside down, you should look back. 2. Press any button on the controller. 3. Select either Start Tutorial (above) or Start Game Immediately (below). 4. If you have just finished the tutorial or started right away, you can skip the stage, set the difficulty level, or set the speed in the lobby UI. Difficulty settings are easy, medium, and difficult. In the Easy setting, the target point of the gun always appears in crosshair form, but in Normal and Difficulty, the crosshair can only be seen inside the aimer and the enemy's HP also increases. 5. Start the game by making a stage selection or moving to the right aisle from the front. In a non-combat state, you move towards the target point displayed by the white square UI. In combat, nearby passages are blocked, and all enemies must be killed to release the barrier. 6. If the player dies due to a lot of enemy attacks in a short time, or the time limit UI at the top of the screen becomes 0, the game is over. The game is cleared if you kill the final boss along the way.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1232610/header.jpg?t=1637927349",
    "Price": 0.0,
    "Developers": "Student team of Korea Vocational College of Information and Technology (Republic of Korea),한국IT전문학교 학생팀",
    "Publishers": "Korea Vocational College of Information and Technology,한국IT전문학교",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1232610/ss_34a953065a703877c77c586b4348d94c070251ae.1920x1080.jpg?t=1637927349,https://cdn.akamai.steamstatic.com/steam/apps/1232610/ss_d73007848454bc414de4adb27dcef932734cafc6.1920x1080.jpg?t=1637927349,https://cdn.akamai.steamstatic.com/steam/apps/1232610/ss_9593ce0c4019ba38c5ea4c58a460354448e85665.1920x1080.jpg?t=1637927349,https://cdn.akamai.steamstatic.com/steam/apps/1232610/ss_641b1c002ab91172a6d105377522ddd343fc3864.1920x1080.jpg?t=1637927349,https://cdn.akamai.steamstatic.com/steam/apps/1232610/ss_4ec2f00ffac05e0a336ea94f0eed389c570d3776.1920x1080.jpg?t=1637927349,https://cdn.akamai.steamstatic.com/steam/apps/1232610/ss_a97f984cbdecb788dfd7cc18de7d6eca99406425.1920x1080.jpg?t=1637927349,https://cdn.akamai.steamstatic.com/steam/apps/1232610/ss_94c2912d68e4ade7099845fa140b1ea3edcea428.1920x1080.jpg?t=1637927349,https://cdn.akamai.steamstatic.com/steam/apps/1232610/ss_e2e984df4205eaf215ce72765b0787177c804b3f.1920x1080.jpg?t=1637927349,https://cdn.akamai.steamstatic.com/steam/apps/1232610/ss_515c69ca2cb8519bda4d854b79ef6a58d08db72c.1920x1080.jpg?t=1637927349,https://cdn.akamai.steamstatic.com/steam/apps/1232610/ss_6c8ab00e53250b7011a0c89112341e80fa121d8e.1920x1080.jpg?t=1637927349",
    "Slug": "panic-station-vr",
    "Meta Title": "Panic Station VR: Feb 27, 2020, Student team of Korea Voc...",
    "Meta Description": "Looking for information on Panic Station VR? Check out the release date (Feb 27, 2020), developer insights from Student team of Korea Vocational College...",
    "Alt Text Image": "Official header image for Panic Station VR game - Steam 1232610",
    "Canonical URL": "https://gusku.site/game/panic-station-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Panic Station VR\", \"description\": \"Looking for information on Panic Station VR? Check out the release date (Feb 27, 2020), developer insights from Student team of Korea Vocational College...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 27, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Student team of Korea Vocational College of Information and Technology (Republic of Korea),\\ud55c\\uad6dIT\\uc804\\ubb38\\ud559\\uad50 \\ud559\\uc0dd\\ud300\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Korea Vocational College of Information and Technology,\\ud55c\\uad6dIT\\uc804\\ubb38\\ud559\\uad50\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1232610/header.jpg?t=1637927349\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}