{
    "AppID": 1727320,
    "Name": "Phoenix Pro Theater Media Player",
    "Release date": "Sep 2, 2021",
    "About the game": "Phoenix Pro Theater offers a theatrical experience brought to your living room. Sitting in the comfort of your home, you can sense the real feeling of watching a movie in an enriched theater. Any movie of choice, available in your PC or laptop, can be played in Phoenix Pro Theater. Phoenix Pro Theater, elevates you to the ownership of a personal theater. The ambiance excels to that of a real theater. The player is provided with all facilities to choose and play any movie available in your system. It is meticulously designed to cater to your taste, comfort and convenience. In order to improve the ambiance and magnificence of the theater, facilities have been provided to customize the theater to your liking. To the viewers’ delight, Phoenix Pro Theater offers surround sound, animated audience captured to visualize real life situation. The theater ambiance light mimics and adjusts to that of the brightness and color tone present in the movie played. The Theater is illuminated with pleasing lights, and movie can be watched either with the lights on or off, as per the liking of the viewers. An array of choices offered are (i) Selection of seats, in six Zones viz. Front (Left, Middle or Right) or Rear (Left Middle or Right), (ii) 15 types of Leather Seat Upholstery, (iii) Movie Brightness can be increased, (iv) Choose from any one of the 6 Colors of lights displayed on Side Walls, (v) Color tone of the movie played can be changed (vi) Individual Color Theme, wherein the viewer can change the color of the dresses of all the characters in the movie offering a very unique experience not found in any main stream video player. An impressive Control Panel has been provided to enable the viewer to select and exercise all available options and between choices. The LCD panel displays options selected. Technically, Phoenix Pro Theater supports 12 video formats. It also supports vertical video playback plus video rotation and flip options. It is Full HD, 4K &amp; 8K supported, making it future ready. The Auto resume option, remembers the last played scene and resumes playback from the last played position. Ideally, the viewers’ long search for an ultimate theater is likely to stop at “PHOENIX PRO THEATER”. Supported formats : mp4, mov, avi, mkv, wmv, m4v, webm, flv, vob, ogg, mpg, 3gp",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1727320/header.jpg?t=1638362516",
    "Price": 2.99,
    "Developers": "DP CORPORATION",
    "Publishers": "DP CORPORATION",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1727320/ss_dc871c442f3aba0bccb9ffed74792bb63b83f855.1920x1080.jpg?t=1638362516,https://cdn.akamai.steamstatic.com/steam/apps/1727320/ss_ad63cd3d2d375fb9c962733e6e9edee3f3dd1b96.1920x1080.jpg?t=1638362516,https://cdn.akamai.steamstatic.com/steam/apps/1727320/ss_c32b2f832b8fa8891af2352b0bdacb0fc2852305.1920x1080.jpg?t=1638362516,https://cdn.akamai.steamstatic.com/steam/apps/1727320/ss_4a51c20921fab25ecfe0b137b9123b47074685ac.1920x1080.jpg?t=1638362516,https://cdn.akamai.steamstatic.com/steam/apps/1727320/ss_460ca8f4331b4fd9d0e469e1fdf2950b0db8faa3.1920x1080.jpg?t=1638362516",
    "Slug": "phoenix-pro-theater-media-player",
    "Meta Title": "Phoenix Pro Theater Media Player: Sep 2, 2021, DP CORPORA...",
    "Meta Description": "Looking for information on Phoenix Pro Theater Media Player? Check out the release date (Sep 2, 2021), developer insights from DP CORPORATION, and a com...",
    "Alt Text Image": "Official header image for Phoenix Pro Theater Media Player game - Steam 1727320",
    "Canonical URL": "https://gusku.site/game/phoenix-pro-theater-media-player",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Phoenix Pro Theater Media Player\", \"description\": \"Looking for information on Phoenix Pro Theater Media Player? Check out the release date (Sep 2, 2021), developer insights from DP CORPORATION, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"DP CORPORATION\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DP CORPORATION\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1727320/header.jpg?t=1638362516\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}