{
    "AppID": 1697050,
    "Name": "Polybius Invaders",
    "Release date": "Oct 3, 2021",
    "About the game": "Out of Chaos comes Order. Polybius Invaders will mess with your senses. This is an experience like no other. Turn on features like Infra-Sound and Subliminal Messages and experience the fear. Enter this brave new world and take revenge on General Goo and his evil Agenda, as he unleashes all-out war. You are humanity's only hope. Your species has amused itself to death. Take on the Evil General Goo as he sends waves of Polybius Space Invaders your way in this Action-Packed Arcade Shoot 'em up. Please Note. This game was designed to be challenging like the old retro games in the Arcade Halls early 80s were, but with modern aesthetics. I wanted to create something that would fit in well in the Arcade Halls. Polybius Invaders is a single-player game that features 25 stages of alien invaders for you to destroy, Four Brutal Bosses, and a Final Showdown with General Goo. To help you succeed there are plenty of weapon pick-ups. This is my own personal homage to the retro games that I grew up with such as Space Invaders and Duck Hunt , and thrown in for a little bit of effect the Urban Myth of 'Polybius' . A game with Polybius in the title wouldn't be a 'Polybius' game if it didn't induce a little bit of fear into the equation. So with that in mind, I give to you Infra-Sound and Subliminal messages . The Infra-Sound is a sound undetectable with the human ear, which induces fear. It's used to great effect in lots of horror movies (I've personally never heard of anybody doing this in a game, so this could be a first). Infra-Sound and Subliminal Messages are just for fun, and these features need to be switched on manually by the user, and once activated show up on the GUI during gameplay, they can be turned off at any time as well. Read the instructions in the game manual for full details. If you are prone to seizures or have epilepsy it's highly recommended that you do not play this game for obvious reasons, such as flashing lights and all the psychedelic effects. This game requires a mouse and a keyboard to play it, or a lightgun. It was also developed with the lightgun in mind. For some people, the game has already begun. For these individuals, in order to succeed you need to OBEY. Make sure to download the PDF instructions manual which includes a Polybius Square for your enlightenment. Have fun, enjoy, and please don't have nightmares. Jonni The Dodger",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1697050/header.jpg?t=1648085999",
    "Price": 9.99,
    "Developers": "Jonni the Dodger,Peter Ward",
    "Publishers": "Ecomasphere Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1697050/ss_ddd6a4b62dfe9804a6d297b5be72b278199482f4.1920x1080.jpg?t=1648085999,https://cdn.akamai.steamstatic.com/steam/apps/1697050/ss_65b43c736d2b7f7efa925a89d58f0e891cb0c248.1920x1080.jpg?t=1648085999,https://cdn.akamai.steamstatic.com/steam/apps/1697050/ss_e4ac02146a6493fbc662d0c34c0ae8fff02c4b76.1920x1080.jpg?t=1648085999,https://cdn.akamai.steamstatic.com/steam/apps/1697050/ss_352e164ae8afd79697f34acbef1c80db6ad6ae91.1920x1080.jpg?t=1648085999,https://cdn.akamai.steamstatic.com/steam/apps/1697050/ss_c9c00ecd4b5463cc644adb8adbdaab51b61de636.1920x1080.jpg?t=1648085999",
    "Slug": "polybius-invaders",
    "Meta Title": "Polybius Invaders: Oct 3, 2021, Jonni the Dodger,Peter Wa...",
    "Meta Description": "Looking for information on Polybius Invaders? Check out the release date (Oct 3, 2021), developer insights from Jonni the Dodger,Peter Ward, and a compl...",
    "Alt Text Image": "Official header image for Polybius Invaders game - Steam 1697050",
    "Canonical URL": "https://gusku.site/game/polybius-invaders",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Polybius Invaders\", \"description\": \"Looking for information on Polybius Invaders? Check out the release date (Oct 3, 2021), developer insights from Jonni the Dodger,Peter Ward, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 3, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jonni the Dodger,Peter Ward\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ecomasphere Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1697050/header.jpg?t=1648085999\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}