{
    "AppID": 623700,
    "Name": "Rec Center Tycoon - Management Simulator",
    "Release date": "Sep 6, 2019",
    "About the game": "Rec Center Tycoon draws inspiration from the simulation/management classics like Theme Hospital as well as modern classics like Prison Architect to give you a deep, challenging business management game where you build and run a recreation center from the ground up. Micromanage employees, finances, fitness classes, customer needs and much more! Start small, building a nice inviting, chill gym. Hire employees, decide their wages &amp; choose their work hours. Maybe take out a bank loan. As you progress through the research tree you'll unlock new equipment, facilities &amp; much more. Work your way up to building a giant, bustling Rec Center with hundreds of members, running fitness classes like aerobics &amp; swimming. All taught by your team of fitness instructors. Hire lifeguards &amp; nurses to keep your customers safe. Keep your plants watered, bins empty &amp; cafe full of food &amp; you're on your way to success! Here's just a sample of some features you may enjoy: Challenging gameplay; unlike many other management/simulation games, failure is a possibility in Rec Center Tycoon. You must keep your customers happy or they may leave negative reviews which can hurt future business leading to poor profits. Large selection of buy-able exercise equipment to keep customers satisfied. Many different employees types, from your simple receptionist to a boxing trainer. Every employee has different motivations, skill levels &amp; traits. Some employees may prefer short 5 hour shifts, others are happy to work 12 hour shifts. An unfit, yet charismatic employee won't make a good lifeguard, but they might make a great receptionist. It's up to you to choose the right employee for the job! Hire fitness instructors &amp; create your own fitness classes. Host customer parties in your Event Rooms for an added source of income. Build a café &amp; hire a barista. You'll need a few cooks to keep the cafe stocked and do catering for any events you may be hosting. Create your own manager who is always on-site &amp; can perform various duties to help out &amp; keep things running smoothly. Take control of your manager &amp; manually walk around and do a variety of tasks yourself! Hire a nurse &amp; build an infirmary for the inevitable accidents that come from customers swimming &amp; using all kinds of heavy gym equipment. Running low on money? Take out a loan from the bank! Beware of the interest rates though. Complex financial system. Do you charge a flat rate for entry? Or make entry free but dramatically increase the cost of amenities like café food and arcade machines? Do you lock facilities like swimming behind a membership? What will your daily membership costs be? And there's a whole lot more to come! For the moment Rec Center Tycoon is only available for the Windows platform with possibilities for Mac &amp; Linux support added after.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/623700/header.jpg?t=1654199733",
    "Price": 9.59,
    "Developers": "Jarrod Brown",
    "Publishers": "Jarrod Brown",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/623700/ss_4255d4de071007e7680232161873e19a7d1f07b1.1920x1080.jpg?t=1654199733,https://cdn.akamai.steamstatic.com/steam/apps/623700/ss_a3f8ce231810a52512e0e1610f01f8beae15b8c7.1920x1080.jpg?t=1654199733,https://cdn.akamai.steamstatic.com/steam/apps/623700/ss_2ec29940ece4e12a889a0ff4275914072ff0c519.1920x1080.jpg?t=1654199733,https://cdn.akamai.steamstatic.com/steam/apps/623700/ss_0851b474a152033f32b9c49755e0cb2480759ddf.1920x1080.jpg?t=1654199733,https://cdn.akamai.steamstatic.com/steam/apps/623700/ss_48ced015bc9e2fbd1e6267e58ebd2803405a5dd6.1920x1080.jpg?t=1654199733,https://cdn.akamai.steamstatic.com/steam/apps/623700/ss_d93a61114d921f4fb5bd5ae97a3c4426e19f0028.1920x1080.jpg?t=1654199733,https://cdn.akamai.steamstatic.com/steam/apps/623700/ss_44e46435faacc1111e8ef8baf59e9a79819323a1.1920x1080.jpg?t=1654199733,https://cdn.akamai.steamstatic.com/steam/apps/623700/ss_d0a0abaec2ddf0ed0b1da7d55ef83a73494cbad9.1920x1080.jpg?t=1654199733",
    "Slug": "rec-center-tycoon-management-simulator",
    "Meta Title": "Rec Center Tycoon - Management Simulator: Sep 6, 2019, Ja...",
    "Meta Description": "Looking for information on Rec Center Tycoon - Management Simulator? Check out the release date (Sep 6, 2019), developer insights from Jarrod Brown, and...",
    "Alt Text Image": "Official header image for Rec Center Tycoon - Management Simulator game - Steam 623700",
    "Canonical URL": "https://gusku.site/game/rec-center-tycoon-management-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rec Center Tycoon - Management Simulator\", \"description\": \"Looking for information on Rec Center Tycoon - Management Simulator? Check out the release date (Sep 6, 2019), developer insights from Jarrod Brown, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 6, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jarrod Brown\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jarrod Brown\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/623700/header.jpg?t=1654199733\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}