{
    "AppID": 947960,
    "Name": "Ribbon Racer",
    "Release date": "Oct 10, 2018",
    "About the game": "Ribbon Racer is a racing game (wow!), where cars can be upgraded during the race. Magic boxes containing bonuses will be appearing in random places on track all the time! Those can be collected to improve your car capabilities, such as increased maximum speed and acceleration or additional energy points, which can be spend to use cars special powers. Thanks to the infinite renewal of the bonus boxes and unlimited number of laps (set by the player) we can come to a situation where our car will rip space at breakneck speed exceeding 500 kmph. Each car type has unique active power, passive ability and even ammunition type, which can be used to attack rivals. It is these elements, deviating from realism, and original, imaginative tracks that are the main strengths of this game. Because I'm not a specialist on computer networking, Ribbon Racer doesn't have multiplayer online mode. In return, it offers local multiplayer on split screen (or additional screens) for up to 4 players. In total, RR can handle up to 5 screens (in the case of a smaller number of players an extra screen acts as a map). To control your car you need only 6 keys. At the moment, the game offers: 6 types of cars (5 can be chosen by the players, 1 is reserved for the AI) 5 special powers: turbo mode, flight mode, formation of stones, pool of ice, time slowing 19 diverse tracks (including, for example, 'Tower Defence' track, where there are a lot of moving obstacles and traps, or a 'Hobbit' track, where we go there and back again on the same road, so we have to watch out for cars coming from the opposite direction) 19 soundtracks (unique music for each track) 5 types of bonuses (not counting bonus traps) Team Racing mode to make team with other players and race together against AI opponents An option to create a Tournament - determined by the player set of tracks, connected by the overall score and the inability to change settings (selection of cars and the number of opponents) between routes. List of lap records, which consider chosen route and the type of car. Because it's not 1.0 version, but slightly upgraded version 1.2, I present you list of differences between the versions: 1 new type of car (there were 5, now are 6) 6 new tracks (there were 13, now are 19) graphics improvement (eg track loading screens, moving lava etc.) improved correction of the car's rotation in the air (thanks to that, problems with car jamming and other equally frustrating situations are much less common) added the ability to control the car in the air (it was reserved only for the yellow car before, now everyone can slightly adjust their flight, but still not as much as yellow, of course) opponents can finally use bullets (the frequency of shooting is dependent on difficulty level) orange boxes, in addition to energy replenishment, also increase quantity of ammunition cyan boxes additionally improve the controllability of the car at high speeds achievements (including a separate challenge for each track) new race options that can completely change the style of the game: + Random AI cars - enabling this option will allow computer controlled enemies to choose a random type of car, not limited to white ones + One-time bonuses - disabling this option means that the bonus boxes will not disappear after they have been collected, so that they can also benefit other players, not just the one who reaches them first + Traps only - replaces all bonus boxes with random traps + Team racing - make team with your friends to race against AI opponents",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/947960/header.jpg?t=1571937421",
    "Price": 3.99,
    "Developers": "Tehawar",
    "Publishers": "Tehawar",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/947960/ss_061e9c74df2fca419ec081978e742b4818ce27f8.1920x1080.jpg?t=1571937421,https://cdn.akamai.steamstatic.com/steam/apps/947960/ss_79fd7657eb4a973aedb814ec99412ef590978f62.1920x1080.jpg?t=1571937421,https://cdn.akamai.steamstatic.com/steam/apps/947960/ss_57af237b45aaf9d488e414c66f42c7f5afcc3bc8.1920x1080.jpg?t=1571937421,https://cdn.akamai.steamstatic.com/steam/apps/947960/ss_11e6c014356549e4c0755c5d03586504fb73ed89.1920x1080.jpg?t=1571937421,https://cdn.akamai.steamstatic.com/steam/apps/947960/ss_6896ec113f3531096394c0e35f4db934ca87c280.1920x1080.jpg?t=1571937421,https://cdn.akamai.steamstatic.com/steam/apps/947960/ss_7dd22f1ccaac5b0b532d5492cc9923567d37044c.1920x1080.jpg?t=1571937421,https://cdn.akamai.steamstatic.com/steam/apps/947960/ss_4a1cb9b486305193e72d6794bbc2a9eac5f33737.1920x1080.jpg?t=1571937421,https://cdn.akamai.steamstatic.com/steam/apps/947960/ss_98feedb4b7190e8671bfc8a16f6c7b7a2341d570.1920x1080.jpg?t=1571937421,https://cdn.akamai.steamstatic.com/steam/apps/947960/ss_2d53a0135d63895c4e55cd9d1c567fdc2440b5c4.1920x1080.jpg?t=1571937421,https://cdn.akamai.steamstatic.com/steam/apps/947960/ss_2e30b7074c7d33112d211b4a6437cc40daf3fab6.1920x1080.jpg?t=1571937421",
    "Slug": "ribbon-racer",
    "Meta Title": "Ribbon Racer: Oct 10, 2018, Tehawar and Full Overview",
    "Meta Description": "Looking for information on Ribbon Racer? Check out the release date (Oct 10, 2018), developer insights from Tehawar, and a complete game summary.",
    "Alt Text Image": "Official header image for Ribbon Racer game - Steam 947960",
    "Canonical URL": "https://gusku.site/game/ribbon-racer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ribbon Racer\", \"description\": \"Looking for information on Ribbon Racer? Check out the release date (Oct 10, 2018), developer insights from Tehawar, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 10, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tehawar\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tehawar\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/947960/header.jpg?t=1571937421\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}