{
    "AppID": 569350,
    "Name": "RoboCritters",
    "Release date": "Jul 3, 2017",
    "About the game": "RoboCritters is a frantic real-time multiplayer battle-game where up to 4 players (or 6 online) can go head to head, fighting in real-time over a procedurally-generated, fully destructible terrain. 12 different game-modes provide unique twists to the gameplay and require players to get creative in order to outsmart opponents. Features Online play fully supported - Up to 6 players with up to 4 local players per machine Fully destructible terrain - Fight until there is nothing left! Tunnel your way to victory. Use land as temporary cover. The options are endless… Procedurally generated landscapes - Utilise the interactive level-generation tool or select from over 70 pre-built level layouts. 5 different world types - Each with unique visuals effects (woodland, winter, wild-west, gothic and cheesetastic!) Varied tactical weaponry - Includes bouncy mines, player-guided missiles, remote-detonated cluster bombs, and of course, the nuke. Jet packs - Attain air-superiority against other players or engage in epic dog fights to the death. 4 re-chargeable energy abilities - From the cheap and cheerful 'Quick-Shield' and 'Mega-Hop', to the more costly 'Shockwave' and ‘EMP’. Will you use the cheaper evasive abilities or save up your reserves in order to turn the tide of battle? Hop, dash and roll mechanics - Need to get somewhere quickly? Why not use a crater as a ramp and launch yourself using a mixture of a power dash and a hop, cowabunga! Express your emotions - Taunt your opponents or show your fear with in-game emotes. Each critter has a unique personality and there are a total of 18 randomised voice statements per character. Power-up crates - Engage in sporadic territorial disputes as you fight to collect these important resources. Customisable game modifiers - Tweak the rate of fire, health, energy regeneration rate, and more.. Game-Modes There are 12 different game modes to choose from, including: Skirmish – A classic battle where players must earn money from hits and kills in order to purchase weapons between rounds. Dogfight - Players have infinite basic ammo and jetpack fuel. This gamemode relies on quick reflexes and skillful aerial manoeuvres. Nuke Dogfight - All players have infinite nukes and jetpack fuel with which to unleash complete carnage against their opponents (and often themselves). Basic Survival – Players must fight with only basic weaponry while attempting to avoid an onslaught of bouncy mines continually dropped from above. Lottery - Players each receive infinite ammo for 2 random weapons (or for 1 weapon and jetpack). Players must get creative in order to win, sometimes against the odds. Shuffle - Can't decide? We got you covered. This special gamemode chooses a new gamemode every round! Feedback and Technical Support If you encounter any issues playing the game please get in touch with us (the developers). We have worked hard to eliminate all bugs before release but there is always the possibility that we may have missed some (we are only a two man team). We will strive to work with the community and release patches as soon as we can to resolve any issues that may come to light following release. For this, we prefer you get in touch with us via the technical-support discussion forum here on Steam.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/569350/header.jpg?t=1504032584",
    "Price": 0.99,
    "Developers": "Curious Dimensions Ltd",
    "Publishers": "Curious Dimensions Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/569350/ss_209385f50d7f72cf06ac3b4ac98b7e911c1c99ab.1920x1080.jpg?t=1504032584,https://cdn.akamai.steamstatic.com/steam/apps/569350/ss_ab3384f67bdaa599e0ac33d930ba657e93a7e906.1920x1080.jpg?t=1504032584,https://cdn.akamai.steamstatic.com/steam/apps/569350/ss_86aa9fda83aa89042e0ed3f8df57a166287f2b03.1920x1080.jpg?t=1504032584,https://cdn.akamai.steamstatic.com/steam/apps/569350/ss_7291be1a6fbfbbb29152ac9d0500040a1c3194b5.1920x1080.jpg?t=1504032584,https://cdn.akamai.steamstatic.com/steam/apps/569350/ss_b90617b12307750986761074255d409c45ad8a86.1920x1080.jpg?t=1504032584,https://cdn.akamai.steamstatic.com/steam/apps/569350/ss_320bcdb0adf599f339eb0a92c8b3944207226b8d.1920x1080.jpg?t=1504032584,https://cdn.akamai.steamstatic.com/steam/apps/569350/ss_5e5b64afa00aebc7775d496d47d51605a09e48f8.1920x1080.jpg?t=1504032584,https://cdn.akamai.steamstatic.com/steam/apps/569350/ss_98346c9edc381acf54619963a00a1c6357428b91.1920x1080.jpg?t=1504032584",
    "Slug": "robocritters",
    "Meta Title": "RoboCritters: Jul 3, 2017, Curious Dimensions Ltd and Ful...",
    "Meta Description": "Looking for information on RoboCritters? Check out the release date (Jul 3, 2017), developer insights from Curious Dimensions Ltd, and a complete game s...",
    "Alt Text Image": "Official header image for RoboCritters game - Steam 569350",
    "Canonical URL": "https://gusku.site/game/robocritters",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RoboCritters\", \"description\": \"Looking for information on RoboCritters? Check out the release date (Jul 3, 2017), developer insights from Curious Dimensions Ltd, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 3, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Curious Dimensions Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Curious Dimensions Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/569350/header.jpg?t=1504032584\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}