{
    "AppID": 683900,
    "Name": "RollerCoaster Tycoon® Classic",
    "Release date": "Sep 28, 2017",
    "About the game": "RollerCoaster Tycoon® Classic™ is a new RCT experience, remastered in 2017 by franchise creator Chris Sawyer to combine the best features from two of the most successful and beloved RCT games in the series’ history – RollerCoaster Tycoon® and RollerCoaster Tycoon® 2. Roller Coaster Tycoon Classic also comes complete with the Toolkit, Wacky Worlds, and Time Twister expansion packs!  Create and run amazing parks filled with the most outrageous rides imaginable.  RCT Classic includes a mixture of authentic playability, depth of gameplay and unique graphical style of Chris Sawyer’s original best-selling RollerCoaster Tycoon® PC Games. Packed with content, players can enjoy designing and building roller coasters and rides, landscaping parks and managing the staff and finances to keep their guests happy and the money flowing in. Can you become the next RollerCoaster Tycoon? Key Features: The Original RollerCoaster Sim: Experience all the fun from the original RollerCoaster Tycoon® and RollerCoaster Tycoon® 2 games, with a new sim that combines the best elements of both classic titles. Coaster Construction: Create incredible roller coasters – Quickly build a pre-made design or use the intuitive piece-by-piece building tools to design and theme your own unique rides. Park Designer: Keep your guests happy by building gentle or wild rides, food and drink stalls, water rides, and even transport rides to take them around the park; Customize your park by building scenery, fine-tuning the landscape, and routing the footpaths. Park Management: Run your park’s marketing and finances to make a profit while attracting more guests; Organize your staff to keep the park running well and looking its best. Exciting Environments: Build the ultimate theme park in a variety of challenging environments, from the tranquility of Forest Frontiers to the bustling commerce of Megaworld Park. Park Scenarios: Progress through 95 classic park scenarios from RollerCoaster Tycoon® and RollerCoaster Tycoon® 2. Authentic Gameplay: Classic-style isometric graphics and original amusement park music and sound effects. Packed with Content: Includes hundreds of types of roller coasters and rides, and dozens of different shops, stalls, and facilities. Expansion Packs: Wacky Worlds Expansion Pack: Find your passport and pack your bags! Wacky Worlds takes players on the ultimate trip around the globe in 17 new park scenarios! Includes exotic rides, profitable concessions and the most famous landmarks known to man including the Eiffel Tower, Big Ben, Statue of Liberty, Great Wall of China and more! Each location is packed with opportunities for success, fun and unique challenges. Time Twister Expansion Pack: Travel through time with 14 new park scenarios based on historical and fantasy time-themes and build a park that is truly a blast from the past (or future if you like). Play in a Prehistoric amusement park decorated with huge animated T-Rex’s and coasters such as the Raptor Ride, or choose from Mythological times, the Dark Ages, the Rock &amp; Roll crazed ‘50s, the Future or the Roaring Twenties. Toolkit: Park Scenario Editor: Design and build your own amazing parks – Make them as easy or as challenging as you want, using your choice of scenery and rides! Includes a number of Six Flags parks to get you started. Ride Designer: Build, test, fine-tune and theme your own awesome roller coaster designs in the Ride Designer before saving them for use while playing! Import and Export: Share your saved parks, park scenarios and ride designs with friends, and try out their creations too! (Includes the ability to import most saved parks and scenarios created with the original RollerCoaster Tycoon 2 PC game).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/683900/header.jpg?t=1633713967",
    "Price": 19.99,
    "Developers": "Origin8 Technologies Ltd.",
    "Publishers": "Atari",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/683900/ss_e956595ba232c4b2c67fa31a563157df8f39ab20.1920x1080.jpg?t=1633713967,https://cdn.akamai.steamstatic.com/steam/apps/683900/ss_41ef4deaa6fdc7de6ef2d86a3d18b219bb91d3c0.1920x1080.jpg?t=1633713967,https://cdn.akamai.steamstatic.com/steam/apps/683900/ss_9a6cbae9ff3b89ce80a68ecbee4b60aa38e93aaf.1920x1080.jpg?t=1633713967,https://cdn.akamai.steamstatic.com/steam/apps/683900/ss_2b59187cdaf02970fb5b19b303a9918496b3bca1.1920x1080.jpg?t=1633713967,https://cdn.akamai.steamstatic.com/steam/apps/683900/ss_1d93829df4649cfc6678266fd6c5053dab184070.1920x1080.jpg?t=1633713967,https://cdn.akamai.steamstatic.com/steam/apps/683900/ss_2dac327e4b5eddd35593c3ed473175340a8c553b.1920x1080.jpg?t=1633713967",
    "Slug": "rollercoaster-tycoon-classic",
    "Meta Title": "RollerCoaster Tycoon® Classic: Sep 28, 2017, Origin8 Tech...",
    "Meta Description": "Looking for information on RollerCoaster Tycoon® Classic? Check out the release date (Sep 28, 2017), developer insights from Origin8 Technologies Ltd., ...",
    "Alt Text Image": "Official header image for RollerCoaster Tycoon® Classic game - Steam 683900",
    "Canonical URL": "https://gusku.site/game/rollercoaster-tycoon-classic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RollerCoaster Tycoon\\u00ae Classic\", \"description\": \"Looking for information on RollerCoaster Tycoon\\u00ae Classic? Check out the release date (Sep 28, 2017), developer insights from Origin8 Technologies Ltd., ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 28, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Origin8 Technologies Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Atari\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/683900/header.jpg?t=1633713967\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}