{
    "AppID": 369190,
    "Name": "Shoot 'Em Up Kit",
    "Release date": "Jun 5, 2015",
    "About the game": "Create your own professional quality videogames without any programming or scripting using a simple yet powerful drag-and-drop interface. With the Shoot Em Up Kit a simple game can be created in just a few seconds while lighting, camera views, behaviours, physics settings, shaders, particle effects and AI can be created and modified to fine-tune a complex game. Royalty-free stand-alone executables can be can be created for you to sell or share with the community. Features Create your own videogame without programming Create your own 2D or 3D shoot ‘em up using a powerful graphics and audio engine. A few seconds and you have a game - creating a game can be as simple as choosing and placing a player model, choosing and placing an enemy model and clicking ‘Play’. Designed and created by games industry professionals who have worked on titles such as Rainbow Six Vegas, Hydrophobia, Assassins Creed and Far Cry 2. Use professional graphics tools ... or a pen and paper Create graphics and sound any way you want, including: 3D Modelling tools such as XSI or Milkshape Shader Editors to create in-place or post-processing shaders Pen, paper and a scanner Modelling clay and a camera Your favourite painting software The models and images included Design your own levels Build levels using your own models or drawings, or use the ones provided Set up lighting and camera views and behaviours Control the Physics settings and watch nVidia’s PhysX simulate your world Use shaders to create powerful visual effects Use default settings to create a game quickly or tweak hundreds of settings to make the game exactly as you want it Choose from many different types of AI, or blend several types together, to bring characters to life Group enemy into waves and add bonuses. Add upgrades such as new weapons or multipliers. Tools Create eye-catching particle effects Add music and sound effects to your games Customise behaviours using an easy-to-use tool which allows you to control events Build your own Front-End (Menu) screens or HUD (Head’s-Up–Display) to display the score, etc. Tutorials Tutorial Games introduce different features Videos show you step-by-step how to use the tools and features An extensive manual (100+ pages) can be used for reference Play and share your own creations Save games as EXE files Share your creations on Steam Workshop (Future feature) Technical Features Engine Direct9 engine, using XAudio2 for audio Support for user-created HLSL shaders; both model and post-process shaders Default shader supports: diffuse textures, normal mapping, specular mapping, cube mapping, ambient lighting, point lights, spotlights, and directional lights Users can use their own models (x or obj format), textures, shaders, sound effects or music Bone based (Skinned) 3D animation Sprites Create sprites from images in many formats (bmp, jpeg, png, tga, dds, dib, and more) Display in 2D or 3D space Billboard Sprites Animation Particles 2D and 3D particles Control how particles appear over their lifetime - vary speed, colour, or opacity, for example Particles can use Physics effects, and can collide with other objects Lights Point, Directional, Spotlights and Ambient lighting Unlimited lights can be placed in a scene Up to 8 active lights Levels Multiple levels per game Many settings for customising Player, NPC, Weapon and Bullet behaviours – including Speed, Inertia, Friction, Maximum ammunition, Rate of Fire, Bullet distance, etc. Tags can be placed on any entity to identify interesting points, such as thrusters or the position of a gun Sky boxes (Cubemap or custom model) Collision: Sphere, Box, Cylinder, Custom model. Pixel-perfect collisions Camera: Static, Follow Entity, Rotate in place, Move along spline, Transition effects, FOV Triggers. Link triggers to other items to allow a trigger to activate an enemy, for example; or choose pre-defined events (Kill Player, Game Over or Level Complete) Timers. Count up or down. Like Triggers, Timers can also be linked to other items, and contain pre-defined effects Checkpoints. Options to respawn enemy, reset timers, etc, if the player returns to a checkpoint NPC Generators to control NPC spawning position, frequency, maximum enemy active at once, maximum enemy created by the generator Formations of NPCs. Formations may have their own AI behaviours Splines can be placed and used by NPCs or the Camera. Splines can also be drawn as part of the scene Ground planes can be placed for the Physics system Multiple Level Complete criteria Use Gizmos to move, rotate and scale objects Undo and Redo changes Copy and Paste items for quick editing Input Keyboard, Mouse, DirectInput compatible Joystick, Xbox360 controller Support for soft-controls for touch-screen devices Tilt sensors are supported for player controls AI Many types of ‘micro-behaviours’ (MoveTo, Chase, Evade, Fire, Wait) which can be combined to produce more sophisticated behaviours Each micro-behaviour has a number of properties which allow the user to fine tune the behaviour Physics Uses nVidia’s PhysX physics simulation software Compatible with PhysX remote debugger Set mass, static and dynamic friction, linear and angular damping, and more Sound Streamed audio (ogg) Sound effects (ogg, wma and wav) in stereo or 3D audio Properties such as Panning, Range, Volume, Pitch variation and Looping Support for subtitles Control how often sounds are used or repeated Behaviour Editor Create custom events and behaviours using a drag-and-drop interface Behaviours can be created which will be triggered by many different in-game events Any properties of the game or an entity can be used or modified Use an object-oriented approach for ease-of-use Front End and HUD Customise many types of Front End pages Easily link text or graphics to data from the game to create health bars, for example Select text font, size, style and colour More details can be found on our website",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/369190/header.jpg?t=1572631186",
    "Price": 39.99,
    "Developers": "Tall Studios",
    "Publishers": "Tall Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/369190/ss_5ef258b341b17927cef35098df40aa253035de21.1920x1080.jpg?t=1572631186,https://cdn.akamai.steamstatic.com/steam/apps/369190/ss_7dd10050f70edd50bab0a11440c3a5353c73db5c.1920x1080.jpg?t=1572631186,https://cdn.akamai.steamstatic.com/steam/apps/369190/ss_e5fc6438e4dad8dd5ad18db45e6f00338695e707.1920x1080.jpg?t=1572631186,https://cdn.akamai.steamstatic.com/steam/apps/369190/ss_ddddd4e8d0a37ec0f0c17dd61d9d0d5433279441.1920x1080.jpg?t=1572631186,https://cdn.akamai.steamstatic.com/steam/apps/369190/ss_e33b31d0a51f21ccb4f79f47b40112b978ab4daa.1920x1080.jpg?t=1572631186,https://cdn.akamai.steamstatic.com/steam/apps/369190/ss_25a556cda5264c263340b6da17b3e1ce01c49855.1920x1080.jpg?t=1572631186,https://cdn.akamai.steamstatic.com/steam/apps/369190/ss_33f15b89ee1a4dc22bea14717464a3bfa812909f.1920x1080.jpg?t=1572631186",
    "Slug": "shoot-em-up-kit",
    "Meta Title": "Shoot 'Em Up Kit: Jun 5, 2015, Tall Studios and Full Over...",
    "Meta Description": "Looking for information on Shoot 'Em Up Kit? Check out the release date (Jun 5, 2015), developer insights from Tall Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Shoot 'Em Up Kit game - Steam 369190",
    "Canonical URL": "https://gusku.site/game/shoot-em-up-kit",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shoot 'Em Up Kit\", \"description\": \"Looking for information on Shoot 'Em Up Kit? Check out the release date (Jun 5, 2015), developer insights from Tall Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 5, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tall Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tall Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/369190/header.jpg?t=1572631186\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}