{
    "AppID": 1492980,
    "Name": "Shut your teeth",
    "Release date": "Jul 20, 2021",
    "About the game": "The cat is dead; its tail fell off. Whoever speaks will eat it all. Forty heaps of severed lips, Forty pails of dirty nails, The quiet game has started. Now, please. Shut your teeth. A quiet game rhyme. Shut your teeth is a kinetic visual novel that will throw you and a bunch of weird Russian characters into a secluded old condominium in Thailand where everything is a little... off. A young man named Alexey comes to spend the winter in Thailand despite financial trouble. The condominium in which he rented an apartment (solely because of the low price) is located in the middle of nowhere and turns out to be a real hellhole. When our hero begins to suspect that seemingly innocent children play creepy games and that friendly neighbors are up to no good, it's already too late. His former classmate will have to sort out all the mess: the poor guy just wants to pick up the money Alexey owes him but unwittingly finds himself drawn into a series of cryptic events that will change his life forever. KUMAN THONG The legend of Kuman Thong originates in the sixteenth century from a Thai warrior who lived in the Ayutthaya era. It was the man named Khun Phaen who created the first kuman thong in a black magic ritual. To do so, he extracted an unborn baby from the womb of his wife, whom he'd killed for trying to poison him. And so, the first golden boy was born — a powerful spirit possessing the ability to grant wishes and protect its owner. In some rural areas, Thai people still believe that stillborns can be used to produce magic amulets. The plot of «Shut your teeth» visual novel is rooted in sinister Thai folk beliefs, Kuman Thong (which means «Golden Boy») being the central topic. Game features: 2 hours of music composed in collaboration with contemporary musicians 130k words that will take 8-10 hours to read 12 characters that will make you believe in them although you'll hardly like them 100 Full HD backgrounds representing actual locations A captivating story based on folklore, traditions and cultural beliefs of Thai people Weird jokes, casual evil, creepy kids, Thai recipes and other curiosities",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1492980/header.jpg?t=1630826283",
    "Price": 0.0,
    "Developers": "Anastasia Erokhina",
    "Publishers": "Pavel Pichugin",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1492980/ss_01f964f48c019df2c7a8d7865537d261c719fd2a.1920x1080.jpg?t=1630826283,https://cdn.akamai.steamstatic.com/steam/apps/1492980/ss_e3f34911c6fd3e1ca18cc29d996e77318bb8b763.1920x1080.jpg?t=1630826283,https://cdn.akamai.steamstatic.com/steam/apps/1492980/ss_347d1459f261b0b7ea036e90c9433ce4ca8bb6f4.1920x1080.jpg?t=1630826283,https://cdn.akamai.steamstatic.com/steam/apps/1492980/ss_14dd7a8fb8e3af9c110b7677977cc214af047e3b.1920x1080.jpg?t=1630826283,https://cdn.akamai.steamstatic.com/steam/apps/1492980/ss_706946ba2cabeeefc96672b0b70aa6c16208a94e.1920x1080.jpg?t=1630826283,https://cdn.akamai.steamstatic.com/steam/apps/1492980/ss_359d8243570e1aa31712607abdc09d366c525a32.1920x1080.jpg?t=1630826283",
    "Slug": "shut-your-teeth",
    "Meta Title": "Shut your teeth: Jul 20, 2021, Anastasia Erokhina and Ful...",
    "Meta Description": "Looking for information on Shut your teeth? Check out the release date (Jul 20, 2021), developer insights from Anastasia Erokhina, and a complete game s...",
    "Alt Text Image": "Official header image for Shut your teeth game - Steam 1492980",
    "Canonical URL": "https://gusku.site/game/shut-your-teeth",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shut your teeth\", \"description\": \"Looking for information on Shut your teeth? Check out the release date (Jul 20, 2021), developer insights from Anastasia Erokhina, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Anastasia Erokhina\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pavel Pichugin\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1492980/header.jpg?t=1630826283\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}