{
    "AppID": 473530,
    "Name": "Slime-san: Superslime Edition",
    "Release date": "Apr 7, 2017",
    "About the game": "Synopsis Slime-san: Superslime Edition includes all three major campaigns as well as some brand new levels and features! Mama’s Madness: You’ve been swallowed by a giant worm! Your goal is to platform yourself through its intestines back out its mouth before you get digested! Blackbird’s Kraken: You were about to take a vacation with your family and got eaten whole by a giant Kraken?! Once more you’ll need to jump, slime &amp; slide your way out! Sheeple’s Sequel: Sheeple believes he’s an NPC in a video game and decides to recode himself as the villain! Can you beat his mind-bending levels? Superslime Edition packs an extra 10 levels where you can play as Grandpa-san himself! It also includes a “Dynamic Colors” feature that alters the game’s color palette to a unique one for each world. Slime-san’s more colorful than ever! The game also comes with a comprehensive level editor that allows you to create, share and play other people's levels across the world! Features Dynamic, fast paced platforming with unique dash, morphing and time mechanics! 3 campaigns spread across 150 normal and New Game+ levels introducing new hazards at each corner! 4 gigantic hubs to explore with a plethora of interesting characters to talk to. 4 types of collectables unlocking play styles, clothing items, shaders, mini-games and more! Extra modes like speedrunning mode, boss rush mode, target mode, rhythm mode and more! Different play styles that utterly change up how your character controls! Competitive local multiplayer mini-games that recall titles of the past! Unlock-able furniture for a fully customizable house at an island resort! An art gallery full of level design and concept sketches to peruse in! Extensive settings to customize gameplay, audio &amp; art extensively! A bombastic soundtrack featuring Adhesive Wombat, Meganeko, Kubbi, Inverse Phase, Tiasu and more! Accessibility options such as button mapping, color blind toggles &amp; eye strain modes. FULLY FLEDGED LEVEL EDITOR! And lots more! Blackbird's Kraken + Sheeple's Sequel + Superslime Edition + Level Editor This version comes bundled with the Blackbird's Kraken &amp; Sheeple's Sequel downloadable content! Two brand new campaigns with tons of cool content! Superslime content is now also available and includes brand new levels and features. Last but not least, a level editor is also included which allows you to create, share and play levels across the world! History Slime-san is the third major game developed by Fabraz . The two previous titles being Planet Diver and Cannon Crasha . Slime-san is a game that is fun down to its very core. A silly story, with an unlikely character and gameplay that is addictively fast. It offers hours of single player content yet is tailored for speed runners as well. The very core mechanics and level design lend themselves to be played competitively online. It is a visually unique adventure using a carefully crafted, 5 color palette world that is filled with fun and goofy Japanese references. It also has a soundtrack that is worth the price alone, featuring some of the most popular chiptune composers in the world! Published by Headup Games .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/473530/header.jpg?t=1649751148",
    "Price": 14.99,
    "Developers": "Fabraz",
    "Publishers": "Headup",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/473530/ss_b728c237a89784772f52d7f1d048fa5d85231c0f.1920x1080.jpg?t=1649751148,https://cdn.akamai.steamstatic.com/steam/apps/473530/ss_b36738ea6099102ba4d09feed37edabf9940ec22.1920x1080.jpg?t=1649751148,https://cdn.akamai.steamstatic.com/steam/apps/473530/ss_8889114a8c35484f00226bd8cbb67aeedb597e05.1920x1080.jpg?t=1649751148,https://cdn.akamai.steamstatic.com/steam/apps/473530/ss_0a644f7c48cc72e42a86f60acc691c911a46710e.1920x1080.jpg?t=1649751148,https://cdn.akamai.steamstatic.com/steam/apps/473530/ss_2e5628afdd9733a17a53d5fe6277833d9be70abd.1920x1080.jpg?t=1649751148,https://cdn.akamai.steamstatic.com/steam/apps/473530/ss_66bd579341240381e8e4c48847eb240b9e7b5fa1.1920x1080.jpg?t=1649751148,https://cdn.akamai.steamstatic.com/steam/apps/473530/ss_db209f1a4df21e8fc4ea73ea19ca6db966b37f8b.1920x1080.jpg?t=1649751148,https://cdn.akamai.steamstatic.com/steam/apps/473530/ss_28e43d0053a72fa3a4b1200562ed86c465926339.1920x1080.jpg?t=1649751148,https://cdn.akamai.steamstatic.com/steam/apps/473530/ss_6c5073774109153f8706233efb4cf7c42d24bc1c.1920x1080.jpg?t=1649751148,https://cdn.akamai.steamstatic.com/steam/apps/473530/ss_93ff91f7a99199068137afe5c12fc4cf49037ec9.1920x1080.jpg?t=1649751148",
    "Slug": "slime-san-superslime-edition",
    "Meta Title": "Slime-san: Superslime Edition: Apr 7, 2017, Fabraz and Fu...",
    "Meta Description": "Looking for information on Slime-san: Superslime Edition? Check out the release date (Apr 7, 2017), developer insights from Fabraz, and a complete game ...",
    "Alt Text Image": "Official header image for Slime-san: Superslime Edition game - Steam 473530",
    "Canonical URL": "https://gusku.site/game/slime-san-superslime-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Slime-san: Superslime Edition\", \"description\": \"Looking for information on Slime-san: Superslime Edition? Check out the release date (Apr 7, 2017), developer insights from Fabraz, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 7, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fabraz\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Headup\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/473530/header.jpg?t=1649751148\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}