{
    "AppID": 1517870,
    "Name": "StalakMiner",
    "Release date": "Oct 7, 2021",
    "About the game": "'Core' Game You have taken on a contract offered by a large corporation that needs you to deliver a payload to the core of the planet. Do so with haste, because this contract has been offered to many other miners that have already departed before you. In your quest to deliver the payload, you dig in search for rare metals and minerals in a planet consisting of a variety of unique zones. These resources can be sold for credits to upgrade your vehicle allowing you to dig faster, deeper and longer then your competing miners. Be careful however for there are many obstacles in your way, some more dangerous than others. Watch your fuel or your vehicle will self destruct to protect corporate secrets! Explore &amp; Upgrade Explore the deepest depths of the planet to find rare metals and minerals that will make you rich enough to buy anything your heart desires. Use the money gained from selling treasures found deep below to upgrade your vehicle at the workshop. StalakMiner features many caves well protected by Stalakmites that have killed previous explorers that left behind new technologies to unlock for your vehicle. Strategic Gameplay Each type of metal or mineral brings its own challenge in how it exists in the world of the underground. Decide wisely on how you approach digging your mine-shafts to reach the resource you want, or face the consequence of missing out on others placed nearby. You can buy and use items at the item store such as Dynamite to help blowing up rocks that block your path, Expanding foam to function as a stepstool to reach out of reach items and teleporters to quickly transport your cargo to the surface. The dangerous undergrounds contain many features such as Lava, hidden Gaspockets, Stalakmites and Rocks that block your path. As a player you get constantly challenged to find the best way around in the maze you will be digging yourself into. Customizations &amp; Rewards Every successful retrieval of minerals and metals earns you XP once sold at the mineral processor, which can be used to unlock customizations and various skins to make the vehicle look exactly the way you want. These customizations and skins are purely cosmetics and do not affect your gameplay. It is however worth noting that it feels a lot more epic to blow up things looking like a badass than it does with the stock equipment and skins every beginner gets! 10 Zones to Explore Science has taught us that planets consist of layers like an onion, and the same is true for the world of StalakMiner. Explore 10 different zones underground, each with a visually distinct look, fitting ambient sounds and more. Are you ready to explore? These zones all feature stalakmite caves containing knowledge, blueprints and more left behind from previous mining expeditions. Are you up for recovering those? Timed Challenges Occasionally your scanner will detect temporally unstable treasures such as treasure chests and skeletal remains near you. When these are detected, you have a very limited amount of time to find and reach them while keeping an eye on your health, fuel and cargo. It's a risk well worth taking considering the potential financial reward of finding such treasure. Global &amp; Friends Only Leaderboard The game features both a global and friends only leaderboard to let you enjoy beating the speed at which you all have completed the mission objective of delivering the payload to the planet's core. Beat a level faster than anyone else on the timed leaderboard, or simply show you had much more fun gaining a massive amount of score while extracting the precious resources found underground. Misc This game has been developed by the following people: - Paul Ambrosiussen - Torben van den Hurk - Jack Beeby - Tristan Reimus",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1517870/header.jpg?t=1633617618",
    "Price": 9.99,
    "Developers": "Heats Inc",
    "Publishers": "Heats Inc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1517870/ss_acaf6d68c8a185b4368a33fd56262838d848e4fd.1920x1080.jpg?t=1633617618,https://cdn.akamai.steamstatic.com/steam/apps/1517870/ss_7f35d642f6c97ddbc0736e50276b3fad4d573f4f.1920x1080.jpg?t=1633617618,https://cdn.akamai.steamstatic.com/steam/apps/1517870/ss_882bc56bab66d2f85a7fa6ec75a525153b956406.1920x1080.jpg?t=1633617618,https://cdn.akamai.steamstatic.com/steam/apps/1517870/ss_d844f25f93d852e3afb9376df7ddbfbaab904a5e.1920x1080.jpg?t=1633617618,https://cdn.akamai.steamstatic.com/steam/apps/1517870/ss_95d2e89b46179bde74bb0cdf441ee8b9b5267c41.1920x1080.jpg?t=1633617618,https://cdn.akamai.steamstatic.com/steam/apps/1517870/ss_10b42aa41013ae640ea7f6c4b597d61fb69ea441.1920x1080.jpg?t=1633617618",
    "Slug": "stalakminer",
    "Meta Title": "StalakMiner: Oct 7, 2021, Heats Inc and Full Overview",
    "Meta Description": "Looking for information on StalakMiner? Check out the release date (Oct 7, 2021), developer insights from Heats Inc, and a complete game summary.",
    "Alt Text Image": "Official header image for StalakMiner game - Steam 1517870",
    "Canonical URL": "https://gusku.site/game/stalakminer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"StalakMiner\", \"description\": \"Looking for information on StalakMiner? Check out the release date (Oct 7, 2021), developer insights from Heats Inc, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Heats Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Heats Inc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1517870/header.jpg?t=1633617618\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}