{
    "AppID": 529280,
    "Name": "TEOT - The End OF Tomorrow",
    "Release date": "Sep 30, 2016",
    "About the game": "The End of Tomorrow is a game that based on modern day not too far distance from the future. It is a story about small team that stranded in an area and trying to escape the a group of zombies and fly away to a safe place. As everyone know war could change a person, where in this story everyone can experience the world that change with the players. It is a multipart story. In this demo, player could experience as one of the character in the game first hand. We have made the game into a Virtual Reality, where player could go up close with the story, where player are actually part of the story itself. Its a short demo of 3 - 8 min gameplay depending on the level you choose. We would like to invite players to experience the game and please do give us a feedback for the demo. This game is still in progress and it is just an alpha version, and there is many more improvement needed. Therefore we hope that you guys are the pro in game could give us some feedback and ideas that you would like to see in the game. However, we are ready to give out free keys to our supporters whomever like to give a try of our game and also for those who could not afford it. In return we hope you could help us to spread the words in whichever social media you have such as facebook, youtube, twitter or twitch. It would be also be great for those who would like to try it first then support us later. We do need all the support we can get as an indie dev. We hope that we could have a chance to work on the second part which is much more exciting, where we could implement more weapons, variety of robots or creatures and interesting move using vive. Please do bear in mind it is still a beta, for those who buy it, it would be a great support to us to proceed further and we are very much grateful that you like our game and hope to see more from us. In future version (Beta 2 - Around end January 2017) we will implement extras such as different weapon applicable, player could blow up the enemy head, player could interact with co-op AI, different level of difficulty - (at the moment we realize that beginner keep dropping the weapon) and other implementation and together with player feedback. IMPORTANT!!!! You would need HTC VIVE to play the game and minimum GTX980 graphics card to play the game. We are still optimizing the game, please do forgive as this is the initial release. In future version it would be playable in GTX970 which is the minimum requirement for HTC VIVE. For those who have lower version than GTX980 you can still try, its just the lagging and missing frame that you need to bear it. A Brief Guide: To start - - Select the level you like and press the trigger twice - Then select the language - Lastly select 'Enter Virtual Reality' to start the game Weapon Guide: - Hand gun * Click the Grip to grab weapon * Aim with the virtual red dot * Pull trigger to fire - Submachine Gun * Press the Grip to grab weapon * Aim with the virtual red dot * Pull trigger to Fire bullet * Use the other hand to pull the reload at the bottom to unlock the grenade launcher - need reloading each time fires - Dagger * Click the Grip to grab weapon * Swing your weapon to kill - Pouch * There are 2 pouch on your side * Left is to keep the Dagger * Right is to keep the Hand gun or Submachine gun * Can only carry 2 weapon at once Easy - To 'Pick Up' weapon press 'Grip button' once - To 'Release' weapon press 'Grip button' once again - To 'Open Hatch' press and hold the 'Grip button', twist and release - To 'Climb' press and hold the 'Grip button' and pull down, grip one at a time. Once one grip is secure then release the other like climbing a actual ladder. Normal and Hard - To 'Pick Up' weapon press 'Grip button' and hold on - To 'Release' weapon release 'Grip button' - To 'Open Hatch' press and hold the 'Grip button', twist and release - To 'Climb' press and hold the 'Grip button' and pull down, grip one at a time. Once one grip is secure then release the other like climbing a actual ladder.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/529280/header.jpg?t=1509751918",
    "Price": 3.99,
    "Developers": "Edsenses Creative Co., Ltd",
    "Publishers": "Edsenses Creative Co., Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/529280/ss_18297325343f393d4d4d71e82be07c4eb46e80ac.1920x1080.jpg?t=1509751918,https://cdn.akamai.steamstatic.com/steam/apps/529280/ss_a1cbe3d256c3ca82ac8f824780d9fd59a0e7da8e.1920x1080.jpg?t=1509751918,https://cdn.akamai.steamstatic.com/steam/apps/529280/ss_cf769a1418343fb44b23a602ea57a951ed97aeef.1920x1080.jpg?t=1509751918,https://cdn.akamai.steamstatic.com/steam/apps/529280/ss_9a29ff2afcb1c316f23262344de97528ee65e602.1920x1080.jpg?t=1509751918,https://cdn.akamai.steamstatic.com/steam/apps/529280/ss_64a7e999344ebc4057b85a4d3aaa0d19ce6befed.1920x1080.jpg?t=1509751918",
    "Slug": "teot-the-end-of-tomorrow",
    "Meta Title": "TEOT - The End OF Tomorrow: Sep 30, 2016, Edsenses Creati...",
    "Meta Description": "Looking for information on TEOT - The End OF Tomorrow? Check out the release date (Sep 30, 2016), developer insights from Edsenses Creative Co., Ltd, an...",
    "Alt Text Image": "Official header image for TEOT - The End OF Tomorrow game - Steam 529280",
    "Canonical URL": "https://gusku.site/game/teot-the-end-of-tomorrow",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TEOT - The End OF Tomorrow\", \"description\": \"Looking for information on TEOT - The End OF Tomorrow? Check out the release date (Sep 30, 2016), developer insights from Edsenses Creative Co., Ltd, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 30, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Edsenses Creative Co., Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Edsenses Creative Co., Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/529280/header.jpg?t=1509751918\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}