{
    "AppID": 617480,
    "Name": "Tower of Time",
    "Release date": "Apr 12, 2018",
    "About the game": "Tower of Time is an incredible adventure packed with over 50 hours of gameplay, hand-crafted levels, and a rich story told through cinematics. Taking classic RPG gameplay to the next level, Tower of Time features flexible character development, thousands of pieces of loot and equipment and the complex and tactical Arrow-Time real-time combat system. Important note: Combat in Tower of Time is different. Each battle is designed like a tactical puzzle. If you want to enjoy combat, you need to pick the difficulty which is adequately challenging to you skill set and adjust it as you progress. On highest difficulty level it is very demanding and requires you to find the synergies between classes, skills and the equipment. Engaging story of epic proportions Immerse yourself in a world where technology meets magic with devastating consequences. Gather a group of diverse champions and lead them through the tower. Hundreds of lore books and scattered pieces of information slowly reveal the history of Artara as your party of adventurers approach their fate. Deep tactical real-time combat with pause or slow-time Take ultimate strategic control of each battle with the Arrow-Time combat system that slows the action down to a crawl or pauses it. Plan ahead and position your party where you need them for ultimate effect. Use Arrow-Time to react to new threats, deploy devastating new spells and attacks and counter enemy attacks. No two encounters are ever the same. On harder difficulties - look at each battle as a tactical puzzle. RPGlite and Permadeath modes For those who do not like or have time for typical long cRPG and prefer fast-paced combat oriented games - RPGlite mode cuts down the story content and lets you focus on party building and tactical combat. With Permadeath option for those who appreciate a really tough challenge and want to test their skills. Compare yourself with others via Score and DPS Race leaderboards. 7 Unique character classes, each with different strengths and weaknesses. Complex skill system with two exclusive enhancement trees and multitude of options. Skill Gestures - draw some of the skills as you want. Gravity manipulation – leap large distances to scatter your enemies or draw them in. Rich equipment system. 150 enemies with unique skills and tactics. Face 50 Bosses wielding a diverse range of skills and spells. Five difficulty levels, including Epic difficulty (not recommended for new players). Multiple combat modes ensure that there's plenty of variety and fresh challenges ahead. Travel through hand-crafted levels that have been carefully designed to challenge you. New character progression system. Unique Party Alignment system. Combat Challenges, designed to test your tactical and party-building skills. Crafting, enchanting, legendary items. Upgradeable city.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/617480/header.jpg?t=1617185717",
    "Price": 24.99,
    "Developers": "Event Horizon",
    "Publishers": "Event Horizon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/617480/ss_d28ca78406822a094b126eda693811c0a2c3837e.1920x1080.jpg?t=1617185717,https://cdn.akamai.steamstatic.com/steam/apps/617480/ss_cf98a716217ebc9c76ada21f04bdcbaa51952c57.1920x1080.jpg?t=1617185717,https://cdn.akamai.steamstatic.com/steam/apps/617480/ss_1df69fab5d04a2cec5850484956c8d4612767e89.1920x1080.jpg?t=1617185717,https://cdn.akamai.steamstatic.com/steam/apps/617480/ss_f8867626ab9ee49d2e060184763284918820ae41.1920x1080.jpg?t=1617185717,https://cdn.akamai.steamstatic.com/steam/apps/617480/ss_ade58ed5e98b961260e2325d790e3e80aed6983c.1920x1080.jpg?t=1617185717,https://cdn.akamai.steamstatic.com/steam/apps/617480/ss_a593ea643b01edd35c29ce0de49c0be401df9809.1920x1080.jpg?t=1617185717,https://cdn.akamai.steamstatic.com/steam/apps/617480/ss_d2a09508210cb4a85679b0e287e665df14490387.1920x1080.jpg?t=1617185717,https://cdn.akamai.steamstatic.com/steam/apps/617480/ss_cf98a716217ebc9c76ada21f04bdcbaa51952c57.1920x1080.jpg?t=1617185717,https://cdn.akamai.steamstatic.com/steam/apps/617480/ss_b89863fe5920e30188ec9b711dab1792e05c1dfb.1920x1080.jpg?t=1617185717,https://cdn.akamai.steamstatic.com/steam/apps/617480/ss_14250a5b0b4775c0714da45db49aa169ea80271a.1920x1080.jpg?t=1617185717",
    "Slug": "tower-of-time",
    "Meta Title": "Tower of Time: Apr 12, 2018, Event Horizon and Full Overview",
    "Meta Description": "Looking for information on Tower of Time? Check out the release date (Apr 12, 2018), developer insights from Event Horizon, and a complete game summary.",
    "Alt Text Image": "Official header image for Tower of Time game - Steam 617480",
    "Canonical URL": "https://gusku.site/game/tower-of-time",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tower of Time\", \"description\": \"Looking for information on Tower of Time? Check out the release date (Apr 12, 2018), developer insights from Event Horizon, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 12, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Event Horizon\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Event Horizon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/617480/header.jpg?t=1617185717\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}