{
    "AppID": 755550,
    "Name": "True Mining Simulator",
    "Release date": "Jan 7, 2021",
    "About the game": "True Mining Simulator will teach you to mine. We’re not talking copper, iron or coal. We’re talking money. Real money, made straight out of nowh… out of electricity. You will like it. What do you even mean? Cryptocurrency . Cryptocurrency is the kind of currency that exists only in the digital realm, arousing controversies around it and is constantly on a drastic rise (or fall). You’ve heard all about it. Everybody’s heard about it, yet few know what’s what. Basically that’s the reason we are making this game. True Mining Simulator is a full fletched simulator of a miner. A miner is a person who mines cryptocurrency . Miners purchase video cards, assemble stands and use those to earn valuable coins, which they then sell. Or keep them, hoping to get a better exchange rate. This is what you are going to be doing. Buy hardware, farm coins, sell coins, buy more hardware. And that’s it? Doesn’t look too … Ain’t it too simple? Oh yeah? Think about this for a moment: hardware must at least pay off; it must not become outdated while being delivered; 8 graphics cards in one stand must not overheat; these stands must be assembled properly; you must choose you farming station correctly, and there are plenty to choose from; if you spend all your money on hardware, what are you going to eat? Basically, this is the reason we are making this game. Mining is like chess: simple on the outside, complicated on the inside. And we suggest you figure out all mining intricacies on your own, without having to buy 10 video cards, $500 each. Okay, what else do you have in the simulator? Everything you need for a full immersion: farms must be assembled with your own hands; hunger (must eat); you have a unique chance to forget your wallet password and lose everything. And our plans for upcoming updates included: day\\night cycles, respective division of events; fatigue (must rest); ability to get employed (trust us, you will need it); you can move to a more spacious place, if you wish to do so … and if you can afford it; you can be burglarized, your house can burn down (nice, right?); Sounds interesting! When will the game be out? As soon as possible. The game is in its active development stage. You can facilitate the process by supporting us. Follow us, read, discuss and stay tuned for updates.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/755550/header.jpg?t=1629307216",
    "Price": 4.99,
    "Developers": "Boolba Entertainment",
    "Publishers": "Boolba Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/755550/ss_b6bcf0c21713402985e735c26074a3554acfdc67.1920x1080.jpg?t=1629307216,https://cdn.akamai.steamstatic.com/steam/apps/755550/ss_f4ae915840f61739a60d2ddbf9e16dd2d4982f76.1920x1080.jpg?t=1629307216,https://cdn.akamai.steamstatic.com/steam/apps/755550/ss_dc7f4d85737bc525bec59a7a16a293f627994f3b.1920x1080.jpg?t=1629307216,https://cdn.akamai.steamstatic.com/steam/apps/755550/ss_8627f6d4a709325b74a9a203e4fbe742ff174dc5.1920x1080.jpg?t=1629307216,https://cdn.akamai.steamstatic.com/steam/apps/755550/ss_e5978b95fdd67a8978ea91c5eb94ebaa2b167ac4.1920x1080.jpg?t=1629307216",
    "Slug": "true-mining-simulator",
    "Meta Title": "True Mining Simulator: Jan 7, 2021, Boolba Entertainment ...",
    "Meta Description": "Looking for information on True Mining Simulator? Check out the release date (Jan 7, 2021), developer insights from Boolba Entertainment, and a complete...",
    "Alt Text Image": "Official header image for True Mining Simulator game - Steam 755550",
    "Canonical URL": "https://gusku.site/game/true-mining-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"True Mining Simulator\", \"description\": \"Looking for information on True Mining Simulator? Check out the release date (Jan 7, 2021), developer insights from Boolba Entertainment, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Boolba Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Boolba Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/755550/header.jpg?t=1629307216\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}