{
    "AppID": 676170,
    "Name": "Ungrounded: Ripple Unleashed VR",
    "Release date": "Aug 19, 2017",
    "About the game": "Unleash your inner hero in this 16 player PvP VR arena . Fly and engage in high action aerial battles with energy blasts and charge beams. Grapple across buildings facing off against giant Titans with your two swords, or play as a Titan and crush the tiny humans going after you in this. Motion sick players be warned, this is no bars held, no teleportation, no baby steps. This game allows for Asymmetric Co-Op Multiplayer with VR and Keyboard Mouse Players. Team Deathmatch / Free For Fall: In this slayer type game, you are the Hero of Flight . Soar through large battle arena, firing Energy Blasts and Energy Beams. Strategic positioning, teamwork, dodging, and pure combat prowess are key. Energy blasts crash against enemy energy blasts. Titan Battle: As a Hero of Humanity , you are equipped only with a sword in each hand and your grappling gear . Zip through the city and fight agains(other human players) that are hell-bent on squishing you. To kill Titans, stab them with your sword. A strike to the neck will deal massive damage. As a Titan , eliminate the humans by hitting the tiny humans with your hands. You have limited movement as a Titan as well. Red Bar: Health Blue Bar: Stamina FFA / TDM: VR CONTROLS: Flight - Click either touchpad in direction of flight. Fast Flight - Click and hold both touchpads in direction of flight. Air Dash - While flying, click the grip of the same controller. Shoot Energy Blast - Trigger Charge Energy Beam - Hold Both Grips Fire Energy Beam - After charging, with both grips held, hold down either trigger. Mouse Keyboard Controls: Flight - WASD + Space for fly up + Shift for fly down. Fast Flight - Hold Q. Air Dash - Double Press Q while flying. Shoot Energy Blast - Trigger Charge Energy Beam - Hold E Fire Energy Beam - After charging, click. Titan Fight: VR Controls: Human Controls: Grapple - Trigger to fire ropes. Hold trigger to swing. Grapple Influence - While grappling, you can point the controller in a direction to held control your grapple. Grapple Boost - While grappling, click and hold the touchpad. Sword Attack - Slice the Titan with your sword to do damage. Attacks on the neck do extra damage. Titan Controls: Grapple around to move (see above). Hit humans with your hand to damage / kill them. Mouse Keyboard Controls: Human Controls: Grapple - Left or Right Click and hold. Grapple Influence - While grappling, you can use the fly controls to influence your swing. Grapple Boost - While grappling, click and hold the Q. Sword Attack - Slice the Titan with your sword to do damage. Attacks on the neck do extra damage. Press F to extend your sword Titan Controls: Grapple around to move (see above). Hit humans with your hand to damage / kill them. For Keyboard and Mouse, press F to extend your sword. General: Menu - Left Application Button Scoreboard - Right Application Button",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/676170/header.jpg?t=1503194779",
    "Price": 6.99,
    "Developers": "Joie Liba,William Wu",
    "Publishers": "Joie Liba",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/676170/ss_3e5e4c6fe824189dbbe4abadb9607460b0f64438.1920x1080.jpg?t=1503194779,https://cdn.akamai.steamstatic.com/steam/apps/676170/ss_d6b8770ec089b7cb042bb8687f29cbdf51fcbd4d.1920x1080.jpg?t=1503194779,https://cdn.akamai.steamstatic.com/steam/apps/676170/ss_6a07f1a975c5ef66da6be624adfb13fa5660f992.1920x1080.jpg?t=1503194779,https://cdn.akamai.steamstatic.com/steam/apps/676170/ss_45cf2bb25b0697d74c827faa9ff0e43cf48af4b5.1920x1080.jpg?t=1503194779,https://cdn.akamai.steamstatic.com/steam/apps/676170/ss_c4875234bed7e10e962dce8445f8b3732b93d4d7.1920x1080.jpg?t=1503194779,https://cdn.akamai.steamstatic.com/steam/apps/676170/ss_3bf844f7c4f799437eafa93a608e56bd8a30767a.1920x1080.jpg?t=1503194779,https://cdn.akamai.steamstatic.com/steam/apps/676170/ss_f402241ead6991f8ce46dea14075e81bc7d39b61.1920x1080.jpg?t=1503194779,https://cdn.akamai.steamstatic.com/steam/apps/676170/ss_140baf3c4362e6ce613481dfe7e3fb92963eb98b.1920x1080.jpg?t=1503194779",
    "Slug": "ungrounded-ripple-unleashed-vr",
    "Meta Title": "Ungrounded: Ripple Unleashed VR: Aug 19, 2017, Joie Liba,...",
    "Meta Description": "Looking for information on Ungrounded: Ripple Unleashed VR? Check out the release date (Aug 19, 2017), developer insights from Joie Liba,William Wu, and...",
    "Alt Text Image": "Official header image for Ungrounded: Ripple Unleashed VR game - Steam 676170",
    "Canonical URL": "https://gusku.site/game/ungrounded-ripple-unleashed-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ungrounded: Ripple Unleashed VR\", \"description\": \"Looking for information on Ungrounded: Ripple Unleashed VR? Check out the release date (Aug 19, 2017), developer insights from Joie Liba,William Wu, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 19, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Joie Liba,William Wu\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Joie Liba\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/676170/header.jpg?t=1503194779\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}