{
    "AppID": 621940,
    "Name": "Unleash",
    "Release date": "Oct 16, 2018",
    "About the game": "Note! We are stopping multiplayer support from October 2019 Unleash Otherworldly Nightmares Upon Your Enemies Unleash is a competitive, multiplayer Tower Wars game, while at the same time featuring a Tower Defense game mode. You build mazes of towers and walls, while spawning monsters to battle your adversaries. The larger hordes of monsters you release, the better the income you gain. Coordinate spawns and defenses to enhance their combined potential. Evolve and upgrade your forces at the right time to gain an edge over your enemy, both in offense and defense. Experience intense competitive action and find out what kind of tactician you are. Outsmart your opponents by unleashing a vast selection of monsters and towers on the battlefield. Features: 19 unique monsters with 4 upgrade levels. 13 towers with 3 upgrade levels, and three levels of walls. Up to 8-player online multiplayer. Multiple game modes, including Line Tower Wars, Team Tower Wars, Tower Defense, Tutorials and a Sandbox mode - the first two both multiplayer and singleplayer. Powerful AI, both in single- and multiplayer matches. Deep and powerful tactics and strategies at your disposal. Find out your ranking within the game’s Scoreboards. Supports offline gameplay (with no Internet connection). Story In the not so distant future, voices from the darkness reach out through the dreams of gifted children and start feeding on mankind’s negative emotions. These children are known as Dreamers. They have the ability to materialize the monsters haunting their nightmares. Opportunists see value in controlling Dreamers and their power to draw monsters into our world. Underground tournaments are created where fighters battle each other with summoned monsters. Unleash establishes the player as a competitor in life and death tournaments where the goals are to build up defenses for your base and to spawn hordes of abominable monsters to attack and destroy everything in their way through the enemies’ bases. That is where you come in. As a new fighter you must make your mark. Are you brave enough to face the monsters spawned by mankind? DeSync Studios DeSync Studios was born out of a passion for AI, Monsters and Line Tower Wars mods. We are driven by our fascination for the Warcraft 3 modding community, producing mods such as the Line Tower Wars mod, and other variations such as Wintermaul Wars and many more. We are making Unleash for the fans of the genre, for the nostalgic gamers, as well as for players who love Tower Defense in general. Our ambition is to add to the genre, and ideally to create the ultimate Tower Defense experience, both for single- and multiplayer. However, our ambition also goes beyond this. We appreciate the modding heritage, and in time, we want to give back to the modders, the indies and the newcomers to the genre.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/621940/header.jpg?t=1571100690",
    "Price": 0.0,
    "Developers": "DeSync Studios",
    "Publishers": "DeSync Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/621940/ss_2053d85af9bd1cd93e30613cf86b8494e4959cc7.1920x1080.jpg?t=1571100690,https://cdn.akamai.steamstatic.com/steam/apps/621940/ss_de532a81e770a429ed842e353823d5d59a4c94dd.1920x1080.jpg?t=1571100690,https://cdn.akamai.steamstatic.com/steam/apps/621940/ss_4c494a6551b75684be4ea4aa411329c0576184c6.1920x1080.jpg?t=1571100690,https://cdn.akamai.steamstatic.com/steam/apps/621940/ss_b66ec36d5608058e8e7e8e532f20865d95181680.1920x1080.jpg?t=1571100690,https://cdn.akamai.steamstatic.com/steam/apps/621940/ss_14436ff4ddaf429d468c0769202d3c931b5e5438.1920x1080.jpg?t=1571100690,https://cdn.akamai.steamstatic.com/steam/apps/621940/ss_53f36773b766e32e3c324cfc9248377575bcce39.1920x1080.jpg?t=1571100690,https://cdn.akamai.steamstatic.com/steam/apps/621940/ss_bb948f7cd79140694d74b618fd9853b64372ec39.1920x1080.jpg?t=1571100690,https://cdn.akamai.steamstatic.com/steam/apps/621940/ss_c32180db47a66721c17df2058bcdfb207c71af0c.1920x1080.jpg?t=1571100690",
    "Slug": "unleash",
    "Meta Title": "Unleash: Oct 16, 2018, DeSync Studios and Full Overview",
    "Meta Description": "Looking for information on Unleash? Check out the release date (Oct 16, 2018), developer insights from DeSync Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Unleash game - Steam 621940",
    "Canonical URL": "https://gusku.site/game/unleash",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Unleash\", \"description\": \"Looking for information on Unleash? Check out the release date (Oct 16, 2018), developer insights from DeSync Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 16, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"DeSync Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DeSync Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/621940/header.jpg?t=1571100690\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}