{
    "AppID": 336150,
    "Name": "Virtual Pool 4",
    "Release date": "May 11, 2015",
    "About the game": "Play 8-Ball, 9-Ball, Snooker, Billiards, Pub Pool, 27 games total! “So realistic it will make your real life pool game better!” Two career play modes, trick shots, video tutorials, multi-player online. Virtual Pool 4 is the most comprehensive cue sport game ever! Compete for a season in Pro Tour Career. Play against real pros and top amateurs as virtual opponents. Start on the Local tour and work up through the Regional, National, and finally the World tour. See tour rankings and player statistics. Try to earn all the tour achievements for each tour game. Each season includes several tournaments with different formats including single elimination, double elimination, and special invitational. Tour games include 9-Ball, 8-Ball, Snooker, Black Ball, 10-Ball, 8-Ball Pub World Rules, and Straight Pool. Play levels of Easy, Normal, Hard, Extra Hard, and Good Luck. Start in the Garage and gamble your virtual bankroll through six locations and hundreds of opponents in Hustler career play. Beat the room boss to advance to the next location. Opponents become more challenging in later locations and the betting stakes go up! Some locations occasionally have tournaments for a change of pace in this pressure packed gambling odyssey. Use some hard earned virtual cash to buy break cues, jump cues and low deflections cue shafts. Careers setup includes seventeen different game choices and five skill levels. Learn to play better pool! Video tutorials with Steve Daking cover all you need to know to improve your real life and your virtual pool game. After each tutorial segment, you can play and practice each lesson shot in Virtual Pool 4! Setup trick shots or just play them from the pool and artistic billiard trick shot libraries. You can also play friends on the same computer, practice by yourself, or play any computer opponent. Use a custom Play Cue to show some style and change the shaft to a lower deflection model for better aiming accuracy. Get a Break Cue to smash the rack harder and make more balls. Jump Cues can be used to jump over obstructing balls. Compete in online tournaments or play with friends. Single and double elimination tournaments with or without handicap. Compete as singles or teams. Player profile, friends list, awards, statistics, rankings, calendar of events, shot upload. Online lobby where players meet and chat. Great for both the friendly and competitive player. Purchase includes 1 year online as a premium player (full access) and 500 V$ which can be used to purchase cue sticks and enter tournaments. Ongoing premium status requires $9.95 yearly minimum. Grab a cue and play now!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/336150/header.jpg?t=1447365626",
    "Price": 24.99,
    "Developers": "Celeris",
    "Publishers": "Celeris",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/336150/ss_e5419d3700c5bf7ff4426c0ec97ec46f58ba5142.1920x1080.jpg?t=1447365626,https://cdn.akamai.steamstatic.com/steam/apps/336150/ss_479b6204d7a3785a04d36b4f026418dd3d564bd8.1920x1080.jpg?t=1447365626,https://cdn.akamai.steamstatic.com/steam/apps/336150/ss_6209b997ebe26ce2cd332a87cc04f9ad734cf746.1920x1080.jpg?t=1447365626,https://cdn.akamai.steamstatic.com/steam/apps/336150/ss_9b9b1f827e49f91730c2b35654a84ce7e3097cf0.1920x1080.jpg?t=1447365626,https://cdn.akamai.steamstatic.com/steam/apps/336150/ss_e56dd1989047cdc7a3997a3dc2d74e68494e4cb2.1920x1080.jpg?t=1447365626,https://cdn.akamai.steamstatic.com/steam/apps/336150/ss_e02c70289d885042195c24e090bbd4b9c3882efc.1920x1080.jpg?t=1447365626,https://cdn.akamai.steamstatic.com/steam/apps/336150/ss_f5b0787fa6c68fb843cda3f97f617d723353303f.1920x1080.jpg?t=1447365626",
    "Slug": "virtual-pool-4",
    "Meta Title": "Virtual Pool 4: May 11, 2015, Celeris and Full Overview",
    "Meta Description": "Looking for information on Virtual Pool 4? Check out the release date (May 11, 2015), developer insights from Celeris, and a complete game summary.",
    "Alt Text Image": "Official header image for Virtual Pool 4 game - Steam 336150",
    "Canonical URL": "https://gusku.site/game/virtual-pool-4",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Virtual Pool 4\", \"description\": \"Looking for information on Virtual Pool 4? Check out the release date (May 11, 2015), developer insights from Celeris, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 11, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Celeris\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Celeris\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/336150/header.jpg?t=1447365626\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}