{
    "AppID": 617700,
    "Name": "Weed Shop 2",
    "Release date": "Mar 30, 2017",
    "About the game": "The days of growing weed in your basement or some grimy apartment are over! Weed Shop 2 is going back to Cali where Proposition 64 was just passed, making recreational use of Marijuana completely legal. Your goal - to finally purchase that 89 Camaro you've been dreaming of (or become a weed kingpin, whatever tickles your pickle) by turning a run-down medical marijuana dispensary from 2014 into the hottest Weed Shop in the country! The hottest Indica, Sativa and Hybrid strains. Lots of grow equipment and capacity upgrades. Fully customizable shop inside and out. Sales, security, promo and grow staff for hire. Trippy stoned visuals and WTF tasks. Tons of missions and achievements. Ability to roll your own joints and smoke up with other stoners. An open-ish and interactive-ish beach environment. GROW Growing weed is as easy as equipping your back room with a grow-light setup, planting a seed and watering your plant till the harvest is ready. However, to make it big, you'll have to unlock higher-yield strains, use nutrients and hydro equipment as well as deal with occasional mite outbreaks. DEAL Every new business needs to promote itself to make sales even if the product is Marijuana. So grab some joints, hit the beach, hand out some free samples and you might earn a new customer or two. Take good care of your loyal customers as they will buy larger quantities for higher prices or even spread the word about your shop. HIRE Don't burn yourself out by trying to do everything on your own, hit up the Craigslist and hire some staff. The amateur employees will typically be less efficient and, if they're not stoned, sometimes even borderline worthless while the pros might break the bank and smoke all your stash but will get the job done. EXPAND The only way to make it big in the Cannabis industry is to grow and sell increasingly larger quantities of weed... or have Snoop Dogg endorse your product. Since the latter isn't going to happen anytime soon, you'll have to expand your grow room, upgrade the gear and even trick out your front shop to cater to specific groups of stoners. GROW HYDRO Step up your game by purchasing hydro grow equipment and forget about watering your plants or those pesky mites. Experiment to find the optimal balance of nutrients, water and light for each unique hydro strain for maximum yields. DIVERSIFY Turn your backroom grow-op into a real Cannabis business by creating a one-stop stoner destination. Sell weed, pre-rolled joints, bongs and other paraphernealia as well as the dopest weed edibles in town. THROW DOWN As the word about your awesome Weed Shop spreads, you'll start getting visits from all sorts of bums like deadbeat customers, shoplifters, thugs, rival dealers and even Juggalos. When that happens, grab your trusty Bum Basher (baseball bat, not the innuendo you're thinking of) and show them who's boss or just hire a bad-a** security guard if you're too stoned. GET LIT How do you get too stoned, you ask? By smoking all those joints and blunts you just rolled, of course! Okay, technically you don't really roll blunts, but we never said this was a simulator. Anyway, while baked, you'll earn more experience points, your customers will wait in line longer and your employees, oddly enough, will be more efficient at what they do. GET CARDS Collect all the Weed Shop 2 trading cards and unlock dope weed badges, backgrounds and emoticons!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/617700/header.jpg?t=1586852868",
    "Price": 9.99,
    "Developers": "ADhD Studios",
    "Publishers": "Weed Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/617700/ss_d88ab51203756bb4308d9e7e3538d0eac2867623.1920x1080.jpg?t=1586852868,https://cdn.akamai.steamstatic.com/steam/apps/617700/ss_1a5f61269006891a4d56658de78c92fde15cd099.1920x1080.jpg?t=1586852868,https://cdn.akamai.steamstatic.com/steam/apps/617700/ss_774197404f428c7c6e0cc9184d41265698cf8dc7.1920x1080.jpg?t=1586852868,https://cdn.akamai.steamstatic.com/steam/apps/617700/ss_75981254c8fe2c88dd8f215e951a5a6cdf6a19a6.1920x1080.jpg?t=1586852868,https://cdn.akamai.steamstatic.com/steam/apps/617700/ss_408259cabe46af71e012b6e26ff62f04977cefd0.1920x1080.jpg?t=1586852868,https://cdn.akamai.steamstatic.com/steam/apps/617700/ss_31cbbdb59db7547fce04d4d881047c6256d63e8d.1920x1080.jpg?t=1586852868,https://cdn.akamai.steamstatic.com/steam/apps/617700/ss_1ea719e09d52fda324c34fa2f61011291bf48299.1920x1080.jpg?t=1586852868,https://cdn.akamai.steamstatic.com/steam/apps/617700/ss_b5f2619fc6437fa9b98140b9e79ca53b21883c0c.1920x1080.jpg?t=1586852868,https://cdn.akamai.steamstatic.com/steam/apps/617700/ss_77c7c09991240eaa3dc05d44e6a15829ae2da5e9.1920x1080.jpg?t=1586852868,https://cdn.akamai.steamstatic.com/steam/apps/617700/ss_ad471833acec9b7c71204d94b913f013193dd7eb.1920x1080.jpg?t=1586852868,https://cdn.akamai.steamstatic.com/steam/apps/617700/ss_91a8b7d4ad2d234e6a9440d932f0ad87c3add815.1920x1080.jpg?t=1586852868",
    "Slug": "weed-shop-2",
    "Meta Title": "Weed Shop 2: Mar 30, 2017, ADhD Studios and Full Overview",
    "Meta Description": "Looking for information on Weed Shop 2? Check out the release date (Mar 30, 2017), developer insights from ADhD Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Weed Shop 2 game - Steam 617700",
    "Canonical URL": "https://gusku.site/game/weed-shop-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Weed Shop 2\", \"description\": \"Looking for information on Weed Shop 2? Check out the release date (Mar 30, 2017), developer insights from ADhD Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 30, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"ADhD Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Weed Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/617700/header.jpg?t=1586852868\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}