{
    "AppID": 777650,
    "Name": "Yet Another Research Dog",
    "Release date": "Feb 2, 2018",
    "About the game": "Game Overview: This is an autobiographical casual game. Based on the experience of the founder of our studio and a bunch of other researchers, the story of a research dog, who has been long-term pushed and unequally treated, is presented in the game. In this game, players need to work on boss’s countless jobs in order to make enough money for daily supply. Pressure of being fired, starving or even being mentally destroyed is always a company of the research dog. Of course, you will also experience some interesting or surprising moments, for examples, the colleague’s help (or troubles), nice gift from your neighbor(or traffic jam) and so on. Game Features: 1. Art Style: In , 99% of the elements are shaped from black and white lines. Therefore the whole game world is filled with apathy and humor. 2. Characters: The hero of the game is a personified dog. And all the roles in the game are two most common pets in real life: cats and dogs. 3. Instruments: All the instruments in the game have their prototypes in the real world. And the way you operate them is well designed. 4. Soliloquize: As a vivid character, the research dog has its own opinion towards the society, but there is only one audience of all the thoughts, himself. Considering it is a story that telling himself, why not try to turn tragedy into comedy, turn sadness into fun as possible as we can. 5. Difficulty: The game play of is roughly 1.5 hours, lasting totally 11 days in the game. Every day is tougher than the previous. New gameplay or system will be introduced every several days. Real life: We introduce some of the elements in real life in this small game: such as having meals, sleep, traffic jam, washing cloth, and so on. You will find that the things that trouble ourselves in real life will always be an company with the research dog. Game Background: Throughout the long journey of your academic career, you've had many uncommon experiences. When it's time to play as a child, you were studying; when it's time to date as a teenager, you were studying. Because of the amount of scholarship offered, you chose a relatively ordinary university; because of your not-so-sophisticated ideals, you went all the way to a Ph.D. To lighten your family's burden, you've worked as a TA, random paid-by-the-hour job, and cashier. You've done other people's assignment and attended some kid's parents' meeting for some pay. You had a procrastinative Ph.D. mentor and two interesting colleagues. One of them broke your equipment; the other graduated with research data borrowed from you. After these destructive events, you went back to your work station and stayed. Finally you got your results. You produced a dissertation good enough for Science, and handed it to your mentor with absolute joy. Your mentor kept your dissertation for nine months. Under pressure, you kept working unrequitedly. You waded through a breakup, loss of a family member, wedding of a childhood friend, and IPO of a friend's company. Your cousin, six years younger than you, had a baby when you started your Ph.D. Now her kid is old enough to sell girl scout cookies, and you're still here, waiting for an elusive diploma. Maybe your luck did an one-eighty, or maybe your mentor had a moral epiphany. He handed the dissertation back to you, untouched, and told you it's ready for publishing. That magnificent summer, you finally managed to graduate. At that fateful moment, you suddenly remembered your life-long dream. You still wanted to be a scientist. Thanks to that untouched dissertation, you got into a research institution.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/777650/header.jpg?t=1599120515",
    "Price": 0.99,
    "Developers": "Dawnblaze Entertainment",
    "Publishers": "Dawnblaze Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/777650/ss_7644033e4dbe48ca3ae704acdfd769805082cd81.1920x1080.jpg?t=1599120515,https://cdn.akamai.steamstatic.com/steam/apps/777650/ss_bdbaf7041c44d433e5320fff2481539c5f0b6b01.1920x1080.jpg?t=1599120515,https://cdn.akamai.steamstatic.com/steam/apps/777650/ss_5b41452b47559afbc603622a937946755f90838f.1920x1080.jpg?t=1599120515,https://cdn.akamai.steamstatic.com/steam/apps/777650/ss_a3c9a928d190a80dd7a295ad34ff759467c51299.1920x1080.jpg?t=1599120515,https://cdn.akamai.steamstatic.com/steam/apps/777650/ss_9e8d0498cdb9b11877bb7fa66312df713339169a.1920x1080.jpg?t=1599120515,https://cdn.akamai.steamstatic.com/steam/apps/777650/ss_0dda0bcba4e9e1de6089ffff1d167d037a11eaa4.1920x1080.jpg?t=1599120515,https://cdn.akamai.steamstatic.com/steam/apps/777650/ss_cd18a4ca076fde3c28267e648e7bc83fb8391bff.1920x1080.jpg?t=1599120515,https://cdn.akamai.steamstatic.com/steam/apps/777650/ss_089592d6f0a86bd12bd43b290c720dbdb54c79dd.1920x1080.jpg?t=1599120515,https://cdn.akamai.steamstatic.com/steam/apps/777650/ss_a3c9a928d190a80dd7a295ad34ff759467c51299.1920x1080.jpg?t=1599120515,https://cdn.akamai.steamstatic.com/steam/apps/777650/ss_74df2c1c3ce1aca222e73aee6c983fd47ff051c3.1920x1080.jpg?t=1599120515,https://cdn.akamai.steamstatic.com/steam/apps/777650/ss_74299401c4bd6064c0234c0a9f8b2a382c4438da.1920x1080.jpg?t=1599120515",
    "Slug": "yet-another-research-dog",
    "Meta Title": "Yet Another Research Dog: Feb 2, 2018, Dawnblaze Entertai...",
    "Meta Description": "Looking for information on Yet Another Research Dog? Check out the release date (Feb 2, 2018), developer insights from Dawnblaze Entertainment, and a co...",
    "Alt Text Image": "Official header image for Yet Another Research Dog game - Steam 777650",
    "Canonical URL": "https://gusku.site/game/yet-another-research-dog",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Yet Another Research Dog\", \"description\": \"Looking for information on Yet Another Research Dog? Check out the release date (Feb 2, 2018), developer insights from Dawnblaze Entertainment, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 2, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dawnblaze Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dawnblaze Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/777650/header.jpg?t=1599120515\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}