{
    "AppID": 1094820,
    "Name": "Adabana Odd Tales",
    "Release date": "Jun 18, 2020",
    "About the game": "INTRODUCTION A visual novel brought to you by Liar-soft, the makers of 'Gahkthun of the Golden Lightning' and 'Kindred Spirits on the Roof.' STORY A girl finds herself in a dark and unfamiliar forest when a monster appears out of nowhere and attacks. A mysterious boy, wielding a brush as if it were a sword, appears just in time to cut down the monster. He calls himself Kurofude, and he addresses the girl in a familiar tone as Shirohime. Yet she does not recognize him or the name he calls her. She has lost all of her memories. According to Kurofude, they are in the land of Adabana, a realm of illustrated books. Their tales are like dreams; no matter how deeply one immerses oneself in them, once one wakes up, they are gone. Thus the name Adabana—a name given to flowers that will never bear fruit. Their duty is to travel through story realms and look for signs of distortions in the tales. Shirohime, a girl with seemingly all the agency of a doll, accepts this explanation and opens a book handed to her. The title: Hanasaka Jiisan. As she opens the dilapidated illustrated book with its pages riddled with worm-eaten holes, the pages glow brightly and whisk the girl and boy away to a fairy tale realm... CHARACTER Kurofude 'Do you know what an adabana is? It's a flower that blooms and withers without ever bearing fruit.' A boy clad in black. He bears the duty of traveling through storybook realms and correcting distortions as he finds them, a task he used to do with Shirohime. He uses the brush he keeps in his brush case to restore lost text to illustrated books. He also occasionally uses his brush like a sword to cut down enemies. Calm and collected, nothing can faze him. Shirohime 'It is as though my mind is clouded.' A girl with amnesia, clad in a pure-white kimono. According to Kurofude, she used to be one of the guides correcting distorted tales before she lost her memories. She can catch the bookworms that eat an illustrated book's words and extract the eaten words in the form of ink. She is modest and softhearted. Hanasaka Jiisan (From the tale 'Hanasaka Jiisan') 'You mustn't jest like that, or else oni and snakes will come.' An old man living in a small village. A gentle, kindly old man, he was never blessed with children, but he lives a quiet life together with his good-natured wife. Otohime (From the tale 'Urashima Taro') 'You know, I've never been once unhappy, not since the day I was born.' The ruler of the Dragon Palace, a splendid palace sitting at the bottom of the sea. While she seems attractive and mysterious, she can be quite prim, and quite blunt. Urikohime (From the tale 'Urikohime to Amanojaku') 'Lies are like dreams you've woken up from.' A darling young girl living in a mountain village. She is quick-witted, and she often throws Shirohime off with her precocious, teasing remarks. Momotaro (From the tale 'Momotaro') 'Let's be off. I know the way by heart.' A young man born from a giant peach floating down a river. As righteous as his gallant appearance would suggest, he sets out on a journey to slay the oni that are making the people's lives miserable. Bookworms Strange creatures that appear to be somewhere between goldfish and catfish. They are bibliovores, and when they eat critical portions of a book's story, the story can no longer progress. Shirohime turns them to ink by touching them, and Kurofude returns the ink to the pages, thus restoring the illustrated books' original forms. STAFF Planning/Scenario : Nozomu Umihara Art/Character Design : Ryuko Oishi Music : Momoko Sapporo , Shinichiro Matsumoto System Collaboration : Silky's Plus Developed by Liar-soft Produced by ANIPLEX.EXE CAST Kurofude : Wataru Katoh Shirohime : Saki Minami Hanasaka Jiisan : Yuuki Tamai Otohime : Yuuki Kuwahara Urikohime : Natsumi Takamori Momotaro : Haruki Ishiya",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1094820/header.jpg?t=1599208552",
    "Price": 17.99,
    "Developers": "Liar-soft",
    "Publishers": "ANIPLEX.EXE",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1094820/ss_a8a3884fcae42f4d338fbf995a15e735cff3922d.1920x1080.jpg?t=1599208552,https://cdn.akamai.steamstatic.com/steam/apps/1094820/ss_b6bd0f1175a98994213194c0f107ad0ab2a56a4f.1920x1080.jpg?t=1599208552,https://cdn.akamai.steamstatic.com/steam/apps/1094820/ss_9309dacda432db961b260f49ddb04b54ba392265.1920x1080.jpg?t=1599208552,https://cdn.akamai.steamstatic.com/steam/apps/1094820/ss_1173da422077c8e5d815ddc249df3140d47b05cf.1920x1080.jpg?t=1599208552,https://cdn.akamai.steamstatic.com/steam/apps/1094820/ss_4d3925e362b3d6a8ba74d4d3bccc3e181516a73e.1920x1080.jpg?t=1599208552,https://cdn.akamai.steamstatic.com/steam/apps/1094820/ss_c83a8387c6ca5d165b2f98cf9b7f15492d555301.1920x1080.jpg?t=1599208552,https://cdn.akamai.steamstatic.com/steam/apps/1094820/ss_233f9490fe7bec9fee6834d94272cbff09bdfd39.1920x1080.jpg?t=1599208552,https://cdn.akamai.steamstatic.com/steam/apps/1094820/ss_63d37bd7fbdb3d6c4bad29e706d9545cf30da313.1920x1080.jpg?t=1599208552,https://cdn.akamai.steamstatic.com/steam/apps/1094820/ss_d8d0328a680548b9204f5c64b182ca5370d1cdd4.1920x1080.jpg?t=1599208552",
    "Slug": "adabana-odd-tales",
    "Meta Title": "Adabana Odd Tales: Jun 18, 2020, Liar-soft and Full Overview",
    "Meta Description": "Looking for information on Adabana Odd Tales? Check out the release date (Jun 18, 2020), developer insights from Liar-soft, and a complete game summary.",
    "Alt Text Image": "Official header image for Adabana Odd Tales game - Steam 1094820",
    "Canonical URL": "https://gusku.site/game/adabana-odd-tales",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Adabana Odd Tales\", \"description\": \"Looking for information on Adabana Odd Tales? Check out the release date (Jun 18, 2020), developer insights from Liar-soft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Liar-soft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ANIPLEX.EXE\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1094820/header.jpg?t=1599208552\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}