{
    "AppID": 208650,
    "Name": "Batman™: Arkham Knight",
    "Release date": "Jun 23, 2015",
    "About the game": "Batman™: Arkham Knight brings the award-winning Arkham trilogy from Rocksteady Studios to its epic conclusion. Developed exclusively for New-Gen platforms, Batman: Arkham Knight introduces Rocksteady's uniquely designed version of the Batmobile. The highly anticipated addition of this legendary vehicle, combined with the acclaimed gameplay of the Arkham series, offers gamers the ultimate and complete Batman experience as they tear through the streets and soar across the skyline of the entirety of Gotham City. In this explosive finale, Batman faces the ultimate threat against the city that he is sworn to protect, as Scarecrow returns to unite the super criminals of Gotham and destroy the Batman forever. Product Features: “Be The Batman” – Live the complete Batman experience as the Dark Knight enters the concluding chapter of Rocksteady’s Arkham trilogy. Players will become The World’s Greatest Detective like never before with the introduction of the Batmobile and enhancements to signature features such as FreeFlow Combat, stealth, forensics and navigation. Introducing the Batmobile – The Batmobile is brought to life with a completely new and original design featuring a distinct visual appearance and a full range of on-board high-tech gadgetry. Designed to be fully drivable throughout the game world and capable of transformation from high speed pursuit mode to military grade battle mode, this legendary vehicle sits at the heart of the game’s design and allows players to tear through the streets at incredible speeds in pursuit of Gotham City’s most dangerous villains. This iconic vehicle also augments Batman’s abilities in every respect, from navigation and forensics to combat and puzzle solving creating a genuine and seamless sense of the union of man and machine. The Epic Conclusion to Rocksteady’s Arkham Trilogy – Batman: Arkham Knight brings all-out war to Gotham City. The hit-and-run skirmishes of Batman: Arkham Asylum, which escalated into the devastating conspiracy against the inmates in Batman: Arkham City, culminates in the ultimate showdown for the future of Gotham. At the mercy of Scarecrow, the fate of the city hangs in the balance as he is joined by the Arkham Knight, a completely new and original character in the Batman universe, as well as a huge roster of other infamous villains including Harley Quinn, The Penguin, Two-Face and the Riddler. Explore the entirety of Gotham City – For the first time, players have the opportunity to explore all of Gotham City in a completely open and free-roaming game world. More than five times that of Batman: Arkham City, Gotham City has been brought to life with the same level of intimate, hand-crafted attention to detail for which the Arkham games are known. Most Wanted Side Missions – Players can fully immerse themselves in the chaos that is erupting in the streets of Gotham. Encounters with high-profile criminal masterminds are guaranteed while also offering gamers the opportunity to focus on and takedown individual villains or pursue the core narrative path. New Combat and Gadget Features – Gamers have at their disposal more combat moves and high-tech gadgetry than ever before. The new ‘gadgets while gliding’ ability allows Batman to deploy gadgets such as batarangs, the grapnel gun or the line launcher mid-glide while Batman’s utility belt is once again upgraded to include all new gadgets that expand his range of forensic investigation, stealth incursion and combat skills.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/208650/header.jpg?t=1634156452",
    "Price": 19.99,
    "Developers": "Rocksteady Studios",
    "Publishers": "Warner Bros. Interactive Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/208650/ss_90026e46a995760d53bfa2dc1612b73960c84c94.1920x1080.jpg?t=1634156452,https://cdn.akamai.steamstatic.com/steam/apps/208650/ss_4c9d5fb849b1a7169184a37db000919b276056fe.1920x1080.jpg?t=1634156452,https://cdn.akamai.steamstatic.com/steam/apps/208650/ss_5da3185e4f7da999300555747be6b84b8f16164f.1920x1080.jpg?t=1634156452,https://cdn.akamai.steamstatic.com/steam/apps/208650/ss_43ac2ec5dc64f59b1816b1cc0ba5b430d36c636f.1920x1080.jpg?t=1634156452,https://cdn.akamai.steamstatic.com/steam/apps/208650/ss_88b07767c3d67b3d5be85fb27c97527770a98e7e.1920x1080.jpg?t=1634156452,https://cdn.akamai.steamstatic.com/steam/apps/208650/ss_0093e9b8191093a1c97187079adb3d93a8ba6cf9.1920x1080.jpg?t=1634156452,https://cdn.akamai.steamstatic.com/steam/apps/208650/ss_9ccb4ec0388cd868c0f49580f98da94e8bd0e213.1920x1080.jpg?t=1634156452,https://cdn.akamai.steamstatic.com/steam/apps/208650/ss_8dd2a78400463d6924b9dc8ce1e734420414af3d.1920x1080.jpg?t=1634156452,https://cdn.akamai.steamstatic.com/steam/apps/208650/ss_0631bea114bcb67866f59fb82cab6c31f2f760c6.1920x1080.jpg?t=1634156452,https://cdn.akamai.steamstatic.com/steam/apps/208650/ss_315ff2cdd5f50d28614ae9cfa45283bb2b9f969e.1920x1080.jpg?t=1634156452,https://cdn.akamai.steamstatic.com/steam/apps/208650/ss_ccff12cebf58bc7d1d3e0a5783eba65c4aecf345.1920x1080.jpg?t=1634156452",
    "Slug": "batman-arkham-knight",
    "Meta Title": "Batman™: Arkham Knight: Jun 23, 2015, Rocksteady Studios ...",
    "Meta Description": "Looking for information on Batman™: Arkham Knight? Check out the release date (Jun 23, 2015), developer insights from Rocksteady Studios, and a complete...",
    "Alt Text Image": "Official header image for Batman™: Arkham Knight game - Steam 208650",
    "Canonical URL": "https://gusku.site/game/batman-arkham-knight",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Batman\\u2122: Arkham Knight\", \"description\": \"Looking for information on Batman\\u2122: Arkham Knight? Check out the release date (Jun 23, 2015), developer insights from Rocksteady Studios, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 23, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rocksteady Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Warner Bros. Interactive Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/208650/header.jpg?t=1634156452\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}