{
    "AppID": 793190,
    "Name": "Daily OVR",
    "Release date": "Jun 20, 2018",
    "About the game": "Before you buy Daily OVR doesn't support games that only run on Oculus SDK. Don't buy it if you only want to use it to play games that you bought on Oculus Store. What is Daily OVR? Do you want to use your desktop/window apps during VR gameplay? For example, you can play VRChat and see your Twitch chat window. Daily OVR is the best SteamVR Overlay(OVR) solution! And it supports Oculus, Vive/Viveport/Cosmos/MR(Mixed Reality)/Index! Why do you need Daily OVR? How many times have you wanted to check your Twitch chat room or watch a Youtube video while playing a VR game? Do you feel that most VR Overlay tools in the market are too tricky to set up, you want to have a relatively easy way to use? Overlays in the market now have default buttons that conflict with your favorite game, so you can't enjoy it? Daily OVR can help you solve these problems. We have been working on developing the Overlay tool that users like, which allows users to experience VR games and efficiently multitask at the same time. We have provided the Demo version for you to test. Don't doubt! Use it now! Here is the beginner tutorial: _,.-'~'-.,__,.-'~'-.,__,. Features .,__,.-'~'-.,__,.-'~'-.,_ The most user-friendly OVR UI. Mirror your favorite Windows applications into VR game. Mirror the desktop or monitors. QuickSwitch let you quickly switch among programs. Save the frequently used settings to 'My Favorites.' Adjust the size, transparency, and placement of overlays and keep your settings for next time. Easily launch the virtual keyboard on the overlay toolbar. Overlay FPS adjustment on the overlay toolbar. Bind the overlay to different controllers or the HMD or HTC Vive trackers. Support Oculus &amp; Windows MR &amp; Index (through SteamVR) VR Phone Notification Pop-up. Daily OVR allows you to bring your Android phone notification into the VR view; you won't miss important messages anymore. - Phone calling notification - SMS - WhatsApp - LINE Support SteamVR 2.0 Input. (You can customize button settings yourself!) ML Object detection and display (Ex: keyboard, mouse, cat, dog, cup, person) (Note: Vive &amp; Vive Pro only) A handy VR keyboard A Clock widget You have to download Android app: Daily OVR to enable 'Mobile phone notification.' Scan the QR code below and download Daily OVR app on Google Play now! _,.-'~'-.,__,.-'~'-.,__,. FAQ .,__,.-'~'-.,__,.-'~'-.,_ Daily OVR doesn't work in some games. For example, Elite dangerous, PokerStarVR ...etc The issue is caused by Elite Dangerous tries to run in Oculus SDK mode. Daily OVR doesn’t support Oculus SDK. So you have to do some works for forcing it to run in SteamVR mode. You can follow the steps here: -vr-questionanswer/#windows7-compat How many overlays can I open? It depends on your PC's performance. If performance is terrible, you could try: Close the overlays Set lower FPS value The button mappings of controllers are not good. Can I change it? Daily OVR supports SteamVR 2.0 Input. You can customize button settings yourself. I don't like the big icon/logo! Can I make it disappear? Yes, you can hide the icon by long-pressing a button. See below: I cannot see/move my mouse pointer on some apps! Some apps run as administrator permission. When Daily OVR doesn't run as the same permission, it cannot access to those apps. You have to check 'Run this program as an administrator' on DailyVRLauncher.exe Properties. My Firefox screen is blank! You have two options: 1. You have to disable the hardware acceleration of Firefox. See below: 2. Use CustomApp instead Join Daily OVR Discord and share your feedback with us! Here is Discord invitation link: Daily OVR Discord",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/793190/header.jpg?t=1585157017",
    "Price": 3.99,
    "Developers": "TM xR Lab",
    "Publishers": "TM xR Lab",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/793190/ss_dae233c8009f86a692c38d1d49e7c75ab3a3a5a8.1920x1080.jpg?t=1585157017,https://cdn.akamai.steamstatic.com/steam/apps/793190/ss_f5b104528ca43d09829493386aad6213a3ca0142.1920x1080.jpg?t=1585157017,https://cdn.akamai.steamstatic.com/steam/apps/793190/ss_a4b1ded4e14fd2214853ca7ce356dd28bd2657d1.1920x1080.jpg?t=1585157017,https://cdn.akamai.steamstatic.com/steam/apps/793190/ss_65f9da9f1b25857d2769d45d7cbba0c683b8fcc3.1920x1080.jpg?t=1585157017,https://cdn.akamai.steamstatic.com/steam/apps/793190/ss_c0f9546def69c339c3667f3929d1ad3b950635c6.1920x1080.jpg?t=1585157017,https://cdn.akamai.steamstatic.com/steam/apps/793190/ss_787479bf6fefefe39a160e937839a96ba1bf8809.1920x1080.jpg?t=1585157017,https://cdn.akamai.steamstatic.com/steam/apps/793190/ss_9d2fd0c064efbb57c75452353f78bb1df48acf97.1920x1080.jpg?t=1585157017,https://cdn.akamai.steamstatic.com/steam/apps/793190/ss_4d03204f75f2ffdf60dd6523df54dc47fc8f0acb.1920x1080.jpg?t=1585157017",
    "Slug": "daily-ovr",
    "Meta Title": "Daily OVR: Jun 20, 2018, TM xR Lab and Full Overview",
    "Meta Description": "Looking for information on Daily OVR? Check out the release date (Jun 20, 2018), developer insights from TM xR Lab, and a complete game summary.",
    "Alt Text Image": "Official header image for Daily OVR game - Steam 793190",
    "Canonical URL": "https://gusku.site/game/daily-ovr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Daily OVR\", \"description\": \"Looking for information on Daily OVR? Check out the release date (Jun 20, 2018), developer insights from TM xR Lab, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 20, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"TM xR Lab\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TM xR Lab\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/793190/header.jpg?t=1585157017\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}