{
    "AppID": 1153980,
    "Name": "Darkness Maze Cube - Hardcore Puzzle Game",
    "Release date": "Jan 28, 2020",
    "About the game": "A new perspective for traditional maze games. Tired of games where there are tips and tutorials of all kinds and you can finish them without much difficulty? If the answer is YES; YOU'RE IN THE RIGHT PLACE, DARKNESS MAZE CUBE it's the right game for you! In brief, it means that ONLY THE ELITE OF PLAYERS CAN FINISH THIS GAME and find out what will happen in the end! The game was made for you to feel that you are in a dangerous exploration of empty hands where your only resources are hearing , vision and your special abilities , while exploring the mazes your memory , determination, agility and attention to every detail of the environment including sounds can be the difference between predicting an attack and escaping death , solving a puzzle or succumbing to the maze! - Game Details: Practice makes perfect, in this game dying is part of the learning and as you pass the phases you will notice you can get through them more easily, because you will have a learning background until a new challenge appears. In this game your most precious asset is your life , so try to accumulate as much as you can and be careful when venturing into the mazes, because if it reaches zero and you have not found the SAVE POINT it will be Game Over and all progress will be lost. Made for the strong, who don't back down from frustrations, as explained above this game was made for the strong and if you finish this game, YOU'LL BE AMONG AN ELITE OF STRONG PLAYERS! Leaderboard In this game take risks, generate more points, the less you use SAVE POINT the more points you will earn, show the world your score and challenge others to beat it. A game with simpler graphics and animations in reference to old games, in a dark setting, which conveys the presence of death to adventurers, with ominous, immersive sound. A game that aims to challenge the most experienced in Hardcore, survival and puzzle. Brutal HardCore style game that will push your determination to the limit. Test your skills and have fun finding ways to overcome mazes on your own. Game Modes: Adventure: Deadly mazes where only the strong will survive. HardCore: If you found Adventure Mode difficult, this one you will find it HELL, in this game mode many of the traps will be hidden, you will depend even more on your memory and agility, it will be much harder to come alive and find save points, with just a slip you will surely find death. Time For Life: Want to beat developer time? This is your opportunity! The levels are the same as in adventure mode, but to make your life more difficult the maze puts a bomb on our hero's body; if he doesn't complete the phase within the given time 'BOOM!' death is certain! Relaxing mode: Enjoy all the mazes in the game with no enemies, traps or collectables, just for the pleasure of discovering the exit portal to the next maze. Oh! Just to make it difficult ... LOL, the exit portal is random, meaning every time you play it will be in a different place, so you can play this mode as many times as you want. Seemingly simple mazes but prepared to complicate your life mazes, find the clues left by the Cubic Matrix to solve puzzles more easily, as a wrong answer can be costly! Your reaction time will be put to the test all the time. Accumulating cubics to ensure extra lives, finding the save point and memorizing the position of some enemies are the key to survival. - The Maze: Embedded in the depths it is a living trap and will do its best to prevent you from discovering the secrets and mysteries of the “Cubic Dies”. “If you find the ' Red Eye '... just run.' - Save Point: All mazes have a hidden one, but it will not be an easy task to find and reach it, often it will be your salvation in case of running out of lives, so you do not have to start from the first maze again. - Cubic Matrix: Hidden in the maze are mysterious entities endowed with magical and light power. Legend tells that secrets will be revealed and something SPECIAL will happen to the brave adventurer who makes it to the end of the maze. - The Cube: A brave adventurer determined to reveal the secrets and mysteries of the Cubic Matrix and become the greatest cubic explorer in the universe. (Is there another hidden purpose?) - Bonus Level: Beat all 16 levels in Hard Core Mode and unlock 2 secret levels to win. A game for the strong, take your agility, determination, attention and memory to the limit in a “Brutal HardCore” world where your chances are slim!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1153980/header.jpg?t=1610765671",
    "Price": 1.19,
    "Developers": "YAW Studios",
    "Publishers": "YAW Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1153980/ss_78845338e6fc7d23a3d06096e43445be2f093b37.1920x1080.jpg?t=1610765671,https://cdn.akamai.steamstatic.com/steam/apps/1153980/ss_3593277e714c472b5e0682736a2fca3d23778d60.1920x1080.jpg?t=1610765671,https://cdn.akamai.steamstatic.com/steam/apps/1153980/ss_9f840f7cc5986b69f221b4651e05527e086b94d3.1920x1080.jpg?t=1610765671,https://cdn.akamai.steamstatic.com/steam/apps/1153980/ss_87d84521362e80f1d7051f53b41db0f4c1958b4e.1920x1080.jpg?t=1610765671,https://cdn.akamai.steamstatic.com/steam/apps/1153980/ss_7a4161958969f378b96f6ca7d63ac2c17275f621.1920x1080.jpg?t=1610765671,https://cdn.akamai.steamstatic.com/steam/apps/1153980/ss_c8b1b1317c9e8d5bf1ae55e97ef06d1a48a61587.1920x1080.jpg?t=1610765671,https://cdn.akamai.steamstatic.com/steam/apps/1153980/ss_2ecc2bf2a16c58eb362761ff8dfb15dca5792d94.1920x1080.jpg?t=1610765671,https://cdn.akamai.steamstatic.com/steam/apps/1153980/ss_edd44f846e2223ede933986d2879ce2e9153307c.1920x1080.jpg?t=1610765671",
    "Slug": "darkness-maze-cube-hardcore-puzzle-game",
    "Meta Title": "Darkness Maze Cube - Hardcore Puzzle Game: Jan 28, 2020, ...",
    "Meta Description": "Looking for information on Darkness Maze Cube - Hardcore Puzzle Game? Check out the release date (Jan 28, 2020), developer insights from YAW Studios, an...",
    "Alt Text Image": "Official header image for Darkness Maze Cube - Hardcore Puzzle Game game - Steam 1153980",
    "Canonical URL": "https://gusku.site/game/darkness-maze-cube-hardcore-puzzle-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Darkness Maze Cube - Hardcore Puzzle Game\", \"description\": \"Looking for information on Darkness Maze Cube - Hardcore Puzzle Game? Check out the release date (Jan 28, 2020), developer insights from YAW Studios, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 28, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"YAW Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"YAW Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1153980/header.jpg?t=1610765671\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}