{
    "AppID": 279580,
    "Name": "Devil's Dare 悪魔の挑戦",
    "Release date": "Oct 21, 2014",
    "About the game": "Devil's Dare is a 2D zombie beat'em up, supporting up to 4 players to co-op and fight together locally. Being the spritual successor to Bitejacker, Devil's Dare carries the same theme of parodies, pitting classic game heroes against monsters straight out of 90s horror movies. Devil's Dare doesn't just relies on grinding and leveling up, but instead introduces permadeath to keep players on their toes. With every kill, the player makes some cash, which you can use to purchase upgrades or save it to revive when you're dead. When you run out of cash completely, you are dead for good and it's time to start over again. This is a mechanic inspired by the good old arcade days, where every death meant another penny wasted! Our main influence were some of Capcom's classics like Alien vs. Predator, Battle Circuit, Final Fight as well as Sega's Streets of Rage Series. So if you were a fans of those, give it a shot. I'm sure you will find something to love in Devil's Dare. Play as one of the 4 unique characters, each with their own unique roles and abilities. Every one of them has their pros and cons, so learn to understand your character and fight with your strength! The game also has a dynamic difficulty. This means that the bigger your party, the bigger the mess. More enemies, tougher monsters and most important of all, you share your loot! Back in the good old arcade days, beat'em up were serious business! Every death is a penny wasted and every kill is a step closer to being the baddest ass in the neighbourhood with the highest score. Our permadeath mechanic is inspired by this very mechanic. Learn not just to kill, but kill with style. Perform a fatality to make more cash, which you can use to purchase upgrades or pay to revive when you are dead. And if you run out of cash to revive, you better hope you bought a soul token, because otherwise, it's game over. All the remaining cash is submitted as your score, and it's time to start all over. Make no mistake. You are going to die, and you're going to die a lot. But death in Devil's Dare is meant to be savored and embraced! Play again and again as different characters and pick a different path each time. There's a different boss guarding each level, and the awaiting boss gets stronger and stronger based on your selected sequence. Remember, you haven't finish the game until you beat them all!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/279580/header.jpg?t=1447360410",
    "Price": 12.99,
    "Developers": "Secret Base",
    "Publishers": "Secret Base",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/279580/ss_ada14f6233aac74337e8400b2a9f9d09bdb1f798.1920x1080.jpg?t=1447360410,https://cdn.akamai.steamstatic.com/steam/apps/279580/ss_4f06af2a35f4276c1ebd4f089499503708db7178.1920x1080.jpg?t=1447360410,https://cdn.akamai.steamstatic.com/steam/apps/279580/ss_de619ba6c8cc123f070838e333413f39ae90845e.1920x1080.jpg?t=1447360410,https://cdn.akamai.steamstatic.com/steam/apps/279580/ss_9f5e96d1d34cd6c6b005afa96d0d3ebd8caae109.1920x1080.jpg?t=1447360410,https://cdn.akamai.steamstatic.com/steam/apps/279580/ss_80904c06a1b1e8c9d35e764ed74511457d700cf9.1920x1080.jpg?t=1447360410,https://cdn.akamai.steamstatic.com/steam/apps/279580/ss_5af1af000a384fed40eee73f175ae5e5ce62022a.1920x1080.jpg?t=1447360410,https://cdn.akamai.steamstatic.com/steam/apps/279580/ss_1fe0971fb40e1e74029c2c3fcbb54c3b11be266f.1920x1080.jpg?t=1447360410,https://cdn.akamai.steamstatic.com/steam/apps/279580/ss_9d37148d5941ec9ebb7804a8e39b8220f06271f1.1920x1080.jpg?t=1447360410",
    "Slug": "devil-s-dare",
    "Meta Title": "Devil's Dare 悪魔の挑戦: Oct 21, 2014, Secret Base and Full Ov...",
    "Meta Description": "Looking for information on Devil's Dare 悪魔の挑戦? Check out the release date (Oct 21, 2014), developer insights from Secret Base, and a complete game summary.",
    "Alt Text Image": "Official header image for Devil's Dare 悪魔の挑戦 game - Steam 279580",
    "Canonical URL": "https://gusku.site/game/devil-s-dare",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Devil's Dare \\u60aa\\u9b54\\u306e\\u6311\\u6226\", \"description\": \"Looking for information on Devil's Dare \\u60aa\\u9b54\\u306e\\u6311\\u6226? Check out the release date (Oct 21, 2014), developer insights from Secret Base, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 21, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Secret Base\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Secret Base\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/279580/header.jpg?t=1447360410\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}