{
    "AppID": 895370,
    "Name": "DollKart",
    "Release date": "Aug 1, 2018",
    "About the game": "DollKart is a survival race against time. There is an infinite number of procedurally generated tracks to conquer both alone and with a friend in split screen. Handling The physics engine is roughly a simcade, mirroring real go karts but adding a lot more speed to them(because if you aren't almost dead, you're not having fun). The game is enjoyable without being a good driver, however, if you want to do good, you'll have to drive skillfully. Single Player In single player, your goal is to score as many points as possible by driving quickly through the tracks. Game's over when you fall off the track, your ragdoll character falls off the kart or when you run out of time(or all of these at once, if you're really bad). Split Screen In the split screen mode, your goal is to outrun one another on the same difficult tracks as before, dying or falling off the track means losing instantly. Online DUE TO UNFORESEEN TECHNICAL ISSUES, THE ONLINE MULTIPLAYER FOR DOLLKART IS BROKEN. We are unable to fix this due to the sourcecode of the game being now unrecoverable. We appreciate your understanding. Soundtrack We have a soundtrack of 8 songs ranging from relaxed synthwave to gritty metal for you to do your driving with, the songs are played in random order and can be skipped or muted in game. Future Updates The game will be supported in terms of bug fixes, minor updates etc.. More content updates are possible, but if they will happen depends on community enthusiasm and size. The game as it stands is stable and final, especially for the offline modes. The multiplayer may need some minor fixes and changes over time. OKSoft We are a group of 4 Turkish high schoolers who enjoy games and STEM. This is our first PC release. We've gathered together under the context of a school project to make this game come to life. OKSoft normally operates as a one-person team, but this project needed the expertise and help of more. Future games may be made by the founder alone or with external help as this project was made. We hope from the bottom of our hearts that you will find enjoyment and hours of fun in DollKart. Feel free to contact us for any opinions, ideas etc. on the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/895370/header.jpg?t=1590371960",
    "Price": 2.99,
    "Developers": "OKSoft",
    "Publishers": "OKSoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/895370/ss_6fe3e4806c58bb124c7be0242e494ca290360182.1920x1080.jpg?t=1590371960,https://cdn.akamai.steamstatic.com/steam/apps/895370/ss_9ff595a63c32e257f53e20e77f6f2f325670a601.1920x1080.jpg?t=1590371960,https://cdn.akamai.steamstatic.com/steam/apps/895370/ss_98cdc1c13dc067059527354822d5a2f18392b697.1920x1080.jpg?t=1590371960,https://cdn.akamai.steamstatic.com/steam/apps/895370/ss_e5a99f39691309062b0d943506376f10164ba485.1920x1080.jpg?t=1590371960,https://cdn.akamai.steamstatic.com/steam/apps/895370/ss_226f856ac40b129aee59f0969f4e54ca45f8e866.1920x1080.jpg?t=1590371960",
    "Slug": "dollkart",
    "Meta Title": "DollKart: Aug 1, 2018, OKSoft and Full Overview",
    "Meta Description": "Looking for information on DollKart? Check out the release date (Aug 1, 2018), developer insights from OKSoft, and a complete game summary.",
    "Alt Text Image": "Official header image for DollKart game - Steam 895370",
    "Canonical URL": "https://gusku.site/game/dollkart",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DollKart\", \"description\": \"Looking for information on DollKart? Check out the release date (Aug 1, 2018), developer insights from OKSoft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 1, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"OKSoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OKSoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/895370/header.jpg?t=1590371960\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}