{
    "AppID": 1222690,
    "Name": "Dragon Age™ Inquisition",
    "Release date": "Jun 4, 2020",
    "About the game": "When the sky opens up and rains down chaos, the world needs heroes. Become the savior of Thedas in Dragon Age: Inquisition – Game of the Year Edition. You are the Inquisitor, tasked with saving the world from itself. But the road ahead is paved with difficult decisions. Thedas is a land of strife. Factions constantly war with each other even as a larger demonic invasion has begun. And you? You and your band of champions are the only ones who can hold it together. It’s your job to lead them...or fall. Enthralling, choice-driven narrative — You’re not just deciding who to send into which battle in Inquisition, you’re making important decisions that shape the future of Thedas. Each choice carries weight, and your actions can lead to a variety of outcomes. Inquisition is a highly personalized journey, where one wrong move could set in motion a series of events that alter the physical aspects of the world itself, making your Thedas — and your heroes — feel truly unique. A massive world to discover — The world of Thedas has never been bigger or more detailed; it’s wide open and ripe for exploration. Discover enemy keeps ripe for the taking. Unearth hidden caves filled with lurking creatures. Thedas is vast and dangerous, but uncovering its secrets can spell the difference between victory and defeat. Intense, strategic combat — There’s no wrong way to play Dragon Age: Inquisition...except for the way that gets you killed. Fortunately, the optional strategic view gives you a god’s-eye vantage on battle. Time stops while you plan in this view, but if that’s not your style, you can just barrel ahead, crossbows blazing. The Game of the Year edition comes with: Base game Flames of the Inquisition Arsenal, Armor, and Armored Mount Dragon Age multiplayer Deluxe Edition chests Skyhold Throne, Red Hart Halla, and Bog Unicorn Digital soundtrack Jaws of Hakkon DLC Pack The Descent DLC Pack Trespasser DLC Pack Spoils of the Avvar — 5 new mounts, 2 new sets of armor, and new options to personalize your base at Skyhold. Spoils of the Qunari — an armored war mount, new armor sets — including one in the style of the Arishok — and Skyhold items. • Jaws of Hakkon DLC Discover the fate of the last Inquisitor and the powerful dragon he hunted. • The Descent DLC Go underground to reveal the source of mysterious earthquakes threatening Thedas. • Trespasser DLC Decide the Inquisition’s final fate as new threats emerge.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1222690/header.jpg?t=1633006819",
    "Price": 39.99,
    "Developers": "BioWare",
    "Publishers": "Electronic Arts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1222690/ss_4c90bdbb1c2567edec0778f2e8956d1a8ff1b4c3.1920x1080.jpg?t=1633006819,https://cdn.akamai.steamstatic.com/steam/apps/1222690/ss_a106df995b9051e24ebe5abdec168ea3495bfda4.1920x1080.jpg?t=1633006819,https://cdn.akamai.steamstatic.com/steam/apps/1222690/ss_e8e2d622313d983fc9eb3fd824a2e0401c247780.1920x1080.jpg?t=1633006819,https://cdn.akamai.steamstatic.com/steam/apps/1222690/ss_df4fb7825aef29e53e4b3e5dbb6c8dc6cd6e16d9.1920x1080.jpg?t=1633006819,https://cdn.akamai.steamstatic.com/steam/apps/1222690/ss_428d0d34e11bd8fad4f4f4fb0fd3245d632e6bb7.1920x1080.jpg?t=1633006819",
    "Slug": "dragon-age-inquisition",
    "Meta Title": "Dragon Age™ Inquisition: Jun 4, 2020, BioWare and Full Ov...",
    "Meta Description": "Looking for information on Dragon Age™ Inquisition? Check out the release date (Jun 4, 2020), developer insights from BioWare, and a complete game summary.",
    "Alt Text Image": "Official header image for Dragon Age™ Inquisition game - Steam 1222690",
    "Canonical URL": "https://gusku.site/game/dragon-age-inquisition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dragon Age\\u2122 Inquisition\", \"description\": \"Looking for information on Dragon Age\\u2122 Inquisition? Check out the release date (Jun 4, 2020), developer insights from BioWare, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"BioWare\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Electronic Arts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1222690/header.jpg?t=1633006819\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}