{
    "AppID": 506980,
    "Name": "Drone: Remote Tactical Warfare",
    "Release date": "Jul 19, 2017",
    "About the game": "Drone: Remote Tactical Warfare is a top-down action game that combines stealth and visceral combat. Unleash destructive mayhem by unlawfully taking control of remotely operated mechanized assets. View the action from a highly responsive satellite camera (SATCAM) that can track over the entire battlefield. PLAY USING A KEYBOARD OR CONTROLLER Thank you to the thousands who up-voted during the Greenlight campaign!!! SCREENSHOT AND VIDEO IMAGERY SEEN HERE HAS BEEN CAPTURED STRAIGHT FROM THE GAME FEATURES Early Access Arcade mode features: Infiltrate and Annihilate use your small support drone to infiltrate high security facilities collect ammo, hack security turrets, lay hidden mines and stealthily dispatch patrolling enemies when you're armed to the teeth and you've set deadly traps use your heavy assault drone to raise the alarm and raise hell on waves of responding local forces brutal 'close in' combat with dozens of enemies on screen at once 3 Zones and 12 Missions 12 challenging levels of increasing security and enemy troop response numbers across 3 installations many hours of gameplay in the game's current state 20+ Unlocks in Arcade Mode (with many more to come soon!) high performance will be rewarded with new weapons and upgrades for you to devastate your opposition unlock futuristic heavy weaponry based on real-world weapons gadgets include mines, laser targeters and suppressors Clever enemy AI infantry are organised into sections and commanded by squad leaders who will give orders to attack, find cover or retreat when necessary as well as giving orders, squad leaders also increase the morale of their unit autonomous enemy vehicle assets will keep themselves within firing range Combat performance bonus system (only found in Arcade mode) Multi-kills, high value target destruction, stealth kills and many, many more creative ways to annihilate your enemy will earn you a 'combat performance bonus' earn 5 bonuses to unleash awesome, death from above firepower such as missile strikes and tank busting close air support Stealth System automated security turrets will relentlessly observe the area with long range scanners patrolling units will investigate and report anything out of the ordinary try to set as many traps as you can without being noticed STORY In a post-post-apocalyptic future... Mankind, under the control of hyper-corporate entities and the only biology remaining on Earth, has taken its destructive thirst for resources off-world. Resource-laden exo-planets in nearby systems are mined until their physical structures collapse. Newly discovered life is often exterminated to conform with a doctrine of 'potential competition eradication'. Alien life that has biological characteristics considered to provide financial or military benefit is 'acquired' - suffering a fate far worse than eradication. Despite a persistent saturation of pervasive propaganda, a small uprising deep within the walls of Earth's mega-cities has risen to oppose the relentless destruction and crushing oppression of the corporations. Specializing in cyber-warfare, the uprising has found an opportunity for retaliation in the form of access to the drone control networks of the iron-fisted military divisions of the ruling corporations. This development represents a rare chance to inflict wide-reaching disruption of highly profitable off-world operations. As a veteran cyber-mercenary you have been assigned to prevent the destruction of what remains of Planet Zerous. At this time, the expeditionary forces of Universal Industries have nearly come to the end of another eradication routine and all but secured the unknown resource that drew them there in the first place. Your mission is to deplete combat forces on Zerous and secure the resource. This will be achieved by conducting a remote cyber-warfare operation. Probing has revealed a breach in the satellite network (SATNET) on Zerous enabling the remote operation of an RT6 maintenance unit. Scans also show an assault mech located in the area of operation. Harnessing the potential firepower of the battle-tested R65 'Big-cat' will be essential to complete this operation successfully. The combination of drones with careful strategy and resourceful tactics may be just enough to force the invaders of Zerous to evacuate the planet and send a stern warning to the hostile brotherhood of ruling CEOs. ROADMAP Release Early Access mid-2017 (this release) Implement multi-player (deathmatch and coop) as part of Early Access Complete single-player campaign Release full version Beta early-2018 Balance multiplayer/refine singleplayer based on community feedback and extensive dev testing (ongoing) Final retail release 2018 Stay tuned for development updates, weapons tests, gameplay videos and screenshots!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/506980/header.jpg?t=1500690099",
    "Price": 14.99,
    "Developers": "Infamus Entertainment",
    "Publishers": "Infamus Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/506980/ss_f16b14c2310c8302683401292e9351cb77403472.1920x1080.jpg?t=1500690099,https://cdn.akamai.steamstatic.com/steam/apps/506980/ss_077511aaef045ff4eb1ed39f8af87d7ac77424fc.1920x1080.jpg?t=1500690099,https://cdn.akamai.steamstatic.com/steam/apps/506980/ss_9e6261e910a5a0049554e5b6b4d67b3e2afaab68.1920x1080.jpg?t=1500690099,https://cdn.akamai.steamstatic.com/steam/apps/506980/ss_1f8b03d621dd216530797ad08715ced5b5b655c1.1920x1080.jpg?t=1500690099,https://cdn.akamai.steamstatic.com/steam/apps/506980/ss_fb05c4ee3ce0aa89de5a8146c4a833d56d32a2ce.1920x1080.jpg?t=1500690099,https://cdn.akamai.steamstatic.com/steam/apps/506980/ss_874e3a697386001779339ea743ac5b27c9398151.1920x1080.jpg?t=1500690099,https://cdn.akamai.steamstatic.com/steam/apps/506980/ss_6a4cc0c75e3bf3a0fa73edde0a8dfadaf4511cff.1920x1080.jpg?t=1500690099,https://cdn.akamai.steamstatic.com/steam/apps/506980/ss_b1ca043e9b76c91dca51562818c83c947956fe6e.1920x1080.jpg?t=1500690099,https://cdn.akamai.steamstatic.com/steam/apps/506980/ss_a66d2c177fbeb7f8d9278794e680f530408b10bc.1920x1080.jpg?t=1500690099,https://cdn.akamai.steamstatic.com/steam/apps/506980/ss_4b136fd4dfdbc827917933a33fcf8afcddf70b36.1920x1080.jpg?t=1500690099",
    "Slug": "drone-remote-tactical-warfare",
    "Meta Title": "Drone: Remote Tactical Warfare: Jul 19, 2017, Infamus Ent...",
    "Meta Description": "Looking for information on Drone: Remote Tactical Warfare? Check out the release date (Jul 19, 2017), developer insights from Infamus Entertainment, and...",
    "Alt Text Image": "Official header image for Drone: Remote Tactical Warfare game - Steam 506980",
    "Canonical URL": "https://gusku.site/game/drone-remote-tactical-warfare",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Drone: Remote Tactical Warfare\", \"description\": \"Looking for information on Drone: Remote Tactical Warfare? Check out the release date (Jul 19, 2017), developer insights from Infamus Entertainment, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 19, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Infamus Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Infamus Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/506980/header.jpg?t=1500690099\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}