{
    "AppID": 301120,
    "Name": "Eastside Hockey Manager",
    "Release date": "Dec 1, 2015",
    "About the game": "Eastside Hockey Manager (EHM) has emerged from Steam's Early Access programme and is now available for full release. EHM offers fans the most realistic, in-depth and immersive simulation of hockey management available, giving them the chance to manage either club or country in any of the world’s top hockey-playing nations. EHM allows you to take full control of your roster – you decide who to sign, who to trade and who to draft. You assemble the perfect coaching team and then, with everything in place, you can choose to either employ a head coach to guide your team from behind the bench, or take control of the coaching duties yourself. Whichever you choose, you can follow the action ‘live’ or watch the game highlights afterwards through the realistic ‘top down’ 2D game engine. To mark its move from Early Access to full availability, EHM now offers a number of new and updated features, including: a greater number of playable domestic leagues and cup competitions; Steam Workshop integration; additional screen resolutions and a multiplayer option which allows up to 30 players to compete against one another and many more improvements inspired by user feedback. Eastside Hockey Manager – Key Features Dynamic 2D Game Engine Follow the action in either your own games or those of your rivals through the advanced ‘top-down’, 2D game engine, which incorporates state-of-the-art physics modelling (including realistic deflections and shot-blocking) and convincing player AI. There’s even a zoom mode for those who want to get closer to the action. Realistic Contemporary Game World A detailed game world where players can manage and coach in more than 30 playable domestic leagues and cup competitions from across the globe, each of which features up-to-date rules and league structures. Multiplayer Action Up to 30 players can compete head to head in in the same online game world. Steam Workshop Integration EHM includes support for the inclusion of user-generated content (such as custom databases and graphics) through the easy-to-use Steam Workshop system. Complete Roster Management Full control over the building and management of your roster, including everything from offering contracts to scouting, drafting promising players and trading with other teams. Complete Personnel Management Full control over non-playing personnel, including the ability to sign coaches, scouts and physios. Total Tactical Control Coaches can get the best out of their roster by creating and managing detailed tactics that can be configured to an entire team, an individual unit or even a single player. Lifelike Trade Negotiations Managers can gauge interest to trade proposals from their opposite numbers as well as getting feedback from their own assistant. Each team has their own needs and some are ready to offload prospects for that key veteran that makes them a true contender whilst others might be looking to move high-earning veterans in order to rebuild through the draft. Intuitive User Interface The centralised navigation bar makes management easier and more intuitive with all key management controls incorporated into the main menu bar. Improved Player Progression Players develop and age naturally, with new players coming through the junior systems and older players eventually retiring or moving on into non-playing careers. Furthermore, the role-based attribute modelling makes players more realistic and more varied. International Management EHM includes the opportunity to manage international teams (including U20s) in all of the key tournaments – and many less high-profile competitions too. Database Import The database format allows the importing of user-generated up-to-date rosters and even historical starting databases (created for earlier versions of EHM). And Much, Much More… …including detailed financial modelling of player contracts, salary caps and player budgets; a nation overview screen which allows you to view all of the top leagues, clubs and players for each country; player/non-player profiles; an option to start the game with a fantasy draft; all-star games with skills competitions and many, many other features.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/301120/header.jpg?t=1603128296",
    "Price": 19.99,
    "Developers": "Sports Interactive",
    "Publishers": "SEGA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/301120/ss_8b32ee220d2b9951c5551a91001fa1e66849099c.1920x1080.jpg?t=1603128296,https://cdn.akamai.steamstatic.com/steam/apps/301120/ss_86a158974928b74915bfdc11863fb0a42b213182.1920x1080.jpg?t=1603128296,https://cdn.akamai.steamstatic.com/steam/apps/301120/ss_e6fa5a76895c421e4ef71019930e4684e0bb6cfc.1920x1080.jpg?t=1603128296,https://cdn.akamai.steamstatic.com/steam/apps/301120/ss_8765aac9b2406c50eeeaa23d1d14da2c92198e65.1920x1080.jpg?t=1603128296,https://cdn.akamai.steamstatic.com/steam/apps/301120/ss_eb0323284fe36530084fc330e8ad22defdee1bf4.1920x1080.jpg?t=1603128296,https://cdn.akamai.steamstatic.com/steam/apps/301120/ss_76a3d1c13f66785980f08b7f43fa6feb4fed5183.1920x1080.jpg?t=1603128296,https://cdn.akamai.steamstatic.com/steam/apps/301120/ss_c976dc78aaa00f1f89dd317d46f397a964a381d8.1920x1080.jpg?t=1603128296,https://cdn.akamai.steamstatic.com/steam/apps/301120/ss_5d08bd239fdb1e9958ee23bea49f4b5418e30bc9.1920x1080.jpg?t=1603128296,https://cdn.akamai.steamstatic.com/steam/apps/301120/ss_806c46694b7d8a244d760a4f6bf7e9335353e499.1920x1080.jpg?t=1603128296,https://cdn.akamai.steamstatic.com/steam/apps/301120/ss_da504319ee106946dd6d765fa55024f37a34211b.1920x1080.jpg?t=1603128296",
    "Slug": "eastside-hockey-manager",
    "Meta Title": "Eastside Hockey Manager: Dec 1, 2015, Sports Interactive ...",
    "Meta Description": "Looking for information on Eastside Hockey Manager? Check out the release date (Dec 1, 2015), developer insights from Sports Interactive, and a complete...",
    "Alt Text Image": "Official header image for Eastside Hockey Manager game - Steam 301120",
    "Canonical URL": "https://gusku.site/game/eastside-hockey-manager",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Eastside Hockey Manager\", \"description\": \"Looking for information on Eastside Hockey Manager? Check out the release date (Dec 1, 2015), developer insights from Sports Interactive, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sports Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SEGA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/301120/header.jpg?t=1603128296\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}