{
    "AppID": 1836030,
    "Name": "只兔：不灭的勇者",
    "Release date": "Mar 24, 2022",
    "About the game": "/ *Introduction TOOK lost his memory, face this world again with your weapon! In this game, you will experience: 15 distinctive bosses 50 different items and skills 1 main quest and 5 side stories 6 areas with over 70 scenes many mini-games and more! *Story Background The creatures in the Moon Cave have never seen the moon but are obsessed with the moon. In order to find the moon, people have divided into two groups thinking that the moon is in the sky and thinking that the moon is at the bottom. As the six knights of the Moon Up Group, TOOK will save the dying Moon Up Group for the oath from the past. *Game Features - Hardcore Battle - Judge the enemy's actions to dodge, block and attack is the core of the game. The protagonist will challenge powerful and complex enemies with a fragile body and simple moves! Of course, you can skip battles through various props… （Thanks to our programmer and artist, DoudouMengmengRabbit.） - Rich Gameplay - There are a large number of items with different uses for players to collect in the game, and they may appear in any corner of the Moon Cave world. At the same time, there are many mini-games to play such as fishing, crab fighting, mining, stock market, etc., which can relieve the tension during the hardcore battle. （Thanks to our designer and artist, DoudouMengmengRabbit） - Good Plot -（but not in English at the moment） As the game progresses, the memory of TOOK slowly recovers, learn about the past of TOOK and the other six knights, and slowly unravel the truth of the Moon Cave world... Expressed in the form of simple cartoons and character dialogues, simple and intriguing. （Thanks to our writer and artist, DoudouMengmengRabbit.） *picture -This is a hard game. -Level up to face powerful enemies. -Visit different town and people. -And more. *This game is developed independently by DoudouMengmengRabbit, and it takes around one year to complete the development. *All the art materials in this game are drawn by DoudouMengmengRabbit, using the pixel drawing software -aseprite-, which took 2500+ hours to complete all the drawings. *All the sound and music in this game are carefully selected from copyright-free music material sites by DoudouMengmengRabbit. 希望你喜欢这个游戏 Hope u enioy this game &lt;3",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1836030/header.jpg?t=1657767738",
    "Price": 7.99,
    "Developers": "豆豆萌萌兔",
    "Publishers": "豆豆萌萌兔",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1836030/ss_0cfeff034a0ff08252d4f6d54896d7e01a08fca0.1920x1080.jpg?t=1657767738,https://cdn.akamai.steamstatic.com/steam/apps/1836030/ss_fb019442a411b8ca6ae40266306e8f37dc245ea6.1920x1080.jpg?t=1657767738,https://cdn.akamai.steamstatic.com/steam/apps/1836030/ss_02d6c7709a2f81f31a96b98ab36a9f1f05a75c90.1920x1080.jpg?t=1657767738,https://cdn.akamai.steamstatic.com/steam/apps/1836030/ss_d6bed825306c414c1d6d86fc17b1a9abbb36df77.1920x1080.jpg?t=1657767738,https://cdn.akamai.steamstatic.com/steam/apps/1836030/ss_ebe2cf7f1d4a91b891a61865a9f0704bbc4e3cd5.1920x1080.jpg?t=1657767738,https://cdn.akamai.steamstatic.com/steam/apps/1836030/ss_0b06b1dd2614abdb2706ea5938749c752cc0d746.1920x1080.jpg?t=1657767738",
    "Slug": "",
    "Meta Title": "只兔：不灭的勇者: Mar 24, 2022, 豆豆萌萌兔 and Full Overview",
    "Meta Description": "Looking for information on 只兔：不灭的勇者? Check out the release date (Mar 24, 2022), developer insights from 豆豆萌萌兔, and a complete game summary.",
    "Alt Text Image": "Official header image for 只兔：不灭的勇者 game - Steam 1836030",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u53ea\\u5154\\uff1a\\u4e0d\\u706d\\u7684\\u52c7\\u8005\", \"description\": \"Looking for information on \\u53ea\\u5154\\uff1a\\u4e0d\\u706d\\u7684\\u52c7\\u8005? Check out the release date (Mar 24, 2022), developer insights from \\u8c46\\u8c46\\u840c\\u840c\\u5154, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u8c46\\u8c46\\u840c\\u840c\\u5154\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u8c46\\u8c46\\u840c\\u840c\\u5154\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1836030/header.jpg?t=1657767738\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}