{
    "AppID": 811480,
    "Name": "Geography Quiz",
    "Release date": "Mar 13, 2018",
    "About the game": "Learn about all countries of the world. Do you remember where Australia and India is? Have you ever seen where Japan or China is? What is the location of Canada and Mexico? You will learn about all the countries of the world in this game. This is definitely the best geography quiz game for Steam. Less than 1% of players have managed to win the game! If you like geography and trivia, then this app is for you. You can use 2 kinds of help: 1. Show what region of the world the country is. 2. Show the shape of the country. Geography Quiz: * 170 countries of the world * 17 levels * Global leaderboard * Hints system * Simple intuitive control * Source of knowledge * Countries trivia * Great fun --------------------- HOW The game shows an image of the flag and the name. Search for the country that the game is asking about. Locate exact where the right country is. If you are fast and get the right answer then you get a bonus. When you finish one level you get access to the next level. --------------------- FEATURES * Easy to play hard to master. Easier than many other geography quiz games. * Great entertainment and educational content. * If you can't guess where the country is, then use a hint and watch the shape of the country you are looking for. * You know your home country where you and your family lives, but what about the other countries? * Download this game from the internet now and you are going to discover all countries of the world. * This game is perfect if you want to improve your geography skills. * Exercise your brain, get all countries in your memory. * This is probably one of the best free geography quiz game apps for mobile and tablet. * Play at home or on the go. If you are quick to complete the level you will get a perfect score of 3 stars. The game helps you to learn all countries of the world. Fans of geography will love to explore this challenging geo puzzle. --------------------- 3D GRAPHICS * Rather than 2D maps we decided to make better graphics with an interactive 3D globe. Our awesome and amazing planet. * The experience is really similar to Google Earth or Google Maps. You can zoom. --------------------- SOUND AND MUSIC * This game has excellent sound and very beautiful music by danish audiodesigner Mikkel Rohde. --------------------- MORE You can challenge yourself. Test your knowledge of the countries of the world! People live all over the world and you should learn where all the different countries are. We've translated the game to many languages (English, Portuguese, Chinese, Russian, Croatian, Serbian, French, Italian, Spanish, Czech, Arabic) If you are a teacher from a school you can use this important tool as a supplement to traditional books and studies to train your students in geography. This game was especially designed to make your students experts in geography and is ideal for teaching and learning. It is very addictive and your student wont get bored. This is a great game for both boys and girls of all ages. If you want to know more about a specific country try to google it or look it up on wikipedia. Review your score and try to improve your personal results. Social multiplayer features like leaderboards. Competitive learning. Race against the time. Get the highest score and beat other players and friends on the global public online leaderboard, you can impress your friends and become famous. If you are fast you will get the highest score. Purchase the game on the store to get extra features including: full access to all 17 levels and removal of ads. Many more countries from all regions of the world (America, Asia, Africa, Europe, Oceania) like Korea, Portugal, Iceland, America, France, Germany, Philippines, Mexico, Thailand, Colombia, Chile, Egypt, Italy, Brazil, Switzerland, Spain, England, Taiwan, Ireland, Greece, Netherlands, Norway, Romania, Finland, Uruguay, Thai, Poland, Algeria, United States, Hawaii. --------------------- Don't miss this exciting opportunity to improve your geographical knowledge. Children, kids and adults will enjoy this game. Link to our facebook page: GeographyQuizChamomile , 'like' and share please. If you have questions or feedback then don't hesitate to contact us via email and ask.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/811480/header.jpg?t=1520976055",
    "Price": 9.99,
    "Developers": "Chamomile Software",
    "Publishers": "Chamomile Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/811480/ss_68d55515b398d99a54e1701712c8e8befa8f7b94.1920x1080.jpg?t=1520976055,https://cdn.akamai.steamstatic.com/steam/apps/811480/ss_30cc9b7daeb06e13184dc58b0497a1294bd2bd63.1920x1080.jpg?t=1520976055,https://cdn.akamai.steamstatic.com/steam/apps/811480/ss_8a325664705d8185c8cd794dd2aa2a78123c6a40.1920x1080.jpg?t=1520976055,https://cdn.akamai.steamstatic.com/steam/apps/811480/ss_18993c19b5cc8da9b6748f2269821612faadcde4.1920x1080.jpg?t=1520976055,https://cdn.akamai.steamstatic.com/steam/apps/811480/ss_9d8e9f78072bc12bfe7875cdb02155fc8e90afcc.1920x1080.jpg?t=1520976055,https://cdn.akamai.steamstatic.com/steam/apps/811480/ss_212f630d41fcee62bf4be6e5e564c0c859b50d67.1920x1080.jpg?t=1520976055,https://cdn.akamai.steamstatic.com/steam/apps/811480/ss_edde782fa318e365e04dc0be00ee12d0611b70a5.1920x1080.jpg?t=1520976055,https://cdn.akamai.steamstatic.com/steam/apps/811480/ss_70b0f75005ed23ba2e0656c2af5e853ea5ef78d0.1920x1080.jpg?t=1520976055,https://cdn.akamai.steamstatic.com/steam/apps/811480/ss_1e8676ec5def74cdf6a04465645200b0622079ac.1920x1080.jpg?t=1520976055,https://cdn.akamai.steamstatic.com/steam/apps/811480/ss_8e71c0e03fc58711b778f34a838841449355fc15.1920x1080.jpg?t=1520976055,https://cdn.akamai.steamstatic.com/steam/apps/811480/ss_8ea1036df1ae9c936ff6e61f0d15b78574d68e65.1920x1080.jpg?t=1520976055",
    "Slug": "geography-quiz",
    "Meta Title": "Geography Quiz: Mar 13, 2018, Chamomile Software and Full...",
    "Meta Description": "Looking for information on Geography Quiz? Check out the release date (Mar 13, 2018), developer insights from Chamomile Software, and a complete game su...",
    "Alt Text Image": "Official header image for Geography Quiz game - Steam 811480",
    "Canonical URL": "https://gusku.site/game/geography-quiz",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Geography Quiz\", \"description\": \"Looking for information on Geography Quiz? Check out the release date (Mar 13, 2018), developer insights from Chamomile Software, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chamomile Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Chamomile Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/811480/header.jpg?t=1520976055\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}