{
    "AppID": 881520,
    "Name": "Geometry Defense: Infinite",
    "Release date": "Jul 5, 2018",
    "About the game": "Early Access This game is still in development. I was on a bit of hiatus (life is crazy) but I am back and working diligently on bringing this game to release. This version is in lockstep with the mobile free to play version of the game. If you want to preview the game I suggest downloading it for free first. What is the difference in the PC version? Not much at the moment. The main draw will be better performance (especially with all graphics features enabled) and being able to play with a mouse and keyboard. I have no plans to compromise my vision for the game because it is a 'mobile' game - the goal is a proper PC UI/UX. Whether you decide to buy now, later, or never I appreciate you stopping by and giving me a chance to pitch my game to you! Public Roadmap Follow the development plan here! Discord This is the best place to provide feedback, bugs, and follow development. Action Tower Defense Geometry Defense: Infinite is mainly modeled after the WC3 tower defense mods and why mazing is a core part of the game. Some differences you will notice is that enemies cannot destroy towers and the speed of the game. The design goal of GD is sort of 'anti-TD' in that playing idly will be punished. My goal with each mechanic is to force player action and high APM. Enemies are designed to annoy you and disable your towers in other ways. I understand this is not for everyone but there are many really great tower defense games out there if you want something more traditional. The current Live version does not achieve this in a way that feels good but the next update (1.7) is aiming to change that with a massive balance overhaul, new enemies, and new towers. Features Amazing Gameplay - define the enemies path to maximize tower damage. Cool Towers - with 3 levels and 2 upgrade paths. Powerful Elements - damage types with different status effects. Awesome Abilities - for dispatching foes that rush past your defenses. Unique Enemies - give purpose to your towers and abilities. Challenging Bosses - challenge your skill against these special enemies. Expansive Research Lab - with tons of upgrades, improve nearly every stat. Campaign Missions - defend the Sol System from the geometric invaders and unlock new abilities in Endless Mode. Endless Challenge - infinite/incremental waves with a variety of configurations using procedural wave generation. Endless(er) Dev - chance to provide input and have a meaningful impact on the direction of the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/881520/header.jpg?t=1609013990",
    "Price": 4.99,
    "Developers": "Zebec Games",
    "Publishers": "Zebec Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/881520/ss_29593eb03c343bfeb24ab81ab1636bd639c02722.1920x1080.jpg?t=1609013990,https://cdn.akamai.steamstatic.com/steam/apps/881520/ss_d5933f8826d32041bd5009701e9c4fb495c02608.1920x1080.jpg?t=1609013990,https://cdn.akamai.steamstatic.com/steam/apps/881520/ss_5db5009e225710802da8e5cc61efb225dbdbfd6b.1920x1080.jpg?t=1609013990,https://cdn.akamai.steamstatic.com/steam/apps/881520/ss_5b95ebe969cee5c8852fe6b95abf5e497268d932.1920x1080.jpg?t=1609013990,https://cdn.akamai.steamstatic.com/steam/apps/881520/ss_af610073bb5b676906e062bc811b0654e27b70f6.1920x1080.jpg?t=1609013990,https://cdn.akamai.steamstatic.com/steam/apps/881520/ss_39109dcf7c3de738a5eb4ebfac880884bcd5e451.1920x1080.jpg?t=1609013990,https://cdn.akamai.steamstatic.com/steam/apps/881520/ss_540e10816a913f8984f2cdfd8473ca857f13bd7f.1920x1080.jpg?t=1609013990",
    "Slug": "geometry-defense-infinite",
    "Meta Title": "Geometry Defense: Infinite: Jul 5, 2018, Zebec Games and ...",
    "Meta Description": "Looking for information on Geometry Defense: Infinite? Check out the release date (Jul 5, 2018), developer insights from Zebec Games, and a complete gam...",
    "Alt Text Image": "Official header image for Geometry Defense: Infinite game - Steam 881520",
    "Canonical URL": "https://gusku.site/game/geometry-defense-infinite",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Geometry Defense: Infinite\", \"description\": \"Looking for information on Geometry Defense: Infinite? Check out the release date (Jul 5, 2018), developer insights from Zebec Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 5, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zebec Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zebec Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/881520/header.jpg?t=1609013990\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}