{
    "AppID": 733820,
    "Name": "Highrisers",
    "Release date": "Jul 15, 2021",
    "About the game": "The Save the World Edition contains Highrisers as well as the official artbook and is a great way to show appreciation for the developers, while simultaneously supporting a good cause. Assemble Entertainment will donate 10% of the proceeds for every sold Save the World Edition to the International Rescue Committee (IRC) for humanitarian aid in Yemen! Join us in the battle against the famine in Yemen and contribute your share to save the world! Highrisers - An Urban Survival RPG. A pixel-art exploration and survival retro game. Procedurally generated skyscrapers await with seemingless unlimited possibilites to salvage, loot and craft gear. Humanity has been struck by a mysterious prion disease, which left those infected trapped in an eternal dream. Unable to wake up, they transformed and changed into the mysterious dreamers: sleepwalking, zombielike creatures that shun the light. They now dwell in the dimly lit urban canyons of the cities and the lower levels of highrise buildings, hiding away from the sun; only to come out at night, trying to get those who still resist. Four survivors are stuck on a skyscraper in a desolated metropolis, and only through tenaciousness, tinkering and teamwork will they prevail. Without the comfort of a functioning society, cities start becoming a harsh and hostile environment very quickly. In order to survive and find a way out, the team must search every nook and cranny of the building, and scavenge everything they can get their hands on. They have to explore the buildings, scavenge for spare parts, tools and food; and prepare for the nightly onslaught of the dreamers. From simple clubs over crossbows to improvised firearms and explosives: with the right materials, tools and a good amount of ingeniousness, the survivors can craft an arsenal to be reckoned with. And it's not just weapons: barricades, workbenches, tools, machinery, medicine, food and much more is available. Before crafting comes research. Many of the more advanced inventions require certain skills. And while there is quite a lot of useful knowledge to acquire, the survivors don't have the time to learn everything. With the right combination, they might make it through another night. Luckily, the survivors can pool their resources, their skills and their knowledge. If they work together and combine their abilities, they increase their chances of survival tremendously. An old, crashed helicopter on the rooftop is their only chance. Although it will never reach full flight capabilities again, they can use it to jump from rooftop to rooftop, thus slowly making their way out of the city. Individual skill trees, which will unlock new recipes, perks, options and powerful interactions between the four characters A sheer endless amount of crafting recipes, spare parts, weapons and barricades - it's up to you how to tackle each new building Countless procedurally generated levels per skyscraper create infinite high-rise buildings of various types and with different challenges Repair the helicopter: modify and improve the HC-27 to escape, transport more goods and fly longer distances Confront the dreamers: The mutated humans that dwell in the darkness will try to get you. You must fight them, lure them, immobilize them, hide from them, deter them and stall them until sunrise redeems you - for another day Carefully plan ahead in order to survive the night. Special floors that can be found in the buildings allow for extra valuable loot or special interactions",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/733820/header.jpg?t=1657791337",
    "Price": 2.79,
    "Developers": "Solar Powered Games",
    "Publishers": "Assemble Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/733820/ss_1f1883d0631f3d0ec21a0bf03f49ee619348ac0d.1920x1080.jpg?t=1657791337,https://cdn.akamai.steamstatic.com/steam/apps/733820/ss_d50c363ed3cc85cd850c6c7a1b61ae0dfef1961a.1920x1080.jpg?t=1657791337,https://cdn.akamai.steamstatic.com/steam/apps/733820/ss_90fd53cb29bcf8647549fc730a96003214cd056e.1920x1080.jpg?t=1657791337,https://cdn.akamai.steamstatic.com/steam/apps/733820/ss_3e0ef12cba5f679fa7d27c369bafc97b4a107323.1920x1080.jpg?t=1657791337,https://cdn.akamai.steamstatic.com/steam/apps/733820/ss_dd5a40a8cfecf4282cfedf12426df5acb1a7fca7.1920x1080.jpg?t=1657791337,https://cdn.akamai.steamstatic.com/steam/apps/733820/ss_e81d1936258982e285d20cde35d326cb7d474969.1920x1080.jpg?t=1657791337,https://cdn.akamai.steamstatic.com/steam/apps/733820/ss_b9dd38ce703f63efac4b5cfe246a0b1da5a5aa91.1920x1080.jpg?t=1657791337,https://cdn.akamai.steamstatic.com/steam/apps/733820/ss_2d27ea61274c39f0f24e466f47afa4b43a40a74c.1920x1080.jpg?t=1657791337,https://cdn.akamai.steamstatic.com/steam/apps/733820/ss_ab8c65d6ede0dd8b87d4dd6c3e323af8d9e43137.1920x1080.jpg?t=1657791337,https://cdn.akamai.steamstatic.com/steam/apps/733820/ss_ddde6c116091fd13a2b324b4e0a75b40893a8f27.1920x1080.jpg?t=1657791337,https://cdn.akamai.steamstatic.com/steam/apps/733820/ss_4b987e59ebe20720a41fd2eaac3c59a167fcffe2.1920x1080.jpg?t=1657791337",
    "Slug": "highrisers",
    "Meta Title": "Highrisers: Jul 15, 2021, Solar Powered Games and Full Ov...",
    "Meta Description": "Looking for information on Highrisers? Check out the release date (Jul 15, 2021), developer insights from Solar Powered Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Highrisers game - Steam 733820",
    "Canonical URL": "https://gusku.site/game/highrisers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Highrisers\", \"description\": \"Looking for information on Highrisers? Check out the release date (Jul 15, 2021), developer insights from Solar Powered Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Solar Powered Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Assemble Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/733820/header.jpg?t=1657791337\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}