{
    "AppID": 626680,
    "Name": "Kreedz Climbing",
    "Release date": "Jun 15, 2017",
    "About the game": "Kreedz Climbing is a special kind of Platformer + Jump &amp; Run + Race + Puzzle in 3D. It is a challenging movement based game that can be very addictive. Whether casually or in strong competition, there is always something to learn and do! The challenge is to beat the course in the fastest time possible. A checkpoint system allows you to return to a saved position if you fail, but you are truly a great 'Ath1337' if you can beat the courses without them. The best part is that it is totally free to play! Key Features - Learn the core 7 disciplines in the Tutorial, then find the rest in the various maps! Jump, Surf, Bunnyhop, Bungee, Powerjump, DoubleDuck, Long Jump, Raceway, Bhop Raceway, Deathtraps, Flare Targets. There are single discipline and multiple discipline courses! - 120+ maps to choose from The sky is the limit in Kreedz mapping. Natural, rural, suburban, city, space, surreal. Each map is totally unique and may even have multiple courses! - Single and mixed discipline courses One of the coolest things in Kreedz Climbing is the mix. Some maps may have one course, others have many and the combinations of disciplines and special abilities are limitless. A single course may be one discipline, but may also require mastering many of them to beat. - Tag Arena Multiplayer game mode Similar to Hide and Seek, Seekers chase the Runners! Special pick-ups are available to the Runners to help them keep away from the extremely mobile Seekers who have Powerjump and the special Seeker Vision to their advantage. The chasing can get VERY wild! - Create your own maps Using Valve's own Hammer world editor, you can create maps for the game. Kreedz Climbing has a very large amount of special functions and entities ready for you that are completely unique to the game. There are a million ways to make a map. If you are openly creative, mapping could be your thing because in Kreedz Climbing you can create anything! - Earn Medals to unlock fun items As you beat maps while on a server or alone, you earn medals. These medals allow you to buy special fun items from the Special Item Shop. When your timer is not running, you can goof around in the map all you like, look for short cuts and special jumps and use these items to assist you. - Compete alone or with friends online Kreedz Climbing is flexible. Play it alone, play it alone with friends around, or play it with friends. Co-op maps must be played with 2-4 players using boosting and same time puzzle actions. You can create your own server for your friends to play on with Create Server on the main menu! Please note that port 27015 must be forwarded in order for your server to be visible to others (Visit -TASB-6078 for more information). - The Art Tool Ever wanted to draw something on the walls in a game? You can do it! Players use it to draw arrows, showing new players where to go next. Others draw whatever comes to mind. With many colors and sizes, it's a lot of fun! - One of the nicest and most helpful game communities Hands down!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/626680/header.jpg?t=1581904648",
    "Price": 0.0,
    "Developers": "ObsessionSoft",
    "Publishers": "ObsessionSoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/626680/ss_3471bf2a21b20865ad7e9d2e6917c080f7e1baf8.1920x1080.jpg?t=1581904648,https://cdn.akamai.steamstatic.com/steam/apps/626680/ss_6e058f8ffe79de040bb3a85feefe1386a266ad9d.1920x1080.jpg?t=1581904648,https://cdn.akamai.steamstatic.com/steam/apps/626680/ss_ecb27aeccef870a098aea6a0d6ec01df88bc42c1.1920x1080.jpg?t=1581904648,https://cdn.akamai.steamstatic.com/steam/apps/626680/ss_14e6665dfbc773f328076581ddd00b465526a10c.1920x1080.jpg?t=1581904648,https://cdn.akamai.steamstatic.com/steam/apps/626680/ss_a2ce3a4366f4198af2f7a50516ceec0d5245989d.1920x1080.jpg?t=1581904648,https://cdn.akamai.steamstatic.com/steam/apps/626680/ss_c76b6e6e715af9d93fcc5d5d090e09ab0d758128.1920x1080.jpg?t=1581904648,https://cdn.akamai.steamstatic.com/steam/apps/626680/ss_60b5e4edd11330d48cf2301490d235fb7a53eed4.1920x1080.jpg?t=1581904648,https://cdn.akamai.steamstatic.com/steam/apps/626680/ss_e6260e273c3855d5d893ad4397d140d2aa6a8ea6.1920x1080.jpg?t=1581904648,https://cdn.akamai.steamstatic.com/steam/apps/626680/ss_3a6f494ab4e0e6871bfbbd83823523f999717a2e.1920x1080.jpg?t=1581904648,https://cdn.akamai.steamstatic.com/steam/apps/626680/ss_8f338f535ee5bbb88ca7a1a0df3ae0327fe18e09.1920x1080.jpg?t=1581904648",
    "Slug": "kreedz-climbing",
    "Meta Title": "Kreedz Climbing: Jun 15, 2017, ObsessionSoft and Full Ove...",
    "Meta Description": "Looking for information on Kreedz Climbing? Check out the release date (Jun 15, 2017), developer insights from ObsessionSoft, and a complete game summary.",
    "Alt Text Image": "Official header image for Kreedz Climbing game - Steam 626680",
    "Canonical URL": "https://gusku.site/game/kreedz-climbing",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kreedz Climbing\", \"description\": \"Looking for information on Kreedz Climbing? Check out the release date (Jun 15, 2017), developer insights from ObsessionSoft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 15, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"ObsessionSoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ObsessionSoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/626680/header.jpg?t=1581904648\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}