{
    "AppID": 831040,
    "Name": "London Museum Of Water & Steam",
    "Release date": "Aug 8, 2018",
    "About the game": "This application is a virtual tour of the London Museum of Water &amp; Steam museum. The London Museum of Water &amp; Steam is an independent museum founded in 1975 as the Kew Bridge Steam Museum. Situated on the site of the old Kew Bridge Pumping Station in Brentford, near Kew Bridge on the River Thames in West London, England, the museum is centred on a collection of stationary water pumping steam engines dating from 1820 to 1910. It is the home of the world’s largest collection of working Cornish engines, including the Grand Junction 90 inch, the largest such engine in the world. The site is an anchor point on the European Route of Industrial Heritage. The application allows you to explore the museum and the functioning steam machines. Kew Bridge Pumping Station was originally opened in 1838 by the Grand Junction Waterworks Company, following a decision to close an earlier pumping station at Chelsea due to poor water quality. In the years up to 1944 the site expanded, ultimately housing six steam pumping engines as well as four Allen diesel pumps and four electric pump sets. The steam engines were retired from service in 1944, although two were kept on standby until 1958, when a demonstration run of the Harvey &amp; Co. 100 inch engine marked the final time steam power would pump drinking water at the site. The Metropolitan Water Board decided not to scrap the resident steam pumping engines and set them aside to form the basis of a museum display at a later date. This action bore fruit in 1974 with the formation of the Kew Bridge Engines Trust, a registered charity, by a group of volunteers previously involved in the restoration of the Crofton Pumping Station. Today the site is an internationally recognised museum of working steam pumping engines, a reminder of the many pumping stations spread throughout London and the UK. In 1999, the United Kingdom government Department for Culture, Media and Sport described Kew Bridge as 'the most important historic site of the water supply industry in Britain'. The Kew Bridge Engine Trust and Water Supply Museum Limited, a registered charity, has three aims: 1) to restore (and maintain) the five historic beam engines at the Kew Bridge site 2) to add other important water pumping engines 3) to establish a museum of London's water supply. In 1997 the museum was awarded an Engineering Heritage Award by the American Society of Mechanical Engineers (ASME) and Britain’s Institute of Mechanical Engineers (IMechE). A second IMechE Engineering Hallmark was awarded in 2008 for the restoration of the Bull engine, making the museum one of only 12 sites to achieve more than one of these awards.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/831040/header.jpg?t=1533716541",
    "Price": 0.0,
    "Developers": "ThinQ Digital Media Limited",
    "Publishers": "ThinQ Digital Media Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/831040/ss_145721836f864904b4dcd73b99b8462f859ba6bd.1920x1080.jpg?t=1533716541,https://cdn.akamai.steamstatic.com/steam/apps/831040/ss_5fdf1ce7a85ebd7d4d5793a841e974a4a88cf430.1920x1080.jpg?t=1533716541,https://cdn.akamai.steamstatic.com/steam/apps/831040/ss_239f2ebae8e9dd0bace13b87ccc504546f8f3b4b.1920x1080.jpg?t=1533716541,https://cdn.akamai.steamstatic.com/steam/apps/831040/ss_197f82c244676c1572f13b2768e2528663b1452c.1920x1080.jpg?t=1533716541,https://cdn.akamai.steamstatic.com/steam/apps/831040/ss_98db1f35d784beccbe1d6da18ed98b5504a9690e.1920x1080.jpg?t=1533716541",
    "Slug": "london-museum-of-water-steam",
    "Meta Title": "London Museum Of Water & Steam: Aug 8, 2018, ThinQ Digita...",
    "Meta Description": "Looking for information on London Museum Of Water & Steam? Check out the release date (Aug 8, 2018), developer insights from ThinQ Digital Media Limited...",
    "Alt Text Image": "Official header image for London Museum Of Water & Steam game - Steam 831040",
    "Canonical URL": "https://gusku.site/game/london-museum-of-water-steam",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"London Museum Of Water & Steam\", \"description\": \"Looking for information on London Museum Of Water & Steam? Check out the release date (Aug 8, 2018), developer insights from ThinQ Digital Media Limited...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"ThinQ Digital Media Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ThinQ Digital Media Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/831040/header.jpg?t=1533716541\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}