{
    "AppID": 1653850,
    "Name": "Magi: Mind Game",
    "Release date": "May 3, 2022",
    "About the game": "Core Game Philosophy: Magi: Mind Game takes the essential elements of a fighting game and turns it into an easy to learn difficult to master turn based strategy game. We believe the true essence of a fighting game is in its 'mind games'. Predicting and manipulating your opponent psychologically in order to win. These are encapsulated into 'rock-paper-scissors' type gameplay in most fighting games, for example blocking low or high. The key to making these games more enjoyable than simple rock-paper-scissors is by having uneven risk/rewards for every option. For example, some moves may be 'safer' than others but have low rewards when landed. Others may be high risk but have a huge payoff. Additionally in fighting games the current state of the game can create new and interesting situations that change the risk and reward of every move. Magi: Mind Game has 5 spells that create the complexity needed to deliver this type of deep risk-reward gameplay without the need to develop your muscle memory. No need to spend hours upon hours memorizing combos, you can enjoy the 'mind game' right away. Machine Learning to solve match making issues: The biggest problem that plagues indie multiplayer PvP games is the lack of player base necessary to create a good match making experience. With such few people online at a time, it becomes difficult to impossible to play against someone of close to equal skill. One innovative feature of this game is we use deep learning neural networks to create opponents that act like real players. We do this by taking games played by real players, and having an AI learn to play just like that player would. These advanced AIs are then put into the ecosystem and have to earn their ranking just like humans would, so you will never have face an AI that doesn't match your skill level. Our goal is to make the AI so realistic its impossible to tell if you're facing a real human or an AI. And as more people play, the more AIs will be created providing a rich match making experience for all players no matter how popular the game is at any given time. Credits Music Mellow Sonic: Joi, Omnipresence Sound Effects Mads Katsberg UI/UX and Game Background Isaac Medina (FIMF) Store Art Altay Davletov Wizard Model Nathan Skaggs",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1653850/header.jpg?t=1651635738",
    "Price": 0.0,
    "Developers": "Grey Gods",
    "Publishers": "Grey Gods",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1653850/ss_5a384e981f9afec3e15ac15698f3c8b6770f1f42.1920x1080.jpg?t=1651635738,https://cdn.akamai.steamstatic.com/steam/apps/1653850/ss_308cf285dcb0880202fe7f82bca00d00a81379df.1920x1080.jpg?t=1651635738,https://cdn.akamai.steamstatic.com/steam/apps/1653850/ss_c33c8e5440eb120f63afbee78e45a6123c57953e.1920x1080.jpg?t=1651635738,https://cdn.akamai.steamstatic.com/steam/apps/1653850/ss_ab280fd4c5aef0a99c9146366cc26bef2b1e7fbd.1920x1080.jpg?t=1651635738,https://cdn.akamai.steamstatic.com/steam/apps/1653850/ss_e9f8e088a5c22112ed35b20c0cf1ee0246a831a5.1920x1080.jpg?t=1651635738,https://cdn.akamai.steamstatic.com/steam/apps/1653850/ss_d5ae16665ecf4cde3187840691f2aafc6049226d.1920x1080.jpg?t=1651635738,https://cdn.akamai.steamstatic.com/steam/apps/1653850/ss_a1ec6f4a1a07f3c2f74b2a53bbf431ad4f922043.1920x1080.jpg?t=1651635738,https://cdn.akamai.steamstatic.com/steam/apps/1653850/ss_c92ad07d90abd041e08b1676b78711982c79e319.1920x1080.jpg?t=1651635738",
    "Slug": "magi-mind-game",
    "Meta Title": "Magi: Mind Game: May 3, 2022, Grey Gods and Full Overview",
    "Meta Description": "Looking for information on Magi: Mind Game? Check out the release date (May 3, 2022), developer insights from Grey Gods, and a complete game summary.",
    "Alt Text Image": "Official header image for Magi: Mind Game game - Steam 1653850",
    "Canonical URL": "https://gusku.site/game/magi-mind-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Magi: Mind Game\", \"description\": \"Looking for information on Magi: Mind Game? Check out the release date (May 3, 2022), developer insights from Grey Gods, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Grey Gods\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Grey Gods\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1653850/header.jpg?t=1651635738\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}