{
    "AppID": 929670,
    "Name": "Orion Sandbox Enhanced",
    "Release date": "Sep 21, 2018",
    "About the game": "'In the darkest reaches of the galaxy, I receive a weak signal begging for help. As I approach the planet, an Engine Failure! I'm going down!' A 2D crafting survival sandbox, this game gives you a whole mysterious planet for your new home. If you want to survive, you’ll need to fight, defend and adapt to this world and change it to suit your needs. You can use whatever you need - wood, stone, iron, clay, and even more materials found on the planet. This planet might look peaceful and friendly during the day, but when the darkness comes... The night is fraught with hordes of zombies and many dangers. In the depths of dungeons, deadly monsters and ancient evils wait for you. But you’ll need to gather your courage and venture inside. For only in there will you find the quality materials you need to make advanced equipment, craft powerful weapons and armor, fulfill missions and quests, and unravel the many secrets of this planet. Sandbox Gameplay: Change the planet as you choose. Craft, destroy, build. Missions: Numerous missions await you. Complete all the quests to earn grand treasures. Pets: Fill your new life with friends and companions, such as a chicken that carries eggs or a cute little fox. Mighty Bosses: This world is dangerous and deadly. Ancient monsters reign over it from the depths of the darkest dungeons. Battle them to free the planet from their control. Weapons and Armor: In this world, you won’t survive long without good equipment. Create new types of armor and weapons. Will you beat your enemies with a cudgel, cut them down with a sword, shoot them with a shotgun, or burn them with a flamethrower? The choice is yours. Crafting: Start with a simple workbench and work your way up to a high-tech laboratory or an alchemist’s cellar to craft new objects, potions, and materials. Materials: Any materials you find can be used for construction. You might spend tonight in a tiny dugout and then sleep tomorrow in a castle made of gold. World Generation: Create or destroy entire worlds with one click. Character Customization: Choose who your character will be. Man or woman, young or old? Change your face and hair, add a beard or mustache, and even give your character some scars as memories from old battles. Your character’s appearance is entirely in your hands. Dangerous Dungeons: The surface is safe enough, but the most dangerous monsters wait for you close to the planet’s core, hiding in the deep darkness. Special Places: Gold and minerals can serve as rewards for any researcher, but if your exploration is thorough, you might just find interesting locations and special items you won’t see elsewhere.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/929670/header.jpg?t=1537522369",
    "Price": 1.99,
    "Developers": "y8.com",
    "Publishers": "y8.com",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/929670/ss_2a03de4154d026a8466b41749ee4d69da1d206f4.1920x1080.jpg?t=1537522369,https://cdn.akamai.steamstatic.com/steam/apps/929670/ss_870a247758fbb9d2d2786718db06b31911d498ee.1920x1080.jpg?t=1537522369,https://cdn.akamai.steamstatic.com/steam/apps/929670/ss_208cff8e68f8053b85b928a33def85591c2a836d.1920x1080.jpg?t=1537522369,https://cdn.akamai.steamstatic.com/steam/apps/929670/ss_c45c0b3e54aaa548f57a155d98aa73b5ae984bb7.1920x1080.jpg?t=1537522369,https://cdn.akamai.steamstatic.com/steam/apps/929670/ss_59f36072736ea59f881fd8a5927213b36a826948.1920x1080.jpg?t=1537522369,https://cdn.akamai.steamstatic.com/steam/apps/929670/ss_30365ccc03bb88b050c785d463d8656e5214a59a.1920x1080.jpg?t=1537522369,https://cdn.akamai.steamstatic.com/steam/apps/929670/ss_4df6465bc84e2143e3376f1e415447e68424e55f.1920x1080.jpg?t=1537522369",
    "Slug": "orion-sandbox-enhanced",
    "Meta Title": "Orion Sandbox Enhanced: Sep 21, 2018, y8.com and Full Ove...",
    "Meta Description": "Looking for information on Orion Sandbox Enhanced? Check out the release date (Sep 21, 2018), developer insights from y8.com, and a complete game summary.",
    "Alt Text Image": "Official header image for Orion Sandbox Enhanced game - Steam 929670",
    "Canonical URL": "https://gusku.site/game/orion-sandbox-enhanced",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Orion Sandbox Enhanced\", \"description\": \"Looking for information on Orion Sandbox Enhanced? Check out the release date (Sep 21, 2018), developer insights from y8.com, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 21, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"y8.com\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"y8.com\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/929670/header.jpg?t=1537522369\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}