{
    "AppID": 1479480,
    "Name": "Polity",
    "Release date": "Nov 5, 2021",
    "About the game": "Polity is a social RPG in a user-generated world, where people can rule their own country or become citizens of other players' countries. This world offers you the opportunity to shape your own utopia with real players. Establish your country, customize it, and set your own rules, or find a profession you are fond of as a citizen. Both choices will lead you to different paths. Alongside being a citizen, basic professions (such as farmer, forester, etc.) are designed to create a purpose-based atmosphere; in this way, players can internalize the profession on their way to being president. These professions consist of various quests and popular casual games, which are aimed to be educational and entertaining at the same time. The game is set on a mysterious planet called Blue Dot 2 (BD-2). This planet is discovered by an AI-powered spaceship, JP-01G. The AI system collects data about this mysterious planet: It is mostly covered with water, but there is no sign of life. A new civilization is ready to build on BD-2: Platforms are waiting for their citizens. Here is where your journey begins. During this journey, you will find your own path while exploring the world you are comfortable in. Come and start to explore the world of Polity! Express yourself! Be free in style while choosing the features and clothes of your avatar. Furnish your places. We are regularly updating our Clothing and Furniture Stores to give you better and fashionable service. Be Professional! Basic professions we trust to build a strong society. These professions meet the needs of society. We earn our crust from the ‘soil’: Be Farmer or Forester! Achieve and Complete! All we need is success. In the way of success, Polity invites you to accomplish the various quests in accordance with your profession. Be Social! You are not alone unless you want to be one. You can chat with other players through Chat Balloons or the private chat on your 'IDPhone'. This is the new way of socializing we can offer you during the pandemic. Unconditionally Merchant! In-game trading is fun: Buy and sell items or barter your goods with other avatars' goods. Explore! Customized platforms by real players waiting for their visitors or future citizens. Come and visit them to see many personal ‘dreamlands’! During the Early Access period, Regular Updates are scheduled for bug fixes and new features and contents. What are we planning for and expecting from our game? Our game has a bright future in which players should give a chance during this period to witness our development journey. We have a mission: Focusing on Education and gamifying it! We are growing and developing by adding new content and features: Interacting with all the items, unique dialogues, a splendid sci-fi story in an MMORPG. We already have a system and want to stabilize it without any misadventures to create an adventure for our players Join us in our journey so we can develop “our game”! Stay tuned for more on the Steam page and our other social media networks!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1479480/header.jpg?t=1649946958",
    "Price": 0.0,
    "Developers": "Jib Games",
    "Publishers": "Jib Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_95b7ed536bc4afcad38d95531b9e38f46bf28702.1920x1080.jpg?t=1649946958,https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_7e9032442e1036dbb19ec63b000feadc9364710e.1920x1080.jpg?t=1649946958,https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_894be82fb8c5ed57b20007da1920821ad8cc50cf.1920x1080.jpg?t=1649946958,https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_5207ee97f0730303f0741d3cb5587d9f25e32e60.1920x1080.jpg?t=1649946958,https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_b1bbda2f67f15ba02aff027a0c726a096287605c.1920x1080.jpg?t=1649946958,https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_ed95c09c6c043534a0be9816bfcc20e72552f2f4.1920x1080.jpg?t=1649946958,https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_4a132f5f0e95dc54fa7e46f5ab1b1bb67200723f.1920x1080.jpg?t=1649946958,https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_d5069c9add5242361a168ec2535338daba066279.1920x1080.jpg?t=1649946958,https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_1a4901e42f16f86a89d04083c2439797c9e38436.1920x1080.jpg?t=1649946958,https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_c096de6cf9113f123cfec192b8cca4e69fdedabc.1920x1080.jpg?t=1649946958,https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_12a63f17c881485168a86c399ce265c3868be0d0.1920x1080.jpg?t=1649946958,https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_a2ae931005b92f3e57e836a62a75a23f5ffd7e98.1920x1080.jpg?t=1649946958,https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_af72f4c1ee6ae3ba70d82b1b4229974322f77ba0.1920x1080.jpg?t=1649946958,https://cdn.akamai.steamstatic.com/steam/apps/1479480/ss_a5f2b845cca74111607e01320a3a8c875af67344.1920x1080.jpg?t=1649946958",
    "Slug": "polity",
    "Meta Title": "Polity: Nov 5, 2021, Jib Games and Full Overview",
    "Meta Description": "Looking for information on Polity? Check out the release date (Nov 5, 2021), developer insights from Jib Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Polity game - Steam 1479480",
    "Canonical URL": "https://gusku.site/game/polity",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Polity\", \"description\": \"Looking for information on Polity? Check out the release date (Nov 5, 2021), developer insights from Jib Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jib Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jib Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1479480/header.jpg?t=1649946958\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}