{
    "AppID": 1028350,
    "Name": "Pupperazzi",
    "Release date": "Jan 20, 2022",
    "About the game": "Who will photograph, pet, and tell these dogs they're good boys and girls if you don't?? The world NEEDS you in Pupperazzi , the dog photography game! First person photographer action. Discover all new dogs and activities as you run, jump, and interact with the world... And dogs! (Yes, you CAN pet them!) SO. MANY. DOGS. Shibas, terriers, labs, pugs, and all kinds of breeds. You want ‘em, WE GOT EM! Have fun with dogs! Play fetch, dress them up in different hats, terrorize them with vacuum cleaners (you monster), and start dance parties. Normal dog things. Questionable dog things. Suspiciously human things. Take the best photos. Upgrade your gear to get the best dog pics. Zoom, filters, slow-mo, lenses, and so much more! A world populated entirely by dogs. Explore the lighthouse cove, take a sunset stroll on the boardwalk, zoom around the city of Muttropolis, and more! Either way, it’ll be filled with dogs. It’s rumored humans exist, but who cares? Share your galleries. If you took a picture and didn’t aggressively share it with several of your friends, did you even take it?? Science says no! Share your best snapshots online! Welcome To Your Life As A Freelance Pupperazzo! Snap photos of dogs while maintaining your social media presence. Will you hound for stardom in public, or would you rather be taken seriously as an artist? Perhaps you just want to show your friends the cute dog you saw while you were out. It's your choice which direction your career goes - just don’t forget to pet the dogs along the way. Dodge between people and obstacles as you try to capture canine beauty on everlasting digital photos. Double jump across buildings to get that lucrative shot of a local dog celebrity just trying to live their life. Slow motion zooming helps capture mid-air moments that actually make you feel something. It’s a ruff world out there and it’s up to you to document it! WOOF. Bark bark bark *licks* bark bark woof HOOOOOOWL. *Sniff* *Sniff sniff* wfff. Woof woof…. Bark? *Head tilt* *Pants* BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK BARK",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1028350/header.jpg?t=1649861800",
    "Price": 19.99,
    "Developers": "Sundae Month",
    "Publishers": "Kitfox Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1028350/ss_bebd79945442f82b99de8680f8c939ac87f8da5e.1920x1080.jpg?t=1649861800,https://cdn.akamai.steamstatic.com/steam/apps/1028350/ss_ba2e9271d96d4220adea321bc531eafce1a2af98.1920x1080.jpg?t=1649861800,https://cdn.akamai.steamstatic.com/steam/apps/1028350/ss_f5977bac9fbbee005da968e32304a62aa406de7d.1920x1080.jpg?t=1649861800,https://cdn.akamai.steamstatic.com/steam/apps/1028350/ss_ff14a0003259aba8f44aa5590ce2b83f1367bb44.1920x1080.jpg?t=1649861800,https://cdn.akamai.steamstatic.com/steam/apps/1028350/ss_bb4b821c6d91a706a4ee34456ad615dd0790d563.1920x1080.jpg?t=1649861800,https://cdn.akamai.steamstatic.com/steam/apps/1028350/ss_4d9056bc1f326e8de220d1196453e458e430a995.1920x1080.jpg?t=1649861800",
    "Slug": "pupperazzi",
    "Meta Title": "Pupperazzi: Jan 20, 2022, Sundae Month and Full Overview",
    "Meta Description": "Looking for information on Pupperazzi? Check out the release date (Jan 20, 2022), developer insights from Sundae Month, and a complete game summary.",
    "Alt Text Image": "Official header image for Pupperazzi game - Steam 1028350",
    "Canonical URL": "https://gusku.site/game/pupperazzi",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pupperazzi\", \"description\": \"Looking for information on Pupperazzi? Check out the release date (Jan 20, 2022), developer insights from Sundae Month, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sundae Month\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kitfox Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1028350/header.jpg?t=1649861800\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}