{
    "AppID": 1505910,
    "Name": "Recontact London: Cyber Puzzle",
    "Release date": "Oct 19, 2021",
    "About the game": "Become a Cyber Detective Find the cyber threats plaguing London and advance the story by examining files, clues from journals or CCTVs. Ghosts are among us! Use the cameras to find the ghosts that haunt the streets and save the people of London living in fear. All of London at your fingertips... Dominate the map of London with satellite imagery and complete a variety of over 100 puzzles located throughout the city. Be the best! Compete with other players and prove that you are the best cyber detective worldwide. A cinematic detective story with a strong cast... A unique experience starring Ross Mullan, known for Game of Thrones, with music by the philharmonic orchestra from Moscow. SOLVE THE MYSTERY OF THE GHOSTS ON LONDON'S SECURITY CAMERAS. Recontact London is unlike any other game. It has a never-ending storyline that is constantly updated and progresses with 5 totally different types of puzzles in which you find suspects using security cameras and satellite images and inspect crime scenes in reality! One day a call comes in to the police station and at midnight you learn that a ghost has been caught by a security camera at a bank in London. The news is on every channel across the country and the task falls to you to solve the mystery. You discover how serious the and profound the investigation actually is as you track the ghost through London's streets using security camera footage. No more spoilers, though, it's up to you to discover the rest from now on! A cinematic detective story with a strong cast As the lead, you'll come across other characters as the story progresses, such as world-famous TV and film actor Ross Mullan. Are you ready to discover his secrets on the streets of London? Compete against other players around the world on the Recontact Leaderboard and show them who the best cyber-detective is! Follow here for new levels, new puzzles and features coming soon! Who We Are? The passion of the Recontact Games, which starts with the motto of Playable Arts, is to builds the films on videos and cinematic, which are direct game dynamics, not on multiple choice storytelling. In this form, Recontact will make a name for itself in the video gaming industry with original content. Thanks to passionate works of Recontact team, previously Recontact Istanbul and Recontact Istanbul Eyes of Sky has received international awards, the App Store has selected it as the game of the year, and now, they are back with a global project, Recontact London, to the world of mobile games in an ambitious way. For Recontact London, the team has changed all the game mechanics from the scratch and it includes major changes. The big difference of the new game is now that we play ourselves instead of playing a game character. As the head of London’s cybercrime team games, it prepares to meet gamers with video puzzles and a never-ending story stream. In addition to be a hidden object game with CCTV cameras to find the suspects, it offers 5 more brand new video-based puzzle game using new technologies and it brings a breath of fresh air to the investigation scenes. The starring actor is Ross Mullan, who plays the character Whitewalker in the world-famous Game of Thrones series, has also made a name for himself in projects such as Doctor Who and Clash of Titans. The Original Music of Recontact:London performed by 60 amazing musicians at one of the best Symphony Orchestra in Moscow. Filmed in British Museum to create an unique artistic experience for gamers. As known from the previous game Eyes of Sky, the cybercrime organization Recontact manipulated the security cameras and made the crimes seem to have been committed by others. In London, things are becoming more serious. Mysterious ghosts stand out in the security footage of hundreds of people in coma within a country. Our mission as cybercrime team is to unravel the secret of ghosts and try to find out if the power behind them is Recontact.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1505910/header.jpg?t=1635182032",
    "Price": 11.99,
    "Developers": "Recontact Games",
    "Publishers": "Recontact Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1505910/ss_70953b234b6ecf8b5a1e26d77cfdfe1475b3ccfa.1920x1080.jpg?t=1635182032,https://cdn.akamai.steamstatic.com/steam/apps/1505910/ss_e40ec28a5af21bb72a329fc43526ee4b67c0b865.1920x1080.jpg?t=1635182032,https://cdn.akamai.steamstatic.com/steam/apps/1505910/ss_a01080e2a73c607aa46b3b53190f062006576bfa.1920x1080.jpg?t=1635182032,https://cdn.akamai.steamstatic.com/steam/apps/1505910/ss_0119b7dca58ecd06f64107094ebf685c92480799.1920x1080.jpg?t=1635182032,https://cdn.akamai.steamstatic.com/steam/apps/1505910/ss_f06863d778008ac3a1ae30da9f9cd7e43e662e7d.1920x1080.jpg?t=1635182032",
    "Slug": "recontact-london-cyber-puzzle",
    "Meta Title": "Recontact London: Cyber Puzzle: Oct 19, 2021, Recontact G...",
    "Meta Description": "Looking for information on Recontact London: Cyber Puzzle? Check out the release date (Oct 19, 2021), developer insights from Recontact Games, and a com...",
    "Alt Text Image": "Official header image for Recontact London: Cyber Puzzle game - Steam 1505910",
    "Canonical URL": "https://gusku.site/game/recontact-london-cyber-puzzle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Recontact London: Cyber Puzzle\", \"description\": \"Looking for information on Recontact London: Cyber Puzzle? Check out the release date (Oct 19, 2021), developer insights from Recontact Games, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Recontact Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Recontact Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1505910/header.jpg?t=1635182032\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}