{
    "AppID": 1395760,
    "Name": "Reshaping Mars",
    "Release date": "Aug 25, 2021",
    "About the game": "Join our official Discord to be part of our plans to reshape Mars today! Hello friends, I’m an indie game developer. You may call me Tholus. Reshaping Mars is a mars-themed construction &amp; strategy simulation game developed all by myself In the game, players will start from scratch. Mine minerals, secure energy and water, farm and store food in order to construct residences to house and feed immigrants and more on your journey to colonize Mars. Humanities and Tech Tree Low air pressure, strong ambient radiation, sandstorms and numerous natural phenomena, coupled with limited resources, are great obstacles to the Martian base's expansion. Hence, you must conduct research to create better technology and increase Mars' productivity. This will strengthen the Martian base in turn. You may make use of the diverse options of the tech tree to perform research into technology that meets the needs of their colony. With the continuous influx of residents, their daily lives will be marked with their own sorrows and joys, as well as all kinds of needs. Leisure facilities and a welfare policy must be established along with proper living conditions that take care of all aspects of their lives. With a happy population, success is but a step away from the plans to reshape Mars. Rich variety of random events Where people roam, so will there be events and incidents that punctuate their lives. You will encounter all kinds of random events: what is the intent of the secretive stowaways to Mars and where they come from. What plans do the many factions back on Terra have for the fledgling Martian base? What is behind the mysterious faction that makes itself known on Mars out of the blue? What are the origins of the wreck stamped with 'xSpac' and a dog's head emblem? These mysteries are all waiting to be discovered and unraveled. Real-time Strategy Accidents happen and conflict are par for the course. What better way to secure the Martian base and resist the invasion than to build an armed force that defends Mars? This is the moment for all the cruiser tanks, ripper missile tanks, raptor fighters to shine! Issue commands to your armed unit in real time and duke it out with your enemies! Educating with entertainment All in-game locations are real Martian geological features and approximately sited in the same locations (E.g. Valles Marineris, Acidalia Planitia and the Tempe Fossae etc.). Even if your best attempts at making a success of the Martian base go wrong, you would be learning about the lay of the land of Mars. Who knows if it will ever come in useful on your own adventures to Mars someday? Multi-factional diplomacy Interactions between the Martian base and other factions will evolve as the game progresses. You will meet representatives of many different powers and factions. Whether Mars shall forge strong alliances, conduct fair trade or light the beacons of war is all in your hands. I hope that this game will bring you on a unique journey surviving and navigating colony life on Mars as a pioneer. If the concept of this game piques your interest, please refer to the real-life plans to reshape Mars and show your much-needed support for the people behind these plans.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1395760/header.jpg?t=1632624560",
    "Price": 9.99,
    "Developers": "Tholus Games",
    "Publishers": "Yooreka Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1395760/ss_6b29b681c9cf38a315c30a25102f47b0246ffb3a.1920x1080.jpg?t=1632624560,https://cdn.akamai.steamstatic.com/steam/apps/1395760/ss_163dd221b03334eac2b30d796f022f3c26befa09.1920x1080.jpg?t=1632624560,https://cdn.akamai.steamstatic.com/steam/apps/1395760/ss_dba1c6c17a1be831b58b7f6b2f9c2c49106d76f2.1920x1080.jpg?t=1632624560,https://cdn.akamai.steamstatic.com/steam/apps/1395760/ss_29e3e17f162a419b850bac3a5648643bda428858.1920x1080.jpg?t=1632624560,https://cdn.akamai.steamstatic.com/steam/apps/1395760/ss_954f2dbb2e4302d0365efc5b1d12058a7c7fc902.1920x1080.jpg?t=1632624560,https://cdn.akamai.steamstatic.com/steam/apps/1395760/ss_64096d4072afd048367431b9669a38d0000511ed.1920x1080.jpg?t=1632624560,https://cdn.akamai.steamstatic.com/steam/apps/1395760/ss_480acd183251dc3235977f384a338943702f4ce8.1920x1080.jpg?t=1632624560,https://cdn.akamai.steamstatic.com/steam/apps/1395760/ss_512d52d04342279066102cd1868d39717d872c85.1920x1080.jpg?t=1632624560,https://cdn.akamai.steamstatic.com/steam/apps/1395760/ss_5f85980500ec216e1a5b16e04251787d34d38295.1920x1080.jpg?t=1632624560,https://cdn.akamai.steamstatic.com/steam/apps/1395760/ss_1582f6118cc1a9637f1727791d7f7b057c6fb663.1920x1080.jpg?t=1632624560,https://cdn.akamai.steamstatic.com/steam/apps/1395760/ss_486d63ae04ad2d0b683252f8dda060b004c5203f.1920x1080.jpg?t=1632624560,https://cdn.akamai.steamstatic.com/steam/apps/1395760/ss_82aa91ea38b51719c27749973b36fbcb006b8299.1920x1080.jpg?t=1632624560,https://cdn.akamai.steamstatic.com/steam/apps/1395760/ss_8c81d44d03f48994fa7e0a204ccdc2f67dc426bf.1920x1080.jpg?t=1632624560",
    "Slug": "reshaping-mars",
    "Meta Title": "Reshaping Mars: Aug 25, 2021, Tholus Games and Full Overview",
    "Meta Description": "Looking for information on Reshaping Mars? Check out the release date (Aug 25, 2021), developer insights from Tholus Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Reshaping Mars game - Steam 1395760",
    "Canonical URL": "https://gusku.site/game/reshaping-mars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Reshaping Mars\", \"description\": \"Looking for information on Reshaping Mars? Check out the release date (Aug 25, 2021), developer insights from Tholus Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tholus Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Yooreka Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1395760/header.jpg?t=1632624560\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}