{
    "AppID": 383980,
    "Name": "Rivals of Aether",
    "Release date": "Mar 28, 2017",
    "About the game": "Overview RIVALS OF AETHER is an indie fighting game set in a world where warring civilizations summon the power of Fire, Water, Air, and Earth. Choose a Rival to bring into the battlefield and manipulate the powers of the classical elements and animal movement. Praised for its competitive gameplay and intensive training tools, Rivals of Aether is the perfect entry to the Platform Fighter genre. Game Features Choose VERSUS MODE to duke it out in competitive 1v1 or 2v2 fights, or jump into a free-for-all. Play STORY MODE to learn the backstory behind each rival and begin to uncover the hidden mysteries of Aether. Bring along a friend with drop-in local co-op. Dive into ABYSS MODE to see how many waves of shadowy fighters you can defeat and reach the leaderboards alone or with a friend. Customize your Abyss Mode builds and challenge your friends in ABYSS VERSUS . Play a relaxing game of TETHERBALL on the beach in this sport-themed game mode. Don’t take it too lightly as there is real depth here and your opponent looks serious! Take your skills online in ONLINE VERSUS ! Play against your friends and set your own rules. Or test your skills in RANKED MODE to climb the leaderboard. Study TUTORIAL MODE to hone your skills from beginner to advanced lessons. Or boot up PRACTICE MODE to get your hands on all the frame data and hitbox visualizations. Rivals Zetterburn, a son of the ruling family of the Firelands, is an experienced and hardened warrior. In battle, Zetterburn uses no weapons except for his razor-sharp claws and ability to control flame. BURN DAMAGE - Zetterburn's special attacks can set opponents on fire, causing them additional damage over time. WILD FIRE - Zetterburn's Down Special places flames on the stage. These flames stay for a period of time, burning any opponents who come in contact with them. FIRE AMP - When an opponent is burning, Zetterburn's Strong Attacks can absorb the flames and launch the burned enemy twice as far, making for an effective killing blow. Orcane is a playful trickster, notorious for escaping even the most precarious of situations. He can transform into water and confuse enemies with a spray of bubbles. PUDDLE TELEPORTATION - Orcane creates a puddle with his Neutral Special or Down Special. He can then teleport to his puddle using his Up Special as a powerful vertical blow or an effective recovery when launched off the stage. BUBBLE EVAPORATION - Orcane can turn his puddle into a pillar of bubbles with his Down Special to trap enemies above the puddle. WATER AMP - When standing on top of his puddle, Orcane can consume the water underneath him to perform powerful Strong Attacks with far greater range and knockback. The youngest trainee in the history of the Air Academy, Wrastor has never lived by anyone's rules but his own. Currently an Aerial Ace for the Air Armada, Wrastor is wrecking havoc among the Armada's enemies and generals alike. WINGED FLIGHT - Wrastor can jump 4 times, making him incredible at controlling the air and recovering from the toughest falls even when things look grim. WIND CURRENT - Wrastor can create a Wind Current with his Forward Special, allowing him to move faster within it and chase his targets more effectively. AERIAL ACE - Wrastor performs his charged Strong Attacks in the air instead of on the ground, a first for this genre. Kragg is a defender of the colossal Aetherian Forest. Deliberate and loyal, he is one of the infamous Wall Runners who patrol the Rock Wall. Unlike other Wall Runners, Kragg has the legendary ability to control the earth with his will. ROCK HURL - Kragg can pull a rock out of the ground and hurl it at opponents. After it leaves his hands, the rock becomes a solid piece of stage that either Kragg or other players can break. DEFENSE BALL - Kragg can curl into a ball and roll toward enemies. Although he can be damaged while in ball form, he cannot be knocked away. EARTH PILLAR - Kragg can summon a pillar of earth to his feet regardless of where he is. If Kragg is about to fall to his death, this move can quickly turn his situation around. Forsburn is the disgraced, eldest son of the Firelands' ruling family. After being condemned by the Fire Council and his own brother, Forsburn found refuge in a group of outsiders who had rejected the flame and mastered the way of smoke. SMOKE SCREEN - Forsburn can use his Neutral Special to obscure the battlefield allowing Forsburn to remain hidden inside a cloud of smoke. DECOY - Through his Forward Special, Forsburn can create a smoke facsimile of himself that can attack opponents. The illusory Forsburn breaks into smoke after being hit by a single attack. CONSUME/COMBUST - By using his Down Special, Forsburn can consume his smoke clouds back into his body. After consuming three clouds, Forsburn is charged up and can use Down Special again to combust: knocking opponents away at high speed. Maypul is the self-appointed Guardian of the Aetherian Forest. She commands fearful respect throughout the forest for her unhesitating vigilantism. She uses her agility to trap any unknown intruders before they even realize she is there. WATCHER'S MARK - Maypul can use her Seeds or her Watcher's Dash to mark opponents, making them susceptible to her following attacks. WRAPPED UP - After marking her targets, Maypul can use her Strong Attacks or her trusty Plant to wrap marked opponents in place allowing her to follow up with another attack. SLING SHOT - Maypul can use her vines to sling toward marked opponents, allowing her to elude attacks and quickly close distances. Absa is a famed engineer and martialist of the Elders of the Air Alliance. Despite the laws of the Elders, Absa secretly developed storm techniques in the caves of the Archai mountains. CLOUD CONTROL - Absa can place a cloud using her Neutral or Forward Special. This cloud hangs in the air until Absa bursts it by tapping her Neutral Special and knocking enemies away. THUNDER BOLT - Absa can charge her Neutral Special to create a powerful lightning blast that connects her to her cloud. All opponents caught between the two will be knocked away at high speeds. CONDENSED STORM - Absa focuses the power of a lightning bolt to the tip of her hoof. If she can line up one of her aerial kicks perfectly, she unleashes great power. Etalus is a legendary warrior in his native land. He is one of the last surviving members of the Harbor Guard and uses the power of ice to augment his massive strength. HOME ICE ADVANTAGE: Etalus can use his Forward Special or Forward Tilt to freeze the ground beneath him in order to slide across on the icy surface. ARMORED UP: When standing on ice, Etalus can use his Neutral Special to absorb the ice and create ice armor around his body. AVALANCHE: Etalus can use his Down Special to shatter all nearby ice, instantly freezing any enemies who are standing on it. Ranno was known as be a feared martial artist who trained under wise monks. But now he prefers to peacefully protect his swampy homeland. When he has no other option, you can see glimpses of his rapid and deliberate strikes. POISON STACKS - Ranno’s Specials Strong Attacks and Jab Combo apply up to four poisonous stacks on his opponents. These stacks damage opponents when they attack and can be removed by hitting Ranno. TOXIC TRAP - Ranno’s Neutral Special and Down Special can place his opponents in a Toxic Bubble Trap that makes it easier for Ranno to combo. The length of time in the trap depends on the number of Poison Stacks on the opponent. POISON SPIN - Ranno’s recovery onto stage has three options. He begins it with a Poison Lunge that is quick and knocks opponents away. After the lunge he can quickly Poison Kick down onto the stage with another quick strike. Or he can use the Posion Spin to fire out an array of Posion Darts in many directions. Clairen is a seasoned warrior from a distant future where the heroes of flame vanish and never return. After being defeated by a tyrannical and ever-living emperor, she travels back in time in order to defeat him. IONIZED TIP - Unlike the other soldiers from the future, Clairen manipulates her blade to be two-toned. The end of Clairen's sword is super-charged, allowing her to stun enemies who are hit precisely with the tip. PLASMA ECHO - Clairen dashes forward with her Side Special to quickly escape. The deadly plasma resonance left behind can damage enemies and even KO opponents with its sweet spot. ENERGY FIELD - Performing a Down Special right before an attack hits Clairen will trigger her energy field. This field damages and pushes other Rivals away while nullifying all projectiles that try to enter it. Sylvanos is the heart of the Aetherian Forest. A rageful deity, Sylvanos has only a single goal - to expand the forest over all of Aether. Unfortunately, the great Rock Wall traps the spirit as he patrols the forest’s floor. Sylvanos leads the plant life in the forest looking for ways to expand his dominance. UNTAMED GROWTH - Sylvanos spreads grass as he runs around. The grass leaves if Sylvanos is away from it for too long. Sylvanos can use Down Special to call Plants Rise and damage any opponents standing on grass. SEED SHOT - Sylvanos’ Neutral Special fires a deadly seed into the air. If it hits an opponent it will lock them in place, but if it reaches the ground then it will plant a flower that maintains a permanent fixture of grass on that ground or platform until it is destroyed. BURROW - Sylvanos can dig into solid ground and reappear by digging out from a different position. If he digs under grass he can pop out with a strong bite attack to KO enemies off the top of the screen. Elliana is a snake from the burrows in the Eastern Wastelands who has always dreamt of flying. After her dreams of joining the Air Armada were crushed by an intolerant captain, she sought the aid of Ayala, a brilliant engineer. Together they built a steam-powered flying machine and with it, Elliana now plans to destroy the armada that rejected her. OVERHEAT - Elliana’s ship heats up when she uses specials or her unique double jump that allows her to hover. Once overheated she can no longer use her specials or hover, becoming more vulnerable to her enemies. LETTING OFF STEAM - Elliana can perform Strong Attacks to expel steam away from her ship, lowering her Overheat bar. The steam can also catch opponents or be blown away by attacks. When she is overheated, her strong attacks let off a powerful explosion instead that can KO opponents. ABANDON SHIP - Elliana can use her Up Special to abandon ship even when overheated. She launches herself high into the air and her ship explodes. Be careful, as she is very vulnerable while outside of her ship and she must rebuild it upon landing on the ground. Ori and Sein are from the hit indie game Ori and the Blind Forest and they bring their skills to the test in Rivals of Aether. While Ori works to Bash, Stomp and Glide his way to victory, Sein can use the Spirit Flame or the Charged Flame to put enemies between a rock and a hard place. SPIRIT FLAME – Sein follows Ori around the battlefield. Ori can tap Neutral Special to have Sein quickly fire a Spirit Flame from wherever Sein is. Ori can hold Neutral Special to have Sein use the Charged Flame. BASH – Ori can use Down Special to Bash nearly anything in Rivals of Aether – from characters to projectiles to rocks and plants. Ori can also move around the stage by bashing the Light Grenade that is thrown by using Forward Special. TAG TEAM – When Ori and Sein are close enough, Ori can use Strong Attacks to initiate tag team combos. These Strong Attacks have more powerful properties as Sein assists Ori for a more devastating blow. Shovel Knight has learned a lot during Shovel Knight: Treasure Trove and he brings those skills with him to Rivals of Aether. Shovel Knight swings, digs and shovel drops his way through the Rivals roster. He does it all while collecting treasure which he can use to purchase upgrades to give him the upper hand on the battlefield. TREASURE HUNTER – Shovel Knight’s attacks knock coins and gems out of his opponents. He can collect these to increase his treasure. By taunting, he summons Chester and can use his treasure to purchase either Relics or Armors to improve his fighting ability. SHOVEL DROP – Shovel Knight’s signature ability is his Down Air in Rivals of Aether. With this attack he can strike his opponents from above and bounce off their heads. Hold the attack button to keep the Shovel beneath him. He can also bounce off objects and projectiles! EXPERT FISHERMAN – Shovel Knight’s down special is the Fishing Rod. Use it off the side of the stage to fish up some treasure. Time it correctly and fish up a Treasure Rock, but time it perfectly and get a Golden Fish.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/383980/header.jpg?t=1645643593",
    "Price": 29.99,
    "Developers": "Dan Fornace",
    "Publishers": "Dan Fornace",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/383980/ss_92d70324955ed75a306661f37691c56bb09eae00.1920x1080.jpg?t=1645643593,https://cdn.akamai.steamstatic.com/steam/apps/383980/ss_288e39faad2ce79b46deb2df22e80e48aebc6a9d.1920x1080.jpg?t=1645643593,https://cdn.akamai.steamstatic.com/steam/apps/383980/ss_12b7f8e85f9be096c0eeae6ba3864af2bb5254b3.1920x1080.jpg?t=1645643593,https://cdn.akamai.steamstatic.com/steam/apps/383980/ss_441a839b1b112326f0c3eaa7ab520da1c34be014.1920x1080.jpg?t=1645643593,https://cdn.akamai.steamstatic.com/steam/apps/383980/ss_9f82af114f90895c2daa9a4852ce2cd011e20250.1920x1080.jpg?t=1645643593,https://cdn.akamai.steamstatic.com/steam/apps/383980/ss_02c722eeb80472668a29873dde325a2c8d633064.1920x1080.jpg?t=1645643593",
    "Slug": "rivals-of-aether",
    "Meta Title": "Rivals of Aether: Mar 28, 2017, Dan Fornace and Full Over...",
    "Meta Description": "Looking for information on Rivals of Aether? Check out the release date (Mar 28, 2017), developer insights from Dan Fornace, and a complete game summary.",
    "Alt Text Image": "Official header image for Rivals of Aether game - Steam 383980",
    "Canonical URL": "https://gusku.site/game/rivals-of-aether",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rivals of Aether\", \"description\": \"Looking for information on Rivals of Aether? Check out the release date (Mar 28, 2017), developer insights from Dan Fornace, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 28, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dan Fornace\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dan Fornace\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/383980/header.jpg?t=1645643593\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}