{
    "AppID": 893910,
    "Name": "Science Simulator",
    "Release date": "Jul 11, 2022",
    "About the game": "Science Simulator is a atmospheric, relaxation, science educational simulator video game. Explore the history and the people in science. Learn about how the scientific method works. Drive spacecraft such a the voyager spacecraft and Mars Science lab rover in space and on planets where digital elevation maps are used to recreate a mars and moon environment. Inspect the periodic table of elements in a 3d environment allowing you to learn more about the elements that make up the universe, the history of each element and their uses in the modern world. Gain an understanding of the standard model, the pieces that exist inside and come together to create a atom, of logic gates and their different variations and what they do and what they are used for. Inspect the fundamental forces and gain knowledge of the invisible interactions like gravity and electromagnetism. Scout solar systems such as our closet neighbour andromeda and study their properties and what is currently know about them. There are 12 Scientists in the game, with four having room maps. The other 8 room maps will be built with suggestions from the community. Age rating Rated E for Everyone by the ESRB (Entertainment Software Rating Board). ESRB is a self-regulatory organization that assigns age and content ratings to consumer video games in the United States and Canada. Virtual reality (VR) This games support for Steam VR will be turned on in the next update. Multiplayer Multiplayer is planned. Cross play With multiplayer enabled PC and VR users across SteamVR and Oculus, Xbox and playstation Carl Sagan Best known for Cosmos a Personal Voyage released 1980, Carl Sagan is considered the most popular Scientist of the last generation, his works at NASA on the voyager 1 &amp; 2 spacecrafts which contained the first physical messages sent into space, the Pioneer plaque and the Voyager Golden Record, universal messages that could potentially be understood by any extra-terrestrial intelligence that might find them, science fiction books most notable Contact which was made into a feature film and his efforts as a Science Communicator to the public are all well known to many. Enter through this portal to explore the surface of mars. Stephen Hawking There are few people who dont know of the great works done by professor Stephen Hawking, from his work on general relativity, to his predictions that black holes emit what is now called hawking radiation, Hawking was the first to set out a theory of cosmology explained by a union of the general theory of relativity and quantum mechanics. Richard Feynman American theoretical physicist, known for his work in the path integral formulation of quantum mechanics, the theory of quantum electrodynamics, the physics of the superfluidity of supercooled liquid helium, as well as his work in particle physics for which he proposed the parton model. For contributions to the development of quantum electrodynamics, Feynman received the Nobel Prize in Physics in 1965. Nikola Tesla Inventor, electrical engineer, mechanical engineer, and futurist who designed many inventions used widely today such as the modern alternating current (AC) electricity supply system, mechanical oscillators/generators, electrical discharge tubes, and early X-ray imaging. He also built a wireless-controlled boat, one of the first-ever public shown. Albert Einstein Acknowledged to be the greatest physicists of all time, Einstein is best known for developing the theory of relativity, and contributions to the development of the theory of quantum mechanics. The discovery of a new state of matter the Bose–Einstein condensate , His equations are a foundation of todays modern physics. Charles Darwin English Biologist and author, who wrote the the most influential Science book ever, 'On The Origin Of The Species', explain how life forms adapt and evolve over generations of time through random mutation. Alan Turing English mathematician, computer scientist, logician, cryptanalyst, philosopher, and theoretical biologist. Turing was highly influential in the development of theoretical computer science, providing a formalisation of the concepts of algorithm and computation with the Turing machine, which can be considered a model of a general-purpose computer. Turing is widely considered to be the father of theoretical computer science and artificial intelligence. Alexander Bell Scottish-born inventor, scientist, and engineer who is credited with inventing and patenting the first practical telephone. He also co-founded the American Telephone and Telegraph Company (AT&amp;T) in 1885. Bertrand Russell British polymath. As an academic, he worked in philosophy, mathematics, and logic. His work has had a considerable influence on mathematics, logic, set theory, linguistics, artificial intelligence, cognitive science, computer science, and various areas of analytic philosophy, especially philosophy of mathematics, philosophy of language, epistemology and metaphysics. He was a public intellectual, historian, social critic, political activist, and Nobel laureate and was a humanitarian advocate for total nuclear disarmament. Benjamin Franklin American polymath who was active as a writer, scientist, inventor, statesman, diplomat, printer, publisher and political philosopher. Among the leading intellectuals of his time, Franklin was one of the Founding Fathers of the United States. Marie Curie Polish and naturalized-French physicist and chemist who conducted pioneering research on radioactivity. She was the first woman to win a Nobel Prize, the first person and the only woman to win the Nobel Prize twice, and the only person to win the Nobel Prize in two scientific fields. Isaac Asimov American writer and professor of biochemistry at Boston University. During his lifetime, Asimov was considered one of the 'Big Three' science fiction writers of his time. Known for his work on robotics theory referred to as Asimov's three laws or robotics. Periodic Table of Elements A interactive Periodic Table of Elements, where the player can learn about the history properties and uses for each element discovered so far. Fundamental Forces Each of the four Fundamental Forces , Weak, Strong, Electromagnetic and Gravity. The Standard Model Explore the basic building block of the universe. Logic Gates Learn how Logic Gates work and how they are used in technologies such as computers. Solar Systems Fly through the solar systems with descriptions and information. Spacecraft Drive spacecrafts and rovers There are two driving maps moon and mars, with more planned in future updates. Navigate the rover`s to safety. The Future  There are many updates planned for the future, more planets to explorer, more scientific concepts to explain, more scientist room portals including different ages and geographic locations such as the Islamic Golden Age, the history of China`s science and technology, But also a history of the animals of science such as the first dogs in space, Dolly the first cloned sheep and much more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/893910/header.jpg?t=1657580549",
    "Price": 18.99,
    "Developers": "Callum Sales",
    "Publishers": "Stand and Fight Softworks",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/893910/ss_1932d4382f27e814a3860556fcaaf59bd5c6d2c3.1920x1080.jpg?t=1657580549,https://cdn.akamai.steamstatic.com/steam/apps/893910/ss_5d3cd7a4c73479391789e2e1c212eca7f51e55df.1920x1080.jpg?t=1657580549,https://cdn.akamai.steamstatic.com/steam/apps/893910/ss_48bdd539fd6840b47fe4c7ca87803feef9c0e971.1920x1080.jpg?t=1657580549,https://cdn.akamai.steamstatic.com/steam/apps/893910/ss_88508022e3dad70336f65328e185116e5d9644a5.1920x1080.jpg?t=1657580549,https://cdn.akamai.steamstatic.com/steam/apps/893910/ss_e45bff5de82da15860803fd62ca1736067058228.1920x1080.jpg?t=1657580549,https://cdn.akamai.steamstatic.com/steam/apps/893910/ss_5d4c57c0bc6b7a74baa9cfef2c032ed9e45e1c7e.1920x1080.jpg?t=1657580549",
    "Slug": "science-simulator",
    "Meta Title": "Science Simulator: Jul 11, 2022, Callum Sales and Full Ov...",
    "Meta Description": "Looking for information on Science Simulator? Check out the release date (Jul 11, 2022), developer insights from Callum Sales, and a complete game summary.",
    "Alt Text Image": "Official header image for Science Simulator game - Steam 893910",
    "Canonical URL": "https://gusku.site/game/science-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Science Simulator\", \"description\": \"Looking for information on Science Simulator? Check out the release date (Jul 11, 2022), developer insights from Callum Sales, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Callum Sales\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Stand and Fight Softworks\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/893910/header.jpg?t=1657580549\", \"offers\": {\"@type\": \"Offer\", \"price\": 18.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}