{
    "AppID": 710740,
    "Name": "Sniper Rust VR",
    "Release date": "Jun 19, 2018",
    "About the game": "Crush Enemies with your Sniping Skills in the Immersive Sharpshooter: Sniper Rust VR! Toughen Up! Become an Elite Sniper and Embark on a Dangerous Mission Against a Global Insurgency in this hair-raising, breathtaking Virtual Reality First-Person Sniping Experience where any shot could be your last! The players have spoken! We’ve heard your feedback and updated Sniper Rust VR with some of the most popular requests. Get back in the action with: Cutting-Edge Weaponry - Stalk your prey with a plethora of lethal firearms, locked and loaded with special functions suited for specific occasions. Available weapons include real-world guns like the DSR-50 and SVD sniper rifle, as well as the MaC-7, which was inspired by the CheyTac M200, and the Scout Rifle-inspired DG-5000. Death-Dealing Enemy Troops and Vehicular Combatants - Diverse enemy classes make every playable mission a challenge: be wary of well-concealed snipers, air/group assaults and traps behind enemy lines. Immersive Virtual Reality Experience - With numerous uniquely designed environments to explore — including ports, forests, mountains, deserts and even ancient temples — you’ll feel like you’re truly part of Sniper Rust VR’s virtual world! Although with multiple, varied objectives to complete on your adventure, there’ll hardly be time to take in the sights. A new bonus level – ready for a new challenge? New enemies lay in wait – and so does a new firearm for you to dispatch them with. New cover mechanics – catch your breath and stay out of sight by ducking behind crates, barrels, and pallets. When the bullets stop, you go. Gun recoil – every shot counts. Feel the power of your firearm each time you pull the trigger. Updated graphics – see the environment come to life with a graphical overhaul and more realistic lighting and shadows. Achievements – get recognized for your excellence with 10 new player achievements, and get rewarded with killer customization options: 2 new skins for each gun &amp; 2 new gloves. Action-Packed Soundtrack - Intense orchestral sounds composed by John Leonard French are the perfect accompaniment for the game’s thrilling, edge-of-your-seat action sequences. Sniper Rust VR is now available for HTC Vive, Oculus Rift, Oculus Rift S, and Steam headsets. Get your gear and get in the game! Sniper Rust VR Official Website: -rust-vr/ Sniper Rust VR Discord: Zatun Facebook: / Zatun Instagram: /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/710740/header.jpg?t=1589379045",
    "Price": 9.99,
    "Developers": "Zatun",
    "Publishers": "Zatun",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/710740/ss_810fdb8193b954cbdc289b12bf04f1a7a18b6ba6.1920x1080.jpg?t=1589379045,https://cdn.akamai.steamstatic.com/steam/apps/710740/ss_aa50e903ad62aa23e3f0aea2e95702e4f9aeb393.1920x1080.jpg?t=1589379045,https://cdn.akamai.steamstatic.com/steam/apps/710740/ss_43394ea9e83eb636f90d6a870525950033c5550d.1920x1080.jpg?t=1589379045,https://cdn.akamai.steamstatic.com/steam/apps/710740/ss_fdc7fb044acc702a5f6bb9fd4d8ff4fd3e584c21.1920x1080.jpg?t=1589379045,https://cdn.akamai.steamstatic.com/steam/apps/710740/ss_a1531079fe8e1736e174f942cc803173b627e212.1920x1080.jpg?t=1589379045,https://cdn.akamai.steamstatic.com/steam/apps/710740/ss_5cd2aaf678eb7dd0e9a35dd4a17730c3016c638a.1920x1080.jpg?t=1589379045,https://cdn.akamai.steamstatic.com/steam/apps/710740/ss_4047524e220a9dd6761e382e7ca3ce2a0a78d3d9.1920x1080.jpg?t=1589379045,https://cdn.akamai.steamstatic.com/steam/apps/710740/ss_f61a476ebb77b05af3dff1392b222596e3744212.1920x1080.jpg?t=1589379045",
    "Slug": "sniper-rust-vr",
    "Meta Title": "Sniper Rust VR: Jun 19, 2018, Zatun and Full Overview",
    "Meta Description": "Looking for information on Sniper Rust VR? Check out the release date (Jun 19, 2018), developer insights from Zatun, and a complete game summary.",
    "Alt Text Image": "Official header image for Sniper Rust VR game - Steam 710740",
    "Canonical URL": "https://gusku.site/game/sniper-rust-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sniper Rust VR\", \"description\": \"Looking for information on Sniper Rust VR? Check out the release date (Jun 19, 2018), developer insights from Zatun, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 19, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zatun\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zatun\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/710740/header.jpg?t=1589379045\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}