{
    "AppID": 1525210,
    "Name": "Steel Graves",
    "Release date": "Feb 12, 2021",
    "About the game": "Steel Graves combines nervous 3rd person combat, real-time strategy and the ability to build a large base in massive multiplayer battlefields. Join the faction of humans specializing in defense or gain the advantage with the offensive abilities of aliens. During your fighting against the enemy, you will have to take the right decisions to spread and to dominate your opponent. You will have to build outposts and to collect as much crystals as possible. The one owning the crystals dominate the game. But be careful ! Some dynamic events may change the course of the battle. Two playable factions Take place in this conflict and choose your side. Become a soldier in Neoterra and colonize planets. Technology, weapons and credits will be your best chances to survive. Develop and annihilate the enemy or take the alien's side and spread your biomass. Lay and breed to dominate the human invader. Your number will be your greatest strenght. Several game modes Steel Graves offers several game modes like survival mode for the bravest soldiers of Neoterra. During 50 waves, you will have to survive the alien hordes who will try at all costs to exterminate you. This mode will require a lot of effort and speed because you will need an infallible defense to hold out as long as possible. Your friends can come and help you take up the challenge or explore the world of Steel Graves with you in story mode. The versus mode, meanwhile, will pit you against other players in a fierce battle where all shots are allowed. Build your base One of the most important aspects is the construction system which provides a strategic dimension to the game. There is no limit for construction, each player can freely place turrets, construct buildings to equip and produce troops or build a huge base with walls / stairs / roofs, ... It is possible to win just by building bases and recruiting a large army. Every game is different The course of the games is unpredictable, all your opponents will have a different style of play in the versus mode, the rich and varied environments will require a specific approach to take control of the battlefield, the absence of experience points or phases of gathering resources allows full focus on the game. Missions and dynamic events Several missions are given to factions allowing them to obtain bonuses such as air strikes, or trigger an event causing victory such as an orbital strike. In addition, a game is never won in advance. A meteor shower can destroy your base or that of your opponents, reinforcements can arrive or a secret weapon can be triggered. Characteristics 2 playable factions with different gameplays: Play as an alien or a human. 3 tough game modes: Survive 50 waves of alien solo or co-op / Compete against other players in versus mode / Go on a mission in a story-driven campaign. 3 biomes, 7 playable cards: Explore the desert lands of the planet Tartarus, ambush from the dense vegetation of Gaia and colonize the frozen hell of Hades. Innovative construction system Various weapons and armor for Humans: 7 different alien classes 8 different human classes Lots of different buildings Dynamic events: Meteor showers / Reinforcement arrivals Giant mechanized playable armor Characteristics in development Biomes (planet) and maps Game modes: Versus with 3 factions, ... Dynamic events: Air strikes, landings of human reinforcements in ships, sandstorms, ... Human missions Alien missions Give orders to your units: Follow me, Defend the position, ... Faction 'The scavengers' Artillery: Addition of a strategic dimension with the addition of long range artillery New weapons, armor, buildings, alien evolutions Victory above all The war is waiting for you. Join us on the battlefield. We need sharp-minded and ruthless soldiers because the enemy is on our doorstep. So what are you waiting for ?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1525210/header.jpg?t=1645197620",
    "Price": 24.99,
    "Developers": "Aridide Production",
    "Publishers": "Aridide Production",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1525210/ss_9fe91f13f3a281a962f16515fc5318ddeeb0838f.1920x1080.jpg?t=1645197620,https://cdn.akamai.steamstatic.com/steam/apps/1525210/ss_2120cb25413fbc588151492cb6a64f35525095f7.1920x1080.jpg?t=1645197620,https://cdn.akamai.steamstatic.com/steam/apps/1525210/ss_ea02d3f2ff6200fe4a986e46c8e2aa0d684f0883.1920x1080.jpg?t=1645197620,https://cdn.akamai.steamstatic.com/steam/apps/1525210/ss_704878fc39797fd5d3c81d6c9cfcc86de709d50a.1920x1080.jpg?t=1645197620,https://cdn.akamai.steamstatic.com/steam/apps/1525210/ss_cf3820db9689cc021e5d94f1879867d5e84cbf19.1920x1080.jpg?t=1645197620,https://cdn.akamai.steamstatic.com/steam/apps/1525210/ss_e3eee2c9934ed787c52e4cff0f25d0cff81260a7.1920x1080.jpg?t=1645197620,https://cdn.akamai.steamstatic.com/steam/apps/1525210/ss_9948104f04691e004e426b568dd95b69d59097de.1920x1080.jpg?t=1645197620,https://cdn.akamai.steamstatic.com/steam/apps/1525210/ss_3f4e79fbd6aefe3a3732c3eda41831ce9f8ba465.1920x1080.jpg?t=1645197620,https://cdn.akamai.steamstatic.com/steam/apps/1525210/ss_1ae53709e17ef1268cad33a1fe15b613302c64a1.1920x1080.jpg?t=1645197620,https://cdn.akamai.steamstatic.com/steam/apps/1525210/ss_c78730012ade2031db45a77df29cc8dc82634e69.1920x1080.jpg?t=1645197620,https://cdn.akamai.steamstatic.com/steam/apps/1525210/ss_232f85c5126fa5f9fd5996c5520f52a7a423314b.1920x1080.jpg?t=1645197620",
    "Slug": "steel-graves",
    "Meta Title": "Steel Graves: Feb 12, 2021, Aridide Production and Full O...",
    "Meta Description": "Looking for information on Steel Graves? Check out the release date (Feb 12, 2021), developer insights from Aridide Production, and a complete game summ...",
    "Alt Text Image": "Official header image for Steel Graves game - Steam 1525210",
    "Canonical URL": "https://gusku.site/game/steel-graves",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Steel Graves\", \"description\": \"Looking for information on Steel Graves? Check out the release date (Feb 12, 2021), developer insights from Aridide Production, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aridide Production\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aridide Production\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1525210/header.jpg?t=1645197620\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}