{
    "AppID": 1949220,
    "Name": "Steel Ocean: Wolves of Deep Sea",
    "Release date": "Apr 19, 2022",
    "About the game": "“Steel Ocean: Wolves of Deep Sea” is a free-to-play, MMO shooting game. As a navy commander, you may choose 6 types of warships used in the World War II to fight the 16vs16 battles. Start the voyage with your warships and fight for the honor of your fleet! game Features: Essence of team play: Tactics first 6 warship types and over 100 famous warships with distinctive features. Steel Ocean: Wolves of Deep Sea presents the 6 most representative warships of the modern and contemporary naval system, namely, destroyer, light cruiser, heavy cruiser, battleship, carrier, and particularly the “deep sea killer” – submarine, appearing for the first time. Deep Sea Assassin - D-Class Submarine Attacks. Steel Ocean: Wolves of Deep Sea presents the nightmare of Atlantic ships for all captains, the famous deep-sea assassin - D-series submarine! German submarines with enhanced underwater speed, underwater endurance and torpedo loading capabilities have better lighting efficiency and a safer output environment. At this point, the complete lineup of wolves that the German Navy is proud of has officially debuted, and the fiery scene of wolves fighting will be particularly spectacular. The following is an introduction to the basic information of D-series submarines. Captains who like to play submarines can do their homework in advance： U-IIA (D series 2-class submarine): On the day when the Anglo-German naval agreement was passed, the new German submarine U-1 was officially launched. The new submarine is called Type 2A (Tpye IIA), which is mainly used for submarine crews. train and test. Due to their small tonnage, these submarines seldom conduct far-sea operations. U-VIIA (Class 3 submarine of D series): Type 7A is the basic prototype of Type 7 submarine. It is a new generation of medium-sized attack submarines built by the German Navy after World War I. This type of submarine was designed in 1933 and its main technology is based on World War I. The Type 3 submarine was improved. The performance of the Type 7 submarine is very good, and the diving speed is very good. U-VIIC (D series 4-class submarine): The 7C type is the most productive type of the 7-type submarine, and it is also one of the main submarines of the German submarine force during World War II. This type of boat is slightly longer than the 7B type, but does not improve the performance of the main engine, so the speed is reduced. U-VIIF (D class 5 submarine): As the threat of Allied aircraft to the submarine force was increasing, Germany thought of strengthening the submarine's air defense to counter the threat of air strikes. Some Type 7C submarines were converted into dedicated anti-aircraft submarines (U-Flak). These conversions added two to three quadruple 20mm anti-aircraft machine guns to the submarine, and experimentally added 37mm anti-aircraft guns. Anti-aircraft artillery, torpedo reserves were reduced. U-IXA (D series 6-level submarine): The 9A submarine was designed as the basic type of the 9-type submarine in 1935. It refers to the Type 1 submarine developed after the First World War. Its combat goal is to focus on ocean-going operations. The fuel tank and the torpedo attack capability were strengthened. U-IXC (D-Series 7th-class submarine): The 9C type adds an additional 43 tons of fuel tanks on the basis of its basic model, which further expands the sailing range. This series also removes the second periscope in the control room. In order to perform mine-laying tasks, the Type 9C also has additional mine chambers. U-IXD-2 (Class 8 submarine of the D series): Type 9D is the largest model among Type 9 submarines. The entire Type 9D is divided into 3 types due to different power systems. Type 9D2 is mainly based on Type 9D1. Its unreliable powertrain has been corrected. U-XXI (D series 9-class submarine): Type 21 is one of the new high-speed submarines developed by the German Navy during World War II. The boat was designed to increase the underwater speed as the main goal. Therefore, the shape and structure of the boat The design is very simple and streamlined, removing the useless deck guns, while increasing the battery capacity and improving the power system, giving it a strong underwater combat capability, the Type 21 has also become the prototype of modern submarines. Incorporating hundreds of classic tactics, and supporting the original tactic system. Steel Ocean: Wolves of Deep Sea also restores hundreds of classic sea battle tactics and sea battle maps. The players may replay the “Wolf pack tactics”, “Competing for T head” and other famous tactics at real time, and independently design the new tactics based on the maps, natural environment, weather conditions, warship combination and other objective factors. Diversified competition modes, and team play varying from modes. The actual sea warfare is not merely the exchange of firepower. Steel Ocean: Wolves of Deep Sea provides tens of combat modes, from the MOBA random matching for combat, the battle to seize the isle for testing the team tactics, to the short distance contact battle without isle, combat of small teams in different sizes, and even the super large legion PVP battlefield in the boundless water…, available to meet the different requirements of game players. Each mode includes several sets of applicable tactics and derivative skills, bringing the endless and changeable battlefield experience. Manual setting of multiple gun positions on the whole ship. Steel Ocean: Wolves of Deep Sea adopts the manual control setting of the whole ship's gun positions, which can manually control multiple firepower points. Even in cruise mode, it can control the firepower from any angle and switch different attacking equipment, fully enjoying the real 'competitive competition, control' pleasure'. No island and all waters battlefield. For the first time, Steel Ocean: Wolves of Deep Sea has added an island-free mode to the 3DTPS vehicle naval battle online game, simulating a real sea encounter situation, greatly improving the mobility of combat units, creating an unfettered battlefield in the entire waters, and avoiding the embarrassing situation of 'all people squatting'. Various lighting and striking methods. Steel Ocean: Wolves of Deep Sea uses the water surface inertial simulation system to create real ballistics and ship inertial displacement, which greatly increases the cost of attacking moving targets. Only by constantly moving and changing the travel path during the battle can the player escape the fierce artillery fire and become the last king! Highly immersive interactive map to restore World War II scenarios. The development team of Steel Ocean: Wolves of Deep Sea accurately simulates the isles, reefs, buildings, metrological, weather conditions, etc. of many sea areas in the world, based on the results of consulting extensive historic records and many times of site surveys, and the actual geographic environment data. Separated Damage Calculation system to ensure more accurate attack. In addition to the original damage calculation by health bars of the TPS vehicle war games, Steel Ocean: Wolves of Deep Sea is incorporated with the separated damage calculation system (“SDC”). Commanded by hundreds of officers of World War II, providing warships with tactic soul. Steel Ocean: Wolves of Deep Sea includes the innovative warship commander system, incorporated with hundreds of famous navy generals during the 2nd World War, based on the actual history of the period, to impart the cold warships with the different tactic features. Unique legion system to create super marine legions. The fleet guild system provides a big platform for players to communicate on tactics, and also combines the team play and the fleet growth mechanism into one. Built-in radio voice to effectively restore maritime communication. One of the most critical factors deciding the success or failure of a military operation is intelligence. The information communication at any place and at any time is the basis for the battle with the team collaboration, and the key for realizing the strategic cooperation of multiple warship types in the modern sea battles.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1949220/header.jpg?t=1650425279",
    "Price": 0.0,
    "Developers": "Changyou.com Limited",
    "Publishers": "Changyou.com Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_70de70aa01b09ade8f624208f5cd797338be0a40.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_2ef6bd7cb8a2bc4c7357476d0b184b45104a25f4.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_9da15449f2bd0b8340be2ddd17c8cf572817c06d.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_cb926057c049fa0b7b0b51170683235fc07b1bb7.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_f27c3449bd90bb649d1acace22415a5ed1e2a2ec.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_f52b09a89697807220376d5446e080b7d5282d51.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_ea7ef674a0a4d650351d7dde1500d021d55a0fda.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_98a3ebac1e1ad47f3fd8eb3b6c667998f86332dd.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_d0d3d5d9c320235b9a9ee3bdc8f724ca63e0ebdf.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_944dccbff85f0f110aabd4698d31d6cd40822aa4.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_612d186841ccf51143550730db3e658d6e398517.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_a4535d1a1fce3a8dea9dd71d142e1e0b3edda99f.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_6c34a7bdda26e9c5530b27494a61ace77a55f75b.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_6d7866a4eadbc7880f7888305ac1ad8bcf58d9c9.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_acfed18ce0714400d4a24a4e46c84261cac030f3.1920x1080.jpg?t=1650425279,https://cdn.akamai.steamstatic.com/steam/apps/1949220/ss_feb9c57df84c44fda8ba64ab9273c0fb463ac48f.1920x1080.jpg?t=1650425279",
    "Slug": "steel-ocean-wolves-of-deep-sea",
    "Meta Title": "Steel Ocean: Wolves of Deep Sea: Apr 19, 2022, Changyou.c...",
    "Meta Description": "Looking for information on Steel Ocean: Wolves of Deep Sea? Check out the release date (Apr 19, 2022), developer insights from Changyou.com Limited, and...",
    "Alt Text Image": "Official header image for Steel Ocean: Wolves of Deep Sea game - Steam 1949220",
    "Canonical URL": "https://gusku.site/game/steel-ocean-wolves-of-deep-sea",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Steel Ocean: Wolves of Deep Sea\", \"description\": \"Looking for information on Steel Ocean: Wolves of Deep Sea? Check out the release date (Apr 19, 2022), developer insights from Changyou.com Limited, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Changyou.com Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Changyou.com Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1949220/header.jpg?t=1650425279\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}