{
    "AppID": 264710,
    "Name": "Subnautica",
    "Release date": "Jan 23, 2018",
    "About the game": "Subnautica is an underwater adventure game set on an alien ocean planet. A massive, open world full of wonder and peril awaits you! Dive Into a Vast Underwater World You have crash-landed on an alien ocean world, and the only way to go is down. Subnautica's oceans range from sun drenched shallow coral reefs to treacherous deep-sea trenches, lava fields, and bio-luminescent underwater rivers. Manage your oxygen supply as you explore kelp forests, plateaus, reefs, and winding cave systems. The water teems with life: Some of it helpful, much of it harmful. Scavenge, Craft, and Survive After crash landing in your Life Pod, the clock is ticking to find water, food, and to develop the equipment you need to explore. Collect resources from the ocean around you. Craft diving gear, lights, habitat modules, and submersibles. Venture deeper and further form to find rarer resources, allowing you to craft more advanced items. Construct Underwater Habitats Build bases on the sea floor. Choose layouts and components, and manage hull-integrity as depth and pressure increase. Use your base to store resources, park vehicles, and replenish oxygen supplies as you explore the vast ocean. Unravel the Mystery What happened to this planet? Signs abound that something is not right. What caused you to crash? What is infecting the sea life? Who built the mysterious structures scattered around the ocean? Can you find a way to make it off the planet alive? Disrupt the Food Chain The ocean teems with life: Use the ecosystem to help you. Lure and distract a threatening creature with a fresh fish, or simply swim as fast as you can to avoid gnashing jaws of roaming predators. Handle the Pressure Build a Pressure Re-Active Waterproof Nanosuit, or PRAWN Suit, and explore extreme depth and heat. Modify the suit with mining drills, torpedo launchers, propulsion cannons, grappling hooks and more. Fear the Night As the sun goes down, the predators come out. The ocean is unforgiving of those caught unprepared in the darkness. Areas that are safe to explore during the day become treacherous at night, but also reveal a beauty that those who hide from the darkness will never see. Dive Below the Ocean Floor Cave systems wind below the sea bed, from dark claustrophobic passages to caverns lit by bio-luminescent life and burning-hot lava flows. Explore the world below the ocean floor, but watch your oxygen levels, and take care to avoid the threats lurking in the darkness. Open Development Get weekly or daily updates, see what the development team is working on, view real time change logs, and give feedback from inside the game. Subnautica Early Access development is open, and the development team wants to hear from you. About the Development Team Subnautica is being created by Unknown Worlds, a small studio founded by Charlie Cleveland and Max McGuire that traces its roots back to the 2003 Half-Life mod Natural Selection. The team is scattered around the globe, from the United States to the United Kingdom, France, the Czech Republic, Russia, Thailand, Australia, and many more places. There is a central office in San Francisco, California that serves as home base for the whole team. Warning This game contains flashing lights that may make it unsuitable for people with photosensitive epilepsy or other photosensitive conditions. Player discretion is advised.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/264710/header.jpg?t=1652393192",
    "Price": 29.99,
    "Developers": "Unknown Worlds Entertainment",
    "Publishers": "Unknown Worlds Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/264710/ss_e182b6b20bb797500f9f63c561586d920d44e37c.1920x1080.jpg?t=1652393192,https://cdn.akamai.steamstatic.com/steam/apps/264710/ss_970a13f246e33e0df26d93baf9f8e975732adb4b.1920x1080.jpg?t=1652393192,https://cdn.akamai.steamstatic.com/steam/apps/264710/ss_5f2f2ea498cdc632cbffd6cf37c1a09670eb3272.1920x1080.jpg?t=1652393192,https://cdn.akamai.steamstatic.com/steam/apps/264710/ss_cebc378d2f7bc78978c21db4e3c5e12ccd067349.1920x1080.jpg?t=1652393192,https://cdn.akamai.steamstatic.com/steam/apps/264710/ss_0ace7f8b4350b8fbdd16345a76bc30545256e918.1920x1080.jpg?t=1652393192,https://cdn.akamai.steamstatic.com/steam/apps/264710/ss_f0eeabe108c2bc2b3e370b9828fb280035b50db2.1920x1080.jpg?t=1652393192,https://cdn.akamai.steamstatic.com/steam/apps/264710/ss_b28404f3d108cc15aebbb2c3d7cb17e587225662.1920x1080.jpg?t=1652393192,https://cdn.akamai.steamstatic.com/steam/apps/264710/ss_623579a6693f6fc48033e619cacc4306f10eef15.1920x1080.jpg?t=1652393192,https://cdn.akamai.steamstatic.com/steam/apps/264710/ss_9fdfcc7572ae22b4afa21e6de3b23c962ca5bb55.1920x1080.jpg?t=1652393192,https://cdn.akamai.steamstatic.com/steam/apps/264710/ss_883a98ad56021ce409219e1b749818866b6115cd.1920x1080.jpg?t=1652393192",
    "Slug": "subnautica",
    "Meta Title": "Subnautica: Jan 23, 2018, Unknown Worlds Entertainment an...",
    "Meta Description": "Looking for information on Subnautica? Check out the release date (Jan 23, 2018), developer insights from Unknown Worlds Entertainment, and a complete g...",
    "Alt Text Image": "Official header image for Subnautica game - Steam 264710",
    "Canonical URL": "https://gusku.site/game/subnautica",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Subnautica\", \"description\": \"Looking for information on Subnautica? Check out the release date (Jan 23, 2018), developer insights from Unknown Worlds Entertainment, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 23, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Unknown Worlds Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Unknown Worlds Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/264710/header.jpg?t=1652393192\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}