{
    "AppID": 261510,
    "Name": "Tesla Effect: A Tex Murphy Adventure",
    "Release date": "May 8, 2014",
    "About the game": "Winner of Best Character from AdventureGamers.com as well as 10 of their Readers Choice awards including Best Story and Best Adventure of 2014 . Tesla Effect is a cyberpunk noir detective mystery adventure set in a dystopian post World War III San Francisco. Tex Murphy wakes up – disoriented and head pounding – on the fire escape outside his office atop the Ritz Hotel. Another typical morning for the last of the old-school detectives. Except it isn’t. What starts out as the worst hangover in history becomes a baffling nightmare: something – or someone – has erased Tex’s memory of the past seven years. Motivated by lost love, revenge, and the world’s strongest coffee blend, Tex must retrace his own steps into a maze of unsolved murders, hidden agendas, and lost technologies of Nikola Tesla. Only by solving the mysteries of his past can Tex hope to regain his memory in time to restore what’s been lost…and stop a terrifying future. Tex Murphy is finally back after leaving loyal fans on a cliffhanger for almost 16 years, so come get acquainted in a world filled with dangerous dames, morally ambiguous characters, and lots of mysteries to be solved. Tesla Effect upgrades the classic Tex Murphy experience with HD live-action -- that's right, for those of you not old enough to have played adventure games in the 90s, Tex Murphy embraces the lost art of green screen full-motion video as it interacts with fully modeled 3D environments. Players will be challenged with logic puzzles, interactive dialogue, branching storylines, and alternate endings. Stunning full-motion video (FMV) presented in 2K resolution Fully explorable 3D environments (no pre-set nodes, go wherever you like!) Multiple story paths leading to 5 different possible endings Unique dialogue choices and character interactions Beautiful, moody, and immersive soundtrack Two difficulty settings: play casually or as a seasoned detective Built-in hint system to help guide you through challenges Tesla Effect shines with an eclectic cast of actors, including: Todd Bridges (Willis from Diff'rent Strokes. Ask someone older if you don't know) June 'TV's Greatest Mom' Lockhart (ask someone even older if you don't know) Larry 'Soup Nazi' Thomas (you've seen Seinfeld, right?) Kevin 'Tom Servo' Murphy (Mystery Science Theater 3000) The original Tex Murphy himself, Chris Jones Tesla Effect is 6th title in the multi-award-winning Tex Murphy adventure series. Starting in 1989 with Mean Streets , Tex Murphy was already breaking new ground by presenting full-motion video and digitized speech and sound which redefined what computer hardware was capable of at the time. While Martian Memorandum (1991) continued this tradition of excellent, engaging, and visually stunning gameplay, it wasn't until Under a Killing Moon (1994) that the series really took a leap into the forefront of PC gaming. Under a Killing Moon not only provided players with rich full-motion video but was also one of the first games to feature a true Hollywood cast. As for the gameplay experience: it was unparalleled. Utilizing Access Software's amazing 'Virtual World' engine, the game provided players with completely explorable full-3D environments. Crouch under desks, rifle through drawers, or stand on your toes to glance at the top shelf of a cabinet. Nothing was off-limits, and no other game utilized such immersive technology. Under a Killing Moon would go on to win many awards, including 'Best Fantasy Role-Playing/Adventure Program' at the Codie Awards. The Pandora Directive (1996) continued this tradition of groundbreaking technology by being one of the first FMV adventure titles to feature multiple endings, multiple gameplay paths, and shipped on 6 compact discs. It also featured Hollywood acting talent and won 'Best adventure game of 1996' by both Computer Gaming World, and Computer Game Entertainment. Tex Murphy: Overseer (1998) would come next, and would be the first PC game title to be released on the very new (at the time) DVD format. This enabled the game's full-motion video to be presented at levels of quality never before seen in a video game. While the game was a re-telling of the original Mean Streets story, it also featured Hollywood acting talent, and a completely redesigned 3D Virtual World engine. 16 years would pass between Overseer's release and Tesla Effect's continuation of the series (thanks to a successfully funded Kickstarter campaign). It would once again maintain Tex Murphy's tradition of ground-breaking adventure game entertainment with 2K full-motion video, full 3D environments, and a dynamic cast of actors to help bring the long-awaited continuation of the Tex Murphy saga to life. To learn more about the Tex Murphy series, visit .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/261510/header.jpg?t=1619198899",
    "Price": 19.99,
    "Developers": "Big Finish Games",
    "Publishers": "Big Finish Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_75b443bbf1b52c382593fab8d43d3986f5ab176e.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_212e9c26306394db812ccbd5576a65e8f0fcf8b9.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_09b81d431c8b7316b8b350f2fc9dcb649ec94b75.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_e09f30c892f9504f68205ce17f08f25e53f58636.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_8134ccc281e99f5eda4f500bb12d162a5661ab3e.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_8abb762960a5b3f20865a494d15b3ca0f61ac872.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_53ad1186cab4ce4838ee1cdb583f515123300fb4.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_1c961538267247298fed35fe5d91f230ea023b8d.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_92111213a5f60127cbe2f06c9779dde55cda290f.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_73403cc39781b2eaddb54682b46e1c0be682474f.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_2fcef1a719289be286ce5fe1e88104a4879d1d03.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_c4d399d024d10733359655b113615e137c5d4625.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_2bdc048088ff0facfbf37777fbf33f517ceade3b.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_275d5a327d7a820f67927accc3f5967c31fc64d5.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_49918e7f83982362dbe65bc4f47e7f8526605436.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_c12dedc0e98d79c831e82b3fcbe35935ae223e0b.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_f83e97340b67f0e2bedad9bc295105529c266469.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_b8c24dc757401216490a88f84b11e9f4c08dbd05.1920x1080.jpg?t=1619198899,https://cdn.akamai.steamstatic.com/steam/apps/261510/ss_264181436133ea41ff5a0c90403658a7e26d2083.1920x1080.jpg?t=1619198899",
    "Slug": "tesla-effect-a-tex-murphy-adventure",
    "Meta Title": "Tesla Effect: A Tex Murphy Adventure: May 8, 2014, Big Fi...",
    "Meta Description": "Looking for information on Tesla Effect: A Tex Murphy Adventure? Check out the release date (May 8, 2014), developer insights from Big Finish Games, and...",
    "Alt Text Image": "Official header image for Tesla Effect: A Tex Murphy Adventure game - Steam 261510",
    "Canonical URL": "https://gusku.site/game/tesla-effect-a-tex-murphy-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tesla Effect: A Tex Murphy Adventure\", \"description\": \"Looking for information on Tesla Effect: A Tex Murphy Adventure? Check out the release date (May 8, 2014), developer insights from Big Finish Games, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 8, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Big Finish Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Big Finish Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/261510/header.jpg?t=1619198899\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}