{
    "AppID": 1174830,
    "Name": "The Magician's Workshop",
    "Release date": "Dec 19, 2019",
    "About the game": "When your master is murdered, you must uncover the magical secrets of Renaissance Italy, before your rival apprentices expose them first! The Magician’s Workshop is a 190,000-word interactive historical fantasy novel by Kate Heartfield, where your choices control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination. In 1512, Florence is known for ruthless politics, art, and magic. Now that the infamous Medici banking family is back in power, the city is full of dangerous secrets. What would the treacherous Machiavelli do in a situation like this? Just ask him in person! When your master's body washes up in the Arno river, you must take over his Maria Novella workshop—the designs, the paintings, the marvelous machines and inventions, and most importantly, his book of spells, written in various ciphers and magical invisible inks. You have inherited a roster of dangerous clients who are losing patience, and two rival apprentices who could prove allies or even lovers, if they don't turn on you to wrest the workshop from your hands. Can you use your skills in the arts or sciences to gain allies and buy time? Are you quick enough with a blade to keep yourself safe in the streets? Are you clever enough to decode the master's instructions to build a terrible new machine, and are you ruthless enough to sell it to the highest bidder? Or will you work together with your fellow apprentices to build the machine in secret and use it to bring stability to the city, and to all of Italy? • Play as male, female, or non-binary; gay, straight, bi, asexual, or poly. • Use alchemy, animation and soothsaying to create magical entertainments, win street fights and impress your clients • Design and build a flying machine, an unbreakable vault, a wall-breaking weapon, an enchanted pen and ink for a philosopher, or a refillable gold purse for bribes • Uncover the secrets of Florence and rise to power in your own workshop, leading your own team of magicians and artists • Meet famous historical figures such as Niccolo Machiavelli and the future Pope Leo X • Paint a fresco in the public square, escape your enemies in a boat chase on the Arno River, or just play cards and talk politics in the taverns of Florence The master made dark sacrifices to learn what he knew. Are you prepared to do the same?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1174830/header.jpg?t=1634752995",
    "Price": 4.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1174830/ss_2d7362e0da620eb40eba8c82e695d4a9210dc09d.1920x1080.jpg?t=1634752995,https://cdn.akamai.steamstatic.com/steam/apps/1174830/ss_c722f2bc57d425eb3bbbd0e6315faf7dd543e47c.1920x1080.jpg?t=1634752995,https://cdn.akamai.steamstatic.com/steam/apps/1174830/ss_def51dc250c58a4ffdd3b5fe55b31bfe5dbf4319.1920x1080.jpg?t=1634752995,https://cdn.akamai.steamstatic.com/steam/apps/1174830/ss_48264945815ebae43a9b2c8a48b5d3c899f13e01.1920x1080.jpg?t=1634752995,https://cdn.akamai.steamstatic.com/steam/apps/1174830/ss_c2fb7388bff9b0d9c7803f4ad609ce9663eed1b9.1920x1080.jpg?t=1634752995",
    "Slug": "the-magician-s-workshop",
    "Meta Title": "The Magician's Workshop: Dec 19, 2019, Choice of Games an...",
    "Meta Description": "Looking for information on The Magician's Workshop? Check out the release date (Dec 19, 2019), developer insights from Choice of Games, and a complete g...",
    "Alt Text Image": "Official header image for The Magician's Workshop game - Steam 1174830",
    "Canonical URL": "https://gusku.site/game/the-magician-s-workshop",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Magician's Workshop\", \"description\": \"Looking for information on The Magician's Workshop? Check out the release date (Dec 19, 2019), developer insights from Choice of Games, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 19, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1174830/header.jpg?t=1634752995\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}