{
    "AppID": 1078960,
    "Name": "The Saga of Nino's Transmigration (尼諾的異世界物語 ~ 光與影與各自的信仰 ~)",
    "Release date": "Oct 16, 2019",
    "About the game": "(This game is totally free.) The Saga of Nino's Transmigration is an RPG game based on the traditional JRPG combined with roguelike RPG and card game elements. In this game, the character traditional RPG stat system is replaced by a talent system. Nino is able to procure talents from a random predetermined pool, which tests the player’s decision-making ability and resource management skills. Nino welcomes all fans of roguelike RPG and JRPG fans. We also hope that Nino will help players who got tired of the farming element in RPG games regain their love for the genre. JRPG-style story revolved around the concept of “time” The Saga of Nino's Transmigration tells the story of Nino having died in the real world and is transported to another one. There, he is now a cult leader whose religious scripture is the Bible! As a Christian in his previous life, Nino wants to teach his new followers the right way and confront enemies to end the war. Unfortunately, Nino was cursed at the start of his journey. His lifespan was now presented by a few dozen fruits, which will be gradually consumed over the next three days. The game follows Nino over the course of these three days, during which the player will need to manage their time to help Nino break through the obstacles and complete his journey. A Heavy Focus on Time Limit and Resource Management Every single one of Nino’s actions, be it battle, rest, or movement, will take time. The player must manage their time well to ensure that Nino does not die to the curse. At the same time, Nino can also share the fruits representing the remaining time of his life with others for various rewards. But be warned, doing so will only shorten Nino’s lifespan! Roguelike Elements Character talents are randomly generated from a predetermined pool each time Nino sets off on his journey. The player would then be able to choose the most appropriate one to strength Nino. The player must choose Nino’s talents wisely as they each come with their own strengths and weaknesses. One would be able to defeat powerful foes by making good use of these talents; but failing to do that would result in Nino hitting a dead end. There is a total of 108 different talents and 100 different skills in the game, which tests the player’s adaptability. For example, when Nino gains the fire immunity talent, the player should choose to use “self-burn” cards more, which sets both Nino and his enemy on fire, to increase the payoff, since Nino is now immune to fire damage. Another example would be combining the using more water-based attacks after gaining the Electric Shock talent to increase Nino’s damage output. Combat System The Saga of Nino's Transmigration uses an Active Time Battle system, which JRPG fans will be very familiar with. Unlike the typical turn-based games, the constant flow of time is displayed and factored in during combat. The Saga of Nino's Transmigration is heavily inspired by three games: Dead Rising 2, Atelier Roronia: Alchemist of Arland, and Slay the Spire. We hope you will enjoy the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1078960/header.jpg?t=1613931719",
    "Price": 0.0,
    "Developers": "firepillar2",
    "Publishers": "firepillar2",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1078960/ss_8c280f691f905028365c24de79ea43679265ab9b.1920x1080.jpg?t=1613931719,https://cdn.akamai.steamstatic.com/steam/apps/1078960/ss_d109716681ec04240660ac339fef0877a9a61283.1920x1080.jpg?t=1613931719,https://cdn.akamai.steamstatic.com/steam/apps/1078960/ss_8c027bd93e1e69b6b4a0d42f39019d4c8cae5fcc.1920x1080.jpg?t=1613931719,https://cdn.akamai.steamstatic.com/steam/apps/1078960/ss_fee8b1489dfba0ed1112b3ae7dc538f7f449f4c2.1920x1080.jpg?t=1613931719,https://cdn.akamai.steamstatic.com/steam/apps/1078960/ss_5bd434e5ce6d53c4498ebfbe4d5e030bc3572a8d.1920x1080.jpg?t=1613931719,https://cdn.akamai.steamstatic.com/steam/apps/1078960/ss_e1bbe7b74149ab24eb71cef73472b298432b69cc.1920x1080.jpg?t=1613931719,https://cdn.akamai.steamstatic.com/steam/apps/1078960/ss_dadf968122337d6e65643678e075fedac40c81d7.1920x1080.jpg?t=1613931719",
    "Slug": "the-saga-of-nino-s-transmigration",
    "Meta Title": "The Saga of Nino's Transmigration (尼諾的異世界物語 ~ 光與影與各自的信仰 ~...",
    "Meta Description": "Looking for information on The Saga of Nino's Transmigration (尼諾的異世界物語 ~ 光與影與各自的信仰 ~)? Check out the release date (Oct 16, 2019), developer insights fro...",
    "Alt Text Image": "Official header image for The Saga of Nino's Transmigration (尼諾的異世界物語 ~ 光與影與各自的信仰 ~) game - Steam 1078960",
    "Canonical URL": "https://gusku.site/game/the-saga-of-nino-s-transmigration",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Saga of Nino's Transmigration (\\u5c3c\\u8afe\\u7684\\u7570\\u4e16\\u754c\\u7269\\u8a9e ~ \\u5149\\u8207\\u5f71\\u8207\\u5404\\u81ea\\u7684\\u4fe1\\u4ef0 ~)\", \"description\": \"Looking for information on The Saga of Nino's Transmigration (\\u5c3c\\u8afe\\u7684\\u7570\\u4e16\\u754c\\u7269\\u8a9e ~ \\u5149\\u8207\\u5f71\\u8207\\u5404\\u81ea\\u7684\\u4fe1\\u4ef0 ~)? Check out the release date (Oct 16, 2019), developer insights fro...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 16, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"firepillar2\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"firepillar2\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1078960/header.jpg?t=1613931719\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}