{
    "AppID": 1364800,
    "Name": "The Emperor's Own: Alpha Teaser",
    "Release date": "Nov 4, 2020",
    "About the game": "The Emperor’s Own is a story-driven adventure game with RPG elements. It features deep, multi-dimensional characters, difficult moral dilemmas, and a mature, branching narrative where your decisions truly matter. NOTE: THE BELOW DESCRIBES WHAT’S PLANNED IN THE FULL VERSION OF THE GAME. NOT ALL OF IT IS CURRENTLY AVAILABLE IN THE FREE ALPHA TEASER. The story takes place in an alternate universe, inspired by the Russian Empire at the dawn of the 19th century. You play as a young officer in Imperial Secret Intelligence. The empire is exhausted by foreign wars and mounting internal protest. The division between the haves and the have-nots has never been as stark. A peasant uprising is threatening to turn into a bloody class-based civil war. How far will you go to do your sworn duty? Will you restore order by any means necessary? Or will you instead throw kindling into the fire, and watch it burn all around you? In The Emperor’s Own, the choice is always yours. The world awaiting you is one of contrasts and extremes, from the dizzying wealth of the imperial palace and the capital, to the poverty and destitution of backwater villages. You’ll be fully immersed in a time and place unlike quite any before seen in a computer game. We don’t sugarcoat anything, and don’t pull any punches. You’ll experience that world and its atmosphere with all the glory and all the horror it has to offer, without any fairy-tales, magic, or monsters. Only real people attempting to find their way through trying times, showcasing the best and the worst that human beings are capable of. You'll take on the role of Cornet Alexander Obolenskii, a young officer recently recruited into Secret Intelligence because of outstanding accomplishments in the Imperial Academy, and an even more outstanding last name. The unit answers to no one but the Emperor himself. You’re entrusted with life and death authority over all other residents of the Empire, from the lowest peasant to the highest aristocrat. Will you use that power to carry out your orders? To advance your personal interests? To fight for an idealistic cause? That is, of course, up to you. Along your adventure you’ll meet a memorable cast of characters. Each has his own thoughts, motivations, and hidden agendas. The world is not black and white, and there are no heroes or villains. You’ll encounter daring officers, noble ladies, corrupt officials, firebrand rebels, sadistic psychopaths, and God knows whoever else. The game is fully voiced, and all the characters are brought to life by top-tier professional voice actors. In addition to grand political intrigue, there are personal moments to experience, including friendship, family, and romance. And should you wish to indulge your baser desires, there will be an opportunity to do that as well. The story is not linear, and your decisions truly matter. They have far-reaching consequences that don’t reveal themselves until later on. Once you make a choice, you’ll have to live with it, no matter the outcome. There are no right and wrong answers, and no one is ever safe. Any character, no matter how important, can die at any moment, perhaps even by your hand. The year is 1803. The Slavomir Empire is recovering after a vicious conflict with its southern neighbor. Word is spreading that the uneasy peace is about to give way to another war, even more bloody and devastating than the last. Emperor Alexei III has raised taxes and increased the term of military service, further inflaming the already exhausted peasantry. Dissatisfaction in the provinces is increasing daily, and serfs are at the limits of their patience. Few people are aware of the true situation in the Empire, however. Most of high society are still attending balls and receptions in the capital without a care in the world, although there’s discontent among some of the nobility as well. Secret societies and plots of all manner abound. The line between enemy and friend, truth and lies is getting ever more blurred. The Empire is atop a powder keg; all that’s missing is a spark. And in the midst of it all, rumors of mysterious and supernatural events in the borderlands have reached the capital. Peasants are whispering that the Emperor has lost God’s favor, and that a change is needed at the very top…",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1364800/header.jpg?t=1641970035",
    "Price": 0.0,
    "Developers": "Volga Studios",
    "Publishers": "Volga Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1364800/ss_fb31e71d7115ab3f98bd3303ebf7c8e0f8aa35d0.1920x1080.jpg?t=1641970035,https://cdn.akamai.steamstatic.com/steam/apps/1364800/ss_c9a86a15edb54a60ca45b05a2d4b1b268edcbfcb.1920x1080.jpg?t=1641970035,https://cdn.akamai.steamstatic.com/steam/apps/1364800/ss_588f8d1081d41c23cea9cf74af735394ec0d437c.1920x1080.jpg?t=1641970035,https://cdn.akamai.steamstatic.com/steam/apps/1364800/ss_69cda9614c4d8dba97a9946c40a98ef5af611ad0.1920x1080.jpg?t=1641970035,https://cdn.akamai.steamstatic.com/steam/apps/1364800/ss_ff68dac547ff435c40152dd107c5e2e6fe3ac609.1920x1080.jpg?t=1641970035,https://cdn.akamai.steamstatic.com/steam/apps/1364800/ss_b2f842736c5e52b53cb09d70e71ad99194f79ff8.1920x1080.jpg?t=1641970035,https://cdn.akamai.steamstatic.com/steam/apps/1364800/ss_86a557937e518feaf02338a4c42c696383ad7c7b.1920x1080.jpg?t=1641970035,https://cdn.akamai.steamstatic.com/steam/apps/1364800/ss_9f5cbb5e0d8a3ab665d3813a4e6a9433aba1af23.1920x1080.jpg?t=1641970035,https://cdn.akamai.steamstatic.com/steam/apps/1364800/ss_a97af5d9ec72ccea0531d93a663953d80385fd44.1920x1080.jpg?t=1641970035,https://cdn.akamai.steamstatic.com/steam/apps/1364800/ss_4c240da8f32e112078b87ed307348f5d7b4b559a.1920x1080.jpg?t=1641970035,https://cdn.akamai.steamstatic.com/steam/apps/1364800/ss_32bf4af09ec95ce755e9c0bc8c3f60dce06eab92.1920x1080.jpg?t=1641970035,https://cdn.akamai.steamstatic.com/steam/apps/1364800/ss_f628dcfdcb12ef7c8da383023b0d2bd724a194f2.1920x1080.jpg?t=1641970035,https://cdn.akamai.steamstatic.com/steam/apps/1364800/ss_8b1071ec4d04421ec09e8b5108702c5620ec6afb.1920x1080.jpg?t=1641970035",
    "Slug": "the-emperor-s-own-alpha-teaser",
    "Meta Title": "The Emperor's Own: Alpha Teaser: Nov 4, 2020, Volga Studi...",
    "Meta Description": "Looking for information on The Emperor's Own: Alpha Teaser? Check out the release date (Nov 4, 2020), developer insights from Volga Studios, and a compl...",
    "Alt Text Image": "Official header image for The Emperor's Own: Alpha Teaser game - Steam 1364800",
    "Canonical URL": "https://gusku.site/game/the-emperor-s-own-alpha-teaser",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Emperor's Own: Alpha Teaser\", \"description\": \"Looking for information on The Emperor's Own: Alpha Teaser? Check out the release date (Nov 4, 2020), developer insights from Volga Studios, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Volga Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Volga Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1364800/header.jpg?t=1641970035\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}