{
    "AppID": 1137400,
    "Name": "The War for the West",
    "Release date": "Nov 14, 2019",
    "About the game": "As the ruler of a province in the Western Peninsula, it will be expected of you to hold court and make yourself available to petitioners, settling disputes and delivering justice to the land and its inhabitants. The War for the West is a grimdark 485,000 word interactive medieval fantasy novel by Lucas Zaper. Among your duties will be to administer the money collected from taxes and see that it is well spent, be it in improvements to the local infrastructure or in purchasing personal objects and services. You will also need to manage your relationship with other powers and arrange a proper suitor for marriage, which will serve both to ensure the continuation of your lineage and consolidate your alliances. But even if diplomacy fails, the military will always be at your command, ready to suppress rebellions and defend your fief against foreign invaders. To guarantee their supremacy in the field of battle, you must keep a steady flow of recruitment and enforce constant training. Alas, not all problems can be dealt with by soft words and sharp blades. In such circumstances, one may find that there is little a few drops of poison or a well-placed agent cannot solve. This all may appear overwhelming at first, but you will count with the assistance of your counselors, each with their own specialties. Their advice will prove invaluable as you navigate through the dangerous dynamics of the realm’s politics. If you can keep their treachery in check, that is. Play as a Lord or a Lady, and find pleasure wherever you see fit. Fight in the open field, withstand a siege, join your enemy or avoid conflict entirely. Marry for love, power, or convenience, and use lovers to settle your lust if necessary. Bow to the church or defy it by joining the northern heresy or making your own religion. Uncover the secrets of your lineage and the ancient mysteries of the world, as well as many hidden endings. Make allies and enemies as you visit neighboring provinces and interact with other nobles. Decide over a vast number of random events that might happen as you hold court. Build your army and test it in battle against your enemies.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1137400/header.jpg?t=1573739293",
    "Price": 6.99,
    "Developers": "Hosted Games",
    "Publishers": "Hosted Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1137400/ss_f056069765b490fd2ec86f323bafd3c77a339a6a.1920x1080.jpg?t=1573739293,https://cdn.akamai.steamstatic.com/steam/apps/1137400/ss_f3b6c2b8147020970f17d9e252f3f9b141b4dd04.1920x1080.jpg?t=1573739293,https://cdn.akamai.steamstatic.com/steam/apps/1137400/ss_30e587989bd4ee32066a1961c60a46eb678ddca3.1920x1080.jpg?t=1573739293,https://cdn.akamai.steamstatic.com/steam/apps/1137400/ss_8b0224fe3e59f915df06d75d69c4ac5eda6ee9de.1920x1080.jpg?t=1573739293,https://cdn.akamai.steamstatic.com/steam/apps/1137400/ss_33d1ecf88fd8dd914bf0952dc1931c71ac9e00af.1920x1080.jpg?t=1573739293",
    "Slug": "the-war-for-the-west",
    "Meta Title": "The War for the West: Nov 14, 2019, Hosted Games and Full...",
    "Meta Description": "Looking for information on The War for the West? Check out the release date (Nov 14, 2019), developer insights from Hosted Games, and a complete game su...",
    "Alt Text Image": "Official header image for The War for the West game - Steam 1137400",
    "Canonical URL": "https://gusku.site/game/the-war-for-the-west",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The War for the West\", \"description\": \"Looking for information on The War for the West? Check out the release date (Nov 14, 2019), developer insights from Hosted Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hosted Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hosted Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1137400/header.jpg?t=1573739293\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}