{
    "AppID": 1486060,
    "Name": "The Lustful Champion",
    "Release date": "Mar 7, 2022",
    "About the game": "Humor filled story Multiple Endings Intimacy with men, women, or both? It's YOUR Path! 112 Collectable CG Gallery Images Explicit Sexual content Censored mode (No nudity, just humor!) Super Censored Mode (No foul language! Sex? Nah, kissing!) The Calories Game (CCG Mini-game) The Lustful Champion follows the story of Jerry, a regular dude who unexpectedly manages to get himself transported into a different realm. This realm is under attack by the evil Cabal whose goal is to rid the realm of pleasure and eradicate the magical powers of the Sexba. Can Jerry be useful for once, and help the Lustful Champions save the realm from utter destruction and a sexless existence? The world that will become Jerry's new place is a world where technology like phones and computers are non-existent. This world is a world where the strong survive and the weak perish. A world where magic exists in two different forms. The magic of the old world, and the Sexba, a form of magic that only those with the most raging hormones possess! A world nothing like our own, where conflicts aren't resolved by long internet posts or apology videos on the internet, no this is a world where conflicts are resolved through violence and sex. (Or kissing, if you play in the 'Super censored' mode which changes all references from sex to kissing!) The Lustful Champion, a title given to those who have proven themselves to possess a great amount of Sexba energy, but also the strength, agility, dexterity, and pure willpower that they possess! A Lustful Champion is a symbol to the people, and oftentimes leads battles against their enemies. Those who have proven themselves will be appointed a Lustful Champion by the ruler of their respective kingdoms. The Lustful Champion is by no means 'just another one of THOSE games', it's an adult-oriented comedy-adventure visual novel game, created by Wetcat Games and published by JjustGames. But because we understand that not everyone that enjoys dark and crude humor can also appreciate nudity or sexual content, There are options that fully remove nudity and sexual content. The 'Super Censored' mode heavily tones down the swearing to a level that can be considered 'Safe For Work'. Not everyone enjoys nudity, explicit sexual content, or lots of swearing, so we want to make the game as accessible as possible without compromising on our strange sense of humor. In the Censored mode, sexual images are blacked out so that at least viewing wise it's less NSFW. This is what sets The Lustful Champion apart from a lot of adult-oriented games. We LOVE mini-games, and there are a few of those in the game! The Calories Game is a deck collecting mini-game where you try to get as close to the 3000 kcal mark as possible! Which foodie deck will ensure your win? Can you collect all the decks? Pet-I-Mon battle and pop quizzes also exist as smaller mini-games!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1486060/header.jpg?t=1655388776",
    "Price": 6.99,
    "Developers": "Wetcat Games",
    "Publishers": "JjustGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1486060/ss_b432791390c18cc4b6234b2e913aa9e3fee5b1c3.1920x1080.jpg?t=1655388776,https://cdn.akamai.steamstatic.com/steam/apps/1486060/ss_1a7dc4beb64077a1a6a6c5de993f27296a4f7570.1920x1080.jpg?t=1655388776,https://cdn.akamai.steamstatic.com/steam/apps/1486060/ss_066ca463378362a6f4c9cc81ab6e291addf9e7d2.1920x1080.jpg?t=1655388776,https://cdn.akamai.steamstatic.com/steam/apps/1486060/ss_158ce4fcea2c0182b63b7f214b6607cbd148d456.1920x1080.jpg?t=1655388776,https://cdn.akamai.steamstatic.com/steam/apps/1486060/ss_8b4908b70d13ff9c19c016bf1c6ed9ca00be1557.1920x1080.jpg?t=1655388776,https://cdn.akamai.steamstatic.com/steam/apps/1486060/ss_b2f24e52afde9342b50555be92f1fedfffc3150e.1920x1080.jpg?t=1655388776,https://cdn.akamai.steamstatic.com/steam/apps/1486060/ss_af050b2dbafc28635989fbc58a9a9195186d63a1.1920x1080.jpg?t=1655388776,https://cdn.akamai.steamstatic.com/steam/apps/1486060/ss_87f51781254270fdf8b6732224336ebf1ff5735f.1920x1080.jpg?t=1655388776,https://cdn.akamai.steamstatic.com/steam/apps/1486060/ss_6f760e2782a834872480087ecc025f7f50207ef9.1920x1080.jpg?t=1655388776,https://cdn.akamai.steamstatic.com/steam/apps/1486060/ss_524dff63367a4fd06eaa66f894d7bcb6985a9e68.1920x1080.jpg?t=1655388776,https://cdn.akamai.steamstatic.com/steam/apps/1486060/ss_864722c44e0a8a54941484059c788fb5c023f293.1920x1080.jpg?t=1655388776,https://cdn.akamai.steamstatic.com/steam/apps/1486060/ss_c7e19ceaa04317f3add7ee3c75d5f039653c169f.1920x1080.jpg?t=1655388776",
    "Slug": "the-lustful-champion",
    "Meta Title": "The Lustful Champion: Mar 7, 2022, Wetcat Games and Full ...",
    "Meta Description": "Looking for information on The Lustful Champion? Check out the release date (Mar 7, 2022), developer insights from Wetcat Games, and a complete game sum...",
    "Alt Text Image": "Official header image for The Lustful Champion game - Steam 1486060",
    "Canonical URL": "https://gusku.site/game/the-lustful-champion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Lustful Champion\", \"description\": \"Looking for information on The Lustful Champion? Check out the release date (Mar 7, 2022), developer insights from Wetcat Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wetcat Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JjustGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1486060/header.jpg?t=1655388776\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}