{
    "AppID": 1005120,
    "Name": "Touhou Genso Wanderer -Lotus Labyrinth R-",
    "Release date": "May 25, 2021",
    "About the game": "Venture into dungeons with a huge party of your favorite Touhou characters! This is a dungeon-crawler RPG with an absurdly large party size! The dungeon-crawler RPG Genso Wanderer is now a game with an Oversized Party System that pushes the envelope of the roguelike genre! Now you can bring dozens of partners with you on your dungeon crawls, in addition to other quality of life improvements that make the game's systems and controls smoother than ever. Overwhelm your enemies with strength in numbers! Lead tons of your favorite Touhou characters at once and conquer the impregnable Lotus Labyrinth! THE STORY One day, on one of his scavenging outings to Muenzuka, Rinnosuke Morichika finds a curious device that drifted in from the outside world. The device turns out to be a machine called the WRS (World Replication System), which generates a playable game set in a cyber-world. Rinnosuke brings the WRS to Nitori Kawashiro for examination. Once Nitori activates it, it fulfills its intended purpose by generating the cyber-world Lotus Land. Sanae Kochiya and Tenshi Hinanawi happen to be there for this, and they log into the cyber-world to play this fancy new game. Little do they know that the cyber-world created by the WRS can also potentially spill over into the real world... This is the start of an all-new adventure set in a cyber-world! SYSTEM ◆Oversized Party System - If you can't hack it alone, bring the whole gang! Prior Genso Wanderer games restricted the player to exploring alone, or with a single partner, but no longer! This game lets you bring in tons of partners all at once. Bring in everybody you've recruited! Or just bring in the characters you like! Blaze your way through dungeons with the power of friendship and overwhelming numbers! ◆Oversized Party Formation System - Form teams and bring them all in to conquer dungeons! In addition to the usual main party led by the player, you can assign your partners to entire other teams with their own leaders, which can then act separately. You can create optimal party comps, or you can throw all that out the window and make gimmick teams like the Scarlet Devil Mansion Team, the Green Hair Team, the Little Sister Team, or whatever else you feel like! ◆Partner Skill System - Master various skills, share them with partners, and power them up! In this game, partner abilities grow stronger with Skill items. Raise your partners' ranks and bring out their latent abilities! You can also assign skills by team! Customize and set skills to suit your own style of play! ◆Mega Variety Equipment System - Load up on tons of weapons and armor! In a departure from prior Genso Wanderer titles, you can now equip up to 10 separate weapons, 10 separate pieces of armor, and 10 separate charms, all at the same time! And this equipment strengthens more than just the player. All of your party members benefit from it! Select an equipment loadout that accounts for all of your partners' traits and weaknesses, not just your main character's! FAQ ◆Saving This game autosaves at the following points: ・Moving to a new floor ・Abandoning or suspending a dungeon ・Returning to the title screen from the Option menu ◆Quitting the game In dungeons: Choose Suspend in the magic circle on any floor, then choose Quit from the title screen menu. Out of dungeons: Choose Return to Title from the menu, then choose Quit from the title screen menu. ◆Keyboard controls BASIC MENU KEY CONFIG Cursor up: ↑ Cursor down: ↓ Cursor left: ← Cursor right: → Confirm: Z Cancel: X OTHER MENU KEY CONFIG Tab left: D Tab right: F Scroll up: PageUp Scroll down: PageDown Function 1: C Function 2: A Function 3: E Function 4: W Function 5: Left Shift Switch menu left: G Switch menu right: H Filter: PageUp Sort: PageDown Scroll left: Home Scroll right: End Quick command up: Home Quick command down: End Quick command left: PageDown Quick command right: Delete Switch equipment set up: Home Switch equipment set down: End DUNGEON KEY CONFIG Move up: ↑ Move down: ↓ Move left: ← Move right: → Attack: Z Dash: X Cross menu: A Turn in place: C Fire danmaku: D Switch to Danmaku 1: PageDown Switch to Danmaku 2: End Switch to Danmaku 3: Delete Switch to Danmaku 4: Home Check danmaku radius: Insert Instant dash: F Diagonal movement: LeftControl Options menu: E Resize mini-map: Space Walk in place: Tab Switch mini-map: V Switch player: B CROSS MENU KEY CONFIG Items: ↑ Tactics/Team: ← Equipment: → Underfoot: ↓ Switch stat display: H DIALOGUE KEY CONFIG Text speed up: PageUp Text speed down: PageDown Next: Z Hide text: X Auto: Space Options: A Back log: C Skip: F End chapter: E CHANGING KEY CONFIG With default settings enabled, press E to open the menu, then press D and F to navigate to [Key configuration] and make any changes. Be aware of the following things when changing key configurations: On the key configuration screen, the Function 1 key (Default: C) will restore keys to their default settings. Be careful not to press it by accident. You will need to save your game to preserve any changes made to key configuration (See the Saving section above for more details). If you force-quit the game without saving, your new key configuration settings will not be saved the next time you start up the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1005120/header.jpg?t=1635739295",
    "Price": 34.99,
    "Developers": "AQUASTYLE",
    "Publishers": "AQUASTYLE",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_3683157980b428dbc8036c45f2335b948b545bfc.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_33d15737f3027749bb336f7c9745bb3cc513a4bd.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_6e808e75e0e958a1c8bdd7df5f32e46913cb507c.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_337448a02b25fa67f3b49163933281b591bdc09c.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_19dc865c7aed3c5b927919f22c324bc2929c8586.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_9f0dfd3e3a23228b30cd1fa248c19fd0238d1892.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_32a5cb1d41bfecd31309d97a0150ffbb5a4919e6.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_d19eafecbadb7b2ca7f1d02408c311b440a39883.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_3d1741b56b2d5356ba82fb796d9eddf571f22a07.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_c806c8a32624601531bc4e3064f89e27fbff1425.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_d7f13dff95d7a12e1b7b8bfd5e607d1e6c76dfcd.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_6abb8441de71156749f7c2a8b47f02c8968962a7.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_36b92b548f0d00b41a9f1f092556aee15cbfdf59.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_c5d4765ab5e06de80d637fe01113195949ed2514.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_35da831ee708d9c1308cee6fe38e42171bae17e0.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_bd553ae1eb1249bd6e49c0e7a6f7ce8bacab7c3a.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_141dffae829496b0c4d3697556eef59ab6201434.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_f11ff96f1a0c43ac8465e75e46cbee915503f950.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_e45ab20106eb1f15c9972aecb7e6aed97361421c.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_ede26dcb0e12a9afe4e6981a56d4d6fdf98f9a0c.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_7aad1e6fa42e25de20810c8884b12249a1faaedf.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_2931a723d4e4eb5eb8f7644fa9bc7ddc9c111d42.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_d8e92705436a83fb1c537c4d5eda0fec361fdea0.1920x1080.jpg?t=1635739295,https://cdn.akamai.steamstatic.com/steam/apps/1005120/ss_2568f9fa634607ea98046ebcd22f0e2de70bf0db.1920x1080.jpg?t=1635739295",
    "Slug": "touhou-genso-wanderer-lotus-labyrinth-r",
    "Meta Title": "Touhou Genso Wanderer -Lotus Labyrinth R-: May 25, 2021, ...",
    "Meta Description": "Looking for information on Touhou Genso Wanderer -Lotus Labyrinth R-? Check out the release date (May 25, 2021), developer insights from AQUASTYLE, and ...",
    "Alt Text Image": "Official header image for Touhou Genso Wanderer -Lotus Labyrinth R- game - Steam 1005120",
    "Canonical URL": "https://gusku.site/game/touhou-genso-wanderer-lotus-labyrinth-r",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Touhou Genso Wanderer -Lotus Labyrinth R-\", \"description\": \"Looking for information on Touhou Genso Wanderer -Lotus Labyrinth R-? Check out the release date (May 25, 2021), developer insights from AQUASTYLE, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"AQUASTYLE\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AQUASTYLE\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1005120/header.jpg?t=1635739295\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}