{
    "AppID": 676930,
    "Name": "TwinCop",
    "Release date": "May 10, 2019",
    "About the game": "Grab a friend and two controllers and get ready for the MOST COOPERATIVE GAME EVER . In this inventive top-down twin-stick shooter, you and a friend control the SAME character! WORK TOGETHER Both of you control movement, so that means communication with your other half is key. Move in OPPOSITE directions, and TwinCop will go nowhere. Move in the SAME direction, and you will move swiftly and heal yourselves. Moving together is the ONLY way to heal, and it also charges your combined super ability, Twinsanity, which slows down time and really lets you gain the upper hand in tough situations. STORY MODE: ABSURD 80s SATIRE You and your partner were the best cops in the greater Twin Cities metropolitan area until a horrific pontoon boat accident nearly killed you. The police department took half of each of your mangled bodies and combined them together using the latest technology to save your lives, combining you into one super-cop: TwinCop. You and your partner now each control half of the same body, so you’ll really need to be in sync with one another if you’re going to survive. What truly happened with that pontoon boat accident? Who is funding the war on these streets? What does the PopTop Corporation (creators of the delicious and healthy PopTop Drink) have to do with any of this? CUSTOMIZE YOUR COP Over 25+ character combinations to try! Choose one of the eight most elite members of the Twin Cities police force, each with their own unique special ability. Try to match up abilities for maximum carnage! Who will you choose? HILARIOUS MINIGAMES When you’re TwinCop, everyday tasks become quite difficult. Defuse bombs by cooperatively cutting wires, chase bad guys through busy intersections, fist bump yourselves after a job well done. You’ll never take these tasks for granted ever again. ***THIS GAME IS BEST WITH 2 LOCAL PLAYERS AND 2 CONTROLLERS TO ENJOY*** This game does not contain Online Play, however you can use the free application Parsec to play with others remotely. You can use Parsec to play with someone else remotely. Only one copy needs to be purchased to play with Parsec, and a stable &amp; fast internet connection is highly recommended.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/676930/header.jpg?t=1579338283",
    "Price": 14.99,
    "Developers": "Finite Reflection Studios",
    "Publishers": "Finite Reflection Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/676930/ss_516658a2d0c0278a4a0fc1c54a8338910c600c4c.1920x1080.jpg?t=1579338283,https://cdn.akamai.steamstatic.com/steam/apps/676930/ss_3f4a2bc21d771ec13fd368221f1eab90b804929d.1920x1080.jpg?t=1579338283,https://cdn.akamai.steamstatic.com/steam/apps/676930/ss_ad8a1054eeec84f725e5dda70baa2ad4498a95ab.1920x1080.jpg?t=1579338283,https://cdn.akamai.steamstatic.com/steam/apps/676930/ss_6fb97e70111c325c4c486888ed1ff524d2478076.1920x1080.jpg?t=1579338283,https://cdn.akamai.steamstatic.com/steam/apps/676930/ss_dd441c34b75ebdc4174bb76245487cda7baf34ec.1920x1080.jpg?t=1579338283",
    "Slug": "twincop",
    "Meta Title": "TwinCop: May 10, 2019, Finite Reflection Studios and Full...",
    "Meta Description": "Looking for information on TwinCop? Check out the release date (May 10, 2019), developer insights from Finite Reflection Studios, and a complete game su...",
    "Alt Text Image": "Official header image for TwinCop game - Steam 676930",
    "Canonical URL": "https://gusku.site/game/twincop",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TwinCop\", \"description\": \"Looking for information on TwinCop? Check out the release date (May 10, 2019), developer insights from Finite Reflection Studios, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 10, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Finite Reflection Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Finite Reflection Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/676930/header.jpg?t=1579338283\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}