{
    "AppID": 1789360,
    "Name": "Void Grimm",
    "Release date": "Dec 10, 2021",
    "About the game": "Void Grimm Void Grimm is a real-time deckbuilding roguelike about furious battles in space where you have to keep a cool head and think quickly. You are the commander of a powerful spaceship that can hold the most destructive weapons and advanced battle systems. In the beginning the armament is quite basic, but as you progress you will find more cards to upgrade your arsenal and recruit crew members that will further improve your combat capabilities. The vast power at your command is bitterly needed as you will encounter deadly waves of enemies. If they manage to break your shield and destroy your armor the run is over. You need to start a new run, apply what you've learned and try a better strategy. Currently two different ships are playable ('Void Grimm' and 'Makara'), which have different playstyles. Each ship has two different loadouts that determine your starting cards. Gameplay Your arsenal of weapons and battle systems is represented by a deck of cards. The cards in your hand can be played again and again, when their cooldown is finished, until they run out of ammo and need to be discarded, which reloads them. When you've discarded a card you automatically draw a new one. You can discard to get rid off unwanted cards and draw into something that you need. Choosing to play or discard your cards is an important part of the strategy. Some cards have strong synergies and when played after another will maximize your damage, but depending on the state of battle you might want to throw away promising combinations to draw quickly into skills that recharge your shield and avoid your destruction. Deckbuilding After each battle and in various events you are given the chance to pick from a collection of cards to enhance your deck. In markets on space station you can remove cards to streamline your deck. It's up to you to find a good balance between optimization and versatility. Removing a card costs money and you need to choose wisely as there are various other ways to spend it. Officers and Ship Upgrades On your journey through space, you encounter officers, who will improve your ship's capabilities and aid you in combat. You start with two random officers and can recruit more in space stations. They are quite powerful, but you can only have six active officers at the same time. A smart team composition is key for your success. Some will help you directly by increasing your damage output or boost your defenses, others provide long-term benefits like repairs between battles, higher money rewards or discounts at shops, where you can upgrade your ship even further or delete cards to optimize your deck. Combat Strategies No deck is perfect to solve all problems. You have to adapt to the different waves of enemies. Some are heavily armored, others do high damage or support their allies by boosting their combat capabilities or healing them. Lastly there are the money carriers, which give you a cool money reward, if you manage to destroy them quickly enough. Prioritizing enemies is important. You can overcome high armor with strong attacks or reduce armor with 'armor breaker' skills. When you 'mark' enemies, each one of your attacks against them will be increased, turning your multi-hit skills into devastating attacks. Replayability Like other roguelikes Void Grimm is intended to be played multiple times. Each run is different as you draw different cards as rewards and encounter different officers. A good commander adapts his strategy based on the tools at hand and the circumstances he encounters. Various difficulty settings allow you to play the game at your own pace, from the relaxed 'easy' to the very challenging 'insane'. Right now the order of the combat levels is fixed and the game goal is to beat your highscore. Early Access The game is in Early Access and more features will be added over time. This includes a map-section with randomized combat levels and other events, so you can choose a path for your run: Will you go for the difficult battles that promise a high reward or do you avoid them to have time to heal and improve your ship gradually? Additional cards, crew member and features will be implemented. I also plan to involve community feedback and suggestions.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1789360/header.jpg?t=1655482369",
    "Price": 9.99,
    "Developers": "Ravery",
    "Publishers": "Ravery",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1789360/ss_450ce571961c4d14a213552872656308c3387043.1920x1080.jpg?t=1655482369,https://cdn.akamai.steamstatic.com/steam/apps/1789360/ss_a527e1d448ac2f8f3d3d6cacbac75fcc0c994798.1920x1080.jpg?t=1655482369,https://cdn.akamai.steamstatic.com/steam/apps/1789360/ss_4f66d4e9ed7bdbbc7c5cb6d68f796ee03f2aecea.1920x1080.jpg?t=1655482369,https://cdn.akamai.steamstatic.com/steam/apps/1789360/ss_a6cc768e7f3623c71d802e5eb831d80384674314.1920x1080.jpg?t=1655482369,https://cdn.akamai.steamstatic.com/steam/apps/1789360/ss_e52abe1e4a278df5cd3752a86ac47b629e9b6a87.1920x1080.jpg?t=1655482369,https://cdn.akamai.steamstatic.com/steam/apps/1789360/ss_4dfc2d3e9397c7ab27dab910185632d30c5ec155.1920x1080.jpg?t=1655482369,https://cdn.akamai.steamstatic.com/steam/apps/1789360/ss_be96fcea6cceca1240d40f05b5643d9479e0b66b.1920x1080.jpg?t=1655482369",
    "Slug": "void-grimm",
    "Meta Title": "Void Grimm: Dec 10, 2021, Ravery and Full Overview",
    "Meta Description": "Looking for information on Void Grimm? Check out the release date (Dec 10, 2021), developer insights from Ravery, and a complete game summary.",
    "Alt Text Image": "Official header image for Void Grimm game - Steam 1789360",
    "Canonical URL": "https://gusku.site/game/void-grimm",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Void Grimm\", \"description\": \"Looking for information on Void Grimm? Check out the release date (Dec 10, 2021), developer insights from Ravery, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ravery\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ravery\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1789360/header.jpg?t=1655482369\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}