{
    "AppID": 511830,
    "Name": "VR Ultimate Paintball: Heartbreak, Regret & Paintbots",
    "Release date": "Aug 9, 2016",
    "About the game": "Go on a journey through vast, ornately decorated halls into deep, dark caverns full of glittering treasures and gaze upon wide open vistas of unparalleled beauty in stunning virtual reality... Is how the description of a pretty little VR experience game might start. However , this is a game about paintball guns and shooting waves upon waves of robots, a dash of story is thrown into the mix and I hope you like it! But remember it’s mainly just inane senseless robot murder, target shooting and leader boards. Created for VR using HTC Vive and Unreal Engine 4 VR Ultimate Paintball: Heartbreak, Regret &amp; Paintbots focuses on an arcade like style of gameplay. Containing four different game modes: wave based shooter, competitive target practice, challenging stage based 'Trial' map and an episodic story. Game Modes Defend or Die, is a wave based game mode where you must defend a power core and yourself from the never ending onslaught of bots. Current Features Never ending waves Helper turrets Two enemy types Re-generating wall Wave intermission store Local leader board Planned Features Deployable shield A Boss battle Different exciting ammunition types Online leader board The Trial is a proof of concept game mode with a lot of work still to be put in. You must stock up before entering 'The Trial' where you are given a set amount of time to progress across 5 different randomly selected maps, the goal is to achieve as high a score as possible in the allotted time. Gain knowledge of the map types and layouts to find the best routes which will let you get the highest scores possible. Current Features 5 Randomly selected modular maps Turrets that block your path and attack Weapon lockers placed throughout the levels Local leader board Planned Features Procedually generated maps Deadly obstacles Paintbot enemy type that will be used to patrol levels Online leader board The story line is experimental as I need to gauge if the community will be interested in seeing more. Hopefully they will, as I'm excited to continue developing the next episode. Currently it's a short but sweet experience traversing across three different levels and introducing you to the world of Heartbreak, Regret &amp; Paintbots. The Competitive Practice Range is a room scale environment which contains an arsenal of weapons at your finger tips (or even vive controllers). Scattered throughout the level are many targets, see if you can get the maximum score in the fastest time! Current Features One detailed map Stationary targets Local leader board Planned Features Dynamicly changable maps (think destructables) Moving targets A wider array of weaponry Online leader board Putting VR Ultimate Paintball into Early Access is a way of letting me continue development on the game. The main objective during this stage will be to implement a paintball multiplayer game mode. Something that was requested during the games time on Greenlight and something that I personally would love to have in the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/511830/header.jpg?t=1470874834",
    "Price": 0.99,
    "Developers": "Robert Potter",
    "Publishers": "Robert Potter",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/511830/ss_6b9ee013c6c68d07f0ed9964838536d4c8b8cd33.1920x1080.jpg?t=1470874834,https://cdn.akamai.steamstatic.com/steam/apps/511830/ss_31e1a9344ec16c3fce0aab745f5968a25030c086.1920x1080.jpg?t=1470874834,https://cdn.akamai.steamstatic.com/steam/apps/511830/ss_8f0103242723d0d6e763cb43978b00ff087c9887.1920x1080.jpg?t=1470874834,https://cdn.akamai.steamstatic.com/steam/apps/511830/ss_57e97075810442af19b9fe6dc8590f0640974559.1920x1080.jpg?t=1470874834,https://cdn.akamai.steamstatic.com/steam/apps/511830/ss_36dfb9ce903befe320eaa4fe5b8137f931e1c41b.1920x1080.jpg?t=1470874834,https://cdn.akamai.steamstatic.com/steam/apps/511830/ss_f41041365032f8f3d1e3b28786764a00709ddea3.1920x1080.jpg?t=1470874834",
    "Slug": "vr-ultimate-paintball-heartbreak-regret-paintbots",
    "Meta Title": "VR Ultimate Paintball: Heartbreak, Regret & Paintbots: Au...",
    "Meta Description": "Looking for information on VR Ultimate Paintball: Heartbreak, Regret & Paintbots? Check out the release date (Aug 9, 2016), developer insights from Robe...",
    "Alt Text Image": "Official header image for VR Ultimate Paintball: Heartbreak, Regret & Paintbots game - Steam 511830",
    "Canonical URL": "https://gusku.site/game/vr-ultimate-paintball-heartbreak-regret-paintbots",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VR Ultimate Paintball: Heartbreak, Regret & Paintbots\", \"description\": \"Looking for information on VR Ultimate Paintball: Heartbreak, Regret & Paintbots? Check out the release date (Aug 9, 2016), developer insights from Robe...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Robert Potter\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Robert Potter\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/511830/header.jpg?t=1470874834\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}