{
    "AppID": 1228410,
    "Name": "WATCH / 透视",
    "Release date": "Dec 3, 2020",
    "About the game": "This is a platform puzzle game related to our 'Perspective' vision. There are a lot of games about 'Vision' , such as 'Monument Valley', 'Fez', or 'Superliminal'. But I believe that even compared with these famous games, this game 'Watch' is still 'different'. You might say, it looks like 'Fez'. Yes, 'Fez' is an important source of inspiration for this game, which uses the same 'camera rotation mechanism'. But what's significantly different from 'Fez' is that it adds 'Perspective' . 'Perspective' is the soul of this game, and it is also the soul of our eyes. With it, our eyes have the feeling of 'Depth' . For example, the building in the distance is as high as the tea cup nearby, one hand nearby looks large enough to hold a Boeing 747, and with one jump, we can cross the mountain top in the distance, and so on. 'Perspective' is usual but magical. It makes our life more colorful. In this game, you will use 'Perspective' to overcome various difficulties, such as, jump over a huge pit, or jump up to the top of a building. You also need to avoid seemingly inescapable obstacles, or avoid lasers that can really kill you at the touch, or step on massive and dangerous robots, and let light travel from here to there ( sometimes you are the light yourself ). In this game, you will use various tools, which can better assist you to use the ' Perspective' to overcome difficulties, such as, 'X' that can move the camera horizontally. There are two other tools I didn't say, and how to use them depends on your intelligence. In addition to the these tools, you will also need to use some props, such as a wooden box or something like it, you have to push them or take them to the right place. You will encounter more strange boxes, green buckets that can be picked up and hold water, and fans that can let you fly into the sky. Remember the robot mentioned earlier? It's also a good combination to have it with the box. And, maybe you want try this strange 'Hotair-Balloon'. Do you want to fill a bucket with just one drop of water? Or let the sun light a cigarette? All these requires you to find out in the game. What if perspective and mirror are combined? Say, A mirror from the 'Atlantis'. Of course, mirrors don't have to be flat, they can bring more interesting things, such as, conical mirror. and cylindrical or pyramidal mirrors, which we call 'Anamorphsis-Art' . When you solve all these puzzles, you will find that 'Perspective' is not only in our real life, but also in our fantastic ideas. Some puzzles are so hard that you may not be able to solve them at first. But please don't underestimate yourself. You can pass all of the tests and finally come to the house at the beginning of the game to understand the whole story. The story of the game itself is also a 'puzzle', at first it will be confusing, but if you are not in such a hurry, please don't skip it easily. I wanted to put more GIF animations, but if I put too many, maybe the store page can't be opened, and you can't see this description. So, if you want to know more, please take a look at the 6 videos above. I hope you enjoy the game. Thank you. (PS: Please don't ignore the dialogues in the game. Sometimes, it may be the key to solve the puzzle.)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1228410/header.jpg?t=1607324819",
    "Price": 10.99,
    "Developers": "7OfUs",
    "Publishers": "电钮组",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1228410/ss_866e84ed1403cad6e4b9ad3ae834857cc0ab8a96.1920x1080.jpg?t=1607324819,https://cdn.akamai.steamstatic.com/steam/apps/1228410/ss_3415d83b257a46e22cab0ddd453d6ba1d737116f.1920x1080.jpg?t=1607324819,https://cdn.akamai.steamstatic.com/steam/apps/1228410/ss_27c0c9d30b766a1b6546c3912db96cf5ad943716.1920x1080.jpg?t=1607324819,https://cdn.akamai.steamstatic.com/steam/apps/1228410/ss_48760281180777b0f38f9469be460cbd7891f68f.1920x1080.jpg?t=1607324819,https://cdn.akamai.steamstatic.com/steam/apps/1228410/ss_6b9167d8fc577d164b82635e93fbe12e8436ed59.1920x1080.jpg?t=1607324819,https://cdn.akamai.steamstatic.com/steam/apps/1228410/ss_9866de11006e600c627efd1a0408aa1035fed37a.1920x1080.jpg?t=1607324819,https://cdn.akamai.steamstatic.com/steam/apps/1228410/ss_19da13bf4d52769c5aac97594621629814e9c394.1920x1080.jpg?t=1607324819,https://cdn.akamai.steamstatic.com/steam/apps/1228410/ss_ba8de115976532e3fbc29cf83025edbfc1bedb76.1920x1080.jpg?t=1607324819,https://cdn.akamai.steamstatic.com/steam/apps/1228410/ss_09dda2dfe3774189d2ab07a3f637fedea56b60b1.1920x1080.jpg?t=1607324819,https://cdn.akamai.steamstatic.com/steam/apps/1228410/ss_b9dfc4226a09bd8bed370358cd6930655a1a873d.1920x1080.jpg?t=1607324819,https://cdn.akamai.steamstatic.com/steam/apps/1228410/ss_77b3d5ddbc1abab579f291dc21fbc903765fb8fe.1920x1080.jpg?t=1607324819",
    "Slug": "watch",
    "Meta Title": "WATCH / 透视: Dec 3, 2020, 7OfUs and Full Overview",
    "Meta Description": "Looking for information on WATCH / 透视? Check out the release date (Dec 3, 2020), developer insights from 7OfUs, and a complete game summary.",
    "Alt Text Image": "Official header image for WATCH / 透视 game - Steam 1228410",
    "Canonical URL": "https://gusku.site/game/watch",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"WATCH / \\u900f\\u89c6\", \"description\": \"Looking for information on WATCH / \\u900f\\u89c6? Check out the release date (Dec 3, 2020), developer insights from 7OfUs, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 3, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"7OfUs\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u7535\\u94ae\\u7ec4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1228410/header.jpg?t=1607324819\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}