{
    "AppID": 1333870,
    "Name": "Widgets and Gidgets",
    "Release date": "Jun 13, 2020",
    "About the game": "You are a lowly gnome (or mech-gnome) that needs to gather 1 million shinnies to prove your worth and graduate from the Gnomish Inventor's Institute. You craft silly things, like gadgets and gizmos and then sell those crafts for shinnies. But the task is grueling, and so you must make machines from those silly parts to help you craft more gadgets and gizmos more quickly and efficiently. However, machines break down and need repaired, and the machines don't work the way you might expect. Work your way through the objectives, to generate 1 million shinnies and graduate from the Inventor's Institute. Crafting - You begin with a small assortment of various parts and use the three crafting bins to combine those parts into more complicated parts. However, the more complicated the part, the more its worth in shinnies . But don't be fooled, the crafting gets harder and more involved as you unlock more recipes. Machines - As you advance through the objectives which guide you through the game, you will be able to build machines which craft parts for you. You will need to use your shinnies to buy the blueprints in the shop, then craft the parts to build the machine. Once built though, machines are partial to breaking down and will need periodic maintenance. Machines can be upgraded to improve their output and efficiency. Resource Management - To be successful and graduate the Institute, you must carefully balance your parts, shinnies and machines. Only widgets and subsequent parts can be sold in the shop. So if you don't have the parts to craft widgets and no shinnies to buy parts, you might fail. Machines have a tendency to over-produce one part or another, consuming valuable resources. If your machines get out of hand, you might fail. Shop - The game's shop provide three categories, trade parts for shinnies , shinnies for parts and upgrade machines and materials. You can even upgrade the materials used for your parts, like Iron, Steel and Titanium, to get more shinnies per part. Careful planning and knowledge of the store's components is key to success. About the Author I am a teacher of 14 years and have always wanted to publish my own game. The main idea behind this game goes back to my childhood working on cars in the garage with my Dad, where the language was 'Hand me that doodad so I can get this thingamajig out of the whatchacallit'. But I have to admit, the drive to publish this game came from the growing unease of my student loan debt. All revenue made from this game will go towards my student loan debt and saving for my 4 kid's college as well. Thanks in advance for purchasing and playing Widgets and Gidgets.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1333870/header.jpg?t=1592052279",
    "Price": 1.99,
    "Developers": "Dwarf Haven Games",
    "Publishers": "Dwarf Haven Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1333870/ss_d5cd197c2f24545fe710c81ef953e61deceb2bc8.1920x1080.jpg?t=1592052279,https://cdn.akamai.steamstatic.com/steam/apps/1333870/ss_92a37d375fdf4e16ce8f0d98b1e3d4925daa7be4.1920x1080.jpg?t=1592052279,https://cdn.akamai.steamstatic.com/steam/apps/1333870/ss_1d5674f9fbd21a7930466a8098283e8fb047cecb.1920x1080.jpg?t=1592052279,https://cdn.akamai.steamstatic.com/steam/apps/1333870/ss_9c29c2dc94f15ac2a6ebff717ca0137b0bfed2b2.1920x1080.jpg?t=1592052279,https://cdn.akamai.steamstatic.com/steam/apps/1333870/ss_2787992f9f0b42d6b46d43fe0cdf4192e4440b0c.1920x1080.jpg?t=1592052279",
    "Slug": "widgets-and-gidgets",
    "Meta Title": "Widgets and Gidgets: Jun 13, 2020, Dwarf Haven Games and ...",
    "Meta Description": "Looking for information on Widgets and Gidgets? Check out the release date (Jun 13, 2020), developer insights from Dwarf Haven Games, and a complete gam...",
    "Alt Text Image": "Official header image for Widgets and Gidgets game - Steam 1333870",
    "Canonical URL": "https://gusku.site/game/widgets-and-gidgets",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Widgets and Gidgets\", \"description\": \"Looking for information on Widgets and Gidgets? Check out the release date (Jun 13, 2020), developer insights from Dwarf Haven Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 13, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dwarf Haven Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dwarf Haven Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1333870/header.jpg?t=1592052279\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}