{
    "AppID": 322780,
    "Name": "Worlds Adrift",
    "Release date": "May 24, 2017",
    "About the game": "The world is in pieces, shattered from a calamity that time has since forgotten. It now falls to you to journey across its perilous skies, foraging the remains of past civilisations. Rally a crew. Build a skyship. Conspire with others to overthrow those that would oppose you, and ultimately find fame… or infamy. The future of Foundation will be shaped by YOUR actions - will you help unite the world, or let it drift further into chaos? Worlds Adrift is a truly ambitious undertaking that's redefining the genre through its use of crowdsourced content. Not only the world's first Community-Crafted MMO, having been designed for and ultimately shaped by its passionate fanbase, it also marks a technical breakthrough as the first game to employ the exciting possibilities of SpatialOS; a platform allowing for the physical simulation of skyships with unprecedented customization options. Offering an entirely user-generated environment, the sheer scale of its scope, and beauty of its design, is an invitation to explore. To discover. To unearth … Countless islands populate a seemingly endless sky. What happened? Why? When? Such answers have been lost to the ruins of bygone civilisations. Your only hope is to traverse these strange but beautiful lands in search of an answer. One that’s perhaps best left forgotten… Have no doubt. The skies are treacherous, and there’s only one way to navigate them - at the helm of your very own skyship. But where to find one? Explore the lands and ransack ruins, in an attempt to discover the learnings of those that came before. Though, the question remains: have you the leadership to rally a crew? While the shattered remains of Foundation are beyond all hope of reform, the same fate needn’t await its people. There are those that dream of a new civilisation amongst the clouds. Will you take up the call, and bring order to the world? Or will you revel in the chaos, to serve your own diabolical gain? Vast and devastating storm walls span the skies. Survive such tempests, and your troubles have only begun! For all manner of players - from scavengers to plunderers, cutthroats to pirates - also call the clouds their home, forever seeking the vulnerable traveller. With escape unlikely, your only options? Join them, or turn... and fight! FEATURES: PvP and PvE Servers - Worlds Adrift offers both PvP and PvE specific servers, to accommodate all preferences of play. User-Generated World - Every stone, brick and blade of grass is there by design, thanks to our dedicated community, who created each and every one of the three hundred islands using our free Island Creator tool. Open Development (Public Test Server) - Worlds Adrift prides itself on its open development approach, and thanks to our Public Test Server, we’re able to react to your feedback better and faster than ever. Ambitious Roadmap - This is only the beginning for Worlds Adrift. There’s a long list of exciting features we plan to add, including trading, territory control, new biomes and additional creatures. True Freedom - Not only are you free to travel anywhere at any time across our truly expansive world, but you’re free to adopt any role within the world, too, whether that’s a builder, a pilot, an explorer… or something far more villainous. Proximity Voice Chat - Bark orders, bellow threats and plead for your life, all from within game, thanks to our recently-added VOIP functionality! Bespoke Shipbuilding - No two ships are the same thanks to our robust shipbuilding tool; gather resources, design your vessel, take it for a test flight, and tweak as necessary! You can even paint the various components, and tweak its numerous stats, to truly personalise it! Grappling Hook - Swing from island to island, ship to ship, with our fan-favourite grappling hook and experience real-life physics at its most impressive! Failing that, there’s a wingsuit, a jetpack, and gravity-defying surface-stick boots to be found! Thriving Community - From in-game trading posts to trouser-stealing pirate crews, what role will you play in the wondrous world of Foundation? Become a Pioneer As an Early Access player, you’re helping shape the vision of Worlds Adrift and are an invaluable asset to its ongoing development. With this in mind, the Standard Pack includes an exclusive Lightning Bug Lantern as an emblem recognising that you were one who lit the way! The Pioneer Pack boasts a further selection of limited edition items that will no longer be available upon full release, including an exclusive cowl and the highly-coveted Drissian pistol. Let the future community know that you helped create the world they’re now exploring! Meet the team… Worlds Adrift is being developed by Bossa Studios, the studio behind the critically acclaimed Surgeon Simulator and I am Bread . This is an incredibly exciting venture for us. Not only are we trying to create something entirely new to the studio, but something entirely new to gaming as well, which is why your continued support is so greatly appreciated. Scrap that - imperative !",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/322780/header.jpg?t=1574697194",
    "Price": 0.0,
    "Developers": "Bossa Studios",
    "Publishers": "Bossa Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/322780/ss_3a77927aeeb63aac5cfdf50645b560c610280afc.1920x1080.jpg?t=1574697194,https://cdn.akamai.steamstatic.com/steam/apps/322780/ss_2bb82686b410e962ee90dac325beb1f22ee35649.1920x1080.jpg?t=1574697194,https://cdn.akamai.steamstatic.com/steam/apps/322780/ss_d80a4233de8f8e874e24d840b5e8ab51daa0d04c.1920x1080.jpg?t=1574697194,https://cdn.akamai.steamstatic.com/steam/apps/322780/ss_1ca24b0d7ace0011d9ff81ea7b28dee61909662e.1920x1080.jpg?t=1574697194,https://cdn.akamai.steamstatic.com/steam/apps/322780/ss_2386cba09c5816b203a70916306baa44caa8e6b9.1920x1080.jpg?t=1574697194,https://cdn.akamai.steamstatic.com/steam/apps/322780/ss_23d12bbdcd9dfb5a8ab14e7ab627ccd12b4dbf4a.1920x1080.jpg?t=1574697194,https://cdn.akamai.steamstatic.com/steam/apps/322780/ss_2f09a277268bedf352c48dbf14e611ca94f0ce49.1920x1080.jpg?t=1574697194,https://cdn.akamai.steamstatic.com/steam/apps/322780/ss_5a37a948d8c61e6a8f77af2e1bdcf36fe64698e8.1920x1080.jpg?t=1574697194,https://cdn.akamai.steamstatic.com/steam/apps/322780/ss_d659201cfc825c73fdf9c6746f001567bc2fc2f4.1920x1080.jpg?t=1574697194,https://cdn.akamai.steamstatic.com/steam/apps/322780/ss_8ad7f404dc422fb21c58e8df208c514b35960c24.1920x1080.jpg?t=1574697194,https://cdn.akamai.steamstatic.com/steam/apps/322780/ss_84aa39bcb4e39b1edfecbd36ebba97c6f45ef491.1920x1080.jpg?t=1574697194,https://cdn.akamai.steamstatic.com/steam/apps/322780/ss_265a3ac47afd7c0000c272c8a859d4c4513c383e.1920x1080.jpg?t=1574697194",
    "Slug": "worlds-adrift",
    "Meta Title": "Worlds Adrift: May 24, 2017, Bossa Studios and Full Overview",
    "Meta Description": "Looking for information on Worlds Adrift? Check out the release date (May 24, 2017), developer insights from Bossa Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Worlds Adrift game - Steam 322780",
    "Canonical URL": "https://gusku.site/game/worlds-adrift",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Worlds Adrift\", \"description\": \"Looking for information on Worlds Adrift? Check out the release date (May 24, 2017), developer insights from Bossa Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 24, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bossa Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bossa Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/322780/header.jpg?t=1574697194\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}