{
    "AppID": 2840,
    "Name": "X: Beyond the Frontier",
    "Release date": "Oct 8, 2010",
    "About the game": "The Human Race had advanced to the point where we could travel among the stars, we developed giant automated machines to help us colonise other worlds, but there was a fault in their programming and they turned and attacked. Forcing us to lay a trap to protect Earth and exiling the Human race to stay on Earth once again. 500 Years later Kyle Brennan starts his journey by piloting an experimental ship equipped with a new piece of technology allowing it to cross vast distances on its own. However it malfunctions and traps him in a group of sectors inhabited by Aliens, hunted and with no way home, this is his story of survival... Beyond the Frontier... X: Beyond The Frontier is the first part in the X-Universe series of games developed by Egosoft. It tells the story of mankind's rise and fall in the universe, and the attempt by Kyle Brennan to help repopulate the stars using a new ship called the Experimental Shuttle, and how he became trapped in a closed group of sectors linked by a series of jumpgates, owing credits to an alien for helping to save him, and hunted by several people. Unknowingly, a group of secret service people are after him, a group who have tried to hide their races secret, that they are the descendants of a group of Humans who saved earth from the Terraformer fleet they created to help colonise the universe. Now with the Truth coming out, X: Beyond the Frontier allows the player to play as Kyle Brennan on his hunt to find a way home, whilst helping a group of people find the truth about their ancestry, and continue to help save earth from the Terraformers who are now known as the Xenon. Features Trade - Trade in over 50 sectors, with over 50 different goods, upgrade you ships with dozens of upgrades available to you by 5 different races. Fight - Find the location of the hostile pirates and survive against attacks by the Xenon. Build - Construct stations to build your own production empire. Think - Adapt your trading empire to suit the needs of each sectors local economy.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2840/header.jpg?t=1637168523",
    "Price": 4.99,
    "Developers": "Egosoft",
    "Publishers": "Egosoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2840/ss_f696dd220a56282e2cac099e9ef1ed7eac3bc90b.1920x1080.jpg?t=1637168523,https://cdn.akamai.steamstatic.com/steam/apps/2840/ss_fd9b2f82caac6d76948bccb8789f022e39b52741.1920x1080.jpg?t=1637168523,https://cdn.akamai.steamstatic.com/steam/apps/2840/ss_defb448cbd3cd4c1fd626a473b65e119f3aa7efa.1920x1080.jpg?t=1637168523,https://cdn.akamai.steamstatic.com/steam/apps/2840/ss_dae50f21294e2932766e21eb8ced262595f6ae78.1920x1080.jpg?t=1637168523,https://cdn.akamai.steamstatic.com/steam/apps/2840/ss_7d7abbb2a19829d59a7aa94ef6ade5b113190d84.1920x1080.jpg?t=1637168523,https://cdn.akamai.steamstatic.com/steam/apps/2840/ss_3eb29b7d1c68034817c5e386f4ce719c13cb2bb7.1920x1080.jpg?t=1637168523",
    "Slug": "x-beyond-the-frontier",
    "Meta Title": "X: Beyond the Frontier: Oct 8, 2010, Egosoft and Full Ove...",
    "Meta Description": "Looking for information on X: Beyond the Frontier? Check out the release date (Oct 8, 2010), developer insights from Egosoft, and a complete game summary.",
    "Alt Text Image": "Official header image for X: Beyond the Frontier game - Steam 2840",
    "Canonical URL": "https://gusku.site/game/x-beyond-the-frontier",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"X: Beyond the Frontier\", \"description\": \"Looking for information on X: Beyond the Frontier? Check out the release date (Oct 8, 2010), developer insights from Egosoft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 8, 2010\", \"author\": {\"@type\": \"Organization\", \"name\": \"Egosoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Egosoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2840/header.jpg?t=1637168523\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}