{
    "AppID": 1388590,
    "Name": "Yakuza 6: The Song of Life",
    "Release date": "Mar 25, 2021",
    "About the game": "In Yakuza 6, Kazuma Kiryu will find out exactly how much people are willing to sacrifice for family - be those ties through blood or bond - when he investigates a series of shadowy events that involve the ones he holds closest to his heart. Fresh out of a three-year prison sentence, an older and weathered Kiryu comes to find out that his surrogate daughter, Haruka, has gone missing from the orphanage he looks after. The trail leads him to his old stomping grounds in Kamurocho, where he discovers that she has been struck by a car and now lies in a coma. To make matters worse, Kiryu learns that Haruka now has a son that he must look after. With baby in hand, Kiryu journeys to the seaside town of Onomichi, Hiroshima to unravel the truth about Haruka, her son, and a sinister secret that the Hiroshima yakuza are harboring. From the unparalleled realism of the new setting of Onomichi, a beautiful, sleepy port town in Hiroshima Prefecture, to the latest evolution of Kamurocho, the biggest red-light district in Tokyo, Yakuza 6 is the ultimate iteration the game's blend of gritty crime story, hyper-explosive combat, and all the vices and distractions those locales have to offer. Enter the “Dragon Engine” - Explore the world of Yakuza like never before. Yakuza 6 is the first current-gen Yakuza title that was developed from the ground up for the current-gen hardware, introducing the seedy Japanese underworld with detailed visuals, lifelike animations, a new physics engine, interactive storefronts, seamless transitions and more. Explore Kamurocho Reborn and the Scenic Views of Onomichi - The hypnotic lights, opportunistic inhabitants, and hedonistic distractions of Kamurocho look better than ever. Revamped minigames like karaoke, batting cages, darts, hostesses, and the SEGA arcade have been streamlined for maximum pleasure, and new additions like the RIZAP Gym, Cat Café, and Clan Creator are the purrfect distractions after a long night of bashing heads! But it’s also time to get away from the hustle and bustle of city life to play tourist in beautiful Onomichi. This tranquil coastal community is home to plenty of local activities like bar mingling, spearfishing (think action-packed rail shooter … with fish), and more! Let the Bodies Hit the Floor - Yakuza 6 Kiryu is a 100% certified badass, so that means he’s a battle-hardened veteran when it comes to the art of street fighting. Although he utilizes one fighting style this time around, you best believe Kiryu hits like a truck. Devastating combos and bone-breaking Heat Actions make a return, but now the Dragon of Dojima can fill up a meter to engage Extreme Heat Mode. When activated, Kiryu glows blue and unleashes heavy-damage combos with his fists or any “tool” that’s close at hand. Fully Voiced Japanese Audio - For the first time in series history, every line and piece of dialogue is fully voiced in Japanese. Let the dramatic story and absurd humor of the series unfold like an interactive foreign film experience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1388590/header.jpg?t=1616691256",
    "Price": 19.99,
    "Developers": "Ryu Ga Gotoku Studio",
    "Publishers": "SEGA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1388590/ss_ef1d13688594fc3abb30293a978898e6a00ceab1.1920x1080.jpg?t=1616691256,https://cdn.akamai.steamstatic.com/steam/apps/1388590/ss_8b9c41d15a8210ed5347b2ceafd39a43a955eee2.1920x1080.jpg?t=1616691256,https://cdn.akamai.steamstatic.com/steam/apps/1388590/ss_a85ae0fdc5c38a1cb73b2ff0425e0109bd72e77d.1920x1080.jpg?t=1616691256,https://cdn.akamai.steamstatic.com/steam/apps/1388590/ss_a11e87a5d52f6524e0ec46d2c8938638bfd23599.1920x1080.jpg?t=1616691256,https://cdn.akamai.steamstatic.com/steam/apps/1388590/ss_d889488199992b85573636f25f6d5a9670492339.1920x1080.jpg?t=1616691256,https://cdn.akamai.steamstatic.com/steam/apps/1388590/ss_a7df948ad81f1e698a942df3c84df70722349cf0.1920x1080.jpg?t=1616691256,https://cdn.akamai.steamstatic.com/steam/apps/1388590/ss_d6b56425a0f2c950cc2d5b37569d39891978ea6e.1920x1080.jpg?t=1616691256,https://cdn.akamai.steamstatic.com/steam/apps/1388590/ss_ebb6b35cd3bb2fd7c575194f2711194b0e7fd76a.1920x1080.jpg?t=1616691256",
    "Slug": "yakuza-6-the-song-of-life",
    "Meta Title": "Yakuza 6: The Song of Life: Mar 25, 2021, Ryu Ga Gotoku S...",
    "Meta Description": "Looking for information on Yakuza 6: The Song of Life? Check out the release date (Mar 25, 2021), developer insights from Ryu Ga Gotoku Studio, and a co...",
    "Alt Text Image": "Official header image for Yakuza 6: The Song of Life game - Steam 1388590",
    "Canonical URL": "https://gusku.site/game/yakuza-6-the-song-of-life",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Yakuza 6: The Song of Life\", \"description\": \"Looking for information on Yakuza 6: The Song of Life? Check out the release date (Mar 25, 2021), developer insights from Ryu Ga Gotoku Studio, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ryu Ga Gotoku Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SEGA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1388590/header.jpg?t=1616691256\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}