{
    "AppID": 1008000,
    "Name": "Aetheria Online",
    "Release date": "Feb 1, 2019",
    "About the game": "Aetheria is an MMORPG which focuses on challenging dungeons, cooperative group play, fast paced PvP, and important crafting elements. Aetheria utilizes action combat, which means no targeting and no standing still while casting, ever! This makes for an intense situation every battle, whether it be with other players or with fierce monsters. The land of Aetheria is unforgiving and harsh, so make sure to bring friends and guildmates on your journey. Dungeons Dungeons in Aetheria feature complex boss mechanics and require at least 5 players to defeat them (Some will require 10 or more!). The rewards are great, but failing to execute mechanics will result in death! Player vs Player Fighting other players in Aetheria can be done in a PvP arena or via Guild Wars. Combat is fast and requires quick reflexes to destroy your foes. If you are victorious, special rewards are bestowed upon you! Crafting Crafting is an important focus in Aetheria. Some of the most powerful weapons and armor can only be crafted. Crafting also is highly integrated into the progression of the story-line. Achievements Achievements are an extra milestone for players wanting to show off their skills in Aetheria. With categories ranging from Crafting and Exploration to Dungeons and Quests, there is a fun achievement for all types of players! Achievements also allow guilds to climb the ranks, as the total achievement points of all members influences your guild score! Costumes Costumes in Aetheria allow you to override the appearance of any of your current armor or weapons with any other piece of gear or costume item in the game. Customize away! Familiars Each class and specialization in Aetheria has a unique familiar which can be summoned to fight beside you in battle against other players or monsters. These little creatures can pack a punch, so make sure to utilize them at all times! Quests Aetheria features hundreds of quests which will require you to craft, kill, collect, interact, and much more. Rewards for completing quests are important and some are even necessary to enter various parts of the world! Guilds Conquer the world of Aetheria alongside your friends by creating or joining a guild! Guilds are a great way to keep in touch with friends. Guilds can also enter into war, making nearly every area of the world open for combat for warring members. War stats are tracked and even influence the rank of your guild. Other Features Over 2500 Unique Items Trading Parties Talent Trees 5 Unique Classes with 2 Specializations Each Frequent Updates",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1008000/header.jpg?t=1581169838",
    "Price": 0.0,
    "Developers": "Zachary Hodges",
    "Publishers": "Zachary Hodges",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1008000/ss_137bb4d171a629927d967bbe0cc725e2d11a8fac.1920x1080.jpg?t=1581169838,https://cdn.akamai.steamstatic.com/steam/apps/1008000/ss_01b023067f4a132b9455f4c593effca81215ac3f.1920x1080.jpg?t=1581169838,https://cdn.akamai.steamstatic.com/steam/apps/1008000/ss_331bbd59a6a765191651ca4af182dfb1a1ca26e6.1920x1080.jpg?t=1581169838,https://cdn.akamai.steamstatic.com/steam/apps/1008000/ss_c4ff0ef8d4df11aa0eec5501bd39e3f94af7ba94.1920x1080.jpg?t=1581169838,https://cdn.akamai.steamstatic.com/steam/apps/1008000/ss_8ccbb81e00058828c1561bb2a862190c23386de1.1920x1080.jpg?t=1581169838,https://cdn.akamai.steamstatic.com/steam/apps/1008000/ss_a1f7b5fd8d0f7b5e8b402c959f12f35204d0fed3.1920x1080.jpg?t=1581169838,https://cdn.akamai.steamstatic.com/steam/apps/1008000/ss_6e1e11639372676e8d2ad213652b8d9366abd857.1920x1080.jpg?t=1581169838",
    "Slug": "aetheria-online",
    "Meta Title": "Aetheria Online: Feb 1, 2019, Zachary Hodges and Full Ove...",
    "Meta Description": "Looking for information on Aetheria Online? Check out the release date (Feb 1, 2019), developer insights from Zachary Hodges, and a complete game summary.",
    "Alt Text Image": "Official header image for Aetheria Online game - Steam 1008000",
    "Canonical URL": "https://gusku.site/game/aetheria-online",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Aetheria Online\", \"description\": \"Looking for information on Aetheria Online? Check out the release date (Feb 1, 2019), developer insights from Zachary Hodges, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 1, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zachary Hodges\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zachary Hodges\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1008000/header.jpg?t=1581169838\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}