{
    "AppID": 1109350,
    "Name": "ANCIENT SOULS : The Governor",
    "Release date": "Jul 14, 2019",
    "About the game": "GAME STATUS DON'T BUY THIS GAME! UNLESS YOU WANT TO SUPPORT ME! This game is under heavy construction so be careful if you decide to buy it. There is limited game play exist and there are many bugs still can break the game play. You can play the latest version FREE by downloading the DEMO. If you like the game and you want to support me you can buy it. I will be very happy about it. Game is in playable condition but not finished yet. There are many implementations on the road but you can see the game's future after you play a two or there rounds. I tried to mix the Paradox Crusader Kings map play with X- Com battle mechanics with western theme. As a sole developer I tried to do my best and reached a certain acceptable status. I'm hoping to finish it in a 6 month. GAME MECHANICS Game has two different game modes. These are Turn Based Map Mode and Turn Based Battle Mode. Player starts with controlling the capital city of the state and player's main quest is making all liberated cities a part of the state as a Governor. In a year you need to finish this quest and return the state to the President. MAP MODE In this mode player can interact with the settlements of the state. Player can build structures in non liberated settlements and give jobs to local population. Buildings are the main source of the income and employees will defend your settlement if need be. Currently in map mode you can; - interact with settlements and improve your relations with them - use diplomatic and / or shady techniques to gain the settlement control - improve your and employee's skills by working and making events, - raid settlements, assassinations , rob or sabotage buildings, hunt bandits These actions change the player's reputation and this player's reputation changes game's respond to the player. Exp; Shady player gets more respect from shady settlements but if player is controlling lawful settlements, this settlements may riot against the player. You will be able to; - Resolve disputes between settlements - Create special items and build new settlements. - Hire bounty hunters - Use inventory system, You can change the weapons and armor of your employees. BATTLE MODE The game system is pretty similar to X-Com and Mutant Zero. There are small touches exist though, such as Manual Aim and instant skill effect with stamina system. You can move or attack as long as you have enough stamina. Also accuracy and dodge system is pretty different from the other similar games. Currently in this mode you can; - Move, Dodge, Attack, Manuel Attack, Get Cover against the enemy parties. - Fight against three types of AI ; Raider, Gunslinger, Sniper. You will be able to; - Use special items and different weapons - Play in many different maps",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1109350/header.jpg?t=1618680888",
    "Price": 7.99,
    "Developers": "OE WORKS",
    "Publishers": "OE WORKS",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1109350/ss_e335815118d16108c95671382cb905ec6d4937d8.1920x1080.jpg?t=1618680888,https://cdn.akamai.steamstatic.com/steam/apps/1109350/ss_4d56165073306701f955bf2b0b9fc80f7e3b3ab8.1920x1080.jpg?t=1618680888,https://cdn.akamai.steamstatic.com/steam/apps/1109350/ss_46fcb74e2d6cab74a3b85d3c865f4b38fa736a8f.1920x1080.jpg?t=1618680888,https://cdn.akamai.steamstatic.com/steam/apps/1109350/ss_93a32a32e3a62a0f99d3238af51e03125e6ab7b7.1920x1080.jpg?t=1618680888,https://cdn.akamai.steamstatic.com/steam/apps/1109350/ss_757bec5a5c9d2c5e96021d9a340bd9ff0407b2d1.1920x1080.jpg?t=1618680888,https://cdn.akamai.steamstatic.com/steam/apps/1109350/ss_437b80a238e85ac59978db36a6d727eec0f6e6b4.1920x1080.jpg?t=1618680888,https://cdn.akamai.steamstatic.com/steam/apps/1109350/ss_f1585dba24ec01c30d579cda22584c6054c32925.1920x1080.jpg?t=1618680888,https://cdn.akamai.steamstatic.com/steam/apps/1109350/ss_a7a405cef9cd77165264dea6305c8541f0d24823.1920x1080.jpg?t=1618680888,https://cdn.akamai.steamstatic.com/steam/apps/1109350/ss_7ab1f0404f1bdc9c530e10df7fc0da1b04d1e57e.1920x1080.jpg?t=1618680888",
    "Slug": "ancient-souls-the-governor",
    "Meta Title": "ANCIENT SOULS : The Governor: Jul 14, 2019, OE WORKS and ...",
    "Meta Description": "Looking for information on ANCIENT SOULS : The Governor? Check out the release date (Jul 14, 2019), developer insights from OE WORKS, and a complete gam...",
    "Alt Text Image": "Official header image for ANCIENT SOULS : The Governor game - Steam 1109350",
    "Canonical URL": "https://gusku.site/game/ancient-souls-the-governor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ANCIENT SOULS : The Governor\", \"description\": \"Looking for information on ANCIENT SOULS : The Governor? Check out the release date (Jul 14, 2019), developer insights from OE WORKS, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 14, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"OE WORKS\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OE WORKS\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1109350/header.jpg?t=1618680888\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}