{
    "AppID": 841600,
    "Name": "Aura of Worlds",
    "Release date": "Apr 24, 2018",
    "About the game": "Aura of worlds is a creative tactics rogue-lite platformer. Explore multiple worlds where you must utilise your creative abilities to twist adversity to your advantage. You'll need planning, wits and reflexes to make a way through these ever-changing death labyrinths. Escape flooding passages, outrun toxic pollen, face off against gargantuan bosses that have made entire mazes their home. Do you play defensively with the spear and energy shield, or swing into the fray with a boomerang and grapple hook? Do you scour the levels for potions and runes; or do you dive headfirst into the chaos? Adversity as your ally F.A.Q. Let's be transparent... 'What Gamepads are compatible?” Currently Xbox and Xbox 360 controllers though other Xinput controllers may work. NOTE: Not natively compatible with Playstation controllers yet. Keyboard and mouse works just as well. Is there much of a story in game? There's minimal story exposition as of the current build. We do plan on integrating a loose narrative as development progresses though... “I'm running the game on an old computer, how can I make it run faster?” Please see the following forum thread on optimization : “Where can I report bugs/issues/suggestions?” Please look to the forums, we check messages there each day. Feedback is welcome and there are some excellent community members who are willing to help to. 'Anything else to be aware of?' Default gamepad controls are slightly different from convention, due to optional 360 degree aiming with right analogue stick. Though buttons can be rebound to suit. It’s designed to be challenging, and death may be encountered frequently during your initial runs. Though there is no stunlocking/one-hit demises on the player. Being able to multi-task between abilities will greatly increase survivability. **The game has a steeper learning curve than the average platformer, particularly in the first 25 minutes Every challenge has multiple solutions For example, if there is a chest on the other side of a lava pit; do you...? Grapple across Bend time and bounce off enemies Use a boomerang to fetch the item Blow up the pit with a grenade; setting everything nearby alight! ... More Features Over 80 unique enemies and traps 12+ randomized level themes. Such include tidal corridors filled with mines, rising lava, caverns lined with toxic and carnivorous plants... 4+ Primary world types (grotto, gardens, temple, cold crust caverns) each with their own traps, enemies, boss and special theme layouts. A plethora of creative abilities ranging from parkour to cloaking to warping time itself! Every object has multiple uses E.g. you can grab that lantern from the ceiling, and carry it around to use as a portable light source or improvised flaming molotov... Hand crafted pixel art and animations Regular updates A unique musical score. Customize character skin and clothing colors. Permanent progression: allows you to unlock world shortcuts, new items, character backgrounds... So much more... Whilst functionally complete; the game is under active development and more content is being added. This project was Greenlit by the community back in 2016.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/841600/header.jpg?t=1654087893",
    "Price": 11.99,
    "Developers": "Cognitive Forge",
    "Publishers": "Cognitive Forge",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/841600/ss_429d5c753b8124a74549f2261efd328dc52c8b21.1920x1080.jpg?t=1654087893,https://cdn.akamai.steamstatic.com/steam/apps/841600/ss_b517e343bacc55106cd6366621d7acf8e550ccc1.1920x1080.jpg?t=1654087893,https://cdn.akamai.steamstatic.com/steam/apps/841600/ss_7e5b0c0b003f057343b9d50e543cd955efb34015.1920x1080.jpg?t=1654087893,https://cdn.akamai.steamstatic.com/steam/apps/841600/ss_651440a7bfc53ee574c5e1e3f4cb7a055bc18af8.1920x1080.jpg?t=1654087893,https://cdn.akamai.steamstatic.com/steam/apps/841600/ss_3fbab04de965f0f3e66df9ff2d8d409bbf6a9c4e.1920x1080.jpg?t=1654087893,https://cdn.akamai.steamstatic.com/steam/apps/841600/ss_815c4d18c91a76d19374d775625f33906d41de01.1920x1080.jpg?t=1654087893,https://cdn.akamai.steamstatic.com/steam/apps/841600/ss_97fd76c91cca68607bda1cc19b3b7421608ff50a.1920x1080.jpg?t=1654087893,https://cdn.akamai.steamstatic.com/steam/apps/841600/ss_296ee4b9e18a86566f6d364b8a8bb2d0f579dcd6.1920x1080.jpg?t=1654087893,https://cdn.akamai.steamstatic.com/steam/apps/841600/ss_c1f01fd52633dffde3e68bd7cb2afb11b739922c.1920x1080.jpg?t=1654087893,https://cdn.akamai.steamstatic.com/steam/apps/841600/ss_80aac3612537484f010729071d4c60a501104fde.1920x1080.jpg?t=1654087893,https://cdn.akamai.steamstatic.com/steam/apps/841600/ss_4c5aab96f5012432bd6c4e4c977ceefd88b584fa.1920x1080.jpg?t=1654087893,https://cdn.akamai.steamstatic.com/steam/apps/841600/ss_df736c11073a72334948ab85926d740d72ff1804.1920x1080.jpg?t=1654087893",
    "Slug": "aura-of-worlds",
    "Meta Title": "Aura of Worlds: Apr 24, 2018, Cognitive Forge and Full Ov...",
    "Meta Description": "Looking for information on Aura of Worlds? Check out the release date (Apr 24, 2018), developer insights from Cognitive Forge, and a complete game summary.",
    "Alt Text Image": "Official header image for Aura of Worlds game - Steam 841600",
    "Canonical URL": "https://gusku.site/game/aura-of-worlds",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Aura of Worlds\", \"description\": \"Looking for information on Aura of Worlds? Check out the release date (Apr 24, 2018), developer insights from Cognitive Forge, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 24, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cognitive Forge\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cognitive Forge\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/841600/header.jpg?t=1654087893\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}