{
    "AppID": 1647430,
    "Name": "Black Mansion",
    "Release date": "Jun 15, 2021",
    "About the game": "Get ready to solve the puzzles walking through a terrifying, mysterious mansion! Go on an adventure only through wall-to-floor jumps, with no complicated manipulations. Challenge the extremely difficulty of master, it’s addictive! - Just jump to move. You can go anywhere you want with jumping as many times as you want. - Be careful of enemies and obstacles. Leave the following enemies out and avoid dangerous obstacles. - Find the key and operate the device to explore the mansion. Solve the hidden puzzles in the mansion, Fight against the enemies, Then move to the next destination. - Every progress and data are saved automatically. - Challenge the extremely difficulty of master, it’s addictive! Synopsis One late night, David got a phone call. The call was cut off right after his brother Jonathan’s mysterious words. The last words he left were: The Rose Mansion, East 6th, 51st Street. David lost his memories on the way to the mansion to find Jonathan. When he gets back to his senses, something comes into his view… He opens the door to the room to find the truth… The shadow of death hidden in the mansion… Overcome fear and survive the death. What is waiting for you at the end of this adventure? Well-organized story and BGM will make you immerse yourself in playing. Clear every stage and unroll every story. What is the truth hidden in the mansion? Characters - David One late night, David got a phone call. The call was cut off right after his brother Jonathan’s mysterious words. The last words he left were: The Rose Mansion, East 6th, 51st Street. David lost his memories on the way to the mansion to find Jonathan. In confinement, he opens the door to the room to find the truth… When he gets back to his senses, something comes into his view… - Hanna Hanna woke up from a strange dream. In confinement, she lost her memories about everything… Who she was, where she was confined, etc. Although she tried to bring back her memories, she only got a headache, not her memories… Story Mode Different stories from different characters- David and Hanna About 100 different stages depending on the main character Challenge Mode You can play challenge mode from 2-5 stage clear You can challenge the various stages with different rooms Level that can be upgraded at each stage Collect A memo that tells the story Costume to change the character's look Artifacts required to acquire a costume Distinctive characters There are various stories of the various characters in one mansion. Experience how their stories end. Various kinds of traps A hasty judgment can only lead to death. Unexpected traps will make you not let go of the tension even for a second. Caution If you remove this app, all the data you have done so far will be removed as well.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1647430/header.jpg?t=1623740532",
    "Price": 6.99,
    "Developers": "PICTOLOGI",
    "Publishers": "PICTOLOGI",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1647430/ss_5e6c38d45518d5c76309e4826284c06998c6827f.1920x1080.jpg?t=1623740532,https://cdn.akamai.steamstatic.com/steam/apps/1647430/ss_3402013cc17b7e4e01b39f1bf3d9dcbde06151e3.1920x1080.jpg?t=1623740532,https://cdn.akamai.steamstatic.com/steam/apps/1647430/ss_753f616fc43fb972aae9eb7887d32e37b1611526.1920x1080.jpg?t=1623740532,https://cdn.akamai.steamstatic.com/steam/apps/1647430/ss_7098eabb880b8f11b52bfb89402660b1f6c233b1.1920x1080.jpg?t=1623740532,https://cdn.akamai.steamstatic.com/steam/apps/1647430/ss_2ba15d96ad9ce96d31b15e58b7604aa5e100ae30.1920x1080.jpg?t=1623740532,https://cdn.akamai.steamstatic.com/steam/apps/1647430/ss_41f8859f2bac362874a37552717e2b4695f3b401.1920x1080.jpg?t=1623740532,https://cdn.akamai.steamstatic.com/steam/apps/1647430/ss_71bab3fd2b444c7241e6e7402b43089ae9f90e79.1920x1080.jpg?t=1623740532,https://cdn.akamai.steamstatic.com/steam/apps/1647430/ss_5e794bcd40a4f0af33e4fac536e00f813427261f.1920x1080.jpg?t=1623740532,https://cdn.akamai.steamstatic.com/steam/apps/1647430/ss_a48720261fdc15760f01164676af60d849d973f5.1920x1080.jpg?t=1623740532",
    "Slug": "black-mansion",
    "Meta Title": "Black Mansion: Jun 15, 2021, PICTOLOGI and Full Overview",
    "Meta Description": "Looking for information on Black Mansion? Check out the release date (Jun 15, 2021), developer insights from PICTOLOGI, and a complete game summary.",
    "Alt Text Image": "Official header image for Black Mansion game - Steam 1647430",
    "Canonical URL": "https://gusku.site/game/black-mansion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Black Mansion\", \"description\": \"Looking for information on Black Mansion? Check out the release date (Jun 15, 2021), developer insights from PICTOLOGI, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"PICTOLOGI\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PICTOLOGI\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1647430/header.jpg?t=1623740532\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}