{
    "AppID": 1492290,
    "Name": "Boulders: Puzzle",
    "Release date": "Oct 2, 2021",
    "About the game": "Sometimes it is ok to think inside of the box, like when trying to solve the challenging puzzles of Boulders: Puzzle . Test your logic and spatial thinking while trying to move your cuboid to connect to the goal cube. Use the environment to control the length of the cuboid to be able to reach the goal cube. Features Multiple levels to test your skill. Play community made levels. [Optional] Measure different attributes and compare with your friends to see who the best is. Create your own levels with the free included level editor. How to play You control a cuboid with the goal of connecting to the goal cube, moving the cuboid by rotating it. There are multiple types of cubes that can aid you in your goal or hinders your progress. Player cuboid: Connect the player cuboid to the goal cube to beat the level. You move the cuboid by rotating it. Player cubes: Connect with these cubes to make the cuboid longer or break it apart to make it shorter so you can get past get different areas in the level. Ground cube: You can only move the player cuboid over ground cubes, you can also use them to disconnect the player cuboid making it shorter. Destructor cube: If a player cube in the player cuboid connects to the destructor cube it will be destroyed and break apart the cuboid at that point. Duplicator cube: If a player cube in the player cuboid connects to the duplicator cube it will be transformed into another duplicator cube break apart the cuboid at that point. Goal cube: If the player cuboid connects to the goal cube you beat the level. If you want to show off your skills to your friends, you can optionally measure three different attributes (turn them on in the settings). Moves: How many times have you moved the player cuboid before you connected to the goal cube. Steps: How many moves with each individual player cube in the cuboid have you moved before connected to the goal cube. If the player consists of three cubes and you make one move, that equals three steps. Time: How long time did it take before you reached the goal cube.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1492290/header.jpg?t=1641640245",
    "Price": 0.99,
    "Developers": "Farewell Games",
    "Publishers": "Farewell Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1492290/ss_f657a4794a3c6367e7f276e319039cdf7258542c.1920x1080.jpg?t=1641640245,https://cdn.akamai.steamstatic.com/steam/apps/1492290/ss_d1bab72ffae7d30088c3222591f5b8fcad338e0b.1920x1080.jpg?t=1641640245,https://cdn.akamai.steamstatic.com/steam/apps/1492290/ss_aabf75a7b8049c700fc294741c0dd673282e615e.1920x1080.jpg?t=1641640245,https://cdn.akamai.steamstatic.com/steam/apps/1492290/ss_9dc433cb42d6e6818b0c93684a8f9566052c0749.1920x1080.jpg?t=1641640245,https://cdn.akamai.steamstatic.com/steam/apps/1492290/ss_fdfde2f7b07385c95e35b4124a98605fc42715e9.1920x1080.jpg?t=1641640245,https://cdn.akamai.steamstatic.com/steam/apps/1492290/ss_bdc6288dbfc68dfe672cb95f82cc669cbde06ff5.1920x1080.jpg?t=1641640245",
    "Slug": "boulders-puzzle",
    "Meta Title": "Boulders: Puzzle: Oct 2, 2021, Farewell Games and Full Ov...",
    "Meta Description": "Looking for information on Boulders: Puzzle? Check out the release date (Oct 2, 2021), developer insights from Farewell Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Boulders: Puzzle game - Steam 1492290",
    "Canonical URL": "https://gusku.site/game/boulders-puzzle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Boulders: Puzzle\", \"description\": \"Looking for information on Boulders: Puzzle? Check out the release date (Oct 2, 2021), developer insights from Farewell Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Farewell Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Farewell Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1492290/header.jpg?t=1641640245\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}