{
    "AppID": 293520,
    "Name": "Carnivores: Dinosaur Hunter Reborn",
    "Release date": "May 27, 2015",
    "About the game": "Carnivores: Dinosaur Hunter Reborn is a first person hunting simulator where you hunt the largest and most dangerous creatures to ever exist – DINOSAURS. This game is a sequel of the original classic dinosaur hunting video game, Carnivores: Dinosaur Hunter. It’s an authentic hunting simulation where you track and stalk your prey. Careful and thoughtful consideration must be taken during the hunt; to survive you'll need to know your preys temperament and mannerisms, and just like in real hunting, you need to be aware of your surroundings (you don't want to be caught upwind of a T-Rex or you'll end being lunch). Remember you're not hunting deer, you're hunting dinosaurs. You’ll visit huge, beautifully rendered and realistic 3D environments, each with their own unique Eco systems. There are pristine beaches, dense jungles, pine forests, muddy marshes, rocky plains and deserts to explore. Environments can be used to increase the odds of a successful hunt. Players can follow trails and track animal footprints. Awareness of wind direction is important since some dinosaurs can smell you. Using stealth and land elevation will give you a sound advantage over some of the more vicious dinosaurs. Choose between a high caliber rifle, sniper rifle, a silent crossbow or tranquilizer gun, which puts your prey to sleep instead of killing it. You can also carry sidearms. Some of your equipment includes a handheld Gadget, which includes radar and GPS satellite positioning to make tracking the beasts easier, Cover Scent which masks your smell and numerous other goodies, which will prove indispensable for your hunting adventure. There is a wide variety of different dinosaurs to hunt each with unique behaviors and intelligence. Every dinosaur in Carnivores has realistic, advanced AI logic, so from species to species , each will react differently to you. Some dinosaurs will flee if they see you, while others will become enraged and attack. During your adventure you'll experience everything from 'pea-brained' dummies to cunning dinosaurs, with heightened senses of sight, hearing and smell. So be careful and stalk your prey intelligently, otherwise you might be the one being hunted. key Features: Hunt the largest and most ferocious animals known to man – the Dinosaurs! Huge 3D Free-Roaming Open worlds. Beautiful and realistic high definition graphics. A multitude of different Dinosaurs, from Herbivorous (plant eating) to the Carnivorous (meat Eating). Realistic AI – Dinosaurs react to sight, sound and smell, each with their own mannerisms and Behaviors. Explore and hunt in different Eco-systems including jungles, forests, beaches and rolling Hills. Equip camouflage and Cover Scent to even the odds. A variety of weapons and equipment to choose from (from Sniper Rifle to Cross-bow). Map and Radar to locate and track Dinosaurs. Use tranquilizer darts instead of bullets (experience the thrill of the hunt without the killing). Interactive Dinosaur Trophy Room.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/293520/header.jpg?t=1560952471",
    "Price": 14.99,
    "Developers": "Digital Dreams Entertainment LLC",
    "Publishers": "Digital Dreams Entertainment LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/293520/ss_0c80c6ab339a4bb115031ed8213c0c0409b5edae.1920x1080.jpg?t=1560952471,https://cdn.akamai.steamstatic.com/steam/apps/293520/ss_0a4681791b3284d02527b05d4e4c5ad895cf510f.1920x1080.jpg?t=1560952471,https://cdn.akamai.steamstatic.com/steam/apps/293520/ss_e43a164a98069f10373a0198b2f7bcc49d6a98e7.1920x1080.jpg?t=1560952471,https://cdn.akamai.steamstatic.com/steam/apps/293520/ss_baab42a88a84c0eb682ee0d5651a6f69703b29a8.1920x1080.jpg?t=1560952471,https://cdn.akamai.steamstatic.com/steam/apps/293520/ss_f72e5a06182eeed468be7521744c87f950c3ab9a.1920x1080.jpg?t=1560952471,https://cdn.akamai.steamstatic.com/steam/apps/293520/ss_f61bff23bb35f97ed2648e09286d441b4d2cfeab.1920x1080.jpg?t=1560952471,https://cdn.akamai.steamstatic.com/steam/apps/293520/ss_65ac71c032e073229e5fd976c4d7b6dd248e3186.1920x1080.jpg?t=1560952471",
    "Slug": "carnivores-dinosaur-hunter-reborn",
    "Meta Title": "Carnivores: Dinosaur Hunter Reborn: May 27, 2015, Digital...",
    "Meta Description": "Looking for information on Carnivores: Dinosaur Hunter Reborn? Check out the release date (May 27, 2015), developer insights from Digital Dreams Enterta...",
    "Alt Text Image": "Official header image for Carnivores: Dinosaur Hunter Reborn game - Steam 293520",
    "Canonical URL": "https://gusku.site/game/carnivores-dinosaur-hunter-reborn",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Carnivores: Dinosaur Hunter Reborn\", \"description\": \"Looking for information on Carnivores: Dinosaur Hunter Reborn? Check out the release date (May 27, 2015), developer insights from Digital Dreams Enterta...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 27, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Digital Dreams Entertainment LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Digital Dreams Entertainment LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/293520/header.jpg?t=1560952471\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}