{
    "AppID": 1141880,
    "Name": "Crazy Critters - Combat Cats",
    "Release date": "May 22, 2020",
    "About the game": "Cats are random, silly, energetic and straight up crazy! This we know! What better way to celebrate their unique greatness than by choosing one and gearing up to dominate and rule the feline world? Gameplay is fast and fluid and with some skill you could become the top feline feature in Crazy Critters Combat Cats! Claws out! Run, jump, scratch and fight to be the purrrfect combat cat! Each with its own unique skills and traits, making them varied and special to use in unique ways. From ultra fast speed to super high jumps to crazy strong melee and much more! Choose your favorite and dominate the battle! With some of the most random and silly maps out there this title packs a weird old punch! Maps are designed to offer awesome experiences with fast and compact combat being the center of attention here. The action never stops as long as you dont stop moving! Cats with lasers, there hasn't been a better combo since the Hoff and a tan! Choose from over 10 weapons to pulverize your way to victory with! All guns are unique and different in many awesome ways! These factors include rate of fire, bullet spread, damage, speed and many more deciders that come in to play when you choose a weapon! Apart from your main weapon you also have access to hamster grenades and melee scratches! Use them wisely as they may be the difference between victory or defeat! Is your gun too weak? We got you! Pick up a new, stronger weapon from any of the weapon pickups around the map! Can you go on a rampage with your chosen cat? There are bonuses to your score when you achieve multiple kills! Build up that kill-streak as you get them all one by one! There are health and ammo pickups strewn about the map too, make sure to grab those and buff your way to the top of the scoreboard! Aligned Games© was started by me, Johannes Christiaan Nienaber in 2013 as a video-game development studio. At that time I focused on the creation of smaller scale games, but have since moved into developing bigger and better games. I run the studio myself and as such all of its associated video-game are my sole creations. Please contact me through the Aligned Games website or Facebook page if you have any queries or questions.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1141880/header.jpg?t=1603273958",
    "Price": 3.99,
    "Developers": "Aligned Games",
    "Publishers": "Aligned Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1141880/ss_b12eb30ce953cd53ba81e19d01b58863d05a80e4.1920x1080.jpg?t=1603273958,https://cdn.akamai.steamstatic.com/steam/apps/1141880/ss_ecc5672c87967c7a5d76399f32dfa0e2ba11c35f.1920x1080.jpg?t=1603273958,https://cdn.akamai.steamstatic.com/steam/apps/1141880/ss_9b095b16d24421aac2b86753b7a77c5cd3209a7e.1920x1080.jpg?t=1603273958,https://cdn.akamai.steamstatic.com/steam/apps/1141880/ss_436db53e7124a28b36892d85fbe1588825369af9.1920x1080.jpg?t=1603273958,https://cdn.akamai.steamstatic.com/steam/apps/1141880/ss_22a98d553e146c06af587a0448b04a273c3680a4.1920x1080.jpg?t=1603273958,https://cdn.akamai.steamstatic.com/steam/apps/1141880/ss_ebaae11fa872e73e1a0cfe1b7dc3f07d37ed1d84.1920x1080.jpg?t=1603273958,https://cdn.akamai.steamstatic.com/steam/apps/1141880/ss_b687ea1de1ae333756153f0e9d5e167d5c71c257.1920x1080.jpg?t=1603273958",
    "Slug": "crazy-critters-combat-cats",
    "Meta Title": "Crazy Critters - Combat Cats: May 22, 2020, Aligned Games...",
    "Meta Description": "Looking for information on Crazy Critters - Combat Cats? Check out the release date (May 22, 2020), developer insights from Aligned Games, and a complet...",
    "Alt Text Image": "Official header image for Crazy Critters - Combat Cats game - Steam 1141880",
    "Canonical URL": "https://gusku.site/game/crazy-critters-combat-cats",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crazy Critters - Combat Cats\", \"description\": \"Looking for information on Crazy Critters - Combat Cats? Check out the release date (May 22, 2020), developer insights from Aligned Games, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 22, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aligned Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aligned Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1141880/header.jpg?t=1603273958\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}