{
    "AppID": 1895130,
    "Name": "Darza's Dominion",
    "Release date": "Apr 21, 2022",
    "About the game": "The Dominion takes no prisoners! Fight for your survival in the unforgiving terrains that surround you, strengthen your hero through slaying the dangerous creatures, gather a group of allies to multiply your strength, and bring the battle to Darza! As a cooperative bullet-hell MMORPG, Darza’s Dominion is a fast-paced game centered around being ready to dodge as many projectiles that can fit on the screen at once; the harder the difficulty, the more insane everything gets. You’re going to have to hope your reaction time is up to the test! Taking back the Dominion is all about teamwork. Thankfully for you, all of your closest (and farthest!) friends can help you out! Group up in the Tavern, form a Guild, or just find them in the Dominion and take on the toughest challenges the game has to offer. FAST-PACED GAMEPLAY Face off against foes in a 2D orthographic roguelike featuring permadeath mechanics in a speedy bullet hell environment. UNIQUE CHARACTER CLASSES Discover the full power of seven class abilities by looting special gear capable of leveling the playing field. RANDOMLY GENERATED UNIQUE DUNGEONS Challenge the dungeon bosses of the Dominion in their own individually created stages and make it out alive. INTENSE BOSS FIGHTS Engage in battles against an expanding roster of bosses boasting different phases and collect loot along the way to upgrade your characters. MULTIPLAYER ONLINE BULLET-HELL Utilize your character classes and work together against Darza and his minions by fighting alongside dozens of players at any time against the perils that await you in the Dominion. VIBRANT PLAYER-BASED ECONOMY Sell and buy your way up to the top by bartering with other players in an economic environment controlled by players just like you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1895130/header.jpg?t=1654034633",
    "Price": 0.0,
    "Developers": "Ripple Studio",
    "Publishers": "Ripple Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1895130/ss_37efde3347f1301b7cdf6c99d0311ba7f36b3c4e.1920x1080.jpg?t=1654034633,https://cdn.akamai.steamstatic.com/steam/apps/1895130/ss_5698df667baceb5d7c3b6918160ce4bfed924e75.1920x1080.jpg?t=1654034633,https://cdn.akamai.steamstatic.com/steam/apps/1895130/ss_e3696729947f512ea92cb196c82899ba0b3941f8.1920x1080.jpg?t=1654034633,https://cdn.akamai.steamstatic.com/steam/apps/1895130/ss_bd9acde0d182b2dd0bbc224b60cb26b420982593.1920x1080.jpg?t=1654034633",
    "Slug": "darza-s-dominion",
    "Meta Title": "Darza's Dominion: Apr 21, 2022, Ripple Studio and Full Ov...",
    "Meta Description": "Looking for information on Darza's Dominion? Check out the release date (Apr 21, 2022), developer insights from Ripple Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Darza's Dominion game - Steam 1895130",
    "Canonical URL": "https://gusku.site/game/darza-s-dominion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Darza's Dominion\", \"description\": \"Looking for information on Darza's Dominion? Check out the release date (Apr 21, 2022), developer insights from Ripple Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ripple Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ripple Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1895130/header.jpg?t=1654034633\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}