{
    "AppID": 898910,
    "Name": "DASH: Danger Action Speed Heroes",
    "Release date": "Jun 6, 2019",
    "About the game": "PLEASE READ!! Unfortunately the dev team went bankrupt and were unable to finish the game. Explaining while the server is not maintained. It hurts our hearts because we know how much fun we could've had, had the game been finished. Don't buy the game - because the server is currently not running (Duka - 02-17-2021). Sorry guys... we had so much fun though... Welcome to the simple and ever changing world of creative tools, tiles and challenges. DASH: Danger Action Speed Heroes is a 2D platformer which serves one goal: to make players create levels and clear them as fast as possible. There is no story. Just the right tools to create it! The players create the levels, playlists and worlds for others to explore. The leaderboard will indicate which runners and creators are the best, the smartest and fastest among all. With a monthly update cycle, the game will expand as new game modes, heroes and tilesets will be integrated. The DASHers have already created well over 250 levels ( ) Dash, double-jump, triple-dash, bullet-jump and wall slide your way to victory in a world of colorful pixel art! Create levels easily Get your levels rated Enhance your speedrun skills A roster of Heroes with individual strengths and weaknesses Unique power-up system with combos of extra power Fool the enemies. Make them work for you or use their bouncy bodies to reach new heights! Original sound track by various contemporary artists Handmade pixel graphics by Baby Duka Connect with runners and creators on our growing Discord server Create your own levels with speed streaks, enemies, spikes, puzzles and action-packed precision Explore the tilesets and backgrounds to create the environment for your story Lean back with the gamepad or keyboard and unveil your level design skills Upload your levels for the world to experience Watch your arenas become part of the constant competition to find the fastest runners. Set the format: make horizontal or vertical levels No upload limit: upload as many creations as you want On DASH Planet there is an ongoing hunt for shiny and colorful diamonds. How fast you are able to run through a level determines your status as a runner. How many plays your levels get proves your worth as a creator. The fastest and smartest will be rewarded. Everything from the easiest of levels to something you almost can't imagine being possible Worldwide leaderboards in-game: World records, levels completed and creator with most plays Create your own playlists of levels and share them with other players Data displayed to keep you up to date with your achievements and stats Dynamic playlists of levels to engage you in new levels daily",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/898910/header.jpg?t=1613645629",
    "Price": 9.99,
    "Developers": "Baby Duka,Schubell IT",
    "Publishers": "Baby Duka",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/898910/ss_157857d34e1628cd634f1c151f87213727af8d0c.1920x1080.jpg?t=1613645629,https://cdn.akamai.steamstatic.com/steam/apps/898910/ss_7228edd31a2ee756129e93140cc7a6bc06137138.1920x1080.jpg?t=1613645629,https://cdn.akamai.steamstatic.com/steam/apps/898910/ss_0c35a4d469a337f6090967b7330d72b5346762f0.1920x1080.jpg?t=1613645629,https://cdn.akamai.steamstatic.com/steam/apps/898910/ss_eb8e353b716d81c26ee12bbb22a9ae14ae6410c5.1920x1080.jpg?t=1613645629,https://cdn.akamai.steamstatic.com/steam/apps/898910/ss_65d23597635f39634271ffb9f28599ba41232e4d.1920x1080.jpg?t=1613645629,https://cdn.akamai.steamstatic.com/steam/apps/898910/ss_6acd37cc55489d64e10157ac15a44cbb70530aaf.1920x1080.jpg?t=1613645629,https://cdn.akamai.steamstatic.com/steam/apps/898910/ss_d593167bca3887f0b439c5fbbff14f80756d63bd.1920x1080.jpg?t=1613645629,https://cdn.akamai.steamstatic.com/steam/apps/898910/ss_c7cad124c98a45d84366eb34330bcad150f150c1.1920x1080.jpg?t=1613645629,https://cdn.akamai.steamstatic.com/steam/apps/898910/ss_cda580770f434053b4ede1afd84a215d8f015882.1920x1080.jpg?t=1613645629",
    "Slug": "dash-danger-action-speed-heroes",
    "Meta Title": "DASH: Danger Action Speed Heroes: Jun 6, 2019, Baby Duka,...",
    "Meta Description": "Looking for information on DASH: Danger Action Speed Heroes? Check out the release date (Jun 6, 2019), developer insights from Baby Duka,Schubell IT, an...",
    "Alt Text Image": "Official header image for DASH: Danger Action Speed Heroes game - Steam 898910",
    "Canonical URL": "https://gusku.site/game/dash-danger-action-speed-heroes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DASH: Danger Action Speed Heroes\", \"description\": \"Looking for information on DASH: Danger Action Speed Heroes? Check out the release date (Jun 6, 2019), developer insights from Baby Duka,Schubell IT, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 6, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Baby Duka,Schubell IT\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Baby Duka\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/898910/header.jpg?t=1613645629\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}