{
    "AppID": 223750,
    "Name": "DCS World Steam Edition",
    "Release date": "Aug 2, 2013",
    "About the game": "Feel the excitement of flying the Su-25T 'Frogfoot' attack jet and the TF-51D 'Mustang' in the free-to-play Digital Combat Simulator World! Two free maps are also included: The eastern Black Sea and the Mariana Islands. Digital Combat Simulator World (DCS World) 2.7 is a free-to-play digital battlefield game and simulation environment. Our dream is to offer the most authentic and realistic simulation of military aircraft, tanks, ground vehicles and ships possible. This free download includes a vast mission area of the Caucasus region and Black Sea that encompasses much of Georgia. It also includes a flyable Russian Sukhoi Su-25T ground attack aircraft and the famous WWII North American TF-51D fighter. An additional 38 aircraft are available for purchase. The download comes with one of the most powerful mission editor ever designed, full network play and more than 156 AI weapons systems, 105 ground vehicles and trains, 50 air defense systems, 19 ships and 84 AI aircraft permitting you to plan and play highly sophisticated missions. DCS World is massively extensible through additional DCS modules as well as user-made add-ons and mods which you can purchase and download from our site. DCS is a true 'sandbox' simulation that is also designed to cover multiple time periods of interest such as WWII, Korean War, Vietnam, Gulf War and others. Current regions to battle include the Back Sea, Marianas, Nevada Test and Training Range, Persian Gulf, English Channel, Syria, and Normandy 1944. DCS World is fundamentally a deep, authentic and realistic simulation designed also to offer a more relaxed gameplay to suit the user and his particular level of experience and training. The ambition is to hand hold users from novice pilot all the way to the most advanced and sophisticated operator of such complex weapons systems as the A-10C Warthog, the F/A-18C Hornet, F-16C Viper, and F-14 Tomcat. The only next step is the real thing! Key features of DCS World 2.7: The most realistic Free-to-Play digital battlefield ever. One-of-a-kind, internally developed graphics engine that looks amazing from 0 to 80,000 feet. Includes a beautiful, free, and highly detailed map of the Black Sea region that includes south western Russia and Georgia and the Mariana Islands. Includes millions of buildings, millions of km of usable roads and railways, more than 50 million trees, and 20 fully-equipped operational airbases. Includes 156 free and fully operational weapons systems, 105 ground vehicles, 19 ships and 84 AI-controlled aircraft. Fly the TF-51 Mustang and Su-25T attack jet for free! Play all DCS World modules from one DCS World version. State-of-the-art graphics with amazing lighting, shadows, and performance. New breathtaking effects for explosions, clouds, fog, fire, and smoke. Hundreds of land, air and seaborne AI vehicles. The world is your sandbox. Create your own missions and campaigns for unlimited gameplay! Mission generator included allowing rapid mission creation. Enjoy multiplayer with friends, and even fly together in the same aircraft for multi-crew missions! Purchase and fly the most iconic airplanes and helicopters from WWII up to the modern day. Mouse interactive 6 degrees of freedom cockpits for most aircraft and the most accurate flight models, cockpit systems, sensors, targeting systems and sounds available. Purchase and fly the most authentic simulations of the A-10C Warthog, F-16C Viper, F/A-18C Hornet, F-14 Tomcat, UH-1H Huey, F-86F Sabre, Spitfire, and many others now. Purchase additional high-quality maps such as Normandy 1944, the Nevada Test and Training Range, Syria, the English Channel, and the Persian Gulf. Play hundreds of missions and campaigns with new campaigns continually created. Both hardcore realistic and casual gameplay modes and options available.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/223750/header.jpg?t=1658421899",
    "Price": 0.0,
    "Developers": "Eagle Dynamics SA",
    "Publishers": NaN,
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/223750/ss_d2d9452037ba13c7d4be9ebc5c809441ebdabf0c.1920x1080.jpg?t=1658421899,https://cdn.akamai.steamstatic.com/steam/apps/223750/ss_26552def1fc86696449dd61ddc73b0dd18f3dda4.1920x1080.jpg?t=1658421899,https://cdn.akamai.steamstatic.com/steam/apps/223750/ss_22fc0f3a0555dcdfd6112dcb41b994fb785d9aa5.1920x1080.jpg?t=1658421899,https://cdn.akamai.steamstatic.com/steam/apps/223750/ss_c02843332ec737003ea163c07ddfd07fbf7528a2.1920x1080.jpg?t=1658421899,https://cdn.akamai.steamstatic.com/steam/apps/223750/ss_0981f012ceb9f7b36cf698a951435b4baf1df0db.1920x1080.jpg?t=1658421899,https://cdn.akamai.steamstatic.com/steam/apps/223750/ss_6397ac0cfae607db49566396b85af87796f85d71.1920x1080.jpg?t=1658421899,https://cdn.akamai.steamstatic.com/steam/apps/223750/ss_8d98adbb11e892af82c333df932d4a16bbeb2a3f.1920x1080.jpg?t=1658421899",
    "Slug": "dcs-world-steam-edition",
    "Meta Title": "DCS World Steam Edition: Aug 2, 2013, Eagle Dynamics SA a...",
    "Meta Description": "Looking for information on DCS World Steam Edition? Check out the release date (Aug 2, 2013), developer insights from Eagle Dynamics SA, and a complete ...",
    "Alt Text Image": "Official header image for DCS World Steam Edition game - Steam 223750",
    "Canonical URL": "https://gusku.site/game/dcs-world-steam-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DCS World Steam Edition\", \"description\": \"Looking for information on DCS World Steam Edition? Check out the release date (Aug 2, 2013), developer insights from Eagle Dynamics SA, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 2, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eagle Dynamics SA\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": NaN}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/223750/header.jpg?t=1658421899\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}