{
    "AppID": 1275970,
    "Name": "Digital Dungeon Tiles",
    "Release date": "Apr 13, 2020",
    "About the game": "What is Digital Dungeon Tiles? A tool to quickly build Battle Maps (Interior &amp; Exterior) for Screen in Table, Print, or Digital Play. As a bonus feature you can play right inside the software using our hero and monster tokens. Play as if your Miniatures are in the map. In four quick steps you are ready to Battle: Choose a tile size Place Some Tiles Add Some Decoration Push Play! How Can You Use It? Screen in Table Play (As shown below) Projector on Table Play Print and Play (Orthographic Print Exports for you to print yourself or have printed professionally. [Vista Print sizes included]) Play in Digital Dungeon Tiles with our token system. (With New Token Stats System) What Are Some Features? Screen and Print-based Map Sizes are available and customizable. (Screenshot Below) Choose the size of your Screen in Table or Print Page. Build Battle Maps Export for Print Play right in Digital Dungeon Tiles Hero and Monster Tokens Time of Day Lighting Weather System Animated Effects Save and Load Maps (Including Token Locations) Mix Token and Miniatures based play to have Fog of War when using real Miniatures. NEW Token Stats System Note: This is a map making software first and foremost, the extra playing features included and being added are bonus content. Update v1.5- Token Stats System Token Stats is a visual stats system available on each token while in play mode. Stats can be hidden and shown as needed, on each token. This gives players access to quickly tracking HP and other important stats, to make playing easier. This works great with the token system and works with real miniatures by sitting tokens beneath them on the map. Token Name Current Hit Points Maximum Hit Points Actions Status Effects Facing Direction Token Ownership Update v1.7 - Dicey Dice (Filled Request) A simple Dice Roller allowing multiple dice to be rolled at the same time with each individual result being displayed. The dice display area can be cleared and closed to free-up screen space as needed. The dice roll from the view of the selected token, making dice results easy to read. Update v1.8 - Initiative System We've added an Initiative System to help track turns.. because even when playing with 3D printed miniatures, paper character sheets and real dice.. no one likes to track initiative! So let us track initiative for you! Give your tokens a unique name Click the 'add to Initiative' button Play! The tokens can mark their turn as done, delay until the end of the turn, be added and removed at any time. Clicking an image in the initiative bar pings the token on the map! (Tokens are also auto pinged at the start of their turns). And, you can also clear initiative and start fresh when ever you need. Extra Information Works with Hero Mini Maker *Not Required Works best with Miniatures created and printed from within Hero Mini Maker (shown in screenshots). /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1275970/header.jpg?t=1588468093",
    "Price": 29.99,
    "Developers": "HMM",
    "Publishers": "Dragom",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1275970/ss_7fed34481db657631fbf2c662cc20496a54e44dd.1920x1080.jpg?t=1588468093,https://cdn.akamai.steamstatic.com/steam/apps/1275970/ss_4f02bcb8f36555c6ff5a4d90d22d2a5ed0e5093a.1920x1080.jpg?t=1588468093,https://cdn.akamai.steamstatic.com/steam/apps/1275970/ss_6c51b08758ac68c1e652fa8e922f6583fc586f5c.1920x1080.jpg?t=1588468093,https://cdn.akamai.steamstatic.com/steam/apps/1275970/ss_d663390437b0bfccbcd5cdf1c9068a2811f4f963.1920x1080.jpg?t=1588468093,https://cdn.akamai.steamstatic.com/steam/apps/1275970/ss_1aebff4b7d81b84142ef840bac15e0aedf407168.1920x1080.jpg?t=1588468093,https://cdn.akamai.steamstatic.com/steam/apps/1275970/ss_4b146e9607cfc0374005cc1cbcf18b9f16d5458a.1920x1080.jpg?t=1588468093,https://cdn.akamai.steamstatic.com/steam/apps/1275970/ss_2de1d93747e0b0ffbc949aece2457ed2bcb5bc97.1920x1080.jpg?t=1588468093,https://cdn.akamai.steamstatic.com/steam/apps/1275970/ss_bb0628b220a69d9037e97c35d49643d3114cfd3c.1920x1080.jpg?t=1588468093,https://cdn.akamai.steamstatic.com/steam/apps/1275970/ss_4149d057cf10f7a3f087a4262c833c1fca8c3a84.1920x1080.jpg?t=1588468093,https://cdn.akamai.steamstatic.com/steam/apps/1275970/ss_adf00971c4fb9d1074f308220894149bfa107d62.1920x1080.jpg?t=1588468093,https://cdn.akamai.steamstatic.com/steam/apps/1275970/ss_d263053c6a33ffe05236ecb7374802d1c24ecee7.1920x1080.jpg?t=1588468093,https://cdn.akamai.steamstatic.com/steam/apps/1275970/ss_addd2834638fbf35c8fbc4f28558a2d030e56053.1920x1080.jpg?t=1588468093",
    "Slug": "digital-dungeon-tiles",
    "Meta Title": "Digital Dungeon Tiles: Apr 13, 2020, HMM and Full Overview",
    "Meta Description": "Looking for information on Digital Dungeon Tiles? Check out the release date (Apr 13, 2020), developer insights from HMM, and a complete game summary.",
    "Alt Text Image": "Official header image for Digital Dungeon Tiles game - Steam 1275970",
    "Canonical URL": "https://gusku.site/game/digital-dungeon-tiles",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Digital Dungeon Tiles\", \"description\": \"Looking for information on Digital Dungeon Tiles? Check out the release date (Apr 13, 2020), developer insights from HMM, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 13, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"HMM\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dragom\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1275970/header.jpg?t=1588468093\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}