{
    "AppID": 974930,
    "Name": "Eternal Realm II: Dark Matter",
    "Release date": "Nov 21, 2018",
    "About the game": "The Eternal Realm was created a millenium ago by the king Zerberus. It is a world filled with Dark Matter, a substance that grants immortality and the ability to create virtual worlds. However, living in such a dark world can make one insane. The king and his creations have lived in this peaceful yet, disturbing world for ages but, those times are about to come to an end. The 'Realm Breaker' is about to shatter everyone's perspective of what 'reality' really is. Archimedes, a member of the 'Royal Seed' has embarked on creating a new world with characters using life-like A.I. The player characters he created are now the rulers of this world, but, in name only. Almost as soon as Archimedes gives them the kingdom, a strange abyss phenomena starts appearing all over the land. The ten heroes set out to save their world against this new threat. Meanwhile, in the Eternal Realm, Archimedes' project is sabotaged and now he and his friends are branded as traitors. Who is this unknown enemy lurking in the shadows? Why is he framing Archimedes? This game is part II of the 'Royal War Saga'. Part I of the game was a satire of the jrpg genre. Playing this game is helpful but not necessary to understand the story. Eternal Realm II takes on a more serious tone and develops the characters and story a great deal more. Important Characters: Warrior : Arrogant and self-proclaimed king of the realm Berserker : Stupid, naive, and friendly. Good at killing things with his ax. Sentine l: Always calm. Never says anything. Defender : Chivalrous and valiant. He always talks in capital letters. Hunter : Usually normal but, has multiple personalities Rogue : Lazy and sneaky. Just likes to chill. Ice Mage : Cowardly and shy. Flame Mage : Lunatic. Randomly says morbid things and like to burn things with his flames. Thunder Mage : Typical air-headed girl. Earth Mage : Scholarly individual that likes to use big words. Most find him boring. Archimedes : Creator of the guild; he has been branded a traitor by the king because of the 'Realm Breaker' incident. Balthasar, Chronos, Dinah : Archimedes' friends that assisted him in activating Realm Breaker. Eldrick, Nara, Merlock : Members of the Royal Seed sent out to capture Archimedes. Yarin : The eldest of the Royal Seed. He has lived for over 900 years. King Zerberus : King and creator of the Eternal Realm. He has ruled over this world for over 1000 years. Features: 2 difficulty modes (Normal and Easy) Free-Turn Stamina Battle System (mixture of SMT Nocturne and Chrono Cross) 10 playable characters Over 90 different enemy types Several optional mini-bosses Non-random encounters Full recovery after every battle Save anywhere 2 different endings The Free-turn Stamina battle system allows you to take 4 actions per turn. The actions can be divided up between the characters as you see fit as long as they have the stamina to carry out the action. Characters recover 30-40% of their stamina per turn and the 'Rest' command allows an extra 40% to be recovered. It's the same battle system from Eternal Realm but, now with more options, diversity of abilities, and a more balanced difficulty level. Now you can switch characters out during battles and change accessories to fit the situation. If you like a good rpg that actually makes you think during battles and isn't just 'mash x to continue' then this game is for you. Game controls: Z: Confirm / talk / open treasure chest X: Cancel / open menu Q and W: Scroll through character menus Left and right arrow keys (during battle): Switch characters Alt + Enter: Change to Full-screen Here is a link to the first Eternal Realm game for those interested: /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/974930/header.jpg?t=1542860934",
    "Price": 3.99,
    "Developers": "Omega Games",
    "Publishers": "Omega Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_5d2849dbfacfadbc4e0bd6b41e7dd72d3c1fd146.1920x1080.jpg?t=1542860934,https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_7d8af0f0ee122a25509235bb5c408c5324a556dc.1920x1080.jpg?t=1542860934,https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_133b7e5c33847c2e78d519c85351c075d1912a7a.1920x1080.jpg?t=1542860934,https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_1467735a73fdc2778c88b6761079f0bc0efb8239.1920x1080.jpg?t=1542860934,https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_1a81c52905cee7d7d05f27db5cc6824a77b89af2.1920x1080.jpg?t=1542860934,https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_9d4b314822c03c5a3cb9b977a505aa78f5ea4fbf.1920x1080.jpg?t=1542860934,https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_8799403eddb967cc88b82bf3dc43908731b326d5.1920x1080.jpg?t=1542860934,https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_4b11757a26fdeb24c7f44459e4a8c20d3b541818.1920x1080.jpg?t=1542860934,https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_9ebbe7e9aa5b3bc73485a7c0718f79a9ee52359a.1920x1080.jpg?t=1542860934,https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_c867c7517285de5354c7831029d9eeb6b5c380aa.1920x1080.jpg?t=1542860934,https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_d2a60cb8c42b015b5421ae14589bff8187bdf93f.1920x1080.jpg?t=1542860934,https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_ca9ed6b9d1218e52533667787b39493721857bf2.1920x1080.jpg?t=1542860934,https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_a762262a725c708e813de089dc86c64993fa829f.1920x1080.jpg?t=1542860934,https://cdn.akamai.steamstatic.com/steam/apps/974930/ss_5d2b278db8be1d8372a68a0f370f9dee0741d713.1920x1080.jpg?t=1542860934",
    "Slug": "eternal-realm-ii-dark-matter",
    "Meta Title": "Eternal Realm II: Dark Matter: Nov 21, 2018, Omega Games ...",
    "Meta Description": "Looking for information on Eternal Realm II: Dark Matter? Check out the release date (Nov 21, 2018), developer insights from Omega Games, and a complete...",
    "Alt Text Image": "Official header image for Eternal Realm II: Dark Matter game - Steam 974930",
    "Canonical URL": "https://gusku.site/game/eternal-realm-ii-dark-matter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Eternal Realm II: Dark Matter\", \"description\": \"Looking for information on Eternal Realm II: Dark Matter? Check out the release date (Nov 21, 2018), developer insights from Omega Games, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 21, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Omega Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Omega Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/974930/header.jpg?t=1542860934\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}