{
    "AppID": 668290,
    "Name": "From Orbit",
    "Release date": "Aug 27, 2019",
    "About the game": "In From Orbit you'll manage the crew of a small spaceship. Stranded deep in uncharted space, they need to make their way home. Journey from planet to planet, each procedurally generated with unique environments, challenges, and alien creatures. Explore Scout out the richest resources and the deadliest critters, and discover unique challenges and powerful artifacts. Extract You're going to need all the Ore and Crystal you can carry if you're going to mount a successful defense or purchase the upgrades you'll need to make it home alive. Excape Err... Escape. The resources on each planet won't last forever, but the alien creatures willing to bite your legs off never seem to end, eventually overwhelming even the most stalwart crew. Hold out as long as you can... but don't throw your resources - or the lives of your crew - away to a lost cause. Always be prepared to make a timely exit when things start getting hairy. Key Features Permadeath - If your crew does get eaten by aliens, or your ship is destroyed, that's game over. Procedurally generated - Each play through presents you with a uniquely generated region of space full of new planets, each with different benefits and risks. Pick up and play - Sure there are hordes of creatures out to get you, but From Orbit is still accessible to a broad range of players, even if you don't have much experience with RTS games, or find the complexity of mainstream RTS's off-putting. Set your own pace: rush headlong into danger, or set up your defenses and fortify your position. Planetary Environments - Arid deserts, frigid ice worlds, or lush forests... each with unique challenges and obstacles, and each complete with their own set of hostile critters. From Desert Beetles to Ice Worms, every type of creature you encounter has its own strengths and weaknesses that you'll need to adapt to in order to survive. Equipped with a powerful Omnisuit , any crew member can switch roles at a moment's notice ensuring you've always got the right tools for the job. Harvester The reason we're out here on the space frontier in the first place... resources! Expedient resource collection is the foundation of survival, required to construct defenses and purchase upgrades. Defender Stand on the front line, keeping your crewmates safe with your force shield and blaster. Clear the path to resources so your Harvesters can go to work. Engineer Construct automated harvesters, turrets, and other mechanical devices. Repair your constructions... or your ship. Nobody's going home if your way off the planet is destroyed. Medic Always treat your medic with respect, and they'll patch you back up after you fight a yeti, or if you've spent a little too much time running around a planet with a toxic atmosphere.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/668290/header.jpg?t=1605953121",
    "Price": 9.99,
    "Developers": "Tentacle Head Games",
    "Publishers": "Tentacle Head Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/668290/ss_1773acda6dd936a8418d3cb1d1b151778c6abdb9.1920x1080.jpg?t=1605953121,https://cdn.akamai.steamstatic.com/steam/apps/668290/ss_5f2e673c082e108954679ea001b40508b72a2a82.1920x1080.jpg?t=1605953121,https://cdn.akamai.steamstatic.com/steam/apps/668290/ss_ef01addfea677060bfcd92d22aec7e79921e7034.1920x1080.jpg?t=1605953121,https://cdn.akamai.steamstatic.com/steam/apps/668290/ss_810b5c285f7fd2af6f50dbf2fa5eb1629347d37b.1920x1080.jpg?t=1605953121,https://cdn.akamai.steamstatic.com/steam/apps/668290/ss_ea02bc65d914dff390a2f4d41e9d0e784d55f505.1920x1080.jpg?t=1605953121,https://cdn.akamai.steamstatic.com/steam/apps/668290/ss_909ed64e03068a318ef142d05a1955f676bfb6c3.1920x1080.jpg?t=1605953121,https://cdn.akamai.steamstatic.com/steam/apps/668290/ss_8571e45901faafdc2912365e1bd8cb983da3f56b.1920x1080.jpg?t=1605953121",
    "Slug": "from-orbit",
    "Meta Title": "From Orbit: Aug 27, 2019, Tentacle Head Games and Full Ov...",
    "Meta Description": "Looking for information on From Orbit? Check out the release date (Aug 27, 2019), developer insights from Tentacle Head Games, and a complete game summary.",
    "Alt Text Image": "Official header image for From Orbit game - Steam 668290",
    "Canonical URL": "https://gusku.site/game/from-orbit",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"From Orbit\", \"description\": \"Looking for information on From Orbit? Check out the release date (Aug 27, 2019), developer insights from Tentacle Head Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 27, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tentacle Head Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tentacle Head Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/668290/header.jpg?t=1605953121\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}