{
    "AppID": 1386330,
    "Name": "Funanigans: Party Games",
    "Release date": "Sep 27, 2020",
    "About the game": "Funanigans includes 8 different multiplayer party games! Launch the game, create a room, share the screen, and anyone can join and play from a phone, tablet, computer - anything with a web browser that supports WebAssembly! Your device with a browser is your controller: Draw! Switch colors and line thickness. Undo, redo, and clear. In some games, someone else will also be drawing on the same canvas! In some games, you have limited ink for drawing or can only draw a limited number of lines. View information that other players can't see. Enter text or numbers, make choices from dropdowns, or check boxes. Fast reload button - if your screen seems out of date, refreshes faster than the browser reload button. Automatically rejoins if you refresh the page - no need to re-enter the room code or your name! Autosave! Each time you draw a line or modify an input, your response is saved. If you need to refresh the page or time runs out, your saved inputs are retained! All the games include customizable options, such as how many rounds to play and how much time players get to provide input! In Phonanigans (4+ players) , alternate between writing text and making drawings - like Telephone with pictures. Try to figure out which initial text led to which pictures, and then watch the sequences play out! In FictionaLies (2+ players) , try to fill in the blanks of classic literature! You'll see a random excerpt (with 1-3 words blanked out) from one of 53 public domain books. In funny mode, fill the blank(s) in the funniest way you can think of, then vote for the funniest response! In correct mode, fill in something that could fill the blank(s), and get points if you can figure out the right answer or if others think your answer is the real one! Two players try to draw different prompts on the same canvas in Drawkward (3+ players) , and others vote on which prompt fits the drawing better! In It's a Trap! (3+ players on 1-2 teams) , work with your teammates to get through a trap-filled maze when you each have limited information! Each player gets a chance to be a saboteur in SaboDrawage (3+ players) , where you draw on other players' canvases in an attempt to muck with their intentions! In CoDrawperate (4+ players on 2 teams) , work with your teammates to draw one of 9 related prompts while each of you can draw only a limited number of lines! Everyone picks a secret target number and plays add, subtract, and multiply cards to try to reach it in Tallynanigans (2+ players) ! The nuns are at it again in Shenunigans (2-4 teams of 2+ players each) , where one Abbess from each team tries to help teammates identify words by giving clues with either words or drawings!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1386330/header.jpg?t=1601269693",
    "Price": 9.99,
    "Developers": "Eric Peterson",
    "Publishers": "Eric Peterson",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1386330/ss_824236bfc2421863b93a6fffd170a10ada91a2f3.1920x1080.jpg?t=1601269693,https://cdn.akamai.steamstatic.com/steam/apps/1386330/ss_10b741a8670f4a3db0a9d95ace565aa254008e3c.1920x1080.jpg?t=1601269693,https://cdn.akamai.steamstatic.com/steam/apps/1386330/ss_324459951d6169d5ad039f736ce88d855795b48d.1920x1080.jpg?t=1601269693,https://cdn.akamai.steamstatic.com/steam/apps/1386330/ss_3f9ee38250fc184af731c09884279420dccf327f.1920x1080.jpg?t=1601269693,https://cdn.akamai.steamstatic.com/steam/apps/1386330/ss_527f94825fc44f8de7ebb32f78319e238d659dc8.1920x1080.jpg?t=1601269693,https://cdn.akamai.steamstatic.com/steam/apps/1386330/ss_594cba1b70e124c52ab654f6c5e28136e3df18e2.1920x1080.jpg?t=1601269693,https://cdn.akamai.steamstatic.com/steam/apps/1386330/ss_ec4b5a3aebeb9f344a6496a0210225ee58f57041.1920x1080.jpg?t=1601269693,https://cdn.akamai.steamstatic.com/steam/apps/1386330/ss_9695f6722e2b467204adcd6d49bbbe2c2cb4813b.1920x1080.jpg?t=1601269693",
    "Slug": "funanigans-party-games",
    "Meta Title": "Funanigans: Party Games: Sep 27, 2020, Eric Peterson and ...",
    "Meta Description": "Looking for information on Funanigans: Party Games? Check out the release date (Sep 27, 2020), developer insights from Eric Peterson, and a complete gam...",
    "Alt Text Image": "Official header image for Funanigans: Party Games game - Steam 1386330",
    "Canonical URL": "https://gusku.site/game/funanigans-party-games",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Funanigans: Party Games\", \"description\": \"Looking for information on Funanigans: Party Games? Check out the release date (Sep 27, 2020), developer insights from Eric Peterson, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 27, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eric Peterson\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eric Peterson\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1386330/header.jpg?t=1601269693\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}