{
    "AppID": 1342790,
    "Name": "GangV | VR & PC Battle Royale",
    "Release date": "Apr 16, 2021",
    "About the game": "GangV is a Battle Royale taking place in a living environment featuring traffic, crowds, and law enforcement! Why is this a big deal? Because it changes everything! More Than Your Regular Shooter You start with your own vehicle on a wild starting block with your online opponents and you must be the last one to survive. GangV has a strong emphasis on high-speed chases in the middle of the traffic featuring many different cars but also planes, boats, and helicopters! The game will require your shooter skills as well as your pilot skills for you to be victorious! But be careful, you start with just a gun and your own car may be quickly spotted by your opponents! Steal Your Loot You’ll have to Steal money and equipment from civilians that will call law enforcement on you. The businesses you rob will not only bring you money but also become part of your gang’s territory. This turf war has a huge impact on the Battle Royale as it allows you to put pressure on your rivals, especially at the end of the game as businesses allow you to buy medicine and ammunition. Fight and Run Away From Law Enforcement Depending on your previous actions (heists, murders, …), you’ll have to fight policemen, SWAT, or militaries but you can’t keep on the fight against them forever, you will have to run away and hide from them to focus again on killing your opponents. Hide In the Crowd There is nothing differentiating you from a civilian. That means you can hide in the crowd and in the traffic to find and take your opponents by surprise. But be careful as any civilian could also be a player hiding! Seasons GangV is an evolving world, each season offers content updates and a unique game mode to let you experience a new way to play in this huge living world. Free-Roaming If you want to take a break between matches, feel free to experience our online free-roaming game mode to have fun online with friends in the game’s world of freedom. VR Compatibility GangV is fully compatible with Virtual Reality devices for seated or room-scale VR sessions. Live the ultimate living world Battle Royale experience in VR! Dynamic Modding (Coming Soon) The game supports many modding possibilities, from model reskinning, map creation, content adding to full game mode creation. Our Dynamic Modding option will allow you to share your modded content with other players in real-time on fully dynamic modding servers.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1342790/header.jpg?t=1637075516",
    "Price": 10.49,
    "Developers": "raptor lab",
    "Publishers": "raptor lab",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1342790/ss_3ab3700e1083d870a12a0fa95ab1c165ac7ff09c.1920x1080.jpg?t=1637075516,https://cdn.akamai.steamstatic.com/steam/apps/1342790/ss_9d08cc255fa1f123240999c450c7f0b06bb912ca.1920x1080.jpg?t=1637075516,https://cdn.akamai.steamstatic.com/steam/apps/1342790/ss_af5683375ab7414989bbe83cf6119407ccd430da.1920x1080.jpg?t=1637075516,https://cdn.akamai.steamstatic.com/steam/apps/1342790/ss_0e5189b77fc9ed79192c0ef0b1b935323ad377e6.1920x1080.jpg?t=1637075516,https://cdn.akamai.steamstatic.com/steam/apps/1342790/ss_aede4a30e22bc3f5c55a016d2a3e8bcd0833b024.1920x1080.jpg?t=1637075516,https://cdn.akamai.steamstatic.com/steam/apps/1342790/ss_1b1038b4cbe8b4643c6789564c43b768980db96a.1920x1080.jpg?t=1637075516",
    "Slug": "gangv-vr-pc-battle-royale",
    "Meta Title": "GangV | VR & PC Battle Royale: Apr 16, 2021, raptor lab a...",
    "Meta Description": "Looking for information on GangV | VR & PC Battle Royale? Check out the release date (Apr 16, 2021), developer insights from raptor lab, and a complete ...",
    "Alt Text Image": "Official header image for GangV | VR & PC Battle Royale game - Steam 1342790",
    "Canonical URL": "https://gusku.site/game/gangv-vr-pc-battle-royale",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"GangV | VR & PC Battle Royale\", \"description\": \"Looking for information on GangV | VR & PC Battle Royale? Check out the release date (Apr 16, 2021), developer insights from raptor lab, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"raptor lab\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"raptor lab\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1342790/header.jpg?t=1637075516\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}