{
    "AppID": 1755120,
    "Name": "Ghosts of War: Battle Royale WW2 Shooting games",
    "Release date": "Oct 26, 2021",
    "About the game": "Second World War shooter with Battle Royale mode. Choose your side. Prepare your weapons and hurry up to the battle - exciting online shooter with players all over the world and with beautiful well-designed graphics is waiting for you. You will get unforgettable experience of warfare in form of dynamic action! Shooter features: ✯6 unique maps Legendary breathtaking battlefields with tanks, ships and non-stop action. Each map is interesting in its own way, each map has its own features. ✯Different characters There are characters of such countries as: USA, Russia, Japan, Germany with different skins. Choose your character and go to battle! ✯Game cards collections Collect trading game cards to get even more unique and expensive weapons. Exchange cards with other players to build the best collection! ✯Huge arsenal of WW II weapons There are 23 types of different weapons: Mosin nagant, Mauser, Thompson submachine gun, various pistols, rapid fire machine guns and many other. ✯Weapon upgrade There is weapon development brunch - improve your favorite weapon, add characteristics and damage. ✯Battle-pass Complete tasks according quest list, you will get new weapons and camouflages with level rising. The higher your level is, the higher is award. Do your best, soldier! ✯Camouflages and trinkets Customize your weapon - there is a great variety of weapon skins in the game: from bright and colorful to serious metal skins with engravings. To stand out your weapon, you can hang your own trinket-talisman. At the moment two game modes are available: ✯Deathmatch Every man for himself, compete with other players on the map and take top places first. ✯Team battle Unite with fellows and destroy enemies in online shooter about Second World War. ✯New battle modes will be available in the future... DEAR PLAYERS! The game in on the active stage of development, and we will accept all your requests and suggestions with pleasure. Write your feedback and we will definitely read it. Good luck in the battles, comrades!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1755120/header.jpg?t=1657259176",
    "Price": 0.0,
    "Developers": "XDEVS LTD",
    "Publishers": "XDEVS LTD",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1755120/ss_c33973fd9c7198a2f84b84ad2fbe015d73703835.1920x1080.jpg?t=1657259176,https://cdn.akamai.steamstatic.com/steam/apps/1755120/ss_ec803f1e3d957782f19be0d7af9305cea17acbbe.1920x1080.jpg?t=1657259176,https://cdn.akamai.steamstatic.com/steam/apps/1755120/ss_b50ba159828f3641bef6863715f26192b5eff1e1.1920x1080.jpg?t=1657259176,https://cdn.akamai.steamstatic.com/steam/apps/1755120/ss_95a839f065253d732695b395b6a0c4a73dc5a9b5.1920x1080.jpg?t=1657259176,https://cdn.akamai.steamstatic.com/steam/apps/1755120/ss_0cf4c35dff757ff6f030ef834cb9cc1578ffc0d1.1920x1080.jpg?t=1657259176,https://cdn.akamai.steamstatic.com/steam/apps/1755120/ss_4db368a08a8c41372929fc0782931d11d64f3067.1920x1080.jpg?t=1657259176",
    "Slug": "ghosts-of-war-battle-royale-ww2-shooting-games",
    "Meta Title": "Ghosts of War: Battle Royale WW2 Shooting games: Oct 26, ...",
    "Meta Description": "Looking for information on Ghosts of War: Battle Royale WW2 Shooting games? Check out the release date (Oct 26, 2021), developer insights from XDEVS LTD...",
    "Alt Text Image": "Official header image for Ghosts of War: Battle Royale WW2 Shooting games game - Steam 1755120",
    "Canonical URL": "https://gusku.site/game/ghosts-of-war-battle-royale-ww2-shooting-games",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ghosts of War: Battle Royale WW2 Shooting games\", \"description\": \"Looking for information on Ghosts of War: Battle Royale WW2 Shooting games? Check out the release date (Oct 26, 2021), developer insights from XDEVS LTD...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 26, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"XDEVS LTD\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"XDEVS LTD\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1755120/header.jpg?t=1657259176\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}