{
    "AppID": 1418160,
    "Name": "Happy Quest",
    "Release date": "Nov 6, 2020",
    "About the game": "Happy Quest is a casual match-3 game. You are a kind hunter in the town. Your quest is help beautiful girls to defeat monsters. Let's make the girl feeling happy. Yayyyy !!!!!!! CHARACTERS Rena is a sweet funny girl that is serious when it comes down to business. She is pretty short, but despite that, nothing scares her and she can talk back to anyone. The girl only teases the people that mean something to her and that's what happens with the protagonist too. She has a great business and is one of the best talents regarding potions, but never brags about it. The girl knows that people don't take her seriously because of her looks, but she managed to show them how imposing she is by her hard work. Sana is a elf warrior but that's not what her whole personality revolves around. Despite her stern look, she is a person that values life more than anything and thinks it is better to retreat sometimes from fights and try again than to die a hero. She is a smart, strong woman that has some love for humans and other people, despite them being against her kind. She knows Rena and that helps her trust the mc more since he came from her. Georgia is a strong woman, both physically and mentally. She leads a bunch of men in her blacksmith shop and doesn't respond to anyone. She is a very important person and the best in the town, making weapons and armors for the king and people close to him. She lost a close friend in a battle but doesn't tell anyone about it. Since then, she swore to not participate anymore in these sorts of things. Although she makes items that kill people, she doesn't see all battles as something that should never exist but more like a necessary evil. Angami is a strong but weird naga warrior. She has to watch over the MC but despite that being an inconvenience for her, she barely complains about it. She has to train the recruits all over the kingdom and despite her tough look, she loves to joke around and tease, especially with people close to her. The woman is older than the mc by twelve years but no one else knows that about her. She started this by helping Georgia, but warmed up to the protagonist and even bring him food from her place. Yuna is a cheeky succubus that only hunts the best guys in the town. Despite her sexy attitude, she is overwhelmed by the MC's kindness and falls in love for the first time in her long life. She is made to attract people so that was never a problem for her, so she can't explain how the protagonist managed to refuse her advances in the first night. She is almost never serious, but gets interested in what humans do and even cooks for the mc as a gesture of gratitude. Yuna tries to tease the protagonist but always falls short, getting embarrassed and ending up being the one that gets teased more. FEATURES ❥ Fun and challenge match-3 gameplay. ❥ Upgradeable Stats, Skills. ❥ More than 50 animated enemies.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1418160/header.jpg?t=1642070512",
    "Price": 1.99,
    "Developers": "HappyGames",
    "Publishers": "HappyGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1418160/ss_419cf4be8ccd823d78c1489e31a8d9716abd0268.1920x1080.jpg?t=1642070512,https://cdn.akamai.steamstatic.com/steam/apps/1418160/ss_23299ed15d97688ac59dac612b0d99ab3be79c67.1920x1080.jpg?t=1642070512,https://cdn.akamai.steamstatic.com/steam/apps/1418160/ss_c93c41c180c9c6cfdb0cfacaa23f54710b37e17e.1920x1080.jpg?t=1642070512,https://cdn.akamai.steamstatic.com/steam/apps/1418160/ss_92a9a5f91d63ca2e7ad91af6320cfcdd50ef7758.1920x1080.jpg?t=1642070512,https://cdn.akamai.steamstatic.com/steam/apps/1418160/ss_d81f4f6e0a3172dd5d656980bdfad92f0cbab002.1920x1080.jpg?t=1642070512",
    "Slug": "happy-quest",
    "Meta Title": "Happy Quest: Nov 6, 2020, HappyGames and Full Overview",
    "Meta Description": "Looking for information on Happy Quest? Check out the release date (Nov 6, 2020), developer insights from HappyGames, and a complete game summary.",
    "Alt Text Image": "Official header image for Happy Quest game - Steam 1418160",
    "Canonical URL": "https://gusku.site/game/happy-quest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Happy Quest\", \"description\": \"Looking for information on Happy Quest? Check out the release date (Nov 6, 2020), developer insights from HappyGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 6, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"HappyGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HappyGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1418160/header.jpg?t=1642070512\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}