{
    "AppID": 695420,
    "Name": "Hex: Origins",
    "Release date": "Sep 23, 2017",
    "About the game": "Hex: Origins is a casual puzzle game based on a complete hexagon themed colorful experience. Enjoy a refreshing, calming and original experience, which is extremely easy to pick up but hard to master as you progress in the game. Across the multitude of game modes and levels you will encounter, you must place pieces composed of anywhere from 2 to 10 and more hexagons, each using up to 6 different colors. Everything in the game is based on two simple rules: You can place a piece anywhere on the board with no restrictions as long as all the neighboring tiles are empty. If one hex has a colored neighbor on the board, at least one of those neighbors needs to match its color. Building upon these simple rules, we added special board pieces and power-ups in order to create a fun and colorful experience. As long as you keep placing pieces on the board, its requirements for placing pieces change - so be careful about the order, colors and type of shapes you can use. Always plan ahead! Gameplay Hex: Origins offers you 4 different game modes, 2 available from the start, and 2 unlocked with tokens you earn while playing the game: Classic: a linear experience bundled up in Episodes, structured into 6 Chapters, each containing 6 Levels that you can play in 3 difficulties. Each Episode introduces new mechanics into gameplay and with each passing chapter, the difficulty is slightly raised - but so are the rewards! Flow: a linear experience similar to Classic, with the added requirement of connecting various battery pieces to light bulbs in order to power them up! Carefully plan your colored ways across the board and take up the challenge! Don't forget to fill up the board, though. Exploration: Give up the static board and expand in any direction! Exploration maps feature a center starting point with all the colors onto which you will start expanding in any direction you want. Treasure Hunting: On rare occasions you will find treasure map fragments. Assemble them into a map and embark on a  thematic journey in order to find the hidden treasures of Hex: Origins. Always remember that X marks the spot! Features Over 800 levels of ever-increasing challenges with 3 difficulty options Dynamic level difficulty &amp; no unique solutions: the moves you make always alter the possible shapes that can be placed thus making it easier or harder for yourself. As you place these pieces the game will try to generate pieces that you can use. Plan ahead carefully. Finish a level in any way possible! Shuffle mechanic: discard existing pieces and draw new ones in exchange for a tiny fraction of your progress bar. 5 power-ups that you can use to slightly alter or completely change the game board. Special bonus shapes: from time to time a difficult to place piece will appear (9+ hex piece). Place it on the board and successfully finish the level and earn extra rewards. Complete in-game quests that range from easy to hard and get awesome rewards! Open treasure chests and reap the rewards while you complete any level! Unlock custom hex piece skins. Customize your board with that extra bling! Customize the game experience with 9 beautiful backgrounds! Cloud saving, achievements, stats, leaderboards, level editor, workshop and soon trading cards!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/695420/header.jpg?t=1506349129",
    "Price": 1.99,
    "Developers": "Pretty Bat Games",
    "Publishers": "Pretty Bat Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/695420/ss_88a2d562f3cfb51c39a6d7da5e125647e7f6e0a6.1920x1080.jpg?t=1506349129,https://cdn.akamai.steamstatic.com/steam/apps/695420/ss_29a7f4cace17983f0d24e24c9d21d9187c21705e.1920x1080.jpg?t=1506349129,https://cdn.akamai.steamstatic.com/steam/apps/695420/ss_e68c06dba41ddf880de3b08cb7570c442fdc77df.1920x1080.jpg?t=1506349129,https://cdn.akamai.steamstatic.com/steam/apps/695420/ss_e435d58d88188756f53c2e690e88c60cdd4893c7.1920x1080.jpg?t=1506349129,https://cdn.akamai.steamstatic.com/steam/apps/695420/ss_a6f9877114ad5863c3a42ec6b4b0e789e25bda7e.1920x1080.jpg?t=1506349129",
    "Slug": "hex-origins",
    "Meta Title": "Hex: Origins: Sep 23, 2017, Pretty Bat Games and Full Ove...",
    "Meta Description": "Looking for information on Hex: Origins? Check out the release date (Sep 23, 2017), developer insights from Pretty Bat Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Hex: Origins game - Steam 695420",
    "Canonical URL": "https://gusku.site/game/hex-origins",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hex: Origins\", \"description\": \"Looking for information on Hex: Origins? Check out the release date (Sep 23, 2017), developer insights from Pretty Bat Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 23, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pretty Bat Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pretty Bat Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/695420/header.jpg?t=1506349129\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}