{
    "AppID": 45750,
    "Name": "Lost Planet® 2",
    "Release date": "Oct 15, 2010",
    "About the game": "The larger than life action of Lost Planet 2 , comes to PC! Lost Planet 2 is the sequel to Lost Planet™: Extreme Condition, the landmark third-person shooter which debuted on Xbox 360 and went on to sell over 2.3 million units worldwide after its release. Lost Planet 2 offers deeper insight into the world of E.D.N III and the uncertain fate of future mankind. Already acclaimed for its visual accomplishments from the console versions, Lost Planet 2 will define the 3D experience on the PC. Stunning environments will immerse the player in NVIDIA Vision Surround technology, and the rebalanced gameplay and streamlined control mechanics make Lost Planet 2 PC the ultimate Lost Planet experience. A decade has passed since the events of the first game, and the face of E.D.N. III has changed dramatically. Terraforming efforts have been successful and the ice has begun to melt, giving way to lush tropical jungles and harsh unforgiving deserts. Mankind has engaged in a civil war to take control of the precious Thermal Energy that powers weapons and vehicles on E.D.N. III and resulted in a separation into various factions. Players will control heroes from each faction across 6 interconnected episodes, viewing the war from the perspective of each, creating a truly unique interactive experience. With this concept, players will have the opportunity to engage in the story in a much more dynamic way as plot threads evolve from different players’ perspectives. The intense and action-packed campaign mode comes with the ability to form teams of up to 4 players online. Beyond the deep single-player and co-op modes, Lost Planet 2 is loaded with extensive multiplayer modes allowing up to 16 players to compete online, each with their own customizable avatar. No action game would be complete without an arsenal of weaponry, and Lost Planet 2 has a huge variety of hardware for players to unleash on unsuspecting enemies. Machine guns, shotguns, rocket launchers, lasers, sniper rifles, grenades and a host of other weapons are scattered across the game. The grappling hooks that made the gameplay in Lost Planet a true 3-D experience are back, allowing gamers to gain tactical advantage by moving to elevated locations quickly. Lost Planet 2’s biggest weapons come on two legs: the heavily armed and armored robotic Vital Suits return in greater numbers and variety than the first game. There are VS that transform into other vehicles, hold up to three players and some that even take multiple players to operate. Key Features: Co-op action: Team up to battle the giant Akrid in explosive 4 player online co-operative play. Teamwork is the player’s key to victory as the team is dependent on each other to succeed and survive. Massive scale of enemies: Players skill on the battlefield and ability to work as a team will be tested like never before against the giant Akrid. Players will utilize teamwork tactics, new weapons and a variety of vital suits (VS) to fight these larger-than-life bosses. Beautiful massive environments: Capcom’s advanced graphics engine, MT Framework 2.0, and DirectX 11 support will bring the game to life with the next step in 3D fidelity and performance. See Lost Planet 2’s world through new eyes, with support for hardware tessellation and compute shader. Deep level of character customization: Players will have hundreds of different ways to customize their look, nom de guerre, emotes, and weapons to truly help them define their character on the battlefield. A wide array of customizable abilities range from taking less damage, to running faster to operating data posts quicker Rewards System: Players will receive rewards for assisting teammates and contributing to the team’s success Multiplayer: Compete in 16-player multiplayer matches with nine different maps and 5 different game modes including Data Post Battle, Akrid Egg Battle, Fugitive, Elimination and Team Elimination. Additional maps will be available as downloadable content after the game’s release. Exciting new VS features: Based on fan feedback, the team has implemented an unbelievable variety of Vital Suits and new ways to combat VS’s. The new VS system will have a powerful impact on the way the player takes to the war zone in Lost Planet 2.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/45750/header.jpg?t=1636428326",
    "Price": 0.0,
    "Developers": "CAPCOM CO., LTD.",
    "Publishers": "Capcom",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_31ebe9ef0638b7070cde8874f17bd54949e1573d.1920x1080.jpg?t=1636428326,https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_12826d07abfe140d530e5b9dff2af5c7c5946bf7.1920x1080.jpg?t=1636428326,https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_6f91dc8ceb4181fb55b7f63cabbdf0de4a19a47c.1920x1080.jpg?t=1636428326,https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_327e60c0a5b3a90b59d17bf41071bda2271d45d1.1920x1080.jpg?t=1636428326,https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_f87b3a62788c70f60444c6d5f1c476903851fdeb.1920x1080.jpg?t=1636428326,https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_c4b411eab2ad2146049811a6e223f934d1bd8ec7.1920x1080.jpg?t=1636428326,https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_e2784bc6807d227f49b02ec6bc5e20cbc2149a1a.1920x1080.jpg?t=1636428326,https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_926d4ce526c059ceb5228a46b0de42ae110ae3b4.1920x1080.jpg?t=1636428326,https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_2dc17aa52d3d4d1c5b7169f97fc4c8be13d64c74.1920x1080.jpg?t=1636428326,https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_ee2b6f75957ccda7bdbfaeeb66081f1b670e28be.1920x1080.jpg?t=1636428326,https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_6634015ce26af3c9e377d6c67a78a376dfcd5f34.1920x1080.jpg?t=1636428326,https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_424e2abc2ca387e79347b71b11184aa0ed0579ff.1920x1080.jpg?t=1636428326,https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_88901375a1975c634b361b4ead50a769d17597f8.1920x1080.jpg?t=1636428326,https://cdn.akamai.steamstatic.com/steam/apps/45750/ss_ce71290a2e7784eea4f5f802a08c9e883f44a5c5.1920x1080.jpg?t=1636428326",
    "Slug": "lost-planet-2",
    "Meta Title": "Lost Planet® 2: Oct 15, 2010, CAPCOM CO., LTD. and Full O...",
    "Meta Description": "Looking for information on Lost Planet® 2? Check out the release date (Oct 15, 2010), developer insights from CAPCOM CO., LTD., and a complete game summ...",
    "Alt Text Image": "Official header image for Lost Planet® 2 game - Steam 45750",
    "Canonical URL": "https://gusku.site/game/lost-planet-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lost Planet\\u00ae 2\", \"description\": \"Looking for information on Lost Planet\\u00ae 2? Check out the release date (Oct 15, 2010), developer insights from CAPCOM CO., LTD., and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 15, 2010\", \"author\": {\"@type\": \"Organization\", \"name\": \"CAPCOM CO., LTD.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Capcom\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/45750/header.jpg?t=1636428326\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}