{
    "AppID": 1875560,
    "Name": "Mare",
    "Release date": "Mar 31, 2022",
    "About the game": "As you wake up, stirred from a dreamless sleep with an unknown purpose, you find yourself in the strange lands of Mare embodying a mysterious artificial bird. Crossing paths with a helpless companion you venture deep into unknown territory on a puzzling adventure while unraveling a mysterious narrative and the secrets hidden within. All in order to ensure the arrival of the companion at her impending destiny. Explore the vast and strange landscapes by the means of an artificial bird. Guide and protect a vulnerable AI companion on her unexpected adventure. Let the curiosity of the companion inspire you to explore and discover the underlying narrative spanning over 8 chapters. Immerse yourself in the ambient atmosphere and otherworldly music for a soothing experience. Search for lost artifacts hidden throughout the world in order to unlock the final secret of Mare. REVIEWS Upload VR: Winner of 2021 Upload Awards - Hidden Gem. Mare is a breathless beauty of a VR game – simplistic in its progression perhaps but never anything less than astonishing to take in. The VR Grid: It’s not about the destination, but the journey as they say, and Mare is one helluva journey. From the opening moments of the game, all the way to it’s conclusion, I was enamored by the presentation and the story. Mare is nothing short of breathtaking and a welcome change of pace to the to action-packed, fast-paced titles I have been playing of late. Its a strikingly beautiful yet solemn adventure that pushes you ever forward toward the unknown. 6DOF Reviews: Mare is a title I can easily recommend to anybody who has an appreciation for beauty and mystery. It evokes a mood unlike any I’ve experienced in VR.. It may be brief, but its impact will far outlive its duration, proving beyond a doubt that it’s the quality of our experiences that matter, and not their duration. Mare is a class act from start to finish. It's a macabre and mysterious adventure that offers a haunting experience that long outlives its light puzzles and relatively brief playtime. VR Focus: A puzzle experience with beautiful scenery and a mysterious plotline all about a girl who needs your help. The barren environment coupled with the superb musical score ensures Mare has an ambience and soul few VR projects achieve.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1875560/header.jpg?t=1649313240",
    "Price": 11.99,
    "Developers": "Visiontrick Media",
    "Publishers": "Visiontrick Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1875560/ss_94ac0f5da01da24cd6c92b2ec927c9f1a86f58a6.1920x1080.jpg?t=1649313240,https://cdn.akamai.steamstatic.com/steam/apps/1875560/ss_77ec2375bb52762b42d583d0ce9666f86f71a385.1920x1080.jpg?t=1649313240,https://cdn.akamai.steamstatic.com/steam/apps/1875560/ss_f7362cdc98553d7bc9a718053a8aa30beba45135.1920x1080.jpg?t=1649313240,https://cdn.akamai.steamstatic.com/steam/apps/1875560/ss_1851779c5bbbef1a543e28b4f1c34686dd0bdbce.1920x1080.jpg?t=1649313240,https://cdn.akamai.steamstatic.com/steam/apps/1875560/ss_9c5a09c01877248e75e22759c7d95814cede1228.1920x1080.jpg?t=1649313240,https://cdn.akamai.steamstatic.com/steam/apps/1875560/ss_b0a20c4beb45ec2b063d12ad1ca35bcef7b3cb51.1920x1080.jpg?t=1649313240",
    "Slug": "mare",
    "Meta Title": "Mare: Mar 31, 2022, Visiontrick Media and Full Overview",
    "Meta Description": "Looking for information on Mare? Check out the release date (Mar 31, 2022), developer insights from Visiontrick Media, and a complete game summary.",
    "Alt Text Image": "Official header image for Mare game - Steam 1875560",
    "Canonical URL": "https://gusku.site/game/mare",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mare\", \"description\": \"Looking for information on Mare? Check out the release date (Mar 31, 2022), developer insights from Visiontrick Media, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Visiontrick Media\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Visiontrick Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1875560/header.jpg?t=1649313240\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}