{
    "AppID": 1088040,
    "Name": "MMA Executive",
    "Release date": "Aug 26, 2019",
    "About the game": "Do you think you know the fight game? Welcome to MMA Executive , where styles make fights, and where brute force meets technical precision. You will need to build a powerful gym filled with the best prospects, experienced veterans and inspirational coaches to establish your reputation and make shrewd decisions for the survival of your gym and perhaps even the MMA world economy at large! Money talks, but so does reputation and skill! So do controversial judges decisions and doctor stoppages! As do bone crunching strikes and ligament snapping submissions! The MMA world is faithfully simulated here with hundreds of deeply researched and tested techniques, retirements, pound for pound rankings, a Hall of Fame system and a dynamic simulated fan-driven economy that responds to fighter performances. Compete against rival managers and buy-out million or even billion $ organizations (if you think you’ve got what it takes)! Set multiple training camps, allocate coaches, game-plans and track the technical progress of your fighters! Test fighters to break gym records, hire sponsors, build up your gym from scratch and fill up your trophy cabinet! We do it old-school here! Elbows, flying knees, stomps, kicks to the grounded opponent, huge throws, axe-kicks, cartwheel passes, coma-inducing chokes and, of course, the glamorous ring card girls. Care to join in the fun? FEATURES: Unlockable technical archive featuring annotated, battle-tested techniques to improve your real life fight IQ. Plus 72 quiz questions to test your knowledge. ELO based fighter rankings with an intelligent AI matchmaking system generates logical fight cards. Complex simulation FIGHT ENGINE features HUNDREDS OF TECHNIQUES including throws, shots, trips, strikes, transitions and submissions. 24 fight ending submissions types, dozens of knock out techniques, alongside an ever changing and realistic 10-must judging system, disqualifications and TKO stoppages. Watch fights using the innovative transition map, announcer commentary and a plethora of statistics at your desired speed increments. Around 22’620 randomly generated character appearance combinations including fighters, managers, coaches and judges, plus the ability to import custom appearances. Compete against AI managers and buy out all four organizations to dominate the global MMA market, and ultimately save it from collapse. Upgrade your gym and manage fighters across 4 weight classes, including a women's category, and four organizations in a dynamic world of 160 concurrent fighters and 16 division categories. Also featuring an original soundtrack, prodigy/wunderkind development, sponsorship agreements, Hall of Fame systems AND MORE!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1088040/header.jpg?t=1567088087",
    "Price": 11.99,
    "Developers": "Vectormatrix Limited",
    "Publishers": "Vectormatrix Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1088040/ss_86c126c89be814e6b0d38e07768886a757f780e1.1920x1080.jpg?t=1567088087,https://cdn.akamai.steamstatic.com/steam/apps/1088040/ss_8c7d5937f0bc162d6eb6b72f8c595b63c7765146.1920x1080.jpg?t=1567088087,https://cdn.akamai.steamstatic.com/steam/apps/1088040/ss_23ddddc8f7eb8c67a2fc6124bf19250a3ee468f4.1920x1080.jpg?t=1567088087,https://cdn.akamai.steamstatic.com/steam/apps/1088040/ss_3bf53284a45c22239423cfd7c778c4e389239c49.1920x1080.jpg?t=1567088087,https://cdn.akamai.steamstatic.com/steam/apps/1088040/ss_665f4595c948a0fcce94bb13842eb54f00d67bfa.1920x1080.jpg?t=1567088087,https://cdn.akamai.steamstatic.com/steam/apps/1088040/ss_9cab4f6f6e79b83a9211b7356dc76fcd9568eda3.1920x1080.jpg?t=1567088087,https://cdn.akamai.steamstatic.com/steam/apps/1088040/ss_072339e771fc92e770bee8f1f8749c3e03e7a6ee.1920x1080.jpg?t=1567088087,https://cdn.akamai.steamstatic.com/steam/apps/1088040/ss_71a1e200351d4209ad11b79f5016f083a3633972.1920x1080.jpg?t=1567088087,https://cdn.akamai.steamstatic.com/steam/apps/1088040/ss_d2574d3ae5ee515b460224d5544b71881e4cfb2f.1920x1080.jpg?t=1567088087",
    "Slug": "mma-executive",
    "Meta Title": "MMA Executive: Aug 26, 2019, Vectormatrix Limited and Ful...",
    "Meta Description": "Looking for information on MMA Executive? Check out the release date (Aug 26, 2019), developer insights from Vectormatrix Limited, and a complete game s...",
    "Alt Text Image": "Official header image for MMA Executive game - Steam 1088040",
    "Canonical URL": "https://gusku.site/game/mma-executive",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MMA Executive\", \"description\": \"Looking for information on MMA Executive? Check out the release date (Aug 26, 2019), developer insights from Vectormatrix Limited, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 26, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Vectormatrix Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vectormatrix Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1088040/header.jpg?t=1567088087\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}