{
    "AppID": 342260,
    "Name": "Nevermind",
    "Release date": "Sep 29, 2015",
    "About the game": "NOTE: You do NOT need a heart rate sensor to play Nevermind . With or without a heart rate sensor, emotion-based biofeedback will be available via almost any standard webcam on a min-spec (or higher) Windows or Mac machine*. Without a webcam or heart rate sensor, the biofeedback-specific features will be unavailable, but the core game itself will be fully playable and enjoyable as an atmospheric mystery-adventure game. Nevermind is a biofeedback-enhanced psychological thriller that takes you into the dark and surreal world within the subconscious minds of psychological trauma patients. As you solve puzzles and explore the twisted labyrinths of the mind, biofeedback technology monitors your feelings of fear, tension, and anxiety with each passing moment. If you let your fears get the best of you, the game becomes harder. If you’re able to calm yourself in the face of terror, the game will be more forgiving. Nevermind ’s goal is to create an unforgettable gameplay experience that can help teach you to be more aware of your unique internal responses to stressful situations. If you can learn to control your feelings of stress and anxiety within the disturbing realm of Nevermind , just imagine what you can do when faced with those inevitable stressful moments in the real world… A one-of-a-kind atmospheric terror game that can sense your feelings of fear—creating an experience unlike anything you've played before. A hauntingly surreal interpretation of psychological trauma. Players must unravel the mystery of each patient's buried trauma, exploring darkly beautiful landscapes, solving puzzles, and unearthing clues along the way. If played with biofeedback technology , Nevermind challenges you to stay calm in the face of stressful scenarios, helping equip you with the tools to manage stress and anxiety in everyday life. Supports a range of biofeedback technology, virtual reality, and the Tobii EyeX eye-tracking controller. Extensive Intel® RealSense™ technology support for physiological biofeedback tracking, unique gesture detection, and facial recognition events that can ONLY be experienced with RealSense! Affectiva’s Affdex technology enables emotional biofeedback tracking via virtually any standard webcam ! Confirmed physiological biofeedback detection via the Apple Watch**, Wild Divine IomPE, Garmin Heart Rate Chest Strap, Mio LINK sensors, and more! Players can combine both physiological and emotional biofeedback for an incredibly accurate and responsive experience! For more information about supported devices, please see * Note: Webcam-based biofeedback is unavailable when played on VR platforms. For more information on our supported technologies and compatibilities, please visit: www.nevermindgame.com/tech ** To play Nevermind while using an Apple Watch, you must also download the Apple Watch app. For more information on how to use the Apple Watch with Nevermind and links to where you can download the app, please visit: www.nevermindgame.com/AppleWatch Important Note: The sensors listed represent devices compatible with Nevermind as of December 2017. As operating systems, hardware, and computers continue to evolve, please be aware that some of these devices may not work with Nevermind in the future. We cannot guarantee that devices or biofeedback will properly function any time after that date. ... DISCLAIMER This game has not been evaluated by the U.S. FDA and is not intended to diagnose, treat, cure, or prevent any disease. The consumer-grade technologies supported by Nevermind are not medical devices nor should they be considered medical instruments. Tobii EyeX Eye-Tracking Controller With a Tobii EyeX eye-tracking controller, several aspects of the game can be influenced by simple eye movement - unlocking new features throughout the entire game as well as some brand new surprises within each level. For more information about the Tobii EyeX, please see / GAME PADS Nevermind currently has limited controller support for several D-pad based controllers (NOTE: a keyboard is still needed to enter the doctor’s name during the registration process). We currently support: Wired USB Xbox 360 Controller Wired USB Xbox One Controller Logitech’s RumblePad 2 Controller Logitech Gamepad F310 Logitech Gamepad F710 Nevermind supports Razer Chroma technology! For more information about Razer Chroma, please see",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/342260/header.jpg?t=1653872858",
    "Price": 19.99,
    "Developers": "Flying Mollusk",
    "Publishers": "Flying Mollusk",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/342260/ss_4564591c9849100e5676e17ec78ec3fbc4512acb.1920x1080.jpg?t=1653872858,https://cdn.akamai.steamstatic.com/steam/apps/342260/ss_5387de0b18ee363e1495c7bd32bb3ad45f7237d2.1920x1080.jpg?t=1653872858,https://cdn.akamai.steamstatic.com/steam/apps/342260/ss_33ac01c050e6840d9ccf5c7e02388d581b028c5c.1920x1080.jpg?t=1653872858,https://cdn.akamai.steamstatic.com/steam/apps/342260/ss_d191533a6b6053484a58a5f291194928555db88c.1920x1080.jpg?t=1653872858,https://cdn.akamai.steamstatic.com/steam/apps/342260/ss_441b1999c61d298e5b34cd2f16965b7582856d66.1920x1080.jpg?t=1653872858,https://cdn.akamai.steamstatic.com/steam/apps/342260/ss_46f4b492369da889e47244590fa24abf49352969.1920x1080.jpg?t=1653872858,https://cdn.akamai.steamstatic.com/steam/apps/342260/ss_906733dd6bdc3785d245a039af3da5db3ced8ca7.1920x1080.jpg?t=1653872858,https://cdn.akamai.steamstatic.com/steam/apps/342260/ss_af3a533831f070328812db84158d117bebd686c4.1920x1080.jpg?t=1653872858,https://cdn.akamai.steamstatic.com/steam/apps/342260/ss_a99f24e2422e562ed14d822402f41c44105e97cb.1920x1080.jpg?t=1653872858,https://cdn.akamai.steamstatic.com/steam/apps/342260/ss_139f345a8ccac627cd042095e3ab3844d9643647.1920x1080.jpg?t=1653872858",
    "Slug": "nevermind",
    "Meta Title": "Nevermind: Sep 29, 2015, Flying Mollusk and Full Overview",
    "Meta Description": "Looking for information on Nevermind? Check out the release date (Sep 29, 2015), developer insights from Flying Mollusk, and a complete game summary.",
    "Alt Text Image": "Official header image for Nevermind game - Steam 342260",
    "Canonical URL": "https://gusku.site/game/nevermind",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nevermind\", \"description\": \"Looking for information on Nevermind? Check out the release date (Sep 29, 2015), developer insights from Flying Mollusk, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 29, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Flying Mollusk\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Flying Mollusk\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/342260/header.jpg?t=1653872858\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}