{
    "AppID": 1487140,
    "Name": "Ochitsubaki",
    "Release date": "Dec 17, 2021",
    "About the game": "A fallen camellia is a beheading, every time, every petal falling at once: a severing. OCHITSUBAKI is a game about the impossibility of translating trauma. It is also about two-tailed catboys, gods with cloud hair, and slapfights. ​ TW: CSA, animal death, violence, suicidal ideation ​════*.·:·.☽✧ ✦ ✧☾.·:·.*════​ OCHITSUBAKI || 落ち椿 is a visual novel about the impossibility of translating trauma. It is a bilingual JPN/ENG game about translation and how it can run as deeply as the way hypermarginalized people constantly 'translate' their identities and trauma for the understanding of others, no matter how far it is from the source material. It's about recovering from trauma through the genuine compassion and consideration of another person, who manages to See the aftereffects of trauma and are willing to meet that person's unique needs, regardless of if they 'understand' them or not. ════*.·:·.☽✧ ✦ ✧☾.·:·.*════ Hanashiro (he/she/they) and their few remaining kin all react differently to the trauma of being immortal and witnessing the apocalypse over and over again in different cycles of reincarnation. Shiragiku is unfazed and cheery and flippant and whimsical and capricious; Shirayuri is nowhere to be found; and Hanashiro? Hanashiro is planning on their death in 10 years, when the camellias fall, if they cannot find a reason to live by then. Hanashiro and Shirayuri have witnessed THE END OF THE WORLD before. But no one believed them. Shiragiku has seen many, many apocalypses, but she has never been hurt by any one after the first. Shiragiku has remembered every single end; Shirayuri has remembered none; and Hanashiro only remembers some. Which? Even he doesn't know. Hanashiro misses speaking her fey mother tongue, but she can't seem to find anyone willing to listen to her, not even her own kind. And then she makes an enemy who just might. Their name is Lun Kochouran. And they might be the first one in a millennium to learn the Amayuri tongue. They also might be the first to kill an immortal. ════*.·:·.☽✧ ✦ ✧☾.·:·.*════ Ochitsubaki is only loosely a visual novel, which is to say it is a story-based game with a strong aesthetic component. Ochitsubaki has a deep, rich tapestry of aesthetics in unifying modern elegance with unique retro anime-inspired character portraits. The original soundtrack derives inspiration from traditional Asian pentatonic scales, particularly but not limited to Japanese ones, that also derive a modern, Genshin's Liyue-type twist that sets it firmly in contemporary times. It has three language options: JPN, ENG, and JPN translation. The ENG/JPN versions are two different renditions of the story, thus requiring a separate JPN translation, emulating what happens when you try to translate something as complex as identity. You can consider that the only real choice you make in the game is which language to play it in, and each language option provides a different 'route,' a similar but very distinctly different iteration of the story. The language modes mimic the powerful loss that happens when stories--when trauma--is translated.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1487140/header.jpg?t=1639786213",
    "Price": 13.99,
    "Developers": "FEYXUAN",
    "Publishers": "FEYXUAN",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1487140/ss_10a124a6f808ee1754b7007582e5723d94d065c4.1920x1080.jpg?t=1639786213,https://cdn.akamai.steamstatic.com/steam/apps/1487140/ss_bcc9e2b8884a63dc9fc46be56d5d62919be37b23.1920x1080.jpg?t=1639786213,https://cdn.akamai.steamstatic.com/steam/apps/1487140/ss_b51fe7ac2f66db6f811c099ea9241b087cd0d8c6.1920x1080.jpg?t=1639786213,https://cdn.akamai.steamstatic.com/steam/apps/1487140/ss_27131575951913dbe1adf280d8cecbeff6971f69.1920x1080.jpg?t=1639786213,https://cdn.akamai.steamstatic.com/steam/apps/1487140/ss_3053d8973b1778507ecc0039fb3e3e4d2f12f6cb.1920x1080.jpg?t=1639786213",
    "Slug": "ochitsubaki",
    "Meta Title": "Ochitsubaki: Dec 17, 2021, FEYXUAN and Full Overview",
    "Meta Description": "Looking for information on Ochitsubaki? Check out the release date (Dec 17, 2021), developer insights from FEYXUAN, and a complete game summary.",
    "Alt Text Image": "Official header image for Ochitsubaki game - Steam 1487140",
    "Canonical URL": "https://gusku.site/game/ochitsubaki",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ochitsubaki\", \"description\": \"Looking for information on Ochitsubaki? Check out the release date (Dec 17, 2021), developer insights from FEYXUAN, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 17, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"FEYXUAN\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FEYXUAN\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1487140/header.jpg?t=1639786213\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}