{
    "AppID": 457140,
    "Name": "Oxygen Not Included",
    "Release date": "Jul 30, 2019",
    "About the game": "In the space-colony simulation game Oxygen Not Included you’ll find that scarcities of oxygen, warmth and sustenance are constant threats to your colony's survival. Guide colonists through the perils of subterranean asteroid living and watch as their population grows until they're not simply surviving, but thriving... Just make sure you don't forget to breathe. Build Extensive Bases and Discover What it Takes to Survive: Everything in your space colony is under your control, from excavation and resource allocation right down to plumbing and power systems. Resources will begin depleting with your first breath, however, so be sure to dig fast if you want to live. It’s Mind Over Matter with Stress Simulations: Keep the psychological impact of survival at bay with fun leisure activities, great accommodations and even better food for your colony. Duplicants each have different and potentially destructive ways of reacting to stress, so be sure to always keep them happy. Whatever the cost. Avoid Boiling with Thermodynamics: Temperature control is a constant concern in space; too cold and you'll freeze, too hot and you'll fry. Keep tabs on ambient environmental temperatures and your colony's heat production to maintain a nice, cozy atmosphere for your colonists. Enhance Efficiency through Complex Gas and Liquid Simulations: Create interlocking pipe systems to swiftly deliver fuel and liquid to critical areas of your base. Plan well and be rewarded as your colony transforms into an imperishable, well-oiled machine. Take Charge with Power Grid Simulations: Choose from a multitude of power sources including coal, hydrogen, natural gas or just plain old elbow grease. Manage power runoff, circuit overloads and meltdowns to keep your colony running smoothly. Always Keep Yourself Breathing: Enter the Oxygen Overlay and watch air moving through your base in real time. Monitor carbon dioxide accumulation and oversee oxygen generation processes to mold your colony into a veritable deep-space oasis. Waste Nothing through Extreme Recycling: Make use of every last resource for a base that truly exemplifies efficiency. Recycle waste into precious fuel, process unbreathable gas into air or harness the natural bodily processes of wild creatures for food. If you’re clever, you might even be able to run a base off colonist farts. Explore Diverse, Procedurally Generated New Worlds: Summon new worlds with a push of a button. Experience tons of untamed space rocks, then suffocate to death in them!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/457140/header_alt_assets_6.jpg?t=1654189805",
    "Price": 24.99,
    "Developers": "Klei Entertainment",
    "Publishers": "Klei Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/457140/ss_78d1c92edeecc7b17cafa9248867fe7d4390a0a0.1920x1080.jpg?t=1654189805,https://cdn.akamai.steamstatic.com/steam/apps/457140/ss_67ab224dd8c781d5a27ee52657173298873d439a.1920x1080.jpg?t=1654189805,https://cdn.akamai.steamstatic.com/steam/apps/457140/ss_ba2b8c362327add29b08182d13b04bf502e065cd.1920x1080.jpg?t=1654189805,https://cdn.akamai.steamstatic.com/steam/apps/457140/ss_c5e20abaf2c82f9156da9c80b2ec7c0aefc46254.1920x1080.jpg?t=1654189805,https://cdn.akamai.steamstatic.com/steam/apps/457140/ss_24a4ffeaf41ea6d782fef203177243d36c185506.1920x1080.jpg?t=1654189805,https://cdn.akamai.steamstatic.com/steam/apps/457140/ss_02af9f36ca186bba1d0f2d5819d169e741076b46.1920x1080.jpg?t=1654189805,https://cdn.akamai.steamstatic.com/steam/apps/457140/ss_a481601e529d5fd3acc25a55557dfd1775cc6c96.1920x1080.jpg?t=1654189805,https://cdn.akamai.steamstatic.com/steam/apps/457140/ss_936e1756325dbd936f5b5227bdfb3357b57b356c.1920x1080.jpg?t=1654189805",
    "Slug": "oxygen-not-included",
    "Meta Title": "Oxygen Not Included: Jul 30, 2019, Klei Entertainment and...",
    "Meta Description": "Looking for information on Oxygen Not Included? Check out the release date (Jul 30, 2019), developer insights from Klei Entertainment, and a complete ga...",
    "Alt Text Image": "Official header image for Oxygen Not Included game - Steam 457140",
    "Canonical URL": "https://gusku.site/game/oxygen-not-included",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Oxygen Not Included\", \"description\": \"Looking for information on Oxygen Not Included? Check out the release date (Jul 30, 2019), developer insights from Klei Entertainment, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 30, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Klei Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Klei Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/457140/header_alt_assets_6.jpg?t=1654189805\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}