{
    "AppID": 546050,
    "Name": "Puyo Puyo™Tetris®",
    "Release date": "Feb 27, 2018",
    "About the game": "Two puzzle game juggernauts collide as Tetris®, one of the largest-selling and recognized brands in gaming history, and Puyo Puyo™ from SEGA combine to create a fun-to-play, fast-paced, competitive party game like no other! There’s a ton of different styles of gameplay – from the single-player Adventure and Challenge modes to the ferocious competition of the up-to-four-player Arcade modes. Unlock new characters and backgrounds in Adventure mode, or unlock new character voices, skins for Puyos and Tetriminos, backgrounds and more in the in-game Shop. You can even try your puzzle skills on a global scale by playing any of the multiplayer modes with up to four players online in Puzzle League or Free Play modes. FEATURES! Adventure Single-player mode offers ten unique acts, each with ten stages featuring different characters from the Puyo Puyo and Tetris universes. Each stage contains unique challenges players will need to overcome in order to win and move on! Multiplayer Arcade For up to four local players, Multiplayer Arcade offers a wealth of variety that will bring out players' competitive nature! Versus Players compete head-to-head in either Puyo Puyo or Tetris to fight in the puzzle battle of their lives. Swap Players' abilities are put to the ultimate test when they compete on both Puyo Puyo and Tetris boards, which switch back and forth at set intervals. Fusion A true hybrid game where players compete with Puyos and Tetriminos together on the same board, requiring deft, on-the-fly thinking to become victorious. Big Bang It's a race to the finish as players compete against each other to clear unique challenge boards as quickly as possible to win. Party Players compete on Puyo or Tetris boards, but the puzzles feature special items that when activated either help players or harm their opponents. Online Players can try their puzzle skills on a global scale by playing any of the multiplayer modes with up to four players online, in Puzzle League or Free Play modes. Puzzle League Increase player rating, earn ranks and aspire to new leagues in this mode for competitive enthusiasts. Free Play A more casual experience where records aren't kept and players can customize matches with unique settings, and invite their friends to play. Replays Players can save and upload any online matches to show off to their friends, or search other players' replays using the tag and filtering system to see how they tackle matches. Solo Arcade Play any of the Multiplayer Arcade modes against the CPU in Battle or Endurance matches, or try the single-player Challenges! Battle Substitute human players with 1-3 CPU opponents to fight against simultaneously. Endurance Go the distance in a one-on-one gauntlet of never-ending CPU opponents, racking up as many wins as possible. Challenge Forget about the opponents and put skills to the test with Sprint, Marathon and more, like the quirky Tiny Puyo, which shrinks down Puyos to fit even more on the board. Japanese VO For the first time in the West, players have the option to play with the original Japanese voiceovers with localized subtitles.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/546050/header.jpg?t=1611834147",
    "Price": 19.99,
    "Developers": "Sonic Team,Bitbaboon",
    "Publishers": "SEGA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/546050/ss_f31619172d26903c4c2824d9d2167fba9d3d9576.1920x1080.jpg?t=1611834147,https://cdn.akamai.steamstatic.com/steam/apps/546050/ss_bad1d01c91da284c8026f236c5970fadca4a42dc.1920x1080.jpg?t=1611834147,https://cdn.akamai.steamstatic.com/steam/apps/546050/ss_fd3b6e21782b679749be9d1061c33b74a07f835e.1920x1080.jpg?t=1611834147,https://cdn.akamai.steamstatic.com/steam/apps/546050/ss_55babc66e92c64ad6e5cb9c94a26bc54fd7cde0b.1920x1080.jpg?t=1611834147,https://cdn.akamai.steamstatic.com/steam/apps/546050/ss_6dc0178295323ce6a08dc0c2256a972f07308e80.1920x1080.jpg?t=1611834147,https://cdn.akamai.steamstatic.com/steam/apps/546050/ss_4efb60f7a7d8de9c17b240da501d942b3d02c758.1920x1080.jpg?t=1611834147,https://cdn.akamai.steamstatic.com/steam/apps/546050/ss_58a1ed155a6fdf0af3d8878d622af11f7fa2f870.1920x1080.jpg?t=1611834147,https://cdn.akamai.steamstatic.com/steam/apps/546050/ss_85c7e2cf209b0f7362725f24d682ac352d464a30.1920x1080.jpg?t=1611834147,https://cdn.akamai.steamstatic.com/steam/apps/546050/ss_dae9a653fcb092b82f79beea2d0610ec4d67da66.1920x1080.jpg?t=1611834147,https://cdn.akamai.steamstatic.com/steam/apps/546050/ss_7f2a564f34ac8065c5083518a1c3ac1e418b474b.1920x1080.jpg?t=1611834147",
    "Slug": "puyo-puyotetris",
    "Meta Title": "Puyo Puyo™Tetris®: Feb 27, 2018, Sonic Team,Bitbaboon and...",
    "Meta Description": "Looking for information on Puyo Puyo™Tetris®? Check out the release date (Feb 27, 2018), developer insights from Sonic Team,Bitbaboon, and a complete ga...",
    "Alt Text Image": "Official header image for Puyo Puyo™Tetris® game - Steam 546050",
    "Canonical URL": "https://gusku.site/game/puyo-puyotetris",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Puyo Puyo\\u2122Tetris\\u00ae\", \"description\": \"Looking for information on Puyo Puyo\\u2122Tetris\\u00ae? Check out the release date (Feb 27, 2018), developer insights from Sonic Team,Bitbaboon, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sonic Team,Bitbaboon\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SEGA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/546050/header.jpg?t=1611834147\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}