{
    "AppID": 1128520,
    "Name": "Rezist: Tower Defense",
    "Release date": "Sep 26, 2019",
    "About the game": "Welcome to the virtual world. There is some valuable data stored on your server. Your task is to protect this data from malicious programs which will try to steal it. Some of them will try to use brute force their way through your defenses. Most, however, will use more sophisticated algorithms. Some of them can be quick, others are well aware of your defenses and will therefore avoid attacks, and some more still you will not notice at all. And remember that it is not only you who can patch your system — your enemies are not standing still, too. Their creators are constantly studying your security utility programs and release more advanced versions. A deep and hardcore tower defense gameplay. A variety of enemies. A giant skills tree. Patches for the Patches God! (And all of them are really useful :) ) An unusual visual style. Every level has its own unique dressing which not only looks good but also moves in tune with the soundtrack. Hotkeys. Camera control: arrows or w, a, s, d. Pause: p. How to play. Your system is targeted by malicious programs. Every one of these programs aims at stealing data from your storage. Your task is to not let them do that. For this, you have: 1. Towers. Three left icons in the level menu. There are 3 types of towers: Red, Green, Blue. A tower of a specific type can only be built on a tile of the same color. The only exception are 'high tiles'. On a tile of this type you can build a tower of any type (this is why such tiles are of a special color). Also, a tower build on such a tile gets an attack range bonus. To build towers, you spend Memory. For each shot, you get experience. When a tower gets enough experience to upgrade, an 'Up' icon appears above it. If you click a tower, you will see a menu which will show: current level, current experience, characteristics (damage, attack range, fire rate), the tower's 'abilities', available upgrades (if there is enough experience). Do not forget to upgrade your towers and look into what new abilities each of the available upgrades gives. This is your way to success because there are particularly strong tower types out there. 2. Special abilities. Three right icons in the level menu. To use abilities, you spend Energy. 1. Hack. This ability has two uses: the first one is hacking something, and the second one is formatting disk space. * Hacking: on many levels, you will see objects surrounded by shields. If you click on such an object, the Hack ability icon will appear above it. If you have enough Energy to use the ability, clicking on this icon will cause one shield to disappear. When an object has no shields covering it, the objects becomes 'Hacked'. From now on, it starts to provide some kind of benefit to the player. * Formatting disk space: every level has areas where you cannot build your towers. This is 'unformatted sick space'. These areas look like a group of chaotically placed cubes of a specific color (Red, Green, Blue). If you use the Hack ability to a tile of this type, the area will be formatted and you will be able to build on it. This might be useful to occupy strategically important points and thus build a more reliable defense. 2. Laser Rain. Allows you to do damage to enemies located in the chosen area. 3. Overclocking. Gives a temporary bonus to attack speeds of all the towers on the level. After every defense attempt (depending on how many waves you have managed to fight off) you get experience and new levels. With each new level, you get 3 patch points. These points can be spent in the patch menu to upgrade your system's defense mechanisms.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1128520/header.jpg?t=1589792761",
    "Price": 0.99,
    "Developers": "SparkGames",
    "Publishers": "SparkGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1128520/ss_4be639c00f5f0aebe2af86ee8c5b45f6a8f674a5.1920x1080.jpg?t=1589792761,https://cdn.akamai.steamstatic.com/steam/apps/1128520/ss_016c6384567bc24e253133bcb075416e92c69ea4.1920x1080.jpg?t=1589792761,https://cdn.akamai.steamstatic.com/steam/apps/1128520/ss_2d1b02e13cf6056b6413f82346bdedc6263ab9d5.1920x1080.jpg?t=1589792761,https://cdn.akamai.steamstatic.com/steam/apps/1128520/ss_e587cf3a36df2bbbfcec630d44921ad0ba3f4bbf.1920x1080.jpg?t=1589792761,https://cdn.akamai.steamstatic.com/steam/apps/1128520/ss_c5d0e1447b631236160fe332bbecb23b2b91fed2.1920x1080.jpg?t=1589792761,https://cdn.akamai.steamstatic.com/steam/apps/1128520/ss_52dc9d15a04744562d88298b5e9eec9caec62f34.1920x1080.jpg?t=1589792761,https://cdn.akamai.steamstatic.com/steam/apps/1128520/ss_717b8e12f40a7cb4b4e9613b19d4f15aa60fddb9.1920x1080.jpg?t=1589792761",
    "Slug": "rezist-tower-defense",
    "Meta Title": "Rezist: Tower Defense: Sep 26, 2019, SparkGames and Full ...",
    "Meta Description": "Looking for information on Rezist: Tower Defense? Check out the release date (Sep 26, 2019), developer insights from SparkGames, and a complete game sum...",
    "Alt Text Image": "Official header image for Rezist: Tower Defense game - Steam 1128520",
    "Canonical URL": "https://gusku.site/game/rezist-tower-defense",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rezist: Tower Defense\", \"description\": \"Looking for information on Rezist: Tower Defense? Check out the release date (Sep 26, 2019), developer insights from SparkGames, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 26, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"SparkGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SparkGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1128520/header.jpg?t=1589792761\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}