{
    "AppID": 526130,
    "Name": "Sky Sanctuary",
    "Release date": "Jul 31, 2020",
    "About the game": "Have you ever wanted to be a samurai? Make your dreams come true by joining this mysterious archipelago high in the clouds. You will follow the instructions of Delios-Sensei, your only friend out there. He will teach you how to progress in the warrior's way and explore the secrets of Zen. Besides trainings, you will explore all the islands to reveal its secrets. Find inner peace and recharge your batteries contemplating a peaceful environment where nature and technology live in harmony. Through challenges involving reflection, action, agility and music, prove yourself worthy and eat your way up in leaderboards among the other gakusei. Welcome to Sky Sanctuary, the mini games collection for true samurais. Features Master your arsenal: Bow, katana, shaken, smoke bomb, chakram, taiko, flame thrower... Explore the environment: You can move all around the islands and enjoy beautiful panoramas. Make a new friend: Delios, your sensei, will guide you through your journey. Progress at your own pace: Many challenges have several difficulty modes. Whether you are a beginner or a senior samurai, your trainings will fit. Spam the bull's eye: Bend your bow and discover Kyudo (japanese archery). Overcome every challenge on the shooting range and become the real #RobinHoodSama Sharpen your blade: Draw your katana and slice the obstacles in your way with precision and agility. As a Tameshigiri master, look for the perfect moves. Grab your sticks: If you have rhythm in your blood, unleash your skills in the music challenge: will you be a Taiko Hero? Have a break: Enjoy a bit of respite and improve your precision and reflexes in other surprise trials. Move your body: ESky Sanctuary is especially designed for your device and its motion tracking system. Beat the highscores: Compete with your friends all around the world in leaderboards. Become a legend. General notice Expect from this game to be physically engaged. You'll have to reproduce real moves from sport activities like archery or martial arts. As you'll have to move your body a lot, especially your arms, make sure that you have a clear playing area (minimum 2m x 1.5m). Stay far enough from your screen and your friends. It would be sad to hurt anyone :). And like in a real physical activity: don't forget to breathe and take a break! (and drink gallons of water dammit!).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/526130/header.jpg?t=1597827188",
    "Price": 1.79,
    "Developers": "Glitchr Studio",
    "Publishers": "Glitchr Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/526130/ss_78a483a4b9f65b2627e2f5abb56b15d391c8b344.1920x1080.jpg?t=1597827188,https://cdn.akamai.steamstatic.com/steam/apps/526130/ss_5e56a82ec1e6ae9bfc53ba6fcd5e9d2779793194.1920x1080.jpg?t=1597827188,https://cdn.akamai.steamstatic.com/steam/apps/526130/ss_4173746fa50855632c642020c28c2e737c75d4ac.1920x1080.jpg?t=1597827188,https://cdn.akamai.steamstatic.com/steam/apps/526130/ss_5597e972517b0bee8942cf08e8f85a9172cf6046.1920x1080.jpg?t=1597827188,https://cdn.akamai.steamstatic.com/steam/apps/526130/ss_322c95ab1d707ba433abfa634bb82871d9e4f4cb.1920x1080.jpg?t=1597827188,https://cdn.akamai.steamstatic.com/steam/apps/526130/ss_deaec5244051344bdd4e12701af5a1a47f80442b.1920x1080.jpg?t=1597827188",
    "Slug": "sky-sanctuary",
    "Meta Title": "Sky Sanctuary: Jul 31, 2020, Glitchr Studio and Full Over...",
    "Meta Description": "Looking for information on Sky Sanctuary? Check out the release date (Jul 31, 2020), developer insights from Glitchr Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Sky Sanctuary game - Steam 526130",
    "Canonical URL": "https://gusku.site/game/sky-sanctuary",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sky Sanctuary\", \"description\": \"Looking for information on Sky Sanctuary? Check out the release date (Jul 31, 2020), developer insights from Glitchr Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 31, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Glitchr Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Glitchr Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/526130/header.jpg?t=1597827188\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}