{
    "AppID": 1886290,
    "Name": "Slot Shots Pinball Collection",
    "Release date": "Jun 21, 2022",
    "About the game": "Pinball is BACK! Slot Shots Pinball Collection Early Access features five tables, with one more table planned to release over the coming months for a total of at least six tables playable in this collection. Also included in the Early Access is a score attack mode- a one minute multiball thriller with increased mission and slot payouts (and each mode has its own separate online leaderboard system)! Super Vixel Land - A retro themed pixel/voxel super wide table that has missions on both the upper playfield and a lower playfield that has a revolving wheel! Slot Shots Casino - A fantasy themed casino playground that features a fully functional slot machine, which has a total of ten payouts based on your slot machine roll. This table also has a spinning lucky wheel in the back that grants various different awards based on where the ball drops down the wheel! Bass Hunter - A fishing themed table that also features its own custom slot machine. In Bass Hunter you will be completing fishing themed missions, such as catching the 'legendary' fish, while also collecting high scores from activating the slot machine that features different fish and tackle. Neon Nights 2 Skylines - A cyberpunk styled purple and blue neon themed table with a pulse pounding synth style soundtrack. Outergalactic Aliens - A remake of last year's table with all new LEDs, and the addition of the slot machine. PLEASE NOTE: This title is built on the Unity engine and there is a slight delay while playing if you use BOTH shift keys at the same time to control the flippers. This is a known issue with the Unity engine. We recommend picking ONE shift key on either side and then using another key to control the other flipper such as S/L, CTRL or Tab. The entire game's soundtrack currently spans close to two hours, not including all of the sound effects and victory/defeat riffs. Features full controller support, mouse / keyboard support, and the Steam online leaderboards to rank your final score for each table. No subscription, monthly fees, or tickets required to enjoy some good ol' fashion pinball. What do the Steam curators have to say about this title? Check it out! Impartial Reviews - “An excellent addition to the undeservedly underrated pinball genre, that stands out for its extremely entertaining, varied, and addictive gameplay, beautiful tables design and great soundscape.” - Recommended One To Ten Reviews - “A charming and fun game that offers a wide selection of pinball tables, each with its own unique theme and commendable attention to detail, along with a well-chosen soundtrack. Review score: 9/10” - Recommended KeyHub- “Is it the bell? or maybe the lights? It is definitely something that makes pinball machines and video games super addictive, well this game is no exception. This is a fun and enjoyable game.” - Recommended Nap'n'Gaming - A really awesome pinball game with very intuitive controls made by experienced developers in pinball games where we can strategize to fulfill many missions while grinding points. Highly recommended! - Recommended Shut Up And Listen!- “Slot Shots Pinball Collection delivers a remarkable pinball experience, significantly raising the bar of quality in this fun genre due to its charming visual style, pleasant music and varied tables.” - Recommended My Review Is My Message - “Slot Shots Pinball Collection is an addictive and challenging pinball collection. Each table within this set has a unique flavor and gameplay that will please even the most sophisticated player.” - Recommended Games Reviews Matter - “Each table in this collection will give you many unique emotions, including pleasant nostalgia for classic games, thanks to its great visual design, amazing soundtrack and pleasant physics.” - Recommended The World Of Reviews - “One of the finest virtual pinball collections featuring varied original tables, outstanding graphics, well-chosen music and sounds, along with remarkable physics. What else do you need to have fun?” - Recommended You Can't Handle the Truth! - “A magnificent collection of pinball tables that will delight you not only with its unique and colorful design, but also with its pleasing physics, which is quite rare in this genre.”- Recommended JuegosGratisUnlimited - Recommended Rise and Shine, Mr. Gamer - Recommended 17173萤火虫 - Recommended Pink Unicorn 🦄 - Recommended BlackHatMan - Recommended Imaginarium - Recommended Game Reviewers(JP) - Recommended Hex's Gameplay - Recommended 甄游组 - Recommended Review Prizm - Recommended ~Universal Gamers~ - Recommended CzechLP - Recommended Emote Reviews - Recommended Trash Games Fever - Recommended Peelijah Reviews - Recommended",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1886290/header.jpg?t=1657283667",
    "Price": 9.99,
    "Developers": "Pinblend Studios",
    "Publishers": "Pinblend Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_06564e25774c8f21ce75b284d6f0cf8132ce9495.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_5caa7ca69a4620131df67e820fb6d8c9cef68d06.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_6407752fc4c149e98d23c6f33bfb361d944b3df2.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_221b1e778c1944285c687fcdf736e93c3cc93b87.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_ce4c14ef52fcb43900d2df3ab87e5e00fe7507b1.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_4063af4df1fbdb71ae3aaac594bbf8b823f560e3.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_74f888d4ed620539d81547774400e1f16d2948e6.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_e144f2cea01cd5ccc55281f3bc88b5105ab9332e.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_a37e7bf956d694354463dbb5938801e2256e25b6.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_0dba6aa74c2b537bc3d923c1820a6d86c95ea105.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_aa0028f2fce95f5bd16de4e935cc26fb32897c39.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_4b38376a243d4a68616380d7be0db3e859f3a996.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_94c80c6ffa64762851d0e03e5dbfb4a6c791d758.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_319c6a0a1254d103f30af548ad11c2c96c7125f4.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_7cab0573e66d45d3d2156c49efadcbc7dd359515.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_1fb8f5d2c02d0bbcf7316e9ebf475c5004e90a8b.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_e0463c7dac9d3e4e056e5ec973771a3866b49678.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_280410276599f41fc189735c029f39d16505bf2d.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_ca4bbc819cc86a805e18b328694a50fa885e4122.1920x1080.jpg?t=1657283667,https://cdn.akamai.steamstatic.com/steam/apps/1886290/ss_1162448818ff321b712070d7c703185346cc1622.1920x1080.jpg?t=1657283667",
    "Slug": "slot-shots-pinball-collection",
    "Meta Title": "Slot Shots Pinball Collection: Jun 21, 2022, Pinblend Stu...",
    "Meta Description": "Looking for information on Slot Shots Pinball Collection? Check out the release date (Jun 21, 2022), developer insights from Pinblend Studios, and a com...",
    "Alt Text Image": "Official header image for Slot Shots Pinball Collection game - Steam 1886290",
    "Canonical URL": "https://gusku.site/game/slot-shots-pinball-collection",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Slot Shots Pinball Collection\", \"description\": \"Looking for information on Slot Shots Pinball Collection? Check out the release date (Jun 21, 2022), developer insights from Pinblend Studios, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pinblend Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pinblend Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1886290/header.jpg?t=1657283667\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}