{
    "AppID": 304970,
    "Name": "SolidFace Parametric CAD Modeler 2D/3D",
    "Release date": "Dec 22, 2014",
    "About the game": "Part module SolidFace Sketch automatically creates parametric reference for modeling features that can be edited in a very simple and interactive way. This is an in-house developed module and fully integrated with the 3D module. SolidFace allows multiple bodies creation. A powerful tool helps in the development of dependent parts from a single part file. The parameterization allows not only an easy model editing, but also parts family creation that is an important issue in automating creation of variant models with the same constructive basis, such as fasteners, automotive, hydraulic and civil components. From a parametric part you can automatically generate dozens of others parts through parameters association, such as thickness, length, number and diameter of holes, color, material, information, text, etc. Assembly module Easy, accurate and effective, this module enables you to build assemblies using modeled parts and sub-assemblies. The automatic link between the modules facilitates the manipulation of assembly parts, thus any editing on a part or assembly, results in an automatic change in the assembly that references this component. You can build assemblies by inserting components created outside the assembly document; this is known as bottom-up assembling or if you need to construct a component that needs dimension references of some assembly components, you can create it, within the Assembly module. This operation is called in-context or top-down part creation. To facilitate the assembly process, the part elements can be enabled or disabled at any time without interfering the process of inserting (bottom-up) or creating (top-down) new components. Drawing module Besides the 2D draft capabilities explained in the SolidFace drawing product, you can also insert parts and assemblies into the drawing module in order to generate automatic orthographic, sections and details views. These views and dimensional annotations are created according to DIN and ANSI norms. Personalized by the designer. The 3D models views can be displayed in several model styles. The sections or details views are automatically created and aligned with the base view. Another advantage of the automatic link between the modules is the ability to copy and paste 2D geometric entities to the 3D Sketch module in order to use it as reference geometry to 3D features operations like extrude, revolve, etc. Exploded view An exploded view is a diagram, picture or technical drawing of an object, that shows the relationship or order of assembly of various parts. This allows the components (parts and sub-assemblies) to be visualized with defined displacements. The exploded view can be enabled or disabled at any time of the project creation. 3D Direct modeling Interact directly with the geometry of the model. Manipulate it by pushing, pulling, or twisting. Keeping the steps that create the final model, direct modelling allows the features geometry to be parametric modified by editing the feature used to create the new faces. 2D/3D Movement simulation One of the many capabilities of logical conditions is to enable the system to detect the collision of components assembly. The collision or the simulation process can be aborted and analyzed at any time. This makes possible not just a simple mechanism video demonstration but also a real-time movement simulation. The parameterization capability is one of the greatest advantages of SolidFace and it is present in all design steps. 3D Motion simulation is no different; the simulation is updated simultaneously with the movement. Another important capability is the simulation of 2D mechanisms, which can be performed either in 2D drawing or in 3D sketch module. Product specification Part module; Sketch module; Assembly module; Drawing module; Exploded view; Communication with other applications through the Windows ® clipboard (Clipboard); Communication with other CAD software via standard X_T®, X_B®, DWG®, DXF®, BMP, etc; 3D history construction tree and direct command editing; Associative dimensioning and fully adapted to a number of standards; Geometric operations and editing through direct entity or feature tree selection; Parametric and associative geometric construction references such as midpoint, center of arcs and circles, endpoint, etc; Creation of complex geometries such as cams, gears etc; 3D features construction such as Extrude, Revolve, Loft, Sweep, etc; 3D family of parts creation using CSV (Excel files association) or TXT table files; Configurable toolbars; Possibility of managing multiple projects simultaneously (multiple instances); The graphics screen can be divided up to 16 view windows, allowing the visualization of several project details; Print Preview; 3D and PDF® printing compatibility; Local and global variables; Definition of parametric variables via commands, questions, or variable tables; Logical conditions If-then-else; Parametric generation of bill of materials with associative link with Excel ® and Access ®;",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/304970/header.jpg?t=1447362085",
    "Price": 0.0,
    "Developers": "SolidFace Technology Inc.,Oscar L.",
    "Publishers": "SolidFace Technology Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/304970/ss_12edd3c26a0b04fd6c5c2500462aca9c848ced75.1920x1080.jpg?t=1447362085,https://cdn.akamai.steamstatic.com/steam/apps/304970/ss_cd9c1af77f2e6aa114435cfdf0ffab5f53fc44a1.1920x1080.jpg?t=1447362085,https://cdn.akamai.steamstatic.com/steam/apps/304970/ss_d7dde6faac414804e5945930b5633bc5313ca89e.1920x1080.jpg?t=1447362085,https://cdn.akamai.steamstatic.com/steam/apps/304970/ss_e7b35e149ebffce9a87215552a23075e856ab933.1920x1080.jpg?t=1447362085,https://cdn.akamai.steamstatic.com/steam/apps/304970/ss_ab87f6efeddd7c29ac249397b8e4b8352147f76a.1920x1080.jpg?t=1447362085",
    "Slug": "solidface-parametric-cad-modeler-2d-3d",
    "Meta Title": "SolidFace Parametric CAD Modeler 2D/3D: Dec 22, 2014, Sol...",
    "Meta Description": "Looking for information on SolidFace Parametric CAD Modeler 2D/3D? Check out the release date (Dec 22, 2014), developer insights from SolidFace Technolo...",
    "Alt Text Image": "Official header image for SolidFace Parametric CAD Modeler 2D/3D game - Steam 304970",
    "Canonical URL": "https://gusku.site/game/solidface-parametric-cad-modeler-2d-3d",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SolidFace Parametric CAD Modeler 2D/3D\", \"description\": \"Looking for information on SolidFace Parametric CAD Modeler 2D/3D? Check out the release date (Dec 22, 2014), developer insights from SolidFace Technolo...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 22, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"SolidFace Technology Inc.,Oscar L.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SolidFace Technology Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/304970/header.jpg?t=1447362085\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}