{
    "AppID": 485980,
    "Name": "Syrian Warfare",
    "Release date": "Feb 21, 2017",
    "About the game": "This war has been going on for a long time, and it's hard to say when it will be over. We got so used to it that news from Syria has become trivial. We've even already forgotten how it all started, and where the roots of the terrible terror lie – the terror that swept across Europe in recent years. Syria is all over the news, and it's become a subject of many documentaries. We, however, want to show the story through the lens of the game and don't let the word 'game' mislead you. This game does not claim to be a history lesson, but it shows the course of the war in all its seriousness through the major milestones, from the first days till the latest important victories over terror. What kind of a game is it? Syrian Warfare is a real time strategy with a high degree of realism. This game is not about a base construction or units production. The player will have to determine their forces characteristics before they go into action. And during the mission, they would be able to select reinforcements in order to support the troopers. The troops and machinery crews move from mission to mission and gain experience, which helps them increase their effectiveness. Trophies captured by the player on the battlefield can be used throughout the whole campaign. Importantly enough, there are no «life bars» for vehicles in the game. Damages are calculated by taking into account the protection module and the power of adverse factors. Inflicted damages affect the functioning of the module. In the battlefield, it is impossible to repair the armor, but one can repair the modules by using a limited stock of spare parts. Ammunition and fuel are also limited. A system of high-quality physical demolition of buildings and other objects is used in the game (it does not only look spectacular, but it has a serious influence on the tactics during the missions, especially in urban areas). The game has a wide set of tactical possibilities: The storming of buildings, usage of smokescreens, infantry lift by helicopters and APC/IFV, air strike calls, capturing of trophy weapons and equipment, usage of heat flares and active defense complexes. And of course the story itself. We will try to show the conflict, not from a point of view of a general, located somewhere at the ‘top’. No, it will be a story of a man, who lived in the country that descended into hell. A story of struggle, loss and regained hope.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/485980/header.jpg?t=1612267460",
    "Price": 13.99,
    "Developers": "Cats Who Play",
    "Publishers": "Cats Who Play",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/485980/ss_c0ec90da42332461bec5b80e07ad75ae22ccd6c9.1920x1080.jpg?t=1612267460,https://cdn.akamai.steamstatic.com/steam/apps/485980/ss_d6649f48715aa297f73bcb1f1ccec2ad5cad8bff.1920x1080.jpg?t=1612267460,https://cdn.akamai.steamstatic.com/steam/apps/485980/ss_439e2a8227cf58e2a25c44ab64ea4d97fb2fc919.1920x1080.jpg?t=1612267460,https://cdn.akamai.steamstatic.com/steam/apps/485980/ss_41e7c459c182f3e4be77caa4c8e7d09cdfae4707.1920x1080.jpg?t=1612267460,https://cdn.akamai.steamstatic.com/steam/apps/485980/ss_3b01aef2703fd0a03bd82cb0e45b1adc3c21b239.1920x1080.jpg?t=1612267460,https://cdn.akamai.steamstatic.com/steam/apps/485980/ss_f00828387cd8b50bddb44f306ccd70c85fa4dc5b.1920x1080.jpg?t=1612267460,https://cdn.akamai.steamstatic.com/steam/apps/485980/ss_aa0e68885a0d44f053107611929f29ce2f8e7eee.1920x1080.jpg?t=1612267460,https://cdn.akamai.steamstatic.com/steam/apps/485980/ss_51336be73801618641e71b01f4b9ed2956c77ecc.1920x1080.jpg?t=1612267460,https://cdn.akamai.steamstatic.com/steam/apps/485980/ss_74b9916de400bd66993faddcb7fc013cc7871a5f.1920x1080.jpg?t=1612267460",
    "Slug": "syrian-warfare",
    "Meta Title": "Syrian Warfare: Feb 21, 2017, Cats Who Play and Full Over...",
    "Meta Description": "Looking for information on Syrian Warfare? Check out the release date (Feb 21, 2017), developer insights from Cats Who Play, and a complete game summary.",
    "Alt Text Image": "Official header image for Syrian Warfare game - Steam 485980",
    "Canonical URL": "https://gusku.site/game/syrian-warfare",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Syrian Warfare\", \"description\": \"Looking for information on Syrian Warfare? Check out the release date (Feb 21, 2017), developer insights from Cats Who Play, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 21, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cats Who Play\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cats Who Play\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/485980/header.jpg?t=1612267460\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}