{
    "AppID": 358000,
    "Name": "The Curse of Nordic Cove",
    "Release date": "Apr 23, 2015",
    "About the game": "From Indie Developer, On The Level Game Studios: We at On The Level Game Studios are honored and thankful to Valve and our friends for all of your efforts in getting our first game, The Curse of Nordic Cove, through the Greenlight process. Originally released in a non-Steam version around April of 2013. Please note that our second game, Boo Bunny Plague, already received the Greenlight in mid-2014 and has been on Steam. We are currently hard at work on our third game. STORY: It all started in Nordic Cove, a small hamlet in the fictional state we all know today as “New York”. Once called New Hamburgerstand in the early A.D. years, it flourished with fur trades and Bacon Cheeseburgers. It was also home to the gravesite of a crusty, sorcerous, evil-naughty-person; the Viking warlord “Helfdane the Terrible!” Helfdane’s tyranny of the New Land was halted during these very rough times due to bad planning, and terrible hygiene. Today, Bacon Cheeseburgers are still at an all-time high, and New North America is on the verge of being historically ♥♥♥♥♥-slapped. An archaeologist cork-sniffer named Dr. Howard Bre, and his lovely assistant, Kayte Sparo have disturbed this ancient gravesite. Thus, fulfilling a curse which reanimated Helfdane and his minions to rip the life force from beings starting with Nordic Cove! Holy crap! Kayte’s boyfriend, Paulie Chops, must find the help he needs to turn this around, stat! This is their date night after all. Don’t act like you’ve not had a night like this. Alright! YOU deal with that Helfdane thing. We’re getting Bacon Cheeseburgers and staying warm. We’ll be cheering for you! GAMEPLAY: The Curse of the Nordic Cove is a game, by gamers, for gamers. There are familiar elements of gameplay for all gaming fans from First Person Shooter, Sports, Puzzle-Solving, to Driving, Strategic Shooting and Stealth and Dungeon Crawling. This and more thrown at you, the player, in an eccentric and thrilling Survival-Horror game like no other. Using your choice of controls being Keyboard/Mouse combo or Gamepad, you maneuver the various characters through each level to complete a task and survive. All along the way, each character you control encounters enemies of various forms that will not hesitate to attack. There are obstacles that you need to figure out how to overcome. More information at . You can connect to our social networking pages from there!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/358000/header.jpg?t=1572317067",
    "Price": 0.99,
    "Developers": "On The Level Game Studios",
    "Publishers": "On The Level Game Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/358000/ss_75bdcb063135beb0acdb144572289afd7eda7ab2.1920x1080.jpg?t=1572317067,https://cdn.akamai.steamstatic.com/steam/apps/358000/ss_4029bb09c1d21949d7ba98505b390c82d2dd3ab3.1920x1080.jpg?t=1572317067,https://cdn.akamai.steamstatic.com/steam/apps/358000/ss_61fbbcd77f0a2f0706bec5083e6d906373211b5f.1920x1080.jpg?t=1572317067,https://cdn.akamai.steamstatic.com/steam/apps/358000/ss_e32f25b7fdbbfef41f7baa90e1ca501980009d17.1920x1080.jpg?t=1572317067,https://cdn.akamai.steamstatic.com/steam/apps/358000/ss_eb778892bb0737056a86f64de46200b0e9190824.1920x1080.jpg?t=1572317067,https://cdn.akamai.steamstatic.com/steam/apps/358000/ss_661a013dc431c6c9443792d95d265b38c88a1e15.1920x1080.jpg?t=1572317067,https://cdn.akamai.steamstatic.com/steam/apps/358000/ss_497ca73a2f0ace5668d955cb3db5ed12c921fdc3.1920x1080.jpg?t=1572317067,https://cdn.akamai.steamstatic.com/steam/apps/358000/ss_9d7949a509f30e772d11ce6101616f33a19d4a99.1920x1080.jpg?t=1572317067",
    "Slug": "the-curse-of-nordic-cove",
    "Meta Title": "The Curse of Nordic Cove: Apr 23, 2015, On The Level Game...",
    "Meta Description": "Looking for information on The Curse of Nordic Cove? Check out the release date (Apr 23, 2015), developer insights from On The Level Game Studios, and a...",
    "Alt Text Image": "Official header image for The Curse of Nordic Cove game - Steam 358000",
    "Canonical URL": "https://gusku.site/game/the-curse-of-nordic-cove",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Curse of Nordic Cove\", \"description\": \"Looking for information on The Curse of Nordic Cove? Check out the release date (Apr 23, 2015), developer insights from On The Level Game Studios, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 23, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"On The Level Game Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"On The Level Game Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/358000/header.jpg?t=1572317067\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}