{
    "AppID": 1732210,
    "Name": "Tile Runner",
    "Release date": "Sep 28, 2021",
    "About the game": "Tile Runner, A 3D parkour game. 10 Levels, with increasing difficulty. Can you beat all 10? Good Luck !!!!!!!! Notes: If your mouse doesn't work when playing, try changing the sensitivity in the options. This game was made by me and my twin brother, and we are now seniors in high school. I had a lot of fun making this game, and I hope you have fun playing it :D 10/28: I noticed a lot of people have been saying the difficulty curve between levels is too high, so to make it easier, I will give hints for each level below. Level 1: Pretty Straightforward Level 2: If you are struggling at the jumps toward the end of the level (where it starts to get narrow), hug the inside walls to take the shortest path to the next platform. At the end of the level, the last jump is an option between left and right, MAKE SURE TO GO LEFT. Level 3: The dropper is introduced in this level, where you maneuver the character in order to make it into the opening below. In the dropper at the end of the level, try to go through the edges of the holes instead of the center in order to be able to get through the following holes. Level 4: Relatively straightforward, but you have to strafe a lot in the air, as well as do 360's. Try to get used to the movement mechanics. Level 5: The first jump is pretty difficult, so be precise in jump timing and movement in the air. After this jump, turn right immediately and look down to get to the next platform. Remember to strafe in the air if you feel you are jumping too far. Level 6: Path gets pretty narrow from here, so if your sensitivity isn't already high, increase it so that you are able to change direction quickly. Level 7: Strafing in the air is important to maneuver through the opening. Move very precisely during the 3rd jump to reach the next platform. During the 5th and 6th jump, look back at where you jumped from while in the air to see where to go. Near the end of the level, there is a large platform where you are able to move freely. After this point, go to the next jump area, hug the wall and start hugging the other side of the wall you just jumped over. Keep doing this. Level 8: Be very quick and precise in movements. Near the end of the level, there is a large room. Hug the large chunks of wall in front of you during jumps. Level 9: In the beginning of the level, do a 180 in the air and try to get above the initial spawn room. The level is extremely narrow and it is hard to react to new obstacles, so try to memorize them as you die so you know where to go beforehand. Level 10: Pretty straightforward where to go, but very difficult. If you have any more questions about where to go or what to do, put it in the reviews/discussions and I'll try to answer them. Good Luck! : )",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1732210/header.jpg?t=1635480249",
    "Price": 0.0,
    "Developers": "Ishaan Kale,Mihir Kale",
    "Publishers": "Ishaan Kale,Mihir Kale",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1732210/ss_84a317826f9e55ec383cce45720bc880f88f0e23.1920x1080.jpg?t=1635480249,https://cdn.akamai.steamstatic.com/steam/apps/1732210/ss_9cb187796c877b67b4bafeeef0c2724b74de5001.1920x1080.jpg?t=1635480249,https://cdn.akamai.steamstatic.com/steam/apps/1732210/ss_5aed40a68d2ebfe0586689ad9b26024d5959b2e9.1920x1080.jpg?t=1635480249,https://cdn.akamai.steamstatic.com/steam/apps/1732210/ss_469949762461a9e24035e9ced0278233708b98b5.1920x1080.jpg?t=1635480249,https://cdn.akamai.steamstatic.com/steam/apps/1732210/ss_7257f3fbfdff8a9d163a9bf4f51a63f9fe8a60b7.1920x1080.jpg?t=1635480249,https://cdn.akamai.steamstatic.com/steam/apps/1732210/ss_26e9c969f85d6cd53feddc2b2eb7d57d57a97dc2.1920x1080.jpg?t=1635480249",
    "Slug": "tile-runner",
    "Meta Title": "Tile Runner: Sep 28, 2021, Ishaan Kale,Mihir Kale and Ful...",
    "Meta Description": "Looking for information on Tile Runner? Check out the release date (Sep 28, 2021), developer insights from Ishaan Kale,Mihir Kale, and a complete game s...",
    "Alt Text Image": "Official header image for Tile Runner game - Steam 1732210",
    "Canonical URL": "https://gusku.site/game/tile-runner",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tile Runner\", \"description\": \"Looking for information on Tile Runner? Check out the release date (Sep 28, 2021), developer insights from Ishaan Kale,Mihir Kale, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ishaan Kale,Mihir Kale\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ishaan Kale,Mihir Kale\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1732210/header.jpg?t=1635480249\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}