{
    "AppID": 661700,
    "Name": "心の闇の先に Trial VersionⅡ",
    "Release date": "Jan 15, 2018",
    "About the game": "【Works】 The genre of this work is sound novel. Unlike general games, living being set in a realistic life of the present age is drawn. The theme of the story is 'invisible wound, darkness of the heart.' Sound novel is like adding music and graphics to the novel, While playing, we will advance the game by reading the sentences displayed. What the player does is just to read the sentences that basically come up to the end, Even those who do not know the sound novel at all or those who have not played the game, It is a very easy-to-play game. Those who do not have the experience of playing the game or those who have less experience are hard to be attached to the game Although it may have the impression that it is, there is no difficult operation at all. I can understand Japanese to a certain extent, and click on a computer If you can do rudimentary operations, you can clear this game. Also, since this work is a trial version, if you can experience some of the content of the product version I have made it so that I can grasp the tendency and atmosphere of this work in general. Since you can play for free until the end, If you are interested, please try playing. I think that it will surely become possible to judge whether to engage with the product version or not. 【Synopsis】 The stage of the story is a real life in contemporary Japan. The theme of the story is 'invisible wound, darkness of the heart.' What is spoken is the story of a single boy. When I received my life in this world. When to live the world. Sometimes it is decided by ignoring the intention and hope of those who received life. Something different from the intention and hope of those who received life may be carried on the back. Abilities, appearance, parents, personality, qualities, accidents, congenital diseases, growing environments. They can not be freely chosen or replaced. Inequality that can not be changed that was carried on such a birth. There was no anti - unacceptable unreasonable fact. A long dark that must be experienced regardless of my will or desire. Unequal things that only the principal understands. An unreasonable fact that somehow never be treated carefully by others. Although they are different in shape from each other, Just being pushed into my heart, I have any person holding it. And living without such harsh suffering I'm starting to get down to the one I was sending. Spring in early puberty. Unexpectedly big darkness is born in my heart. The madness of the gear of life and mind by that darkness ... · · ·. The desire to keep living and staying in the real world. I will erase the motivation for such a life without mercy. No understanding, no connection, no motor nerves, no handle. Incompetence, lethargy, no interests indifference, days full of five body satisfaction. Withdrawal, depression, adult children, social phobia. Stupid, human distrust, crime, suicide. The real world is unfair. The existence which created life stuff. If it says that it is God, I will never forgive God. To destroy. Please disappear. But in the real world there is no one who will live his life instead. A man who is supposed to carry a handicap can not escape from the handicap. I will keep on handling handicap with handicap that I decided to carry on for the rest of my life. How easy will it be if you just wait and change? Or will someone manage to do someday? Is it fun to see the human being disappointed in the real world God? As expected after all, is it that you win with your own power? If so, what should I do? Is there no way to save it? I can not ask for help. Nobody can help us. The days that have only been idling do not go away. I can not make it back in time. So I decided to start again from here. Unconvinced. unacceptable. Change the energy of such hatred into courage. I want to keep changing. I want to keep shining. What is waiting for a boy who continued to resist in the darkness of the heart that can not see the end? At that time, what does the boy see and feel? 【Character】 - Main Character - · Akira (Akira) The main character of the story. Classes are basically painful, involve classmates in play, After school playing with acquaintance and ball, going to a candy store, Match against card games, play your favorite video game at home. A normal schoolboy boy sending such a life. However, on the boundary of an event .... - Sub character - · Morihara Mikari (Morihara Mikari) · Yusuke (Yuusuke) · Yoshida Minako (Yoshida Minako) · Sekiguchi (Sekiguchi) · Fujisawa (Fujisawa) · Matsuzaki (Matsuzaki) · Nishijima (Nishidanma) · Suzaki (Suzaki) · Ueno (Shukunon) · Kurihara (Kurahara) · Takada (Takada) · Atsushi Shinkawa (Shinkaku Atsushi) · Rie Sugawara (Rinae Suenaga) · Natsumi Ishi (Natsumi Shima) Ryota Funabashi (Funabashi Ryota) · Shingo Ueda (Ueda Shinko) · Tsukigawa (Takakawa) · Kaneko (Kaneko) · Asakura (Asakura) · Kawano (Kawano) other 【please note】 Although this work is a trial version, it is not a total playing time that ends in a short time. When trying to play at a stroke at night or late night, the possibility of going to lack of sleep is very high, The next day's lesson, exam, event, work, housekeeping, going out, club activities and other things will be hindered Since it is, we recommend that you refrain from playing this piece at once in the night or in the late night. BGM and SE (effect sound) flow during play, Please adjust the volume so as not to hurt your ears, please play with moderate volume. 【privacy policy】 This application does not collect personal information. Also, we will not transmit information externally. 【Production / Writing】 It's a Wonderful Life",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/661700/header.jpg?t=1516260437",
    "Price": 0.0,
    "Developers": "It's a Wonderful Life",
    "Publishers": "It's a Wonderful Life",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/661700/ss_9406366bc03ce8421760462da654e4288d0c1738.1920x1080.jpg?t=1516260437,https://cdn.akamai.steamstatic.com/steam/apps/661700/ss_75f607dcfc9e4168d3ddc3d6b2eed100fb661e1f.1920x1080.jpg?t=1516260437,https://cdn.akamai.steamstatic.com/steam/apps/661700/ss_e3a83964ec48b4b9fac2128f2a96c7674a181e14.1920x1080.jpg?t=1516260437,https://cdn.akamai.steamstatic.com/steam/apps/661700/ss_ddd34e2b76a3ed75367a03dab17b43bd1e60949c.1920x1080.jpg?t=1516260437,https://cdn.akamai.steamstatic.com/steam/apps/661700/ss_e2a33a408570765f04ea52bfdc0f45a850b56916.1920x1080.jpg?t=1516260437",
    "Slug": "trial-version",
    "Meta Title": "心の闇の先に Trial VersionⅡ: Jan 15, 2018, It's a Wonderful Lif...",
    "Meta Description": "Looking for information on 心の闇の先に Trial VersionⅡ? Check out the release date (Jan 15, 2018), developer insights from It's a Wonderful Life, and a comple...",
    "Alt Text Image": "Official header image for 心の闇の先に Trial VersionⅡ game - Steam 661700",
    "Canonical URL": "https://gusku.site/game/trial-version",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5fc3\\u306e\\u95c7\\u306e\\u5148\\u306b Trial Version\\u2161\", \"description\": \"Looking for information on \\u5fc3\\u306e\\u95c7\\u306e\\u5148\\u306b Trial Version\\u2161? Check out the release date (Jan 15, 2018), developer insights from It's a Wonderful Life, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"It's a Wonderful Life\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"It's a Wonderful Life\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/661700/header.jpg?t=1516260437\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}