{
    "AppID": 1302460,
    "Name": "Turbo Shot",
    "Release date": "Jan 13, 2022",
    "About the game": "Turbo Shot combines a puzzle-filled top-down adventure with exciting gun-based combat that plays out in regular seasons of free-to-play single player and PvP content. On the remote world of Pimlott-4, everyone works for Stinchcorp. But when siblings Skylar and Jin discover that the evil Dr. Stinchcomb is using the company as a front for kidnapping Blerphs and exploiting the natural environment, they know they have to fight back! Join them as they escape Stinchcorp and join a group of freedom fighters who work with the Blerphs. These adorable creatures have long guarded their home and evolved a range of abilities that help them adapt to Pimlott’s unique environments. With their help, you’ll harness the power of the Blerphs, discover new tech, explore the world and fight back against Dr. Stinchcomb and his army of bots! SINGLE PLAYER CAMPAIGN Play an exciting single player campaign that is constantly growing. Each level is broken into a series of challenges containing enemies, environmental hazards, puzzles and boss fights. Overcome each level’s many challenges and meet Turbo Shot’s colorful cast of characters as the story unfolds. New chapters added regularly! ONLINE PVP Fight online against 10 players on a large, danger-filled map in PvP mode. Race to be the first to collect 50 crystals while dealing with the hazards the map presents as well as the threat of your fellow players. Collect enough crystals, race to the center of the map and be the first player to power up the teleporter and warp out with your crystals to win! UNLOCK AND UPGRADE Turbo Shot features a ton of upgradable power-ups, guns and characters. Power-Ups are littered throughout the game world for you to pick up, improving your fire rate or giving you a shield. Unlock a variety of weapons and characters with their own unique attributes, then upgrade and max out their potential! WEEKLY CONTENT Play new limited time events each week! Earn prizes for completing unique challenges! SEASONAL CONTENT More is in store with each new season of Turbo Shot! New seasons drop regularly adding: New single player campaign chapter New enemies and environments New weapons New characters New PvP maps and modes Refreshed Turbo Pass Game Features In-app Purchases",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1302460/header.jpg?t=1642087890",
    "Price": 0.0,
    "Developers": "Wizard Games Inc",
    "Publishers": "Wizard Games Inc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1302460/ss_1fd43cb0b6884b9b9062ea34d787b3f2529e0225.1920x1080.jpg?t=1642087890,https://cdn.akamai.steamstatic.com/steam/apps/1302460/ss_f2589991df479d779982abb2be1e1f3c1e0c0539.1920x1080.jpg?t=1642087890,https://cdn.akamai.steamstatic.com/steam/apps/1302460/ss_51b15dc9bc1a597ea3cbc9eacffb544e2936d439.1920x1080.jpg?t=1642087890,https://cdn.akamai.steamstatic.com/steam/apps/1302460/ss_63c2b8775cfc6052071bbf212d3331de21172f4f.1920x1080.jpg?t=1642087890,https://cdn.akamai.steamstatic.com/steam/apps/1302460/ss_594a71082e3dd4d0947fb812ecbfed189a798167.1920x1080.jpg?t=1642087890",
    "Slug": "turbo-shot",
    "Meta Title": "Turbo Shot: Jan 13, 2022, Wizard Games Inc and Full Overview",
    "Meta Description": "Looking for information on Turbo Shot? Check out the release date (Jan 13, 2022), developer insights from Wizard Games Inc, and a complete game summary.",
    "Alt Text Image": "Official header image for Turbo Shot game - Steam 1302460",
    "Canonical URL": "https://gusku.site/game/turbo-shot",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Turbo Shot\", \"description\": \"Looking for information on Turbo Shot? Check out the release date (Jan 13, 2022), developer insights from Wizard Games Inc, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wizard Games Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wizard Games Inc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1302460/header.jpg?t=1642087890\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}