{
    "AppID": 404530,
    "Name": "Voxel Turf",
    "Release date": "Sep 13, 2017",
    "About the game": "Voxel Turf is a block based city builder/action adventure game. Build cities or destroy them. Start businesses or rob them. Nurture your citizens or subjugate them. Build a real estate empire, or perhaps just drive around and blow stuff up. Its your choice! Voxel Turf allows you to be the force of benevolence or the agent of chaos in a city of your creation. - Have you ever played an open world game and thought 'if only I could build something here?' - Or a city builder and wanted to drive around and interact with your creation? - Or even a building game and thought 'if only these buildings would come to life?' If so then Voxel Turf is the game for you! Live in a City of Your Own Creation - Build sprawling cities with either the over 50 prebuilt buildings, or build your own in-game! - Make amazing structures with over 15,000 types of blocks in over 100 categories. - Or live in and modify a procedurally generated city Get Rich or Die Trying - Earn cash from either completing missions, crime, or managing a real estate empire. - Establish protection rackets to make money Some of the missions revolve around: - Being a hired revolutionary who fights the local authorities for cash - Participating in street races for money - Making a career though stealing vehicles for profit - Eliminating bandits and protecting civilians from bandit attacks - Be a specialist architect who draws an income from making custom buildings Unleash Chaos - Destroy and vandalise areas with explosives, weapons and tanks. - Ride a wide range of vehicles including cars, a tank, helicopters and even a rideable shopping trolley! Enjoy Multiplayer - Multiplayer over LAN or Internet - Most missions can be done in Co-Op - Cooperate with friends to build a city, or compete and undercut each other Fight For Territory - Explore and raid bandit bases for loot - Fight Turf Wars against other factions and players to gain control over parts of the city - Build bases and defend your territory from attack - Engage in diplomacy with other factions in order to gain power or undermine others Unleash Creativity - The entire world is block based, so you can create and destroy everything. - Decorate blocks with paint and decals - Various non-cube construction blocks, including ramps, stairs, steps, allowing you to build things like pitched roofs and ultimately more realistic looking buildings. - Build intricate contraptions using switches, mechanisms and circuits - Custom player-built buildings can be saved as templates, and be placed like normal buildings - Templates can be synced across a network Character Customisation - Over 50 player skins - Support for custom player skins - 10 hats for your character to wear, also wearable body armour. - Weapons are customisable too! Attach weapon mods to weapons to change their appearance and behaviour. Make shotguns explosive, make your pistol armour piercing or your SMG scoped! Modding Support - Steam Workshop integration - Lua Scripting for easy moddability with a C++ scratch-coded base game engine for performance Game Modes Turf : Start in a procedurally generated city, and do what you want. Build, do missions, do crime, do whatever! Build : Start on a blank map and build whatever you want with unlimited blocks. Turf Zero : Start on a blank map and build a city from scratch. Scavenge resources from bandit bases. Strategy : Start in a procedurally generated city with 16 warring factions. Use diplomacy and warfare to gain control over the entire city!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/404530/header.jpg?t=1568446688",
    "Price": 7.99,
    "Developers": "L Twigger",
    "Publishers": "L Twigger",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/404530/ss_48d1c0ff0fe729285ad98cca29fc7ade45a82f41.1920x1080.jpg?t=1568446688,https://cdn.akamai.steamstatic.com/steam/apps/404530/ss_a5fdede0ac72fb91c81a8e3c0c0588504e36a8ad.1920x1080.jpg?t=1568446688,https://cdn.akamai.steamstatic.com/steam/apps/404530/ss_a01761e5cf55b421a0178c1e38be024c4ec0372d.1920x1080.jpg?t=1568446688,https://cdn.akamai.steamstatic.com/steam/apps/404530/ss_aa20c62dfd501950f43550939032f16b1cf9362a.1920x1080.jpg?t=1568446688,https://cdn.akamai.steamstatic.com/steam/apps/404530/ss_4fb9ffaa5298498de795b62b21c6f5ffbb45f1fb.1920x1080.jpg?t=1568446688,https://cdn.akamai.steamstatic.com/steam/apps/404530/ss_0f082710db1d4a38db69d42ccea691f39f36f91b.1920x1080.jpg?t=1568446688,https://cdn.akamai.steamstatic.com/steam/apps/404530/ss_c7b89fbc8545e0204713b9969d3490ca9fc1aa37.1920x1080.jpg?t=1568446688,https://cdn.akamai.steamstatic.com/steam/apps/404530/ss_c48911d4e5cf252bd10df656c4458bf5457c71de.1920x1080.jpg?t=1568446688,https://cdn.akamai.steamstatic.com/steam/apps/404530/ss_e688c4200df43bd9b8a22d23b317ee983972ca00.1920x1080.jpg?t=1568446688,https://cdn.akamai.steamstatic.com/steam/apps/404530/ss_17d0180d60c5ade9f64f49efa3db72fc1b8cf86e.1920x1080.jpg?t=1568446688,https://cdn.akamai.steamstatic.com/steam/apps/404530/ss_5bc63dffd2e2b52e6cf2897db73f16d4add5fb04.1920x1080.jpg?t=1568446688,https://cdn.akamai.steamstatic.com/steam/apps/404530/ss_7c52d06e7f75d576379daf86f79248d5b75c093d.1920x1080.jpg?t=1568446688,https://cdn.akamai.steamstatic.com/steam/apps/404530/ss_0663f5b483337d79faac51b27fa513bc27a335c1.1920x1080.jpg?t=1568446688",
    "Slug": "voxel-turf",
    "Meta Title": "Voxel Turf: Sep 13, 2017, L Twigger and Full Overview",
    "Meta Description": "Looking for information on Voxel Turf? Check out the release date (Sep 13, 2017), developer insights from L Twigger, and a complete game summary.",
    "Alt Text Image": "Official header image for Voxel Turf game - Steam 404530",
    "Canonical URL": "https://gusku.site/game/voxel-turf",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Voxel Turf\", \"description\": \"Looking for information on Voxel Turf? Check out the release date (Sep 13, 2017), developer insights from L Twigger, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"L Twigger\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"L Twigger\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/404530/header.jpg?t=1568446688\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}