{
    "AppID": 1026420,
    "Name": "WARSAW",
    "Release date": "Oct 2, 2019",
    "About the game": "Use everything at your disposal to help a team of accidental heroes survive the onslaught in their home city and overcome tremendous odds stacked against them in this tactical rpg set on the streets of occupied Warsaw of 1944. LEAD YOUR TEAM Enlist the help of men and women, soldiers and civilians, the young and the old and use their unique skills, expertise and abilities to challenge the enemy. Meet people from all walks of life united in their attempt to overthrow the German occupiers. OWN YOUR SKILLS Create a mix of versatile skills that will allow you to flank your enemies, detonate obstacles, snipe stragglers and push or pull enemies into the area where your carefully planned attacks deal the most damage. Make sure your Heroes are stacked with the right weapons salvaged, obtained from the enemy or air drops. Develop them using medal system to unlock a unique set of skills, and construct the best team of all the Heroes – both joining the forces and enlisted in the Hideout in exchange for the collected resources. MAKE YOUR MOVES Make your way on the carefully reconstructed map of Warsaw of 1944, encountering both historical and random events that immerse you in the story of the city that valiantly stood up to the Nazi oppressor. Patrol the streets fulfilling the orders issued by HQ, discover facts about the past of your Heroes and decide when to fight, and when to withdraw. SURVIVE THE UPRISING Learn all the strengths and weaknesses of your assigned team. Find the best combination of personnel, weapons and skills to overcome more and more lethal enemies thrown to quell the uprising. Fight your way through infantry, specialized troops, heavily armed units, special ordnance and armored vehicles. Make your choices in the many story infused events and live with their results. And don’t let the ever increasing ferocity and intensity of forces thrown your way stop you from your one goal. Turning your Heroes into survivors. Not victims. MAIN FEATURES Turn-based tactical rpg with characters of varying classes, and with skill and resource management in immersive WWII setting A deep tactical combat system with multitude of complementing skills, weapons and character abilities Character stories and backgrounds delivered through gameplay as well as numerous historical and fictional events happening under specific game’s circumstances Incredible replay value due to non-linear gameplay",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1026420/header.jpg?t=1657716289",
    "Price": 23.99,
    "Developers": "Pixelated Milk",
    "Publishers": "Pixelated Milk,gaming company",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1026420/ss_6a8fc6b2c001cf47ee616159e0b9038ec7bc5866.1920x1080.jpg?t=1657716289,https://cdn.akamai.steamstatic.com/steam/apps/1026420/ss_df4fa138bce054ecf5b5364f425a5883f3d2a14d.1920x1080.jpg?t=1657716289,https://cdn.akamai.steamstatic.com/steam/apps/1026420/ss_a2b404c25b07dd62106c14e7db330e5af778564e.1920x1080.jpg?t=1657716289,https://cdn.akamai.steamstatic.com/steam/apps/1026420/ss_68564ec1bb8081be3d2cc89e36a00694370b6f6a.1920x1080.jpg?t=1657716289,https://cdn.akamai.steamstatic.com/steam/apps/1026420/ss_d53b8acaaa4fdc3af645c644c3be2cffcd2620bf.1920x1080.jpg?t=1657716289,https://cdn.akamai.steamstatic.com/steam/apps/1026420/ss_976f0a68b1c4511162e59732014e69afb3680655.1920x1080.jpg?t=1657716289,https://cdn.akamai.steamstatic.com/steam/apps/1026420/ss_f0424f82e2023ce101e6e04530d895169a300095.1920x1080.jpg?t=1657716289,https://cdn.akamai.steamstatic.com/steam/apps/1026420/ss_dd10c156c29304af6ec37f06923e023b7a3eec57.1920x1080.jpg?t=1657716289",
    "Slug": "warsaw",
    "Meta Title": "WARSAW: Oct 2, 2019, Pixelated Milk and Full Overview",
    "Meta Description": "Looking for information on WARSAW? Check out the release date (Oct 2, 2019), developer insights from Pixelated Milk, and a complete game summary.",
    "Alt Text Image": "Official header image for WARSAW game - Steam 1026420",
    "Canonical URL": "https://gusku.site/game/warsaw",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"WARSAW\", \"description\": \"Looking for information on WARSAW? Check out the release date (Oct 2, 2019), developer insights from Pixelated Milk, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 2, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pixelated Milk\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pixelated Milk,gaming company\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1026420/header.jpg?t=1657716289\", \"offers\": {\"@type\": \"Offer\", \"price\": 23.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}