{
    "AppID": 378360,
    "Name": "Ymir",
    "Release date": "Mar 16, 2019",
    "About the game": "Ymir is a 4X multiplayer strategy game combined with a city builder where each player develops a civilization of Pigmen starting at the stone age. The game is divided in 2 main interfaces : a worldmap view and a regional view. Each world tile matches a unique procedurally generated isometric zone that can be explored, settled and built on by players. In each one players can find random resources such as ores , animals or plants depending on the climate, relief and vegetation of the region. Features Pigs with clothes. Multiplayer on local or persistent servers. Complex socio-economic simulator for a challenging city-building experience on its own. Technological evolution with hundreds to techs, from the stone age to post-iron age. Fully procedural worlds where each region is random and unique. 7 biomes, each one with its own specific resources to encourage player-trading. Advanced diplomatic and economic tools to setup treaties ( right of passage, taxes, payments, trade agreements... ) and trade routes between players. Real-time battles. WILL remain free of any pay-to-win . Economy No direct control over population and economy: They breed, age, work and buy things according to the simulation. Population divided in social classes with specific incomes, purchasing power and revenues. Dynamic resources prices based on supply/demand, rarity and production costs. Even player consumed resources are taken into account: materials for buildings have to be bough at their market prices, generating incomes to the producers and affecting the economy. A simulator instead of a set of independent game rules : all variables and actions influence each other in sometimes unpredictable ways that makes things frustratingly challenging. Producing too much of something can be as damaging as not enough making the logic of the game quite different from classic management games. ( ex: instead of having positive effects, distributing a new resource can actually destabilize your economy if you're not careful ) Military Real-time battles are not instantiated and actually take place in your cities. Build and customize your fortifications with walls, bridges, gates, stairs, towers and battlements. With the terrain tools, modify the terrain heights to take maximum advantage of natural defenses like cliffs and hill tops. Water forces troops to embark and cross with slow vulnerable rafts: dig canals around your forts, secure your bridges or build a citadel on a river-island with fortified bridges. A Strategic-tool allows players to design their local defensive strategy in each one of their cities in case of attack: creating defensive zones, setting troops initial deployment positions and setting their behavior in battle. Battles are not instantaneous and belligerents can send reinforcements while a battle is still in progress. Battles can include unlimited 'teams' at the same time, each one fighting according to its allegiances. Battle troops during a battle are all AI controlled ( so that battles can happen independently of the player's presence ). Dozens of unit types including mounted camels, elephants and armored mammoths. Main game modes Real-time mode : a 'classical' mode to be played alone or with a few friends, meant to be played with the permanent presence of all players and to be stopped/continued over several playing sessions. Persistent mode : a more 'MMO' mode where the game server is to be left running 24/7 at all times even when players are offline and where actions take much more time than in the real-time mode. Meant to be played with the maximum number of players on a day-to-day basis, with games lasting several weeks. IMPORTANT This game is a one-man project: development is slow. This game is likely to forever remain an experimental work-in-progress and to never reach the quality, stability and optimization of a finished product: buy it only if you think it's worth it NOW, and not based on future expectations. Playing solo is possible, but the main focus of this game is multiplayer. The game is available in more languages than English, but localization is done by the community and might be partial and incomplete.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/378360/header.jpg?t=1576782152",
    "Price": 34.99,
    "Developers": "Thibaud Michaud",
    "Publishers": "Thibaud Michaud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_22da41290897961174061cdc57f26ad7fb6bf757.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_d8c014cdd1ce3f04be51970d385f8db509a8128e.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_f5880dd326249efa9324fe79a4f33ebfcd5e45b2.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_758f3e1416a884902843251d49b0dc6def59af0e.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_7a1aeda33713a33426abaaebfe7dad4f6f936063.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_38380234469d636ab5353319c3a18231f81dda9c.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_6f533aaf3173b8ca6c44e6d22c694632177a58c3.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_4ce9d8f810296238bb05ce408e162e479250ab18.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_ae7a71a141adf672d7c358e410d5d99b848c22d7.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_148138b946974a4b0d86f3a619b6b01f1159d2a7.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_177b14440b201e4f99ab621dd6cd22ddfc17b24a.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_bc6b10f6a81c8906ae40efba0b94136e3d891f43.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_824d7038fc7dcb9c20cb3d4c3b7ad8375ea84207.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_d947e7a95999be0ce04d5318fe545932ca919f61.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_308702bdbf8161d09793e20d27cc6922e1269db4.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_14f56a26f3c36ddab7901e170744599cd96e5882.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_0e637330160c80683c9588f4a7ffc6b679388487.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_5d644b7e58eff0570a31319cffb0910dce7f5cb0.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_9309eed30297e65e32979c8693453e9eda1707aa.1920x1080.jpg?t=1576782152,https://cdn.akamai.steamstatic.com/steam/apps/378360/ss_6887356bd76abf941a1e74798dd07d303a7ebd33.1920x1080.jpg?t=1576782152",
    "Slug": "ymir",
    "Meta Title": "Ymir: Mar 16, 2019, Thibaud Michaud and Full Overview",
    "Meta Description": "Looking for information on Ymir? Check out the release date (Mar 16, 2019), developer insights from Thibaud Michaud, and a complete game summary.",
    "Alt Text Image": "Official header image for Ymir game - Steam 378360",
    "Canonical URL": "https://gusku.site/game/ymir",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ymir\", \"description\": \"Looking for information on Ymir? Check out the release date (Mar 16, 2019), developer insights from Thibaud Michaud, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 16, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Thibaud Michaud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Thibaud Michaud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/378360/header.jpg?t=1576782152\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}