{
    "AppID": 835720,
    "Name": "2260 VR",
    "Release date": "Aug 7, 2018",
    "About the game": "games introduce The holy land is a science fiction VR game designed by an imaginary engine based on an illusion engine. You will play a warrior in the future and compete for resources with the enemy in the future space station. In the game you can use dozens of science fiction weapons such as laser guns, laser projectiles. Every round you will take on the mission of rejuvenating humanity to compete for resources. game background In 2260, the earth's resources were depleted. In order to survive, the space for human development extends to outer space. In outer space, through the continuous exploration of a team of people and horses, a new resource planet, the holy land, new discoveries have brought new hopes, and the development of human beings is continued. However, the good news is not long, and the fear of resources has split the human race into two factions. In the holy land, they have begun a new round of competition. game mode The game is a VR shooting game, The player will use the VIVE handle in his hand to transmit the central platform in the game, pick up the explosive on the center platform, then install the explosive on the enemy's resource tower, and then detonate the explosive and blow up the resource tower, and install 4 explosives and successfully blow up the other's resource tower. The game will have three modes, free mode, team mode, team mode. Each pattern is 15 minutes. Free mode: in this mode, the number of players is 16v16. Players should destroy the number of opponents as much as possible, and who will win the final attack. Team mode: in this mode, players play the game in a cooperative way with 4V4 team. The game begins with five passes and six will be chopped, go to the central energy point to open the center of energy, and get the necessary energy to return to the birth point, and finally who wins more energy than who wins. Team mode: the player will pick up the dynamite from the central platform and install the explosive on the other's resource tower. The player will first install 4 explosives and the player who successfully exploits the other's resource tower will win. There will be two maps, warehouses, and space stations. The warehouse is suitable for free mode and team model. The space station is suitable for the team model. game features Making use of the latest illusory 4 engines It can conduct online multi person networking 4v4, 8v8, 16v16 cooperation game. We can carry out local multi player shooting 4v4, 8v8, 16v16 cooperation game. Intelligent AI system The real grand VR space scene Dozens of science fiction weapons The game will feature more sci-fi character modeling and science fiction space station scenarios. Players can experience future wars in the game Players can manipulate dozens of science fiction weapons to fight against online friends. The advanced IK system in the game enables players to act in the same way as in the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/835720/header.jpg?t=1533699328",
    "Price": 39.0,
    "Developers": "珠海心游科技股份有限公司",
    "Publishers": "珠海心游科技股份有限公司",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/835720/ss_16e62a6dfa4107e5cd2507b6522d74dca8015128.1920x1080.jpg?t=1533699328,https://cdn.akamai.steamstatic.com/steam/apps/835720/ss_026cd9753757928204eac6b3979859ebc0e39c43.1920x1080.jpg?t=1533699328,https://cdn.akamai.steamstatic.com/steam/apps/835720/ss_73b5d66c4d0f631ee5b17211f5e288db5b593a9d.1920x1080.jpg?t=1533699328,https://cdn.akamai.steamstatic.com/steam/apps/835720/ss_caf4269fa3f1f2b0a21654f9ae896ce9f51bc54c.1920x1080.jpg?t=1533699328,https://cdn.akamai.steamstatic.com/steam/apps/835720/ss_247546d7ec4eb16b20f520edb511fbf46a566737.1920x1080.jpg?t=1533699328,https://cdn.akamai.steamstatic.com/steam/apps/835720/ss_e18953513a66ba33b1459e76de64f67541c1c852.1920x1080.jpg?t=1533699328,https://cdn.akamai.steamstatic.com/steam/apps/835720/ss_ee4b2a5d78ed9790a5da17fc715d954bedd0b744.1920x1080.jpg?t=1533699328",
    "Slug": "2260-vr",
    "Meta Title": "2260 VR: Aug 7, 2018, 珠海心游科技股份有限公司 and Full Overview",
    "Meta Description": "Looking for information on 2260 VR? Check out the release date (Aug 7, 2018), developer insights from 珠海心游科技股份有限公司, and a complete game summary.",
    "Alt Text Image": "Official header image for 2260 VR game - Steam 835720",
    "Canonical URL": "https://gusku.site/game/2260-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"2260 VR\", \"description\": \"Looking for information on 2260 VR? Check out the release date (Aug 7, 2018), developer insights from \\u73e0\\u6d77\\u5fc3\\u6e38\\u79d1\\u6280\\u80a1\\u4efd\\u6709\\u9650\\u516c\\u53f8, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 7, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u73e0\\u6d77\\u5fc3\\u6e38\\u79d1\\u6280\\u80a1\\u4efd\\u6709\\u9650\\u516c\\u53f8\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u73e0\\u6d77\\u5fc3\\u6e38\\u79d1\\u6280\\u80a1\\u4efd\\u6709\\u9650\\u516c\\u53f8\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/835720/header.jpg?t=1533699328\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}