{
    "AppID": 663410,
    "Name": "Circle Up",
    "Release date": "Oct 14, 2020",
    "About the game": "Avoid obstacles on the way: cybers, portals, spikes and many more to test your skills. There are 50 levels and many bonus modes with exciting and tricky obstacles. ►Game Your goal is to avoid the obstacles that appear and maneuver through enemy swarms that will follow you. There are many different types of obstacles on the way, smart enemies that can capture you, blocks that will crush you, cyber swarms that follow and attack you, sharp spikes, even portals that will teleport you and many more awesome obstacles. ►Modes The game has more than 5 interesting game modes that will keep you entertained after unlocking all levels! upside down falling, enemy frenzy impossible levels and more which can be unlocked by playing. Each level is harder to beat and you'll have to reach the top to continue. ▸ Endless - all obstacles are combined, so you can except different and tricky situations. ▸ Falling - let's flip the game a bit, shall we? ▸ Enemy frenzy - cybers come from all sides, can you survive? ▸ Blocks - not only the spikes from below will make things difficult, but also blocks that will crush you if you get hit by them ▸ Survive - what can you not expect from this mode? All game modes are combined into one. Now that's really a skill tester! ▸Eye Boss - Fight eye boss and try to avoid all its attacks. Lasers, spikes and many more vicious attacks that will put your skills on test. ►Players Unlock many players on the way as you beat levels. Cat can be unlocked after level 15 and badass kraken at level 50. Can you unlock all of them? ►Skins/Coins As you play collect coins on the way, and spend them on new players that you can play with. Eye, ninja, zombie, mars, soccer ball, donut, ghost are some of the many players that are available to unlock. ►Controls Click in the direction in which you want the ball to jump. You will need to think sometimes in which way you will jump, since some moves will have different outcomes, harder or easier. ►Obstacles There are portal obstacles in Circle Up. In order to proceed, you will need to go into one side of the portal, that will teleport you to the other side. Red Spikes are waiting for you on the side of the screen, and they will attack when you get too close to them. Spikes will charge at the least moment that you expect, they will be lurking from the side of the screen, and attack you when you come too close to them, beware. There are many other types of blocks that won't be easy to avoid, moving obstacles and many more. Can you survive and prove all of these enemy cyber's who is the best?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/663410/header.jpg?t=1602686833",
    "Price": 10.99,
    "Developers": "EGAMER",
    "Publishers": "EGAMER",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/663410/ss_f21cc6d869d861a0d5fe3c00572b52b21d000a7f.1920x1080.jpg?t=1602686833,https://cdn.akamai.steamstatic.com/steam/apps/663410/ss_1ad608c476d596eead58cdffd069e47c59b67187.1920x1080.jpg?t=1602686833,https://cdn.akamai.steamstatic.com/steam/apps/663410/ss_838a70529025988e6bef08be9ec10d8a7e6a127f.1920x1080.jpg?t=1602686833,https://cdn.akamai.steamstatic.com/steam/apps/663410/ss_397d2d5dcc6aab0b649042ee8af9c32b89881aaa.1920x1080.jpg?t=1602686833,https://cdn.akamai.steamstatic.com/steam/apps/663410/ss_5564974ea4df0bbc8d53b34144c3d6e84915ef78.1920x1080.jpg?t=1602686833",
    "Slug": "circle-up",
    "Meta Title": "Circle Up: Oct 14, 2020, EGAMER and Full Overview",
    "Meta Description": "Looking for information on Circle Up? Check out the release date (Oct 14, 2020), developer insights from EGAMER, and a complete game summary.",
    "Alt Text Image": "Official header image for Circle Up game - Steam 663410",
    "Canonical URL": "https://gusku.site/game/circle-up",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Circle Up\", \"description\": \"Looking for information on Circle Up? Check out the release date (Oct 14, 2020), developer insights from EGAMER, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 14, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"EGAMER\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"EGAMER\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/663410/header.jpg?t=1602686833\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}