{
    "AppID": 605250,
    "Name": "Cluckles' Adventure",
    "Release date": "Apr 10, 2017",
    "About the game": "GAME DESCRIPTION The chicks have been captured by the evil minions! Help Cluckles in her adventure to rescue them all! Cluckles may be small but she is brave and feisty. She won't let the minions stand in her way! Armed with her trusty sword Cluckles must run, jump and dash through 100+ tricky levels, but watch out: the worlds are full of spikes, traps and deadly enemies. Find the chicks hiding in each level and reach the exit. Discover secret areas where chicks and useful power-ups could be hiding. Collect shields and armor to help Cluckles on her adventure. Explore three different environments. Defeat the minions and rescue the stolen chicks! Cluckles' Adventure has two game modes. Take your time and explore at your own pace in Classic game mode. Or switch to Speed Run and compete on Steam Leaderboards to post the fastest level times. GAME FEATURES A highly replayable and fun action / puzzle platform game! Find all the chicks hiding in each level to be awarded a perfect star. Featuring 108 challenging levels, full of secrets, puzzles, tricky obstacles and enemies. Hours of entertainment! Two game modes. Switch to Speed Run game mode and compete on Steam Leaderboards to post the fastest level times! Unlock Steam Achievements. Collectable Steam Trading Cards. Cute pixel art graphics. Amazing, catchy retro soundtrack by NMBoom. PLAYING TIPS If you can't find all the chicks in a level it's likely they are hiding in a secret area. Helpful elements in the environment can indicate that a secret area is nearby. A double jump followed by a dash is a great way to speed Cluckles through a level or reach distant platforms. For more gameplay advice check out the guides on the Cluckles Community Hub . CONTROLS Cluckles' Adventure has full Controller Support (optimised for XBOX 360 controller) or can be played with the keyboard. The controls layout can be viewed in-game by navigating to the Settings menu &gt; Controls. Basic Controls for Cluckles' Adventure Keyboard (In-Game) Z - Jump / Double Jump X - Dash Attack Left Arrow - Move Left Right Arrow - Move Right Down Arrow - Drop through platform P - Pause Keyboard (In-Game Menus: Pause &amp; Level End Menus) Z - Continue to next Level X - Restart level Q - Quit to level select screen Controller (In-Game) A - Jump / Double Jump B - Dash Attack D-Pad - Move Left / Right, Drop through platform Left Stick - Move Left / Right, Drop through platform Start - Pause / Quit Controller (Menus) A - Select D-Pad - Navigate menu buttons Left Stick - Scroll Up / Down, Left / Right COMMUNITY Have you completed an especially challenging level? Discovered a hard-to-find secret area? Visit the Cluckles Steam Community Hub to join the discussion. Level walkthroughs, secret reveals and general advice about beating levels and finding secret areas are available here.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/605250/header.jpg?t=1492055982",
    "Price": 2.99,
    "Developers": "@lukasinspace",
    "Publishers": "Funbit Pty Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/605250/ss_65e9aaf5deab03d398901a74b41e58d4e6f6be52.1920x1080.jpg?t=1492055982,https://cdn.akamai.steamstatic.com/steam/apps/605250/ss_b7e33f4258cedc0163461df110c242e7d16f2a89.1920x1080.jpg?t=1492055982,https://cdn.akamai.steamstatic.com/steam/apps/605250/ss_e1bf74ecb6e39d88df707b48794ff3838952e990.1920x1080.jpg?t=1492055982,https://cdn.akamai.steamstatic.com/steam/apps/605250/ss_fdf78cd9f68f1d62081a6e63b5c34167b99e5e0b.1920x1080.jpg?t=1492055982,https://cdn.akamai.steamstatic.com/steam/apps/605250/ss_df4903202b277fef80388789ce4b00f52c8ef714.1920x1080.jpg?t=1492055982",
    "Slug": "cluckles-adventure",
    "Meta Title": "Cluckles' Adventure: Apr 10, 2017, @lukasinspace and Full...",
    "Meta Description": "Looking for information on Cluckles' Adventure? Check out the release date (Apr 10, 2017), developer insights from @lukasinspace, and a complete game su...",
    "Alt Text Image": "Official header image for Cluckles' Adventure game - Steam 605250",
    "Canonical URL": "https://gusku.site/game/cluckles-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cluckles' Adventure\", \"description\": \"Looking for information on Cluckles' Adventure? Check out the release date (Apr 10, 2017), developer insights from @lukasinspace, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 10, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"@lukasinspace\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Funbit Pty Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/605250/header.jpg?t=1492055982\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}