{
    "AppID": 1194690,
    "Name": "Creatry — Easy Game Maker & Game Builder App",
    "Release date": "Aug 14, 2020",
    "About the game": "Creatry is a marvelous app, designed for creative and passionate people with a dream of making video games. It's unbelievably easy to pick up and impossible to give up. Replace thousands of lines of code with a few clicks in a light and modern user interface. Turn hundreads hours of bug-fixing and playtesting into an opportunity to play your own game and have a lot of fun. Hard learning has become an exciting experimenting. And even the bravest game idea can come true with zero code. Make your own platformer games without coding and game development experience. Create game prototypes and design stunning levels with ease. Only in Creatry . » Innovative visual editor Creatry comes with the super easy visual tag system. Create new game object, attach tags you need and that's it! Programming or advanced scripting is not required. Design your game like you would describe it to your friends. There is no need to learn how to use counter-intuitive event systems and adapt to their quirks. Visual coding in Creatry is truly visual. There are no exceptions or hidden pitfalls. » As easy as it seems Creatry is an amazing way to get started in game development as there is no barrier to entry — if you know how to turn on your computer then you are already familiar with Creatry and can build your first video game. » No hidden costs or fees Buy Creatry once and use it as long as you like. There aren't any subscriptions, paid updates, royalties or other hidden costs — you get all of the included features from the start with no strings attached, and your games actually belong to you. Modern interface that boosts your productivity Simple yet powerful user interface we built from scrath works perfectly smooth on any platform. Perform tasks gracefully no matter what device you are using. Creatry interface was made by professional designers with particular attention to the smallest details. It's bright, fresh and ultimately easy to use because it was designed with usability in mind. Made by industry professionals Professional game designers are deeply involved in development of Creatry , meaning that you can easily implement advanced features such as responsive controls, cinematic scrolling and other little details that greatly improve your game feel and overall quality. Community of creators Share you creations with the Creatry community and explore what other aspiring game developers have to offer. Free cloud storage All Creatry project files are automatically backed up and thoroughly stored in your Steam Cloud . Access it anytime you want from any device you want. ALL FEATURES Main features Create your first game in less than 10 minutes No programming knowledge required Best game engine for beginners Free cloud storage for your projects Game features Premade animations and game logic Fully customizable smooth cinematic camera with visual effects Enemy AI, collectibles, gamepad controls and other features that are ready to use with one-click integration Editor features Visual editor : create your own games without coding, scripting or other advanced programming",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1194690/header.jpg?t=1597484318",
    "Price": 24.99,
    "Developers": "Sanya",
    "Publishers": "Sanya",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1194690/ss_5ff45745a240ab5fd177c046d95c9b118c725cb8.1920x1080.jpg?t=1597484318,https://cdn.akamai.steamstatic.com/steam/apps/1194690/ss_4fb550754d16d91c9152bc2d8039708919cd8142.1920x1080.jpg?t=1597484318,https://cdn.akamai.steamstatic.com/steam/apps/1194690/ss_6c2d5c0ab9cb64072041e29ce9206b6f83b1e484.1920x1080.jpg?t=1597484318,https://cdn.akamai.steamstatic.com/steam/apps/1194690/ss_c7d6de5668f7492244622f4ff381dffa9ed7fbcf.1920x1080.jpg?t=1597484318,https://cdn.akamai.steamstatic.com/steam/apps/1194690/ss_8c7cc834583b19717cb53d96f7ed5d9557753b29.1920x1080.jpg?t=1597484318",
    "Slug": "creatry-easy-game-maker-game-builder-app",
    "Meta Title": "Creatry — Easy Game Maker & Game Builder App: Aug 14, 202...",
    "Meta Description": "Looking for information on Creatry — Easy Game Maker & Game Builder App? Check out the release date (Aug 14, 2020), developer insights from Sanya, and a...",
    "Alt Text Image": "Official header image for Creatry — Easy Game Maker & Game Builder App game - Steam 1194690",
    "Canonical URL": "https://gusku.site/game/creatry-easy-game-maker-game-builder-app",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Creatry \\u2014 Easy Game Maker & Game Builder App\", \"description\": \"Looking for information on Creatry \\u2014 Easy Game Maker & Game Builder App? Check out the release date (Aug 14, 2020), developer insights from Sanya, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 14, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sanya\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sanya\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1194690/header.jpg?t=1597484318\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}