{
    "AppID": 1839660,
    "Name": "Crystal Clash",
    "Release date": "Jan 14, 2022",
    "About the game": "Welcome to Crystal Clash! The Discord is where all the action is! Join the fun! Enjoy fast-paced, easy-to-pickup tug-of-war strategy. A hybrid of MOBA, tower defense and deckbuilding. Play 2v2 or co-op with a friend, or pair up with new allies and enemies! Collect cards, build your decks and have fun crushing your enemies! Key Features: Completely free-to-play Quick &amp; intense 2v2 and Co-Op matches Deck-building PvE-challenges Five playable Legions Dual-color decks You can also join our Discord community to keep up to date with the game! 'Assemble mighty machines and breach through any defenses. Generate energy and materialize behind the enemy lines!' The Blue Legion's main gameplay mechanics feature a variety of energy effects and buildings that can be used for heavy combos. Defend yourself with a strong defensive line, then teleport it to the enemy so it becomes your attack line. Each spell you cast empowers your troops, enabling them to unleash mighty abilities. 'Lead an army of vivid plants and ancient trees into battle. Root your enemies and drown them in a flood of saplings. Evolve them to become stronger.' The Green Legion's main gameplay mechanics and combos feature a variety of heal-over-time effects, rooting your enemies in place and last but not least, hordes of Saplings that can be evolved into powerful creatures. 'Freeze your enemies and drain their life. Creatures from the void gather souls to unleash sinister abilities upon their foes.' The Black Legion's main gameplay mechanics and combos feature a variety of freezing spells and abilities , as well as ripping out the souls of enemy units in order to trigger powerful passive abilities . 'Command sacred archers and shiny knights accompanied by angelic forces. Raise your shields and stand strong!' The White Legion's main gameplay mechanics and combos feature a variety of healing and shielding spells that can be targeted at multiple units at once. Overwhelm your opponent with masses of archers and knights and make them survive to the last minute in order to turn the tide of battle. 'Awake the ancient legends of long forgotten artifacts and claim the fabled power to obliterate your enemies!' The Crystal Legion’s main gameplay mechanics and combos feature a variety of supporting and stabilizing abilities , while you take control of the battlefield with mighty golems and ancient spells. Is the game Pay-to-win? The game is explicitly not pay-to-win. You can unlock any cards in the game with in-game currencies. Our business model is free-to-play and pay-to-advance-faster, the ONLY things that can only be bought with real money are skins, to help support the game. Are there any secrets with exclusive stuff? Sure, you just found one of eight secrets to redeem in the ingame shop: XR0F-7ST3-4MC0-MMUN-1TYX 🎊",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1839660/header.jpg?t=1648915207",
    "Price": 0.0,
    "Developers": "Crunchy Leaf Games",
    "Publishers": "Crunchy Leaf Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1839660/ss_b7803d2a3d1cc0a4e9d01e1275790eac1c21c74f.1920x1080.jpg?t=1648915207,https://cdn.akamai.steamstatic.com/steam/apps/1839660/ss_3d6ac4acfd92d66261d3d41bd7a078ab675aaef2.1920x1080.jpg?t=1648915207,https://cdn.akamai.steamstatic.com/steam/apps/1839660/ss_992e2ad20660ce891e612986901329b821e84a73.1920x1080.jpg?t=1648915207,https://cdn.akamai.steamstatic.com/steam/apps/1839660/ss_d51114d84d0a4dfa9969271967af9855513fb747.1920x1080.jpg?t=1648915207,https://cdn.akamai.steamstatic.com/steam/apps/1839660/ss_474852b4a8b4ccd340c2a6669c37e9332479591f.1920x1080.jpg?t=1648915207,https://cdn.akamai.steamstatic.com/steam/apps/1839660/ss_9f3b1ad85d3899ad908f051f48bade961d4f6bdd.1920x1080.jpg?t=1648915207,https://cdn.akamai.steamstatic.com/steam/apps/1839660/ss_3a04dabb47a58950fa50c66d09fcecd4f75e1f4d.1920x1080.jpg?t=1648915207",
    "Slug": "crystal-clash",
    "Meta Title": "Crystal Clash: Jan 14, 2022, Crunchy Leaf Games and Full ...",
    "Meta Description": "Looking for information on Crystal Clash? Check out the release date (Jan 14, 2022), developer insights from Crunchy Leaf Games, and a complete game sum...",
    "Alt Text Image": "Official header image for Crystal Clash game - Steam 1839660",
    "Canonical URL": "https://gusku.site/game/crystal-clash",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crystal Clash\", \"description\": \"Looking for information on Crystal Clash? Check out the release date (Jan 14, 2022), developer insights from Crunchy Leaf Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crunchy Leaf Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crunchy Leaf Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1839660/header.jpg?t=1648915207\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}