{
    "AppID": 837380,
    "Name": "DeoVR Video Player",
    "Release date": "Apr 24, 2018",
    "About the game": "DeoVR is the best-in-class VR video player for all available headsets. Enjoy the best moments of your favorite videos. The built-in VR media browser delivers the best VR content from YouTube and other popular video sites. Get in touch any time at support@deovr.com Talk to developers: The player is used to playback and stream thousands of hours of VR videos every day. It is designed to provide the best performance of every video for each VR headset. The simple and intuitive interface is achieved by a hi-tech back-end invisible to the naked eye. It is constantly being updated to include more features and better quality playback. Many suggestions are sent daily and we are trying to incorporate these fast. DeoVR unleashes the fullest potential of VR with: - A zoom feature that brings you closer to the action, just like real life - Tilt to adjust the video to your body position - Height fits viewer’s height to match the camera’s POV - Rotation provides another perspective of the action in the video - Perfect Xbox Controller and integration for all known VR controllers - A-B loop and slow-motion for the best moments in the video - Vertical and horizontal stereoscopic off-sets perfectly align videos to viewer’s IPD and corrects video misalignments - Head-tracking for 6DOF headsets gives you freedom of movement in the video Special features: 1. The maximum resolution, frame rate and bitrate supported for each headset. 2. Optimisation for each known VR chipset, GPU and operating system 3. Advanced file manager with a useful ‘favorite folders’ feature 4. Quickly addressing user requests and customizations 5. Viewport cloud streaming allows 6K playback on Oculus Quest, Go and any Snapdragon headset. It overcomes the 4K decoding limitations of most mobile headsets by cutting a video into small pieces and simultaneously playing the parts you are looking at. 6. VR photos support 7. Integration with MistikaVR DeoVR is used by developers and websites to playback and stream videos in native applications and WebVR/WebXR players. It is integrated with high-performance CDN to deliver low latency, high-resolution content all over the world. Check the DeoVR website for documentation and more details. What’s next? - Live cam streaming support - Volumetric and lightfield videos support - Group watching - VR video games live streaming",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/837380/header.jpg?t=1627901747",
    "Price": 0.0,
    "Developers": "InfoMediji LTD",
    "Publishers": "VRFavs d.o.o.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/837380/ss_b01825aae366a1eff00321b6ab879b8e71fc4819.1920x1080.jpg?t=1627901747,https://cdn.akamai.steamstatic.com/steam/apps/837380/ss_f57e21c580816e937cde799abb649cc90e224d70.1920x1080.jpg?t=1627901747,https://cdn.akamai.steamstatic.com/steam/apps/837380/ss_f454dca33f5dd5fc78bc23812a280d11f3d66820.1920x1080.jpg?t=1627901747,https://cdn.akamai.steamstatic.com/steam/apps/837380/ss_4d43a6da995372b4d77ebe520d30cd28c007c5cf.1920x1080.jpg?t=1627901747,https://cdn.akamai.steamstatic.com/steam/apps/837380/ss_5744a28a3ace66a9b0f67ef0798d2c6c945c24ae.1920x1080.jpg?t=1627901747",
    "Slug": "deovr-video-player",
    "Meta Title": "DeoVR Video Player: Apr 24, 2018, InfoMediji LTD and Full...",
    "Meta Description": "Looking for information on DeoVR Video Player? Check out the release date (Apr 24, 2018), developer insights from InfoMediji LTD, and a complete game su...",
    "Alt Text Image": "Official header image for DeoVR Video Player game - Steam 837380",
    "Canonical URL": "https://gusku.site/game/deovr-video-player",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DeoVR Video Player\", \"description\": \"Looking for information on DeoVR Video Player? Check out the release date (Apr 24, 2018), developer insights from InfoMediji LTD, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 24, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"InfoMediji LTD\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VRFavs d.o.o.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/837380/header.jpg?t=1627901747\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}