{
    "AppID": 824300,
    "Name": "Dragon Awaken",
    "Release date": "Oct 3, 2018",
    "About the game": "Dragon Awaken is a semi-turn based heroic fantasy mmorpg where you will have to collect dragons, improve your armors and develop new skills and recruit legendary Heroes. You are the son of an original Dragon born of a chaotic ocean and an ancient god torn from an eternal star, you represent life and the hope of a certain victory. The essence of dragons will help you defeat this new threat, allowing you to gather legendary beings and protect the holy city! In the past the inner and outer planes formed only one plane bound by the ethereal, the shadow, and the energy of the stars. Beyond the ordinary world of humans there were twelve vast kingdoms that maintained a certain balance between elements and energies. Each of them had managed to create a full-fledged universe with its natural laws, its extraordinary inhabitants mixing in their turn mortal lives, gods, demons, angels, devils and many more strange creatures both exotic wonderful and terrifying you can not imagine. Yet at the crossroads of worlds where everything is possible, a determined being was born, Garuldrix the planar dragon. He founded the thirteenth kingdom, tried to shape each of his descendants in his own image, and then drove out like animals the different inhabitants of the other planes who did not want to bow to his will. Those whom he could not corrupt were eradicated. A war broke out between them and this being of evil, even more devastating than ever, it thus caused the exodus of several people to the Citadel Promise. Exhausted by the incredible struggle of their fathers, the sons of different kingdoms decided to unite to face together this threat and defend the last bastion of freedom. Fighters of all horizons have begun to flow through the planes and passages of the ether to the material world. All swore allegiance to their brothers in arms to gather their powers and defeat Garuldrix. Even today, you, commander and worthy heir of the twelve kingdoms, are called to lead, to fight and to awaken your inner power in order to overcome these dragons and to leave a lasting peace reign between the worlds. Would you know how to answer this call?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/824300/header.jpg?t=1538580608",
    "Price": 0.0,
    "Developers": "Game Hollywood",
    "Publishers": "Global Genom Corporate",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/824300/ss_4411e8ea94ef9da0aeed11139397ce950d0ebf09.1920x1080.jpg?t=1538580608,https://cdn.akamai.steamstatic.com/steam/apps/824300/ss_dab8b335d3747c16f1a0a820e9b3e0e1c2ad8f93.1920x1080.jpg?t=1538580608,https://cdn.akamai.steamstatic.com/steam/apps/824300/ss_42d0f47493b161a7953c332f59fef3823053ebf5.1920x1080.jpg?t=1538580608,https://cdn.akamai.steamstatic.com/steam/apps/824300/ss_b9cdc0d7a96a851244a0c29f37b34d507946d224.1920x1080.jpg?t=1538580608,https://cdn.akamai.steamstatic.com/steam/apps/824300/ss_db2a42db0755711b81ad03c263c1463ad432ce5f.1920x1080.jpg?t=1538580608",
    "Slug": "dragon-awaken",
    "Meta Title": "Dragon Awaken: Oct 3, 2018, Game Hollywood and Full Overview",
    "Meta Description": "Looking for information on Dragon Awaken? Check out the release date (Oct 3, 2018), developer insights from Game Hollywood, and a complete game summary.",
    "Alt Text Image": "Official header image for Dragon Awaken game - Steam 824300",
    "Canonical URL": "https://gusku.site/game/dragon-awaken",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dragon Awaken\", \"description\": \"Looking for information on Dragon Awaken? Check out the release date (Oct 3, 2018), developer insights from Game Hollywood, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 3, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Game Hollywood\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Global Genom Corporate\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/824300/header.jpg?t=1538580608\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}