{
    "AppID": 1152280,
    "Name": "ESCAPE FROM VOYNA: ALIENS FROM ARENA 51",
    "Release date": "Feb 5, 2020",
    "About the game": "Escape from Voyna: ALIENS FROM AREA 51 is an action packed realistic single player shooter set in the era of the Cold War on russian soil. After many nuclear tests the land is devastated and apocalypse spreading. You, a secret agent stranded on an island try to escape without getting caught by enemy soldiers. During the time of the Cold War the major powers attempt to secure their power by attempting to build the biggest and best nuclear weapons. Those were tested on remote islands. Due to a misfortune, you land on one of those islands. As an american secret agent you must not be caught by the russian special forces of the RSWS. You sneak, run, shoot, collect and scout the huge game world. One of the over seven different weapons is bound to get you out of any sticky situation. After the game start you first need to get your bearings and find your way - there's always more than one way out. Find the quickest and easiest, because this game is hard. It's a tactical shooter. Weapons have realistic recoil and should be used for single shots most of the time. There is no HUD showing your life or ammunition, no crosshair or hit marker. Hardcore ain't for casual players. You need to find food or medical supplies to heal yourself. The game features a large amount of realistically modeled weapons. Recoil is modeled in as well, so make sure to aim before your shots go astray. Ammunition is limited! Your enemies are going to give you a headache. The AI hears your steps and shots. It will hunt and pursue you and shoots accurately. Watch your cover, because the AI will act as a team. You should sneak up, learn the patrol routes and maybe dodge certain enemies altogether. Life is short, and the AI aims well. Most of the times escape or avoiding is the better option. Breathtaking graphics based on Unity DX11 With Unity Engine and DirextX 11 we created a beautiful, living world you just want to immerse in. Enjoy the trees, grasses and stunning light effects. Get the maximum out of your PC and experience AAA worlds. Realistic 7.1 surround sound Experience realistic gun sounds of AK and friends in 7.1 surround sound quality. Let the ambience of the surroundings enchant",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1152280/header.jpg?t=1580929937",
    "Price": 7.99,
    "Developers": "Dead Crow",
    "Publishers": "Dead Crow",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1152280/ss_1fc3e2a01a66e93c585832530b4876551c3670ae.1920x1080.jpg?t=1580929937,https://cdn.akamai.steamstatic.com/steam/apps/1152280/ss_c4d0dfa6427319c7380f78ad6eeec0a52f76a524.1920x1080.jpg?t=1580929937,https://cdn.akamai.steamstatic.com/steam/apps/1152280/ss_8e720ed449fa1e1d13665854a37847b8a0b68159.1920x1080.jpg?t=1580929937,https://cdn.akamai.steamstatic.com/steam/apps/1152280/ss_b6b7c810f38c958c375924420f55a7cda06d319e.1920x1080.jpg?t=1580929937,https://cdn.akamai.steamstatic.com/steam/apps/1152280/ss_5289582343a674faac1970fd43114174b972df45.1920x1080.jpg?t=1580929937",
    "Slug": "escape-from-voyna-aliens-from-arena-51",
    "Meta Title": "ESCAPE FROM VOYNA: ALIENS FROM ARENA 51: Feb 5, 2020, Dea...",
    "Meta Description": "Looking for information on ESCAPE FROM VOYNA: ALIENS FROM ARENA 51? Check out the release date (Feb 5, 2020), developer insights from Dead Crow, and a c...",
    "Alt Text Image": "Official header image for ESCAPE FROM VOYNA: ALIENS FROM ARENA 51 game - Steam 1152280",
    "Canonical URL": "https://gusku.site/game/escape-from-voyna-aliens-from-arena-51",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ESCAPE FROM VOYNA: ALIENS FROM ARENA 51\", \"description\": \"Looking for information on ESCAPE FROM VOYNA: ALIENS FROM ARENA 51? Check out the release date (Feb 5, 2020), developer insights from Dead Crow, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dead Crow\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dead Crow\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1152280/header.jpg?t=1580929937\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}