{
    "AppID": 638310,
    "Name": "Family Tree Heritage™ Platinum 15 – Windows",
    "Release date": "Jun 22, 2017",
    "About the game": "Family Tree Heritage makes it easy to discover your family history, build your family tree, and share your family story. You’ll have FREE access to over 14 billion historical records, photos, news stories, and documents.* Find important documents for your ancestors, with one click, for seamless searches to the world’s largest genealogy databases. Family Tree Maker Customer? Don’t lose your research now that Family Tree Maker is retired. Save your trees, charts, and research locally with Family Tree Heritage. Seamlessly export your data files from Family Tree Maker into Family Tree Heritage in two easy steps. Search Ancestry.com directly from Family Tree Heritage if you are an ancestry.com subscriber. What’s New in Family Tree Heritage? TreeTips™ Have you ever wished that someone could do your research for you? TreeTips™ is an innovative technology built into Family Tree Heritage that displays hints for possible records about your ancestors. These hints are from MyHeritage, FamilySearch, and Findmypast. Memories Manager New! Link Family Tree Heritage to FamilySearch records. Quickly and easily exchange your scrapbook items with the Memories on FamilySearch. You can easily link your scrapbook items to the images on FamilySearch, and share your information and images with others! Direct Access to Powerful Genealogy Sites Family Tree Heritage is fully integrated with the new Family Tree of FamilySearch, Myheritage, and Findmypast. Import records directly and build your family tree quickly. No subscription required for worldwide searches Search 14 billion records with 1-click from the software. To access FamilySearch, sign up for a free account at http:\\\\familysearch.com. Powerful Genealogy Design Tools Create colorful trees, heirloom-quality charts, reports and family books that will be cherished by your family members now and in future years, with Family Tree Heritage’s genealogy design tools. Share your family’s story at family reunions and online. Interactive Research Timeline Uncover clues to discover more information about your ancestors and family history. Find events that may have affected your ancestors, such as a war or immigration issue. These events will refer you to additional resources to learn more about your ancestors. There are several pre-designed event groups to choose from and you may also add your own events. The Timeline view is interactive: click on names, dates, and places to see how it responds. A Timeline report is available for printing. Tags Tag your ancestor similarities, such as geographic location, medical conditions, and more! Create your own set of Tags and assign up to three Tags to individuals in your database. The tags display on various screens and reports in Family Tree Heritage. Color Coding Quickly identify individuals and family lines on your family tree. This four-color filing system allows you to add background colors to the name boxes for individuals and/or family lines. The color coding displays on various screens and reports, allowing you to track individuals from the maternal and paternal sides of your mother and father’s ancestors. Design Trees, Charts &amp; Reports! Create colorful trees, heirloom-quality charts, reports and family books that will be cherished by your family members now and in future years. Four-Color Fan Charts You can generate a Four-Color Fan Chart and include siblings of the first generation in the chart. Create any number of charts for your family. • Ancestry Charts • Descendant Charts • Family Charts • Pedigree Fan Charts • Large Wall Charts • Pedigree Charts More Features than Any Other Genealogy Program! • Lists &amp; Calendars • Records &amp; Reports • Advanced Management Reports • Collaboration Tools • User-Friendly Interface • Share on Flash or Thumb Drive • 1-Click Search to 14+ Billion Records • Advanced Features • Color Coding to ID Generations • Interactive Research Timeline • Tagging • Updated FamilySearch Database • Family Books &amp; Scrapbooks",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/638310/header.jpg?t=1498162589",
    "Price": 39.99,
    "Developers": "Individual Software",
    "Publishers": "Individual Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/638310/ss_8db826d1d0e395718e2154ea5fa53a2f2e3beff4.1920x1080.jpg?t=1498162589,https://cdn.akamai.steamstatic.com/steam/apps/638310/ss_a40cab4618520f40ffe8b69cc8454dd67ceddd0e.1920x1080.jpg?t=1498162589,https://cdn.akamai.steamstatic.com/steam/apps/638310/ss_ce2ae0d231117e8225a780f7f0469eb0f86d90e8.1920x1080.jpg?t=1498162589,https://cdn.akamai.steamstatic.com/steam/apps/638310/ss_8c0b5d37ecdfe17937df0ff2b756addb964a595d.1920x1080.jpg?t=1498162589,https://cdn.akamai.steamstatic.com/steam/apps/638310/ss_979beb4f28971efe1a05af0e295928a7625b843c.1920x1080.jpg?t=1498162589",
    "Slug": "family-tree-heritage-platinum-15-windows",
    "Meta Title": "Family Tree Heritage™ Platinum 15 – Windows: Jun 22, 2017...",
    "Meta Description": "Looking for information on Family Tree Heritage™ Platinum 15 – Windows? Check out the release date (Jun 22, 2017), developer insights from Individual So...",
    "Alt Text Image": "Official header image for Family Tree Heritage™ Platinum 15 – Windows game - Steam 638310",
    "Canonical URL": "https://gusku.site/game/family-tree-heritage-platinum-15-windows",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Family Tree Heritage\\u2122 Platinum 15 \\u2013 Windows\", \"description\": \"Looking for information on Family Tree Heritage\\u2122 Platinum 15 \\u2013 Windows? Check out the release date (Jun 22, 2017), developer insights from Individual So...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 22, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Individual Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Individual Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/638310/header.jpg?t=1498162589\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}