{
    "AppID": 652460,
    "Name": "Fragmentum",
    "Release date": "May 1, 2018",
    "About the game": "Design your units. Build your forces. Conquer your enemies. Fragmentum is an experimental Real Time Strategy (RTS) game with custom units and factions, dynamic units and complex 3D terrain. Units are built from the ground up using voxel-like modules that determine their stats and abilities. Maps are 3D and volumetric, rather then mere height maps. Resources are continuously recycled into scrap piles. Features multiplayer, replays, and a simple single player campaign. Custom Units Design your units in the blueprint studio. Use modules to shape and define each unit, no preassigned roles or tech tree limits, everything is determined by you. Create builders, miners, buildings, warriors, whatever you need to make your ideal faction. Use 5 module levels to create different tech tiers. Dynamic units Modules don't just affect unit stats in the blueprint editor. Units gain and lose stats as their modules are built and destroyed. If a partially built unit has a completed repair module, it can help build itself. Disable enemy cruisers by destroying their thrusters. Disarm units by breaking their weapons. Even partially built units can be sent into combat if some movement and weapons modules are finished. Terrain A voxel based terrain engine allows for new features in RTS maps, multi-layer platforms, tunnels, alcoves, traditional top down maps, and side scrolling style maps. Maps can be procedurally generated or designed in a map editor. New map generators can be modded in and shared in the workshop. Features Design your units in the blueprint studio. Create workers, soldiers and buildings to make up your faction. Design your tech tree. 8 types of weapons modules with different damage profiles, and 2 armour types create a simple yet dynamic combat system. Wage war in a truly 3D environment, utilize different platform levels to your tactical advantage. Dynamic Unit stats. Resources that are never created or destroyed, only recycled into scrap piles. As battle progresses, scrap piles up, making movement more difficult, and providing some cover from weapons fire. Current battlegrounds are future resource depots. A free camera, command the battle from every angle. An AI, that can analyse and play any set of units. A Map editor allows you to build new maps from some simple components. Procedurally generated maps. Choose one of our procedural map generators or load a premade map. Workshop where Blueprints, factions, Maps (Both static and procedural), and AIs can be shared.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/652460/header.jpg?t=1572575931",
    "Price": 9.99,
    "Developers": "Lundar Games",
    "Publishers": "Lundar Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/652460/ss_597c5f39190ea9085b396e1bc42bb9a6d09fef24.1920x1080.jpg?t=1572575931,https://cdn.akamai.steamstatic.com/steam/apps/652460/ss_aff2a03a2a69388663bbae58031413f710e68561.1920x1080.jpg?t=1572575931,https://cdn.akamai.steamstatic.com/steam/apps/652460/ss_3e6975a81626dc4eb584331ff7c206291c72c0fc.1920x1080.jpg?t=1572575931,https://cdn.akamai.steamstatic.com/steam/apps/652460/ss_1118415daf8a1911603931a3f62836a6df07dd15.1920x1080.jpg?t=1572575931,https://cdn.akamai.steamstatic.com/steam/apps/652460/ss_8440591d2ea4b610b33d1c4bd9252d90a6836b5c.1920x1080.jpg?t=1572575931,https://cdn.akamai.steamstatic.com/steam/apps/652460/ss_d8d863cefc2482cb9b21d5f574a73ccb831c6a4e.1920x1080.jpg?t=1572575931,https://cdn.akamai.steamstatic.com/steam/apps/652460/ss_36de9372bf18c509841a84208d6de5ed2d5002af.1920x1080.jpg?t=1572575931",
    "Slug": "fragmentum",
    "Meta Title": "Fragmentum: May 1, 2018, Lundar Games and Full Overview",
    "Meta Description": "Looking for information on Fragmentum? Check out the release date (May 1, 2018), developer insights from Lundar Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Fragmentum game - Steam 652460",
    "Canonical URL": "https://gusku.site/game/fragmentum",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fragmentum\", \"description\": \"Looking for information on Fragmentum? Check out the release date (May 1, 2018), developer insights from Lundar Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 1, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lundar Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lundar Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/652460/header.jpg?t=1572575931\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}