{
    "AppID": 1565090,
    "Name": "GearHead Caramel",
    "Release date": "Jul 21, 2022",
    "About the game": "It's been a year since the Typhon Incident, when a biomonster from the Age of Superpowers awoke and rampaged across the Earth. Aegis Overlord, having consolidated power on Luna, begins preparation to extend their domination across the solar system. The L5 Alliance attempts to maintain a fragile peace while their member-states bicker and war among themselves. To make matters worse, the cyberpop band Love Magnet just announced that they're splitting up. I trust that all of you know what this means. It's time to fire up your giant robot and go do some stomping. GearHead Caramel is a turn based tactics style scifi mecha Roguelike RPG set in a world recovering from the apocalypse. Take control of an immensely powerful mecha, build a team of unique lancemates, and change the future for better or worse. This is the third game in the GearHead series, though you don't need to have played the previous two to jump right in. Your character can play through a series of adventures set in various times and places in the GearHead universe. Currently there are two adventure modules, with more to follow. Features include: Procedural Narrative: The game is different every time you play it. In addition, the game world will react to your decisions. NPCs remember their past interactions with you and will treat you accordingly. Both Mecha and Personal Scale Combat: GearHead may be a mecha game, but that doesn't mean there's nothing to do on foot. You can explore dungeons, negotiate peace treaties, replace body parts with cybernetics, and even get swallowed whole by gigantic biomonsters. Detailed Mecha Build System: Upgrade your mecha with parts from the customization shop or taken as salvage from missions. There are dozens of standard mecha to choose from, ranging from giant sword-wielding robots to city-levelling tanks. You can even design new mecha from scratch, but be warned- you might end up facing your own designs in combat! Lifepath Based Character Generation: A GearHead character is more than just a collection of stats. You can allow the game to give you a random life story, or make every decision along the way by yourself. Using the portrait builder you can customize the appearance of your character. Party Dynamics: Your adventuring companions have their own abilities and personalities. Their relationship with you will change depending on your choices, their choices, and a variety of other factors. Will your team become a tight knit found family? Or will they take the first opportunity to go through your pockets and leave your body in a ditch? PDF Game Manual with Artwork and a History of the GearHead Universe: Get up to date with the Novus Tempus and learn how to be a giant robot pilot. Includes a detailed description of the exploration and combat interfaces, plus an extensive troubleshooting section.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1565090/header.jpg?t=1658637165",
    "Price": 7.69,
    "Developers": "Joseph Hewitt",
    "Publishers": "Joseph Warwick Victor Hewitt",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1565090/ss_c1153cd9635a02961d8215e9a30950db1e32bca3.1920x1080.jpg?t=1658637165,https://cdn.akamai.steamstatic.com/steam/apps/1565090/ss_f4ce6bee4376a65315e9fa79d3c9f232714aab0f.1920x1080.jpg?t=1658637165,https://cdn.akamai.steamstatic.com/steam/apps/1565090/ss_d541313a45eaa01417ccf9cca77ba248ca81a558.1920x1080.jpg?t=1658637165,https://cdn.akamai.steamstatic.com/steam/apps/1565090/ss_90f7e5fdde5998a70f6f6ff0faf2748a53cc2804.1920x1080.jpg?t=1658637165,https://cdn.akamai.steamstatic.com/steam/apps/1565090/ss_d80f5841487d61c323b9c8d32a9812719b3e4f8f.1920x1080.jpg?t=1658637165,https://cdn.akamai.steamstatic.com/steam/apps/1565090/ss_edfeb16bc2d896246b8f6ea593cd2b503b7bb352.1920x1080.jpg?t=1658637165,https://cdn.akamai.steamstatic.com/steam/apps/1565090/ss_1abbb15cc73ee44c18efb96f112201d7a6fb49ec.1920x1080.jpg?t=1658637165,https://cdn.akamai.steamstatic.com/steam/apps/1565090/ss_08f36c4df698e2b9457b8c3bf2c29bd0d887b07f.1920x1080.jpg?t=1658637165",
    "Slug": "gearhead-caramel",
    "Meta Title": "GearHead Caramel: Jul 21, 2022, Joseph Hewitt and Full Ov...",
    "Meta Description": "Looking for information on GearHead Caramel? Check out the release date (Jul 21, 2022), developer insights from Joseph Hewitt, and a complete game summary.",
    "Alt Text Image": "Official header image for GearHead Caramel game - Steam 1565090",
    "Canonical URL": "https://gusku.site/game/gearhead-caramel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"GearHead Caramel\", \"description\": \"Looking for information on GearHead Caramel? Check out the release date (Jul 21, 2022), developer insights from Joseph Hewitt, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Joseph Hewitt\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Joseph Warwick Victor Hewitt\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1565090/header.jpg?t=1658637165\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.69, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}