{
    "AppID": 1048830,
    "Name": "Horse Riding Tales",
    "Release date": "Apr 12, 2019",
    "About the game": "THE MULTIPLAYER HORSE RIDING GAME OF YOUR DREAMS. Begin your journey from lowly stable hand to dressage super star! Join our horse loving online world where you can customise your character, tame beautiful horses, bring them to your stable and train them for challenging show jumping championships. WELCOME TO MEADOWCROFT A small, centuries old town surrounded by rolling fields and vast, open plains. Sleepy. Rustic. Idyllic. Full of animals big and small. A paradise of peace and tranquillity. A town with a passion for horses that’s as old as the foundations it was built on. Home to Layla, lowly stable hand. A girl who, though surrounded by horses each and every day, has never yet sat astride one, but all that is about to change! RIDE WITH YOUR FRIENDS Ride your horse as a girl with all your friends as you set out on adventures to explore the outskirts of your farm and beyond in glorious 3D! ENDLESS CUSTOMISATION Create an amazing look for you and your horse as you compete for glory in the Meadowcroft Show Jumping Competitions. From helmets and jodhpurs for you - and saddles, leg wraps and masks for your horse, there are thousands of looks you can create. TAME BEAUTIFUL HORSES Create a magical bond with wild horses such as the Mustang, Dapple Grey and Appaloosa as you tame and care for them, preparing the stallion to be ridden as you set out on your quest. A MYSTERY TO SOLVE Uncover the mystery of the fabled fantasy sky riders - mystical Pegasus and Unicorn horses who once roamed free in the haven above the clouds. JOIN THE SHOW JUMPING &amp; DRESSAGE ACADEMY You may be invited to join the prestigious Meadowcroft riding academy, a school that’s seen countless thousands of equestrians pass through its gates and over its grasslands. Compete against other students in equestrian competitions as you uncover the mystery of the sky riders. CRAFT ITEMS Explore the world and mine resources to create beautiful accessories for your horse such as saddles, bridles, blankets and more! CARE FOR YOUR HORSE Complete horse care quests by crafting hay, horseshoes and other items for your horse to keep her in high spirits. The happier your animal, the better it will jump in equestrian events. More than just a simulator, this game takes mobile equestrian games to a new level! Foxie Ventures would like to welcome you to the Horse Riding Tales family! We will be adding lots of new content, from a Shetland pony to more fantasy pegasus &amp; unicorn horses to challenging breeding quests. Kick off your interactive adventure and download free today! Horse Riding Tales is completely free to play but some optional in-game items may require payment. You must read and accept our Privacy Notice and Terms &amp; Conditions before downloading this app.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1048830/header.jpg?t=1555126785",
    "Price": 0.0,
    "Developers": "Foxie Games",
    "Publishers": "App Business Ventures LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1048830/ss_795a059ce8824ba5aef697804812d04c1e8ee453.1920x1080.jpg?t=1555126785,https://cdn.akamai.steamstatic.com/steam/apps/1048830/ss_41b418bca26fbf38f77c4a611a9c33c41964ef70.1920x1080.jpg?t=1555126785,https://cdn.akamai.steamstatic.com/steam/apps/1048830/ss_a14dcf09dd7c40cc39ab4d023d06eb622f928792.1920x1080.jpg?t=1555126785,https://cdn.akamai.steamstatic.com/steam/apps/1048830/ss_250ef50c6f2569531e0a69241dd3cdd0cfcae21e.1920x1080.jpg?t=1555126785,https://cdn.akamai.steamstatic.com/steam/apps/1048830/ss_66cce2875648387550d4654e342827fd709dca80.1920x1080.jpg?t=1555126785",
    "Slug": "horse-riding-tales",
    "Meta Title": "Horse Riding Tales: Apr 12, 2019, Foxie Games and Full Ov...",
    "Meta Description": "Looking for information on Horse Riding Tales? Check out the release date (Apr 12, 2019), developer insights from Foxie Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Horse Riding Tales game - Steam 1048830",
    "Canonical URL": "https://gusku.site/game/horse-riding-tales",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Horse Riding Tales\", \"description\": \"Looking for information on Horse Riding Tales? Check out the release date (Apr 12, 2019), developer insights from Foxie Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Foxie Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"App Business Ventures LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1048830/header.jpg?t=1555126785\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}