{
    "AppID": 1360850,
    "Name": "Isles of Yore",
    "Release date": "Feb 10, 2022",
    "About the game": "Isles of Yore is a multiplayer simulator that aims to make you experience what it was like to go through life as a prehistoric animal. Survival Claim your domain with an animal of your choosing in an environment that best suits your needs—dense jungle, treacherous swamps, and the wide open areas of the island all offer unique advantages and challenges. Compete with other players and AI in a bid for supremacy and survival in the food chain. The game's core centers around making you feel like your animal, putting you in full control and giving you a sense of what it was like for the animal when it roamed the Earth, growing and tending to your needs. Balancing your thirst, hunger, and stamina are vital day-to-day concerns as you explore the rich environment around you alone or in a pack of friends. The initial batch of planned animals selectable for play will center around small to medium sized theropod dinosaurs like Coelophysis, with a plethora of AI driven characters inhabiting and stalking the land around you. The first early access release kicks-off with two playable characters. The aforementioned Coelophysis serves as the first fully fleshed out playable animal, with Deinonychus also already available as an additional character, though is still undergoing polish and is currently marked as a preview. Future updates will extend this roster further, with larger animals and aquatic biomes planned. Customisation The game includes a character customisation, giving you creative control over aspects such as patterns, colouring, and skin types. Proto-feathers or scales? It's up to you. A dynamic world The game is set on a large, diverse island with its own day/night cycle and highly variable weather. Fog, snow, and storms may reduce your vision as you navigate through the world. Or, if you're lucky, you might be able to enjoy the aurora on a clear night's sky. Animals can be seen roaming the island, with carnivore AI hunting for their meals—make sure you don't end up on the menu! A big goal of the project going forward is to build on the initial AI systems, such as by expanding the herbivore AI and generally making the animals feel more true to life with behaviour that uniquely suits them. Custom servers Documentation on server hosting is available, with a plethora of options available for server owners—weather changes, time of day progression, AI count, gameplay parameters such as the speed at which your needs deplete, stats overrides, and many more are all available to tailor the experience to your community's liking. Social Going at it alone is not required, as grouping and chatting (toggleable) with your friends is fully supported. A labour of love Isles of Yore is a passion project started from a place of admiration for the awe-inspiring history of life on our planet. The path forged by games in the survival genre offers a uniquely visceral, tantalising glimpse into this strange and wondrous past, and the project intends to build on this formula with special care to highlight the uniqueness of the animals that came before us. Your feedback is most welcome in the Discord to help drive development.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1360850/header.jpg?t=1644708493",
    "Price": 19.99,
    "Developers": "MaverickMatryoshka",
    "Publishers": "MaverickMatryoshka",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1360850/ss_6d41d4263838a5accae41d17ab16e453792dba43.1920x1080.jpg?t=1644708493,https://cdn.akamai.steamstatic.com/steam/apps/1360850/ss_cffa2fb1068b9888598eb453d31d1157c73f63d2.1920x1080.jpg?t=1644708493,https://cdn.akamai.steamstatic.com/steam/apps/1360850/ss_354a7dc8fafda2f4d34d090fa9fd0983322c653e.1920x1080.jpg?t=1644708493,https://cdn.akamai.steamstatic.com/steam/apps/1360850/ss_4dae98c4235b59809b5ab236d29d67505ba818fc.1920x1080.jpg?t=1644708493,https://cdn.akamai.steamstatic.com/steam/apps/1360850/ss_d5f0ac4fa91720f6be9e6f18af8b5247f6b51dd4.1920x1080.jpg?t=1644708493,https://cdn.akamai.steamstatic.com/steam/apps/1360850/ss_53a30d7481ff43434145b521897626db1705f975.1920x1080.jpg?t=1644708493,https://cdn.akamai.steamstatic.com/steam/apps/1360850/ss_d09f8a7d035c599eacde1200261d6ae7e9a999a9.1920x1080.jpg?t=1644708493,https://cdn.akamai.steamstatic.com/steam/apps/1360850/ss_8b2089416c7f3f36a91235560acd2695dbddf949.1920x1080.jpg?t=1644708493,https://cdn.akamai.steamstatic.com/steam/apps/1360850/ss_520f9d9f3163a03cc275b8ad69793dbafe746669.1920x1080.jpg?t=1644708493",
    "Slug": "isles-of-yore",
    "Meta Title": "Isles of Yore: Feb 10, 2022, MaverickMatryoshka and Full ...",
    "Meta Description": "Looking for information on Isles of Yore? Check out the release date (Feb 10, 2022), developer insights from MaverickMatryoshka, and a complete game sum...",
    "Alt Text Image": "Official header image for Isles of Yore game - Steam 1360850",
    "Canonical URL": "https://gusku.site/game/isles-of-yore",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Isles of Yore\", \"description\": \"Looking for information on Isles of Yore? Check out the release date (Feb 10, 2022), developer insights from MaverickMatryoshka, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"MaverickMatryoshka\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MaverickMatryoshka\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1360850/header.jpg?t=1644708493\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}