{
    "AppID": 873890,
    "Name": "Legends of Amberland: The Forgotten Crown",
    "Release date": "Aug 1, 2019",
    "About the game": "Inspiration: The game is a classic western RPG inspired by the games from the 90s. Basically, it’s the kind of game I personally find missing nowadays. Light, fairy tale, epic, heroic and slightly humorous. One that does not take tons of hours to complete or require endless grind to progress. Something that caters to players like me who don’t have tons of hours to beat one game but still like to play and have a sort of nostalgia for the way games were made in the old days. It was inspired by Dungeon Master, Eye of The Beholder 2, Might &amp; Magic 3-5, Crystals of Arborea (a not so well known prequel to Ishar series), GoldBox series (Champions of Krynn, Dark Queen of Krynn, etc). Core Design Choices: 1) Classic, 90 degree rotation, FPP, turn-based, tile movement RPG. 2) Party-based (7 heroes, either predefined or manually assembled upon new game). 3) Open world with a big overworld to explore. 4) Fast paced combat. Quick travel. Easy inventory management. No grind. 5) Light, fairy tale like fantasy, epic story about heroes on a noble quest. Mechanics: Mechanically it’s 100% turn based (so you can go and make tea in the middle of a fight) with grid movement and 90 degree rotation. All this is very fast paced, both combat and travel is really fast. The goal was to cut down the boring parts and flesh out the fun parts. Overall, the mechanics are pretty traditional and straightforward with modern additions like weightless bag combined with equipment encumbrance system. World and Storyline: Storyline is a fairy tale, mythical heroic fantasy. You are the good guys on a quest to fight the forces of evil. The world is non linear, with very few locked areas. You basically can go anywhere and do things in different order. In addition you can choose a different set of quests to finish the game (but those are not mutually exclusive, so you can finish all quests if you like). It’s more world driven than story driven. The priority was to make the world feel alive and let you explore it as you wish than follow a linear list of quests. The game starts when the royal wizard finds out about an old crown that belonged to the royal family for generations. Yet, strangely no one ever heard about the crown and there was just a single mention of it in the royal annals. Upon further study he discovered that there has been cast a powerful spell of forgetfulness of unknown origin which caused everyone in the whole land to forget the crown ever existed. Without knowing who or why someone went to such trouble to conceal the existence of the crown he decided to investigate it. He summoned a party of noble heroes and tasked them with finding whereabouts of the mysterious crown and the origin of the spell. FAQ: Q: How long it takes to beat the game? A: According to Early Access players it can take between 20 and 50 hours to finish the game (I estimate a typical playthrough would be 25-40 hours for most players). Q: Can I create party members or are they predefined? A: Yes, you can create all party members upon start if you wish (there is also a quick start option).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/873890/header.jpg?t=1650538124",
    "Price": 19.99,
    "Developers": "Silver Lemur Games",
    "Publishers": "Silver Lemur Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/873890/ss_7dc15bc1bb0330507249d93c1f888e27e74d1b10.1920x1080.jpg?t=1650538124,https://cdn.akamai.steamstatic.com/steam/apps/873890/ss_871cc2478f2caa5147271722fe69903bfbfa616e.1920x1080.jpg?t=1650538124,https://cdn.akamai.steamstatic.com/steam/apps/873890/ss_1fcd55699190a70dba63240e3ba5ebe2ca5cdf03.1920x1080.jpg?t=1650538124,https://cdn.akamai.steamstatic.com/steam/apps/873890/ss_d7dd07ac9d69fde8f1e29d12a48bdf4d7db74c42.1920x1080.jpg?t=1650538124,https://cdn.akamai.steamstatic.com/steam/apps/873890/ss_bd0771946d91884cea034dd2ac13aa9f8b40737f.1920x1080.jpg?t=1650538124,https://cdn.akamai.steamstatic.com/steam/apps/873890/ss_c45337759fd0efadbead20e9fe7a60febebdc8b9.1920x1080.jpg?t=1650538124,https://cdn.akamai.steamstatic.com/steam/apps/873890/ss_b06230c9d859e97657cfb5c05b1962a3e4424e32.1920x1080.jpg?t=1650538124,https://cdn.akamai.steamstatic.com/steam/apps/873890/ss_d4c6d566a5dcecff0c970c5be0798267e8e838b4.1920x1080.jpg?t=1650538124,https://cdn.akamai.steamstatic.com/steam/apps/873890/ss_c7024ba6cf318c0cecaeb3c3166f1bc7f332f9c6.1920x1080.jpg?t=1650538124,https://cdn.akamai.steamstatic.com/steam/apps/873890/ss_e013ea569a238ccb67a49c5293dbe4dee2a8ca7f.1920x1080.jpg?t=1650538124",
    "Slug": "legends-of-amberland-the-forgotten-crown",
    "Meta Title": "Legends of Amberland: The Forgotten Crown: Aug 1, 2019, S...",
    "Meta Description": "Looking for information on Legends of Amberland: The Forgotten Crown? Check out the release date (Aug 1, 2019), developer insights from Silver Lemur Gam...",
    "Alt Text Image": "Official header image for Legends of Amberland: The Forgotten Crown game - Steam 873890",
    "Canonical URL": "https://gusku.site/game/legends-of-amberland-the-forgotten-crown",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Legends of Amberland: The Forgotten Crown\", \"description\": \"Looking for information on Legends of Amberland: The Forgotten Crown? Check out the release date (Aug 1, 2019), developer insights from Silver Lemur Gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 1, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Silver Lemur Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Silver Lemur Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/873890/header.jpg?t=1650538124\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}