{
    "AppID": 1637970,
    "Name": "LOGistICAL 3",
    "Release date": "Jun 17, 2021",
    "About the game": "LOGistICAL 3 is a large open-world, strategy, puzzle game where you transport different cargoes to complete all the cities and businesses throughout each module. There are many challenges and puzzles along the way including road blocks, quarantines, industry upgrading, industry building, specialised cargos, road upgrades and much more. New high resolution satellite maps allows you to see the entire planet in detail, right down to the house. Other mapping modes also give you wonderful views of the planet.i Besides the wonderful maps, many towns and businesses has an image, 'Fun Facts' and a link to the internet to immerse you even more. LOGistICAL 3 continues on from LOGistICAL and LOGistICAL 2 bringing you game modules based on countries and states. Each DLC is a complete game with its own uniqueness, game-play and different methods. LOGistICAL 3 begins with 'LOGistICAL 3: Kansas'. LOGistICAL 3 vs LOGistICAL Earth Both LOGistICAL 3 and LOGistICAL Earth use the same game engine and version. LOGistICAL 3 is a collection of smaller, more detailed modules of specific states or countries, while LOGistICAL Earth covers the entire planet with a much smaller amount of towns and businesses within each country/region. LOGistICAL Earth doesn't drill down to the state level, so Kansas within LOGistICAL Earth is just part of the overall region of the USA. LOGistICAL 3 released as its own version so you don't need to own any other module (including LOGistICAL Earth) to play it. Also you don't need LOGistICAL 3 in order to play LOGistICAL Earth. LOGistICAL 3 Tutorial LOGistICAL 3 doesn't yet have its own tutorial. There are lots of free tutorials available to learn LOGistICAL including: LOGistICAL 3: Earth Demo (free) / LOGistICAL 2: Tuvalu (free) / LOGistICAL 1: ABC Islands (free) / LOGistICAL Overview LOGistICAL is a huge puzzle while each city is its own little piece of puzzling. Plenty of cities are easy enough. Some take complex planning. Do them in your own order. Get bonuses for completing countries, continents and contracts. Some cargoes are easy to get. Others you have to create in industries. Use existing industries and build your own. The further you get from the start the more strategies you have to use. Pimp up your transports with boosts. Last transport delivering gets the boost. The cities and map are to scale. Current or historical industry placement. It is very educational. There is plenty more to keep you on your toes. Cities consume the cargoes you are trying to get to completion. Big transports are great for moving lots of stuff, but can't travel everywhere. There are lots of broken transport routes that need deliveries. Upgrade the industries for better exponential throughput. Cargo stores can sure come in handy. ... and what is with those quarantine checkpoints? Complete cities, roads, industries, contracts, regions and states for lots of in-game and Steam achievements.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1637970/header.jpg?t=1624152403",
    "Price": 9.99,
    "Developers": "Sacada",
    "Publishers": "Sacada",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1637970/ss_f5c35cb0ec5d9d581aa8091c4fa6145ae1370f20.1920x1080.jpg?t=1624152403,https://cdn.akamai.steamstatic.com/steam/apps/1637970/ss_b4fc71a42940c3d11d0351046af64eef6c868628.1920x1080.jpg?t=1624152403,https://cdn.akamai.steamstatic.com/steam/apps/1637970/ss_60b127333a5a1eca8729fb8223a3136e04f3da1a.1920x1080.jpg?t=1624152403,https://cdn.akamai.steamstatic.com/steam/apps/1637970/ss_2f59f173fd31e8168a5f130fa4db4ead392d8d3e.1920x1080.jpg?t=1624152403,https://cdn.akamai.steamstatic.com/steam/apps/1637970/ss_9f5def3f9f9d98a8cd049c4cabd63a1d230f6c51.1920x1080.jpg?t=1624152403,https://cdn.akamai.steamstatic.com/steam/apps/1637970/ss_27d16b424069c5b2cb5ba844eaebc2ac73099c54.1920x1080.jpg?t=1624152403",
    "Slug": "logistical-3",
    "Meta Title": "LOGistICAL 3: Jun 17, 2021, Sacada and Full Overview",
    "Meta Description": "Looking for information on LOGistICAL 3? Check out the release date (Jun 17, 2021), developer insights from Sacada, and a complete game summary.",
    "Alt Text Image": "Official header image for LOGistICAL 3 game - Steam 1637970",
    "Canonical URL": "https://gusku.site/game/logistical-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LOGistICAL 3\", \"description\": \"Looking for information on LOGistICAL 3? Check out the release date (Jun 17, 2021), developer insights from Sacada, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1637970/header.jpg?t=1624152403\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}