{
    "AppID": 908070,
    "Name": "Mystic Vale",
    "Release date": "Jan 31, 2019",
    "About the game": "Take on the role of a druidic clan and use your blessings to heal the Valley of Life. This task doesn’t come easy though, it requires both courage and caution as it can be easy to overwhelm the land if you’re careless or wield too much power. Based on the Origins award-winning board game from AEG, get ready for an all-new deck-building experience in Mystic Vale. With the innovate Card Crafting System, you can keep improving and building your cards to create a diverse and effective deck. Mystic Vale is easy to pick up for those new to deck-building games, yet is challenging even for those skilled in the genre. Practice against AI opponents before you take the battle online, where you can find and create public or private rooms to play against friends or random players! Cards combine in a variety of different ways creating powerful combos. What combo wins one match might not win you your next one, though. If you’re a risk-taker, Mystic Vale has a push-your-luck element, but if you spoil your hand, you’ll miss your turn and maybe even that special card you were hoping to collect. Remember, keep an eye on your opponent’s cards to see what advantage they may have over you and which cards they may want. Mystic Vale debuts a new approach to the deck-building genre. You start and play through the game with the same 20 cards, however, each card has 3 slots available within it which you can add advancements to by buying them from the field. Each advancement has different abilities and properties, which when mixed together can create powerful combos. Some cards will offer you extra resources and perks but they may come at a high cost. Determine your strategy and build your deck to your play style. Find online matches within the community or host your own private matches with friends. You can set the matches to suit you, whether you want an extended pool, playing with/without expansions or want to add turn timers to keep the game moving quickly. Online multiplayer is also available cross-platform so you can play against your fellow druids no matter if they’re on PC, Android or iOS. If your clan are all together in one place, Mystic Vale also supports Hot Seat for up to 4 people! Discover amazing artwork throughout the game. Each card within the game has a subtle hint of animation helping to really bring the game to life. May your clan cleanse the Valley of Life!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/908070/header.jpg?t=1653309971",
    "Price": 12.99,
    "Developers": "Nomad Games",
    "Publishers": "Nomad Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/908070/ss_b4752bca4a1212ec483b3e47ffd6ec28de6d2e79.1920x1080.jpg?t=1653309971,https://cdn.akamai.steamstatic.com/steam/apps/908070/ss_5bbe7a07cdacb9e0295175afc90eb3596f7b939c.1920x1080.jpg?t=1653309971,https://cdn.akamai.steamstatic.com/steam/apps/908070/ss_ad9aee1210238ac73afbceb573e1f7fa17dc1714.1920x1080.jpg?t=1653309971,https://cdn.akamai.steamstatic.com/steam/apps/908070/ss_6939989a3a57971f328ec0f52dd1a4d9e178f97f.1920x1080.jpg?t=1653309971,https://cdn.akamai.steamstatic.com/steam/apps/908070/ss_7c84b213a1ecbbe185c7dd8f2f3082697d43f944.1920x1080.jpg?t=1653309971",
    "Slug": "mystic-vale",
    "Meta Title": "Mystic Vale: Jan 31, 2019, Nomad Games and Full Overview",
    "Meta Description": "Looking for information on Mystic Vale? Check out the release date (Jan 31, 2019), developer insights from Nomad Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Mystic Vale game - Steam 908070",
    "Canonical URL": "https://gusku.site/game/mystic-vale",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mystic Vale\", \"description\": \"Looking for information on Mystic Vale? Check out the release date (Jan 31, 2019), developer insights from Nomad Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nomad Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nomad Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/908070/header.jpg?t=1653309971\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}