{
    "AppID": 740250,
    "Name": "Neos VR",
    "Release date": "May 4, 2018",
    "About the game": "Neos VR is a metaverse engineered for the unknown! It’s one of the most versatile and feature rich metaverses for virtual reality, designed so everybody can find something interesting or useful to do in a social setting. It serves as a casual hangout experience with multimedia and games, creator, builder and developer sandbox, professional work tool, educational experience and much more! We believe that social VR should be part of everyone’s life, no matter what they do and it should enhance how they communicate and share their ideas and lives with others. We have built Neos to give your mind superpowers. Come join our diverse and creative community and bring your own uniqueness to the shared universe! Here are some of the major features that Neos VR offers: State of the art avatar system Import, build and setup your avatar completely in-game Fully configurable full body IK with up to 11 tracking points (head, hands, hips, feet, chest, elbows and knees) Blendshape support with automatic viseme setup Interactive dynamic bones with collisions and grabbing Quickly add accessories or modify in-game - adding a hat is as simple as putting it on your head Visual scripting to add unique customizations and behaviors Social Features Virtual camera - captures photos, stereo, 360 or even object cutouts, with configurable resolution Easy media sharing - copy and paste video files (including YouTube links), music, pictures and 3D models instantly into any world for free. Everything is fully synchronized Friend system - see when your friends are online and which worlds are they in Messaging system - send messages, invites and even arbitrary objects in-game Twitch integration for next level interaction with audience - chat with custom emote support and visual scripting access for interactive worlds Fully featured Desktop mode - play without VR! First person mode - interact from the viewpoint of your character! Any tools, gadgets and guns are automatically posed and fully usable Third person mode - want to see your avatar when you socialize or build? This mode is ideal for you and all the interactions still work! Freeform Camera mode - decouple the view from your character completely and move it freely around - ideal for building worlds in desktop UI Aligned Camera mode - click on any in-world UI to align it with your screen and free your mouse cursor to make the interaction much easier Toggle between Desktop and VR - no restart needed! If you play both in VR and desktop, you can toggle between each with a press of a key[/list] Advanced locomotion system Walking, sliding, zero-G , spherical gravity and more Climbing both environment and other players Teleporters, force fields, springs, portals and custom coordinate spaces Quick in-game scaling - shrink or grow to any scale! Highly configurable and scriptable - build jet packs, swinging ropes, gravity lifts and more completely in-game Dynamic &amp; unique experience every day Inventory system - save and spawn anything anywhere! You’re not limited by what the creator of the world has included with it Everything is editable! Unless the world owner has locked things down, any world and item can be modified, remixed and extended Multi-instancing - you can be connected in multiple worlds at the same time and instantly switch between them like tabs in a web-browser Fixes and edits can be done within seconds/minutes in-game - no complex and time consuming upload process to go through Creator’s playground Build everything collaboratively in real time with your friends without taking your headset off Simple creative tools - brushes, material guns, shape tools Advanced building tools - scene / component inspector, editing gizmos Powerful visual scripting language (LogiX) capable of easily adding custom interactions to literally anything, to building complex systems, games and simulations Import game assets as you work - over 40 3D model formats (including FBX, Blend, OBJ), textures/images, audio Powerful work tool Slice any imported 3D model to aid with visualization Volumetric data visualization (e.g. CT or MRI) with slicing and filtering Export anything you’ve created or modified as 3D model and make Neos part of your pipeline Basic in-game texture &amp; mesh processing for common modifications Advanced in-game camera with control panel , anchors allows to easily get good shots for video clips or live streams You are in control of your own experience Permission system to restrict what others can do in your worlds Private sessions - with P2P hosting and secure authentication Effortless self hosted sessions Headless server for setting up custom dedicated servers (currently in private beta) Wide hardware support PCVR &amp; Mobile VR with crossplay Full Index Controller support with finger tracking Leap Motion support with full body avatars Eye tracking support (Vive Pro Eye) - look direction, eye closing, pupil dilation Lip tracking support (HTC Vive Facial Tracker) - track your mouth, cheeks and tongue on your avatar or utilize the raw data Haptics feedback support (bHaptics, OWO Game Suit) with avatar to avatar interactions as well as environment interactions Rapid Development The fastest growing social VR platform New major features every month Updates and bug fixes (usually) every day - many minor issues are fixed within a day Community driven - your feedback and support shapes the development of this project! Neos VR is a labour of love for us and our goal is to build a metaverse the way we imagine it should be, without influences of large corporations. We’re a very small and nimble team, but we have gotten this far thanks to our amazing community and Patreon supporters, who keep this project going. If you enjoy what we do, please enjoy supporting the development. Here are some of the things you’d be contributing to: What’s coming in the future? UI/UX redesign Full rigidbody physics Terrain system Timeline animation system Screenshare Advanced optimizations New building tools AR support And more!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/740250/header.jpg?t=1644514447",
    "Price": 0.0,
    "Developers": "Frooxius",
    "Publishers": "Solirax",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/740250/ss_59426d9f7410fa97d744445ce2db412198fe7e5e.1920x1080.jpg?t=1644514447,https://cdn.akamai.steamstatic.com/steam/apps/740250/ss_2c2676fb96a2f1d14151506b3e4a02d1e056e2ad.1920x1080.jpg?t=1644514447,https://cdn.akamai.steamstatic.com/steam/apps/740250/ss_cbc8231f03040b1cef00459d03d9c224aecc9090.1920x1080.jpg?t=1644514447,https://cdn.akamai.steamstatic.com/steam/apps/740250/ss_63a62ca5253a1f295ce77707f27a907ee9f7fa7d.1920x1080.jpg?t=1644514447,https://cdn.akamai.steamstatic.com/steam/apps/740250/ss_d5284f881f73e0232444ecd8494acede34704f1b.1920x1080.jpg?t=1644514447,https://cdn.akamai.steamstatic.com/steam/apps/740250/ss_95a918c2a6653c91d9e9de8f07eff92f34152e2e.1920x1080.jpg?t=1644514447,https://cdn.akamai.steamstatic.com/steam/apps/740250/ss_1dde950bfdd541f617ad3bc170759a965bc46567.1920x1080.jpg?t=1644514447,https://cdn.akamai.steamstatic.com/steam/apps/740250/ss_c2dbef8107c022ca03fe76143ef4c83f88662473.1920x1080.jpg?t=1644514447,https://cdn.akamai.steamstatic.com/steam/apps/740250/ss_723622f15af42f5417a041bdcbd13d1523d9204e.1920x1080.jpg?t=1644514447",
    "Slug": "neos-vr",
    "Meta Title": "Neos VR: May 4, 2018, Frooxius and Full Overview",
    "Meta Description": "Looking for information on Neos VR? Check out the release date (May 4, 2018), developer insights from Frooxius, and a complete game summary.",
    "Alt Text Image": "Official header image for Neos VR game - Steam 740250",
    "Canonical URL": "https://gusku.site/game/neos-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Neos VR\", \"description\": \"Looking for information on Neos VR? Check out the release date (May 4, 2018), developer insights from Frooxius, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 4, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Frooxius\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Solirax\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/740250/header.jpg?t=1644514447\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}