{
    "AppID": 1301390,
    "Name": "No Umbrellas Allowed",
    "Release date": "Sep 3, 2021",
    "About the game": "No Umbrellas Allowed is a second hand shop simulation game set in Ajik City, 2080. In Ajik City, you're a total stranger. Because you were rescued few days ago at a beach losing everything, even your memories. The person who saved you is Darcy, who has been operating a 30-year-old one-and-only secondhand shop 'Darcy's' in the city. He has set you as a manager of his shop and gave you the name of his son, Bob. However, the city seems odd. People don't seem to know how to reveal their thinkings or feelings, or maybe, they're hiding them. They all seem so obsessed, whether in a favorable manner or the opposite, with something called 'Fixerain'. And some people in dark uniforms are calling themselves civil activists, while everyone calls them police-mimickers. Anyway, Let's Focus On Your Job Here. Key Features Reveal the true value of a strange item In Darcy's, your job is to both buy and sell items. When a customer is trying to sell their item, they never tell everything. So you must reveal the true value of it digging what is behind it and adjust the buying price of it. It's okay you're not an expert. You can use several tools to get some data: the item's material and condition, the year it was made and any signs of ups and downs of its value. But what if the data tells the fact but not telling any valuable information? Here's a know-how book. It contains knowledge and backgrounds such as: the city's history; the signatures of celebrities one of which may be written on an item; the popular brands and the unpopular brands, and more. Begin a tug of war with a customer: When you're confident with your information, you can start negotiating the price back and forth. The information you've collected build up a price, which you can use as a guideline. Since just a guideline, you'd better cut if off when making an offer. However, the customer is a ‘human-being’ that has as much expectation, knowledge and emotion as you. Every time you make an offer, if your fingers were not slipping, they will say “no” or “more” with a bit of annoyance. Or even they can think of an exact amount they want. And don't forget. When you either pull or push really hard during a tug of war, your opponent may get freaked out and rush outside the field. In case you don't have enough cash at a moment when you meet quite a charming item, loan options offered by Darcy, banks, or foreign lenders are ready. Sell much higher than you paid If you made it, now you can sell the item. By displaying it on the showcase, one of the prospective customers may come in and decide whether to buy it or not depending on its price that you set when displaying it. The basic rule here is BUY LOW and SELL HIGH. But don't get too greedy. If your selling price is unreasonably high, customers mostly give up and items will stay in the showcase for too long. Of course, you should consider your reputation too. Big and small fights with customers can lead to a bad reputation, and it leads to fewer customers, fewer profits. Check your reputation via Reputation Board and try to make a good impression on each customer. Guess what item they are looking for: Sometimes, there may be a customer who's looking for a certain type of items. For example, art lovers may look for art-related items, history lovers may look for history-related ones. Don't try to guess what will happen if you let them down. There’re much greater opportunities outside the store too. Visit a neighboring flower shop to buy some charming flowers to attract customers, or go to a repair shop to fix items undervalued due to their poor condition. And this is optional but strongly recommended: Listen carefully to what your neighbors say. Get around the city and pay attention to what they're talking about. There may be some hints you can use to satisfy your customers as much as possible to prosper the shop. Somehow, if lucky, you can even get a clue to your past days and find out what is really happening in this city to change its tomorrow.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1301390/header.jpg?t=1635477987",
    "Price": 19.99,
    "Developers": "Hoochoo Game Studios",
    "Publishers": "Hoochoo Game Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1301390/ss_8e9fd59624762a75775433c5bee2d3461e1074a9.1920x1080.jpg?t=1635477987,https://cdn.akamai.steamstatic.com/steam/apps/1301390/ss_c5baa9c407e85d015035d88da27cbe6079421810.1920x1080.jpg?t=1635477987,https://cdn.akamai.steamstatic.com/steam/apps/1301390/ss_039abaf395edca8a7147b5cc7d8b83acaa51ddd8.1920x1080.jpg?t=1635477987,https://cdn.akamai.steamstatic.com/steam/apps/1301390/ss_cd09b2379d860af5127a6c44eec823ccf7780130.1920x1080.jpg?t=1635477987,https://cdn.akamai.steamstatic.com/steam/apps/1301390/ss_79c6ade114c5a3d69a86457b5186554d917067c6.1920x1080.jpg?t=1635477987,https://cdn.akamai.steamstatic.com/steam/apps/1301390/ss_a1a0de79020c25bd1f03cf0992798696d513e4a0.1920x1080.jpg?t=1635477987,https://cdn.akamai.steamstatic.com/steam/apps/1301390/ss_461742f93fc332d352ac8bbef55377ee8dc983a7.1920x1080.jpg?t=1635477987,https://cdn.akamai.steamstatic.com/steam/apps/1301390/ss_ac72f08ca53755e64487a696bb4bec69d05c831f.1920x1080.jpg?t=1635477987,https://cdn.akamai.steamstatic.com/steam/apps/1301390/ss_30e3c8130751bab759690bd12a81c37f2b40ed91.1920x1080.jpg?t=1635477987,https://cdn.akamai.steamstatic.com/steam/apps/1301390/ss_d2cce1e0efea045456cac09b96f33358d9e10f94.1920x1080.jpg?t=1635477987,https://cdn.akamai.steamstatic.com/steam/apps/1301390/ss_b6032855638b02ebabf7d058ba55bcfc8f4ca610.1920x1080.jpg?t=1635477987,https://cdn.akamai.steamstatic.com/steam/apps/1301390/ss_cf05a4addc95b45b47303db578c4f55563d7d9c3.1920x1080.jpg?t=1635477987",
    "Slug": "no-umbrellas-allowed",
    "Meta Title": "No Umbrellas Allowed: Sep 3, 2021, Hoochoo Game Studios a...",
    "Meta Description": "Looking for information on No Umbrellas Allowed? Check out the release date (Sep 3, 2021), developer insights from Hoochoo Game Studios, and a complete ...",
    "Alt Text Image": "Official header image for No Umbrellas Allowed game - Steam 1301390",
    "Canonical URL": "https://gusku.site/game/no-umbrellas-allowed",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"No Umbrellas Allowed\", \"description\": \"Looking for information on No Umbrellas Allowed? Check out the release date (Sep 3, 2021), developer insights from Hoochoo Game Studios, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 3, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hoochoo Game Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hoochoo Game Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1301390/header.jpg?t=1635477987\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}