{
    "AppID": 656530,
    "Name": "Pro Gamer Manager 2",
    "Release date": "Oct 5, 2017",
    "About the game": "Pro Gamer Manager 2 is incomplete and currently in a alpha stage. PGM 2 puts you in charge of creating your very own successful e-sport organization. To achieve this you, as Manager, need to take good care of your Pro Gamers physical and mental health to make sure they can deliver on match day. If they do, your team may survive another day in the dog-eat-dog world of professional e-sport. Choose how your Pro Gamers should improve their performance in the area you find most important using the attribute points. Name and design the logo for your team. Build and customize your own house according to your own dreams and your Pro Gamers needs. Build a toilet to avoid accidents. Make sure the fridge is well stocked and the beds comfy to keep everyone at their best. Set up your team for stardom by choosing the right sponsors for your team. Make sure to keep your Pro Gamers happy and taken care of to maximize their performance. Keep track of all the money coming in and out to aviod bankruptcy. Choose the lineup that will perform best right now and enter the arena. Do you prefer the bad shooter that has great leadership skills or the pro gamer with lightning fast reactions but with a real bad temperament? Join your Pro Gamers as they face off against the other teams and help them make the right choices to win the match. Throw a grenade to clear out the enemy. Position your units to your advantage. Charge in head on or set up ambushes for your unsuspecting enemy. Join the Pro Gamer League to gain fame and fortune as your team fights to become the top team of them all. The current version of Pro Gamer Manager 2 is a alpha version of the game. What does this mean? It means that PGM 2 is still in its early stages of development. We have completely rebuilt the game from its predecessor, so this is a completely new game. It’s built on the original PGM idea and it’s designed to be developed through an early access process. So what can you expect from PGM 2 in its current form? While there are final and core game play features implemented, there are many that aren’t or will need to be tweaked. Bugs and crashes are to be expected. There might be performance issues for some players. And more. This is all part of the development process and we’d love for you to join us early on, on this road to finish the game. So if you think our gameplay is enough for you to want to back PGM 2 in its pre alpha stage, we’d love your support. Otherwise we recommend you to wait until we’ve come further along in the development process when the game is more stable and we’ve implemented additional gameplay and other content. We’re committed to making PGM 2 the best game it can possibly be and having you join us on this journey is a vital part in making this happen.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/656530/header.jpg?t=1507236442",
    "Price": 19.99,
    "Developers": "Millenway",
    "Publishers": "Millenway",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/656530/ss_6e29e96bae7209a30c75f020cdfec93e3c420154.1920x1080.jpg?t=1507236442,https://cdn.akamai.steamstatic.com/steam/apps/656530/ss_a8deacea92dfa120318ccfab136c9f68302c86ab.1920x1080.jpg?t=1507236442,https://cdn.akamai.steamstatic.com/steam/apps/656530/ss_e9bf86e0d6b725a2b1c49d3345ed61d435e973e9.1920x1080.jpg?t=1507236442,https://cdn.akamai.steamstatic.com/steam/apps/656530/ss_41204dc5e67abaf1b8d6d7013c9e98136065fdec.1920x1080.jpg?t=1507236442,https://cdn.akamai.steamstatic.com/steam/apps/656530/ss_6ead212cffb78491b2cadb40edcd857bf606434b.1920x1080.jpg?t=1507236442",
    "Slug": "pro-gamer-manager-2",
    "Meta Title": "Pro Gamer Manager 2: Oct 5, 2017, Millenway and Full Over...",
    "Meta Description": "Looking for information on Pro Gamer Manager 2? Check out the release date (Oct 5, 2017), developer insights from Millenway, and a complete game summary.",
    "Alt Text Image": "Official header image for Pro Gamer Manager 2 game - Steam 656530",
    "Canonical URL": "https://gusku.site/game/pro-gamer-manager-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pro Gamer Manager 2\", \"description\": \"Looking for information on Pro Gamer Manager 2? Check out the release date (Oct 5, 2017), developer insights from Millenway, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 5, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Millenway\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Millenway\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/656530/header.jpg?t=1507236442\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}