{
    "AppID": 748460,
    "Name": "RealFlight 8",
    "Release date": "Mar 21, 2018",
    "About the game": "RealFlight® 8 Horizon Hobby® Edition Now with Horizon Hobby®-exclusive aircraft and technologies! RealFlight® is the #1 RC flight simulator in the world. It's the best tool new RC pilots can use when learning how to fly. It also enables experienced RC pilots to practice new maneuvers and hone their skills so they can become even better pilots. This Horizon Hobby Edition of RealFlight 8 is what almost everyone has been asking and waiting for! It adds the exclusive technologies and some of the most popular aircraft from the Best Brands in RC to the #1 RC flight simulator in the world, to deliver an experience you simply can't find anywhere else. This edition includes RealFlight 8 and the Horizon Hobby Edition Add-On DLC. Read on for more information about each of these: RealFlight 8: True to Life RC simulation RealFlight is on Steam - Get your hands on the simulator that's trained hundreds of thousands of RC pilots! Classic convenience meets enhanced capabilities in RealFlight 8! It brings back all the features and functionality of RF7.5 with several key upgrades. The same game-changing, supremely realistic physics which have drawn pilots to RealFlight since the first edition are back and further improved… and there's so much more. First up on the list of new capabilities—VR compatibility. Plug in a popular VR set available on the market and you're instantly at the field or behind the sticks. For full immersion, there's nothing else like it out there. Plus, accessing the world of RealFlight is easier than ever with a simple, intuitive interface which virtually guarantees you'll be up and flying in moments. There's zero learning curve, zero hassle, just flying fun. New for RealFlight 8, you can fly with the custom-designed InterLink controller or hook up a game console controller you might already have around the house. Next up are the flying sites and aircraft—every flying site and aircraft from RF7.5 is back. Plus there are over a dozen new aircraft and a customized FPV flying site. Plus, you can customize everything to your satisfaction with aircraft and flying site software that has also been upgraded to accept even more detailed HD models. Far from last, and certainly not least, the game-like challenges which have helped sharpen thousands of pilots' skills are back and expanded so you get more tiers of balloon-popping, spot landing bang for your buck. Trust in the RC flight simulator that has put more pilots in the air safely than any other, pick up your copy of RealFlight today! Controller Required! RealFlight 8 requires a controller to run. There are a few options here: For the best experience, we strongly recommend the InterLink-X™. RealFlight is designed for it, and your controls will all be exactly where they should be. You can use your RC Radio with an interface. The RealFlight Wired Interface works well for this, and there are 3rd-party wireless interfaces available. This option will require more setup on your part. You can use any 4-axis game controller. A gamepad will work, or an advanced flight stick. Your experience will not be as good as using a purpose-built RC radio, though. See the Announcements and Community Discussion for purchase links. Horizon Hobby Edition Add-On This content pack adds 13 Horizon Hobby aircraft to RealFlight 8: Blade Fusion 270 Blade Fusion 480 E-flite Apprentice S 15e E-flite F-27 Evolution E-flite Mini Convergence VTOL E-flite Carbon-Z Cessna 150 2.1m E-flite Timber 1.5m E-flite Timber 1.5m Float Plane FMS F-15 64mm EDF Hangar 9 Carbon Cub 15cc Hangar 9 Ultra Stick 30cc HobbyZone Sport Cub S ParkZone Conscendo Advanced It also includes 2 challenges: Hangar Obstacle Course Hangar Obstacle Course II",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/748460/header.jpg?t=1644458282",
    "Price": 0.0,
    "Developers": "Horizon Hobby, LLC",
    "Publishers": "Horizon Hobby, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/748460/ss_2815c79b9e59ff605c081ae55621899ece79f027.1920x1080.jpg?t=1644458282,https://cdn.akamai.steamstatic.com/steam/apps/748460/ss_6a39def65cb5d229514fac1d8405dcfdbfa7a685.1920x1080.jpg?t=1644458282,https://cdn.akamai.steamstatic.com/steam/apps/748460/ss_6a5262f565b712dd37b561ae19b726a60d2ab4db.1920x1080.jpg?t=1644458282,https://cdn.akamai.steamstatic.com/steam/apps/748460/ss_36b98be5ff9504b9311e1e110bd6c0608d186c44.1920x1080.jpg?t=1644458282,https://cdn.akamai.steamstatic.com/steam/apps/748460/ss_980b24afb102f2530e36b9e7ce96571ecc57bfd1.1920x1080.jpg?t=1644458282,https://cdn.akamai.steamstatic.com/steam/apps/748460/ss_2e30192686d86b7ec985f6c2da3c8784d032e3c8.1920x1080.jpg?t=1644458282,https://cdn.akamai.steamstatic.com/steam/apps/748460/ss_8db8af276ea062c1abe112ce1b30dfe2009e6eb5.1920x1080.jpg?t=1644458282,https://cdn.akamai.steamstatic.com/steam/apps/748460/ss_cd5f0111f0984dd0c25be37504231ce66be49e38.1920x1080.jpg?t=1644458282,https://cdn.akamai.steamstatic.com/steam/apps/748460/ss_464cb4629df0054bbd8569e415951793b1dde76f.1920x1080.jpg?t=1644458282,https://cdn.akamai.steamstatic.com/steam/apps/748460/ss_dc7a13d9805ebf269e42a56349bfccb17daa126e.1920x1080.jpg?t=1644458282,https://cdn.akamai.steamstatic.com/steam/apps/748460/ss_4c9147e7b71d3c9ff944788719ddca53f01d1b46.1920x1080.jpg?t=1644458282",
    "Slug": "realflight-8",
    "Meta Title": "RealFlight 8: Mar 21, 2018, Horizon Hobby, LLC and Full O...",
    "Meta Description": "Looking for information on RealFlight 8? Check out the release date (Mar 21, 2018), developer insights from Horizon Hobby, LLC, and a complete game summ...",
    "Alt Text Image": "Official header image for RealFlight 8 game - Steam 748460",
    "Canonical URL": "https://gusku.site/game/realflight-8",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RealFlight 8\", \"description\": \"Looking for information on RealFlight 8? Check out the release date (Mar 21, 2018), developer insights from Horizon Hobby, LLC, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 21, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Horizon Hobby, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Horizon Hobby, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/748460/header.jpg?t=1644458282\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}