{
    "AppID": 1161330,
    "Name": "Record Life",
    "Release date": "Nov 8, 2019",
    "About the game": "Different scripts, different lives You can choose a script in the game, and under certain conditions, you can try to change your life. Diversified Occupations, the Way to Work You can choose different careers in the game to make a living and save money. In future versions, if you don't like to work part-time or go to other companies, you can start your own business, or even work as a podcaster or game producer at home. Every time you start a new game, you can change your mind according to the limited conditions, and even change your life to become a local tyrant. Economic System, Large Framework There are some social and economic systems in the world that are somewhat similar to our reality. You even have to pay for water, electricity and electricity. In the bank, you can handle an emergency use of a credit card for yourself, but also in the initial bank interest to save a little more money to make profits, in the future version will also bring the Internet into the game, to achieve network financing mobile payment. In addition, you must also consider the physical condition of the day, according to the physical strength value, choose to eat to supplement physical strength, maintain a good mood, clean body, energetic. Keep in mind that you will also grow old, and there may be better ways to prolong life or let future generations inherit themselves. In random weather, unexpected events may change your original work plan. A variety of shops, entertainment and leisure Purchase food, food or personal equipment to meet working conditions and maintain good condition. You may need to buy a lot of necessities in the actual game and make more money to provide better conditions for yourself. When appropriate, you can buy some lottery tickets, speculate in stocks, go to entertainment places to relax, even if life is no longer difficult, you can not be overwhelmed by pressure. Open World, Diversified Life Game maps will grow slowly until we think they are big enough. Future versions of the game will allow you to own your own property and industry, and news and emergencies may sometimes surprise you, festivals and special situations will have some activities, maybe you can find another half and marry and have children. You should learn more new knowledge to improve your working ability and make good use of all the conditions you have. The world is your stage of development. We will divide the game development into several scripts, and the current work is focused on perfecting the first year of the first script. It will take 2-3 months to improve the content of the first year of the game development, and complete some of the planned content, so that the game can proceed normally. Then we will refine the content, reflect the change of time, and add more events and news, so that the game world continues to run. Follow-up development plan we will continue to improve in the future, now, you can prepare to start the trial version, provide feedback and help us continue to improve the game, if you have any good ideas can also tell us. Q: What happened to the RPG era? Will it be updated? Answer: Because the overhead content of RPG era is too complex, we plan to build a better independent world view and perfect the game as far as possible. If conditions permit, we need to redo the game and ensure the quality of the game. Now RPG epochs are updated at least once every 1-3 weeks/month.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1161330/header.jpg?t=1656777508",
    "Price": 2.99,
    "Developers": "创克游戏工作室,小创",
    "Publishers": "创克游戏联盟",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1161330/ss_a162bafb2583aa5f752cc0fd5069f8cf3c0efd29.1920x1080.jpg?t=1656777508,https://cdn.akamai.steamstatic.com/steam/apps/1161330/ss_391414950cf7eff9321a3c14ebb016d88fc5712d.1920x1080.jpg?t=1656777508,https://cdn.akamai.steamstatic.com/steam/apps/1161330/ss_5480da6a25b209612c7aceefe442c0fc745171be.1920x1080.jpg?t=1656777508,https://cdn.akamai.steamstatic.com/steam/apps/1161330/ss_c98e2f51274d6972e183ad4783830556f676e26a.1920x1080.jpg?t=1656777508,https://cdn.akamai.steamstatic.com/steam/apps/1161330/ss_d581a16fec1f804dd2c8faf527f8e54241f5ef2d.1920x1080.jpg?t=1656777508",
    "Slug": "record-life",
    "Meta Title": "Record Life: Nov 8, 2019, 创克游戏工作室,小创 and Full Overview",
    "Meta Description": "Looking for information on Record Life? Check out the release date (Nov 8, 2019), developer insights from 创克游戏工作室,小创, and a complete game summary.",
    "Alt Text Image": "Official header image for Record Life game - Steam 1161330",
    "Canonical URL": "https://gusku.site/game/record-life",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Record Life\", \"description\": \"Looking for information on Record Life? Check out the release date (Nov 8, 2019), developer insights from \\u521b\\u514b\\u6e38\\u620f\\u5de5\\u4f5c\\u5ba4,\\u5c0f\\u521b, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 8, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u521b\\u514b\\u6e38\\u620f\\u5de5\\u4f5c\\u5ba4,\\u5c0f\\u521b\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u521b\\u514b\\u6e38\\u620f\\u8054\\u76df\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1161330/header.jpg?t=1656777508\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}