{
    "AppID": 1017630,
    "Name": "Robot King Part 2: Boss Battles",
    "Release date": "Mar 26, 2019",
    "About the game": "The second in a 3 part series, Robot King Part 2 continues the journey of a robot on a quest to find his place in a kingdom where everything seems bent on his destruction. 'Robot King 2: Boss Battles' is a series of progressively difficult boss battles called a boss run. Your goal is to defeat the final boss (Cataclysm). After you defeat a boss, you will have the option to adapt up to two equipments and/or weapons to upgrade your robot for the current boss run attempt. These equipments are automatically equipped at the time of selection. Dying ends the current boss run attempt. But when you die, you can salvage up to one equipment/weapon to permanently upgrade your robot for the next attempt. The rest are lost. A single boss run can consist of multiple attempts from multiple deaths. Dying is adapting. Salvage and upgrade. Become the King. Robot King 2 offer two unique game modes: Standard and Hardcore. Standard: Standard mode allows you to choose which boss you want to fight. Bosses are listed in ascending order of difficulty. Whether you defeat the boss or die trying, you will always go back to the boss select screen. You can fight each boss as many times as you want. You do not need to fight every boss. In addition to the salvaging an item as a permanent upgrade when you die, in Standard mode you can also choose on the items as a permanent upgrade when you beat a boss. Your goal is to defeat Cataclysm. Hardcore: In Hardcore mode, you have to defeat every boss in order, without dying. Dying ends the current boss run attempt and you are sent back to the first boss to try again. Unlike Standard mode, you only get to permanently upgrade an item when you die. Your goal is to defeat Cataclysm. And in order to do that, you will have had to beat every boss before him without dying. Features: - 48 equipments to customize your robot, providing lots of variety for adapting your robot to each boss and your play style - 10 unique bosses - 11 unique weapons each one with its own abilities - 2 Game Modes: Standard and Hardcore - 24 Steam achievements - Leaderboard - No micro-transactions or in-app purchases. Any DLCs will be free And....For the few folks that played Robot King Part 1, you can look forward to improved collision detection, graphics, and music (and the ability to turn it off). ** A keyboard and mouse is highly recommended to play Robot King 2 **",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1017630/header.jpg?t=1553686182",
    "Price": 1.99,
    "Developers": "Steven Taylor",
    "Publishers": "Steven Taylor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1017630/ss_09148a573f91d1d5903ec1d58a549d2b10413a7d.1920x1080.jpg?t=1553686182,https://cdn.akamai.steamstatic.com/steam/apps/1017630/ss_4dd774b0b575f49b196bd4391773b29bb116df19.1920x1080.jpg?t=1553686182,https://cdn.akamai.steamstatic.com/steam/apps/1017630/ss_1f8609da57880e7512a69729ff6722f9da436a5f.1920x1080.jpg?t=1553686182,https://cdn.akamai.steamstatic.com/steam/apps/1017630/ss_8ec452951dea154d09cf63ce8b782e11c10cef0b.1920x1080.jpg?t=1553686182,https://cdn.akamai.steamstatic.com/steam/apps/1017630/ss_309cd5949e2c73b70b529734b1befe0d4b1f6e53.1920x1080.jpg?t=1553686182,https://cdn.akamai.steamstatic.com/steam/apps/1017630/ss_e27f5436f52103c66c8b1b9d24b168a02bf6a7f4.1920x1080.jpg?t=1553686182",
    "Slug": "robot-king-part-2-boss-battles",
    "Meta Title": "Robot King Part 2: Boss Battles: Mar 26, 2019, Steven Tay...",
    "Meta Description": "Looking for information on Robot King Part 2: Boss Battles? Check out the release date (Mar 26, 2019), developer insights from Steven Taylor, and a comp...",
    "Alt Text Image": "Official header image for Robot King Part 2: Boss Battles game - Steam 1017630",
    "Canonical URL": "https://gusku.site/game/robot-king-part-2-boss-battles",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Robot King Part 2: Boss Battles\", \"description\": \"Looking for information on Robot King Part 2: Boss Battles? Check out the release date (Mar 26, 2019), developer insights from Steven Taylor, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 26, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Steven Taylor\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Steven Taylor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1017630/header.jpg?t=1553686182\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}