{
    "AppID": 384480,
    "Name": "Six Sides of the World",
    "Release date": "Jan 20, 2016",
    "About the game": "SIX SIDES OF THE WORLD – ALL HAIL THE PUZZLE LORD! “Six Sides of the World” is a puzzle videogame that takes you into an intergalactic journey through different star systems riddled with brain-racking challenges. THE ULTIMATE MATCH: YOUR BRAINS vs SCI-FI HAZARDS Spatial orientation, logic and pure wit will be your weapons to go through the different cube shaped planetary systems. Each level will bring the threats to a whole new level, adding all kinds of sci-fi hazards: from portals to laser beams. You will need to carefully analyze each cubic planet to understand its dangers and potential solutions. Rushing might lead you to death: it’s all about breaking down each puzzle and finding the right pace. EXPLORE A VAST GALAXY SYSTEM Six Sides of the World presents you a series of star systems to be explored. Each one is comprised by different puzzles that introduce new and more challenging mechanics. But most interesting feature of this is that these star systems can be navigated linearly, following a easier predetermined path; or you can make a detour if you are brave enough. Some of the puzzles will present more than one possible solution, enabling the player to achieve a more difficult victory, that will unlock new extra puzzles. FROM TEST OF WIT TO ULTIMATE HEADACHE! The freedom of exploration in Six Sides of the World let you set the difficulty: the linear path takes an intelligent and resolutive mind; but the additional solutions to some of the puzzles require a true sense of understanding of each puzzle. And that’s not all! These solutions will lead you to extra puzzles that are capable of driving you insane. It is a smart way of letting the player to set the difficulty by him/herself: going for the extra solution is a way of asking for bigger challenges. And the extra levels are the biggest challenges you can face! There is a difference between understanding new mechanics and getting to their true core. Are you ready? ALL HAIL THE PUZZLE LORD! Maigo is an explorer who’s about to discover something far bigger than he expects. As he navigates through space, facing increasingly difficult puzzles, he starts to understand he’s tapping over something transcendent. Some questions arise: who has created all these worlds? What motivates this intergalactic architect? There’s an utter plan beyond all this? It is a test? A mean to protect something? In seek of the truth Maigo will have to overcome all the challenges to meet this kind of… PUZZLE GOD. FEATURES A galaxy of puzzles: Dozens of creative, defying and engaging puzzles set in cubic planetary systems Choose your way to victory: Non-linear progression with different difficulty levels. Follow the easy levels to end the game, explore the optional ones to face a real challenge. Easy to control, hard to master: Easy and intuitive controls, playable with the mouse and only one button. Otherworldly music: Soundtrack composed by Carlos Viola .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/384480/header.jpg?t=1580079265",
    "Price": 4.99,
    "Developers": "Cybernetik Design",
    "Publishers": "Cybernetik Design",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/384480/ss_e35e4fed843dd139bd3aa57b3cdc25a968a28870.1920x1080.jpg?t=1580079265,https://cdn.akamai.steamstatic.com/steam/apps/384480/ss_93179f1d3dfd6cda9e5d1d01e911dc70d4c4e992.1920x1080.jpg?t=1580079265,https://cdn.akamai.steamstatic.com/steam/apps/384480/ss_40b8d25ac580da56178bac9800f41e13d1b9bc4e.1920x1080.jpg?t=1580079265,https://cdn.akamai.steamstatic.com/steam/apps/384480/ss_44302f9780710c1590d780e14a3a2605e8d39a23.1920x1080.jpg?t=1580079265,https://cdn.akamai.steamstatic.com/steam/apps/384480/ss_a498e76dedb66eb07a0af8761b1d5469d6a131f1.1920x1080.jpg?t=1580079265,https://cdn.akamai.steamstatic.com/steam/apps/384480/ss_32cb8a39c8fc1633a4d3920827f560a88fa576e6.1920x1080.jpg?t=1580079265,https://cdn.akamai.steamstatic.com/steam/apps/384480/ss_3c3ca4f81d009bfc450b1e149f95456c11a64b9b.1920x1080.jpg?t=1580079265,https://cdn.akamai.steamstatic.com/steam/apps/384480/ss_732e66e6113660e0ff707d2b4ff8788b325e3963.1920x1080.jpg?t=1580079265,https://cdn.akamai.steamstatic.com/steam/apps/384480/ss_088a583ae0ee3bcf252fe914ba215c89c46b4dd2.1920x1080.jpg?t=1580079265,https://cdn.akamai.steamstatic.com/steam/apps/384480/ss_b7c71162ec0ffe83ec091f35c13be4a34c29eccd.1920x1080.jpg?t=1580079265,https://cdn.akamai.steamstatic.com/steam/apps/384480/ss_d83647ae6078157af1438f8ba12f518652960d30.1920x1080.jpg?t=1580079265",
    "Slug": "six-sides-of-the-world",
    "Meta Title": "Six Sides of the World: Jan 20, 2016, Cybernetik Design a...",
    "Meta Description": "Looking for information on Six Sides of the World? Check out the release date (Jan 20, 2016), developer insights from Cybernetik Design, and a complete ...",
    "Alt Text Image": "Official header image for Six Sides of the World game - Steam 384480",
    "Canonical URL": "https://gusku.site/game/six-sides-of-the-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Six Sides of the World\", \"description\": \"Looking for information on Six Sides of the World? Check out the release date (Jan 20, 2016), developer insights from Cybernetik Design, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 20, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cybernetik Design\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cybernetik Design\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/384480/header.jpg?t=1580079265\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}