{
    "AppID": 1875810,
    "Name": "Slashers",
    "Release date": "May 10, 2022",
    "About the game": "Welcome to Slashers! In Slashers always a group of young people will get into an abandoned place, you must find a way to get out of there, but it will not be easy since you will always have a murderer stalking you. Lost and found Find objects randomly on the map, these will serve as a Puzzle to fit with other fragments and weaken the enemy. Randomness Many elements of the map, such as objects are totally random every time you play a new game, the enemies are unpredictable and do not follow guidelines when going to certain places. Flee or fight You can try to escape from the enemy or fight against him, there are several objects on the map with which you can hit the enemy and stun him, this can be useful to save friends. Avoid getting caught If you are caught they will lock you in areas where your friends can rescue you or yourself on some occasions, if everyone is trapped, you will move on to another unwanted form. Complete the ritual Find various elements to fit them into fragments to weaken and defeat the enemy. Don't be alone in the dark Beware of loneliness and darkness, the longer you stay, the more you will be suggested, you will begin to hear sounds and things will begin to happen. Control the flashlight The batteries are running out and this causes you to see less and less intensely, keep the flashlight recharged with new batteries. Beware of noises Voices and interactions attract the enemy, control the noises coming out of your microphone and the actions you do, if a partner screams they can catch you in the middle. Manage the Stamina You may find yourself in cornered situations that would only save you if you could run, it could be fatal to run out of stamina. Take precautions in the face of light The light will recover you from your paranoia, however it can also be a perfect focus to attract the enemy, use it to your advantage but be careful. Manage fragments It will take a while to place the fragments, be consistent and manage it before the enemy catches you red-handed. Stay alert The enemy will turn off/on the electricity, open/close doors, remove/add gasoline to the generator. Listen to sounds Enemies always make characteristic sounds when they go for someone, if that someone is you, you will always hear a music of tension, if it disappears it means that it has stopped chasing you. Collect There will always be collectibles on the map, which you can find individually, some of them are very hidden and others are not, you will need to take them in order for the next one to be shown. Vision Enemies have a hard time seeing in the dark, play in the shadows, and avoid light emissions so they aren't detected. Phases Each fragment placed will weaken the enemy, but it will become stronger, larger, faster and more aggressive. Be smart Point out items that you will need in certain circumstances, these items will be visible at all times by all players. Modes Slashers is characterized by having various game modes, some of these are developing and others will come out little by little (Classic, Escape, Slashers, Madness and Turn). Replayability The game is designed to be replayed infinitely times, so every tent, objects, posters, will appear randomly or be randomly generated. You will also unlock difficulties as you play, this will increase the number of fragments you must get and the enemy will reach new phases. Support us We require positive reviews that we count on our website to make updates and improvements to our game, you can see all the improvements we have raised in our roadmap.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1875810/header.jpg?t=1653134290",
    "Price": 4.99,
    "Developers": "HeadArrow",
    "Publishers": "HeadArrow",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_370133d0e6adc275b3f21112ed8f3875c58fb4e1.1920x1080.jpg?t=1653134290,https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_391a6f1c9f64237fc65d0f6e1a8c093ca7af308d.1920x1080.jpg?t=1653134290,https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_5718709af2e1f9da37847e663740b84a4695eda3.1920x1080.jpg?t=1653134290,https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_37a8d075070c6ede99cd298b8a07ef0fee3f8b46.1920x1080.jpg?t=1653134290,https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_17bb9c18a7f75c7c6f6b9c272594c7cfc794d225.1920x1080.jpg?t=1653134290,https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_1e2ca1e2bbe0297391e69202847b287ac799f947.1920x1080.jpg?t=1653134290,https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_5e8d31ffbe41655c4a68ad0c41e9a4c1be4f3c83.1920x1080.jpg?t=1653134290,https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_6496e28ca2e2d867bbd2b16793321d77892fdbc5.1920x1080.jpg?t=1653134290,https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_842051751d663822de40476b33266069689e58a5.1920x1080.jpg?t=1653134290,https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_523ee54427f602dfae3d1f93c6af755ec87c8e46.1920x1080.jpg?t=1653134290,https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_9809794fec8bf5da2d1d9f8d67510e949b2bfbff.1920x1080.jpg?t=1653134290,https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_d5697dff43bd6f14b71a3180d1c5dbe29e6d2bf2.1920x1080.jpg?t=1653134290,https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_2cec1c18919ce8130fce85b92f9662180d6a72b2.1920x1080.jpg?t=1653134290,https://cdn.akamai.steamstatic.com/steam/apps/1875810/ss_5e3665e997bd001914e7a13304adb99d44bd02a7.1920x1080.jpg?t=1653134290",
    "Slug": "slashers",
    "Meta Title": "Slashers: May 10, 2022, HeadArrow and Full Overview",
    "Meta Description": "Looking for information on Slashers? Check out the release date (May 10, 2022), developer insights from HeadArrow, and a complete game summary.",
    "Alt Text Image": "Official header image for Slashers game - Steam 1875810",
    "Canonical URL": "https://gusku.site/game/slashers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Slashers\", \"description\": \"Looking for information on Slashers? Check out the release date (May 10, 2022), developer insights from HeadArrow, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"HeadArrow\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HeadArrow\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1875810/header.jpg?t=1653134290\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}