{
    "AppID": 1494670,
    "Name": "Space Dance Harmony",
    "Release date": "Feb 18, 2021",
    "About the game": "Dance, Dance, Dance! Space Dance Harmony is a VR motion-based dancing game that immerses players in a breathtaking environment shaped by the sounds and aesthetics of your favourite musical styles. Learn new choreographies by accurately mirroring dance routines performed by your new dance instructor to move up the leaderboard and gain points. Follow each dance with intuitive visual indication never before seen in a dance game. Step into this fully immersive world and shed any shyness you may have walked in with this game is sure to get everyone moving, grooving and calling dibs on the next song selection. Features Learn to Dance: Whether you’re a beginner who’s just starting out or an advanced dancer, learn moves, skills and full routines to a variety of popular music. Real Choreographies: All dance routines are created by professional dancers and instructors. Breathtaking World: Choose from a variety of immersive environments. Leaderboard: Compare your score with your friends and other Steam players. LIV: Put yourself into Space Dance Harmony and broadcast your experience with LIV, the best VR capture and live streaming app. House Party - Coming Soon: House Party is a turn based game mode that enables you to play with your friends and family at-home and keep tracks of scores. And much more to come... Early Access In its current version Space Dance Harmony is a fun dance game with the core gameplay mechanics completed. The early access features a few songs, an environment and avatars along with 1 dance instructor. During the next months we want to increase the amount of content featured in the game. We surely would increase the catalogue of music and dances. We would like to offer more variety of avatars, accessories and new environments to dance in. Above all, we want to be able to integrate some of the player feedback for the final version. Our objective is to be in early access for less than a year and release the game in 2021.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1494670/header.jpg?t=1613789724",
    "Price": 12.99,
    "Developers": "Phenomena",
    "Publishers": "Phenomena",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1494670/ss_ba4bceda2775d9e64c583345ce6c217c52632e98.1920x1080.jpg?t=1613789724,https://cdn.akamai.steamstatic.com/steam/apps/1494670/ss_a1555fac6908d22af805f7502855862ca3229507.1920x1080.jpg?t=1613789724,https://cdn.akamai.steamstatic.com/steam/apps/1494670/ss_0d8bc58af7f8ae25ac39020b9fdf2cb60150b0e6.1920x1080.jpg?t=1613789724,https://cdn.akamai.steamstatic.com/steam/apps/1494670/ss_7ad1d5fb3ce70a3ddeade1d8e2fe47ff4f4e5df8.1920x1080.jpg?t=1613789724,https://cdn.akamai.steamstatic.com/steam/apps/1494670/ss_f1108add3905d3fe2ffa6cb1b4507528fdb92ad7.1920x1080.jpg?t=1613789724",
    "Slug": "space-dance-harmony",
    "Meta Title": "Space Dance Harmony: Feb 18, 2021, Phenomena and Full Ove...",
    "Meta Description": "Looking for information on Space Dance Harmony? Check out the release date (Feb 18, 2021), developer insights from Phenomena, and a complete game summary.",
    "Alt Text Image": "Official header image for Space Dance Harmony game - Steam 1494670",
    "Canonical URL": "https://gusku.site/game/space-dance-harmony",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Space Dance Harmony\", \"description\": \"Looking for information on Space Dance Harmony? Check out the release date (Feb 18, 2021), developer insights from Phenomena, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 18, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Phenomena\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Phenomena\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1494670/header.jpg?t=1613789724\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}