{
    "AppID": 1371860,
    "Name": "Space Cube Racers",
    "Release date": "Aug 29, 2020",
    "About the game": "This game is racing game in space. So because it is a racing game, you can fly left and right, and since it is in space, you can also go up and down. The game uses newtonian physics and provides a simplified fly control (but not impossible in reality). Because it is using newtonian physics, speed is not limited but the faster you go the harder it is for your ship to turn. The goal of the game is to race through gates and reach the final line in the least amount of time. The majority of the gate is only visible through augmented reality and your ship can get through them without problem. Other game features: - 15 tracks - a single player mode with 3 difficulty of bots to get through - a local multiplayer mode, using split screen for up to 4 players - a championship mode - for the motivated player: a blender (2.79) plug-in is provided to create new tracks - the tracks definitions (ship acceleration, number of laps, etc.) are stored and can be easily modified - the championship definitions are also stored in plain text and can be easily modified - you can put your own music (in ogg format) in the playlist directory to use inside the game. Cubes ... that race ... in space ? Space cube racers is a racing game located in space. Space can be a problem since there is no ground, no air, no gravity as well as incredibly cold and empty and overall not very exciting. Except that now, in this year of 21XX, that emptiness has been decreased by adding racing tracks and racing ships to race in those tracks. Space is now suddenly much more exciting. Your ship will provide you air, mildy warm air. That means you can actually be in space, in your ship and not die of cold, or lack of pressure. Which is good. But, I hear you say, outside of space, there is not a lot of air, well none to be pedantic, and controlling a ship in space must be extremely hard and frustrating, right ? Wrong, because of this new technology: cube ships. A cube ship have 6 thrusters, one on each face. Inside that cube is a spheric cockpit from which you can pilot the ship. That sphere will turn inside the cube, which in turn will rotate the outter cubic frame in the opposite direction (because of some funny law of physics stating that for each action there is an equal and opposite reaction. And rotation is such an action). All that is monitored by a smart computer that knows which thrusters to fire to move your ship in the direction you are pointing. And this smart computer will then ensure that everytime you turn, the ship move toward the direction you are facing. That makes navigating in space a child's play. Well maybe not a child's play... but at least a lot less frustating and hard than it used to be. You will still have to show some skill... after all this is what racing is all about. Oh i forgot one minor point: in space you can go as fast as you want. But don't. How retarded is that to have this immense power to not use it? Well, as the wisdom says: 'speed without control is nothing'. And the faster you go, the more difficult will it be for your ship to turn. Which is a problem. Some warnings This game have a lot of 'flashing' effect due do getting through many gates very quickly. This helps provide a good sensation for speed, but will be problematic to people prone to epileptic seizure from visual stimuli. EPILEPTIC PLAYERS BEWARE . Better be safe than sorry. This game has been designed to be primarily used by gamepads with good analog sticks. As it is a PC game, you can use your keyboard and mouse, and event play a four player game with a single keyboard, but really, this is less than optimal (but it could be fun :-). Also, joysticks can be used, but by personal experience, beware of tendonitis. Even though I play some space sim with a joystick, without any problem, this game is too fast paced and even a short session tends to hurt my wrists. This game has been developped and is being maintained by a single person. This means you should expect some problem with the game, especially with your controller. While I tried to use a very inclusive method to handle controllers, I do not have many type of controller to test and have them work out of the box. I provided you with all the tools to be able to configure any controller you can throw at this game, and the game will make its best to provide you with a good configuration. But expect to configure your controller before being able to play. Finally, this game was designed with analog controls in mind. You can play only with your keyboard, even in four player mode, this is clearly not the recommanded way to play this game . For the best experience, use",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1371860/header.jpg?t=1598717192",
    "Price": 8.99,
    "Developers": "Florent Peres",
    "Publishers": "Florent Peres",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1371860/ss_05b0b695d022e6f622a02cce8261bbf436aa3bc1.1920x1080.jpg?t=1598717192,https://cdn.akamai.steamstatic.com/steam/apps/1371860/ss_72cc8d8ecd48db5d745b6e8db86282bcb67ead3c.1920x1080.jpg?t=1598717192,https://cdn.akamai.steamstatic.com/steam/apps/1371860/ss_14598fa84292494841666e68656882e971f2755d.1920x1080.jpg?t=1598717192,https://cdn.akamai.steamstatic.com/steam/apps/1371860/ss_8c22a1f9b67a1416e3c10815ee802cba92761bfa.1920x1080.jpg?t=1598717192,https://cdn.akamai.steamstatic.com/steam/apps/1371860/ss_a913efeeb69d50d637497dfc9521c081eceb313c.1920x1080.jpg?t=1598717192,https://cdn.akamai.steamstatic.com/steam/apps/1371860/ss_455ee494702ac9dd60f53540719f234ae8a1ad48.1920x1080.jpg?t=1598717192,https://cdn.akamai.steamstatic.com/steam/apps/1371860/ss_5129c3b4631d88924235a51bb4c2e4e014ea6dc6.1920x1080.jpg?t=1598717192",
    "Slug": "space-cube-racers",
    "Meta Title": "Space Cube Racers: Aug 29, 2020, Florent Peres and Full O...",
    "Meta Description": "Looking for information on Space Cube Racers? Check out the release date (Aug 29, 2020), developer insights from Florent Peres, and a complete game summ...",
    "Alt Text Image": "Official header image for Space Cube Racers game - Steam 1371860",
    "Canonical URL": "https://gusku.site/game/space-cube-racers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Space Cube Racers\", \"description\": \"Looking for information on Space Cube Racers? Check out the release date (Aug 29, 2020), developer insights from Florent Peres, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Florent Peres\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Florent Peres\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1371860/header.jpg?t=1598717192\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}