{
    "AppID": 1222730,
    "Name": "STAR WARS™: Squadrons",
    "Release date": "Oct 1, 2020",
    "About the game": "Master the art of starfighter combat in the authentic piloting experience STAR WARS™: Squadrons. Buckle up and feel the adrenaline of first-person, multiplayer space dogfights alongside your squadron. Pilots who enlist will step into the cockpits of starfighters from both the New Republic and Imperial fleets and fight in strategic 5v5 space battles. Modify your starfighter, and adjust the composition of your squadron to suit varying playstyles and crush the opposition. Pilots will triumph as a team and complete tactical objectives across known and never-before-seen battlefields, including the gas giant of Yavin Prime and the shattered moon of Galitan. Take control of starfighters such as the X-wing and TIE fighter. Customize loadouts and cosmetics. Divert power between weapons, shields, and engines while immersing yourself in the cockpit. In addition, players will have the option to play the entirety of the game in virtual reality (VR)! Live your STAR WARS pilot fantasy The cockpit is your home. Use its dashboards to your advantage and — with just a thin hull of metal and glass between you and the perils of space — feel the intensity of combat from a first-person perspective. Take off in thrilling multiplayer modes and a unique single-player STAR WARS story. Immerse yourself in the pilot’s seat completely with the option to play the entirety of STAR WARS: Squadrons in VR. STAR WARS™ single-player story — Learn what it means to be a pilot after the events of Return of the Jedi. Seen from alternating perspectives between 2 factions, iconic and emerging leaders on both sides are battling for the galaxy. The New Republic fights for freedom. The Empire demands order. We need you to join the galaxy’s finest. All wings report in — Plan skirmishes with your squadron in the briefing room before taking off to the evolving battlefields across the galaxy. Compete in intense 5v5 multiplayer dogfights, or unite with your squadron to tip the scales in monumental fleet battles. Together, you’re the galaxy’s finest. Master legendary starfighters — Take control of different classes of starfighters from both the New Republic and Imperial fleets — including the agile A-wing and the devastating TIE bomber. Modify your ship, divert the power between its systems, and destroy your opponents in strategic space dogfights. The mission is clear — STAR WARS: Squadrons is a fully self-contained experience from day one, where you earn rewards through play. Climb the ranks and unlock new components like weapons, hulls, engines, shields, and cosmetic items in a clear path for progression that keeps gameplay fresh and engaging.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1222730/header.jpg?t=1651767543",
    "Price": 9.99,
    "Developers": "MOTIVE",
    "Publishers": "Electronic Arts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1222730/ss_a3e55a6dc13015db282b40b5c32dac1f6e651ed8.1920x1080.jpg?t=1651767543,https://cdn.akamai.steamstatic.com/steam/apps/1222730/ss_5bb8a4fad528909994731becae7653fd24124d7f.1920x1080.jpg?t=1651767543,https://cdn.akamai.steamstatic.com/steam/apps/1222730/ss_1984ed1ad9081dfbb00d4248c98dccf63cb4c42c.1920x1080.jpg?t=1651767543,https://cdn.akamai.steamstatic.com/steam/apps/1222730/ss_3518ecebb8d16d25b675d139b3d0817db5248a33.1920x1080.jpg?t=1651767543,https://cdn.akamai.steamstatic.com/steam/apps/1222730/ss_685a6bb65f6bca4342ac1bd94ef7bc2de1502a53.1920x1080.jpg?t=1651767543,https://cdn.akamai.steamstatic.com/steam/apps/1222730/ss_acca79eaec11f1e1130b5b2f873d18394f8ee149.1920x1080.jpg?t=1651767543,https://cdn.akamai.steamstatic.com/steam/apps/1222730/ss_1f3ada86dcb689afd7fbfa353b15619c1ce5560a.1920x1080.jpg?t=1651767543,https://cdn.akamai.steamstatic.com/steam/apps/1222730/ss_8299a3162fefd5855aa0786c74172e498978b8f8.1920x1080.jpg?t=1651767543,https://cdn.akamai.steamstatic.com/steam/apps/1222730/ss_ecc2c32bcb937ec3b3e19c336d9a72e870c876c2.1920x1080.jpg?t=1651767543",
    "Slug": "star-wars-squadrons",
    "Meta Title": "STAR WARS™: Squadrons: Oct 1, 2020, MOTIVE and Full Overview",
    "Meta Description": "Looking for information on STAR WARS™: Squadrons? Check out the release date (Oct 1, 2020), developer insights from MOTIVE, and a complete game summary.",
    "Alt Text Image": "Official header image for STAR WARS™: Squadrons game - Steam 1222730",
    "Canonical URL": "https://gusku.site/game/star-wars-squadrons",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"STAR WARS\\u2122: Squadrons\", \"description\": \"Looking for information on STAR WARS\\u2122: Squadrons? Check out the release date (Oct 1, 2020), developer insights from MOTIVE, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 1, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"MOTIVE\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Electronic Arts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1222730/header.jpg?t=1651767543\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}