{
    "AppID": 1904330,
    "Name": "The Tribe Game",
    "Release date": "Mar 25, 2022",
    "About the game": "The Tribe Game is a story-driven roleplaying game where the player creates their own custom character and steps into a unique, atmospheric post-apocalyptic world where hope prevails, inspired by the classic cult-hit TV series, 'The Tribe'. Taking centre stage in the story, the player interacts with a large range of characters and 'tribes', each of whom is seeking to build a new world, and will help shape their lives and destinies. There are many diverse places to explore, quests to be accomplished, professions to level up, items and resources to be found, battles to be won, friendships to be made and adversaries to be challenged... as the player experiences all of the humour and unpredictable drama in the world of The Tribe - and tries to keep their own (and their tribe's) dreams alive. Key Features Interact with a large cast of Characters and Tribes! Fate will make your character cross paths with many other survivors who are struggling to create a new world, including some familiar faces to those who have watched The Tribe TV series. For those new to The Tribe, your character will quickly discover who are the other protagonists of this world. Some will be friendly, some will be hostile, some in need, while others threaten the future of the already fragile world. Explore a Post-Apocalyptic World (and be instrumental in creating a better future) Travel through lots of contrasting, atmospheric locations... From the ghostly deserted Sectors of the city, to the suburbs... beyond the city to the woods and forests, to the beaches and coast... You will also need to go inside abandoned (or inhabited?) shops and buildings, including a large shopping mall... Choose Your Own Look, Create Your Custom Character Put yourself in the picture and make your character look like you, or somebody completely different from your imagination, using the customisable character creator. Choose from a range of combinations to select your own appearance, including hair styles, make up and markings, as well as costumes. It is also possible to completely change your look at regular points during the game as the story unfolds. Profession Skills to Level and Items to be made or found Level up your profession skills. Grow produce with your Farming skill. Find ingredients for recipes to create food and drink items with your Cooking skill. Use Tinkering to make items or weapons, as well as things you may need to trade over to others, or in order to complete a quest. Go Fishing. With your Tailoring skill, craft new clothing or 'armour' to enhance your character's stats. Forage and Scavenge locations for items or resources you and your tribe might require. And always be on the look out for unexpected danger or encounters. Quests to Complete Sometimes you will be given Quests by others. Have you got what it takes to achieve them? Keep track of your progress using your Quest Journal. Special Features Included with The Tribe Game The Tribe Game comes with some video content accessed from within the game, including:: An exclusive message from Game Director Raymond Thompson (Creator of The Tribe and Executive Producer of The Tribe TV Series, as well as the writer of The Tribe Game!). A Character Art Evolution video showing the evolution of character designs from sketches to the finished article. A Promotional Video from The Tribe TV Series (and official books). Atmospheric and Full Soundtrack featuring original (and orchestral) music The Tribe Game includes an ambient audible experience, with locations featuring some of the sound effects from The Tribe TV Series. The game soundtrack also includes musical themes adapted for the game from the television series, some of it a full orchestral score performed by the New Zealand Symphony Orchestra. Opening Cinematic Before creating your character, a cinematic cut scene movie can be played, featuring animation and narration from actress Beth Allen (who played the iconic character Amber in The Tribe television series).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1904330/header.jpg?t=1654059049",
    "Price": 19.99,
    "Developers": "Cloud 9 Limited",
    "Publishers": "Cloud 9 Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_a3dc8483ddc06b158120da8dd2266daa2762bac3.1920x1080.jpg?t=1654059049,https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_94f72b8f64653cf538635aa4f2d163beef90f791.1920x1080.jpg?t=1654059049,https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_15a6d94fdeb0ed4b8df81e80c31da46ad76d4e48.1920x1080.jpg?t=1654059049,https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_d73c02ad5cc61ba5b260b662aab2eaac9cee6e15.1920x1080.jpg?t=1654059049,https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_21938acfb10e10b5e09e19f1efcc720f5fd20620.1920x1080.jpg?t=1654059049,https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_52d959e1af9ca58c9319aa823b1cd21630d8def4.1920x1080.jpg?t=1654059049,https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_bb7f7e671e1bb9a7ada6a2b11ec3feda4281f6a1.1920x1080.jpg?t=1654059049,https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_34ab2ed9f0b76f4b9522ddf1dd5ac9528fb630d1.1920x1080.jpg?t=1654059049,https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_ec565300bd34748eee01de9700555ec5dcd8a201.1920x1080.jpg?t=1654059049,https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_54065af60666cdb421e3a536d99bd86df437445d.1920x1080.jpg?t=1654059049,https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_0a67ba646ddb1182cf1c57500638bd9117599bc6.1920x1080.jpg?t=1654059049,https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_b386fa1c0190db4c34f1b35743ab164b68548c86.1920x1080.jpg?t=1654059049,https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_cacd9e13251fa69c953eff40386f8ca056dd0f1a.1920x1080.jpg?t=1654059049,https://cdn.akamai.steamstatic.com/steam/apps/1904330/ss_12ca80996b74521c3ad054c7077a87aff8df6184.1920x1080.jpg?t=1654059049",
    "Slug": "the-tribe-game",
    "Meta Title": "The Tribe Game: Mar 25, 2022, Cloud 9 Limited and Full Ov...",
    "Meta Description": "Looking for information on The Tribe Game? Check out the release date (Mar 25, 2022), developer insights from Cloud 9 Limited, and a complete game summary.",
    "Alt Text Image": "Official header image for The Tribe Game game - Steam 1904330",
    "Canonical URL": "https://gusku.site/game/the-tribe-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Tribe Game\", \"description\": \"Looking for information on The Tribe Game? Check out the release date (Mar 25, 2022), developer insights from Cloud 9 Limited, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cloud 9 Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cloud 9 Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1904330/header.jpg?t=1654059049\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}