{
    "AppID": 646910,
    "Name": "The Crew™ 2",
    "Release date": "Jun 28, 2018",
    "About the game": "SEASON 6 EPISODE 1 : DOMINION FORSBERG Chris Forsberg, the three-time world drift champion, and the Forsberg Racing team are the stars of this new Episode. Follow Chris’ guidance and progress on the different Dominion Forsberg challenges you will encounter during this new Motorflix episode. 6 new Playgrounds have been integrated in the world of The Crew 2. These playgrounds will host the Dominion Forsberg events, a succession of events which will be added every two weeks and will push your precision driving skills to the limit. These Playgrounds are also available in free-roaming and will be thematized based off of the competition hosted on this track. Play The CREW® 2 full game for free for 4 hours by downloading the trial! The newest iteration in the revolutionary franchise, The Crew® 2 captures the thrill of the American motorsports spirit in one of the most exhilarating open worlds ever created. Welcome to Motornation, a huge, varied, action-packed, and beautiful playground built for motorsports throughout the entire US of A. Enjoy unrestrained exploration on ground, sea, and sky. From coast to coast, street and pro racers, off-road explorers, and freestylers gather and compete in all kinds of disciplines. Join them in high-octane contests and share every glorious moment with the world. The Crew® 2 gives you the chance to showcase your skills and rise as a multi-skilled motorsports champion. FEATURES WELCOME TO MOTORNATION – TAKE THE CHALLENGE TO THE GROUND, SEA, AND SKY Push boundaries and take on new experiences in iconic locations. Fly and spin through fog and clouds above the snowcapped Rocky Mountains, burn rubber in the backstreets of New York City, sweep through the Mississippi River, and explore every inch of the Grand Canyon. Driving your dream hypercar, riding some of the most iconic American bikes, and taking control of the swiftest aerobatic planes and powerboats: opportunities for fun and challenges are limitless in a fully redesigned USA. SWITCH INSTANTLY BETWEEN VEHICLES &amp; ENJOY A 100% SEAMLESS EXPERIENCE The Crew® 2 is about open world freedom behind the wheel of your favorite rides. Shift from one to another with just a push of a button using the Fast Fav feature and experience the full potential of this huge and seamless open world. Cruising through L.A in your dream hypercar, switch to the swiftest aerobatic plane to rise above the skyscrapers and enjoy stunning perspectives over Hollywood, then swap it for a slick powerboat as you reach the coastline, landing smoothly on the Pacific ocean: opportunities for fun and challenges are limitless. BE THE CHAMPION YOU WANT TO BE Join four different motorsports families from around the country: street and pro racers, off-road experts, and freestylers. They’ll hook you up with new rides, and they’ll introduce you to their own unique motorsports culture and set of disciplines. Through competitions and chance encounters, find and hone your personal style, collect and customize your dream rides, show them off in your HQ, and make your mark on the entire US motorsports scene. SHARE AND SHINE IN A CONNECTED WORLD The world of The Crew® 2 is fueled by the need to share your personal accomplishments and unique moments with friends and others – break records and be a pioneer! Every time you achieve something, it will be saved as a new challenge for other players, while you will be encouraged to surpass the feats of others. Capture and share all of your best moments with the press of a button.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/646910/header.jpg?t=1657123216",
    "Price": 49.99,
    "Developers": "Ivory Tower",
    "Publishers": "Ubisoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/646910/ss_ec617d9e0af6ad98a6f18677159aee60d81f7e96.1920x1080.jpg?t=1657123216,https://cdn.akamai.steamstatic.com/steam/apps/646910/ss_45374ab47a01a01c3968ed0546ba8239a34d612c.1920x1080.jpg?t=1657123216,https://cdn.akamai.steamstatic.com/steam/apps/646910/ss_4349972e263a86a4373205441ff58bebfcbdff6c.1920x1080.jpg?t=1657123216,https://cdn.akamai.steamstatic.com/steam/apps/646910/ss_34662385e6d2ab37b49eae52bee0800f5e2dc767.1920x1080.jpg?t=1657123216,https://cdn.akamai.steamstatic.com/steam/apps/646910/ss_75f2de49e2e2d78bb6d3415bc3e1427b58d8a8c2.1920x1080.jpg?t=1657123216,https://cdn.akamai.steamstatic.com/steam/apps/646910/ss_4fe5544b606d1e99fddd46f6e98064077615f03c.1920x1080.jpg?t=1657123216,https://cdn.akamai.steamstatic.com/steam/apps/646910/ss_160e4f2c8c43081211f1da8dd5ff5e285a3a04ab.1920x1080.jpg?t=1657123216,https://cdn.akamai.steamstatic.com/steam/apps/646910/ss_d7a89f47597c4c1ce2d0b49b0fc3e5f5e8e671e6.1920x1080.jpg?t=1657123216,https://cdn.akamai.steamstatic.com/steam/apps/646910/ss_7d9c6b2762f425e5c469e331381d0762f86021cc.1920x1080.jpg?t=1657123216",
    "Slug": "the-crew-2",
    "Meta Title": "The Crew™ 2: Jun 28, 2018, Ivory Tower and Full Overview",
    "Meta Description": "Looking for information on The Crew™ 2? Check out the release date (Jun 28, 2018), developer insights from Ivory Tower, and a complete game summary.",
    "Alt Text Image": "Official header image for The Crew™ 2 game - Steam 646910",
    "Canonical URL": "https://gusku.site/game/the-crew-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Crew\\u2122 2\", \"description\": \"Looking for information on The Crew\\u2122 2? Check out the release date (Jun 28, 2018), developer insights from Ivory Tower, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 28, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ivory Tower\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ubisoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/646910/header.jpg?t=1657123216\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}