{
    "AppID": 1305130,
    "Name": "The Lost Legends of Redwall™: The Scout Act 3",
    "Release date": "Dec 24, 2021",
    "About the game": "Step into the epic, story-rich world of Mossflower in the first official Redwall story since 2011. 'The Scout' is a linear action-adventure game told in three acts. Play as Liam or Sophia, the newest member of the Lilygrove Scout Corps, as the young mice find themselves on the journey of a lifetime to save their home from ruthless pirates. Will they reach Redwall and save their friends before all is lost? The Scout: Act 3 After being mortally poisoned by Scumsnout's vicious maw, our young Scouts have made it to the Winsome Wraith in one piece, if just barely. While the mysterious stoat's treatment has bought some precious time, Liam and Sophia must now travel the rest of the way to Redwall Abbey for a more permanent cure. This is the dramatic conclusion of their journey through the murk of Portman's Slough, the miraculously-functioning puzzles of Grating Gulley, and the ancient ruins of the Otters' Den. Features A brand new original story set the winter before the events of the first book. A stunning woodland world inhabited by charming critters and villainous vermin. Two characters with divergent dialog for replayability. Unique real-time scent mechanic fitting for woodlanders who experience the world primarily through their noses. An assortment of achievements and collectables for the completionist spirit. Original soundtrack created especially for fans of Redwall. Fully voice acted by a talented cast of new and established actors. Engaging puzzles and side stories for those who delight in world building. Full controller support with multiple schemes to choose from. Mechanics 'The Scout: Act 3' completes the growing list of scent-based skills by introducing a new rot indicator used to identify the age of scents. Use everything available to your delicate nose to finish your quest and protect your friends. When traversing the world of Mossflower, you make use of your mouse agility to explore the world in a unique and wondrous way. Shimmy along ledges, scramble sheer cliffs, and even squeeze through impossibly small spaces. With courage, faith, and friends by your side, Mossflower's fate rests in your paws! Rely on stealth, wit, and agility to evade your enemies. Manipulate dull-witted vermin with scent and sound to avoid getting caught in their grubby paws. Decide if you will prioritize the mission and leave the others to save themselves or take the time to lend a helping paw. Some may praise philanthropy, still others would praise pragmatism. Your choices matter! As your journey draws to a close, see how your fellow woodlanders judge your performance, use your charisma to mend broken relationships, and put all that jam to good use at the victory feast! 'The Lost Legends of Redwall™' is inspired by the wildly popular characters and world created by Brian Jacques in the Redwall™ best-selling book series, published by and on behalf of Penguin Random House and now announced for a major movie and TV series by Netflix. 'The Lost Legends of Redwall™' is a series of games and a proud collaboration between Redwall Abbey Company Ltd, Penguin Random House UK, and Soma Games. Together we have nurtured a product that we believe captures the original heart of Brian Jacques’ masterpiece. Lovingly crafted at every turn, The Lost Legends of Redwall™ hopes to earn its place among the influential games of the new millennium. Want a physical case for your collection or for a gift? DIY Game Box available for free here:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1305130/header.jpg?t=1640336438",
    "Price": 9.99,
    "Developers": "Soma Games",
    "Publishers": "Soma Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1305130/ss_471d7d9ac498dab04fe7303e2fd0ca991e9e34c6.1920x1080.jpg?t=1640336438,https://cdn.akamai.steamstatic.com/steam/apps/1305130/ss_00bd315e2a17c2381e9e0f419f6e80928d4b7ac0.1920x1080.jpg?t=1640336438,https://cdn.akamai.steamstatic.com/steam/apps/1305130/ss_99cfd1497e5e81d4f88c406b0d420613ca6de3b8.1920x1080.jpg?t=1640336438,https://cdn.akamai.steamstatic.com/steam/apps/1305130/ss_ef7f5db6855310b8e47943f9fe1c5d0052b125d4.1920x1080.jpg?t=1640336438,https://cdn.akamai.steamstatic.com/steam/apps/1305130/ss_70f9ba558cf839699eda188d3aaf400e0176bc93.1920x1080.jpg?t=1640336438,https://cdn.akamai.steamstatic.com/steam/apps/1305130/ss_3c9d82f0bcb0394f2e51934bdbd5fedf2d953c88.1920x1080.jpg?t=1640336438,https://cdn.akamai.steamstatic.com/steam/apps/1305130/ss_0f140e4c42829f52311cf8839868305ad5a39ba6.1920x1080.jpg?t=1640336438,https://cdn.akamai.steamstatic.com/steam/apps/1305130/ss_f22fa803b49c94f3c1260fcbacf294b0317df1bc.1920x1080.jpg?t=1640336438,https://cdn.akamai.steamstatic.com/steam/apps/1305130/ss_c428dd27a37056ac0b07a4f0f8ad1d25756be9de.1920x1080.jpg?t=1640336438,https://cdn.akamai.steamstatic.com/steam/apps/1305130/ss_3729491ad075b40c2115bca4910f1d1f69accbf1.1920x1080.jpg?t=1640336438,https://cdn.akamai.steamstatic.com/steam/apps/1305130/ss_e26057b4a2d37fad1666e213e53ec171c842896d.1920x1080.jpg?t=1640336438,https://cdn.akamai.steamstatic.com/steam/apps/1305130/ss_17a392f8b901f677bc698bfb5f05758bb8906890.1920x1080.jpg?t=1640336438",
    "Slug": "the-lost-legends-of-redwall-the-scout-act-3",
    "Meta Title": "The Lost Legends of Redwall™: The Scout Act 3: Dec 24, 20...",
    "Meta Description": "Looking for information on The Lost Legends of Redwall™: The Scout Act 3? Check out the release date (Dec 24, 2021), developer insights from Soma Games,...",
    "Alt Text Image": "Official header image for The Lost Legends of Redwall™: The Scout Act 3 game - Steam 1305130",
    "Canonical URL": "https://gusku.site/game/the-lost-legends-of-redwall-the-scout-act-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Lost Legends of Redwall\\u2122: The Scout Act 3\", \"description\": \"Looking for information on The Lost Legends of Redwall\\u2122: The Scout Act 3? Check out the release date (Dec 24, 2021), developer insights from Soma Games,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 24, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Soma Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Soma Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1305130/header.jpg?t=1640336438\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}