{
    "AppID": 1733400,
    "Name": "The Final Frontier",
    "Release date": "Sep 12, 2021",
    "About the game": "In this twin-stick shooter roguelike, you will constantly be attacked by waves of enemies becoming more powerful the longer you survive. Upon starting the game for the first time, you will have access to the Fighter ship that shoots short bursts of bullets. Destroying enemies rewards you with points to level up following a skill tree. When starting the first round, you will feel as near equals to the most basic of enemies, but after a few level-ups, you will start to feel that fighters are not much of a threat anymore. The game, however, is not that forgiving and will send more difficult enemies at you. CHARACTERS With every enemy killed, you gain coins that enable you to purchase new characters. Each character has its own tech tree that can greatly change playstyle. Once defeating wave 50 with a character, a new threat level is unlocked which buff enemies in some way. Each threat level adds to the power of these enemies giving quite a challenge. ENEMIES With 13 enemies with different behavior, fighting dynamics can be unique causing you to approach different groups of enemies differently. Enemies also can be three different levels of varying stats, with level two and three being more frequent in later waves. BESTIARY After being introduced to new enemies and killing them, an entry is filled out in your bestiary with information about the enemy and the number of times you have killed it. WEAK SPOTS When encountering some more powerful enemies, you will notice some flashing red circles on them; those are reactors and need to be destroyed for the enemy to fall. These reactors are within the borders of the enemy; Bullets, missiles, and lasers all leave holes in their target and will be necessary to reach the reactors of these enemies. ASTEROIDS Asteroids are also a hazard, but not just to you. Asteroids break apart when run into or shot and can be damaging. This can be used to your advantage if you can trick the enemy into a crash. UPGRADES Once reaching the point threshold to level up, you get the option to choose what you would like to upgrade on your ship according to the skill tree for your character. Many of these upgrades can change the way you approach fights and will make earlier enemies less threatening. While you get to upgrade your ship, enemies have that same luxury. The further you get into the run, the more common an enemy will be levelled up which increases their stats and chance to have a shield. GAME FEATURES Twin-stick retro space shooter Continuous waves of increasing difficult enemies Ship skill trees Scaling enemies and difficulty Steam leaderboards and stats",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1733400/header.jpg?t=1656128354",
    "Price": 1.99,
    "Developers": "DJ Games",
    "Publishers": "DJ Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1733400/ss_8d4f5a68c3cfb26500720d7518bcc04c8a0937a6.1920x1080.jpg?t=1656128354,https://cdn.akamai.steamstatic.com/steam/apps/1733400/ss_709867d20ce5a296b99ddac61a3711509bd87514.1920x1080.jpg?t=1656128354,https://cdn.akamai.steamstatic.com/steam/apps/1733400/ss_62f06542e0c459a7447149ab4c4e1a9b40ebf54b.1920x1080.jpg?t=1656128354,https://cdn.akamai.steamstatic.com/steam/apps/1733400/ss_91a2577a94c67be011313c4696338aa1a96a4d33.1920x1080.jpg?t=1656128354,https://cdn.akamai.steamstatic.com/steam/apps/1733400/ss_cf56a5d78714fbd11f0f78bbd76bfcd9fbac266e.1920x1080.jpg?t=1656128354,https://cdn.akamai.steamstatic.com/steam/apps/1733400/ss_69f5ae7f191bc45b9bb0dcbee0a70f82cc9eb87c.1920x1080.jpg?t=1656128354,https://cdn.akamai.steamstatic.com/steam/apps/1733400/ss_d8cb2f35b9159af8ebf48e6258cdb6bacac46e3c.1920x1080.jpg?t=1656128354,https://cdn.akamai.steamstatic.com/steam/apps/1733400/ss_25a6193ee5b19d635c0a6bd37b22c9da5338e20a.1920x1080.jpg?t=1656128354",
    "Slug": "the-final-frontier",
    "Meta Title": "The Final Frontier: Sep 12, 2021, DJ Games and Full Overview",
    "Meta Description": "Looking for information on The Final Frontier? Check out the release date (Sep 12, 2021), developer insights from DJ Games, and a complete game summary.",
    "Alt Text Image": "Official header image for The Final Frontier game - Steam 1733400",
    "Canonical URL": "https://gusku.site/game/the-final-frontier",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Final Frontier\", \"description\": \"Looking for information on The Final Frontier? Check out the release date (Sep 12, 2021), developer insights from DJ Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"DJ Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DJ Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1733400/header.jpg?t=1656128354\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}