{
    "AppID": 765470,
    "Name": "The Great Fantasy Struggle",
    "Release date": "Sep 26, 2018",
    "About the game": "TGFS is an indie grand strategy game set in a fantasy world of Lubetia, engrossed in an unrelenting conflict between light and darkness. Take control over a peaceful and prosperous realm of Ille, should you decide to take the side of Light, or rule over a land of chaos and destruction with Racthas, if your choice is Darkness, this would enable you to spread your power all over Lubetia! As a ruler you have to take control of your: • POPULATION: Capture other locations either by war or peacefully to increase your population and don’t forget to defend your own locations! • INFLUENCE: Build your main city to increase your influence over the world - choose from many different structures, each with its unique effect. • TREASURY: Sending missioners and warriors, increasing influence, building your city, units actions – all these cost gold, so watch over your expenses as to not empty your treasury. So choose your side wisely and try to achieve balance between your population, influence and treasury to become the ruler of whole world of Lubetia! FEATURES: Main characters - Play as Gerberion the Wizard of Light or Manufactus the Dark Demon. City Building - Develop your home location to have more influence over all locations on the world map. Global game map - 59 locations, each with its unique fantasy creature inhabitants: elfs, humans, fairies, skeletons, zombies, ice wraiths and many more. Units - Send warriors and missioners to defend your locations or to take over the other locations. Deep strategic gameplay - You have to watch over total controlled population, treasury and total amount of gold, your influence in every game location and moral state of its inhabitants. Opponent AI - choose between 3 difficulty levels and complete main game tasks, depending of difficulty. Different ways to win - Defeat your opponent either by having more population or influence, or try to capture his main location and win permanently! Hand drawn graphics - Inspired by impressionist paintings. Fully visualized UI - There is no numbers or unnecessary complex indicators - all game information is given in vivid, simple for understanding pictures and icons. *Please note: Read Manual before playing. You can also check out Fast Guide on the game’s forum. If you have problem with display or screen resolution check out the forum as well.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/765470/header.jpg?t=1653525799",
    "Price": 4.99,
    "Developers": "Alina Digital",
    "Publishers": "Alina Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/765470/ss_3ebbeee9a1ebcd4bdf982df17704249a87ea2314.1920x1080.jpg?t=1653525799,https://cdn.akamai.steamstatic.com/steam/apps/765470/ss_2a2544efe9ff5340e61e7935cc023824e95d637d.1920x1080.jpg?t=1653525799,https://cdn.akamai.steamstatic.com/steam/apps/765470/ss_325fd2331fe6f42732e10fd208d5e3036ab49fee.1920x1080.jpg?t=1653525799,https://cdn.akamai.steamstatic.com/steam/apps/765470/ss_85e7b1a673d2076ffc9234a8ccc54f96bc037f2d.1920x1080.jpg?t=1653525799,https://cdn.akamai.steamstatic.com/steam/apps/765470/ss_60b8bd2b7390cc9ce94327f41e86632081b8b9b5.1920x1080.jpg?t=1653525799",
    "Slug": "the-great-fantasy-struggle",
    "Meta Title": "The Great Fantasy Struggle: Sep 26, 2018, Alina Digital a...",
    "Meta Description": "Looking for information on The Great Fantasy Struggle? Check out the release date (Sep 26, 2018), developer insights from Alina Digital, and a complete ...",
    "Alt Text Image": "Official header image for The Great Fantasy Struggle game - Steam 765470",
    "Canonical URL": "https://gusku.site/game/the-great-fantasy-struggle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Great Fantasy Struggle\", \"description\": \"Looking for information on The Great Fantasy Struggle? Check out the release date (Sep 26, 2018), developer insights from Alina Digital, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 26, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alina Digital\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Alina Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/765470/header.jpg?t=1653525799\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}