{
    "AppID": 599080,
    "Name": "The Blackout Club",
    "Release date": "Jul 29, 2019",
    "About the game": "The Blackout Club is a first-person co-op horror game centered around a group of teenage friends investigating a monstrous secret beneath the skin of their small town. Every night, everyone in town gets out of bed and sleepwalks. In the morning, they wake up with no recollection of what happened or where they were. IT TOOK YOUR FRIEND. THEY SAY IT'S NOT REAL Some teenagers in this town woke up during a few of these 'Blackouts' themselves, finding themselves in the woods or on train tracks with no idea how they got there. When they tell their parents, their teachers, the police... no one believes them. Taking matters into their own hands, they formed a club - The Blackout Club - to get to the bottom of it. Unfortunately, the recent disappearance of a close friend means that the sleepwalking isn't just strange - it could be deadly. IT WALKS AMONG THEM You and your friends must team up to overcome the powerful forces that are arrayed against you. Using tools such as drones, noisemakers, and grappling hooks, you will outwit and outmaneuver the adults while attempting to obtain and record evidence that will prove what is happening to the rest of the world. With procedural elements that change goals, enemies, loot and more, no two nights in the neighborhood will be the same. Gameplay Features A Modern Horror Setting To Explore: A beautiful and modern neighborhood full of houses, woods, and a very mysterious subterranean network of tunnels. Cooperative Gameplay: Drop-in/Drop-out multiplayer sessions for 1-4 players. Each Night A New Adventure: Missions are procedurally-generated and vary according to player level and progress. Enemy Patrols, Loot Placement, Mission Objectives, Environmental Obstacles, and other aspects of each night's mission are never the same twice for a high amount of replayability. Richly-Simulated World Supporting Many Play Styles: Players have the freedom to go through the game at their own pace and choose the paths they take through the world. Experiment with different abilities and items to find creative solutions to any problem. A Deep Mystery Under The Surface: Though we are a small team, we have decades of AAA experience from before we went independent, and our last game The Magic Circle has won awards for its story and narrative. That being said... with The Blackout Club , we have a few new tricks up our sleeve we think are going to surprise even the most veteran horror game fans. Character Growth &amp; Customization: Players get to create their own character and customize them by unlocking new clothing, gestures, and hairstyles. As players level up they will also unlock new expansion slots and upgrade their abilities. An Unseen Threat: If players are not careful and draw too much attention to themselves, The Shape will come for them. You'll need to stick together and look out for one another while it hunts you down. There's one catch... You can only see The Shape by closing your eyes . TOGETHER, WE CAN FIND HER. FRIENDS TO THE END No one believes you, join The Blackout Club and make them see the truth.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/599080/header.jpg?t=1576795257",
    "Price": 29.99,
    "Developers": "Question",
    "Publishers": "Question",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/599080/ss_0697a426b83659876279637eefeaccb964736415.1920x1080.jpg?t=1576795257,https://cdn.akamai.steamstatic.com/steam/apps/599080/ss_2ca2cb3d54558da80625b484274a1e3b0e5009ed.1920x1080.jpg?t=1576795257,https://cdn.akamai.steamstatic.com/steam/apps/599080/ss_0212ed9c6ac640d72c1ca012e58306b1544bd54b.1920x1080.jpg?t=1576795257,https://cdn.akamai.steamstatic.com/steam/apps/599080/ss_8f5d23664b72da3274a102a1a469a580da35ba88.1920x1080.jpg?t=1576795257,https://cdn.akamai.steamstatic.com/steam/apps/599080/ss_c6af51f97bd92173e8b58c5695b60d52d623a064.1920x1080.jpg?t=1576795257",
    "Slug": "the-blackout-club",
    "Meta Title": "The Blackout Club: Jul 29, 2019, Question and Full Overview",
    "Meta Description": "Looking for information on The Blackout Club? Check out the release date (Jul 29, 2019), developer insights from Question, and a complete game summary.",
    "Alt Text Image": "Official header image for The Blackout Club game - Steam 599080",
    "Canonical URL": "https://gusku.site/game/the-blackout-club",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Blackout Club\", \"description\": \"Looking for information on The Blackout Club? Check out the release date (Jul 29, 2019), developer insights from Question, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 29, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Question\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Question\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/599080/header.jpg?t=1576795257\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}