{
    "AppID": 873840,
    "Name": "Truck and Logistics Simulator",
    "Release date": "Jun 23, 2020",
    "About the game": "Take control of more than 20 unique vehicles to perform complex loading tasks and deliver the diverse cargo directly to your customers. Master all the individual logistics vehicles like forklifts, cranes, telescopic handlers, wheel loaders and many more to load up your vans, pickups and heavy trucks. Dive into the progressive career mode and accomplish challenging missions to buy new vehicles, upgrade your vehicle fleet and take on the real heavy loads. Pull off dangerous off-road missions with loads as big as a 21 tonnes articulated loader that will push your driving skills to the limit. Master each unique vehicle and use them to their fullest potential to maximize your income and driver experience to become the biggest logistics company in town. Become an expert in fragile cargo missions that require special care. Load, drive and deliver carefully without damaging the cargo to gain a higher reward. Maneuver vehicles onto your trailers for vehicle transport missions. Attach trailers to your vehicles to increase cargo capacity, repair your vehicles in maintenance areas and fill up your vehicles’ fuel tanks at the gas stations. Jump into the cross-platform multiplayer and drive exciting convoy deliveries with your friends on Switch and PC. Start delivering now and build your logistics empire! More than 20 unique vehicles with realistic interior and driving physics Cross-Platform Multiplayer with cooperative missions. Make convoys and deliver together with your friends Purchase vehicles from minivans to heavy trucks and grow your logistics fleet Load your trucks by operating unique loading vehicles from logistics areas (Forklift, Loader, Crane, etc.) Transport heavy vehicles (cars, forklifts, wheel loaders, ATV's) by loading them onto the trailer Day/night cycle and realistic weather. Drive careful in weather conditions including Rain and Fog Dynamic tire deformation. Adjust the pressure of the wheels of your vehicle. Vehicle damage can cause Axles to bend, affecting vehicle physics realistically. Thousands of different missions, including challenging and dangerous off-road tours Vehicle customizations (Paint, Window tint, Interior dashboard color, Xenon headlight, etc.) 24 km2 open-world map where you can reach anywhere without invisible walls Trucks (Semi/Rigid) Vans Dropside Vans Pickups Cars Monster Truck Begin missions with driving to the logistics areas and selecting a transport mission. Load your vehicle with diverse loading vehicles. (forklift, crane, telescopic handler, loader). Follow GPS and drive to the destination. Obeying traffic rules (speed limit, traffic lights, etc.) and driving carefully without damaging the cargo will lead to higher income. There are urgent missions that must be completed in the shortest time, also there are fragile cargo missions where you must carefully load drive and deliver. A realistic environment with Day/Night cycle and realistic weather conditions including fog, rain, and snow. Rain and snow will affect vehicle handling. You will be able to drive freely on the map. Truck &amp; Logistics Simulator comes with a comprehensive economy system with company vehicle fleets that need to be acquired, scalable warehouses that can be adjusted to your needs, drivers that can be hired to automatically do missions and much more. Earn experience and in-game money by completing levels. You will receive a penalty on experience and mission reward if you damage the cargo or disobey traffic rules. Van/Pickup levels: Attach a utility trailer to your van/pickup to increase its load capacity. Use forklifts to load cargo into the vehicle, then drive it to the destination. In pickup levels, you should avoid dropping the cargo. Crane - Truck or Telehandler - Truck levels, Place containers on the trailer by controlling the crane or telescopic handler, then drive the truck by attaching the trailer. In some truck levels, after delivering a container to a harbor, use a harbor crane to load the container on a cargo ship. (in development) Car/Vehicle carrier truck levels: Drive cars or vehicles on the trailer, after attaching the trailer to the truck, drive to the destination. Different types of vehicles like Forklifts or Backhoe loaders can also be loaded to trailers and then carried by driving the truck. Forklift-Truck(semi or rigid trucks) levels: Load trucks trailer with using a forklift, deliver cargo with driving the truck. Dumper truck levels: Load dumper trucks using a wheel loader. After arriving at the destination, unload the load with lifting its body with hydraulics. If you have any question, feedback or want to chat with the community join us at",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/873840/header.jpg?t=1656059262",
    "Price": 19.99,
    "Developers": "Simula Games",
    "Publishers": "Aerosoft GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/873840/ss_759ae4e942cc0567f9e1ea0d637018cfba4fbdb0.1920x1080.jpg?t=1656059262,https://cdn.akamai.steamstatic.com/steam/apps/873840/ss_5635b855c9a2c0cba1fb5208b07cb4b81d935c9c.1920x1080.jpg?t=1656059262,https://cdn.akamai.steamstatic.com/steam/apps/873840/ss_8661f0f098b77cfec591ec3569025ee7d9d6d2d4.1920x1080.jpg?t=1656059262,https://cdn.akamai.steamstatic.com/steam/apps/873840/ss_27de899c81be925e2f3e1487032e4b521c523f42.1920x1080.jpg?t=1656059262,https://cdn.akamai.steamstatic.com/steam/apps/873840/ss_20a0239edcece08c8e4297094985f1f315dd58dc.1920x1080.jpg?t=1656059262,https://cdn.akamai.steamstatic.com/steam/apps/873840/ss_4e5d57bc9058c4037262d6144bc592f4c98537eb.1920x1080.jpg?t=1656059262,https://cdn.akamai.steamstatic.com/steam/apps/873840/ss_50b6246d34cb86005aa59b09b71b096c5ce73fe0.1920x1080.jpg?t=1656059262,https://cdn.akamai.steamstatic.com/steam/apps/873840/ss_b349e2ed7dad4cb04dae1617f0a7b907bbe8bfac.1920x1080.jpg?t=1656059262,https://cdn.akamai.steamstatic.com/steam/apps/873840/ss_916adab8fbe1ab46819ff732e81178cb7f211375.1920x1080.jpg?t=1656059262,https://cdn.akamai.steamstatic.com/steam/apps/873840/ss_5cefd1bbec46aced119bf684bcf270f93bb870d9.1920x1080.jpg?t=1656059262,https://cdn.akamai.steamstatic.com/steam/apps/873840/ss_a7c2451bb629d560d75314ecbcf9418dc16a3470.1920x1080.jpg?t=1656059262,https://cdn.akamai.steamstatic.com/steam/apps/873840/ss_61ca64b1cd5b9d36b57a817ee1358b420decb738.1920x1080.jpg?t=1656059262,https://cdn.akamai.steamstatic.com/steam/apps/873840/ss_b26db30490235f9c80217811bdab2693cf49e1ef.1920x1080.jpg?t=1656059262",
    "Slug": "truck-and-logistics-simulator",
    "Meta Title": "Truck and Logistics Simulator: Jun 23, 2020, Simula Games...",
    "Meta Description": "Looking for information on Truck and Logistics Simulator? Check out the release date (Jun 23, 2020), developer insights from Simula Games, and a complet...",
    "Alt Text Image": "Official header image for Truck and Logistics Simulator game - Steam 873840",
    "Canonical URL": "https://gusku.site/game/truck-and-logistics-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Truck and Logistics Simulator\", \"description\": \"Looking for information on Truck and Logistics Simulator? Check out the release date (Jun 23, 2020), developer insights from Simula Games, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 23, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Simula Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aerosoft GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/873840/header.jpg?t=1656059262\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}