{
    "AppID": 1305380,
    "Name": "VR Fitness Gym (Cycling, Marathon, Football, etc)",
    "Release date": "Jun 4, 2020",
    "About the game": "VR Immersive Fitness Gym: 6 New VR Exercises You Never Experienced. Bored with exercise? Virtual reality, immersive fitness might help you. We all want to keep fit, while the government also says in new exercise guidelines telling us to 'Move more, sit less'. However, only 21 percent of adults are getting the minimum amount of exercise a week needed to get protective health benefits, said Aaron Stanton, Director of the Health Institute at San Francisco State. 'We are not a fit nation. ' he said. Exercising for the sake of exercise is not really a great motivator. The more fun moving is， the more likely we'll get ourselves fit. 'Virtually reality exercise is a really, really good at being able to distract you from the fact that you were exercising and letting you just enjoy the game,' said Dr Stanton. VR Gym 1) VR Snake Football Battle （head and neck exercise）, Moving your head to play a football match. Eliminate Pains in Your Neck Tired of reaching for a bottle of pills to quell your chronic pain? You can exercise your cervical spine/head/neck while playing a football game, controlling a snake football match by moving your neck and head following doctors' guides. Real scenes: Acute and chronic neck pain are common medical conditions, and the treatment typically includes physical therapy involving daily exercises. Insufficient motivation of people afflicted with neck pain to adhere to the prescribed exercise regimen may delay their recovery. Accordingly, in this VR Snake, we propose a system that motivates the users to perform neck exercises by engaging them in a popular Snake Game within virtual reality (VR) environment. The system measures the users’ neck movements via a few static and dynamic kinematic tests and a novel VR Snake battle, tailored to the neck range of motion of each individual user. The game is designed to make the users perform rehabilitative neck movements according to the prescribed exercise regimen while playing. VR Gym 2) VR Immersive Cycling： As you cycle up hills, through rings of fire and outer space. You will also rode through WAR scenes, jungles, deserts and fantasy worlds.If you have a Spinning Bike , you can forget you're working out,riding through mountains or a forest without ever leaving the room. Please bring a VR helmet and tie the controller to your legs: VR Gym 3) VR Immersive Running &amp; Marathon: walking and running along beautiful sea beaches, gardens, and sakura forests etc Simply hold your controller in your hands, and run, to get a VR ride in Sakura forests, Maya Gardens and many other beautiful places on the Earth. VR running in different scenes, to collect 'treasures', and pass interesting obstacles, such as: sudden tornado , the lightning that can't be guarded against, the trap of retrogression... For details, watch the video attached. VR Gym 4) VR Immersive Shoulder Joint Exercise: Apple Grove Picking Games Exercise shoulder joints in VR apple picking entertainments: to unlock cool effects, experience the flames of wings, and you will get gorgeous abilities. VR Gym 5) VR Immersive Body Exercise: VR Shooting in the whild Very interesting shooting game, you will play as a japanese ninja, or a persian hunter, just walk through the amazing scenes, to catch a variety of animals. When the hunting points reach a certain level, you will unlock some secret weapons. And get bling-bling visual effects. Enjoy your hunting, exercise now! VR Gym Bonus 6) VR Immersive Yoga--coming soon: VR Yoga will come soon, and will be added in the next update for FREE (August as we expect). Until now, yoga classes were only available in a studio setting, private practice location and most recently recorded or live streaming videos and apps. Now, with Thoth VR, you can unite through an immersive yoga practice in a 3-dimensional and simulated environment from anywhere in the world. Whether you are a practiced guru, or a beginner yogi just learning downward dog, these VR yoga classes offer a chance to catch a mindful moment and moving meditation from anywhere in the world.The teacher will always be in your field of view, regardless where your head is pointing to. This is a fundamental advantage over practice in the real world. You do not need to exit the posture or the flow of movement in order to see what the teacher is doing. While you practice, your head rotation also determines the angle you will see the teacher from. All together, 6 new VR immersive games, in one VR Gym. Lifetime license. This game supports both HTC VIVE and Oculus. For players who have an oculus quest and a link to emulate an oculus rift, sometimes the oculus touch controllers are not working. Don't worry. There is a solution for this: 1. first, enter your oculus, view your desktop from oculus 2. then start game from your virtual desktop, just point at the 'Play' button with laser, and then press trigger button.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1305380/header.jpg?t=1658817202",
    "Price": 0.49,
    "Developers": "William at Oxford",
    "Publishers": "William at Oxford",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1305380/ss_ce36312f2941b4d00a240c0ae5c44dfe42b6497a.1920x1080.jpg?t=1658817202,https://cdn.akamai.steamstatic.com/steam/apps/1305380/ss_42112c13151c41f75a3260ae05231b8d7dacebd3.1920x1080.jpg?t=1658817202,https://cdn.akamai.steamstatic.com/steam/apps/1305380/ss_b5a9981cb0187b0319d95293ee998e6b5b649538.1920x1080.jpg?t=1658817202,https://cdn.akamai.steamstatic.com/steam/apps/1305380/ss_d947f0c50080705f549d3dcbc799d5ee1251844d.1920x1080.jpg?t=1658817202,https://cdn.akamai.steamstatic.com/steam/apps/1305380/ss_0763d6688a1cde3b9cd3d6ab36a0675d39bea596.1920x1080.jpg?t=1658817202,https://cdn.akamai.steamstatic.com/steam/apps/1305380/ss_8158630cf471381ac51d446a734d0faba7b15b9a.1920x1080.jpg?t=1658817202,https://cdn.akamai.steamstatic.com/steam/apps/1305380/ss_2614d2a29b824769771ae4d58767ebc5363dc197.1920x1080.jpg?t=1658817202,https://cdn.akamai.steamstatic.com/steam/apps/1305380/ss_b99df54705a82963caf5355be87cd054cec6badd.1920x1080.jpg?t=1658817202",
    "Slug": "vr-fitness-gym-cycling-marathon-football-etc",
    "Meta Title": "VR Fitness Gym (Cycling, Marathon, Football, etc): Jun 4,...",
    "Meta Description": "Looking for information on VR Fitness Gym (Cycling, Marathon, Football, etc)? Check out the release date (Jun 4, 2020), developer insights from William ...",
    "Alt Text Image": "Official header image for VR Fitness Gym (Cycling, Marathon, Football, etc) game - Steam 1305380",
    "Canonical URL": "https://gusku.site/game/vr-fitness-gym-cycling-marathon-football-etc",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VR Fitness Gym (Cycling, Marathon, Football, etc)\", \"description\": \"Looking for information on VR Fitness Gym (Cycling, Marathon, Football, etc)? Check out the release date (Jun 4, 2020), developer insights from William ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"William at Oxford\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"William at Oxford\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1305380/header.jpg?t=1658817202\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}