{
    "AppID": 969480,
    "Name": "Warp Glider",
    "Release date": "Dec 14, 2018",
    "About the game": "Hi, I'm David Nickerson solo developer at Mole Eyes Entertainment , Warp Glider is the first game I have launched on my own. The last launched Steam Game I co-created was called 'Pixel Boy and the ever-expanding dungeon'. I really hope you enjoy Warp Glider , feel free to contact me on the Steam Community page if you have any feedback or suggestions at all! An all-new Co-op mode that allows you and a friend to battle to the ultimate distance working together. Slick modern eye-popping effects that blend in with a familiar retro pixel art style. Dynamic physics with gravity altering black holes, glide chilling comet trails, and various asteroids and hazards that affect both player and foe. Warp Gliders simple control style enables players to pick up and play, goes hand in hand with that 'one more time' feeling. Awesome Power-Ups that all stack on top of one another creating a different play experience each time. Power Ups come in Offensive, Defensive, and Utility types, enabling the player to constantly develop new strategies to the dynamic gameplay. Ultra destructive AOE nukes, protective shields, gravity auras, stealth cloaking, wing mounted guns, speed boosts and more! Unlock different controlling glider crafts by achieving the high score and find your favorite play style! Experience Warp Gliders unique control scheme with full controller support. In Warp Glider you control a glider craft able to warp through the edges of the screen. Keep the ever-expanding waves of Bandits approaching at bay. Your objective is to survive and collect electric energy orbs to increase your score, the longer you survive the more the game will increase the difficulty. Use the momentum of the craft while traveling in combination with rotating steering and boosters for a detailed sense of control. You can break a single wing and survive to find a wing-fix but break both wings and your ship will explode. The Bandits have unique movement patterns and behaviors and become more advanced versions of themselves if reached. If you hit an environmental obstacle like black holes it will destroy your craft at the center otherwise it pulls you in when close by. Warp Glider will work with a flight stick, Joystick controller, or with a keyboard and mouse. I recommend to glide with a standard Console/PC controller for the joystick but it's developed to suit whatever you're comfortable with.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/969480/header.jpg?t=1549651598",
    "Price": 0.99,
    "Developers": "Mole Eyes Entertainment",
    "Publishers": "Mole Eyes Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/969480/ss_5005b1a054359191291f117cb4cfddef2aeda545.1920x1080.jpg?t=1549651598,https://cdn.akamai.steamstatic.com/steam/apps/969480/ss_8215fb50c9f526fb654dce3e696d4a459dccc056.1920x1080.jpg?t=1549651598,https://cdn.akamai.steamstatic.com/steam/apps/969480/ss_e1f7461188ebe4ad4baddd41ff36ba5a3f8a11e9.1920x1080.jpg?t=1549651598,https://cdn.akamai.steamstatic.com/steam/apps/969480/ss_058a915d4388316f0db1bd30ff6d021f2378c13a.1920x1080.jpg?t=1549651598,https://cdn.akamai.steamstatic.com/steam/apps/969480/ss_0dc5215fbdf99e0248bbe1448f70a4546673019f.1920x1080.jpg?t=1549651598,https://cdn.akamai.steamstatic.com/steam/apps/969480/ss_f9032b9f1a71af0b46f7afd11c16e960eb5b1850.1920x1080.jpg?t=1549651598",
    "Slug": "warp-glider",
    "Meta Title": "Warp Glider: Dec 14, 2018, Mole Eyes Entertainment and Fu...",
    "Meta Description": "Looking for information on Warp Glider? Check out the release date (Dec 14, 2018), developer insights from Mole Eyes Entertainment, and a complete game ...",
    "Alt Text Image": "Official header image for Warp Glider game - Steam 969480",
    "Canonical URL": "https://gusku.site/game/warp-glider",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Warp Glider\", \"description\": \"Looking for information on Warp Glider? Check out the release date (Dec 14, 2018), developer insights from Mole Eyes Entertainment, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mole Eyes Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mole Eyes Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/969480/header.jpg?t=1549651598\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}