{
    "AppID": 1187600,
    "Name": "Wicked Willow",
    "Release date": "Jun 2, 2020",
    "About the game": "'If they call me wicked for following my heart, then so be it.' You're Willow, a wicked witch, trying to make her way in the world in 1993. Who is Willow? She's a judgy vegan. An Atheist who says she wears a cross 'ironically.' A sad soul with a tragic past. A brush with death has awakened Willow's powers, but don't expect her attitude to improve. Along for the journey is Avery, Willow's environmentalist best friend, Xarsi, a nun-turned-succubus, Tanya, a self-appointed mentor with a secret past, and Lydia, an Evangelical Christian whose cheery attitude puts her on Willow's bad side. Also, there's a talking cat named Shadow. He never shuts up. Choose your Path Avery has just been denied coverage for liver-saving medication. What do you do? Try to heal Avery yourself? Use your magic to change the insurance forms? Or maybe you don't want to use your powers. If you ask Avery to move in, then you could share on rent and Avery could afford the pills... In Wicked Willow, the story is the star. There are no stat meters to juggle, no annoying failstates, no tedious puzzles, and no parsing through spoiler-laden guides to find the “true” ending. You will never think “what do they want me to say here?” when presented with a choice. Instead, every choice is equally valid and can be experienced and enjoyed on its own terms, with its own consequences. What's more, every choice in Wicked Willow causes a new branch in the story, leading to 8 unique plot paths, each with its own mystery to reveal. LGBT Themes Be honest, doesn't being a queer witch sound totally... wicked? Many of the characters and romance opportunities in Wicked Willow span across the LGBTQ community, as the story tackles topics ranging from sexual repression to gender identity to conversion therapy. Wicked Willow is set in 1993, during the time when the community was just coming out of the shadows. Diverse Creative Team I am very proud to say our creative team includes diverse representation in terms of gender, gender identity, sexuality, age, ethnicity, country of origin, and primary spoken language. Features Full Voice Acting 75k word script with 8 branching paths and endings Animated Cutscenes Original Soundtrack Unlockable 'Choice Map' to help find all routes Unlockable Gallery",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1187600/header.jpg?t=1594081390",
    "Price": 19.99,
    "Developers": "T.F. Wright",
    "Publishers": "T.F. Wright",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1187600/ss_49bca6213bb66e617895e244e409e13a84518fea.1920x1080.jpg?t=1594081390,https://cdn.akamai.steamstatic.com/steam/apps/1187600/ss_ef840474be5b3ec8b64ea87fcf0e4f46990768f4.1920x1080.jpg?t=1594081390,https://cdn.akamai.steamstatic.com/steam/apps/1187600/ss_b6d763f1f93fa3b4f31762fd36464e2a7d09ed31.1920x1080.jpg?t=1594081390,https://cdn.akamai.steamstatic.com/steam/apps/1187600/ss_b5a4305087f01720668d23ed64ec0d99574d3a98.1920x1080.jpg?t=1594081390,https://cdn.akamai.steamstatic.com/steam/apps/1187600/ss_59133047bbc88bd3d9d639c7d15ebd5ed94a2ad1.1920x1080.jpg?t=1594081390",
    "Slug": "wicked-willow",
    "Meta Title": "Wicked Willow: Jun 2, 2020, T.F. Wright and Full Overview",
    "Meta Description": "Looking for information on Wicked Willow? Check out the release date (Jun 2, 2020), developer insights from T.F. Wright, and a complete game summary.",
    "Alt Text Image": "Official header image for Wicked Willow game - Steam 1187600",
    "Canonical URL": "https://gusku.site/game/wicked-willow",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wicked Willow\", \"description\": \"Looking for information on Wicked Willow? Check out the release date (Jun 2, 2020), developer insights from T.F. Wright, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 2, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"T.F. Wright\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"T.F. Wright\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1187600/header.jpg?t=1594081390\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}