{
    "AppID": 1850610,
    "Name": "Winter and People",
    "Release date": "Apr 11, 2022",
    "About the game": "Build houses, put heat towers, defend your way with gun towers! Winter and People offers a chill experience through the eyes of leaders. Control your workers, give them orders and make them professionals! Redirect to occupations such as lumberjack, miner, fueler, toolmaker and farmer. Lumberjacks understand forests and have the technical knowledge to process trees for you. Miners can mine you coal and iron. Fuelers combine wood and coal in secret formulas and produce fuels to heat your city. Many professionals like this work for their city in their own technical field. Every city has a highway. This road eventually reaches the town hall. Your enemies move to besiege your town hall using your main road. This is very advantageous for you. While slowing down your enemies with your ice towers on your main road, you can burn them with your flame towers. But there is something you must remember. Without your heat towers, it is impossible for your city to survive. Heat towers radiate heat around them within a certain range. In this way, the surrounding structures do not freeze and they stand ready to collide with their enemies. Of course, trade is essential. Your city produces and needs many resources. Sometimes you produce your own resources, sometimes you can buy them from the market. What do you do when your fuel seems pretty low and you need to do something urgently? You can either increase fuel production with more fuelers or quickly order tons of fuel from the market. Of course, prices in the market are not always fixed. You may notice price changes in some sources according to the market. As you can make purchases, you can also sell the resources you have in your possession through your market. A lot of money means a lot of resources! While your people work for their city, they are responsible for paying the amount of tax you set. From the tax panel, you can quickly set how much and how often they pay tax. Too many taxes will bore your people and therefore resource production will be quite slow; sometimes even crushed by consumption. That's why you should set the tax in a balanced way and not slow down the resource production. Of course, you have specific tasks to do in these experiences through the eyes of each leader. For example, a leader whose dream is to get rich may have a goal of reaching a certain amount of money. Or, a leader who doesn't care much about his people may be a goal he has set himself to be taxed all his life. You must defend your city by getting stronger without being crushed under these challenging missions. Of course, your people are made up of people and their people need to be fed. No one can do their job without food or water. That's why you have to control the amount of food very carefully so that your people do not starve. If you cannot heat your buildings enough with heat towers, your buildings will slowly start to freeze. If you don't rescue them immediately, they will freeze and become unusable. Be very careful with this because a frozen structure can never be demolished. Winter and People blends tower defense and city building genres with its minimal style; It is a tower defense game where you try to survive in cold cities.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1850610/header.jpg?t=1652625095",
    "Price": 5.99,
    "Developers": "Mercimek Games",
    "Publishers": "Mercimek Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1850610/ss_8d94d45ec5324f5c3b5e6570039f3155009e74d5.1920x1080.jpg?t=1652625095,https://cdn.akamai.steamstatic.com/steam/apps/1850610/ss_74241519f4870cd2aa841821c13b4b862cc5f978.1920x1080.jpg?t=1652625095,https://cdn.akamai.steamstatic.com/steam/apps/1850610/ss_d60726e69bc4a70cb517687ee45926bca9c7d7b5.1920x1080.jpg?t=1652625095,https://cdn.akamai.steamstatic.com/steam/apps/1850610/ss_8011e552d93bf25973a861586cf1fafc08dbb92f.1920x1080.jpg?t=1652625095,https://cdn.akamai.steamstatic.com/steam/apps/1850610/ss_162fcc59b04ffaabe111a38e14a8aa6e3c26409b.1920x1080.jpg?t=1652625095,https://cdn.akamai.steamstatic.com/steam/apps/1850610/ss_f21ddbc4dc20a76f5b721529c08fe4910a251e43.1920x1080.jpg?t=1652625095,https://cdn.akamai.steamstatic.com/steam/apps/1850610/ss_e9f1745864cc42b4cb9f98dfa9225b9561a72a13.1920x1080.jpg?t=1652625095,https://cdn.akamai.steamstatic.com/steam/apps/1850610/ss_89b4ca73c804d334f53188b6f95ad817d6888111.1920x1080.jpg?t=1652625095,https://cdn.akamai.steamstatic.com/steam/apps/1850610/ss_65fab78e65dc6257f0497ae75b0f3d7e11ccdeb3.1920x1080.jpg?t=1652625095,https://cdn.akamai.steamstatic.com/steam/apps/1850610/ss_1b61cd505188f7e57c8e03aa58dece15659c06c7.1920x1080.jpg?t=1652625095,https://cdn.akamai.steamstatic.com/steam/apps/1850610/ss_ac240d0aca8b05ad3fc1abc3ccf8314daa5380b0.1920x1080.jpg?t=1652625095",
    "Slug": "winter-and-people",
    "Meta Title": "Winter and People: Apr 11, 2022, Mercimek Games and Full ...",
    "Meta Description": "Looking for information on Winter and People? Check out the release date (Apr 11, 2022), developer insights from Mercimek Games, and a complete game sum...",
    "Alt Text Image": "Official header image for Winter and People game - Steam 1850610",
    "Canonical URL": "https://gusku.site/game/winter-and-people",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Winter and People\", \"description\": \"Looking for information on Winter and People? Check out the release date (Apr 11, 2022), developer insights from Mercimek Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mercimek Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mercimek Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1850610/header.jpg?t=1652625095\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}