{
    "AppID": 1850790,
    "Name": "Would you like to run an idol café? 3",
    "Release date": "May 9, 2022",
    "About the game": "In this Visual Novel Yokoyama Naoya was an average guy who, after putting his checkered past behind him, began to work at a small café by the beach. With his two cute co-workers, the serious Mayuki and the enigmatic Kuu, Naoya led a relaxing life - until he learns that the café's revenue is dwindling, and it's on the brink of closure. Not knowing what else to do, Naoya consults his childhood friend, Ichigo, who suggests that she form an idol group with Mayuki and Kuu to help promote The Seaside Café. While initially skeptical, Mayuki and Kuu consent to this plan, and so form their own amateur idol group: Sweet Shoreline. Despite being a newbie group, Sweet Shoreline's first music video is a massive viral success, which nets them a lot of online attention. In the wake of their newfound fame, Sweet Shoreline are invited to a large competition in Tokyo, which will pit them against various upcoming idol groups, to see who will come out on top. Ichigo is, of course, thrilled by this idea, though the shy, self-conscious Mayuki is less sure. Tensions run rife among the girls of Sweet Shoreline: tensions that are further exacerbated once it's discovered their rival idol group, Honey Devil, have also been offered an invitation to take part on this competition. Will the girls be able to snatch an unexpected victory, despite being underdogs, or will Honey Devil destroy them? The fate of Sweet Shoreline, and of The Seaside Café, rests, once again, upon Naoya's shoulders. Suzuki Ichigo is Naoya's childhood friend. She's a happy-go-lucky, kind-natured girl, who never falters in the face of adversity. Ichigo might act like an airhead, but she's a hard worker, and she's a fiercely loyal friend. Ichigo is a huge fan of idols, and has a lot of knowledge about the idol industry in general. As such, she was appointed Sweet Shoreline's leader, and it's her job to cheer everybody up when they're feeling blue. Shinonome Mayuki is a serious girl who (to nobody's surprise) used to be the class president back in high school. Initially aloof and haughty, Mayuki is, deep down, a shy and sweet-natured girl, who has a bit of an inferiority complex. Mayuki isn't particularly good at singing or dancing, but she's striving to improve her skills every day. Yamashiro Kuina, better known by her nickname 'Kuu', is a kooky girl whose head is perpetually in the clouds. Kuu is deeply interested in the occult, and she enjoys telling other people's fortunes - though the fortunes she tells are replete with suffering and misery. Kuu is (surprisingly) a good singer, though she isn't the most emotive performer, and her dancing - to put it kindly - is about as animated as a corpse's. Enoshima Rina is a young woman who, at a glance, might appear demure and elegant, but this is a front. Deep down, Rina is a scheming, vindictive vixen, who has no qualms in resorting to underhanded techniques to bring down her foes. Rina belongs to the idol group Honey Devil, and she regards the girls of Sweet Shoreline as her rivals. Rina will stop at nothing to triumph over them, and not even seduction is off-limits. Ebihara Hasaki is a girl who dresses from head to toe in fancy, frilly dresses. She fancies herself as 'the dark one', who was granted powers by the mysterious 'dark lord', and she often talks about the encroaching apocalypse. Hasaki might be delusional, but she's a talented idol in her own right, and she makes up the second half of Honey Devil, alongside Rina. While Hasaki isn't as ambitious as her partner, her striking image means she has a lot of adoring fans, who love her quirky image. Hoshizora Shiori is Japan's top idol, and has been for several years. Mature for an idol, yet effortlessly classy and sophisticated, Shiori has amassed a truly massive following. Shiori herself might be a superstar, but little is known about her personal life. She's a private woman, who largely keeps to herself - though this might change once she takes an interest in Naoya.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1850790/header.jpg?t=1652118065",
    "Price": 9.99,
    "Developers": "StarlightTree Games",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1850790/ss_fc64f7cd1454be624aa72ec7f716c7ee55e7a74e.1920x1080.jpg?t=1652118065,https://cdn.akamai.steamstatic.com/steam/apps/1850790/ss_3a060698774b3611f8d003acdb0f5e1ec0b7408b.1920x1080.jpg?t=1652118065,https://cdn.akamai.steamstatic.com/steam/apps/1850790/ss_2d46339238d206bf45c3b4a78189395f4536e504.1920x1080.jpg?t=1652118065,https://cdn.akamai.steamstatic.com/steam/apps/1850790/ss_353666b504b199bd1c88a7d69d647228e4840439.1920x1080.jpg?t=1652118065,https://cdn.akamai.steamstatic.com/steam/apps/1850790/ss_06394c7e7e0d659e1fa8c43d81eac038cb8092d6.1920x1080.jpg?t=1652118065,https://cdn.akamai.steamstatic.com/steam/apps/1850790/ss_090351751be01c862909da7f5c359763706bd843.1920x1080.jpg?t=1652118065,https://cdn.akamai.steamstatic.com/steam/apps/1850790/ss_4186a5541c9c21f7ae547a316bc07c2f68a2debb.1920x1080.jpg?t=1652118065,https://cdn.akamai.steamstatic.com/steam/apps/1850790/ss_a05edbd120372ad5a6d30196de9ac756f2dbe635.1920x1080.jpg?t=1652118065,https://cdn.akamai.steamstatic.com/steam/apps/1850790/ss_7556ea02f55ce8015f51fe682317dc84d2d5c0aa.1920x1080.jpg?t=1652118065",
    "Slug": "would-you-like-to-run-an-idol-caf-3",
    "Meta Title": "Would you like to run an idol café? 3: May 9, 2022, Starl...",
    "Meta Description": "Looking for information on Would you like to run an idol café? 3? Check out the release date (May 9, 2022), developer insights from StarlightTree Games,...",
    "Alt Text Image": "Official header image for Would you like to run an idol café? 3 game - Steam 1850790",
    "Canonical URL": "https://gusku.site/game/would-you-like-to-run-an-idol-caf-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Would you like to run an idol caf\\u00e9? 3\", \"description\": \"Looking for information on Would you like to run an idol caf\\u00e9? 3? Check out the release date (May 9, 2022), developer insights from StarlightTree Games,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"StarlightTree Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1850790/header.jpg?t=1652118065\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}