{
    "AppID": 1199220,
    "Name": "An Odyssey: Echoes of War",
    "Release date": "Dec 26, 2019",
    "About the game": "Fight the sea god's wrath to reclaim your throne, and free yourself from the ghosts of war. Will you live forever as a hero, a sovereign, or as a god? An Odyssey: Echoes of War is an interactive retelling of Homer's The Odyssey by Natalia Theodoridou, where your choices control the story. It's entirely text-based—250,000 words, without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination. The war is over—Troy has fallen. After ten long years, you, the crown sovereign of Ithaca, have set your sails for home. But Poseidon, god of the sea, has cursed your journey, and now, many trials stand between you and the loving embrace of your spouse and son: Polyphemus the Cyclops, Scylla and Charybdis, the Sirens, the Land of the Lotus-Eaters…you and your companions will even journey to the land of the dead. And what about the memories that haunt you: the ghosts of those that you slew on the fields of battle? Do you even want to return to your spouse and the burdens of rulership? What if you find love or peace somewhere along the way? Not all homes look the same. And what songs will the poets sing of you—will they hail you as a hero?...Or a murderer? Play as a female, male, or non-binary, cis or trans; gay, straight, bi, aro and/or ace; monogamous or polyamorous. Lead your crew across the wine-dark sea, home to Ithaca—or fall prey to the many temptations along the way. Make your way as a leader, a fighter, or rely on your notorious silver tongue as the protean hero of The Odyssey . Build your reputation and make sure you are remembered as a hero--or redefine the meaning of heroism itself. Prove yourself to the gods and claim your place in the pantheon as a god yourself. Face your personal demons and the actual monsters of ancient Greece: the Cyclops, the Sirens, Scylla and Charybdis, and the Hydra! Return to the loving embrace of your spouse and son who wait for you in Ithaca, or make a new home for yourself along the way. Travel to the underworld—but make sure you can pay the ferryman, and tame the three-headed Cerberus! They say you can’t go home again...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1199220/header.jpg?t=1643839266",
    "Price": 5.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1199220/ss_ba6bb6af7ae0431649453f400d10a80a8892ce4a.1920x1080.jpg?t=1643839266,https://cdn.akamai.steamstatic.com/steam/apps/1199220/ss_84ed4ba963c3bbba91dc8e997e8ee6d552aea09e.1920x1080.jpg?t=1643839266,https://cdn.akamai.steamstatic.com/steam/apps/1199220/ss_c70e25a0f91140b63acc64ef1b20f46887ed9efd.1920x1080.jpg?t=1643839266,https://cdn.akamai.steamstatic.com/steam/apps/1199220/ss_1480673a7bb44e65396c492be29dd6313d65f6c9.1920x1080.jpg?t=1643839266,https://cdn.akamai.steamstatic.com/steam/apps/1199220/ss_02dd378f1870e8c0a883dd0fa8a30e255e06f357.1920x1080.jpg?t=1643839266",
    "Slug": "an-odyssey-echoes-of-war",
    "Meta Title": "An Odyssey: Echoes of War: Dec 26, 2019, Choice of Games ...",
    "Meta Description": "Looking for information on An Odyssey: Echoes of War? Check out the release date (Dec 26, 2019), developer insights from Choice of Games, and a complete...",
    "Alt Text Image": "Official header image for An Odyssey: Echoes of War game - Steam 1199220",
    "Canonical URL": "https://gusku.site/game/an-odyssey-echoes-of-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"An Odyssey: Echoes of War\", \"description\": \"Looking for information on An Odyssey: Echoes of War? Check out the release date (Dec 26, 2019), developer insights from Choice of Games, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 26, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1199220/header.jpg?t=1643839266\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}