{
    "AppID": 1464130,
    "Name": "Archons of Doom",
    "Release date": "Nov 30, 2021",
    "About the game": "Key Features: 42 spells to find and unlock! Turn based gameplay that supports matches against up to three other Archons simultaneously. 18 levels to conquer, from the green lands of Ambion to the Desert of Sandstone, with icey Underworlds to discover. Fog of war - uncover the map as you go. Hidden movement - you do not know what your enemies are, or where, until you encounter them! The horrifying Undead - creatures that return to life when slain. Futuristic Robots - require Power Cores to summon or create from spare parts. Mountable creatures to take you and your followers into battle. Creatures that can spread and multiply across the map. Alternative ways to win, including the use of Subversion and Charms to bring the foe to your side. Creatures that can open and close doors, pickup items, 'tool up' with weapons and armour. Upgradeable creatures that gain multiple attacks for draining the souls of their foes. Ranged attacks, return attacks and regeneration. Illusions, fire, slippery ice, larva, rivers, lakes and bridges. Creatures that can fly outdoors and attack from relative safety. Full and complete Conquer the Universe campaign. Random generation of Archons for Skirmishes, and a realm that is totally different every time it is played - Rendleshire. An Archon Designer to make your own powerful dark spirit, your way. Many Steam Achievements to get. Three different endings for the player to pick from - including one to consign the entire universe to oblivion! Archon of Doom indeed... A cultist draws a pentagram on the ground, holds the forbidden Nox Codex and reads from one of its red inked pages. The cultist chants the Omnia Infernum, and as the last syllable is spoken, is levitated several feet into the air and begins to scream uncontrollably. The spirit of the speaker is ripped away, hurtling into a chasm of darkness, and the anguished voice now becomes the peal of a deep rumbling laughter and the figure returns to the ground on which the arcane symbol was drawn. What now stands in the body of the cultist is no longer a human being - but an Archon of Doom - who intends to conquer everything in this realm with the aid of its Celestial Court of worshippers and allies. It turns its attentions to its immediate surroundings and begins to put into action a diabolical plan... There will be blood! In Archons of Doom, you will take on the role of a powerful and evil being that seeks to conquer universe! You have a host of creatures you can summon from your dark court, all of which serve you until death - and sometimes beyond it as well. You are up against another Archon of Doom in each of these realms that seeks to thwart your will and take over the universe themselves. Both Archons will have to fight any independent creatures - the defenders of their realms. You have to destroy the enemy Archon to win the realm. The game plays out as a turn based clash of wills, expressed as an exploration into the unknown and featuring hidden movement, line of sight, summoning reinforcements during the game, arming up yourself and your followers and seeking out valuable treasures to gain a tactical advantage. Creatures can fly, return to life when slain, drain the lifeforce from others, charm foes onto your side and even steal the very weapons right from the very hands of your foes! Some creatures can be ridden by others, some are amphibious, some may walk through walls and other solid objects, some divide in two and slowly take over the map, some create more of themselves when they get a kill... Archons are powerful magic users that can use spells to influence the battle field and destroy their enemies. They can also draw powerful magical circles on the ground and bask units in them to boost their normal powers to greater levels. However, you must always protect your Archon - lose it and all the creatures controlled are instantly, Doomed... costing you the realm. Only the strong will survive. All else are Doomed...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1464130/header.jpg?t=1638344721",
    "Price": 11.99,
    "Developers": "Third Impression",
    "Publishers": "Third Impression",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1464130/ss_2260ff61fc17c8602b35589a3401acc145ba260d.1920x1080.jpg?t=1638344721,https://cdn.akamai.steamstatic.com/steam/apps/1464130/ss_f02a295f6d5e0ec04e46e979dafca9bde40294b7.1920x1080.jpg?t=1638344721,https://cdn.akamai.steamstatic.com/steam/apps/1464130/ss_a6854a8bf92f5071078de4ab2a3373bfd16ce420.1920x1080.jpg?t=1638344721,https://cdn.akamai.steamstatic.com/steam/apps/1464130/ss_e72784fb4837d24d0393bc2d9a39e25bf4a8e8ee.1920x1080.jpg?t=1638344721,https://cdn.akamai.steamstatic.com/steam/apps/1464130/ss_a9eb7d858be3dda44f85beafa12e43c5821ad3ee.1920x1080.jpg?t=1638344721,https://cdn.akamai.steamstatic.com/steam/apps/1464130/ss_f6f8d4e9847be340b1d4b56829e6ae9d31e4274e.1920x1080.jpg?t=1638344721,https://cdn.akamai.steamstatic.com/steam/apps/1464130/ss_1136bdd99086928a8c133c6fcae442ff5d0cd039.1920x1080.jpg?t=1638344721,https://cdn.akamai.steamstatic.com/steam/apps/1464130/ss_0508198fb26643a9d826df9f079934518b08c322.1920x1080.jpg?t=1638344721",
    "Slug": "archons-of-doom",
    "Meta Title": "Archons of Doom: Nov 30, 2021, Third Impression and Full ...",
    "Meta Description": "Looking for information on Archons of Doom? Check out the release date (Nov 30, 2021), developer insights from Third Impression, and a complete game sum...",
    "Alt Text Image": "Official header image for Archons of Doom game - Steam 1464130",
    "Canonical URL": "https://gusku.site/game/archons-of-doom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Archons of Doom\", \"description\": \"Looking for information on Archons of Doom? Check out the release date (Nov 30, 2021), developer insights from Third Impression, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Third Impression\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Third Impression\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1464130/header.jpg?t=1638344721\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}