{
    "AppID": 283680,
    "Name": "Astebreed: Definitive Edition",
    "Release date": "May 30, 2014",
    "About the game": "Major updates! Astebreed is getting a major update to its “Definitive Version” for PC, including all of the PS4 features! Users who already own Astebreed will receive this update for free. What has been updated? Newly added “Arrange Mode” In the Gallery, you can find various artworks commissioned after the PS4 version. Exclusive to PC! Optimized controller system Additional (and improved) upgrades Adjusted enemy placement and behavioral patterns across all stages &amp; difficulty levels Additional episodes and demo scenes adding to the story Additional new music Improved graphics and 1920x1080 support Improved 3D models Improved textures and higher resolution New compression format to improve details, lighting etc. Improved backgrounds and detail effects A wide variety of various adjustments and improvements *Due to the major updates listed above, the price has been increased to $19.99 as of Nov. 7th, 2017 STORY You play as Roy Becket, a young pilot with dreams of becoming as skilled as his adoptive father. When a galactic war against an ancient mechanical alien race reaches its boiling point, Roy is forced to spring into action and take control of an otherworldly bipedal war machine in hopes of saving what's left of humanity. Joining Roy is a young girl who claims to have escaped the clutches of the nefarious aliens. Forever altered through the horrible experiments to which she was subjected, she now possesses the very abilities humanity will need to push back the Doomsday Clock. Together, the pair must face an unrelenting army alone and reunite their shattered families. The end of civilization as we know it is on the horizon. Between humanity and eradication stands Astebreed. The Arcade Shooter Genre, Evolved Astebreed breathes new life into the classic arcade shooter genre. Using painstakingly crafted 3D models, cutting-edge particle effects, and old-school Japanese mech designs, Astebreed delivers an unparalleled experience of beautiful destruction. Armed to the Teeth Roy has a considerable arsenal at his disposal. Armed with the mysterious Lucis device, Roy's mech can unleash long-distance attacks, paint targets with a laser for precision homing attacks, and even get up close and personal for a killing blow with a powerful blade attack. No enemy shall escape your wrath, no matter where they hide. Dynamically Changing Perspective Your enemies are not always up in front of you. Your enemies swarm, fly, and intercept, and Astebreed's dynamic perspective always keeps the action in view. Seamlessly switching between vertical, horizontal, and 3D shooter, Astebreed will keep you guessing what your next threat will be, without ever interrupting the action.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/283680/header.jpg?t=1592542994",
    "Price": 19.99,
    "Developers": "Edelweiss",
    "Publishers": "PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/283680/ss_ed529bfec360998e86b0e0167752a09474fe1525.1920x1080.jpg?t=1592542994,https://cdn.akamai.steamstatic.com/steam/apps/283680/ss_0d1706190732867e093b647356a1a40c3bde9067.1920x1080.jpg?t=1592542994,https://cdn.akamai.steamstatic.com/steam/apps/283680/ss_d315beb4012f1193e8aa222145fc5d56209d6f2d.1920x1080.jpg?t=1592542994,https://cdn.akamai.steamstatic.com/steam/apps/283680/ss_dc3befff5ec61e3ad5e18a9bce7164b5ee285350.1920x1080.jpg?t=1592542994,https://cdn.akamai.steamstatic.com/steam/apps/283680/ss_2f4a9aaffefb173943de8c6798b5a5d0aa39d00a.1920x1080.jpg?t=1592542994,https://cdn.akamai.steamstatic.com/steam/apps/283680/ss_34b18a24ea1c507e7cf2239040c920ead894bd45.1920x1080.jpg?t=1592542994,https://cdn.akamai.steamstatic.com/steam/apps/283680/ss_675495c04e0a621894d78d4eb4f17822836a1b61.1920x1080.jpg?t=1592542994,https://cdn.akamai.steamstatic.com/steam/apps/283680/ss_269e32a96a21abf17cd0102096a6e6e6d5aa8b27.1920x1080.jpg?t=1592542994",
    "Slug": "astebreed-definitive-edition",
    "Meta Title": "Astebreed: Definitive Edition: May 30, 2014, Edelweiss an...",
    "Meta Description": "Looking for information on Astebreed: Definitive Edition? Check out the release date (May 30, 2014), developer insights from Edelweiss, and a complete g...",
    "Alt Text Image": "Official header image for Astebreed: Definitive Edition game - Steam 283680",
    "Canonical URL": "https://gusku.site/game/astebreed-definitive-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Astebreed: Definitive Edition\", \"description\": \"Looking for information on Astebreed: Definitive Edition? Check out the release date (May 30, 2014), developer insights from Edelweiss, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 30, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Edelweiss\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/283680/header.jpg?t=1592542994\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}