{
    "AppID": 1931960,
    "Name": "BAWs Pharmacy",
    "Release date": "May 12, 2022",
    "About the game": "BAW’s Pharmacy is a mobile time management and strategy game. Players manage a medical warehouse and sell products to hospitals and clinics. Customers will approach the sales counter and request a specific item for purchase. With the increase in need due to COVID-19, players must move quick to select the right product! Correct choices result in currency allowing players to purchase additional stock and upgrades. Upgrades can help to keep customers happy and make your store more efficient! At the end of each workday, players review their data to determine which supplies are best to invest in using box and whisker plots. Choose carefully to ensure your store has what it needs to succeed! Directions for BaW’s Pharmacy Welcome to BaW’s Pharmacy, this document will give you a general guide on how to play the game. In this game you run a pharmacy that provides products from face masks to pain pills. Main Menu When you load up the game there will be a main menu where you will have to write your name or username and sign in. Once you write your username, press the Sign In button and then the Play button will become available. There will also be many other different buttons. Firstly, the Play button will take you into the main game and allow you to run the store and do your post daily box and whisker graphs. The How to Play button will take you to a screen that will explain how different aspects of the game work. The Options button will take you to a screen that allows you to change sounds and other options within the game. The Trivia button will put you through different box and whisker graph scenarios and allow you to practice there on them.   Main Game - Running the Store In the main game you will control the person behind the counter. As customers come into your store and approach the counter, they will have an image and a timer above their heads. The image depicts what item the customer is requesting. The orange image behind the image of the item will slowly disappear as a customer waits in line and for their item, this represents a customer’s patience. Patience will be important because if a customer’s patience runs out, they will get upset and leave the store, causing you to lose your sale. When a customer approaches and you want to make a sale to them, you need to tap on the icon above their head. When you tap on the icon the store inventory will open and you must then tap on the correct item and then confirm so that your pharmacist can go to the back of the store and grab the item. The pharmacist will return and give the item to the customer making a sale. You can use upgrades within the store too. There are several upgrades you can acquire and next to each upgrade there is a description telling you what it does. Then you can continue working until the end of the day is reached.   Main Game - End of Day Graph At the end of each day you will be taken to a screen that will show a box and whisker graph that is generated by your sales throughout the day. The data values that should appear on the bottom of the graph are scrambled on the right side of the screen and you will need to drag and drop them into the correct place to continue onto the next day. If you need a detailed walkthrough on box and whisker graphs it is recommended visiting the how to play or the tutorial. That is about it on the instructions for BaW’s Pharmacy! While in the game if more help is needed just visit the how to play, the trivia or the tutorial in game and these will explain again how to play BaW’s Pharmacy successfully.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1931960/header.jpg?t=1653616724",
    "Price": 0.0,
    "Developers": "CelleC Games",
    "Publishers": "TDSDP is Transdisciplinary Data Scholars Development Program (TDSDP) - TDSDP Games Transdisciplinary Data Scholars Development Program at Bethune-Cookman University",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1931960/ss_bb82fe70232e0ed3e4f0426e0c4bba4d36b49f58.1920x1080.jpg?t=1653616724,https://cdn.akamai.steamstatic.com/steam/apps/1931960/ss_5e14320565287c402b52f22fe2ba8d1964c53d20.1920x1080.jpg?t=1653616724,https://cdn.akamai.steamstatic.com/steam/apps/1931960/ss_fe933f780752b3d945ceae5e43ca86ea67a74756.1920x1080.jpg?t=1653616724,https://cdn.akamai.steamstatic.com/steam/apps/1931960/ss_5facb688cc88fd4aa8be929d4f3bf0220f29e6e1.1920x1080.jpg?t=1653616724,https://cdn.akamai.steamstatic.com/steam/apps/1931960/ss_4cac608bdad98431cd785c3ebae62874afa3aba4.1920x1080.jpg?t=1653616724,https://cdn.akamai.steamstatic.com/steam/apps/1931960/ss_592508c57e2935b6c4fd5b2a92d5f1275a7ace7b.1920x1080.jpg?t=1653616724,https://cdn.akamai.steamstatic.com/steam/apps/1931960/ss_7ca5317bb406406a443cda94fa017e14360db6b1.1920x1080.jpg?t=1653616724,https://cdn.akamai.steamstatic.com/steam/apps/1931960/ss_8c2c12a088c516407f46a995cbdd8ff32fc16ee1.1920x1080.jpg?t=1653616724,https://cdn.akamai.steamstatic.com/steam/apps/1931960/ss_abb57fe6678e29782799715721763d036f36830b.1920x1080.jpg?t=1653616724,https://cdn.akamai.steamstatic.com/steam/apps/1931960/ss_fcce0bad950ff480eceb597a442baa0ca56768ce.1920x1080.jpg?t=1653616724",
    "Slug": "baws-pharmacy",
    "Meta Title": "BAWs Pharmacy: May 12, 2022, CelleC Games and Full Overview",
    "Meta Description": "Looking for information on BAWs Pharmacy? Check out the release date (May 12, 2022), developer insights from CelleC Games, and a complete game summary.",
    "Alt Text Image": "Official header image for BAWs Pharmacy game - Steam 1931960",
    "Canonical URL": "https://gusku.site/game/baws-pharmacy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BAWs Pharmacy\", \"description\": \"Looking for information on BAWs Pharmacy? Check out the release date (May 12, 2022), developer insights from CelleC Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CelleC Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TDSDP is Transdisciplinary Data Scholars Development Program (TDSDP) - TDSDP Games Transdisciplinary Data Scholars Development Program at Bethune-Cookman University\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1931960/header.jpg?t=1653616724\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}