{
    "AppID": 1792820,
    "Name": "Blade&Sword",
    "Release date": "Feb 23, 2022",
    "About the game": "This is a ported version of the original game, but not a remake version. This game is temporarily not supported for Windows 11. ◆Introduction of Blade&amp;Sword This game is an action role-playing game, in which players will be in the ancient time of more than 3000 years ago and use their swords to fight against the spirit of the Emperor Jo of Country Jo who is trying to annex the world. It is China's first action RPG, released in multiple countries including China, Japan, the United States and Russia, with 200,000 authentic copies worldwide, creating a miracle of domestic single-player games in the early 21st century. In 2003, Blade&amp;Sword was listed in the Top 10 role-playing games for 10 days in a row by Gamespot, a famous game media in the United States, and was ranked at the top for three days. ◆Features This game is different from the previous ARPG games, it is an RPG game with fighting as the main theme. It cleverly introduces the idea of fighting games and breaks the rules to integrate it with the game. In the battle, players can use jabbing, slashing, chopping, jumping, dodging, blocking and other actions as well as all kinds of kung fu techniques to experience the thrill of fighting. About the story The story of Blade&amp;Sword begins about 3,000 years ago. Emperor Wu destroyed the Country Jo. At the end of the war, Emperor Jo set himself on fire on the Star Building in Zhaoge. Before the death of Emperor Jo, the Country Jo's Wizard, Wen Zhong, used his lifelong magic power to take the vengeful thoughts of the Emperor Jo away from the world, so that he could return to the human world and reclaim his throne in the future. Many people from different eras were swept into the same space by this inexplicable force, and the intersection of parallel worlds including human world, Branch Brute, Branch Ghoul caused many monsters to flow around through this gap. These monsters are controlled by Wizard Wen, and they organize a huge army of monsters to operate in the human world and hell. Our protagonist was also drawn into this space, and now he has arrived at a village called Wa-dang -- How to Play 1. Three protagonist with different abilities The game is designed with three distinct protagonists, namely a Swordsman, a Warrior and a Heroine. They each have their own special skills and moves, allowing players to have a richer combat experience. ・Swordsman 　Each attribute is average, with good performance in speed and strength, and a variety of attack methods. 　There are both skillful combo attacks and powerful sure strikes, as well as the ability to hit enemies from a distance with Chi. 　Overall, there are no obvious flaws or strengths, and it is a relatively easy character to get used to. Suitable for beginner players. ・Warrior 　High attack power, able to destroy enemies within a few moves. High hit point and good physical strength. 　He can permanently improve certain attributes through training. The disadvantage is the slow speed, making it easy to be hit by enemies. 　He is also weak in catching the enemy's movement, and it is difficult to hit combo attacks in a row because of the pursuit of one fatal move. 　It is not easy to operate the Warrior, to be comfortable with it must be more practice to master its moves performance. Suitable for advanced players. ・Heroine 　She is very fast and dexterous enough to make it difficult for enemies to hit her while being able to attack them accurately. 　She is able to hit combo attacks and has a magnificent leg technique. 　The sword technique used does not seek to kill, but can destroy the enemy's limbs to disable their attacks. It is the only character who can use supporting skills. 　The disadvantages are weak attack power, short attack distance, and low hit point. Suitable for intermediate players. 2. How to operate Mouse left button: move/interact/release the skill set by the left button Right Mouse button: Release the skill set by the right button Shift：Run Alt：Defense Spacebar: Dodge Hold down the Alt key and use the left mouse button to draw trajectory of the Killing Blow: switch between Killing Blows Z key: Pick up with one click Keys 1～6: Use the corresponding potion F1～F6：Use the corresponding inventory",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1792820/header.jpg?t=1645688410",
    "Price": 5.99,
    "Developers": "Beijing Pixel Software Technology Joint-Stock Co.,Ltd.",
    "Publishers": "Beijing Happy Entertainment Technology",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1792820/ss_310cd6449b0752b4c7225f406fa2c529a61501f8.1920x1080.jpg?t=1645688410,https://cdn.akamai.steamstatic.com/steam/apps/1792820/ss_37eeb8283b838d76c279a026c239b88a31555b9f.1920x1080.jpg?t=1645688410,https://cdn.akamai.steamstatic.com/steam/apps/1792820/ss_d9d9586e614a887be53dd05259de84dcd18b0b70.1920x1080.jpg?t=1645688410,https://cdn.akamai.steamstatic.com/steam/apps/1792820/ss_7417958fa64894711a315ef58564621007bc9908.1920x1080.jpg?t=1645688410,https://cdn.akamai.steamstatic.com/steam/apps/1792820/ss_a8c0a8768eb242ecf2de5dc1aecbe9e453cdafa8.1920x1080.jpg?t=1645688410,https://cdn.akamai.steamstatic.com/steam/apps/1792820/ss_3d0b521ead74291d639574160040b71eba747821.1920x1080.jpg?t=1645688410,https://cdn.akamai.steamstatic.com/steam/apps/1792820/ss_3637945ae0732c70ddac0dec6fae3e2450f91df3.1920x1080.jpg?t=1645688410",
    "Slug": "blade-sword",
    "Meta Title": "Blade&Sword: Feb 23, 2022, Beijing Pixel Software Technol...",
    "Meta Description": "Looking for information on Blade&Sword? Check out the release date (Feb 23, 2022), developer insights from Beijing Pixel Software Technology Joint-Stock...",
    "Alt Text Image": "Official header image for Blade&Sword game - Steam 1792820",
    "Canonical URL": "https://gusku.site/game/blade-sword",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Blade&Sword\", \"description\": \"Looking for information on Blade&Sword? Check out the release date (Feb 23, 2022), developer insights from Beijing Pixel Software Technology Joint-Stock...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 23, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Beijing Pixel Software Technology Joint-Stock Co.,Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Beijing Happy Entertainment Technology\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1792820/header.jpg?t=1645688410\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}