{
    "AppID": 1770440,
    "Name": "Breadbox",
    "Release date": "Nov 27, 2021",
    "About the game": "Breadbox is a realistic retro computer simulator. Experience the amazing machines from 70's and 80's in a visual environment. Interact with hardware and old media as if it were real. Add emulator and test your programming skills with Basic or 8-bit machine language. Add content to your virtual libraries to play games or easily access your manuals. Breadbox is not a game, it's more of a sandbox simulator. It brings a new dimension for retro-computer emulation, you can see and learn how the interactions with the hardware and old media formats work. Note! No digital copies of original software or manuals for the computers are included. It's totally up to you to add media content and learn how these computers work. If you love retro computers and simulators, this is what you've been waiting for! Note! if you are only interested on retro-gaming or you are looking for a professional tool for retro-programming, etc, you may consider other options, like emulators and capable emulator front-ends. Challenge yourself Find digital copies of original manuals and other documents from the archives of internet and add the files into your Breadbox library for easy access. Learn how these computers work, learn to code, create new games and other programs. If programming with old computers is not your thing, you can run games and other software in the computers. Find digital formats of dusty old media, like .tap, .d64 and .crt, and collect them into your simulator library. In the simulator, files can be used in the same way as real-world floppy disks, tapes, or cartridges. You can load and run the programs just like in a real retro computer. key Features: Close simulation of real world retro computers and peripherals. Immersive and beautiful visual experience. Animated close-up views and mechanical parts. Animated handling of cassette tape, floppy disk and other objects. Digital library browser Fluent emulator setup and integration. Extensive support for various keyboard layouts. (For more information, see the manual) Support for a wide variety of game-controllers. (For more information, see the manual) Limited selection of computers: Commodore 64, VIC-20, PET 2001-8 Work in progress - Early Access Your contribution matters a LOT! Simply said, this is funded by you. if you buy this product, it is the ultimate way to promote the development of Breadbox. There is so much work to do and new models to implement. We have tons of ideas waiting to be implemented, but your feedback is also appreciated. We want to know what doesn't work, to fix it. And what new features would you want to see next, to prioritize our work. Make sure, you understand what Work in progress / Early Access means? The software is not ready and many features are missing, also you may have a combination of hardware/software that is not compatible with the game yet. When you buy an Early Access product and you have issues with it, we expect that you will read the product manual, FAQ and Breadbox Steam Community forums, to see if the issue has existing solutions. If the issue is not logged or needs to be updated, you can help us by posting or updating an issue to Community forum or contacting the product support. And please, provide detailed information of the problem and specifications about your computer setup, when required. It's often the only way to help us to fix the problem! No matter how generic the problem might look like, your case can contain some unique characteristics, and is probably the reason why it has slipped our testing. And please, have atleast some patience, the dev team is still quite small and may not be able to response to every issue immediately, hence we will update the product FAQ, when common issues arise. But you may also expect us, the dev, to work relentlessly to find solutions any issue. Missing features Here's a list of some noticeable features missing from latest version. These features are planned to be implemented among with many other features not listed here. Setup mode - 360 view Currently there is no setup mode, where you'd be able to connect or disconnect the cables and peripherals. Also, there is no 360 view, where you can look around freely. Only play mode is available. In practise, this means that every peripheral is already setup for you, and you can immediately start interacting with computer, peripherals and items using point and click method. If you have done the additional emulator installation, you can program and play games with the simulated computers. Stunning visual beauty Screenshots and videos show exactly where we are now and what you get. It's nice and beautiful already. But we are not there yet, there is still some work to do until we are happy. Monitor controllers No monitor controllers, except brightness control in simulator settings. Larger selection of different computers Currently there are three computer models: Commodore 64, VIC-20 and PET 2001-8. With current resources and funding, we cannot add more computer models until the project moves out of Early Access. Computer model spec modification Computer model specs are fixed, meaning, that you can't tweak an individual computer model settings, except for the PET monitor phosphor color. Tutorial There is no in-game tutorial for new users. You need to read our online manual, get help from product community, mail us, or figure it out yourself.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1770440/header.jpg?t=1657539002",
    "Price": 24.99,
    "Developers": "Bitfall",
    "Publishers": "Bitfall",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1770440/ss_8b25f3b5471472a421cc3f9e4e0e66fb74577261.1920x1080.jpg?t=1657539002,https://cdn.akamai.steamstatic.com/steam/apps/1770440/ss_3947514eec05c31e3d4afff10e9a3f0563a61643.1920x1080.jpg?t=1657539002,https://cdn.akamai.steamstatic.com/steam/apps/1770440/ss_3da39655a181abcea611f36170f6b92ff3107abc.1920x1080.jpg?t=1657539002,https://cdn.akamai.steamstatic.com/steam/apps/1770440/ss_6a19e6056ba9ea5e4b205398d35bfd71c88eb9e7.1920x1080.jpg?t=1657539002,https://cdn.akamai.steamstatic.com/steam/apps/1770440/ss_bbe1e7835412327fd7dd06ba5ffba63b746fe7c0.1920x1080.jpg?t=1657539002,https://cdn.akamai.steamstatic.com/steam/apps/1770440/ss_871e428bc8c437c39bfa7f4491b3809fcf8e9901.1920x1080.jpg?t=1657539002,https://cdn.akamai.steamstatic.com/steam/apps/1770440/ss_0ec7e4d79df71691ef0308349f14283329d4b2f8.1920x1080.jpg?t=1657539002",
    "Slug": "breadbox",
    "Meta Title": "Breadbox: Nov 27, 2021, Bitfall and Full Overview",
    "Meta Description": "Looking for information on Breadbox? Check out the release date (Nov 27, 2021), developer insights from Bitfall, and a complete game summary.",
    "Alt Text Image": "Official header image for Breadbox game - Steam 1770440",
    "Canonical URL": "https://gusku.site/game/breadbox",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Breadbox\", \"description\": \"Looking for information on Breadbox? Check out the release date (Nov 27, 2021), developer insights from Bitfall, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bitfall\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bitfall\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1770440/header.jpg?t=1657539002\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}