{
    "AppID": 1832260,
    "Name": "Chromarena",
    "Release date": "Feb 1, 2022",
    "About the game": "Chromarena is a 2D top-down twin-stick arena shooter combining defense and offense. The game has five distinct enemies which are all themed around a different color. While each enemy alone might be a pushover, in combination they form a formidable threat. Enemy attacks layer over each other, so you'll have to be precise with both movement and shooting if you want to survive. If you can make it through all this, there's a massive boss fight that combines everything you've learned. WARNING: This game is challenging. You will die. A lot. But with &lt;5 minute runs you can get back into the action quickly. Features: Enemies: face five different enemies with different attack patterns and personalities, from the aggressive red enemy to the timid blue enemy to the mysterious purple enemy. These enemies are designed to work in tandem with each other, so each combination of enemies presents its own strategies and challenges. The color theme of the enemies makes them easily recognizable when scanning the screen. Powerups: get a powerup based on every fifth enemy you kill. These powerups give a variety of boons, from extra health to more speed and infinite dashes to a temporary weapon upgrade. Powerups also add another layer of strategy, as the savvy player plans their attacks to not only take out certain enemies, but also to get the right powerup for the situation. Difficulties: play on any of the four main difficulties or use the three practice difficulties to learn the ropes. Harder difficulties have you face more enemies at once, from one enemy at a time to the beginning of easy mode to seven deep in endless mode. The boss's attack patterns and attack speed are also scaled from easy to normal to hard. Boss Fight: if you get far enough in the game you'll encounter the boss. I won't give too much away about it here, but know that it will be a white knuckle fight that puts to test everything you've practiced to get to that stage. With two dedicated boss fight modes, there will be plenty of time to practice. Weapons: choose from six unique weapons with dramatically different playstyles and strengths and weaknesses. Each weapon is strong against one specific enemy and weak against another; use this to supplement your own strengths and weaknesses. Different unlock requirements provide a sense of progression and another objective to work towards. Score: strive for a higher score at every level of play with a scoring system that rewards both survival early on and completion speed once you can beat the game. Graphics: while graphics aren't the focus of this game, enjoy the handmade pixel graphics I made.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1832260/header.jpg?t=1643767214",
    "Price": 2.99,
    "Developers": "Kingsnake Games",
    "Publishers": "Kingsnake Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1832260/ss_e8a0e55ad2ba61010745b306930174d26a3258b2.1920x1080.jpg?t=1643767214,https://cdn.akamai.steamstatic.com/steam/apps/1832260/ss_cf11917f89371842d020eb16531e172182aa27d6.1920x1080.jpg?t=1643767214,https://cdn.akamai.steamstatic.com/steam/apps/1832260/ss_972552975984cccbc017ca918a7ee28936ae39d7.1920x1080.jpg?t=1643767214,https://cdn.akamai.steamstatic.com/steam/apps/1832260/ss_9f1e8fad6f5d70b0ff680a60f0d707e5006b4c28.1920x1080.jpg?t=1643767214,https://cdn.akamai.steamstatic.com/steam/apps/1832260/ss_c40113c9778771a3f13eb4d8caa54ebcd38eee9f.1920x1080.jpg?t=1643767214,https://cdn.akamai.steamstatic.com/steam/apps/1832260/ss_1699c348933b7ea70b6402980e8de142e7bbc8e7.1920x1080.jpg?t=1643767214,https://cdn.akamai.steamstatic.com/steam/apps/1832260/ss_ea5a83d2cce7cb368e2cb45995a340a113ccb800.1920x1080.jpg?t=1643767214",
    "Slug": "chromarena",
    "Meta Title": "Chromarena: Feb 1, 2022, Kingsnake Games and Full Overview",
    "Meta Description": "Looking for information on Chromarena? Check out the release date (Feb 1, 2022), developer insights from Kingsnake Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Chromarena game - Steam 1832260",
    "Canonical URL": "https://gusku.site/game/chromarena",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Chromarena\", \"description\": \"Looking for information on Chromarena? Check out the release date (Feb 1, 2022), developer insights from Kingsnake Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kingsnake Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kingsnake Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1832260/header.jpg?t=1643767214\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}