{
    "AppID": 1150820,
    "Name": "Delphyq",
    "Release date": "Oct 19, 2021",
    "About the game": "Delphyq is a real-time tactics game, one that puts you in the role of a mastermind in command of an elite group of combatants known as the Operatives. Every move, every decision, every action, and reaction you make will influence and decide the outcome of each encounter you will face along the way. One thing that separates Delphyq from the rest of the strategy and tactics crowd is the way it simulates real combat. Delphyq is not a turn-based game; despite it having a pause mechanic, combat is still handled in real-time. The game’s waypoints, look direction and dynamic cover systems open doors for intense, strategic, and memorable encounters. Advanced functions such as GoCodes and Operative skills provide access to deeper tactical maneuvers to deal with the game’s extremely intelligent utility-based AI enemies. Each AI unit functions in conjunction with its environment; depending on the situation, it will also try to coordinate with other AI in the field and will attempt to flank the Operatives and/or engage them through the use of cover. REAL TACTICS IN REAL TIME: In Delphyq, combat does not happen in turns. The enemy won’t wait until you’re done firing. That’s why the game provides you access to a robust waypoint and command system which allows you to perform real life military tactics and maneuvers, like Slice The Pie, Flanking, Suppressive Fire, and more. TAKE COVER: The battlefield is an ally to the mindful. Delphyq’s Dynamic Cover System guarantees that nearby cover is always available wherever units may be, allowing you to keep your Operatives alive as they take down the enemy, one area at a time. BE THE MASTERMIND: Analyze. Plan. Execute. Plan from the top and work your way to the bottom with Delphyq’s engaging Overworld and Corkboard with the Intel planning system. WE DON’T PLAY WITH DICE: There’s no such thing as luck in Delphyq. Every hit, miss, victory and defeat are all dictated by your strategy, not a random number generator. NOTHING IS WHAT IT SEEMS: Intrigue and plot twists abound! Follow the story of the ragtag militant team - Operatives, as they commit to the daunting task of taking down the corrupt corporation called 'The Balance'. Witness as the story unfolds with one revelation after another, all culminating into an unexpected conclusion.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1150820/header.jpg?t=1634664878",
    "Price": 14.99,
    "Developers": "Dusk Wave Arts LLC",
    "Publishers": "Dusk Wave Arts LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1150820/ss_e0e1a596336f99b6574324555ad1aca1d3f4aaa9.1920x1080.jpg?t=1634664878,https://cdn.akamai.steamstatic.com/steam/apps/1150820/ss_5fc519f232d1931c7cc468499976457938f4af85.1920x1080.jpg?t=1634664878,https://cdn.akamai.steamstatic.com/steam/apps/1150820/ss_84cdc93bf0996d291ce5c686ca767fa9869f0a35.1920x1080.jpg?t=1634664878,https://cdn.akamai.steamstatic.com/steam/apps/1150820/ss_2c1c0bcdfa257d16f356124883ca5124ebd43d1e.1920x1080.jpg?t=1634664878,https://cdn.akamai.steamstatic.com/steam/apps/1150820/ss_cc4b86c9156d8080ee2ddd815a90e05387f54fb6.1920x1080.jpg?t=1634664878,https://cdn.akamai.steamstatic.com/steam/apps/1150820/ss_f86ef6c835d3b47ba6fdec337993d30bad3cebdb.1920x1080.jpg?t=1634664878",
    "Slug": "delphyq",
    "Meta Title": "Delphyq: Oct 19, 2021, Dusk Wave Arts LLC and Full Overview",
    "Meta Description": "Looking for information on Delphyq? Check out the release date (Oct 19, 2021), developer insights from Dusk Wave Arts LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Delphyq game - Steam 1150820",
    "Canonical URL": "https://gusku.site/game/delphyq",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Delphyq\", \"description\": \"Looking for information on Delphyq? Check out the release date (Oct 19, 2021), developer insights from Dusk Wave Arts LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dusk Wave Arts LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dusk Wave Arts LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1150820/header.jpg?t=1634664878\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}