{
    "AppID": 795320,
    "Name": "Dissimilation",
    "Release date": "Feb 15, 2018",
    "About the game": "Take control of a ship of your choice and explore a randomly generated galaxy in Dissimilation! Dissimilation is a top down, retro styled shooter set in a randomly generated galaxy. Dock at space stations and land on randomly generated planets, populated by alien flora and fauna. Upgrade your ship by buying new weapons and armor, or craft them yourself! The upgrades will be vital in fighting off pirates, androids and even the galactic police force! Attack elite Capital ships in brutal space battles to board the wreckage and kill the captain. Slaughter the inhabitants of a colony or space station at your own risk – the structure may come under siege by galactic police. Key Features: Randomly Generated Galaxy Space stations, planets and nebula are all randomly generated to provide a unique gameplay experience for each user. Story Dissimilation features a full single player story. While exploring, you will encounter story events which will ultimately reveal the dark secret of this galaxy. Exploration A key element of Dissimilation is exploration. You can land on nearly every planet to explore its surface. Each planet will be unique with its own weather, plants and wildlife. Some will be nothing more than an arid, barren wasteland, devoid of any natural life. Some may be lush, with a climate similar to the Earth's. Depending on these conditions, the human structures will change. The more barren planets may only have a single research station or mining colony. The more picturesque planets will likely be popular galactic tourist destinations. Resource collection To acquire resources, you must mine asteroids or natural structures on planets. The yield of the planet’s structures is strongly influenced by various conditions on the planet, particularly the chemical makeup of the crust. However, Dissimilation is specifically designed to give players the maximum amount of freedom. It is therefore possible to play the game without collecting a single mineral or touching a crafting table. Loot System A variety of containers and other items of interests are randomly generated on each planet’s surface. Venturing out from the colonies and research stations is often rewarded by finding crashed escape pods or old cargo containers. There structures may contain valuable items or credits to aid you on your journey. Ship Upgrades There are a huge variety of upgrades for your ship. There upgrades range from simply installing larger fuel tanks in order to explore for longer durations of time, to increasing power to the laser cannons for a higher intensity attack.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/795320/header.jpg?t=1518693847",
    "Price": 4.99,
    "Developers": "Fivesyounger Development",
    "Publishers": "Fivesyounger Development",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/795320/ss_0c9ea3a6acdf96ac42accee37dc42ab2a04d152f.1920x1080.jpg?t=1518693847,https://cdn.akamai.steamstatic.com/steam/apps/795320/ss_95fe69043283696a288d56ff6e299a78d94c39e7.1920x1080.jpg?t=1518693847,https://cdn.akamai.steamstatic.com/steam/apps/795320/ss_f5022946e2f58e02f1e4607427416f3e7879b54a.1920x1080.jpg?t=1518693847,https://cdn.akamai.steamstatic.com/steam/apps/795320/ss_b83622d2a2b3ecbd3e9d5711840a9dea0249b7ba.1920x1080.jpg?t=1518693847,https://cdn.akamai.steamstatic.com/steam/apps/795320/ss_0e6f803c17605afb2c8ee60b749b918b2ca9df25.1920x1080.jpg?t=1518693847,https://cdn.akamai.steamstatic.com/steam/apps/795320/ss_e72235a1976586ab2a1ece1f35ecfedc87342e6b.1920x1080.jpg?t=1518693847,https://cdn.akamai.steamstatic.com/steam/apps/795320/ss_0bed1ddcf0cbf18399de223ea4f05bdef0d038d4.1920x1080.jpg?t=1518693847,https://cdn.akamai.steamstatic.com/steam/apps/795320/ss_080113b443ddec48749f22772273fc51a74da749.1920x1080.jpg?t=1518693847,https://cdn.akamai.steamstatic.com/steam/apps/795320/ss_783f4600eb5f2525f3732b1f29f4acd241852b28.1920x1080.jpg?t=1518693847,https://cdn.akamai.steamstatic.com/steam/apps/795320/ss_654947109166c8a9e941c70a76d0ad11245acec5.1920x1080.jpg?t=1518693847",
    "Slug": "dissimilation",
    "Meta Title": "Dissimilation: Feb 15, 2018, Fivesyounger Development and...",
    "Meta Description": "Looking for information on Dissimilation? Check out the release date (Feb 15, 2018), developer insights from Fivesyounger Development, and a complete ga...",
    "Alt Text Image": "Official header image for Dissimilation game - Steam 795320",
    "Canonical URL": "https://gusku.site/game/dissimilation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dissimilation\", \"description\": \"Looking for information on Dissimilation? Check out the release date (Feb 15, 2018), developer insights from Fivesyounger Development, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fivesyounger Development\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fivesyounger Development\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/795320/header.jpg?t=1518693847\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}