{
    "AppID": 1161200,
    "Name": "Foreign",
    "Release date": "Oct 7, 2019",
    "About the game": "Foreign is a role-playing, story-driven, open-world game, where your relationship with the NPCs affects their behavior. It is recommended to do side quests. they are not mandatory but contain a lot of interesting content. Since the launch, a lot has been improved and more content has been added. see the list below. You play as a young man, in pursuit of Shelly, your lost girlfriend. Your journey will bring you to Smoky - Stone a small town in the desert. Will you be able to find Shelly in the dangers of the desert, persuade the town people to help you, and deal with groups of escaped convicts? Your decisions will lead you to an ending that reflects your choices. but what will it be? play and find out! This game features story choices and branching dialogues without cut scenes. over 30 stories, 40 characters, and many locations. Talk and persuade through dialogue, cook food, fight with melee, ranged or dart gun, discover story items and letters, fast wait, and fast travel. I am a sole game developer and 3D designer, I made this game completely by myself over a development period of 3 years. You are welcome to visit my site and send comments and reviews by email. I hope you enjoy the game. Since the launch, a lot has been improved and more content has been added. This is an updated list of the changes: The main campaign has been prolonged in an extra hour. The camera direction shift has been fixed. overlapping sound on story start and end has been corrected. All mountains are now 3d models. The guitar effect has been changed to affect only some of the NPS's. The main menu open &amp; close sound effect has been removed. Post-processing effects are currently present in the game. 4 NPC's have been added to the game. 1 new story has been added. 5 locations have been added. Random loot boxes have been added as boxes and tents. My Development Journey: For those who don't have the patience to read, here's a spoiler: The coffee ran out in the store, Liam has grown 3 years more, programming is fun and has nothing to do with life as we know it. My initial goal was to develop a story-driven game with some characters you could talk to. In the end, what came out was an open-world, role-playing game that incorporates an artificial intelligence system written in about 500 pages of code, with English literary content equivalent to a 400-page book with 40 3D characters operating in a virtual world, responding emotionally to every user's action in a fraction of a second, on a home computer. The game features dozens of branching stories, dialogue choices, and game mechanics that include third and first-person control, speech persuasion, combat, cooking, safe hacking, sneaking, using tools, navigating maps and more. It all started in school, the year was 2016 I studied game development and saw many types of games, but one thing kept bugging me, all story-driven games concentrate only on fighting. The reason is pretty clear, a game usually is seen as a sport where there is competition, in a winning and losing situation, I had to find a different kind of game. There is another way to look at life not just as a competition but as a story. The story has choices on the way, and at the end of the story, there is a change in the world, or a change in character, or even simply the adventure of exploring a new way you did not know before. Not everything is about competition, winning or losing. At the end of school, a friend told me: Why not play FALLOUT4 this game is very similar to the game you want to make. I told myself that it was worth trying, maybe I would learn something from this strange game about imaginary America in the 1960s. I sat down at the computer and downloaded the game. Six months later, I got up from the chair after 2000+ hours of gameplay and realized that something was done right here. But it's still a fighting game. There has to be a way to change that. I looked around, the apartment looking like it hadn't been cleaned for years, the flower pots dried up, sparks of dust rose from the carpet. I sat back and told myself, what's the big deal, all it takes to get started is some 3d NPC’s, some 3D houses, some lines of code, and writing some stories. It took me a year of programming to get some NPC’s into the house without disappearing or get stuck, another year to get the characters to stop and talk to the player and not bump into him endlessly, a year to make the characters say the right sentence at the right time and not repeat the same sentence over and over, another year to bring the player into a home while loading the contents of that home without causing the computer to smoke and make small sparks. Luckily for me, I found out that if you work at nights, Saturdays, holidays and sleep much less, you can squeeze five years into three. It works, I checked. Then when I added some fighting to the game I found out that combat is also kind of fun, so maybe I should change the game? But it wasn't fun to go back and change 500 pages of code, so I just added it to the game, and the game expanded more and now it contains much more than the original design. And eventually the time has come, the game evolved, the coffee ran out in the store, Liam has grown 3 years more, I started dreaming of code lines, and I felt it was time to release it. You are welcome to buy FOREIGN, and help me make the next game (or buy a robot for dust cleaning).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1161200/header.jpg?t=1572096299",
    "Price": 7.99,
    "Developers": "Ilan Manor",
    "Publishers": "Ilan Manor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1161200/ss_32ec95066f836af93bb6d5e45c7f0309fda56013.1920x1080.jpg?t=1572096299,https://cdn.akamai.steamstatic.com/steam/apps/1161200/ss_a7cf8541f5a427a876280fa111deb2f129eab96f.1920x1080.jpg?t=1572096299,https://cdn.akamai.steamstatic.com/steam/apps/1161200/ss_95c6df99b46b9bac562dc1864f9a2229bfd69b2d.1920x1080.jpg?t=1572096299,https://cdn.akamai.steamstatic.com/steam/apps/1161200/ss_d82b47b1589da9cc940be3909136e77777352911.1920x1080.jpg?t=1572096299,https://cdn.akamai.steamstatic.com/steam/apps/1161200/ss_70957a270008b0d11523281241ce3ff28fe4c7bd.1920x1080.jpg?t=1572096299,https://cdn.akamai.steamstatic.com/steam/apps/1161200/ss_e24bd6cfe2f6cface2dc57795a54fb37bf5f547e.1920x1080.jpg?t=1572096299,https://cdn.akamai.steamstatic.com/steam/apps/1161200/ss_3687e43684d3b6109fd49149dd00c02d974b35be.1920x1080.jpg?t=1572096299,https://cdn.akamai.steamstatic.com/steam/apps/1161200/ss_17f29d56e21b03c2d721e2c3e5536f7c2b1e7977.1920x1080.jpg?t=1572096299,https://cdn.akamai.steamstatic.com/steam/apps/1161200/ss_491db5a3c506f5626dbc6e90e94b0ad73dd00431.1920x1080.jpg?t=1572096299,https://cdn.akamai.steamstatic.com/steam/apps/1161200/ss_817f089103c7669126d1406d5457c3722a64195e.1920x1080.jpg?t=1572096299",
    "Slug": "foreign",
    "Meta Title": "Foreign: Oct 7, 2019, Ilan Manor and Full Overview",
    "Meta Description": "Looking for information on Foreign? Check out the release date (Oct 7, 2019), developer insights from Ilan Manor, and a complete game summary.",
    "Alt Text Image": "Official header image for Foreign game - Steam 1161200",
    "Canonical URL": "https://gusku.site/game/foreign",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Foreign\", \"description\": \"Looking for information on Foreign? Check out the release date (Oct 7, 2019), developer insights from Ilan Manor, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 7, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ilan Manor\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ilan Manor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1161200/header.jpg?t=1572096299\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}