{
    "AppID": 427480,
    "Name": "FritzChess 15",
    "Release date": "Feb 22, 2016",
    "About the game": "What does the modern chess player need? A sparring partner, a trainer, an up-to-date database and access to an online chess server! Fritz, probably the world’s most popular chess program (think back to FRITZ’s unforgettable victories against Kasparov, Kramnik &amp; Co) offers just that for beginners and tournament players alike: it plays at the highest level, offers training features for every stage of the game and comes with access to playchess.com . It also includes management and analysis options for your own games, as well as a database with 2 million games. New Fritz, new friend The completely reworked “friend” mode makes Fritz 15 the ideal training partner. During the course of a game, Fritz is able to constantly tailor its level to your playing strength and how much time you are using. The program can give you a sign when a tactical opportunity presents itself or point out typical mistakes to help you improve. Another exciting element is the new evaluation function that analyzes your playing strength throughout the game. Where are your strengths – where are your weaknesses? The opening? Middlegame? Or perhaps the endgame? Fritz 15 gives you an ELO rating for all three phases! You definitely need to see this! Improve your conversion technique “I should have won that!” How often have you been frustrated after playing a good game of blitz on playchess.com that somehow went wrong? Stoke your curiosity and find out what could have been with Fritz 15 – Fritz can now show you what you missed right after the game. You can, of course, also try to find the way to win yourself using the handy exercise function – an approach certain to boost your own conversion technique and playchess ELO! New author, new engine Vasik Rajlich is new to the Fritz team. The American shook up the world of computer chess just a few years ago, reaching the top with his program, “Rybka”. He is the author of the new Fritz 15 engine, so there’s no question that it will be one of the world’s strongest. The Fritz 15 engine is a multiprocessor version and can theoretically use up to 2048 cores! Excellent overview, better access If you watch a lot of training videos or work extensively with databases, the revamped database window is something you’ll love. It doesn’t just automatically display all the Fritztrainer or other courses installed on your hard drive, the improved game list also offers enhanced access options and sorting functions – in a manner similar to the original ChessBase software! One program, many facets Fritz 15 doesn’t just offer direct access to playchess. com – it also opens the door to the world of the new ChessBase web tools: “On-demand video” – unlimited access to our comprehensive database with training videos on every aspect of the royal game, recorded shows, interviews etc. “Live Database” – access the ChessBase online database with 8 million games.“My Games Cloud” – access your server games collection at the click of a mouse! “Training” - test, train, and improve your tactical skills at any time. More than 34,000 training tasks are waiting for you! “Let’s Check” – access our unique analysis database with over 200 million deeply analyzed positions and much more! FRITZ 15: New 64 Bit –Fritz multiprocessor engine Improved 64 Bit- and 32 Bit program interface Premium membership to the new ChessBase Accounts and to Playchess.com (six months) Database with over 1.5 million games etc.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/427480/header.jpg?t=1456131657",
    "Price": 29.99,
    "Developers": "ChessBase GmbH",
    "Publishers": "ChessBase GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/427480/ss_64c3e7615bc9c10fc96bfa5fd9e905a71ac898c0.1920x1080.jpg?t=1456131657,https://cdn.akamai.steamstatic.com/steam/apps/427480/ss_637a161ea63b8bba895c844049aeb725730a69bc.1920x1080.jpg?t=1456131657,https://cdn.akamai.steamstatic.com/steam/apps/427480/ss_e9aefa5d466857299cc14becb65d93b720e55231.1920x1080.jpg?t=1456131657,https://cdn.akamai.steamstatic.com/steam/apps/427480/ss_87343a2cb7410d713e4d1eca583eb664db48692a.1920x1080.jpg?t=1456131657,https://cdn.akamai.steamstatic.com/steam/apps/427480/ss_ed0544d5093abdfe9f016e7d1de3ed978be65141.1920x1080.jpg?t=1456131657,https://cdn.akamai.steamstatic.com/steam/apps/427480/ss_82f9e1af2214515bcc32ef997503d282d4c101a0.1920x1080.jpg?t=1456131657,https://cdn.akamai.steamstatic.com/steam/apps/427480/ss_f8c76c722c29561e36f9e4db2dd47b0a6d232e68.1920x1080.jpg?t=1456131657,https://cdn.akamai.steamstatic.com/steam/apps/427480/ss_122808c3f5afbe872424b753f8ed135b4184a0a0.1920x1080.jpg?t=1456131657,https://cdn.akamai.steamstatic.com/steam/apps/427480/ss_9262db2be22eb421d42197d153d992a2f4bd0edd.1920x1080.jpg?t=1456131657,https://cdn.akamai.steamstatic.com/steam/apps/427480/ss_6e0f217124d52aee59e6d1d1b6721eef425f2602.1920x1080.jpg?t=1456131657,https://cdn.akamai.steamstatic.com/steam/apps/427480/ss_af02023346e95328784669c5ed3c059f62b31a93.1920x1080.jpg?t=1456131657,https://cdn.akamai.steamstatic.com/steam/apps/427480/ss_7546a07a9a41f8643570be37ebf15a3376debca2.1920x1080.jpg?t=1456131657",
    "Slug": "fritzchess-15",
    "Meta Title": "FritzChess 15: Feb 22, 2016, ChessBase GmbH and Full Over...",
    "Meta Description": "Looking for information on FritzChess 15? Check out the release date (Feb 22, 2016), developer insights from ChessBase GmbH, and a complete game summary.",
    "Alt Text Image": "Official header image for FritzChess 15 game - Steam 427480",
    "Canonical URL": "https://gusku.site/game/fritzchess-15",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"FritzChess 15\", \"description\": \"Looking for information on FritzChess 15? Check out the release date (Feb 22, 2016), developer insights from ChessBase GmbH, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"ChessBase GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ChessBase GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/427480/header.jpg?t=1456131657\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}