{
    "AppID": 1795970,
    "Name": "Icing",
    "Release date": "Dec 3, 2021",
    "About the game": "Game Outline Married life with a heroine who has the same dream! A story about a hard-working wife and her flirting and eroticism. Feel close to the heroine and experience what it is like to live with her! You can see various reactions and feel closer to the married life. This is a visual novel where you can enjoy a lovey-dovey erotic story with a hard-working bride. Genre A love love adventure of a couple who aspire to become pastry chefs. Concept This is a story about a man who tries to become a pastry chef with his competitive wife, cheering her on and being cheered on as, they try their best with lovey-dovey! 01　A married life where we both dream the same dream! In this story, the hero and heroine's occupation is 'pastry chef,' and the story is about enjoying 'a story of flirting and eroticism while working hard with a hard-working wife. 02　Love and be loved while supporting your hardworking wife! A wife who is trying her best to reach a higher level, but at home, she is flirting in a self-defeating way! Your work is serious ...... but sometimes you can sneak in a little flirting ......! The story is about the daily life of two couples with such a strong sense of humor. 03　I'm serious about my dreams, my marriage, and of course, my sex life! A wife who hates to lose hates to lose sexually, too! Please enjoy the kind of sex where you try your best to make your husband feel good, but in the end you end up being debauched. A more evolved married life! When you choose an option......　→　A wife of many different reactions! 04　Enjoy the reactions of your various wives! Bring the heroine closer to you, experience what it's like to live with her! In this work, as a new attempt, you can see the various reactions of the wife through the choices that come up in their married life, making you feel more familiar with their married life! （There are no changes to the ending based on these choices.） Sometimes lovey-dovey sex is done in secret at the store! You can enjoy a total of nine sex scenes. Hardworking bride. Akiho Takasaki Height: 159cm　Blood type: O type Affiliation: patissiere Favorite things: Her husband, sweets, fashion-conscious Dislikes: All things bitter Hobbies: diligent study, game (But I hate gambling) Strengths: honesty, cheerful Weaknesses: The part that is too reckless. Alcohol Tolerance: I can drink a little. (I like Kahlua and stuff.) She is a young apprentice pastry chef who shares the same dream as the main character. She is an active daughter-in-law who hates to lose and tries to take everything as a victory, and her husband is her beloved and biggest rival. At work, she is a hard-working woman who works hard to achieve the same dream, and she takes everything very seriously, but at home, she is devoted to her husband. In a sense, he has a good sense of on/off, but when it comes to 'doing something,' he does his best, no matter what, and sometimes he gets blind-sided and messes up. I believe in 'doing the housework together' because we are a couple rather than sharing it. ...... is a pretense, but really I just want to do the same thing with my husband. She loves to share thoughts and things, and uses a pair of cups.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1795970/header.jpg?t=1638518856",
    "Price": 24.99,
    "Developers": "はちみつそふと",
    "Publishers": "ARTLINK",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1795970/ss_e8b9e0d6659274164b67f9ea415742adc8ddf6ee.1920x1080.jpg?t=1638518856,https://cdn.akamai.steamstatic.com/steam/apps/1795970/ss_be6f7a33aac0dfd7d11e1fd792935f70a1a0b4b4.1920x1080.jpg?t=1638518856,https://cdn.akamai.steamstatic.com/steam/apps/1795970/ss_e1083841d61e3a1ae6cb165c37b8f759f57268f1.1920x1080.jpg?t=1638518856,https://cdn.akamai.steamstatic.com/steam/apps/1795970/ss_de546fb4a597a3dc1aed3fbc06b6e10f36386d60.1920x1080.jpg?t=1638518856,https://cdn.akamai.steamstatic.com/steam/apps/1795970/ss_6652deeb666c08fa9ec2f71714348da7478f03f8.1920x1080.jpg?t=1638518856,https://cdn.akamai.steamstatic.com/steam/apps/1795970/ss_c741bec407188fb93b126a051debd9cebfb6cde9.1920x1080.jpg?t=1638518856",
    "Slug": "icing",
    "Meta Title": "Icing: Dec 3, 2021, はちみつそふと and Full Overview",
    "Meta Description": "Looking for information on Icing? Check out the release date (Dec 3, 2021), developer insights from はちみつそふと, and a complete game summary.",
    "Alt Text Image": "Official header image for Icing game - Steam 1795970",
    "Canonical URL": "https://gusku.site/game/icing",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Icing\", \"description\": \"Looking for information on Icing? Check out the release date (Dec 3, 2021), developer insights from \\u306f\\u3061\\u307f\\u3064\\u305d\\u3075\\u3068, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 3, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u306f\\u3061\\u307f\\u3064\\u305d\\u3075\\u3068\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ARTLINK\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1795970/header.jpg?t=1638518856\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}