{
    "AppID": 733570,
    "Name": "Loot Run",
    "Release date": "May 31, 2018",
    "About the game": "Loot Run features a moving story with twists and secrets. Prepare to be engaged in an RPG you will never forget! Anora A mysterious young woman appears in the middle of nowhere. Does she have something to do with the strange events unfolding in the kingdom? “We may be immortal, but without adding to our number...no new people...no new ideas...we aren’t living.” Carthage Commander of the Kingdom Army. Peerless combatant. Steadfast. When faced with containing a dangerous plague, will he enact the king’s purge order? “I died here. My body burned. My armor will be evidence.” Drax A fearless warrior, Drax’s self-inscribed battle axe is the last thing his enemies will ever see. What he lacks in intelligence he makes up in strength. “Gaahaaha! Did ya see how far his head flew? A new record!” Malak Head of the Kingdom’s intelligence network, he prefers to resolve problems by avoiding confrontation and working behind the scenes. “You might consider going around. He has a full company, and they want to kill you. Most are psycho.” Nathaniel He's the youngest member of the kingdom’s elite force. His combat skill is only slightly overshadowed by his snarky confidence. “Color me pink and pin a tail on my butt cheeks, look who it is!” Hey, I'm the programmer for Three Guys Game Studio. The 'studio' consists of myself, my brother (artist) and our buddy (musician). We're all self-taught in our fields (which means we fly by the seat of our pants and make mistakes often), have full-time jobs, and love video games enough to spend a significant amount of our free time making and/or playing them. Loot Run is our current project and it's been in the works for a few years now. We've created a linear RPG where you'll experience the core story while building a custom skill set and understanding of the game mechanics. Game mechanics are deceptively complex. It's a runner, so movement is limited to avoiding obstacles. The player assigns 6 skills to the skill bar (from a total of 36 unlockable) all with different synergies, strengths and weaknesses. Combat is one enemy at a time and fast paced. Some skills require a high skill cap, some are more spammable, and they all work differently together. The depth of Loot Run lies with the player's skill choices, specialization choices, and gear selection. Upon completion of the story (8-10 hours) the player enters into the more competitive aspects of Loot Run - Endless and Hardcore modes. Endless mode challenges you to take your character and build the perfect gear/skill set to survive more and more difficult days (waves of enemies) in the Abyss. The further you get, the sweeter rewards, extra challenges and achievements you'll unlock. Hardcore Mode Hardcore mode is the purest form of Loot Run. We thought long and hard about whether to ONLY have Hardcore Mode, but in the end decided too much of the game's potential would be missed if we did. Hardcore mode puts the player at the beginning of the story with nothing, pits him or her against more difficult enemies with less powerful gear drops, does not allow quitting mid-level or changing skills except after boss battles, and death is permanent; another Hardcore character needs to be started from the beginning. If you manage to complete the story, hardcore endless mode begins! While in normal endless mode you'd have the luxury of storing extra gear, farming, and maximizing specs, hardcore endless mode doesn't allow for any of this. You have to work with what you see &amp; swap in skills or gear on the fly that will best take you as far as you can go! And once you've pushed it to the limit and finally die...time for another Hardcore character with different loot and different skill optimization to push even higher up the hard core leader board! We hope to see you in Loot Run soon! -Three Guys Features: 8-10 Hours Core Game &amp; Story 36 Skills, each with specialization choices, allowing for near infinite theory-crafting combinations Hundreds of Common through Legendary Gear pieces, each graphically represented on your hero upon equip A full list of orchestra-quality story enhancing music Endless dungeon mode Hardcore mode (character death is permanent - how long will you survive?) 50 quests to complete Unlock skins, find unique weapons, theory-craft the most effective build/gear set to survive longer and farther than your friends! Challenging boss battles",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/733570/header.jpg?t=1527827144",
    "Price": 4.99,
    "Developers": "Three Guys Game Studio",
    "Publishers": "Three Guys Game Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/733570/ss_9a4cb6b5a7537a3e74d8d4f4b0d9fc8b35708430.1920x1080.jpg?t=1527827144,https://cdn.akamai.steamstatic.com/steam/apps/733570/ss_2c3b8ac9fafa9fa6549976312da59b9122116094.1920x1080.jpg?t=1527827144,https://cdn.akamai.steamstatic.com/steam/apps/733570/ss_e6faf79e1bd08def804fde666276ebc2741888b2.1920x1080.jpg?t=1527827144,https://cdn.akamai.steamstatic.com/steam/apps/733570/ss_2d5d391f655b3eeaaacd4e39c64927b2002be058.1920x1080.jpg?t=1527827144,https://cdn.akamai.steamstatic.com/steam/apps/733570/ss_651547f14dc8b410f7bd95613a05cd8ca847a329.1920x1080.jpg?t=1527827144,https://cdn.akamai.steamstatic.com/steam/apps/733570/ss_d9f3f859f0790c2c023c98c0e7e7b3b918966ccc.1920x1080.jpg?t=1527827144,https://cdn.akamai.steamstatic.com/steam/apps/733570/ss_5b07f086c37bcae11f6e3b805c6da02554b3e5fc.1920x1080.jpg?t=1527827144,https://cdn.akamai.steamstatic.com/steam/apps/733570/ss_6f035285e58c57b8e92bb01ecabb5163a8f0518c.1920x1080.jpg?t=1527827144",
    "Slug": "loot-run",
    "Meta Title": "Loot Run: May 31, 2018, Three Guys Game Studio and Full O...",
    "Meta Description": "Looking for information on Loot Run? Check out the release date (May 31, 2018), developer insights from Three Guys Game Studio, and a complete game summ...",
    "Alt Text Image": "Official header image for Loot Run game - Steam 733570",
    "Canonical URL": "https://gusku.site/game/loot-run",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Loot Run\", \"description\": \"Looking for information on Loot Run? Check out the release date (May 31, 2018), developer insights from Three Guys Game Studio, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 31, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Three Guys Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Three Guys Game Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/733570/header.jpg?t=1527827144\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}