{
    "AppID": 454950,
    "Name": "Mainlining",
    "Release date": "Jan 26, 2017",
    "About the game": "' Arguing that you don't care about the right to privacy because you have nothing to hide is no different than saying you don't care about free speech because you have nothing to say. ' - Edward Snowden Mainlining is a thrilling point and click hacking adventure that mixes dark and dry humour with a gripping narrative that will have you hooked from the very first case. Following the government's introduction of the BLU Pill Act and the Secret Intelligence Service's reintroduction of MI7, all online personal data is accessible by the powers that be. Mainlining questions techno-ethics and whether it is acceptable for an organisation to have the power to look at personal data. What if someone else got the key to that? Mainlining and its BLU Pill Act mirrors what's happening in our own world. On November 4th 2015 the The Draft Investigatory Powers Bill was discussed in the British Parliament's House of Commons for the very first time. It’s likely that the bill will be passed sometime in 2016, meaning that domestic mobile and broadband providers will be forced to assist authorities with gathering data and storing it for a year. The police and security services will have access to the top line of the UK’s population browsing history, as well as knowing what apps have been used. Referred to in the popular media as “the Snooper’s Charter” and opposed by a number of civil and human rights organisations, the Investigatory Powers Bill is positioned to aid security forces in tracking terrorists and serious cyber criminals who use increasingly sophisticated online methods.  Mainlining is a refreshing take on the traditional point and click adventure. The entire game takes place on the simulated desktop of the protagonist’s computer. Assuming the role of a newly recruited MI7 agent and working within the remit of the Blu Pill Act, the player must use their skill, judgement and cunningness to gather evidence by hacking suspects’ computers and phones. As a MI7 operative your primary objectives are to ensure the perpetrator’s arrest and that the courts have sufficient evidence to hand out the longest custodial sentences possible. However, you’ll also have to make judgements on whether the case you're working on is complete. Move in too quickly and you may miss leads linking your case to much higher profile cyber-criminals. Act too slowly and your suspect may detect you and escape. In excess of five hundred known criminals are known to operate within your jurisdiction, who will you investigate? The driving force behind Rebelephant is British-born developer and designer, Sam Read. Highlighted by internationally renowned publication Develop as one of the 30-under-30 to watch out for, Sam has already tasted success as a key member of the HyperSloth team and their critically acclaimed first-person adventure, Dream. Owner of Rebelephant, Sam is responsible for the design, direction and coding of Mainlining. To fit in with the game's 2009, feel Rebelephant has called upon the artistic talents of Dave Grey who, in his own words, 'Makes things with pixels. Like games and stories and things'. Dave's previous collaborations include Microsoft and HBO. Mainlining relies heavily on an energetic narrative that draws the player into the game, blurring the lines between reality and the imaginary world of MI7. Rebelephant wasted no time and called upon one of the best scriptwriters in the business, Canadian novelist Jill Murray. Jill was nominated for Writers Guild Award for Outstanding Video Game Writing for her work on Assassin's Creed IV: Black Flag and won the award for scriptwriting on Assassin’s Creed III: Liberation. For the final part of the jigsaw Rebelephant has drafted in the sublime audio talents of Jared Emerson­-Johnson. BAFTA nominated, Jared's scores include Telltale Games' Sam &amp; Max series, The Walking Dead, The Wolf Among Us, Tales From the Borderlands and Game of Thrones.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/454950/header.jpg?t=1572357458",
    "Price": 12.99,
    "Developers": "Rebelephant",
    "Publishers": "Merge Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_ef979d07890b1870c2bdaa095622766209ef3e28.1920x1080.jpg?t=1572357458,https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_5613ddf03707593c77da6f97bdcc91af0d9b276a.1920x1080.jpg?t=1572357458,https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_57b0781eab029bfed5cdd023fa20f7ed5b5d872e.1920x1080.jpg?t=1572357458,https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_271997297117904418326a54f0c20e16d2363180.1920x1080.jpg?t=1572357458,https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_ee66dee8d02c0b3ba332a720e82cc4eb48ad9423.1920x1080.jpg?t=1572357458,https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_9fb70bceac956c608d955208a8e6e3a80034431e.1920x1080.jpg?t=1572357458,https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_030aac9cbf5e2c72d73ca26c6e25e5fecc2a7595.1920x1080.jpg?t=1572357458,https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_7470d89a420872357656379f687c37b3fde43df3.1920x1080.jpg?t=1572357458,https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_fb5111265763eaf01e8cef83844bea668b75d2b4.1920x1080.jpg?t=1572357458,https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_89fa28b4e6fffd7bdba7a981e7eef139e821d82c.1920x1080.jpg?t=1572357458,https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_bf14ef8a57e3a08bc5a9c3018c4e1b80536f5ee6.1920x1080.jpg?t=1572357458,https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_f95c63351ceca8f8332bf88731aa6c103841b3c9.1920x1080.jpg?t=1572357458,https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_20a59d92ce970fbf509e3270aa8b724d7cbd1258.1920x1080.jpg?t=1572357458,https://cdn.akamai.steamstatic.com/steam/apps/454950/ss_dd15ccf909391ba7a97e92c54848cefe9002d83d.1920x1080.jpg?t=1572357458",
    "Slug": "mainlining",
    "Meta Title": "Mainlining: Jan 26, 2017, Rebelephant and Full Overview",
    "Meta Description": "Looking for information on Mainlining? Check out the release date (Jan 26, 2017), developer insights from Rebelephant, and a complete game summary.",
    "Alt Text Image": "Official header image for Mainlining game - Steam 454950",
    "Canonical URL": "https://gusku.site/game/mainlining",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mainlining\", \"description\": \"Looking for information on Mainlining? Check out the release date (Jan 26, 2017), developer insights from Rebelephant, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 26, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rebelephant\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Merge Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/454950/header.jpg?t=1572357458\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}