{
    "AppID": 865640,
    "Name": "Mind Your Manas",
    "Release date": "Oct 29, 2019",
    "About the game": "Mind Your Manas is a moddable online trading card game. Battle against other players or enemy AI to win prizes. Join different user-hosted servers for different experiences, as each server can potentially have a completely different collection of cards to choose from. Create your own cards, run your own server, and change the rules to fit your own desires for the game. Features Collect monies and cards by battling AI and other players Build the perfect deck from your collected cards to defeat your opponents in battle Purchase card packs with monies that contain 5 random cards with at least one guaranteed rare card Sell your excess cards for extra monies Connect to different servers and experience their version of the game, the way they want it to be played Run your own server with your own custom card collection, rules, enemies, sounds and music Mod Support If you feel like some cards are imbalanced or think a new card with specific stats would be cool, why not make those changes yourself? Mind Your Manas allows the players to create and host their own servers along with the ability to modify many different aspects of the game. With a little effort, it's entirely possible to create your own version of the game! Below is a list showing many (if not all) of the things that can be modified by the server's host: Game Rules: Player Health Turn Time Max Mana Mana every turn OR Mana every other turn Get a card from the opponent's deck on victory or not Amount of Monies gained per victory Amount of Monies gained per defeat Cost of the Card Packs Card Prices per Rarity (for selling excess cards) Rarity Rates Deck Starter Count (number of starter cards to give to new players) Deck Card Limit Number of duplicate cards allowed in your deck for each Rarity Victory XP Defeat XP Card XP (number of cards you used during a match) Minion XP (number of minions you destroyed during a match) XP Table Everything Else: Card Database Card Art (including the card borders, arrows, power icons, mana icons and back art) Card SFX Lobby and Game Music Enemy AI Database",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/865640/header.jpg?t=1582308236",
    "Price": 9.99,
    "Developers": "PhatRobit",
    "Publishers": "PhatRobit",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/865640/ss_72d093bd91cf66ff863954c0bf526f00147dc5ce.1920x1080.jpg?t=1582308236,https://cdn.akamai.steamstatic.com/steam/apps/865640/ss_765c565840140965bc6b15a348ac7e7c0ffb4ea9.1920x1080.jpg?t=1582308236,https://cdn.akamai.steamstatic.com/steam/apps/865640/ss_cddfa96d48c0ed28703726c1edf2993e8a48aa64.1920x1080.jpg?t=1582308236,https://cdn.akamai.steamstatic.com/steam/apps/865640/ss_915594a37eb90f82200e9a3fb0cae3995c1fda08.1920x1080.jpg?t=1582308236,https://cdn.akamai.steamstatic.com/steam/apps/865640/ss_0761578ef6b90c9ea81137a170d1e0a93529470f.1920x1080.jpg?t=1582308236,https://cdn.akamai.steamstatic.com/steam/apps/865640/ss_ba98e04da33e57c87c5ba420e0af884316a071d7.1920x1080.jpg?t=1582308236",
    "Slug": "mind-your-manas",
    "Meta Title": "Mind Your Manas: Oct 29, 2019, PhatRobit and Full Overview",
    "Meta Description": "Looking for information on Mind Your Manas? Check out the release date (Oct 29, 2019), developer insights from PhatRobit, and a complete game summary.",
    "Alt Text Image": "Official header image for Mind Your Manas game - Steam 865640",
    "Canonical URL": "https://gusku.site/game/mind-your-manas",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mind Your Manas\", \"description\": \"Looking for information on Mind Your Manas? Check out the release date (Oct 29, 2019), developer insights from PhatRobit, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 29, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"PhatRobit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PhatRobit\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/865640/header.jpg?t=1582308236\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}