{
    "AppID": 669320,
    "Name": "NationWar:Chronicles | 国战:列国志传",
    "Release date": "Mar 12, 2019",
    "About the game": "If the game appears black screen please add group: 460957512 [/] [/] War game novice quiz [/] [/] released a new map test version of the war performance optimization: If you enter the game by default and feel lap, you can improve the performance of the game by choosing 'simple terrain' through the game's settings interface. We have only two-man development team at the moment, but we keep updating until the initial vision of the game is reached [/] [/] Although we have no investment in the development team, there is no art dealer market, but we hope we can rely on your dear players to support their masters, more resources into the art go [/] ] Thanks to Maxweing for providing the English promo [/] [/] This is a theme of spring and autumn and Warring States strategy + real-time combat sandbox game. The current framework and system is somewhat similar to that of a big manufacturer, but in subsequent versions we will continuously update the unique system that meets the background of Chinese culture and the times to replace it. The game begins in the eighth century BC, in the vast land of China. The once powerful Zhou Royal family that reigned over China began its decline due to constant civil strife and weak leadership. Meanwhile, the princely states under Zhou Royal Family and the surrounding barbarians are growing stronger by the day. The most terrible catastrophe that the King of the Kings is about to face, but everything has not yet settled. You as the player can choose to, reconstruct order, restore the Rites of Zhou, and revive the Zhou Dynasty or plot your rise as a princely state in the Central Plains of China and ultimately replaces Zhou. Or perhaps, you will lead the Barbarians to invade China and become the lord of the Central Plains. The decisions are in your hands. At present, the game belongs to the early stage of testing. There are many unique systems that fit the background of Chinese culture and the times and will be updated in later versions, such as the family system, transformation system, overlord system, and unified gameplay and game content. If the development is smooth, players support, we will also strive to launch the era script, such as Chuhan, Three Kingdoms, Sui and Tang Dynasties, the two Song, the Ming Dynasty and so on. The current game features: 1. A brand new China map: A new big map based on the topographic map of China and major rivers. There are currently 278 cities in total, as well as 158 countries or regimes. Players will be from the geographical situation, intuitive understanding of the reasons people were making various strategic choices. 2. The war on the big map: 158 countries on the big map will alliance, expansion and even betrayal for their own interests, and finally there can be only one winner on the land of China. The current unit battle to join the backstroke judgment, coupled with the upcoming terrain system, players can have more tactical space to fight. 3. Science and Technology Tree: After research, according to the history of science and technology in China's science and technology development tree, each science and technology have references from Chinese books related verses or sentences. 4. Personnel and Official System: Different posts have different bonuses, and government officials in different political systems have different bonuses. The personnel system will be changed to a family system in the next few editions. 5. lack of art: because no one optimistic, popular theme of the Spring and Autumn Warring States play a small game, so there is no investment to please Grandpa, can only beg you gentlemen who lifted your hand, if possible, not bad review art Thank you very much. 6.Rich factional system 7. Realistic Topographical features of China 8. Dynamic Change of Urban Appearance 9.Accurate administrative layout Upcoming systems: 1. The System of Reunification and the Rebel: The eradicated state did not really die out. The forces and thoughts of the old days still sneaked quietly beyond the reach of the new rulers, glimpsed and awaited his return. 2. Hexagonal terrain system: a large map will be divided into a block of small hexagons composed of maps, each hexagonal will have its own terrain properties, terrain properties will bring about plus or minus, all arms also Will have their own fighting terrain, so that the fighting more depth and change. 3. Family System: In the Spring and Autumn Period and the Warring States Period, the family monarchs often controlled the power and lifeline of their country. The relations between them and their monarchs often dominated the rise and fall of various countries and palaces and staged scenes of tragedy and comedy.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/669320/header.jpg?t=1635955967",
    "Price": 10.99,
    "Developers": "Yiming",
    "Publishers": "Yiming",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_97601ba558957207fceb57f5a0419d8b3f8ebad2.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_306de91f01b81d2f1b00004b86b06540b6dba87f.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_c6b75d69e0fad72e317c17bf0867758ce2d01ee7.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_3e894aa9f511ff7e53b1aefbd2122b067403c4d2.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_b3ffc6f2e57f6265c2ddc211436645133ec654d3.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_0eb57b436483eb95dd93b8d7a9821f679996c3aa.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_7ec9b843a3ddea65fc2ecbc018c30de1777a0470.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_e997ee7d99d497303a3dd8bef3ba45d98b23259e.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_de4611cd9734abdcea2e5d87c0fca4a47828d9db.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_1bdbf63ba4436d5577aadfd807d9c8659e51cfe7.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_7aad368556e0d0e7838957a9e6fbcea17ba424ca.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_0173fef79226ff11926ae0b5ef1a82442673169b.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_e1c917f9fd74071dd666f2f4d25a3aab58d2d986.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_3d257fd2e3224f951a32437e164f56de5cca3d9d.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_53f7fa0453b9b98680260ec2ce0ef3e58d534f5c.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_26308afbdcd76ee8fd84b3a55133d1220c99c14c.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_4a1983a73084b823aa96b94ee0e4cf3895bb0ba7.1920x1080.jpg?t=1635955967,https://cdn.akamai.steamstatic.com/steam/apps/669320/ss_44e31eba557338dd92a9a331a3c28194f1ec0fae.1920x1080.jpg?t=1635955967",
    "Slug": "nationwar-chronicles",
    "Meta Title": "NationWar:Chronicles | 国战:列国志传: Mar 12, 2019, Yiming and ...",
    "Meta Description": "Looking for information on NationWar:Chronicles | 国战:列国志传? Check out the release date (Mar 12, 2019), developer insights from Yiming, and a complete gam...",
    "Alt Text Image": "Official header image for NationWar:Chronicles | 国战:列国志传 game - Steam 669320",
    "Canonical URL": "https://gusku.site/game/nationwar-chronicles",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NationWar:Chronicles | \\u56fd\\u6218:\\u5217\\u56fd\\u5fd7\\u4f20\", \"description\": \"Looking for information on NationWar:Chronicles | \\u56fd\\u6218:\\u5217\\u56fd\\u5fd7\\u4f20? Check out the release date (Mar 12, 2019), developer insights from Yiming, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Yiming\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Yiming\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/669320/header.jpg?t=1635955967\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}