{
    "AppID": 1343640,
    "Name": "Polyville Canyon",
    "Release date": "May 19, 2021",
    "About the game": "Welcome to Polyville Canyon! A laid-back, peaceful city builder where nothing bad ever happens! Polyville Canyon is a city builder that forgoes many 'standard' city builder mechanics and lets you focus on building an aesthetically pleasing town without having to worry about electricity, sewage, traffic, taxes, city ordinances, or other 'micro-management' tasks. Just get out there and build however you want and the Neighbors will be happy! -- You've been invited to a meeting at a charming little train station just outside of Polyville City by a local construction company. They say they're being asked to build an entire city out in the Canyons, and they desperately need some help. They thought that since you're the only one they know that has a mouse and keyboard, it would be much easier for you to do the work. If you agree, you will earn a share of every Train Ticket sold to visitors and residents, either coming or going! Of course you agree because that is A LOT of money, and you immediately pack up your stuff and head to the station! The construction Foreman, Sam, is waiting for you there to get started right away! -- Build a budding city for the Neighbors! Build over 100 unique items including Residences, Commercial buildings, City Services and Decorations, Monuments and more! Build unique towns across four different maps including the Canyon, River, Island, and the all-new Snow Lake map! Tycoon-style income generation. The more you build, the more you earn! The more you earn, the more you can build! Every building increases the train ticket prices or attracts new Neighbors, and higher level buildings increase them even more! Place decorations like trees, bushes, and gazebos all over the city to keep the Neighbors Happiness levels up. The happier your Neighbors are, the more income you earn when the train arrives! Grow at your own pace! No real-time building timers, no countdown clocks, and no timed missions Earn XP every time the train arrives, and just for building more buildings! Simple objectives give you ample opportunities to earn bonus XP and income! Level up to unlock new buildings, decorations, and locations! Level up to unlock 25 unique Neighbors, each with their own special bonus! Other features View your creation from first-person view! Full Sandbox Mode for players that just like to build without restriction! Play in multiple locations with different terrain constraints, providing new layout opportunities View info on every Neighbor including their name, the bonuses they are providing by being there, and what's on their mind that day! Carbon-free cities means no vehicles hogging up the roads and more room for Neighbors to roam! Easy to use mouse controls with camera panning, zooming, tilt and full rotation! Snapping on/off controls make fine-detailed placement possible Relaxing soundtrack and unobtrusive SFX Polyville Canyon is the peaceful and stress-free city builder that you never knew you needed!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1343640/header.jpg?t=1653065882",
    "Price": 1.99,
    "Developers": "Henagames",
    "Publishers": "Henagames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1343640/ss_14a3a95128f51ace19b5feff8af5cb954e0915c9.1920x1080.jpg?t=1653065882,https://cdn.akamai.steamstatic.com/steam/apps/1343640/ss_846d966b4a8d33bfef9007d75f3bb4b6bb4de837.1920x1080.jpg?t=1653065882,https://cdn.akamai.steamstatic.com/steam/apps/1343640/ss_ccce1134d332ff67381eb7568076b71c4033edc8.1920x1080.jpg?t=1653065882,https://cdn.akamai.steamstatic.com/steam/apps/1343640/ss_74c82730c9703d5f4d96891f8fecea2ef2f9cbe7.1920x1080.jpg?t=1653065882,https://cdn.akamai.steamstatic.com/steam/apps/1343640/ss_7e005d10a5746baf486c6b775b20e97d767183ca.1920x1080.jpg?t=1653065882,https://cdn.akamai.steamstatic.com/steam/apps/1343640/ss_406cfad4373c3aa88ea90fa6346f19f9d126b716.1920x1080.jpg?t=1653065882,https://cdn.akamai.steamstatic.com/steam/apps/1343640/ss_ab2271a70ef6b0682d5a9b7a50529c8f3907a0b2.1920x1080.jpg?t=1653065882,https://cdn.akamai.steamstatic.com/steam/apps/1343640/ss_177d8be4e00fe21e6a2faad76f4df7cbba462904.1920x1080.jpg?t=1653065882,https://cdn.akamai.steamstatic.com/steam/apps/1343640/ss_b24cc934eaadae4e05e894046f3f2f2be297ed8f.1920x1080.jpg?t=1653065882,https://cdn.akamai.steamstatic.com/steam/apps/1343640/ss_87918661efb96f09de92132a6ff196f41f2d1b2e.1920x1080.jpg?t=1653065882",
    "Slug": "polyville-canyon",
    "Meta Title": "Polyville Canyon: May 19, 2021, Henagames and Full Overview",
    "Meta Description": "Looking for information on Polyville Canyon? Check out the release date (May 19, 2021), developer insights from Henagames, and a complete game summary.",
    "Alt Text Image": "Official header image for Polyville Canyon game - Steam 1343640",
    "Canonical URL": "https://gusku.site/game/polyville-canyon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Polyville Canyon\", \"description\": \"Looking for information on Polyville Canyon? Check out the release date (May 19, 2021), developer insights from Henagames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Henagames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Henagames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1343640/header.jpg?t=1653065882\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}