{
    "AppID": 490220,
    "Name": "Prismata",
    "Release date": "Mar 8, 2018",
    "About the game": "Prismata's new free-to-play edition is radically fair , featuring no card packs, no grinding, and absolutely no pay-to-win . We steadfastly refuse to sell items that provide advantages in competitive multiplayer. Instead, you can support us by purchasing cosmetics or premium single-player content. Thank you! Prepare yourself for the ultimate strategy game. Prismata—the gripping debut from Lunarch Studios—radically redefines the strategy genre by combining elements of real-time strategy, card games, and tabletop strategy games to create something entirely new and unique. Competing against other humans or ruthlessly efficient AI, you'll plan devastating attacks through a series of quick-fire turns. Will you outwit your opponents by striking at the perfect moment? Or will you fall victim to a devious trap? Game Modes Campaign: an enthralling 40-mission story-based single player adventure Casual Match: play friendly games against other humans or one of 30 different AI personalities Combat Training: over 50 hand-crafted puzzles and scenarios dripping with fascinating strategy insights Ranked Play: get paired against opponents of similar skill and compete for a spot on the leaderboards Custom Games: play bots or friends with fully editable unit pools, time controls, handicaps, AI difficulty, and more Expert Challenge: ultra-difficult mission variants for players seeking extreme challenges Event Mode: heart-pounding blitz brawl tourneys and crazy mode-of-the-week events with prizes The Story Hundreds of years in the future, humans have engineered a prosperous new civilization on the distant planet Beacon, where the sun never sets. Meanwhile, the planet's frigid dark side has been colonized by an enigmatic faction of intelligent machines that threaten humanity with conflict. In these new cybernetic times, human soldiers are obsolete. Instead, warfare is conducted swiftly with massive armies of robots. The Swarmwielders —human commanders of these mechanical forces—are the defenders of society, training relentlessly for the day when the machines strike again. However, when their own robots start to mysteriously malfunction, the humans find themselves endangered by something much closer than the machines lurking beyond the fringe. Features State-of-the-art enemy AI created by Professor David Churchill, winner of the 2013 StarCraft AI competition A custom replay browser where you can watch, share, and analyze game replays New Prismata units added regularly, each with a unique role and purpose in combat 100+ Steam Achievements to unlock Real-time spectator mode : watch live matches featuring top players Absolutely zero pay-to-win —no card packs to open; all units are free for all players Over 500 customizable emotes and 250 awesome unit skins to collect No randomness! Your fate is determined by your skill alone Over 100 trillion unique gameplay scenarios, each with a different optimal strategy to discover Gameplay In Prismata, you’ll collect resources, create workers and technologies, assemble an all-conquering army, and trade blows with your opponent until one of you is obliterated. Prismata blends elegant turn-based mechanics with the tactical decision-making elements that are at the heart of real-time strategy games. Featuring simple and intuitive economic and combat systems, Prismata is incredibly easy to learn. However, no two Prismata matches are ever the same. Every game, players get a new pool of extra buildable units that must be used to their fullest potential. There are always new builds to plan and discover, and new threats to respond to. Each battle is fresh and unique. Containing no pre-built decks, random advantages, or luck-of-the-draw moments, Prismata’s cat-and-mouse duels celebrate quick-fire tactics, deep thinking, and decisive strategy. Will you execute a perfectly-timed attack, or will you build up a monstrous economy and overpower your opponent with a massive army? Testimonials from supporters and Kickstarter backers: 'Almost nothing comes close to achieving this level of polish, depth, and replayability.' - Kevin 'qxc' Riley, retired StarCraft pro-gamer and game designer 'This game is unbelievable. Someone said it’s like Magic the Gathering meets Chess meets Starcraft and they weren't lying.' - Paradox Gaming Network 'Full skill, full focus, no RNG. It is beautiful!' - Adrian 'Lifecoach' Koy, Hearthstone and Gwent professional 'It's so good. I wake up and I'm like 'Yes, I get to play this game again.' I love it.' - Frederick 'Freddybabes' Bird, Gwent Challenger, Open, and Slam champion 'I'm over-the-top addicted. Best game I've ever played.' - Mike 'Timex' McDonald, poker professional 'A game I have been looking for all my life.' - Steel_hs 'One of the most intricate, well-thought-out, and best games I have ever played... the first and only game of its unique genre.' - Rachenite 'More worthwhile than any other game.' - Aetherllama 'Truly unique in its ability to refine RTS and card game themes down to the core strategic decisions without the RNG or APM.' - DiamondGP 'Finally, a card game that removes the ‘luck’ aspect.' - hepcecob 'When I start Prismata, it feels like my inner child is opening a bottomless toy box that's always holding something new and exciting.' - daxtrax 'I honestly feel like a genius after I play a good game.' - DDarkray 'Prismata is very approachable, yet there's always more to learn.' - zihkrihk 'I'm a filthy casual and I love playing a quick competitive game.' - RupertE '10/10 strategy game! Phenomenal concept, unlimited replay value.' - 4nonym0u5 'Why did I even bother with those other games.' - arisuMizuki 'I feel fortunate to live in the age of Prismata—the best game I've ever played.' - Gameking511 'No mortal has 400 real APM. That's why we play Prismata, and leave StarCraft to the demigods.' - jrkirby 'If you ever thought you'd be great at StarCraft if only you had the APM, now you can prove it.' - Lenor4ever 'After 3 years and 11,000 games, I'm still innovating new strategies, and I don't expect that to ever stop.' - Apooche 'Prismata is the best thing that ever happened to me.' - Arkanishu 'It's as good as they say.' - Naitso",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/490220/header.jpg?t=1584722754",
    "Price": 0.0,
    "Developers": "Lunarch Studios",
    "Publishers": "Lunarch Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/490220/ss_53ec61593465bd58ad803a1291c06dc9c94ef436.1920x1080.jpg?t=1584722754,https://cdn.akamai.steamstatic.com/steam/apps/490220/ss_e25702affff3cc2655443bbcf6638824d1f87efb.1920x1080.jpg?t=1584722754,https://cdn.akamai.steamstatic.com/steam/apps/490220/ss_8718470d1f71f36cb69a0529f7779e5ce5d53144.1920x1080.jpg?t=1584722754,https://cdn.akamai.steamstatic.com/steam/apps/490220/ss_5c7d8b69bdb59202a4f0125a8edbaafcfc2e31d4.1920x1080.jpg?t=1584722754,https://cdn.akamai.steamstatic.com/steam/apps/490220/ss_0fc93271d7c7c95c9e75730052ac2eff85fc3f80.1920x1080.jpg?t=1584722754,https://cdn.akamai.steamstatic.com/steam/apps/490220/ss_7f70ca20f626e751e8fd8d7619863c6360b7ca13.1920x1080.jpg?t=1584722754,https://cdn.akamai.steamstatic.com/steam/apps/490220/ss_9a5d1f2eb5546459ae1ba627496dea7acdfd18c9.1920x1080.jpg?t=1584722754,https://cdn.akamai.steamstatic.com/steam/apps/490220/ss_3b46074184929f13c5f596f88de1b32ba41d3842.1920x1080.jpg?t=1584722754,https://cdn.akamai.steamstatic.com/steam/apps/490220/ss_257f409be1666f5d5ef953ce9e5dd10d3cb2b0d0.1920x1080.jpg?t=1584722754",
    "Slug": "prismata",
    "Meta Title": "Prismata: Mar 8, 2018, Lunarch Studios and Full Overview",
    "Meta Description": "Looking for information on Prismata? Check out the release date (Mar 8, 2018), developer insights from Lunarch Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Prismata game - Steam 490220",
    "Canonical URL": "https://gusku.site/game/prismata",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Prismata\", \"description\": \"Looking for information on Prismata? Check out the release date (Mar 8, 2018), developer insights from Lunarch Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lunarch Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lunarch Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/490220/header.jpg?t=1584722754\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}