{
    "AppID": 410840,
    "Name": "Rock God Tycoon",
    "Release date": "Feb 13, 2017",
    "About the game": "Rock God Tycoon (RGT) places you at the helm of your very own band and on the path to your own rock destiny. Choose your character’s discipline from guitar, bass, drums, or vocals, then hire the rest of your band before hitting the road to stardom. Manage your group and decide when deadwood needs to be cut. Fed up with the drummer missing shows? Fire the slacker and replace him! Model your fully customizable characters with 300+ available items, all exceptionally detailed, beautifully designed, and with frequent new additions. Everybody needs to pay their bills though, and you’ll need to book the right shows and practice your songs to keep the money coming in; going from small town bars, to concerts halls and stadiums. Your band isn’t performing and is struggling to hold a note? Better put down that coffee to pick up that gauntlet and step on stage yourself to show them how it’s done. Gigging across 76 cities, each with unique venues, you'll constantly be on the road; whether it be in a van, tour bus, or a private jet. As your skill and renown grows, so will your fan base. Head to the shop and use some of your cash to upgrade your instruments, equipment, and buy promotions in a fully realized catalogue of features. Make sure to manage the tension and egos in your band carefully, and while you’re at it, don’t forget to pay the rent. Well placed info tabs show you every actionable detail of your band, and allow you to manage all of your band's day to day goals. RGT allows you to write your own songs, develop and release your own albums, and sign record deals with a variety of labels. This is the music tycoon game you have been waiting for and deserve. Character creation Band tension and solidity affecting your band throughout the game Ability to write and create music Rehearsing and recording songs Signing a deal with a record label and album releases Booking and simulating gigs with review feedback 76 playable cities in the USA, each including their own gigs and/or recording studios, labels or video clip events Leveling system that affects everything your band does Information tabs about every detail of your band Billboard system and world ranking Bands in the world release albums and change throughout the game Shop system that allows you to buy promotions, vehicles, and props Hiring, editing, and firing bandmates Stage editor that allows you to place your band members and props Song creation, an awesome tool that lets your create your own music Perform your songs at your shows Random events and a not restrictive story line Multiple homes",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/410840/header.jpg?t=1645621927",
    "Price": 10.99,
    "Developers": "Fern Nigro,Panos Tzimas",
    "Publishers": "EmberWulf",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/410840/ss_63c8263210aff936201266dbaf07465b370f61bf.1920x1080.jpg?t=1645621927,https://cdn.akamai.steamstatic.com/steam/apps/410840/ss_55805677c1b7dd788d58bbba0fdcc8f5399b3dce.1920x1080.jpg?t=1645621927,https://cdn.akamai.steamstatic.com/steam/apps/410840/ss_bbdb1d2e94a62bd7ea610a138cf703754c9e51c0.1920x1080.jpg?t=1645621927,https://cdn.akamai.steamstatic.com/steam/apps/410840/ss_70e035b53de63234a3da919c56573e0b9aad2e85.1920x1080.jpg?t=1645621927,https://cdn.akamai.steamstatic.com/steam/apps/410840/ss_8e0f8a1b73576c07fb676cba20392e1137931e80.1920x1080.jpg?t=1645621927,https://cdn.akamai.steamstatic.com/steam/apps/410840/ss_41f81f8d14ed394b158e38930ba7e42094ec8e4d.1920x1080.jpg?t=1645621927",
    "Slug": "rock-god-tycoon",
    "Meta Title": "Rock God Tycoon: Feb 13, 2017, Fern Nigro,Panos Tzimas an...",
    "Meta Description": "Looking for information on Rock God Tycoon? Check out the release date (Feb 13, 2017), developer insights from Fern Nigro,Panos Tzimas, and a complete g...",
    "Alt Text Image": "Official header image for Rock God Tycoon game - Steam 410840",
    "Canonical URL": "https://gusku.site/game/rock-god-tycoon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rock God Tycoon\", \"description\": \"Looking for information on Rock God Tycoon? Check out the release date (Feb 13, 2017), developer insights from Fern Nigro,Panos Tzimas, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 13, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fern Nigro,Panos Tzimas\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"EmberWulf\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/410840/header.jpg?t=1645621927\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}