{
    "AppID": 1886670,
    "Name": "Shotgun Pinboard",
    "Release date": "Mar 2, 2022",
    "About the game": "Shotgun Pinboard is an EFB (Electronic flight bag) for flight simulators. Shotgun pinboard V1 is now free for review or to us on the eagle dynamics forum (thank you for hosting!) The free version will not recieve updates or support. Only the steam purchased version will recieve new features fixes and updates. Get time, distance and fuel information back from a plan and take that reality factor up a notch. Works with any flight simulator it is purely a customizable EFB, no integration with any other software. Trainer for newcomers, hardcore aviation LARPing geek out for desk chair captains. You can customize and or plan at a basic level from wanting to see how long/far until you run out of fuel, up to a full sortie where timing and logistics become key to mission success. Not everyone can afford an ongoing subscription to a real world service that doesn't quite fit the bill for the Aviation Sim enthusiast. Shotgun Pinboard fills that gap. Add a picture from a scanned flight map, satellite, topological, even a hand drawn one.. create a ruler that matches the scale of the map so it can calculate distance time and fuel usage for you. add as many airfields as you like, put notes down, place Objects like AA refueling Aircraft, SAM sites etc.. practice entry and exit routines without printing pages of airfield data. Share flight plans and maps with friends, Plan for online servers that have multiple aircraft with multiple tasks, multiple human manned radios. Get a birds eye view of the battlefield and familiarize yourself. New players learning the ropes will have the penny drop looking at the data and visual queues presented by just using this tool. It will help you understand the basic concepts of flying in a digital world, get your head around what is involved and help fuel that passion for flying. For example it will give you the feet per minute climb/descent rate between waypoints. 3 aircraft data sets are included already, usually found in the big name Sims, the A10 Warthog for DCS, F18 Hornet for MSFS franchise, and the F16 Falcon for Falcon Gold/BMS. For the veteran, customization is key. You can create a new aircraft using basic data like fuel per minute, total fuel, cruise speed. if you want to plan for a Cessna, 737, Apache, Mi8 or the hurricane or flying fortress for IL2 etc etc etc, add the details and save the aircraft. even add a friend as the door gunner if you wanted to. With the ability to make adjustments to legs and waypoints by adding time for AA refuelling, landing re arming, pre planned speed and PPM fuel usage. you can calculate times and fuel to within a minute so fencing in after SEAD can be planned close enough to avoid a fuel wasting orbit, plan join ups or almost plan the first day of desert storm. includes conversion tables if you need meters to feet Gal to Lbs, Km to Nm. No internet connection required, Maps, airfield plates not included. Currently does not adjust bearings for map curvature or maps GPS. Does not use a digital online map service. No weather adjustments, no weight and balance. Speeds are all calculated at Ground Speed and displays data with a preference towards Nautical miles and feet. P.S you can also hide surprises to spice things up. Sending the actual mission file for briefings can spoil the surprises that real life can throw at you. Create a mission plan for your squad but hide the 4 ship mig 29's that are inbound hot.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1886670/header.jpg?t=1655862782",
    "Price": 24.99,
    "Developers": "Adam Edwards",
    "Publishers": "Adam Edwards",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1886670/ss_1b25b91a695da784b5623664226ad2086a285b00.1920x1080.jpg?t=1655862782,https://cdn.akamai.steamstatic.com/steam/apps/1886670/ss_a47229553d8ea9dcb71617d8d59cd52e2a84e1de.1920x1080.jpg?t=1655862782,https://cdn.akamai.steamstatic.com/steam/apps/1886670/ss_ad8271f3edc716034a1d01ea155eca52a926bcfc.1920x1080.jpg?t=1655862782,https://cdn.akamai.steamstatic.com/steam/apps/1886670/ss_c762feb032a5277d811c64afc3658409926d8e95.1920x1080.jpg?t=1655862782,https://cdn.akamai.steamstatic.com/steam/apps/1886670/ss_0821ecbe2cece884881a6e4e8b1701df4e930821.1920x1080.jpg?t=1655862782",
    "Slug": "shotgun-pinboard",
    "Meta Title": "Shotgun Pinboard: Mar 2, 2022, Adam Edwards and Full Over...",
    "Meta Description": "Looking for information on Shotgun Pinboard? Check out the release date (Mar 2, 2022), developer insights from Adam Edwards, and a complete game summary.",
    "Alt Text Image": "Official header image for Shotgun Pinboard game - Steam 1886670",
    "Canonical URL": "https://gusku.site/game/shotgun-pinboard",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shotgun Pinboard\", \"description\": \"Looking for information on Shotgun Pinboard? Check out the release date (Mar 2, 2022), developer insights from Adam Edwards, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Adam Edwards\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Adam Edwards\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1886670/header.jpg?t=1655862782\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}