{
    "AppID": 390090,
    "Name": "Shot Online",
    "Release date": "Jan 21, 2019",
    "About the game": "'Golf is a game that is played on a five-inch course - the distance between your ears.' - Bobby Jones, legendary professional golfer Arguably more than any other sport, golf requires focus and mental stamina, and so does Shot-Online, which is a reproduction of the full experience and game of golf in full, rich 3D graphics. Shot-Online is not just an online sports game either, but it is a highly accurate simulation and a deep role-playing experience. It is the RPG quality that makes Shot-Online the unique game it is, especially with the community interaction and the enhancement and leveling of your character. Speaking of community and role-playing, Shot-Online offers both realistic and rare items drawn from the celebrated history of golf. Practicing every day, competing against players with different skills, allows the gamer to advance their characters abilities. Quests and item exchanging and more add to the community feel. Shot-Online is more than a sports game, more than a simulation, more than an RPG ? like golf itself, it is an intelligent and unique game that is more than the sum of its parts. Unique kind of golf game - RPG-based full 3D sports simulation hybrid game. - Character leveling through training in-game. - Team competitions offered for earning game currency. - Item exchanging and quests, and other community events outside the game. - Periodic competitions and tournaments are supported. - Gallery mode for reviewing great shot and more. - Extensive chat support offered, to enhance community interaction. Realism make true simulation possible - Proprietary physics engine, which translates into a realistic golf course interaction and overall gameplay. - Ball movement is accurately affected by ground conditions, physical dynamics and environmental factors, such as the wind, weather and temperature. - Motion capture of real swing taken from a Korean PGA golfer The Details that make the difference - Shot quality is influenced by numerous factors, such as the daily practice and degree of fatigue as well as power and accuracy of a player. - Various camera angles that lead the player to feel like they're watching a professional golf game on television. - Real courses are utilized for deeper realism. - PGA rules apply to the game play.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/390090/header.jpg?t=1573049859",
    "Price": 0.0,
    "Developers": "WEBZEN ONNET",
    "Publishers": "WEBZEN",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/390090/ss_bd24f54133af1b00cc3ab5c38370036c08675205.1920x1080.jpg?t=1573049859,https://cdn.akamai.steamstatic.com/steam/apps/390090/ss_db0e7e0e787d20c0e21e53c0f11aea4fc86fbef1.1920x1080.jpg?t=1573049859,https://cdn.akamai.steamstatic.com/steam/apps/390090/ss_8f9f24e48868f85ee421a0b8fc008b317175bd66.1920x1080.jpg?t=1573049859,https://cdn.akamai.steamstatic.com/steam/apps/390090/ss_0668f46dde89668657c2a4465009e59ebfc68d10.1920x1080.jpg?t=1573049859,https://cdn.akamai.steamstatic.com/steam/apps/390090/ss_6b029949d6d291dc7f36ed49cf895028300bdc8d.1920x1080.jpg?t=1573049859,https://cdn.akamai.steamstatic.com/steam/apps/390090/ss_32deb92ae6dfc4a5ea9c31d122570a5657994b53.1920x1080.jpg?t=1573049859,https://cdn.akamai.steamstatic.com/steam/apps/390090/ss_7a19687114c64add90809c0645b8e80f0653ecad.1920x1080.jpg?t=1573049859",
    "Slug": "shot-online",
    "Meta Title": "Shot Online: Jan 21, 2019, WEBZEN ONNET and Full Overview",
    "Meta Description": "Looking for information on Shot Online? Check out the release date (Jan 21, 2019), developer insights from WEBZEN ONNET, and a complete game summary.",
    "Alt Text Image": "Official header image for Shot Online game - Steam 390090",
    "Canonical URL": "https://gusku.site/game/shot-online",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shot Online\", \"description\": \"Looking for information on Shot Online? Check out the release date (Jan 21, 2019), developer insights from WEBZEN ONNET, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"WEBZEN ONNET\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"WEBZEN\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/390090/header.jpg?t=1573049859\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}