{
    "AppID": 1822900,
    "Name": "Soulflow",
    "Release date": "Mar 18, 2022",
    "About the game": "Soulflow is a 2.5D fantasy-detective game that offers a unique experience with its graphic style. In this story-based role play game, the player must gather information from others during the day and try to solve the murders in the neighborhood to stay free. For the soul to be free, the body must die. In other words, players have to figure out who is going to die. It does this by 'saluting', that is, by changing the body. When the actor who plays the soul greets another character, he takes control of that character and begins to see the world through his eyes. In this way, he can carry out dialogues with different combinations with different people. Thus, new information is obtained through the story and the game is shaped. 'Finding the character to die', which is the prerequisite for our freedom, is achieved with the information we have gained in the story. Of course, the story does not progress with dialogue alone. We can get information about the items and characters in different houses. We can control our clock in the game and learn how much time is left until the end of the day. If we cannot be in the character who will die despite what we have done during the day, the day ends and starts from the beginning, we gather the information we have gained in the spirit book on our bedside and continue the game. The spirit also has the ability to enter different creatures in the neighborhood. The spirit that enters animals can control them: they can run fast, jump, and enter small places that human-sized ones cannot. In this way, he can get different clues. Soulflow is played with a keyboard and mouse. A simple color palette is used. (black and white) There are eight main characters in the game. All of the main characters can be entered and a conversation can take place between that character and the others. The game takes place in a small neighborhood. The neighborhood has several houses, a cafe, a clock tower, and a cemetery. Bluespy Studio offers you the most unique visuals and gameplay.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1822900/header.jpg?t=1648893094",
    "Price": 2.99,
    "Developers": "Bluespy Studio",
    "Publishers": "Next in Game",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1822900/ss_74bad6080758a2ef26c47bc4fab143043964bcb0.1920x1080.jpg?t=1648893094,https://cdn.akamai.steamstatic.com/steam/apps/1822900/ss_52b09c5ae45892b7e8df8a2fc114eb539a52ce1a.1920x1080.jpg?t=1648893094,https://cdn.akamai.steamstatic.com/steam/apps/1822900/ss_ace0676832a7bcd578f4b4295e5df5be94f126d3.1920x1080.jpg?t=1648893094,https://cdn.akamai.steamstatic.com/steam/apps/1822900/ss_751e9d1653cc130b30e2a273107c67ae3b75e31c.1920x1080.jpg?t=1648893094,https://cdn.akamai.steamstatic.com/steam/apps/1822900/ss_87fffde9250444d643e550671607016473979c76.1920x1080.jpg?t=1648893094,https://cdn.akamai.steamstatic.com/steam/apps/1822900/ss_b148b82af6b42a1484a09cd254057fb4cfa3a705.1920x1080.jpg?t=1648893094",
    "Slug": "soulflow",
    "Meta Title": "Soulflow: Mar 18, 2022, Bluespy Studio and Full Overview",
    "Meta Description": "Looking for information on Soulflow? Check out the release date (Mar 18, 2022), developer insights from Bluespy Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Soulflow game - Steam 1822900",
    "Canonical URL": "https://gusku.site/game/soulflow",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Soulflow\", \"description\": \"Looking for information on Soulflow? Check out the release date (Mar 18, 2022), developer insights from Bluespy Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 18, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bluespy Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Next in Game\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1822900/header.jpg?t=1648893094\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}