{
    "AppID": 865040,
    "Name": "Super Bit Blaster XL",
    "Release date": "Mar 16, 2020",
    "About the game": "DEVELOPERS NOTE: I began creating Bit Blaster XL for Steam on a whim back in late 2015. I never could have imagined how its release would alter the direction of my life. Through it's success I was able to now support myself as a full-time game developer. These last few years in game development have provided me with so many amazing opportunities. I couldn't have done the majority of this without the great support of the community that appeared out of nowhere to play my silly little arcade game. Super Bit Blaster XL is the next evolution Bit Blaster. Since it's release I have learned a lot more about Unity and C# and so I have reworked many aspects of the game. I added a new Co-Op mode, Vs Mode, improved the GFX, new translations, new Easter eggs, and various other new things. I also completely overhauled the control scheme due to feedback; while it's still not a Twin-Stick shooter, overall control is so much more responsive. My decision to release this as a separate title as opposed to an update on the original is because the changes are all so drastic I wouldn't want to upset the flow of the original Steam game that people seem to love. I also have learned a lot from (fellow) developers about self worth so the price will be higher than a single dollar this time around. i'm sure there will be folks keen to pick apart this decision as greedy or selfish but I imagine the people that really enjoyed the original and want to support indie creators will understand my choices. I greatly appreciate your feedback and will do my best to ensure lengthy support for my games. Please contact me through Twitter, My Website, Nickervision Studios Discord, or the forums if you want to discuss an issue with the game, something misleading on the store page, or you just want to say hello. Thank you for taking a moment to read this Adam Nickerson - Adamvision Studios GAMEPLAY: Your ship can not stop moving; so you must turn and use your boost/brake to keep from crashing into an ever increasing amount of enemies and obstacles Your ship is always shooting, so make sure to pick up more ammo and the wide variety of awesome power ups, pick ups and boosts to help you survive longer Get the highest score you can while collecting coins to buy more ships that are faster, shoot faster, or have more shields FEATURES: A throwback to the classic quarter eating arcade games of the 80's. Bit Blaster XL is a retro styled, addictive, and fast paced arcade shoot 'em up! Easy to learn, simple Controls to fly your ship, boost, and brake. Keyboard + Gamepad Support (not a twin stick shooter) A variety of wicked Power ups like Spread Shot, Heat seekers, Laser, Blast Shot and much more to assist your survival Screen clearing Bombs, Ship Shields and Boost Pickups to help you survive longer Collect coins to unlock new ships with unique attributes to give you an edge in the Leaderboards Endless survival (infinite) score chasing game play with a classic 'bullet hell'-like arcade style Steam achievements to earn and leaderboards to compete with friends and the world Steam Cloud save file support Retro pixel Graphics made by someone that mostly has no idea what they're doing Language translations available in English, Russian, German, Italian, Portuguese, French, Simplified Chinese, Spanish, Japanese, and Korean Featuring gameplay directly inspired by some of my favorites, such as; Luftrausers, Asteroids, Space Invaders, Galaxian, Defender, and Geometry Wars. Unique chip tune songs for each ship by Spiff Tune An alternate Manual Fire mode for those that want a different experience The in game audio/SFX was provided by my mouth and some royalty free SFX from FreeSFX The soundtrack is by the artist 'Spiff Tune'",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/865040/header.jpg?t=1637562418",
    "Price": 3.99,
    "Developers": "Adamvision Studios",
    "Publishers": "Adamvision Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/865040/ss_97f3ef7adb085bc47fda6af7a50ff4ef75d8a71c.1920x1080.jpg?t=1637562418,https://cdn.akamai.steamstatic.com/steam/apps/865040/ss_a0cab44075fa4d3818c80966d9f33d682aecaab9.1920x1080.jpg?t=1637562418,https://cdn.akamai.steamstatic.com/steam/apps/865040/ss_e5ab5a860492d7c619d344fa2edcef6a768cfae4.1920x1080.jpg?t=1637562418,https://cdn.akamai.steamstatic.com/steam/apps/865040/ss_4ff4e1217561da255b0247bf890677f951c43210.1920x1080.jpg?t=1637562418,https://cdn.akamai.steamstatic.com/steam/apps/865040/ss_291e2dbb3f089ff4af617251de5ae60e1dbf4020.1920x1080.jpg?t=1637562418,https://cdn.akamai.steamstatic.com/steam/apps/865040/ss_fb92c5ee2570921b47c172b37be86360688099eb.1920x1080.jpg?t=1637562418,https://cdn.akamai.steamstatic.com/steam/apps/865040/ss_94be2c16d354b712771e19ab7e565b9132ab5e7b.1920x1080.jpg?t=1637562418,https://cdn.akamai.steamstatic.com/steam/apps/865040/ss_baf0e07ac6ea04ff38849b026b53da1479e0f6a7.1920x1080.jpg?t=1637562418,https://cdn.akamai.steamstatic.com/steam/apps/865040/ss_8ba70a2d88e6238da29af14cd793082d760db54a.1920x1080.jpg?t=1637562418",
    "Slug": "super-bit-blaster-xl",
    "Meta Title": "Super Bit Blaster XL: Mar 16, 2020, Adamvision Studios an...",
    "Meta Description": "Looking for information on Super Bit Blaster XL? Check out the release date (Mar 16, 2020), developer insights from Adamvision Studios, and a complete g...",
    "Alt Text Image": "Official header image for Super Bit Blaster XL game - Steam 865040",
    "Canonical URL": "https://gusku.site/game/super-bit-blaster-xl",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Super Bit Blaster XL\", \"description\": \"Looking for information on Super Bit Blaster XL? Check out the release date (Mar 16, 2020), developer insights from Adamvision Studios, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 16, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Adamvision Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Adamvision Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/865040/header.jpg?t=1637562418\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}