{
    "AppID": 1730020,
    "Name": "Teamkill",
    "Release date": "Feb 17, 2022",
    "About the game": "Teamkill is a frantic multiplayer arena shooter where the teams are always changing and every shot counts. Outgun and outmaneuver your soon-to-be friends by strafing, jumping and strafe-jumping at break-neck speeds like it's 1999! Inspired by the legendary instagib mode known from classic game series' like Quake and Unreal Tournament , as well as the infection mode found in countless others. In Teamkill, one good shot is all it takes to turn the tides as you make your enemies fight for you, and every match is a chaotic battle where the situation can shift at any time between free-for-all scraps, glorious team deathmatches, and tense showdowns where it's just you and your gun against the world. Many ways to play! On top of the standard Teamkill game mode, if you just want the big team battles right away, hop into Team-Teamkill mode, or goof off in Hide &amp; Seek . Make the teams yours! Show off your creativity and well developed vocabulary by personalizing your team with a custom name and color, and laugh as you make your friends fight for it. Make the modes yours! Teamkill puts a variety of options in players' hands to tweak matches to their liking, including separate rules for each team. Do you want to see how low gravity versus high gravity fights can play out? A team that can only strafe-jump against a team that can't jump at all? A normal team duking it out with a team of ice skaters sliding all over the place? Go for it! Make the game yours! Import your own maps into the game, then play them with your friends through Steam Workshop! Bots Whether you prefer to play alone, the lobby is looking a bit thin, or you just want more chaos, you can bring bots into your matches and watch as they jump, shoot, and taunt everything in a 50 mile radius! Real? ...Real! Experience the man, the myth, the legend, Gianni Matragrano as the in-game announcer and Teamguy with a ridiculous amount of hilarious voice lines, and an original soundtrack heavily featuring the work of musician, dream weaver, visionary (plus animator) CoreyLaddo !",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1730020/header.jpg?t=1658007751",
    "Price": 10.99,
    "Developers": "Nikolai Johansen",
    "Publishers": "Nikolai Johansen",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1730020/ss_e9e0e100fd6c1ee8487d7c0b0d79d008d1ec7e2f.1920x1080.jpg?t=1658007751,https://cdn.akamai.steamstatic.com/steam/apps/1730020/ss_66cb2cc163b625f88003658bb90e49d64826eca4.1920x1080.jpg?t=1658007751,https://cdn.akamai.steamstatic.com/steam/apps/1730020/ss_18dbed95b8ab8f3dc327b84495cac9b3e15e1ed7.1920x1080.jpg?t=1658007751,https://cdn.akamai.steamstatic.com/steam/apps/1730020/ss_4b92b82f4d71b193cd433298c4114e7fab8e9544.1920x1080.jpg?t=1658007751,https://cdn.akamai.steamstatic.com/steam/apps/1730020/ss_2f37872cd758e25a5e4869079becfca7449b6299.1920x1080.jpg?t=1658007751",
    "Slug": "teamkill",
    "Meta Title": "Teamkill: Feb 17, 2022, Nikolai Johansen and Full Overview",
    "Meta Description": "Looking for information on Teamkill? Check out the release date (Feb 17, 2022), developer insights from Nikolai Johansen, and a complete game summary.",
    "Alt Text Image": "Official header image for Teamkill game - Steam 1730020",
    "Canonical URL": "https://gusku.site/game/teamkill",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Teamkill\", \"description\": \"Looking for information on Teamkill? Check out the release date (Feb 17, 2022), developer insights from Nikolai Johansen, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nikolai Johansen\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nikolai Johansen\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1730020/header.jpg?t=1658007751\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}