{
    "AppID": 1362520,
    "Name": "The Luminous Underground",
    "Release date": "Dec 17, 2020",
    "About the game": "Blast spirits out of a haunted subway system! Can your team defeat rival exterminators, shoddy gear, and City Hall? You've been a daemon dissipator for years, carrying a rainbow blaster and learning the ins and outs of magic to zap electromagnetic monsters into static. After following the jobs from one end of Septenland to the other, you've settled down here in Barrington: an old city. A weird city. A city boiling with spirits, specters, and daemons. It's the perfect place to start a company of your own. The Luminous Underground is a 660,000-word interactive secondary-world science fantasy novel by Phoebe Barton, where your choices control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination. Your team is just you and McCowan, your friend and business partner, but it's hard for two people to run an operation like this. When you applied for a contract with the Barrington Transit Commission, you didn't expect anything but a flat rejection. But you got it! And now you've got to find more teammates, sharpen your skills, and put a dent in the spirit population while staying well clear of the electrified rail. But you'll find that Barrington's underground is much more than its tunnels. There's a forest down here, teeming with crystalline trees that glitter under your flashlight. There's a portal to the Vitalscape, a super-luminous alternative realm of being. You can enter it through a mural, but you'll need a crystal tuning fork to get back. There are giants, robots, daemons, and even a giant robot daemon. Of course, corruption and mismanagement festers down here. Is this all part of your competitors’ attempts to secure the subway contract for their own? Is City Hall's stingy maintenance budget to blame? How much can you get paid not to fix this problem? Are you ready to patrol your patch of subway, or will you stand by and let it crumble? Play as male, female, or nonbinary; gay, straight, aromantic, or asexual. Descend into a magic-drenched subway and face down spirits beneath the streets! Help time travelers integrate into the incredible world of today. Dig up megacorporate corruption while you dust off vacuum tubes. Investigate mysterious disappearances down in the underground. Cooperate with other outfits in town, or act on your own Lead the mayor to safety through a gauntlet of terrors! Save the lives of a missing crew under an impossible sky. Calm down a giant woman who's got you in the palm of her hand. Strange things are crawling out of the subway. Someone better call you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1362520/header.jpg?t=1634753080",
    "Price": 6.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1362520/ss_983f352767142681041756943caeb396ecaf6b47.1920x1080.jpg?t=1634753080,https://cdn.akamai.steamstatic.com/steam/apps/1362520/ss_db1c2ee5d8b6da890c2efb2f213472e26744d6cb.1920x1080.jpg?t=1634753080,https://cdn.akamai.steamstatic.com/steam/apps/1362520/ss_ffbb0e42417aa496f6935511d7980cdaa835d965.1920x1080.jpg?t=1634753080,https://cdn.akamai.steamstatic.com/steam/apps/1362520/ss_cf72499a228732093cf9fc56c4aa07bd57585807.1920x1080.jpg?t=1634753080,https://cdn.akamai.steamstatic.com/steam/apps/1362520/ss_683dc9397c2474ff4fa8a98e19d6d85d15252b17.1920x1080.jpg?t=1634753080",
    "Slug": "the-luminous-underground",
    "Meta Title": "The Luminous Underground: Dec 17, 2020, Choice of Games a...",
    "Meta Description": "Looking for information on The Luminous Underground? Check out the release date (Dec 17, 2020), developer insights from Choice of Games, and a complete ...",
    "Alt Text Image": "Official header image for The Luminous Underground game - Steam 1362520",
    "Canonical URL": "https://gusku.site/game/the-luminous-underground",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Luminous Underground\", \"description\": \"Looking for information on The Luminous Underground? Check out the release date (Dec 17, 2020), developer insights from Choice of Games, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 17, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1362520/header.jpg?t=1634753080\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}