{
    "AppID": 1605910,
    "Name": "宇宙终极秘密-灵魂The ultimate secret of the universe：Soul",
    "Release date": "May 6, 2021",
    "About the game": "What kind of game is this? This is a very simple 3D single game, only a simple dialogue, the operation of the game and most of the same 3D games. The game scene is the style of ancient Chinese architecture, which is not important, but the dialogue with NPC. This is a simple game, and NPC dialogue does not need you to run around. There are no fighting and gorgeous special effects in the game. What is the conversation about in the game? Why do people live? What is the meaning of living? Where do people come from? Where do people go after death? This is a concern of many people. Twenty years ago, I completed the study of the cycle of the universe. Fifteen years ago, when I studied the 33 dimensional space-time, I came to the conclusion that matter, space and time did not exist, and then I turned to the study of theology. Here, I will tell you the answers to these questions in the simplest language according to my own research. I hope my answer is correct, and I hope you like it. The dialogue in the game can be organized as an article, dedicated to those who love science. What if the dialogue in the game can't be understood? Because everyone's situation is different, some of the dialogue content in the game may be beyond your understanding. Although there is no mention of 33 dimensional space-time in the dialogue, many of the contents are related to 33 dimensional space-time, some of which are difficult to understand. When you encounter these difficult to understand, you can ignore them for a while. When you are in a quiet environment, you can often think about these problems. Maybe you can understand them. Will there be a follow-up version of the game? Now this version of the game, the dialogue content is I spent more than ten days writing out, I have never considered to write these things. Originally, I wanted to make a multiplayer online RPG online game. But during the Spring Festival, I found that in our country, individuals can not release and operate online games. So I decided to make the simplest game first, so this game appeared. The theme of the game, I did not think better, I also do not like to make random, so I used to care about, often thinking things out of the game, put in the game. This game has no fighting pleasure and visual wonderful experience. For the dialogue content in the game, many people should not be interested in it. It is likely that there is no subsequent version of the game. If you have bought the game and read the dialogue content in the game, you regret to buy it, you can apply for a refund, I think Steam should agree. Of course, if a lot of people like the dialogue content in the game, there may be a new version.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1605910/header.jpg?t=1620288269",
    "Price": 9.99,
    "Developers": "个人",
    "Publishers": "个人",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1605910/ss_ca9663aecd4fc55f36b3e625d79a1d1fa9fe267b.1920x1080.jpg?t=1620288269,https://cdn.akamai.steamstatic.com/steam/apps/1605910/ss_1cde419daa9fb8776cce5e40f276d30fe67a9585.1920x1080.jpg?t=1620288269,https://cdn.akamai.steamstatic.com/steam/apps/1605910/ss_22e579cb6192c2e59e4a6789d35864485f2b181e.1920x1080.jpg?t=1620288269,https://cdn.akamai.steamstatic.com/steam/apps/1605910/ss_8f1439941c0950b5c0a986e8e27d9bfb484664c8.1920x1080.jpg?t=1620288269,https://cdn.akamai.steamstatic.com/steam/apps/1605910/ss_c77c2e08b2c6a6e9018984a20b76283adc95f3b9.1920x1080.jpg?t=1620288269,https://cdn.akamai.steamstatic.com/steam/apps/1605910/ss_70ef9d142f3cf9f6abfdefeab6543b1bc0f711fd.1920x1080.jpg?t=1620288269,https://cdn.akamai.steamstatic.com/steam/apps/1605910/ss_a743b943941d253ff41c5f8f2f4e874dc400f160.1920x1080.jpg?t=1620288269,https://cdn.akamai.steamstatic.com/steam/apps/1605910/ss_67b37a9ba10e4d848957e46a779ec4aaff37f6bd.1920x1080.jpg?t=1620288269",
    "Slug": "the-ultimate-secret-of-the-universesoul",
    "Meta Title": "宇宙终极秘密-灵魂The ultimate secret of the universe：Soul: May 6,...",
    "Meta Description": "Looking for information on 宇宙终极秘密-灵魂The ultimate secret of the universe：Soul? Check out the release date (May 6, 2021), developer insights from 个人, and ...",
    "Alt Text Image": "Official header image for 宇宙终极秘密-灵魂The ultimate secret of the universe：Soul game - Steam 1605910",
    "Canonical URL": "https://gusku.site/game/the-ultimate-secret-of-the-universesoul",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5b87\\u5b99\\u7ec8\\u6781\\u79d8\\u5bc6-\\u7075\\u9b42The ultimate secret of the universe\\uff1aSoul\", \"description\": \"Looking for information on \\u5b87\\u5b99\\u7ec8\\u6781\\u79d8\\u5bc6-\\u7075\\u9b42The ultimate secret of the universe\\uff1aSoul? Check out the release date (May 6, 2021), developer insights from \\u4e2a\\u4eba, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 6, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4e2a\\u4eba\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u4e2a\\u4eba\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1605910/header.jpg?t=1620288269\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}