{
    "AppID": 1784570,
    "Name": "Trainz Railroad Simulator 2022",
    "Release date": "May 30, 2022",
    "About the game": "Trainz provides something for every train fan. TRS22 includes all the tools and content required to create and operate your own railroad, or you can drive on pre-built sessions and routes in either 'simple' or 'realistic' cab mode. TRS22 includes five brand new routes, each with a range of new sessions and highly detailed new trains for you to enjoy. TRS22 also delivers a brand new experience to Steam with 'Multiplayer Surveyor' (MPS) allowing you to build and drive in a world you can edit online with friends. (Of course you can still build offline with our user-friendly Surveyor route editor too). Want more from Trainz? Check out our optional TRAINZ PLUS membership plans on the Steam Store. Get new features, a huge list of Bonus Content, plus a First Class Ticket, all for a low monthly fee. TRAINZ RAILROAD SIMULATOR 2022 FEATURES 1000s of Trains TRS22 includes over 400 train vehicles (locos, freight, passenger) just to get you started. Then choose from almost 70,000 additional free locos, freight &amp; passenger cars on the Trainz Download Station or purchase your favorites from the in-game Content Store. Trainz Download Station includes a huge selection of train vehicles: Over 27,000 Locomotives Over 6,000 Hoppers &amp; Gondolas Over 5,000 Boxcars Over 1,500 Tank cars Over 1,000 Reefers Plus passenger cars, cabooses, and much more. And even helicopters, planes, boats and trucks! 1000s of Routes TRS22 includes five of the best routes ever seen in Trainz* Expand your collection with 20,000 additional routes available free from the Trainz Download Station or choose to purchase your favorite DLC content from the Content Store. * Free to download after installing the core game. BONUS OFFER For a limited time, TRS22 will include a complimentary 30 day First Class Ticket so you can download all the extra content you want. BACKWARDS COMPATIBLE If you're already a Trainz owner, all your existing DLC and the vast majority of your local content can be imported into TRS22. BUILD AND DRIVE ONLINE WITH FRIENDS You can now Collaborate in real time. Build &amp; drive practically endless worlds together using the latest Trainz world building technology, 'Multiplayer Surveyor' (MPS). TRS22 MPS provides access to a selected range of worlds you can edit and expand, limited only by your imagination. More routes will be added as demand requires. TRS22 BRAND NEW ROUTES: Download any or all of these FIVE incredible routes in-game from the Content Store. (Trainz Plus also entitles you to a huge range of Bonus Content) 'West from Denver' - USA Drive from Denver to Hot Sulphur Springs in this beautiful detailed journey through rugged mountainous terrain. Stunning Detail - West from Denver takes full advantage of the latest Trainz features and content to bring you the best driving experience, including full seasonal support. Amtrak P42DC Phase V - The P42DC (GENESIS Series I) has been completely remodelled inside and out with incredible detail. Includes interactive sessions. Watch the trailer above. Schwäninger Land, Germany An expansive route including a busy main line, high speed corridor and local branch lines. Brimming with potential for many kinds of operations. A Route That Has It All - Whether it's InterCity Expresses, commuter services, bulk or local freight and marshalling operations, you'll find it all here. Industry &amp; Yards - Schwäninger Land plays host to several large yards on opposite ends of the route with several rail networks connecting them. Includes interactive sessions. Watch the trailer above. Liskeard to Looe, United Kingdom Liskeard to Looe is a stunning prototypical route based in the United Kingdom. Class 47 Locomotive - Experience the new Class 47 engine in spectacular detail. Class 47 Cab - Climb aboard the new Class 47 fully interactive cabin interior. Includes interactive sessions. Watch the trailer above. Bairnsdale to Orbost, Australia Bairnsdale to Orbost is a prototypical route set in the 1970-80s showing off an amazing recreation of an Australian outback railway. The Orbost Rail Bridge - Trundle across the famed Snowy River floodplain bridge at Orbost, one of the longest timber bridges in Victoria. VR T Class Locomotive and Cab - Climb into the fully detailed VR T Class interactive cabin interior and drive the 'High Cab' and 'Low Nose' T class locomotives! Includes interactive sessions. Watch the trailer above. Beloreck - South Ural Mountains, Eastern Europe Created by Ukrainian content creator Oleg, Beloreck - South Ural Mountains is a faithful representation of the railways of Central Eurasia and the Ural Mountain range. Two-system Electric Loco VL82 - Experience the prototypical VL82 engine. VL82 Cab - Climb into the fully detailed VL82 interactive cabin interior. Includes interactive sessions. Watch the trailer above. TRS22 NEW FEATURES MULTIPLAYER SURVEYOR Build &amp; drive practically endless worlds together using the latest Trainz multiplayer world building technology 'Multiplayer Surveyor'. We've streamlined the route building process to focus on user collaboration. Drive and create together using the most advanced multiplayer world building tech ever created for train simulation! TRS22 MPS provides access to a selected range of worlds you can edit and expand, limited only by your imagination. More routes will be added as demand requires. UNIFIED DRIVER / SURVEYOR (UDS) Forget reloading the whole map to switch back and forth from Driver to Surveyor. UDS allows you to instantly switch between editing and driving and back again. Spot something you need to tweak? Just jump into Surveyor, make the change, and switch instantly back to Driver to continue on your way. NEW EFFECT LAYER TOOLS AND PRESETS Choose from a range of presets to quickly create new effect layers for your current route. Set up 'masks' to prevent effect layers from appearing under water, on a slope or above/below a certain height. Create and Edit custom preset effect layer assets (and share your assets via the DLS or .cdp). NEW EDITOR TOOLS Bulk Paint ground textures under a spline (e.g. add ballast under a track throughout the whole route or section of the route). Bulk Add effect layers to existing ground textures (e.g. add Turffx or clutter to a specific ground texture). NEW CAMERA OPTIO﻿NS We've unified the Driver and Surveyor camera controls while adding more camera modes such as Car, Walk, Fly and Drone. CONTENT STORE It's now easier than ever to organise your DLC with filtered tabs for Store, Purchased and Updated items. Search, install, uninstall, update and of course purchase with this powerful new interface. LOADS OF NEW SCENERY We've added over 1,000 brand new quality scenery items to offer even more variety in your route building options. GAME CONTROLLER SUPPORT Controller support allows you to drive trains and control cameras within Driver.* * Full controller support not available. NOTE: The minimum specifications shown allow you to run the game at low settings. We recommend at least 100GB drive space (or 1TB to enjoy all Trainz has to offer).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1784570/header.jpg?t=1653965684",
    "Price": 69.99,
    "Developers": "N3V Games",
    "Publishers": "N3V Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1784570/ss_d18d6d1601fefc21b87f1c48fd75ceea416eca34.1920x1080.jpg?t=1653965684,https://cdn.akamai.steamstatic.com/steam/apps/1784570/ss_1460a4cf6dca5168698bc75c44d6c952215e2156.1920x1080.jpg?t=1653965684,https://cdn.akamai.steamstatic.com/steam/apps/1784570/ss_723dbbb12b7cb0b0bc943ce0e519a9fce6240191.1920x1080.jpg?t=1653965684,https://cdn.akamai.steamstatic.com/steam/apps/1784570/ss_765c3947732e41340ff9ede3c17df8cc55a1fb20.1920x1080.jpg?t=1653965684,https://cdn.akamai.steamstatic.com/steam/apps/1784570/ss_0ff2db332f5be733e932fdd5d9f1420fce94b6e0.1920x1080.jpg?t=1653965684,https://cdn.akamai.steamstatic.com/steam/apps/1784570/ss_b331eeb122dee3715efbf3a410f59cf63ed1f4a5.1920x1080.jpg?t=1653965684,https://cdn.akamai.steamstatic.com/steam/apps/1784570/ss_e78f16489bcf3d2b60a6bf4ae9c009e8bce35b44.1920x1080.jpg?t=1653965684,https://cdn.akamai.steamstatic.com/steam/apps/1784570/ss_78c6aec31aa8806ca2cccb0b00014adca3638100.1920x1080.jpg?t=1653965684,https://cdn.akamai.steamstatic.com/steam/apps/1784570/ss_ff6738572e613a78a0acb8540960431f2ac2e23f.1920x1080.jpg?t=1653965684,https://cdn.akamai.steamstatic.com/steam/apps/1784570/ss_585846c40f58374dce867a6b376e1bcdcf3d6987.1920x1080.jpg?t=1653965684,https://cdn.akamai.steamstatic.com/steam/apps/1784570/ss_26893887d6d17ffdf6669935fece27aaf08ae2f6.1920x1080.jpg?t=1653965684,https://cdn.akamai.steamstatic.com/steam/apps/1784570/ss_ea70ea8c8707e0584db84267ac9b6c3bb029ee0d.1920x1080.jpg?t=1653965684",
    "Slug": "trainz-railroad-simulator-2022",
    "Meta Title": "Trainz Railroad Simulator 2022: May 30, 2022, N3V Games a...",
    "Meta Description": "Looking for information on Trainz Railroad Simulator 2022? Check out the release date (May 30, 2022), developer insights from N3V Games, and a complete ...",
    "Alt Text Image": "Official header image for Trainz Railroad Simulator 2022 game - Steam 1784570",
    "Canonical URL": "https://gusku.site/game/trainz-railroad-simulator-2022",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trainz Railroad Simulator 2022\", \"description\": \"Looking for information on Trainz Railroad Simulator 2022? Check out the release date (May 30, 2022), developer insights from N3V Games, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"N3V Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"N3V Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1784570/header.jpg?t=1653965684\", \"offers\": {\"@type\": \"Offer\", \"price\": 69.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}