{
    "AppID": 257830,
    "Name": "Violett Remastered",
    "Release date": "Dec 13, 2013",
    "About the game": "The new ultimate version of Violett brings even more of the best point and click adventure fun, right onto your screen. In this expanded version you'll see a pair of completely new levels, full of entirely new puzzles and specially composed music. Upgraded graphical effects in the game making the hand-painted, Escheresque surroundings look even more stunning. Redesigned and improved game mechanics as well as controls will let you solve the riddles presented to you with much more ease. If you ever get stuck by a particularly tricky puzzle, a redesigned system of tips will help you move forward. And newly added gamepad support will make your game much more pleasurable to play on your big screen TV or your PC's monitor. Set in a world full of wonders, quirks and things from beyond our reality, Violett is a remarkable adventure game that will push your brain to the limits and engross you completely. Dragged by her parents, a young and rebellious teenage girl – Violett, moves to an old spooky house in the middle of nowhere. Forced away from her friends and life in the city; she imagines how boring life in countryside will be: spending day after day, bored in her room with absolutely nothing to do. But what she cannot imagine, is that in just few moments, she'll have the adventure of her life. A spark of light from the nearby mouse hole catches her attention, she reaches inside and in a blink of an eye she's in a completely different place. So familiar, yet so distant. So magnificent, and yet dangerous. A place where frogs singing operas are daily occurrence, garden gnomes are emissaries from another dimension and power of telekinesis is not freaking anyone out. Now only your wit and luck can help her unite with her parents. Rack your brain on intricate puzzles. Use the power of telekinesis to get you out of your troubles. Fight the evil spider queen that wants to make you her new trophy. Use your touch to roam the beautiful and slightly psychedelic world, inspired by Alice in Wonderland, Dali and other great works. Immerse yourself in the soothing sound track, that is also available as a DRM free download - Fantastic 2,5D point-and-click adventure game - Unique world inside the 'rabbit-hole' - Multitude of puzzles and riddles - A spooky atmosphere of mystery and uneasiness - Evil Spider Queen who's trying to prevent you from ever coming back - Paranormal forces to manipulate objects - Beautiful hand-painted graphics full of quirkiness and style - Full parallel reality inspired by Alice in the Wonderland and other great works - Gamepad support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/257830/header.jpg?t=1568807783",
    "Price": 9.99,
    "Developers": "Forever Entertainment S. A.",
    "Publishers": "Forever Entertainment S. A.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/257830/ss_403805659497559cc1a7e057795a1f86a5aa4b19.1920x1080.jpg?t=1568807783,https://cdn.akamai.steamstatic.com/steam/apps/257830/ss_dc79cc2ef96b20bed892a31ed1c2a97dea9947f7.1920x1080.jpg?t=1568807783,https://cdn.akamai.steamstatic.com/steam/apps/257830/ss_06ca4e9cdb6e0199403c9ac6aafbf43086ae9ee2.1920x1080.jpg?t=1568807783,https://cdn.akamai.steamstatic.com/steam/apps/257830/ss_3d319f477d5ce54ba5f5f37feea4cdeff2e6cba7.1920x1080.jpg?t=1568807783,https://cdn.akamai.steamstatic.com/steam/apps/257830/ss_86b8dfbe6339e882c1478a28fc027d6eb96acbb1.1920x1080.jpg?t=1568807783,https://cdn.akamai.steamstatic.com/steam/apps/257830/ss_363eb305562adf313375b2da5145ecfc8bb32c11.1920x1080.jpg?t=1568807783,https://cdn.akamai.steamstatic.com/steam/apps/257830/ss_88fdbeab8d45efabbd0effab758593db048b75cf.1920x1080.jpg?t=1568807783,https://cdn.akamai.steamstatic.com/steam/apps/257830/ss_d99e16bd0908fb5de635b482e6168e04b8ade196.1920x1080.jpg?t=1568807783,https://cdn.akamai.steamstatic.com/steam/apps/257830/ss_b0ec9b9286702c36fdce772d534b87bf6a1fde6f.1920x1080.jpg?t=1568807783,https://cdn.akamai.steamstatic.com/steam/apps/257830/ss_e30ea6a0afae6091b6a64a6eea3c9b92fcec7591.1920x1080.jpg?t=1568807783",
    "Slug": "violett-remastered",
    "Meta Title": "Violett Remastered: Dec 13, 2013, Forever Entertainment S...",
    "Meta Description": "Looking for information on Violett Remastered? Check out the release date (Dec 13, 2013), developer insights from Forever Entertainment S. A., and a com...",
    "Alt Text Image": "Official header image for Violett Remastered game - Steam 257830",
    "Canonical URL": "https://gusku.site/game/violett-remastered",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Violett Remastered\", \"description\": \"Looking for information on Violett Remastered? Check out the release date (Dec 13, 2013), developer insights from Forever Entertainment S. A., and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 13, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"Forever Entertainment S. A.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Forever Entertainment S. A.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/257830/header.jpg?t=1568807783\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}