{
    "AppID": 798710,
    "Name": "Voltage",
    "Release date": "May 28, 2019",
    "About the game": "Inspired by the Amiga, Commodore 64 and PC '90s legends! Redneck Rampage, DukeNukem and Quake fans might find something familiar from this game, also Dino Crisis and Dinosaur Hunter fans. Graphically it is designed look like AAA Amiga game, however Voltage won't sent you back to the stone age, it is boosted with modern game features (which where not available 30 years ago..). the small town of Frontier, Missouri, in the 1980s. A young man called Mark is having his summer holiday, the last summer before going to a college. Mark is our story hero, who is living in this idyllic small town, surrounded by a thick forests with a dozens of small lakes with crystal-clear water. This town even have famous American football league. But sometimes you can get bored even a burning hot sunny day like this, even a town like this. that reason, Mark and his friends, Jesse, Benjamin and Simon, are exploring scrap yard, where they tend to go secretly to look for all the special stuff, mostly parts of the mopeds and cars. The only employee in the scrap yard has gone to lunch break, and Mark knows that this is their only change to explore treasures in a crap yard... old truck which have -as every car in this scrap yard- seemed to be in a traffic accident. Logo of the truck is badly damaged, but he can read some text in it, about 'Co' and 'International'. He peek into the truck, and notice that most of the stuff is badly damaged. But deeper inside truck trunk he finds a prototype of VR-glasses and a floppy disk. Mark smuggle the glasses and a floppy disk to his home and to his surprise, he find out that the glasses are compatible with his Amiga 500. Quickly he realizes that the truck and all techie stuff were a property of C-I Advanced Technology Department, which does cooperation with a military. that these glasses are capable to unlock incredible hidden features in Amiga 500, able to take full advantage of the Amiga's potential. He launches a game that extends beyond what the games is likely to do, a whole virtual universe, which is somehow connected to another paralled universe. A universe, where the development of computers wen't through other paths and Amiga is world second biggest and the most advanced computer system. Mark log in to interconnected virtual space called the AOSYS and real adventure begins... While exploring incredible AOSYS game environment with his glasses, Mark doesn't know that technology department in the other site have noticed their visitor from another dimension and they try to do their best to track the player and get their glasses back... with a help of army... Full Episode 1 Release. The game certainly offers value for money and hours of game play. Voltage was originally a peaceful place. But since the C-I Advanced Department of Technology is trying to eliminate the player they bring a massive army of enemies inside the game. Complete all Episode 1 Sublevels* and bring peace back to the Voltage! Full version of the Voltage: Episode 1 includes 8 huge Sublevels: Sublevel 1: Tutorial Zone This is optional on the game menu. We found out that some players were unfamiliar about box pushing and using switches, so on this optional level you learn the game logic. On the Tutorial Zone, you can practice many important skills and get to know to the game. Remember that you can always ask help from the Steam Community Hub. Sublevel 2: Warm-up A little warm-up before you start... Sublevel 3: Hometown Actual game starts at your hometown, and your mission is to find Amiga 500 computer inside the house and start your adventure in AOSYS... After you have found computer, your journey in AOSYS starts. We noticed that many player was interesting to explore hometown on the first version, so now this level is even more bigger, including many houses and surprises. Sublevel X: Dark Side Voltage Dark Side is mystic environment. Voltage has it's sunny side and Dark Side is place where AOSYS system spawns the 'dead' characters, in order to Voltage run smoothly. When player enters to the Voltage he will be accidently spawned to this environment and mission is to find way out... Sublevel 4: Star Qruiser First mission is called 'Escape from the Star Cruiser': You are in a Star Cruiser. Seems that something has gone badly wrong and it's full of enemies (we don't reveal what kind of...). This level gives you about a 100-130 min gameplay. The game proceeds almost straightforwardly (spaceship is quite big) when you explore different parts of Star Cruiser and you desperate to escape... Boldly explore the Star Cruiser, who knows if you might even be able to find dinosaurs on their development section... Sublevel 5: Terraria In this sublevel you explore the space ship Terraria. Terraria is a place, which is used to harvest food to space ship crew. Terraria is also used to farm some extraordinally special animals, such as Dinosaurs. Be carefully not to release them from their cages... Sublevel 6: Into the Desert You have escaped from the Star Cruiser by using emergency shuttle. Unfortunately an error occurs and you find yourself from a burning hot desert. Try to find familiar town, or some vehicle to escape... Sublevel 7: BunkerWay You discovered way to the Bunker on previous level. This is the only 'safe' way to the Voltage Town (Episode 2). Explore large sections on the bunker and find your way... Goal is to include VoltageDinoLand, City of Voltage and Town of Voltage to the Episode 2. Special features, which are now available Turn on and off switches Ability to dive and swim Push and move movable objects. If objects does not move, it is not movable Pick, Carry and drop (currently only one object is enabled for this, we are testing this feature) Talking characters (text) Ah, finally we get to the most important thing in the game :) Player has an access to a wide variety of different kind of guns. Episode 1 includes at least these guns: Shotgun, Sniper M700, Magnum 357, Colt 1911, RPG, Crossbow, Dagger, Hatchet, Bow, Halberd, Mace, Stones tho throw, Grenades and even one futuretek gun.. Other type of weapons are Melee Weapons, which you also have access when exploring different levels. These Melee Weapons are: Baseball Bat, Bow Saw, Cleaver, Cricket Bat, Crowbar, File, Garden Fork, Hammer, Lead Pipe, Pickaxe, Screwdriver, Shovel, Sledgehammer, Spanner and Wrench. dr. Stephen J. McRegon, scientist, computer engineer, and something an a dreamer was asked to help a medium large computer company, to create a ultimate virtual reality system, which was ahead of time. And he did it. On year 1982 he created an open world game for Amiga personal computer, called AOSYS, Amiga operating system. AOSYS was capable to unlock incredible hidden features in Amiga 500, able to take full advantage of it's potential. Unfortunately it was never introduced to the markets in your dimension, where you read this message. Until this day came. McRegon found a way to blend space and time by simple breaking the law's of nature; He was sending radio waves Faster Than Light and that way broke the Cosmic Speed Limit. That maneuver opened a portal (which can be used only for sending small mass objects or voice), and hence deliver AOSYS to our dimension. For you all to play. You see, all physical objects, even you and your chair, exist in three dimensions. Everything has a width, and a high and a length. But there is another kind of length, a length in time. All characters and locations used in this game are fictitious in our universe and any resemblance to real persons, vehicles and places is purely coincidental. The game contains the instruction manual. To view this manual, click on the Steam store page ”View the manual” link.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/798710/header.jpg?t=1590835622",
    "Price": 0.99,
    "Developers": "F-Games",
    "Publishers": "JTS Development",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_133eba2021b577e335fe60db501a93bafcddb1d7.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_3f872adfe0c6a4c83b38e55690f69c9df8d13641.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_39925c70d6b1e2bdf2e41b9c78e5c54f45fdb13c.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_80f9c155def58d2b75a051f76009297d988f35f0.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_06add3c84285d6abd79022dc81e7d130f8c5252e.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_6ca3a5380424ca25bde385528f10ee1945766b90.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_b7011781ffdc1171e7b8b8bebc23aaa5ba0e3821.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_03c8c5510ab289c45b09496435c697a56d1a7d2f.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_74121eda868f1f4c4f49c0a631df2ff9801a361a.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_36fcd4f706de5f6f1f0fe30ab789d7229c94d31c.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_caaacfe387d35a6913dec066020200af24e85a55.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_c03859fe7891560b1cc7bad525efa2b12dec0b34.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_27a9e247c70620d2d2c791697727cb6dc9309e8b.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_97b3c004f8c7c0573350f81e551019b559b66b69.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_b671ac0f2a69d64964b24c1cf29720e93f4df161.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_f4c58a622403bcc206f8c298572a6457af993388.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_e4acc96ae44e1a28af868c558af1c7f0e1a38773.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_e6ed57757c5f0fa695a894d3233823cf61d6da63.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_03c21ac5c521c9a67c9ab4ea07ad34f1cf1725ce.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_b2f74d0759e827e6273900271f97ee5c29c4ab73.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_56768f142f66225d193aacf3a0e0b5a516ee7ea2.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_b5400322885cfd50c7668f952b85a65c064c99b9.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_de843035ee054360fa2075d674b6cd0af3419a58.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_28cd7ff987f1f40ac6a0944a0379eb6157ca54bb.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_16e526bc8f86f693af4dbb6d13612d12d5c88986.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_ef5518f7f92fc9c248cdb2afd15070a70c0abb3f.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_17a8e4cc60980a758dc141162c6ede53770288d4.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_7b785640a88572ed9d2666cb0f4f9e425fceb6c6.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_085773a99caff31d765a59a1e769cb0143e45eb6.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_b2244c538514cbb7bb8ff3a752cbd5bdb34e3da0.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_f17397101fb4bb456dbb35eb405d449ba2b70acd.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_7c29c8947ef6831dbd722b6533d90e9a5c3d0851.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_de1cac5ac6ad9081aef1c5d6c9e46b54f7ff1b55.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_5ae38db1662373606d9dbc8fb0be04f61beba20b.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_032f85367d19175578396377dd8792f819454e03.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_ffba0e98faef1af003661db310be4168ae0e9b85.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_2f03056037fbd83738c2c8a2f213efaa0f46d025.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_9d06908c76829b0edbeb0bf0be454c93f0f10ad4.1920x1080.jpg?t=1590835622,https://cdn.akamai.steamstatic.com/steam/apps/798710/ss_c26a420360d6d3b53a8383b942adba2f7d066820.1920x1080.jpg?t=1590835622",
    "Slug": "voltage",
    "Meta Title": "Voltage: May 28, 2019, F-Games and Full Overview",
    "Meta Description": "Looking for information on Voltage? Check out the release date (May 28, 2019), developer insights from F-Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Voltage game - Steam 798710",
    "Canonical URL": "https://gusku.site/game/voltage",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Voltage\", \"description\": \"Looking for information on Voltage? Check out the release date (May 28, 2019), developer insights from F-Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 28, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"F-Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JTS Development\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/798710/header.jpg?t=1590835622\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}