{
    "AppID": 389510,
    "Name": "Wild Animal Racing",
    "Release date": "Mar 7, 2016",
    "About the game": "On the island of Zig-Zag-Zog, in the sea of Ooberdeedoo, Are some amazing creatures, that you would never see in a zoo! They walk upright on two legs, like some kind of aliens from Mars, But the strangest thing, (you would not believe!) is that these animals are driving cars! A giraffe that bleats, a hippo that moos, they are the strangest beasts, But that's not the strangest thing, my dear, they're standing on their two feets! How did this happen? (I ask you!) How did these things evolve? I'm determined to find out, you know, with all of my resolve! Some say it was a meteorite, that gave them super powers, Some say it was the weather, some say it was magic flowers. Some say they simply did evolve, like apes evolved to men, Some say it was the Man Upstairs who gave new life to them. All I know is that they're here! I've seen them with my eyes, I've seen their island, and their homes from my helicopter in the skys. I've seen them race around all day in a racetrack made from stone. I wish more people could see this. But I'm the only one. So I brought them here to Europe. They've signed on the dotted line, Now people pay to see them race, and the money is all mine! You see there's something more amazing than animals in cars, And that's the magic of contract law and drinking in bars. About Wild Animal Racing Wild Animal Racing is an exciting go-kart simulation game with a twist. Play as an elephant, a lion, a zebra, a giraffe, a rhino or a hippo! Play against the other animals or against a friend on the same computer with the split-screen mode! Or invite Steam friends in the multiplayer mode! As the game progresses you will gain access to exclusive animations that may reveal the secret of the strange animal monsters. Where did they come from and where are they going? But not only that you can take control of the animals and race them around the tracks! Race your car around tracks in Egypt, Paris and Holland in the World Tour! Drive your car around the coast and around the rim of a volcano in Iceland! Collect the Diamonds For Extra Speed! Pick up weapons such as rockets, a sledge hammer, or wheel spikes to knock your opponents off course! All In Amazing 3d Graphics! A Super Crazy Fun Game For Everyone! app Features six Characters to Choose From! two Players Can Play On One Device! four themed Cups! twelve Unique Tracks! multiple Comedy Weapons!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/389510/header.jpg?t=1572801854",
    "Price": 3.99,
    "Developers": "Paul Bird",
    "Publishers": "Marjupi Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/389510/ss_988c12e525460181d11c0ad15bea4d8a418f8b8d.1920x1080.jpg?t=1572801854,https://cdn.akamai.steamstatic.com/steam/apps/389510/ss_656d3c8e2e97d2b92f1d609f08448703451a3277.1920x1080.jpg?t=1572801854,https://cdn.akamai.steamstatic.com/steam/apps/389510/ss_3092e1e15a08981b01044eb4ce9e4789fc6d59d5.1920x1080.jpg?t=1572801854,https://cdn.akamai.steamstatic.com/steam/apps/389510/ss_a2d7ae3eb3f2d41ac52735c08f0a61559b71e3c7.1920x1080.jpg?t=1572801854,https://cdn.akamai.steamstatic.com/steam/apps/389510/ss_5730b40808823d1256e418a7b31eabee378c6f5f.1920x1080.jpg?t=1572801854,https://cdn.akamai.steamstatic.com/steam/apps/389510/ss_2c8d96ac4f1f82fcafe5dfa1bb0d053da608e58b.1920x1080.jpg?t=1572801854,https://cdn.akamai.steamstatic.com/steam/apps/389510/ss_694ab14d6ffb714f58a0be2aae4293093bf413f0.1920x1080.jpg?t=1572801854,https://cdn.akamai.steamstatic.com/steam/apps/389510/ss_d42419637ea69748980c2b30f24f1ea2f8fb1179.1920x1080.jpg?t=1572801854",
    "Slug": "wild-animal-racing",
    "Meta Title": "Wild Animal Racing: Mar 7, 2016, Paul Bird and Full Overview",
    "Meta Description": "Looking for information on Wild Animal Racing? Check out the release date (Mar 7, 2016), developer insights from Paul Bird, and a complete game summary.",
    "Alt Text Image": "Official header image for Wild Animal Racing game - Steam 389510",
    "Canonical URL": "https://gusku.site/game/wild-animal-racing",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wild Animal Racing\", \"description\": \"Looking for information on Wild Animal Racing? Check out the release date (Mar 7, 2016), developer insights from Paul Bird, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 7, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Paul Bird\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Marjupi Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/389510/header.jpg?t=1572801854\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}