{
    "AppID": 1303670,
    "Name": "World of Art - learn with Jigsaw Puzzles",
    "Release date": "Jun 18, 2020",
    "About the game": "Welcome to the World of Art - learn with Jigsaw Puzzles. Contemplate great paintings and great painter`s work with an accompaniment of classical, relaxing music. 60% Discount to brighten Your days! We Celebrate Second WoA BIRTHDAY with 900 PAINTINGS! MORE PAINTINGS IS COMING IN SUMMER UPDATE! When You BUY WoA, You recive access to ALL Paintings JIGSTRIS DLC is AVAILABLE We try to add as much content and suggestions as we can. More coming in next Updates! Make sure to check out upcoming games: Principle of Karma - exceptional retro puzzle platformer Search and Rescue - every survivalist favorite board game The Trial - Franz Kafka`s literature adaptation &amp; Stunt-Coordinator ! CD-ACTION rated Graphics in WoA 10/10! Christ Centered Gamer Score: 70% with Cultural/Moral/Ethical - 10/10! World of Art is a great and fast way to learn, get familiar with classical art and recognize Painters and Paintings. Working on every detail, You will explore fine art like never before. You will be suprised how fast You can learn. After a few days You will recognize Paintings and Painters, it`s a great way to learn. Free World of Art Jigsaw Puzzles Soundtrack is available only on Steam - enjoy music by Chopin, Bach, Handel or Grieg    You don`t have to leave Your house to buy high quality jigsaws.Train Your brain whenever You like and learn to recognize timeless Masterpieces. The World of Art Jigsaw Puzzles are superb for adults brain training, great learning experience for kids and seniors can keep their minds sharp. Game`s Official Patron is NCK - National Culture Center at the Polish Ministry of Culture    Canalletto, Van Gogh, Bosch, Rubens, Homer, Goya, Vermeer, Manet, Schreyvogel, Cezanne, Morse, Degas, Toulouse-Lautrec, Klimt and many other great painters. All that in accompaniment of a beautiful, classical music and calming sounds. Take a close look, play and familiarize Yourself with painting styles and themes. It`s a perfect puzzle game to spend time smart, explore magic of art and simply relax. FEATURES - Education by gaming - improve Your knowledge and recognize the works of art and painters from all around the World, - Learning experience for the whole family - rules are clear for kids, young, adults and seniors. For singles, married or those on the fence. All nationalities and colours. There`s no borders here. - Explore over 900 authentic masterpieces to collect. - More Coming Soon as a free Upgrade - Not a paid DLC. - 31 classical, relaxing Music Tracks - Four difficulty levels for each Puzzle:    - 12 pieces - easy to grasp for children or beginners,    - 48 pieces - regular, - 108 pieces - advanced,    - 300 puzzle pieces - level hard for real pros, - Rotate Puzzles for master level Players, - Quiz to train Your knowledge - Daily Quests for extra points - Leaderboard - compete with Players from all Around the World, - Achievements to collect - Unlock new Paintings and create Your own Gallery, - Collection of Backgrounds - choose the best for Your jigsaw, - Soothing SFX and Classical Music to relax Your mind, relieve stress or prepare kids to sleep, Just relax and cherish great art at home. If You have any issues with World of Art - learn with a Jigsaw Puzzle, please post a comment. Your feedback matters. Thanks to great institutions and Museums like Europeana, the MET, NGA or MNK, it`s possible to share these masterpieces with You. Support open access to art and projects like this game. Enjoy and All the best!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1303670/header.jpg?t=1657564207",
    "Price": 12.99,
    "Developers": "NowakGames",
    "Publishers": "NowakGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1303670/ss_e841052cc474caf05628d38f965219231573cd81.1920x1080.jpg?t=1657564207,https://cdn.akamai.steamstatic.com/steam/apps/1303670/ss_b649e3ccc18f3fdb960a518053260416e421db94.1920x1080.jpg?t=1657564207,https://cdn.akamai.steamstatic.com/steam/apps/1303670/ss_9a8980c1e087225f0333704f8b38002ea16c96a7.1920x1080.jpg?t=1657564207,https://cdn.akamai.steamstatic.com/steam/apps/1303670/ss_6acf705edba31e69b758457f3a1fbee2cd386462.1920x1080.jpg?t=1657564207,https://cdn.akamai.steamstatic.com/steam/apps/1303670/ss_beb0786bcffda212ce22b9a0a8c3bdd5ec5feee6.1920x1080.jpg?t=1657564207,https://cdn.akamai.steamstatic.com/steam/apps/1303670/ss_f9d2f588fae059487aef44c59b648d4ffb063459.1920x1080.jpg?t=1657564207,https://cdn.akamai.steamstatic.com/steam/apps/1303670/ss_6b7152c8b9a46f6c1f07f1f57a07487f600d33c1.1920x1080.jpg?t=1657564207,https://cdn.akamai.steamstatic.com/steam/apps/1303670/ss_23ba890224216bd726e6c5ef30b5d940448d705f.1920x1080.jpg?t=1657564207,https://cdn.akamai.steamstatic.com/steam/apps/1303670/ss_3175c365dc911aeea5a45ef8f5cfbf7479dff29d.1920x1080.jpg?t=1657564207",
    "Slug": "world-of-art-learn-with-jigsaw-puzzles",
    "Meta Title": "World of Art - learn with Jigsaw Puzzles: Jun 18, 2020, N...",
    "Meta Description": "Looking for information on World of Art - learn with Jigsaw Puzzles? Check out the release date (Jun 18, 2020), developer insights from NowakGames, and ...",
    "Alt Text Image": "Official header image for World of Art - learn with Jigsaw Puzzles game - Steam 1303670",
    "Canonical URL": "https://gusku.site/game/world-of-art-learn-with-jigsaw-puzzles",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"World of Art - learn with Jigsaw Puzzles\", \"description\": \"Looking for information on World of Art - learn with Jigsaw Puzzles? Check out the release date (Jun 18, 2020), developer insights from NowakGames, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"NowakGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NowakGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1303670/header.jpg?t=1657564207\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}