{
    "AppID": 1423080,
    "Name": "异世界无厘头生活2",
    "Release date": "Apr 22, 2022",
    "About the game": "Approximate plot You traveled to the other world a sexy big sister woke you up. Tell you become the other world of the brave village recently attacked by the Slime You need to protect the village through their own ingenuity to defeat the Slime Daemon. How to play Make the right choice by talking to the game characters Collect props in the scene and buy them from the sage to make good use of them Drive the plot development to finally defeat the Slime. Game Tips 1 at the beginning of the dialogue with the goddess into the trial maid link trial to get the whip 2 at home to get apples, applesauce, and perfume (items will have a circle of yellow light very easy to find) 3 sleep to see Sukur to take out the apple to enter the plot to use the applesauce it applesauce into an empty cup 4 in Sukur here to enter the store to buy defense and money 5 wake up and choose the artifact to go to Luna's house for the first time choose to praise Luna's father for the second time choose to send perfume to enter the plot 6 stay overnight and enter the plot using empty cups filled with milk to go home you can get the axe and enter the milk plot 7 sleep to see Sukur to buy money and artifact design drawings wake up back to their rooms 8 then choose to play go to the brothel to choose heavy small and pro flavor big into the plot to get a vibrator and wire and then go home 9 home and click on the synthesis scroll to synthesize the artifact 10 synthesis after you can go to defeat the Slime (If you accidentally die, you can return to Sukur where to let the time back to the morning resurrection but this is a limit to the number of resurrections) Characters Luna your exclusive maid big breasts natural dull you want to do what you want Goddess gentle big sister to send you benefits Great Sage Sukur your brain in the old grandfather to send you props pointing you to defeat the Slime Game Features Strange prop usage You can touch the character's breast when talking",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1423080/header.jpg?t=1658480880",
    "Price": 1.99,
    "Developers": "人肉馒头",
    "Publishers": "人肉馒头",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1423080/ss_9033a107aafea1789b447c78bcb4758fb9692a80.1920x1080.jpg?t=1658480880,https://cdn.akamai.steamstatic.com/steam/apps/1423080/ss_0843d256db25a1452e0ca069dcf12705fb2f118d.1920x1080.jpg?t=1658480880,https://cdn.akamai.steamstatic.com/steam/apps/1423080/ss_069334a8a0acc5a84e436030de6efcd498ab3aff.1920x1080.jpg?t=1658480880,https://cdn.akamai.steamstatic.com/steam/apps/1423080/ss_31380cf8ff64f45cb8c08de543a8e54f93c45031.1920x1080.jpg?t=1658480880,https://cdn.akamai.steamstatic.com/steam/apps/1423080/ss_5ac7ce3c06efe8168112f611b82894d49fa250a6.1920x1080.jpg?t=1658480880",
    "Slug": "2",
    "Meta Title": "异世界无厘头生活2: Apr 22, 2022, 人肉馒头 and Full Overview",
    "Meta Description": "Looking for information on 异世界无厘头生活2? Check out the release date (Apr 22, 2022), developer insights from 人肉馒头, and a complete game summary.",
    "Alt Text Image": "Official header image for 异世界无厘头生活2 game - Steam 1423080",
    "Canonical URL": "https://gusku.site/game/2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5f02\\u4e16\\u754c\\u65e0\\u5398\\u5934\\u751f\\u6d3b2\", \"description\": \"Looking for information on \\u5f02\\u4e16\\u754c\\u65e0\\u5398\\u5934\\u751f\\u6d3b2? Check out the release date (Apr 22, 2022), developer insights from \\u4eba\\u8089\\u9992\\u5934, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4eba\\u8089\\u9992\\u5934\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u4eba\\u8089\\u9992\\u5934\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1423080/header.jpg?t=1658480880\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}