{
    "AppID": 1563840,
    "Name": "蚂蚁模拟器（Ant simulator）",
    "Release date": "Mar 31, 2021",
    "About the game": "Ant Simulator is a game that simulates the walking of an Ant. In this game, you will act as a stubborn Ant and keep moving forward. From the operation of this game is to be born in a daze, so it is simple and distinctive, after a while familiar with, you can operate the ant forward with one hand.Now turn on your music player, press CTRL +W, experience to be an ant, with the company of the scenery along the way to empty your mind! Disclaimer: This game isn't fun, because it doesn't have any game values other than looking at the landscape, and you don't have to think about anything in the game except manipulating ants to keep going. Game Features act as an ant act as an ant experience an ant, keep moving As an ant, you can climb or hang on branches To be an ant, a BUG may cause an ant to twist, just as the ant's limited brain does not understand the complexity of nature, so there is no repair Game background Dear human, I'm an ant from a big tree next to your house. My job is worker ant, and I'm also a Diplomatic envoys. You can call me Sean. I'll tell you my intention right away, because the language difference between us may offend you. For those things I don't understand, I apologize in advance (if you don't need my apology and feel that my apology is offensive to you, I firmly withdraw my apology). I came here because you like to squat next to our ant nest and disturb our kingdom team with branches, leaves, water, mineral water bottles, potato fried food and so on. Many worker ants have reported your existence. In private, the Kingdom even rumors that there are 'more terrible than ant eaters' trolls living there. As you did not know before, we also failed to fulfill our obligation to notify. After our queen ant command meeting, I conveyed the queen ant's original words, ' assigned worker ant Sean to learn computer, master human language, communicate with foreign countries, repair pipes, feed young ants, carry food, clean up debris and other work, and chose to forgive human previous harm. ” After systematic study, I have mastered computer language for the first time. Controlled by the command of the queen ant, I wrote this game, hoping to let you understand our difficulties, abide by the principle of friendly communication, survive together and help each other. You can buy this game as the beginning of friendly communication, then, we will show you enough performance. -- ant Sean",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1563840/header.jpg?t=1617243820",
    "Price": 0.99,
    "Developers": "doger的游戏小屋",
    "Publishers": "doger的游戏小屋",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1563840/ss_751adaddd27fd54b3c9e5a43922f17a0440b81f0.1920x1080.jpg?t=1617243820,https://cdn.akamai.steamstatic.com/steam/apps/1563840/ss_c3c8f3e147f31e15396e9e1b2c4a69ffe10495d6.1920x1080.jpg?t=1617243820,https://cdn.akamai.steamstatic.com/steam/apps/1563840/ss_06ae969a2c2503c37d82b8f7f233f0068e1bc12f.1920x1080.jpg?t=1617243820,https://cdn.akamai.steamstatic.com/steam/apps/1563840/ss_d53114e3379a20a9d530694cd4ef73c3634cd4e4.1920x1080.jpg?t=1617243820,https://cdn.akamai.steamstatic.com/steam/apps/1563840/ss_e62256296053baaeb82b9e058187905936e85ce7.1920x1080.jpg?t=1617243820,https://cdn.akamai.steamstatic.com/steam/apps/1563840/ss_34ffa6b3e04b0a86a96eebfbdba0671b9d6bf637.1920x1080.jpg?t=1617243820",
    "Slug": "ant-simulator",
    "Meta Title": "蚂蚁模拟器（Ant simulator）: Mar 31, 2021, doger的游戏小屋 and Full O...",
    "Meta Description": "Looking for information on 蚂蚁模拟器（Ant simulator）? Check out the release date (Mar 31, 2021), developer insights from doger的游戏小屋, and a complete game summ...",
    "Alt Text Image": "Official header image for 蚂蚁模拟器（Ant simulator） game - Steam 1563840",
    "Canonical URL": "https://gusku.site/game/ant-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u8682\\u8681\\u6a21\\u62df\\u5668\\uff08Ant simulator\\uff09\", \"description\": \"Looking for information on \\u8682\\u8681\\u6a21\\u62df\\u5668\\uff08Ant simulator\\uff09? Check out the release date (Mar 31, 2021), developer insights from doger\\u7684\\u6e38\\u620f\\u5c0f\\u5c4b, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"doger\\u7684\\u6e38\\u620f\\u5c0f\\u5c4b\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"doger\\u7684\\u6e38\\u620f\\u5c0f\\u5c4b\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1563840/header.jpg?t=1617243820\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}