{
    "AppID": 1640930,
    "Name": "BeeFense BeeMastered",
    "Release date": "Jun 24, 2021",
    "About the game": "The bees are back...bigger, bolder, better! Protect the bees from the invasion of hostile hornets by building an effective defense: a real BeeFense! Command your hardworking bees to build defenses that you can customize using honeydew, the world's most valuable resource. The ill-tempered hornet queen Hornette is not only aggressive, but also genetically modified and will stop at nothing and no one. The bee colony depends on your strategy. In the remastered version of the successful mobile game, the bees will not only have to deal with the Hornet Queen and her army, but will also encounter the evil General Hornus and his henchmen in six brand new levels. Join the bee people on their journey to the land of fireflies and help them against the general's troops. As a master of light and darkness, you'll expand your repertoire of weapons against the nasty invaders with flares and other useful abilities. In BeeFense - BeeMastered, the entire graphics have been reworked from the ground up without losing the charm of the mobile game. All models and textures are now in FUll HD and in a completely new light atmosphere. Rounded off by the new animations, all the characters and the world in which they move seem even more alive. Together with your army, plunge into numerous battles, plan the construction of your defenses and protect your people on the long, dangerous journey to a remote land. BeeFense - BeeMastered is our attempt to point out one of the most important issues in the animal world with this small, not entirely serious tower defense. Bees especially need to be protected from the dangers they suffer at the hands of humans. NEW LEVEL: in a total of 26 levels, 6 of which are brand new designs, we tell the story about the bee colony of queen bee Nectarine. NEW TURMUPGRADES: with the light ammunition you can now uncover enemies that would otherwise be invisible in the shadows NEW GRAPHICS: experience the world of BeeFense in a completely overhauled graphic design FIGHT: Challenging tower defense gameplay with an exciting story around the journey of the bee colony. BUILD: Customize your defense strategy using a total of 12 different tower properties! ADMINISTRATE: Collect different resources with your bees to supply your colony and be ready for the next attack. DEVELOP: Decide for yourself which upgrades you want to use to improve your defenses. SPECIAL TASKS: Face specific challenges in each level to get even more of the precious honeydew.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1640930/header.jpg?t=1636710942",
    "Price": 9.99,
    "Developers": "ByteRockers' Games",
    "Publishers": "ByteRockers' Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1640930/ss_ddcf1794a17977039c7a5e1773f1edb65b1cefbe.1920x1080.jpg?t=1636710942,https://cdn.akamai.steamstatic.com/steam/apps/1640930/ss_63c099b79457fa3bc435153c62c17d0dd3b5aaf2.1920x1080.jpg?t=1636710942,https://cdn.akamai.steamstatic.com/steam/apps/1640930/ss_6d45671c40725097e2ebf66e14899a516c87345d.1920x1080.jpg?t=1636710942,https://cdn.akamai.steamstatic.com/steam/apps/1640930/ss_119840a31ae41e78e391d7929821a1ae3eee438f.1920x1080.jpg?t=1636710942,https://cdn.akamai.steamstatic.com/steam/apps/1640930/ss_fcff8723bf79ece7fff9c82de5fa606beb823cf2.1920x1080.jpg?t=1636710942,https://cdn.akamai.steamstatic.com/steam/apps/1640930/ss_a5a9f1be32f568d293285f224a67dfa3c7ab1f75.1920x1080.jpg?t=1636710942,https://cdn.akamai.steamstatic.com/steam/apps/1640930/ss_3e1e3deccaaca018464a30b8e6cfab28c545a202.1920x1080.jpg?t=1636710942",
    "Slug": "beefense-beemastered",
    "Meta Title": "BeeFense BeeMastered: Jun 24, 2021, ByteRockers' Games an...",
    "Meta Description": "Looking for information on BeeFense BeeMastered? Check out the release date (Jun 24, 2021), developer insights from ByteRockers' Games, and a complete g...",
    "Alt Text Image": "Official header image for BeeFense BeeMastered game - Steam 1640930",
    "Canonical URL": "https://gusku.site/game/beefense-beemastered",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BeeFense BeeMastered\", \"description\": \"Looking for information on BeeFense BeeMastered? Check out the release date (Jun 24, 2021), developer insights from ByteRockers' Games, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 24, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"ByteRockers' Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ByteRockers' Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1640930/header.jpg?t=1636710942\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}