{
    "AppID": 1642620,
    "Name": "COLLECTION of SaGa FINAL FANTASY LEGEND",
    "Release date": "Oct 21, 2021",
    "About the game": "Experience the origins of the SaGa series with the COLLECTION of SaGa FINAL FANTASY LEGEND, the first complete port of these hugely popular titles. This collection includes new enhancements like high-speed mode, and the ability to switch between a vertical or horizontal screen layout. Enjoy the the three original Game Boy titles SaGa, SaGa 2 and SaGa 3 (released as THE FINAL FANTASY LEGEND, FINAL FANTASY LEGEND II and FINAL FANTASY LEGEND III in North America) in one package! Titles Included THE FINAL FANTASY LEGEND The memorable first instalment of the SaGa series, which sold over a million units. Choose from the human, mutant or monster classes for the protagonist, and enjoy the special progression system which comes with each class - including the notable monster progression system, which was ground-breaking at the time. With an eye fixed firmly on Paradise at the top of the tower, the protagonist fights strong enemies awaiting them in a diverse world, as they continue their journey towards the top of the tower. FINAL FANTASY LEGEND II The second instalment of the series, which gained popularity through its refined gameplay system and journey through a diverse world. Experience the refined and improved gameplay with a new class, Robot, and appearances from guest characters. The adventure unfolds surrounding the relics of the gods – MAGI. FINAL FANTASY LEGEND III A unique story which travels across time and features the first levelling system in the series. Featuring six classes to choose from, as well as the ability to transform into different classes. An adventure which spans the past, present and future unfolds with Talon, a fighter aircraft which can dash through time. KEY FEATURES High Speed Mode: Change your movement speed and the message speed to high-speed. Screen settings: Freely switch the screen resolution and display settings between “horizontal” or “vertical” mode. 4K resolution is also supported. Switch languages: Switch between Japanese and English. Switch to Japanese and play SaGa, SaGa 2 and SaGa 3, the versions of the games released outside of Japan. --------------------------------------------- *These titles have largely been faithfully replicated in their original forms, but several changes have been made to meet evolving cultural and social norms.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1642620/header.jpg?t=1634833920",
    "Price": 19.99,
    "Developers": "Square Enix,Racjin",
    "Publishers": "Square Enix",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1642620/ss_7e01555f7c5158fe66de41175d3cfdf419713414.1920x1080.jpg?t=1634833920,https://cdn.akamai.steamstatic.com/steam/apps/1642620/ss_e0d4526fbba2648ae61c00dfd43167c79493eb0d.1920x1080.jpg?t=1634833920,https://cdn.akamai.steamstatic.com/steam/apps/1642620/ss_8358ee4d80dca62e801ff325f71377984267ccbe.1920x1080.jpg?t=1634833920,https://cdn.akamai.steamstatic.com/steam/apps/1642620/ss_b4995268d870ab5fc0dd6c9145062f6811672300.1920x1080.jpg?t=1634833920,https://cdn.akamai.steamstatic.com/steam/apps/1642620/ss_042cdeedc2dbd763945b96ad9b7fb6a5c8bcc70f.1920x1080.jpg?t=1634833920,https://cdn.akamai.steamstatic.com/steam/apps/1642620/ss_a8b7a08cf7084f8ee07c7a9cae2b3d3b4f61bd9d.1920x1080.jpg?t=1634833920",
    "Slug": "collection-of-saga-final-fantasy-legend",
    "Meta Title": "COLLECTION of SaGa FINAL FANTASY LEGEND: Oct 21, 2021, Sq...",
    "Meta Description": "Looking for information on COLLECTION of SaGa FINAL FANTASY LEGEND? Check out the release date (Oct 21, 2021), developer insights from Square Enix,Racji...",
    "Alt Text Image": "Official header image for COLLECTION of SaGa FINAL FANTASY LEGEND game - Steam 1642620",
    "Canonical URL": "https://gusku.site/game/collection-of-saga-final-fantasy-legend",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"COLLECTION of SaGa FINAL FANTASY LEGEND\", \"description\": \"Looking for information on COLLECTION of SaGa FINAL FANTASY LEGEND? Check out the release date (Oct 21, 2021), developer insights from Square Enix,Racji...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 21, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Square Enix,Racjin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Square Enix\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1642620/header.jpg?t=1634833920\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}