{
    "AppID": 1052440,
    "Name": "Croixleur Sigma - Deluxe Edition",
    "Release date": "Nov 18, 2019",
    "About the game": "High-speed hack &amp; slash action! Wielding magical blades, four girls must fight back the encroaching waves of monsters in this exhilarating hack-and-slash action game! Mix and match four different weapons and find the fighting style that best suits you as you slice your way through various types of battle! Story Mode focuses on the girls' charming friendship, and is fully voiced in Japanese. You can also hack &amp; slash your heart out in Score Attack, Challenge Mode, weapon-switching Dungeon Mode, and many more! Includes a wealth of accessories such as Cat Ears, Spectacles, and Headphones, to make your gal look stylish and enhance her skills in battle! LUCREZIA CV: Yuka Iguchi A 17-year-old girl, and member of the royal family. Her nickname is 'Luc'. A bright and straight-shooting young lady, with Luc, what you see is what you get. She is also a genius with magic swords. Since her style of combat resembles a whirlwind of flames, the Queen scolded her for being so reckless while also bestowing upon her the title of 'Vermilion Whirlwind'. Her sense of justice is her own greatest nemesis, and she often causes trouble for others. However, she always seems to end up making everyone happy. She began to part her long hair in two when she was five years old, ever since her childhood friend Fran started looking after her. She keeps the fact that she stole the idea from Fran's own hairstyle a secret. FRANCESCA CV: Ayumi Fujimura A student of the knight house Shelta. Her nickname is 'Fran'. A close friend of Luc since birth, her attitude began to change in her mid-teens... Ever since they were set up to fight in a joint combat trial at the Nito Towers, she has continued to speak Luc in a distant and condescending manner. Fran is known by most to be brilliant, reticent, passive, and pure. Her personality causes those around her to semi-affectionately refer to her as 'Princess', but she hates the nickname, saying it's embarrassing. KATERINA CV: Haruka Terui Although having spent her life as the younger sister of the Queen, she just can't seem to get used to the 'virtuous', elegant world of nobility. Katerina is not very good at making light conversation with other girls her age, nor does she enjoy eating candy in the school dorm with everyone else. She much prefers talking to older people and shamans from other lands. She has some strange hobbies. She may not be aware of it herself, but she actually has quite the heroic side, and is willing to throw herself at whatever bad guys may be posing a danger to the people she meets on her adventures. Eventually, she learns the truth behind the world-changing 'incident' that was foretold and said to mark the end of the Queendom... SARA-ANNIKA CV: Satomi Akesaka A black-haired girl hailing from Niyan, a country comprising many islands, far east of the Irance Queendom. Her father is a shaman and an instructor in the ways of the sword, and he also works as the Queen's teacher. Annika actually possesses some rare and impressive shamanic talents, but she is barely aware of them herself. Because she has difficulty talking to people unlike herself, the other female students treated her like an almost mystical being. Annika felt a deep-seated loneliness due to this treatment, but when the 7-year-old Katerina treated her not only as an equal but as a friend the first time they met, this loneliness was mostly allieved. VARIOUS BATTLE STYLES Mix and match four different weapons and find the fighting style that best suits you as you slice your way through various types of battle. Story Mode focuses on the girls' charming friendship, and is fully voiced in Japanese. CUSTOMIZATION Customize each of your characters and get your hands on all sorts of enhancements and boosts. SPECIAL MOVES Take advantage of some awesome special attacks, unique to each character. COMMUNICATION MODE",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1052440/header.jpg?t=1577433020",
    "Price": 19.99,
    "Developers": "souvenir circ.",
    "Publishers": "PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1052440/ss_0d6648a54a32fb8c1893a70878ede517516ece0d.1920x1080.jpg?t=1577433020,https://cdn.akamai.steamstatic.com/steam/apps/1052440/ss_da1add950b27d1390c6e1c10768791ef405f0c00.1920x1080.jpg?t=1577433020,https://cdn.akamai.steamstatic.com/steam/apps/1052440/ss_9b05c860b98ab225bfc6bbcad00d13a62247cad3.1920x1080.jpg?t=1577433020,https://cdn.akamai.steamstatic.com/steam/apps/1052440/ss_ea5f357fe9fede006df2ecf504b0fd063ef4152e.1920x1080.jpg?t=1577433020,https://cdn.akamai.steamstatic.com/steam/apps/1052440/ss_fe331906f7c521eb6ff1a541d6da03a84e11e89b.1920x1080.jpg?t=1577433020,https://cdn.akamai.steamstatic.com/steam/apps/1052440/ss_3c56943f29412b25be036b532f8d8b6f326dae05.1920x1080.jpg?t=1577433020,https://cdn.akamai.steamstatic.com/steam/apps/1052440/ss_874abe6daa3f0776071b977207f529560fdc0345.1920x1080.jpg?t=1577433020,https://cdn.akamai.steamstatic.com/steam/apps/1052440/ss_c3b228a4afc5bf6e2b2d8d12b1bd2b8c39c4a832.1920x1080.jpg?t=1577433020,https://cdn.akamai.steamstatic.com/steam/apps/1052440/ss_031f640b25901f688bf073b384c50e812c111810.1920x1080.jpg?t=1577433020,https://cdn.akamai.steamstatic.com/steam/apps/1052440/ss_15565585d7d6b21e23d62a8dbbc91746ff371359.1920x1080.jpg?t=1577433020,https://cdn.akamai.steamstatic.com/steam/apps/1052440/ss_3e6ca5c3cfb15e1ae3b0ce36c55f1d7128ec1995.1920x1080.jpg?t=1577433020",
    "Slug": "croixleur-sigma-deluxe-edition",
    "Meta Title": "Croixleur Sigma - Deluxe Edition: Nov 18, 2019, souvenir ...",
    "Meta Description": "Looking for information on Croixleur Sigma - Deluxe Edition? Check out the release date (Nov 18, 2019), developer insights from souvenir circ., and a co...",
    "Alt Text Image": "Official header image for Croixleur Sigma - Deluxe Edition game - Steam 1052440",
    "Canonical URL": "https://gusku.site/game/croixleur-sigma-deluxe-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Croixleur Sigma - Deluxe Edition\", \"description\": \"Looking for information on Croixleur Sigma - Deluxe Edition? Check out the release date (Nov 18, 2019), developer insights from souvenir circ., and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 18, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"souvenir circ.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1052440/header.jpg?t=1577433020\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}