{
    "AppID": 1138800,
    "Name": "Dark Elf's Adventure",
    "Release date": "Sep 4, 2019",
    "About the game": "10 years after the end of the Dark Elf War, Tanya of the Dark Elf was an adopted daughter living with her human mother. There's a main story about what this power does to her. The procedure leads to 10 different endings. The story proceeds through prostitution and fighting at the player's discretion. Which ending is the official history of Tanya? This judgment should be left to the player's judgment. *Recommended a person who wants to fight (Adoption of Sexual Harassment Dispatch Battle) a person who loves sexual harassment and prostitution (Let's earn money through sexual harassment and prostitution in the city.) Pregnant women (If it comes out, you may be pregnant, but it can be prevented with a female condom.) *Battle The battle scene uses a side view. Enemy characters are divided into monsters and human types, and monsters only have sexual harassment. People tend to be sexually harassed and sexually assaulted. If you have sex, If you don't have a female condom, there is a possibility that you get pregnant. If you become pregnant, you will be restricted in your behavior, so let's give birth at a hospital. You need money when you give birth, but let's earn the cost of giving birth through prostitution. *Defeat Monsters and human enemies each have a defeat scene. If you lose, your money goes down and you're just put back home, so let's fight hard. *You don't have to lose on purpose because the losing scene is the game clear, the main part and the reminiscence scene are released. *Sexual harassment Sexual harassment occurs when you come into contact with your uncle. There are 10 kinds of sexual harassment, and you can find it by looking around the city. There are no restrictions on this, so you can be sexually harassed right after the game starts. *Prostitution Prostitution is the act of performing an event, which leads to sexual desire and the appearance of an uncle in the city, so people call out to prostitute themselves. There are 13 kinds of prostitution. I think sexual harassment and prostitution can release all events relatively easily. When the values such as the degree of sexual intercourse and acts in the chest increase, the gasping voice and expression change. Sexual harassment and prostitution can be practiced by ordinary people, so I often work as prostitute and save money. Get ready and go on a quest. *Costume When it comes to prostitution and sexual harassment, the clothes you wear are reflected. You will be able to have sexual harassment and prostitution in a new mood by buying costumes. *Ending There are 10 kinds of endings. You have a choice just before the end. *25 basic CG images (There are many differences due to changes in facial expressions and costumes.) *Manuals and strategies are included in the game folder.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1138800/header.jpg?t=1570580144",
    "Price": 13.99,
    "Developers": "Uzura Studio",
    "Publishers": "Uzura Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1138800/ss_ca6cb0a33254020e4e2722124642ef08ea30b4d3.1920x1080.jpg?t=1570580144,https://cdn.akamai.steamstatic.com/steam/apps/1138800/ss_fb0aa3353f9bab27e30fa0336b30dc4e3ba3814c.1920x1080.jpg?t=1570580144,https://cdn.akamai.steamstatic.com/steam/apps/1138800/ss_78d13e875eb72b15b0f58234dc198d2672fd7a05.1920x1080.jpg?t=1570580144,https://cdn.akamai.steamstatic.com/steam/apps/1138800/ss_1452e7bbfde452458cc38c55827b9b519505e5e6.1920x1080.jpg?t=1570580144,https://cdn.akamai.steamstatic.com/steam/apps/1138800/ss_8c6623dd83e9c58683050f8c70219dba14d44efa.1920x1080.jpg?t=1570580144,https://cdn.akamai.steamstatic.com/steam/apps/1138800/ss_b7e6c5f9fe60d09460df8432f80ea9533cd269da.1920x1080.jpg?t=1570580144,https://cdn.akamai.steamstatic.com/steam/apps/1138800/ss_68e86d8c0ca0d65129d5e77117c863191fbbc7f1.1920x1080.jpg?t=1570580144,https://cdn.akamai.steamstatic.com/steam/apps/1138800/ss_bbf2efc895578faf889e712c7e6438b469330f76.1920x1080.jpg?t=1570580144,https://cdn.akamai.steamstatic.com/steam/apps/1138800/ss_bdee0cbd899ec7686c6027262f736b45dcffa457.1920x1080.jpg?t=1570580144,https://cdn.akamai.steamstatic.com/steam/apps/1138800/ss_57195e04b9cf18a0a72c283edff02a18cccb9e73.1920x1080.jpg?t=1570580144",
    "Slug": "dark-elf-s-adventure",
    "Meta Title": "Dark Elf's Adventure: Sep 4, 2019, Uzura Studio and Full ...",
    "Meta Description": "Looking for information on Dark Elf's Adventure? Check out the release date (Sep 4, 2019), developer insights from Uzura Studio, and a complete game sum...",
    "Alt Text Image": "Official header image for Dark Elf's Adventure game - Steam 1138800",
    "Canonical URL": "https://gusku.site/game/dark-elf-s-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dark Elf's Adventure\", \"description\": \"Looking for information on Dark Elf's Adventure? Check out the release date (Sep 4, 2019), developer insights from Uzura Studio, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Uzura Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Uzura Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1138800/header.jpg?t=1570580144\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}