{
    "AppID": 1605220,
    "Name": "Dune: Spice Wars",
    "Release date": "Apr 26, 2022",
    "About the game": "A 4X real-time strategy game from the developers of the critically acclaimed Northgard. Set in Frank Herbert’s groundbreaking Dune universe, you must lead your faction and battle for control and dominance over the harsh desert planet of Arrakis. Spice is the most valuable resource in the universe. The spice extends life, expands consciousness, and makes interstellar travel possible. Found only on Arrakis, it is sought by the most influential forces in the universe. Play as one of several factions, including House Atreides, House Harkonnen, the Smugglers, and the native Fremen, and compete for power over Dune and the spice. Scan the landscape for wormsign or risk losing your troops and spice harvesters to titanic sandworms who will burst through the dunes to swallow and devour them whole. Crush your opponents in combat, best them through political intrigue, and undermine them with your network of illusive spies. Experience the unique Dune universe, one of the most influential sci-fi settings ever created. Lead your faction to victory with iconic characters, such as Duke Leto Atreides, the Baron Vladimir Harkonnen, Esmar Tuek, and Liet Kynes. Stay alert as opposing factions seek to gain the upper hand and the planet itself threatens with withering deserts, huge storms, and consuming sandworms. Balance open warfare, subterfuge, political influence, and economic supremacy to prevail and gain control over the most important planet in the universe! Use secretive agents to sabotage the plans of your opponents. Vote on political resolutions in the Landsraad to further your strategy. Explore Dune with ornithopters to discover resources, villages, and points of interest. Expand with your troops to take control of more and more regions. Exploit the resources through buildings and spice harvesters to dominate the economy. Exterminate your enemies with a strong military but beware as outright aggression can have high political repercussions. Take the path of honor and political power as the respected House Atreides, or choose violence and devious plots as House Harkonnen. Become master of desert survival and guerilla tactics with the native Fremen and gain influence through shady deals and infiltration as the Smugglers. Tailor each faction’s existing strengths and weaknesses by selecting your councilors. With the Atreides’ legendary swordmaster Duncan Idaho at your side, expansion and combat prowess are improved. Gain power over people and information with the aid of Chani Kynes of the Fremen, or overwhelm with military might with Rabban of the Harkonnens. Band together in 2v2 matches or face each other in a free-for-all of up to four players. Tailor the parameters of your multiplayer match to your preferences, including AI difficulty, map size, victory conditions, and the aggression of sandworms, storms, and Sietches. Team up and try different faction combinations to find synergies and dominate Arrakis. A beginning is the time for taking the most delicate care... The game will be updated and expanded throughout Early Access, based on your crucial feedback.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1605220/header_alt_assets_0.jpg?t=1657184059",
    "Price": 29.99,
    "Developers": "Shiro Games",
    "Publishers": "Funcom,Shiro Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1605220/ss_3fbbda5819d77021ea40e5b6188c75a7ebbc95fd.1920x1080.jpg?t=1657184059,https://cdn.akamai.steamstatic.com/steam/apps/1605220/ss_616e5b519e83bc7e42c492fad530c1c0a76466ff.1920x1080.jpg?t=1657184059,https://cdn.akamai.steamstatic.com/steam/apps/1605220/ss_f116246077b8037d53838c1f8c1a9526e0aec0a9.1920x1080.jpg?t=1657184059,https://cdn.akamai.steamstatic.com/steam/apps/1605220/ss_4faffc0d2b7daa9180a21d0f7f3b42d34d8def26.1920x1080.jpg?t=1657184059,https://cdn.akamai.steamstatic.com/steam/apps/1605220/ss_3ca18a020faa0d85fedba2154012dd2c2d0af03d.1920x1080.jpg?t=1657184059,https://cdn.akamai.steamstatic.com/steam/apps/1605220/ss_efaee2e37c1fb29fddadb12333ccc019537d755a.1920x1080.jpg?t=1657184059,https://cdn.akamai.steamstatic.com/steam/apps/1605220/ss_6a7f7f9184476fdb97bb02871302a4c3ad5035a5.1920x1080.jpg?t=1657184059,https://cdn.akamai.steamstatic.com/steam/apps/1605220/ss_820acae51753f5b1bb1ba2270300cadf77e92889.1920x1080.jpg?t=1657184059,https://cdn.akamai.steamstatic.com/steam/apps/1605220/ss_9485d78ea26f55e8719b2e3ce604910edbcd3f90.1920x1080.jpg?t=1657184059,https://cdn.akamai.steamstatic.com/steam/apps/1605220/ss_ba3850751c6e17e7b6fb7545e2d9c31aa300bf72.1920x1080.jpg?t=1657184059,https://cdn.akamai.steamstatic.com/steam/apps/1605220/ss_76cbf1d9b279983a10900d50f7064c9703ad31e5.1920x1080.jpg?t=1657184059,https://cdn.akamai.steamstatic.com/steam/apps/1605220/ss_2bc221ff784f99548d345e171b1cb236fecb22ac.1920x1080.jpg?t=1657184059",
    "Slug": "dune-spice-wars",
    "Meta Title": "Dune: Spice Wars: Apr 26, 2022, Shiro Games and Full Over...",
    "Meta Description": "Looking for information on Dune: Spice Wars? Check out the release date (Apr 26, 2022), developer insights from Shiro Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Dune: Spice Wars game - Steam 1605220",
    "Canonical URL": "https://gusku.site/game/dune-spice-wars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dune: Spice Wars\", \"description\": \"Looking for information on Dune: Spice Wars? Check out the release date (Apr 26, 2022), developer insights from Shiro Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Shiro Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Funcom,Shiro Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1605220/header_alt_assets_0.jpg?t=1657184059\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}