{
    "AppID": 25930,
    "Name": "East India Company",
    "Release date": "Jul 31, 2009",
    "About the game": "In East India Company, players will enjoy building the World's most powerful trading empire &amp; engaging in vigorous battles in both single player &amp; multiplayer modes, all within a breathtaking cinematic game environment. Players will fight, manage, and rule nations from Europe to the Far East with eight nationalities to chose from: British, Dutch, French, Danish, Portuguese, Swedish, Spanish, and the Holy Roman Empire. Starting modestly, you will build your fleet, establish connections to far away countries, and keep the rivaling nations at bay. Choose from a wide array of ship classes, including a variety of transport and military vessels. Create diverse fleets and assign each of them specific trading routes. Control and upgrade well situated ports as you form your strategy for domination. Conflicts and wars are inevitable. When hostile fleets engage each other, the spectacular naval battles are fought from a real-time tactical level. Devastating broadsides are fired with a deafening roar and cannon balls tear through enemy ships and their crew. For greater tactical depth, command your ship and give independent orders to each of your fleets. Fight against the other European powers to create a trading empire that will rule above all others in this groundbreaking strategy war game! Features: Spectacular cinematic &amp; epic naval battles 2 Command Modes: Give orders to all your ships in RTS or take the helm of a single ship in Direct Command-mode. Unique combination of war &amp; trading State of the art diplomacy AI 8 playable nations: England, France, Holland, Portugal, Denmark, Sweden, Spain &amp; the Holy Roman Empire Over 10 realistic ship types; from small sloops and cutters to East Indiaman and warships Realistic yet fast-paced naval combat Hire fleet commanders who will gain new skills &amp; increase the abilities of your fleets Take over ports &amp; protect your shipping routes to create largest trading empire Multiplayer (Internet or LAN): Up to 8 simultaneous players Player statistics tracked on the EIC game server Several game modes with single &amp; team approach Raise your ranking by thwarting your opponents Head-to-Head missions are a true test of strategic skill FIGHT! Use Military might to build your trading empire Command ships &amp; fleets independently Wage war on the vast open sea Sink your rivals' ship or board them to take control MANAGE! Hire fleet commanders to boost your fleet's abilities User commander skills to give you an edge in battles Upgrade your ports with new buildings Buy &amp; Sell goods Establish profitable trading routes Open diplomatic relations or declare War Negotiate tense political situation RULE! Lead the most powerful company in history Take over colonies &amp; expand your empire Use well modeled diplomacy to exert your power Conquer strategic ports Accomplish missions ordered by your company or the Crown",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/25930/header.jpg?t=1475857967",
    "Price": 9.99,
    "Developers": "Nitro Games",
    "Publishers": "Nitro Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/25930/ss_a0287ff15c7935e12c88ba3123cae4b181e1d2ea.1920x1080.jpg?t=1475857967,https://cdn.akamai.steamstatic.com/steam/apps/25930/ss_c03252bbafc12a5766d65c724595e0db6af9df06.1920x1080.jpg?t=1475857967,https://cdn.akamai.steamstatic.com/steam/apps/25930/ss_0410e58f0b7440b74e78a7642829f22f614971c9.1920x1080.jpg?t=1475857967,https://cdn.akamai.steamstatic.com/steam/apps/25930/ss_b1059e0b4db1c2a0363132b745c4f88468ce9a88.1920x1080.jpg?t=1475857967,https://cdn.akamai.steamstatic.com/steam/apps/25930/ss_ef051304293e2bef1cfe2b2803fb72b4449ad95d.1920x1080.jpg?t=1475857967,https://cdn.akamai.steamstatic.com/steam/apps/25930/ss_c35b34b61b50ce4fb80969afd073607ba48ee776.1920x1080.jpg?t=1475857967,https://cdn.akamai.steamstatic.com/steam/apps/25930/ss_461f92339ef3f1bf56901670d1dee9b4fe299422.1920x1080.jpg?t=1475857967,https://cdn.akamai.steamstatic.com/steam/apps/25930/ss_569817902d8bf17ea66e1b2c24aff79367392c22.1920x1080.jpg?t=1475857967,https://cdn.akamai.steamstatic.com/steam/apps/25930/ss_b17d315f0e6583f5a46cb5466dd816478fc0d8af.1920x1080.jpg?t=1475857967,https://cdn.akamai.steamstatic.com/steam/apps/25930/ss_c55e784e268a4990369c30c871b3c5da2b345ee5.1920x1080.jpg?t=1475857967",
    "Slug": "east-india-company",
    "Meta Title": "East India Company: Jul 31, 2009, Nitro Games and Full Ov...",
    "Meta Description": "Looking for information on East India Company? Check out the release date (Jul 31, 2009), developer insights from Nitro Games, and a complete game summary.",
    "Alt Text Image": "Official header image for East India Company game - Steam 25930",
    "Canonical URL": "https://gusku.site/game/east-india-company",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"East India Company\", \"description\": \"Looking for information on East India Company? Check out the release date (Jul 31, 2009), developer insights from Nitro Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 31, 2009\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nitro Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nitro Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/25930/header.jpg?t=1475857967\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}