{
    "AppID": 896650,
    "Name": "End War RTS",
    "Release date": "Jul 31, 2018",
    "About the game": "The End War RTS is a story inspired by modern science fiction thoughts. It started a world war for human beings to fight for survival resources. Launching nuclear bombs has become a means of killing all countries. In the End War RTS world, it is built by the United States, France, Britain, Germany, Russia, Cuba and Libya. The power weapon units of each country are different. The U.S. air space carrier, Russian missile submarine and other features There are a large number of weapon units in the End War RTS world, which are rich in land, sea and air. To expand your army, you need to obtain more minerals, occupy more resources crazily as your primary strategic goal, build more mines, more mining cars, use metal storm The laser tower and other defense buildings will stick to your position. The powerful ground force will be the mine fire tank, long-range strike missile, the king of the air carrier and God's particle nd500 warship. If it is difficult, we will use strategic nuclear weapons. You are the strongest in the world Commander, crush your enemy and level it The map generated by the random parameters of End War RTS is mainly based on artificial intelligence to simulate a reliable enemy. It can also be online to support up to eight people to fight. Powerful artificial intelligence will use nuclear weapons to attack you and your allies, and they will choose the place where your forces are concentrated. You can also choose to be a god watching their battle This is a cool and explosive project, which may cause your fatigue Operation introduction: Left mouse button - box and radio units Right mouse button - command the selected unit to move or attack 'a' + right mouse button - attack moves to location 'Ctrl' + '1'... '9' - edit the selected unit as a team '1'... '9' - Select Team Click the construction icon on the right - construction unit When the building on the right is completed - click the icon on the right to move the mouse to the map on the left, turn green, and then click the left mouse button to place the building Car factory and airport - set as exit button will appear at the top after selection, and it will become the main exit building after clicking the button Nuclear well and anti nuclear base - after selection, add ammunition button will appear at the top. Click the button to add ammunition Features: Occupy map production building, can produce special units regularly, such as: planetary destroyer (dead star), alien Mothership, fearless ship, etc The fast build mode gives a new play experience: experience the fun of large-scale combat Difficult opponent in 8v1 mode: it only needs a small number of types to eliminate the players and allied coalition. It's time to think about how to defeat it Play in the big world, fight for resources for players: fight for more resources, fight for global domination Funny God system. Its thunder can be split everywhere. God is a balanced player The ultimate goal of the game is to defeat all enemies.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/896650/header.jpg?t=1657412413",
    "Price": 0.99,
    "Developers": "Aurora",
    "Publishers": "Aurora",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/896650/ss_34410d861a83912916c048fbf6627e1482c4522f.1920x1080.jpg?t=1657412413,https://cdn.akamai.steamstatic.com/steam/apps/896650/ss_d9fb9b1a433d5187cb8bee7e89386f8dc2b58cff.1920x1080.jpg?t=1657412413,https://cdn.akamai.steamstatic.com/steam/apps/896650/ss_cc4bcd40717cd5d67d65c6cbd14b3bb93fad96cd.1920x1080.jpg?t=1657412413,https://cdn.akamai.steamstatic.com/steam/apps/896650/ss_d7c0be0ddf3b95769a26b39fdf7ae27bf42efd87.1920x1080.jpg?t=1657412413,https://cdn.akamai.steamstatic.com/steam/apps/896650/ss_6aa0a6056db99ad13c4c6c12dc10384a3cd4c303.1920x1080.jpg?t=1657412413,https://cdn.akamai.steamstatic.com/steam/apps/896650/ss_ac790b34c5026b8701731f252baace7ac53d4d1f.1920x1080.jpg?t=1657412413",
    "Slug": "end-war-rts",
    "Meta Title": "End War RTS: Jul 31, 2018, Aurora and Full Overview",
    "Meta Description": "Looking for information on End War RTS? Check out the release date (Jul 31, 2018), developer insights from Aurora, and a complete game summary.",
    "Alt Text Image": "Official header image for End War RTS game - Steam 896650",
    "Canonical URL": "https://gusku.site/game/end-war-rts",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"End War RTS\", \"description\": \"Looking for information on End War RTS? Check out the release date (Jul 31, 2018), developer insights from Aurora, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 31, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aurora\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aurora\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/896650/header.jpg?t=1657412413\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}