{
    "AppID": 1658480,
    "Name": "EQDRIVE.IO",
    "Release date": "Jul 7, 2022",
    "About the game": "24 vehicles are currently available in game. Simulation Double Precision Soft Body Physics running 1000 times a second. Ability to drive softbody vehicles in very large open world environments. Physics model is suitable for both light vehicles at very high speeds and very heavy vehicles at slower speeds. Vehicles are mostly flexible. In heavy vehicles you can continuously observe their flexing according to the forces they encounter while driving. Depending on the severity of the accident vehicle body could deform or the whole vehicle can disintegrate completely. Driving Physical shape of the softbody wheels were choosen by thousands hours of research and eliminating more than 6 possible wheel designs. Wheels can endure to extremely high amounts of centrifugal and lateral force. Vehicles can have front wheel drive, rear wheel drive or all wheel drive. Axles and torque distributions are simulated. It's possible to have 6x6, 8x8 etc. A 6x6 Off-Road Truck with lockers is already available in the game. Automated Manual, Torque Converter and CVT transmissions are available. Drive modes and sequential shifting are available. Heavy commercial vehicles like trucks and buses have an other special type of automated split shift transmission with 8 to 12 gears, which is more suitable for the type of driving heavy vehicles offer. All vehicles have interior with animated steering wheel and gauges. Environment 5 different terrains with islands or deserts. 1 bonus track featuring a real world location with a racetrack. Katahdin Island - A fictional tropical island with curvy roads convenient for very high speed driving. Maderia Island - Includes a very long main road at sea level around the island and a few challenging roads going across to the top of the island. Desert Dunes - An area with sandy terrain with mountains surrounding it. Middle East - Mountainous desert area with various buildings and vegetation. Grid Map - Very large flat terrain with various obstables to test vehicles. Also a bonus racetrack is available in the game which we used to improve our physics engine. Driving at any time day&amp;night possible. All vehicles have working lights and signals. You can change the day time in the game. It's possible to drive under different weather conditions. You can choose to drive in rain or snow but they don't affect the gameplay physically. Sounds All vehicles have unique engine sounds from our own FM+Granular synthesizer specially developed for generating engine sounds. It has so many parameters to generate unique and realistic engine sounds. Controller Support We setup profiles for most of the popular steering wheels and controllers on the market. Even if it's not known by our system you can still map axes and buttons with the control mapper and use it in the game. DirectInput Force Feedback support was added in the last update. It can run force feedback effects on all Logitech, Thrustmaster and Fanatec steering wheels with force feedback capability.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1658480/header.jpg?t=1657213262",
    "Price": 11.99,
    "Developers": "Realityocean Games",
    "Publishers": "Realityocean Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1658480/ss_1ab3555410afc910501c2b4a8aa8e5d9b8ea248e.1920x1080.jpg?t=1657213262,https://cdn.akamai.steamstatic.com/steam/apps/1658480/ss_40181de7b81e6acbe778b028ea39e1dc5d9dd231.1920x1080.jpg?t=1657213262,https://cdn.akamai.steamstatic.com/steam/apps/1658480/ss_dafc296cb932c751634fd0d7d98984b9235d7317.1920x1080.jpg?t=1657213262,https://cdn.akamai.steamstatic.com/steam/apps/1658480/ss_3d9a1ebe4528e9cbeb3071abe1707cde857032db.1920x1080.jpg?t=1657213262,https://cdn.akamai.steamstatic.com/steam/apps/1658480/ss_f6e848546e0f8f77a4b10419210aab453d372844.1920x1080.jpg?t=1657213262",
    "Slug": "eqdrive-io",
    "Meta Title": "EQDRIVE.IO: Jul 7, 2022, Realityocean Games and Full Over...",
    "Meta Description": "Looking for information on EQDRIVE.IO? Check out the release date (Jul 7, 2022), developer insights from Realityocean Games, and a complete game summary.",
    "Alt Text Image": "Official header image for EQDRIVE.IO game - Steam 1658480",
    "Canonical URL": "https://gusku.site/game/eqdrive-io",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"EQDRIVE.IO\", \"description\": \"Looking for information on EQDRIVE.IO? Check out the release date (Jul 7, 2022), developer insights from Realityocean Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Realityocean Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Realityocean Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1658480/header.jpg?t=1657213262\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}