{
    "AppID": 823420,
    "Name": "Erinye Demo",
    "Release date": "Apr 7, 2018",
    "About the game": "Erinye is a PC adventure game with some RPG tints, where you explore a 2D world, full of dungeons, castles, mazes, towns, secrtets, puzzles, treasures and different enemies to fight, swinging weapons, magic or other trinkets you will find on your way. Story The story begins when our heroine, Erin, arrives to the town of Azuliris, following the trail of a mysterious witch who, rumors say, carries a very valuable treasure with her. Things get difficult when in Azuliris, Erin meets the ShyGirls, a group of bandits who have taken control over the town, blocking all the exits and locking the local police force, 'The Eyes', in the station cells. If Erin wants to find the witch, she will have to get rid of the ShyGirls and free Azuliris. But she doesn't know her journey is just begining and a new adventure awaits her, along with the strangest and wicked characters she have ever met. The Characters Erin: A weirdo who refuses to kill her foes, so she goes around doing weird stuff like cutitng their clothes off or crippling them for life. She thinks she doesn't have enemies, only potential friends. Erin fears stupid things like rainbows and butterflies. She love videogames, but really sucks at them. Rina: A greedy little thing who would betray her mother for the right price (if she had a mother). Erin and Rina agree to find together the witch's treasure, but they end up involved in a much bigger deal. At the end of their journey, she may find that the real treasure, is friendship... pfffff! of course she doesn't! Most people asumes she's a fairy, a sprite or an imp, but the truth is unkown. Star: Erin's adoptive sister, she's also her 'best friend'. Her usefulness doesn't go beyond letting Erin save the game every time she calls by phone. She hides her insecurities by wearing provocative clothes. Star loves animals, specially kittens. Like Erin, Star is a videogames fan, her favorite franchise is 'Acid Princess Durazno'. ShyGirls: While they call themselves bounty hunters, the truth is, they are just a bunch of good for nothing bandits who go around looking for the ultimate treasure. Their attire comes from a misinterpretation of the Little Red Riding Hood fairy tale. If you want to know more characters, better play the game. You don't want me to spoil everything here for you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/823420/header.jpg?t=1533713708",
    "Price": 0.0,
    "Developers": "Karosu-Maker",
    "Publishers": "Karosu-Maker",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/823420/ss_74e79a051d66de5632e3ec21bb01efba8af40e25.1920x1080.jpg?t=1533713708,https://cdn.akamai.steamstatic.com/steam/apps/823420/ss_e2c502127a15510a9cb5654b2d44c6f25fedc570.1920x1080.jpg?t=1533713708,https://cdn.akamai.steamstatic.com/steam/apps/823420/ss_acd63f4c4e31a2455651e45d614054a0ce274021.1920x1080.jpg?t=1533713708,https://cdn.akamai.steamstatic.com/steam/apps/823420/ss_634305ddfc20e6e40ad8afc154c7b11840aae031.1920x1080.jpg?t=1533713708,https://cdn.akamai.steamstatic.com/steam/apps/823420/ss_f0fe1a55e5b69edf0a137be84eea4e20e42d946c.1920x1080.jpg?t=1533713708,https://cdn.akamai.steamstatic.com/steam/apps/823420/ss_35d24641f5d53964d1767f15440fbdf9d008571c.1920x1080.jpg?t=1533713708,https://cdn.akamai.steamstatic.com/steam/apps/823420/ss_4ea4f7dd4e9a31a61d244287cad414572eb48d47.1920x1080.jpg?t=1533713708,https://cdn.akamai.steamstatic.com/steam/apps/823420/ss_82c603be013764cacc8bba4c819857d9c997aa91.1920x1080.jpg?t=1533713708",
    "Slug": "erinye-demo",
    "Meta Title": "Erinye Demo: Apr 7, 2018, Karosu-Maker and Full Overview",
    "Meta Description": "Looking for information on Erinye Demo? Check out the release date (Apr 7, 2018), developer insights from Karosu-Maker, and a complete game summary.",
    "Alt Text Image": "Official header image for Erinye Demo game - Steam 823420",
    "Canonical URL": "https://gusku.site/game/erinye-demo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Erinye Demo\", \"description\": \"Looking for information on Erinye Demo? Check out the release date (Apr 7, 2018), developer insights from Karosu-Maker, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 7, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Karosu-Maker\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Karosu-Maker\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/823420/header.jpg?t=1533713708\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}