{
    "AppID": 1398400,
    "Name": "Florida Man: Hurricane Hijinks",
    "Release date": "May 22, 2021",
    "About the game": "Six hours until the hurricane hits. Six hours alone on a Florida island with no one to stop you. Six hours of free booze and stale burgers. Six hours to reach fame! Slip into Florida Man's favorite incarnation - Dale - for one hour game play sessions full of laughs and eyerolls, ending with sharable headlines summarizing your exploits! Roam the island to find books, keys, weapons, and many many hidden items! Hunt a little, explore the swamp, or see what the inhabitants of the Vampire Hotel were up to! Oh, and always try beating your friend's score (you do have a friend, right?) by coming up with crazier hijinks! Explore Discover this scenic Florida island. Roam the beautiful hills, smell the flowers. Pet a pretty duckling and somewhere along the way, don't forget to break into the diner to fill your empty stomach. That place had it coming! Craft It was a chore in your second year arts class with Ms. Guttentag that old hag, but things have changed! Who could turn down a pirate hat made of leather and two rolls of duct tape? Or an apron to finally cover up after that unfortunate bathroom incident... Survive Don't fall to your death. Don't overdose. And for god's sake, don't get caught breaking into the Vampire Hotel! You remember the stories about that place. Ever since that shipwreck, strange things have been happening there! What Will Your Headline Be? Florida Man Goes Home Early With Illegal Drugs! Florida Man Can Not Stand The Heat! White House Set To Issue Statement Monday At 11am. Tacos May Be At Fault! Naked Florida Man Wields Speed Limit! After eating pork rinds and grits, Florida Man went crazy. Sources say, Sheriff may have known. Nobody hurt. Reporters out of Business! Florida Man on Vacation! Faced with lack of news, Tribune continues to report on pancakes! Florida Man's grandmother concerned, police remain optimistic. Tired Florida Man brings home Chicken Hat! Reading 13 books was not enough for naked Florida Man. Breaks into Cafe and steals Nixon's prized personal photo. Police still searching for witnesses. How To Make Scrambled Eggs Add some butter to pan on medium-low heat. While it melts, combine eggs with some milk, add salt and pepper. Add into the pan once hot. Stir occasionally until the eggs have firmed up to your taste. For cheesier eggs, add cheese. For bacon flavor, add bacon. Do not add pets or spouses. Fine Print No developers were harmed during the writing of this description. We treated them well, fed them Dr Pepper and chocolate. We promise. Don't listen to the badgers. They weren't even there. They have no witnesses. Dale said it was alright!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1398400/header.jpg?t=1634226463",
    "Price": 10.99,
    "Developers": "Tag 44/24",
    "Publishers": "Tag 44/24",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1398400/ss_c4260c84d234e95feb5de3b0ed5a47944b8be915.1920x1080.jpg?t=1634226463,https://cdn.akamai.steamstatic.com/steam/apps/1398400/ss_0519e7119cb7bc2fb3c707ec137c07156076321a.1920x1080.jpg?t=1634226463,https://cdn.akamai.steamstatic.com/steam/apps/1398400/ss_b11ae1b5030f5f4dec7be768c0f049621deff11c.1920x1080.jpg?t=1634226463,https://cdn.akamai.steamstatic.com/steam/apps/1398400/ss_bb3c208d6feeb6e0149cf559ffa7f1aaaf911d78.1920x1080.jpg?t=1634226463,https://cdn.akamai.steamstatic.com/steam/apps/1398400/ss_6dee4a64c093826d73a57e5627f01b8224acf6b0.1920x1080.jpg?t=1634226463,https://cdn.akamai.steamstatic.com/steam/apps/1398400/ss_5538a0c4826d83852f3c171f29db475a5310264b.1920x1080.jpg?t=1634226463,https://cdn.akamai.steamstatic.com/steam/apps/1398400/ss_c974c02b66323b7f1bc88326fbadf2d44285e638.1920x1080.jpg?t=1634226463,https://cdn.akamai.steamstatic.com/steam/apps/1398400/ss_797d5643c3c3f5e8b19fbb31425c99b04bce912b.1920x1080.jpg?t=1634226463,https://cdn.akamai.steamstatic.com/steam/apps/1398400/ss_687519724c18c1727b3d591a49e701b05d51518b.1920x1080.jpg?t=1634226463",
    "Slug": "florida-man-hurricane-hijinks",
    "Meta Title": "Florida Man: Hurricane Hijinks: May 22, 2021, Tag 44/24 a...",
    "Meta Description": "Looking for information on Florida Man: Hurricane Hijinks? Check out the release date (May 22, 2021), developer insights from Tag 44/24, and a complete ...",
    "Alt Text Image": "Official header image for Florida Man: Hurricane Hijinks game - Steam 1398400",
    "Canonical URL": "https://gusku.site/game/florida-man-hurricane-hijinks",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Florida Man: Hurricane Hijinks\", \"description\": \"Looking for information on Florida Man: Hurricane Hijinks? Check out the release date (May 22, 2021), developer insights from Tag 44/24, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tag 44/24\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tag 44/24\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1398400/header.jpg?t=1634226463\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}