{
    "AppID": 1383020,
    "Name": "Germany at War - Soviet Dawn",
    "Release date": "Jan 1, 2021",
    "About the game": "On June 22, 1941, the largest land campaign in history began, as three German Army Groups advanced into the Soviet Union. Operation Barbarossa was underway and the German war machine was now locked in a struggle which would change the course of World War II. Germany At War: Soviet Dawn is a turn-based operational wargame, with a strong historical focus. The two major camapigns, one for each side, lead the player through all important stages of the conflict and sometimes beyond. You command either the German forces through a branching historical campaign covering the entire 1941 campaign as well as part of the 1942 campaign with dozens of scenarios stretching from the Soviet border all the way to Archangel and towards Astrakhan, the original military goals of Operation Barbarossa. Or you pick up the Soviet banner to defend your homeland against the invaders until you can start to reconquer lost Russian soil and even have your revenge in 1944/45. Units follow you through the campaigns, earning experience and historical upgrades while as you progress new equipment becomes available on a historical schedule. Step into a wargame where your performance will rewrite history, through an addictive combination of compelling gameplay, realistic events and challenging battles. Additional stand-alone scenarios cover more famous battles with historical orders of battle in which you use different formations and equipments to achieve the mission goals. Units and maps are represented at realistic scales and the combat, movement and terrain systems are all based on real capabilities. Aimed at all levels, from those who have never played a wargame before to those who know the history of World War II in detail, this is an entertaining and challenging game of combined arms strategy. Features: 9 campaigns and 20 single maps form 134 scenarios to master Easy-to-use but realistic combat, movement and logistics system Historical orders of battle in the non-fictional missions Realistic map and time scales Ground and Air units as well as specialized unit types such as Engineer and Reconnaissance battalions - all in all over 250 variants Different unit formations fully modelled and viable, from Tiger Battalions to Infantry Divisions Wide variety of support units and realistic historical upgrades for each unit type as units earn experience Historical equipment based on historical availability Dynamic branching campaign system with player decisions, choose the main German axis of attack after the battle of Smolensk. Interesting and innovative mission objectives make each scenario unique In-Game scenario events like bridge destruction, reinforcements based on player actions, news from other fronts, etc. Balanced Stand-alone scenarios suitable for head to head play and as either side Unit history that contains important military achievements of an individual unit Play with 3D models or counters to represent the troops Scenario and Script Editor to create your own missions and campaigns",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1383020/header.jpg?t=1609533544",
    "Price": 11.99,
    "Developers": "Phobetor",
    "Publishers": "Phobetor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1383020/ss_469d0c1b1dd2d73817bd476750c52c8822e21883.1920x1080.jpg?t=1609533544,https://cdn.akamai.steamstatic.com/steam/apps/1383020/ss_7fb0c582f52fd3d41cd91c7e2add28e2c0b943b6.1920x1080.jpg?t=1609533544,https://cdn.akamai.steamstatic.com/steam/apps/1383020/ss_2a65cd9107d3017b0b27639836ef87488a55af72.1920x1080.jpg?t=1609533544,https://cdn.akamai.steamstatic.com/steam/apps/1383020/ss_839d99cf2ca3c4cff480bc5e27602f712e9499d5.1920x1080.jpg?t=1609533544,https://cdn.akamai.steamstatic.com/steam/apps/1383020/ss_ff31047f34694249e08386983bff3618a6f835d3.1920x1080.jpg?t=1609533544,https://cdn.akamai.steamstatic.com/steam/apps/1383020/ss_476a86a41c480fd089ae95f420a7c229f977a2cf.1920x1080.jpg?t=1609533544",
    "Slug": "germany-at-war-soviet-dawn",
    "Meta Title": "Germany at War - Soviet Dawn: Jan 1, 2021, Phobetor and F...",
    "Meta Description": "Looking for information on Germany at War - Soviet Dawn? Check out the release date (Jan 1, 2021), developer insights from Phobetor, and a complete game...",
    "Alt Text Image": "Official header image for Germany at War - Soviet Dawn game - Steam 1383020",
    "Canonical URL": "https://gusku.site/game/germany-at-war-soviet-dawn",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Germany at War - Soviet Dawn\", \"description\": \"Looking for information on Germany at War - Soviet Dawn? Check out the release date (Jan 1, 2021), developer insights from Phobetor, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Phobetor\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Phobetor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1383020/header.jpg?t=1609533544\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}