{
    "AppID": 577910,
    "Name": "Ghost Blade HD",
    "Release date": "Mar 8, 2017",
    "About the game": "Ghost Blade HD is an intense bullet-hell shoot 'em up game, with satisfying and addictive score-based gameplay. With its inspiration going back to the shooting games of the 1990s era, Ghost Blade HD ties old memories to current tones and techniques. Designed with a modern graphic style and special effects, Ghost Blade HD also features an awesome 2-player mode! Ghost Blade HD is easy to learn, hard to master. Story 10,000 years ago an Artificial Intelligence known as Shira was built to protect the residents of Mars. As time passed the AI became corrupted and Shira started to attack the Mars colonies. With no way to defend itself against ‘Evil Shira’ Mars calls for help. The Earth Defense Force fleet fights its way to ‘Evil Shira’ and uses powerful lasers to destroy it. However, ‘Evil Shira’ secretly had a backup that flees into space and takes over an abandoned space station at the outskirts of the solar system. When the EDF notices the escape they send their bravest fighter after ‘Evil Shira’. You are this pilot, and your mission is to destroy Evil Shira before it can complete its new attack force and threaten the existence of the entire universe. Features Beautiful, detailed HD Graphics 5 Stages with HUGE Boss Enemies 3 Player battle ships with different gun types Instant Respawn - No cutscenes! Practice Mode Score Attack Mode Fine tuned gameplay and balanced difficulty 3 difficulty levels: Easy, Normal and Hard. 60 FPS Arcade-style gameplay and addictive scoring system Fast and smooth Gameplay Auto-bomb enabled Easy mode for beginners TATE/portrait screen option available 2-player local co-op mode for addictive fun Incredible Soundtrack composed by Rafael Dyll (Söldner-X2 and Rainbow Skies) Tone down background brightness Optional softslow Online Leaderboards 37 Achievements 1080p Full HD TATE/TATE INVERTED/portrait screen option available Xbox 360 and Xbox One controller, Keyboard Tips For Getting Highscores Earn points by destroying enemies and collecting Stage Star items. The higher your Combo Multiplier, the more you earn. Destroying enemies and crates add to the Combo Multiplier. Use Focus shot for tight spots to avoid running into stray bullets Try all ships to see which one fits best for your style of play For a top scoring run kill as many enemies as possible and avoid dying and using bombs - use FOCUS shot to earn extra bombs and pick them up for a score bonus! No-bombing gives big impact on score, as does having as high bomb count as possible.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/577910/header.jpg?t=1609019610",
    "Price": 9.99,
    "Developers": "Hucast Games",
    "Publishers": "2Dream",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/577910/ss_ce51c69655a3ff27879cb43d1d9c4bd606bd5ba6.1920x1080.jpg?t=1609019610,https://cdn.akamai.steamstatic.com/steam/apps/577910/ss_2fd000d3fba66d5981682530ea2df686b04f0738.1920x1080.jpg?t=1609019610,https://cdn.akamai.steamstatic.com/steam/apps/577910/ss_2b3e6543cd48890f75045e30f7cdbfe56c9c14a0.1920x1080.jpg?t=1609019610,https://cdn.akamai.steamstatic.com/steam/apps/577910/ss_ebb0e73451d64ae0774877afbb1c94aa15163bde.1920x1080.jpg?t=1609019610,https://cdn.akamai.steamstatic.com/steam/apps/577910/ss_b83a5a98a32493cc765eb19cff9f4473ab6bd695.1920x1080.jpg?t=1609019610,https://cdn.akamai.steamstatic.com/steam/apps/577910/ss_f66350bce6601f737f56a7466b9e9a90d4c5944b.1920x1080.jpg?t=1609019610,https://cdn.akamai.steamstatic.com/steam/apps/577910/ss_2ea2c223382671e56ad25a5ac64e895dc06a5e95.1920x1080.jpg?t=1609019610",
    "Slug": "ghost-blade-hd",
    "Meta Title": "Ghost Blade HD: Mar 8, 2017, Hucast Games and Full Overview",
    "Meta Description": "Looking for information on Ghost Blade HD? Check out the release date (Mar 8, 2017), developer insights from Hucast Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Ghost Blade HD game - Steam 577910",
    "Canonical URL": "https://gusku.site/game/ghost-blade-hd",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ghost Blade HD\", \"description\": \"Looking for information on Ghost Blade HD? Check out the release date (Mar 8, 2017), developer insights from Hucast Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 8, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hucast Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"2Dream\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/577910/header.jpg?t=1609019610\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}