{
    "AppID": 561440,
    "Name": "Graffiti Bombing",
    "Release date": "Aug 29, 2020",
    "About the game": "Enter the virtual world of Graffiti Bombing and become a graffiti writer. Whether you’re a new artist, seasoned veteran or even all-city hero, you can now enjoy the thrill of being a graffiti writer in the crime-free (relative) safety of Virtual Reality (VR). Prepare your equipment, pack your paint and supplies. Grab your piece book, select your outlines, plan color schemes, pick paint types and get ready to go all city! Bomb different locations by tagging, creating quick throw-ups, pieces of graffiti and characters. Or take things to the next level, by creating huge graffiti burners and massive murals that cover large walls and buildings. Get transported into a seamless world comprised of rich, detailed environments. Move between zones to discover new locations and find different places to bomb graffiti. * No loading or saving screens, everything streams in real-time, offering better immersion. Multiple locations for doing graffiti in the same game level / world. You can paint on walls, buildings, tunnels, trains, containers and more.. and this is just the beginning! * Massive, long walls in some locations, provide ample room for those mega burners. Realistic environments, with time of day, nature, animals, spatial sound FX and more. * Current game-world and zone mechanics have been designed with the longer-term features road-map in mind. * Remember, Graffiti Bombing is a place you go - once you leave, any graffiti remains until next time. Want to bomb the same location, then you go over it! Created by a graffiti artist, modeled from experience, the system looks and feels realistic. Spray on walls and surfaces with different paints: FT-ACTION 71 (Regular / Multi-purpose), Slick Rick! (Gloss), Rack-a-lak (Matt), Zero2Hero (Metallic). * Areas are separated into Paint Zones that load and save automatically as you graffiti. Check your Smart Watch to see Paint Zones status, discover new bombing locations. Paint cans have lids and support different grab types for added realism. Select different cap types, to utilize different spray, line and paint effects. * Intelligent drips system detects paint build-up and spawns realistic drips. Undo / redo system to make sure those outlines and details are perfect. * Additional spray settings give you control over line and spray dynamics. Natural interaction with user interfaces, aims to feel fun and intuitive. Actions Assistant is a tablet-like device that you use to manage various aspects and settings related to graffiti, locomotion, social, interactions and game settings. * The Graffiti Manager allows you to easily select color palettes and create quick color swatches using drag and drop. * Spray can Quick Actions menu system offers context access to various settings and panels, such as: Color Palette, Color Swatches, Caps Selector, Color Dropper, Spray Size Lock and more. * Use a Clipboard and related actions to import images from your local drive, you can use imported images for reference when doing pieces in-game. * Refer to your Smart Watch to get info on current health, paint zone and time of day. Access the GRAF-CORP computer system in-game, to get help and play tips. Choose from three different types of locomotion, depending on comfort, and preference. Game and Quality settings give you fine control over setup, tweak things to your liking. Use your backpack inventory system to store paints, clipboard and more. Play music on your retro Boombox, so you can listen to tunes whilst bombing. * Rack up at the Bombastic - Graffiti Supplies vending machine, to top-up paint supplies. * Discover new ways to interact with the game-world and environments around you. * You can pick up and use objects, open doors, operate lifts and even move vehicles. * To get up to those hard to reach graffiti spots, you’ll need to climb or get creative. Look for objects that you can stand on, or stack, ladders to climb and a mobile scissor lift. * Be careful though, some areas can be dangerous, and if you fall from a height it hurts! Also be on the lookout for danger, security systems, and dogs... they do bite you know!! Capture images of locations and graffiti using your Actions Assistant’s built-in camera. Preview and manage images via the Actions Assistant’s camera roll. Share images directly to your own or the Graffiti Bombing Twitter streams. * Submit your best pieces to the official Graffiti Bombing website, for a chance to enter the renown Hall of Fame. * Please note : the Free-To-Play version of Graffiti Bombing does not include all features and any items in the 'About this Game' lists marked with an asterix (*) have limitation, or are only available in the full version which can be purchased as a DLC. In addition - planned features and content as outlined in the Early Access Game section, will only be available with the paid DLC. For the best experience and to enjoy all features, please purchase the DLC ' Graffiti Bombing - All City Edition '. Additional details on planned features and development roadmap to come later, after we successfully launch into Early Access, and when base game build and features are stable.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/561440/header.jpg?t=1623490522",
    "Price": 0.0,
    "Developers": "Urban Weaponry,Will Lingard",
    "Publishers": "Urban Weaponry,Will Lingard",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/561440/ss_a8c52094cf10f2bab19499198c81cf726cdf2c54.1920x1080.jpg?t=1623490522,https://cdn.akamai.steamstatic.com/steam/apps/561440/ss_368544bb00130683e5297aeb3d61e706b395d2df.1920x1080.jpg?t=1623490522,https://cdn.akamai.steamstatic.com/steam/apps/561440/ss_f07ce96aad10df8fe48a26a0698c23023a5b686a.1920x1080.jpg?t=1623490522,https://cdn.akamai.steamstatic.com/steam/apps/561440/ss_37c194ca14bb1e7575203c090f634ed05fc663e2.1920x1080.jpg?t=1623490522,https://cdn.akamai.steamstatic.com/steam/apps/561440/ss_63810f627d11349cf980c4673911ca7a99b99f91.1920x1080.jpg?t=1623490522,https://cdn.akamai.steamstatic.com/steam/apps/561440/ss_78e396e2922c973860cd8c3dab7fdaf7b3803188.1920x1080.jpg?t=1623490522,https://cdn.akamai.steamstatic.com/steam/apps/561440/ss_9c4677e0f30cdac67c8d3c2c9296e04883093a5b.1920x1080.jpg?t=1623490522,https://cdn.akamai.steamstatic.com/steam/apps/561440/ss_604e229bb2e305e6762ee3f29238948ea3727493.1920x1080.jpg?t=1623490522,https://cdn.akamai.steamstatic.com/steam/apps/561440/ss_8705e2586907c2bb1b697efe21686f284919914a.1920x1080.jpg?t=1623490522,https://cdn.akamai.steamstatic.com/steam/apps/561440/ss_df0550a13925097a93c53eb5fb2296a130f6d2e7.1920x1080.jpg?t=1623490522",
    "Slug": "graffiti-bombing",
    "Meta Title": "Graffiti Bombing: Aug 29, 2020, Urban Weaponry,Will Linga...",
    "Meta Description": "Looking for information on Graffiti Bombing? Check out the release date (Aug 29, 2020), developer insights from Urban Weaponry,Will Lingard, and a compl...",
    "Alt Text Image": "Official header image for Graffiti Bombing game - Steam 561440",
    "Canonical URL": "https://gusku.site/game/graffiti-bombing",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Graffiti Bombing\", \"description\": \"Looking for information on Graffiti Bombing? Check out the release date (Aug 29, 2020), developer insights from Urban Weaponry,Will Lingard, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Urban Weaponry,Will Lingard\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Urban Weaponry,Will Lingard\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/561440/header.jpg?t=1623490522\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}