{
    "AppID": 1529140,
    "Name": "Hero Park",
    "Release date": "May 28, 2021",
    "About the game": "Welcome to Hero Park, The place where magical unicorns attract heroes into your town for their own little adventure. This is the story of you, your unicorn and a treasury full of gold! Select Your Heroes Use your unicorn to bring heroes to your town and recruit the one you need the most. Each heroes have different needs, such weapon, armor, food etc What they have in common, they all want to fight in your dungeons ! Build Your Own Town ! Customize your town with a large number of store and hire employee to manage them. Each employee offer different product based on your customer needs, it is recommended to hire more than 1 employee per store. Explore Dungeons Let you heroes having an exciting adventure in your dungeons, add monster and mighty reward as loot. Keep Crafting Start crafting to get customer to your shop, your employee can craft different quality of items and you can improve their skill based on what you need. Story of Hero Park Five years after the Great War, the old war hero and his faithful unicorn return to their home town and find that not a stone is left standing on another. The town is empty and the once glorious dungeons are now abandoned. The decision is clear: the town must be rebuilt, new monsters bred and the dungeons populated again. Features ★ More than 100 fabulous characters: heroes, shop keepers, vampires, unicorns and more ★ Design your town according to your wishes and automate your production ★ Breed monsters for your dungeons and shape them according to your needs ★ Immerse yourself in the magical world of elves, humans and dwarves ★ Experience the exciting story of an old war hero and his unicorn ★ Solve exciting quests and loot valuable treasures... ★ ... and stop your unicorn from eating everything! ---------------------------------------------------------- Frequently Asked Questions (faq) 1. How Can I Have the Heroes Trained? There are several ways to increase the chance of training. It is especially helpful if the hero has bought an experience potion (yellow potion) beforehand. The chance of training is also increased if the hero can defeat a high level monster or defeats several monsters. 2. How Can I Have A Hero Blessed? A hero wants to be blessed after having his suffering (e.g. diseases caused by undead monsters) treated in the temple. The different blessings are only valid for certain races. So in the beginning only one blessing is available for elves and it can be helpful to attract as many elves as possible to the village. 3. How Can I Delete Or Reposition A Building? Select a building and open the building menu with the button in the upper left corner. Select 'Store building'. If you now want to move this building somewhere else, click on an empty field and select the building from your storage. 4. Can I find improvements in treasure chests for employees who cannot be found in treasure chests? As soon as an employee is on your team, you can find improvements in treasure chests with the same probability. 5. I can't get any further with the task 'In your village you need 10 cats' and need a tip? This task can only be solved at level 28. Once you have cats in your village, remember that all cats need love. Have you ever pressed a cat in the game? :-)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1529140/header.jpg?t=1622190590",
    "Price": 12.99,
    "Developers": "Fun Flavor Games",
    "Publishers": "DIVASKY LIMITED",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1529140/ss_7731f8d1c892aaa2e288a471de4cf4c5a6783aa4.1920x1080.jpg?t=1622190590,https://cdn.akamai.steamstatic.com/steam/apps/1529140/ss_e0ed517f5fd053b577ce9bdfdff42eec43d980b9.1920x1080.jpg?t=1622190590,https://cdn.akamai.steamstatic.com/steam/apps/1529140/ss_e81f8107e2e3f60b3d0fd807be9dae4f171f5dbf.1920x1080.jpg?t=1622190590,https://cdn.akamai.steamstatic.com/steam/apps/1529140/ss_0f15e189cd51fe323302b9f2c68db4886dcd4558.1920x1080.jpg?t=1622190590,https://cdn.akamai.steamstatic.com/steam/apps/1529140/ss_44426c94dfff3aa375bf5f9adf2229dc648203d9.1920x1080.jpg?t=1622190590,https://cdn.akamai.steamstatic.com/steam/apps/1529140/ss_d8659e7698e9391c1da443859ca2f391d8a908c3.1920x1080.jpg?t=1622190590",
    "Slug": "hero-park",
    "Meta Title": "Hero Park: May 28, 2021, Fun Flavor Games and Full Overview",
    "Meta Description": "Looking for information on Hero Park? Check out the release date (May 28, 2021), developer insights from Fun Flavor Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Hero Park game - Steam 1529140",
    "Canonical URL": "https://gusku.site/game/hero-park",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hero Park\", \"description\": \"Looking for information on Hero Park? Check out the release date (May 28, 2021), developer insights from Fun Flavor Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fun Flavor Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DIVASKY LIMITED\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1529140/header.jpg?t=1622190590\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}