{
    "AppID": 1879170,
    "Name": "Invaders from another dimension",
    "Release date": "Jun 21, 2022",
    "About the game": "ABOUT THIS GAME Invaders From Another Dimension was built exclusively for VR as an FPS action shooter VR Game. An immersive single player action shooter game that takes place in a retro pulp fiction like environment where you step into the midst of an invasion of gigantic spiders, big green gorillas, robots and UFOS and you need to find and pickup an atomic bomb and bring it to an extraction point all of this while you fight hordes of invaders. There are weapons like pistols and machine guns that you are going to find scatter through the level. Also, there is a hook that you can use to climb buildings to look for the atomic bomb, to avoid toxic ground and/or for evading enemies. Invaders From Another Dimension have three levels and one of them is a random generated one, so you can have endless missions. You can move freely on the environment with a 6DOF movement, also you can use the controllers to teleport and/or use them to “walk” through the environment using a series of min-jumps to avoid getting dizzy. This game can be played sitting or standing, but we recommend standing for better movement freedom. Invaders From Another Dimension is a VR game only, to use with the Valve Index, HTC VIVE and Meta Quest 2 with the Oculus Quest Link Cable. For first time VR users, install SteamVR first. If you want to use the Meta Quest 2, install the Oculus PC app. THE STORY Sometime huge aliens appeared on and around a small island, destroying every living. The army bombed them with atomic bombs, but that made the invasion worse, more aliens appeared, so many that it was the beginning of the end of humanity. Now, many years later the earth is a toxic place full of invaders, the few remaining humans live scattered around the world hidden in underground shelters. But the humanity has been busy, according to the latest studies, the invaders came through a portal from another dimension, that portal was a small one, but the use of atomic bombs made it bigger. So, a time machine was built, with the purpose of returning and recovering the atomic bombs that were the ones that made the portal to another dimension bigger. Your mission is to go back to the past and find the atomic bombs before they detonate and return with them to the future to be deactivated. For this you will be teleported with the time machine that is inside a container, and similar containers will be sent for you to return with the bombs. If you die during the mission, you will be immediately returned to the start of that mission until you complete your objective or you will die and come alive again for all eternity. THE MISSION Your mission is to find the atomic bomb and take it to the time machine. You can play the levels in any order, but we suggest that you play it in the following order: The Bridge Find the atomic bomb and take it to the time machine container on the other side of the bridge Little City Find the atomic bomb and take it to a time machine container somewhere in the city Random City Find the atomic bomb and bring it to time machine container where you started.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1879170/header.jpg?t=1658625401",
    "Price": 2.99,
    "Developers": "IOFiction LLC",
    "Publishers": "IOFiction LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1879170/ss_d751445f156c9cfefa120a485114282b04971209.1920x1080.jpg?t=1658625401,https://cdn.akamai.steamstatic.com/steam/apps/1879170/ss_1fa112f1986bfc60df1a2d8958b533584fc0998f.1920x1080.jpg?t=1658625401,https://cdn.akamai.steamstatic.com/steam/apps/1879170/ss_4f4fb34ac9ac196f5170a03fb358c86e26762415.1920x1080.jpg?t=1658625401,https://cdn.akamai.steamstatic.com/steam/apps/1879170/ss_0d52f2b8046e3def4a44225defeddf79593d8633.1920x1080.jpg?t=1658625401,https://cdn.akamai.steamstatic.com/steam/apps/1879170/ss_71cc6556d8aec167c21f530dd26f8819404f284b.1920x1080.jpg?t=1658625401,https://cdn.akamai.steamstatic.com/steam/apps/1879170/ss_7e964cf4de1f5c07edcdbb146fdce84280714248.1920x1080.jpg?t=1658625401",
    "Slug": "invaders-from-another-dimension",
    "Meta Title": "Invaders from another dimension: Jun 21, 2022, IOFiction ...",
    "Meta Description": "Looking for information on Invaders from another dimension? Check out the release date (Jun 21, 2022), developer insights from IOFiction LLC, and a comp...",
    "Alt Text Image": "Official header image for Invaders from another dimension game - Steam 1879170",
    "Canonical URL": "https://gusku.site/game/invaders-from-another-dimension",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Invaders from another dimension\", \"description\": \"Looking for information on Invaders from another dimension? Check out the release date (Jun 21, 2022), developer insights from IOFiction LLC, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"IOFiction LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"IOFiction LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1879170/header.jpg?t=1658625401\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}