{
    "AppID": 1014200,
    "Name": "Markerboard Jungle: Frogs",
    "Release date": "Mar 5, 2022",
    "About the game": "Explore the lives of a variety of frogs immersed in the world of this fascinating creature. Learn how to survive, or fail to survive. Defend your habitat against dangers that real frogs encounter every day. Starting as a tiny frog egg, help your frogs grow and thrive though changing seasons, as they discover helpful friends and face deadly foes. SAVE THE FROGS, SAVE THE WORLD Strategize at the global level to help save the future of frogs on planet Earth. During Early Access we will be visiting different regions of the world with unique challenges to meet, including local wildlife, seasons, forest fires, pollution and climate change effects. MENU PLANNED (for Early Access) - Frog Food - Ants, Beetles, Crickets, Earthworms, Fish, Flies, Moths, Slugs, Snails, Spiders. - Tadpole Food - Algae, Diatoms, Periphyton, Pollen, Organic and Inorganic Debris. Boiled lettuce. FREQUENTLY ASKED QUESTIONS Questions you might have about this game: Q: What is the main gameplay like? A: The action part of the gameplay is from a third-person perspective and alternates between playing a survival and exploration game as a frog, and drawing with a marker to interact further with the local habitat. Q: What about a meta-game or a campaign map? A: There is a campaign map represented by a globe of the Earth, with information layers that show game progress, time, seasons, goals, and other useful information. Q: What game modes are planned at launch? A: Play Mode and Sandbox Mode Q : What is the Play Mode about? A: Play Mode acts as a story-driven guide book to the lives of amphibians around the world. The main game involves topics and scenarios about a frog's life, presented in the form of an action-adventure story that visits frog-friendly ecosystems around the world. Q : What is the Sandbox Mode? A: Choose a custom scenario and play a survival game, or load up a screensaver and chill. Q: What kinds of frogs are there? A: Playable characters will include a good variety of the world's frogs. Q: What sort of game zones or biomes are there? A: Biomes include rainforest, grasslands, woodlands, chaparral, peat bog, ponds, rivers, beaches and suburbs.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1014200/header.jpg?t=1651505414",
    "Price": 14.99,
    "Developers": "Primordial Muse",
    "Publishers": "Primordial Muse",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1014200/ss_20299aa6ef02aedc6c81e96d2a7b357da0f29dcf.1920x1080.jpg?t=1651505414,https://cdn.akamai.steamstatic.com/steam/apps/1014200/ss_3adf39e2ad44ab73cbba7b05c2879f21d7abee81.1920x1080.jpg?t=1651505414,https://cdn.akamai.steamstatic.com/steam/apps/1014200/ss_f3d56851e0346a33d2c630aade5659ce64421cee.1920x1080.jpg?t=1651505414,https://cdn.akamai.steamstatic.com/steam/apps/1014200/ss_7768eddce757c9a9e7824b0d3d5f40c5aa783d03.1920x1080.jpg?t=1651505414,https://cdn.akamai.steamstatic.com/steam/apps/1014200/ss_509cac5b99078f90c1b720e510b15e8049271f47.1920x1080.jpg?t=1651505414,https://cdn.akamai.steamstatic.com/steam/apps/1014200/ss_0f86ddb6c546faa04e98d76902558ddfc4f99a1d.1920x1080.jpg?t=1651505414",
    "Slug": "markerboard-jungle-frogs",
    "Meta Title": "Markerboard Jungle: Frogs: Mar 5, 2022, Primordial Muse a...",
    "Meta Description": "Looking for information on Markerboard Jungle: Frogs? Check out the release date (Mar 5, 2022), developer insights from Primordial Muse, and a complete ...",
    "Alt Text Image": "Official header image for Markerboard Jungle: Frogs game - Steam 1014200",
    "Canonical URL": "https://gusku.site/game/markerboard-jungle-frogs",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Markerboard Jungle: Frogs\", \"description\": \"Looking for information on Markerboard Jungle: Frogs? Check out the release date (Mar 5, 2022), developer insights from Primordial Muse, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 5, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Primordial Muse\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Primordial Muse\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1014200/header.jpg?t=1651505414\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}