{
    "AppID": 870890,
    "Name": "Museum of Symmetry",
    "Release date": "Aug 9, 2018",
    "About the game": "A kaleidoscopic joyride Welcome to a delightfully disorienting animated world inspired by geometry and nature—and overflowing with infectious dance beats. Disrupting conventional game storytelling, Museum of Symmetry is an “other-dimension” VR adventure that takes you on a psychedelic romp through a feel-good universe. Come join us on this pleasure-positive trip in VR as never experienced before. WELCOME TO THE MUSEUM Step into the world of Paloma Dawkins, where up is down and silly is serious. This museum welcomes you to dive into a variety of artworks. From the highest clouds to the deepest oceans, let’s ride through fantastic landscapes of earth, fire, wind and water inhabited by strange and lovable characters. Are you ready to embrace the experience? MEET YOUR NEW VIRTUAL BFF Get cocooned by a spider, party with a crazy bird and ride on mantas under the sea. All of our animated friends have many rambling things to say about the meaning of life. Explore their alter-universes—and maybe even your alter-self. WHAT EVEN IS LIFE? There are no limits or dead ends, only possibilities and room for reflection. Perhaps the biggest surprise is not what happens during the experience itself, but how you feel once you return to the real world. Key (VR) Features A unique feel-good VR experience with light interactivity, shareable with the whole family! An innovative mix of 2D animation in a 3D playground, as never seen before. Navigate the experience at your own pace, no risk, no rush, no mistakes. An illuminating VR metaphor for life, rich environments to explore and unexpected characters to interact with: play it again! This experience is suitable for daring and imaginative VR fans. Awards Best VR Game - Canadian Screen Awards Best Interactive Production (Fiction) - Numix Awards People’s Choice for Interactive Experience Award - FIVARS Team Directed and animated by Paloma Dawkins, co-authored by Dawkins and poet, Ashley Obscura. Original electronic score by Caila Thompson-Hannant, a.k.a Mozart’s Sister Produced by The National Film Board of Canada's award-winning Animation Studio, Developed by Casa Rara Studio . Distributed by Astrea.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/870890/header.jpg?t=1645622250",
    "Price": 0.0,
    "Developers": "National Film Board of Canada,Casa Rara",
    "Publishers": "Astrea",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/870890/ss_ba07be2328a2c27c2a2c32ad19884eea9f701c97.1920x1080.jpg?t=1645622250,https://cdn.akamai.steamstatic.com/steam/apps/870890/ss_5c6c53c370aac313a14f39d9361242bcb4b9253f.1920x1080.jpg?t=1645622250,https://cdn.akamai.steamstatic.com/steam/apps/870890/ss_39ed4d800f7ac69b2ed3f82451f620a5648cdb80.1920x1080.jpg?t=1645622250,https://cdn.akamai.steamstatic.com/steam/apps/870890/ss_637859a6703e00defb1e417cc4e6437fec8c3c58.1920x1080.jpg?t=1645622250,https://cdn.akamai.steamstatic.com/steam/apps/870890/ss_7b0eecf2c86a3ff622fa2717e38a8ae332846ea9.1920x1080.jpg?t=1645622250,https://cdn.akamai.steamstatic.com/steam/apps/870890/ss_5d34bfd058614aaaf5a7050466e0083c6992e065.1920x1080.jpg?t=1645622250",
    "Slug": "museum-of-symmetry",
    "Meta Title": "Museum of Symmetry: Aug 9, 2018, National Film Board of C...",
    "Meta Description": "Looking for information on Museum of Symmetry? Check out the release date (Aug 9, 2018), developer insights from National Film Board of Canada,Casa Rara...",
    "Alt Text Image": "Official header image for Museum of Symmetry game - Steam 870890",
    "Canonical URL": "https://gusku.site/game/museum-of-symmetry",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Museum of Symmetry\", \"description\": \"Looking for information on Museum of Symmetry? Check out the release date (Aug 9, 2018), developer insights from National Film Board of Canada,Casa Rara...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"National Film Board of Canada,Casa Rara\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Astrea\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/870890/header.jpg?t=1645622250\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}