{
    "AppID": 1633580,
    "Name": "Our Battle Has Just Begun! episode 1",
    "Release date": "Jul 14, 2021",
    "About the game": "Introduction You're reborn into a fantasy world that's already been cleared?! Get ready to be reborn into a fantasy world just seconds before the last boss' demise! You have no memory of your adventure or heroic strength, and yet the people celebrate you as the Hero who saved the realm. 'Our Battle Has Just Begun!' is Visual novel game filled with heroes and heroines... except it starts where 'games' usually end. You become the Hero who defeated the Demon Lord and saved the realm while enjoying the romance that unfolds between you and the heroines you meet on your triumphant return journey. Avoid challenges and happy endings with heroines to continue on your journey back to your homeland. With the last boss defeated,enjoy a realm now at peace from the Demon Lord! This is a comical and slightly serious story about an average guy who ends up becoming a Hero. Meet charming heroines in each episode! Story In the midst of an unconscious state, you hear a voice desperately calling out to you. '....ster...ro... Master Hero!' That's when you wake up and see... the Demon King cursing you as he vanishes into thin air! '...Huh? Is this for real?! But I'm way too late! The Demon Lord was already defeated when I got here!' And so you become the Hero destined to save the realm. At the very moment you deal a deadly blow to the Demon Lord, your memories of your previous life come flowing back. You have saved the world and yet you don't remember doing it. In other words, the hardest part of your fantasy world life is already long over! And thus, the heroic group decides to return to their homeland. Each country you stop in along the way welcomes you with open arms as the Hero who saved the realm. It seems like you have it made, but maybe it really is too good to be true. The real battle is only getting started! Character The Healer, Lutie Lutie is a levelheaded but not straight-laced girl with a big heart. She is from the same holy land as the Hero and was chosen for his party based on her strong abilities. Although usually reserved, she is not at all timid. In the countries the party visits, she becomes a point of contact for royal families and picks up slack for the amnesiac Hero. The Tank, Hilda Hilda is a serious woman who holds herself up to high standards. She takes it upon herself to become a teacher for the amnesiac Hero and the people of the realm. The big sister of the party, Hilda is usually calm but can pack a powerful punch when she gets angry. The Songstress, Carol Carol's beautiful singing and dancing has helped her create a special niche in the hearts of the people. She actively cooperates with the city's vigilante groups and helps protect the people in place of an army of soldiers. Carol's sharp insight and judgement make her out to be a dependable figure, but there is more to her than meets the eye. The Maid, Ibis Ibis is Eugene's new maid. Hailing from the land of water, she seems accompany Eugene wherever he goes, being one infatuated with that land. But behind her cheerful façade seems to lurk a formidable opponent who does not mince her words when it comes to her employer.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1633580/header.jpg?t=1626274801",
    "Price": 9.99,
    "Developers": "VRIDGE INC.",
    "Publishers": "VRIDGE INC.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1633580/ss_5955047b42da7fb48f03dc9648ddc199ad7b4da0.1920x1080.jpg?t=1626274801,https://cdn.akamai.steamstatic.com/steam/apps/1633580/ss_176dc813376d832230a7324d21aac8b889a90867.1920x1080.jpg?t=1626274801,https://cdn.akamai.steamstatic.com/steam/apps/1633580/ss_b5314a90c8f09f1ca542ee5243315a4e49190b5c.1920x1080.jpg?t=1626274801,https://cdn.akamai.steamstatic.com/steam/apps/1633580/ss_a5097e0d56c20180a5855287bae11cddd5a2a575.1920x1080.jpg?t=1626274801,https://cdn.akamai.steamstatic.com/steam/apps/1633580/ss_24d4662cbf40e002a0df7a054ec6e0b98c8712ac.1920x1080.jpg?t=1626274801",
    "Slug": "our-battle-has-just-begun-episode-1",
    "Meta Title": "Our Battle Has Just Begun! episode 1: Jul 14, 2021, VRIDG...",
    "Meta Description": "Looking for information on Our Battle Has Just Begun! episode 1? Check out the release date (Jul 14, 2021), developer insights from VRIDGE INC., and a c...",
    "Alt Text Image": "Official header image for Our Battle Has Just Begun! episode 1 game - Steam 1633580",
    "Canonical URL": "https://gusku.site/game/our-battle-has-just-begun-episode-1",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Our Battle Has Just Begun! episode 1\", \"description\": \"Looking for information on Our Battle Has Just Begun! episode 1? Check out the release date (Jul 14, 2021), developer insights from VRIDGE INC., and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"VRIDGE INC.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VRIDGE INC.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1633580/header.jpg?t=1626274801\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}