{
    "AppID": 919370,
    "Name": "Overdungeon",
    "Release date": "Aug 22, 2019",
    "About the game": "Overdungeon is a completely new style real-time card games that has combined elements from rogue-like, tower defense and card games, which is full of random elements, and easy to play! To defeat formidable enemies and clear the dungeon in the end, you need a deck of powerful cards! Alpaca, Dog and grand Chicken Coop, which one is your Joker. Play it out! ■ Dynamic Deck Building Abounding cards of different types, such as animals, buildings, spells, traps, and so on; and they are still expanding! A card do make a difference with its unique features in a deck. Create your own powerful deck, and make it to the top! ■ Playful Cards with Memes Cards are not just useful in the battle, but also playful with memes! Cats, Dogs, silly Alpacas, Carnot cycle and grand Chicken Coop, this is the Craziest Dungeon ever! Summon the poultry and pets to fight, witness and enjoy the stacking fun! A warm reminder, Trypophobians are advised to avoid! ■ Breathtaking Real-time Battle Play the card right to wipe the enemy out! We combined the RTS mode of Clash Royale to make Overdungeon a semi-real-time strategy game. Ensure you have enough cards to draw and play endlessly in a single run! Come and experience the thrill of crushing a Boss! ■ Everchanging Map Random and changing are cores to a rogue-like game, so does Overdungeon! The map changes every time you play. Every time you enter the dungeon, there is always a brand new adventure awaits you! As the circumstance varies, will you risk your life to challenge elite monsters for the greater loot? Or just take a nap for the forthcoming journey? With more than 50 types of events, you’ll never know what will happen this time! ■ Various Relics To improve the strategy and randomness of Overdungeon, we created the fabulous Relic System! Various relics drop in random, they may upgrade your deck or change draw order, and may further reverse the situation. Keep that in mind, even if Thanos stands against you, you might have what it takes to turn the tide! ■ Patch &amp; Development We updated the game twice or once a week before for players to experience the ever developing and improving Overdungeon. However, in order to optimize the balance of the game and bring you a more complete contents and immersive gaming experience, we’ve decided to slow the pace down. We thank for your understanding and appreciate your continued support!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/919370/header.jpg?t=1624872764",
    "Price": 14.99,
    "Developers": "Pocketpair",
    "Publishers": "Pocketpair",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/919370/ss_8bce69370942880ced0e95e42360a444e5e22448.1920x1080.jpg?t=1624872764,https://cdn.akamai.steamstatic.com/steam/apps/919370/ss_775aa10e6a929b9b496d1176ef419edcbb2535fe.1920x1080.jpg?t=1624872764,https://cdn.akamai.steamstatic.com/steam/apps/919370/ss_e93f8cf1b17dd1e87c105981b0c30bc050b9555b.1920x1080.jpg?t=1624872764,https://cdn.akamai.steamstatic.com/steam/apps/919370/ss_0acd4a87f2dc6511737607e161c53f211505b35a.1920x1080.jpg?t=1624872764,https://cdn.akamai.steamstatic.com/steam/apps/919370/ss_cbdc14fd7811647cc3f94bd57474c7386d90d713.1920x1080.jpg?t=1624872764,https://cdn.akamai.steamstatic.com/steam/apps/919370/ss_ebb1812397b5eae4732d3e8b81a70a82bc38886c.1920x1080.jpg?t=1624872764,https://cdn.akamai.steamstatic.com/steam/apps/919370/ss_e9bb142f3bd244258e8c981f70826bf854bd635c.1920x1080.jpg?t=1624872764,https://cdn.akamai.steamstatic.com/steam/apps/919370/ss_bb6fffcb0beadf12b8482eda80841582dda4d699.1920x1080.jpg?t=1624872764",
    "Slug": "overdungeon",
    "Meta Title": "Overdungeon: Aug 22, 2019, Pocketpair and Full Overview",
    "Meta Description": "Looking for information on Overdungeon? Check out the release date (Aug 22, 2019), developer insights from Pocketpair, and a complete game summary.",
    "Alt Text Image": "Official header image for Overdungeon game - Steam 919370",
    "Canonical URL": "https://gusku.site/game/overdungeon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Overdungeon\", \"description\": \"Looking for information on Overdungeon? Check out the release date (Aug 22, 2019), developer insights from Pocketpair, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 22, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pocketpair\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pocketpair\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/919370/header.jpg?t=1624872764\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}