{
    "AppID": 646050,
    "Name": "Past Cure",
    "Release date": "Feb 23, 2018",
    "About the game": "Story Details Past Cure is a dark psychological thriller that blurs the lines between dreams and reality. An intense, cinematic, story-driven experience that challenges the player to use mind-bending mental abilities to survive. After years of torture, former elite soldier Ian lives in a safe house with his brother, struggling with memory loss and the effects of the experiments he was forced to endure. In an attempt to tap into the hidden power of the mind, his captors left him scarred with unrelenting nightmares, visions and unstable powers such as time manipulation and telekinesis. Driven by his desperate need for the truth and a thirst for revenge; Ian, aided by his brother, sets out on a thrilling hunt for the masterminds of this conspiracy, hoping to uncover exactly what was done to him and why? As Ian plunges into a criminal underworld in pursuit of his only lead, he is forced to use his powers more and more to survive. But with each use, his mind becomes ever more detached from reality, revealing the presence of an even darker force at play. Gameplay Features - A story driven supernatural thriller Past Cure is a cinematic, story driven experience where the player follows the struggle of a broken man searching for the missing pieces of his mind. With intense cutscenes and intriguing story items throughout the levels, the player can unravel a story that will keep them guessing til the end. Action vs. Stealth Be bold and engage your enemies with time bending gun battles and brutal jaw crunching combos. Or pick the stealthy approach where evasion tactics and slick stealth takedowns allow you to outsmart your enemies in silence. Choose the right approach to each situation as there are pros and cons to each playing style. Mind bending abilities Unleash the unlocked power of Ian’s mind against those who unlocked it. To truly master the Past Cure experience, players must utilise time manipulation and astral projection to gain an edge on opponents and overcome obstacles. Dreams vs reality Ians mind is torn between the gritty real world and the nightmarish horror of his dreams. Past Cure contrasts between the cold, brutal combat orientated levels of the real world, to the more puzzle solving and survival gameplay in the abstract dreamworlds.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/646050/header.jpg?t=1549024995",
    "Price": 29.99,
    "Developers": "Phantom 8 Studio",
    "Publishers": "Phantom 8 Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/646050/ss_448a8009135504bebe04e807e361678f7deb7196.1920x1080.jpg?t=1549024995,https://cdn.akamai.steamstatic.com/steam/apps/646050/ss_632ff684c5823982be404c368365f8eb729e130a.1920x1080.jpg?t=1549024995,https://cdn.akamai.steamstatic.com/steam/apps/646050/ss_819fc736eeed9797e097d30b1c831d9b40a56595.1920x1080.jpg?t=1549024995,https://cdn.akamai.steamstatic.com/steam/apps/646050/ss_786f7ca8096caa078e6bca5d0ffad7125a663ecc.1920x1080.jpg?t=1549024995,https://cdn.akamai.steamstatic.com/steam/apps/646050/ss_be41a29b50c6b6d29ed7ffe685753bdb409ffd7d.1920x1080.jpg?t=1549024995",
    "Slug": "past-cure",
    "Meta Title": "Past Cure: Feb 23, 2018, Phantom 8 Studio and Full Overview",
    "Meta Description": "Looking for information on Past Cure? Check out the release date (Feb 23, 2018), developer insights from Phantom 8 Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Past Cure game - Steam 646050",
    "Canonical URL": "https://gusku.site/game/past-cure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Past Cure\", \"description\": \"Looking for information on Past Cure? Check out the release date (Feb 23, 2018), developer insights from Phantom 8 Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 23, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Phantom 8 Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Phantom 8 Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/646050/header.jpg?t=1549024995\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}