{
    "AppID": 17570,
    "Name": "Pirates, Vikings, and Knights II",
    "Release date": "Feb 12, 2010",
    "About the game": "Pirates, Vikings, and Knights II boasts a unique three-team symmetry and a myriad of colorful characters to promote exciting, strategic, and fun gameplay. It features several game modes, each requiring its own special brand of cunning to master. Do battle on a tropical island for control of bountiful treasure. Appease your gods by spilling the blood of your enemies deep within a Mayan temple. Conquer your foes by taking control of precious badlands territory. But most importantly, have FUN! Features &amp; Accolades Three teams with 11 unique player classes Fun, skill-based combat Swords, axes, guns, and explosives Unique voice acting for every character A variety of gorgeous levels Whimsical and challenging achievements Command-able attack parrots 100% FREE! Pirates Skirmisher: A light-footed scallywag who can blow enemies away with his gunpowder-packed keg. Captain: Brandishes a peg-leg, hook, and an attack parrot, which will seek out enemies and peck them to death! Sharpshooter: A Spanish sweet-talker who snipes his enemies from a safe distance, or cuts them to pieces with his butter knife. Vikings Berserker: A shirtless and battle-crazed warrior capable of mowing enemies down with his dual-wielded weapons and giant axe. Huscarl: Throwing axes, a two-handed battle axe, and sword/shield combo allow this warrior to take on the toughest enemies. Gestir: A well-seasoned master of the spear and javelins who has no problem skewering his enemies either up close or from a distance. Bondi: A hunter and survivalist. His bow and atlatl are capable of taking down many enemies before they even know he's there. Knights Heavy Knights: Wearing a full suit of armor, this battle tank can cut his foes in half with his great sword. Archer: There is no match for a skilled archer with a quiver full of arrows. He sometimes reigns fire down upon his enemies. Man-at-Arms: A Frenchman with a sense of humor. He brandishes a halberd, mace &amp; buckler, and his fart special will leave enemies dazed and confused. Assassin: A dagger in the back can take down even her strongest enemies. In case it doesn't, she has a crossbow pistol to finish the job. Game Modes Booty Booty is a unique version of Capture the Flag. Players fight each other for treasure chests filled with gold and jewels. Bring chests back to your base and hold onto them to win the game. Territory Territory is a king of the hill style game mode, where teams fight for territories throughout the map. Hold onto the territories for as long as you can to win the game. Trinket Wars Trinket Wars is the caffeinated version of Team Deathmatch. Teams must gain control of their trinkets, and then use the power of their trinket to destroy their enemies. Last Team Standing Last Team Standing is exactly what the name suggests - all three teams square off, fighting to the death. The last team alive wins the round. Objective Push This game mode can range from a simple break-in and destroy your opponents' bases, to a more advanced sequence of map-specific objectives. The only limit is the mapper's imagination! Team Deathmatch Team Deathmatch is a fight for dominance. Teams square off against one another to see who can rack up the most kills. Like the other game modes, you should stick together to achieve victory!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/17570/header.jpg?t=1647173723",
    "Price": 0.0,
    "Developers": "Octoshark Studios",
    "Publishers": "Octoshark Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/17570/ss_5d36c773396b17f01acb3a4d2388c702057bf85c.1920x1080.jpg?t=1647173723,https://cdn.akamai.steamstatic.com/steam/apps/17570/ss_0f3562d2bc77c99985ff4d1f53eb622c0285e171.1920x1080.jpg?t=1647173723,https://cdn.akamai.steamstatic.com/steam/apps/17570/ss_e736a2d8fa83cb8f68955f2db3d2c0a1025c8e76.1920x1080.jpg?t=1647173723,https://cdn.akamai.steamstatic.com/steam/apps/17570/ss_a23eaa5916abba9c3dfef1820099a0d8dc8875f7.1920x1080.jpg?t=1647173723,https://cdn.akamai.steamstatic.com/steam/apps/17570/ss_562b5c17e9094dd8025419005e8e4862941e4825.1920x1080.jpg?t=1647173723,https://cdn.akamai.steamstatic.com/steam/apps/17570/ss_d2057075113b8a8dbc39fcc26399e4693de73b05.1920x1080.jpg?t=1647173723,https://cdn.akamai.steamstatic.com/steam/apps/17570/ss_5a0aee49db5f101f00622c4429d69bb833da5455.1920x1080.jpg?t=1647173723,https://cdn.akamai.steamstatic.com/steam/apps/17570/ss_67c47e7cdd53d6222b23dbad80c266b8b315084a.1920x1080.jpg?t=1647173723,https://cdn.akamai.steamstatic.com/steam/apps/17570/ss_3a2b0c532c36d46b214c75699a4dedd8646144a6.1920x1080.jpg?t=1647173723,https://cdn.akamai.steamstatic.com/steam/apps/17570/ss_1b03b2d8d186e1c60f0d9766b6116b20a58d1150.1920x1080.jpg?t=1647173723,https://cdn.akamai.steamstatic.com/steam/apps/17570/ss_1489295f84d488bdd5dc8a5b225b47d5e6b8c22e.1920x1080.jpg?t=1647173723,https://cdn.akamai.steamstatic.com/steam/apps/17570/ss_4d31229984f3577c03f1c5ad1de5ad0c19c78634.1920x1080.jpg?t=1647173723,https://cdn.akamai.steamstatic.com/steam/apps/17570/ss_f0216e2445202a41357a46f3b9fec98eecf0a893.1920x1080.jpg?t=1647173723",
    "Slug": "pirates-vikings-and-knights-ii",
    "Meta Title": "Pirates, Vikings, and Knights II: Feb 12, 2010, Octoshark...",
    "Meta Description": "Looking for information on Pirates, Vikings, and Knights II? Check out the release date (Feb 12, 2010), developer insights from Octoshark Studios, and a...",
    "Alt Text Image": "Official header image for Pirates, Vikings, and Knights II game - Steam 17570",
    "Canonical URL": "https://gusku.site/game/pirates-vikings-and-knights-ii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pirates, Vikings, and Knights II\", \"description\": \"Looking for information on Pirates, Vikings, and Knights II? Check out the release date (Feb 12, 2010), developer insights from Octoshark Studios, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 12, 2010\", \"author\": {\"@type\": \"Organization\", \"name\": \"Octoshark Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Octoshark Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/17570/header.jpg?t=1647173723\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}