{
    "AppID": 1117380,
    "Name": "Project Cappuccino",
    "Release date": "Nov 15, 2019",
    "About the game": "You've landed a job at the Resting Bean Cafe &amp; Inn! Friendly coworkers in cute uniforms, great pay-- It's like a dream come true! However, appearances can sometimes be deceiving... You quickly discover that the Resting Bean has its share of secrets. Teamed up with Sophie, you decide to investigate the mysterious happenings in the cafe, but it will prove to be a harder task when your carnal desires seem to distract you at every turn. Just what will you discover, and who will you trust? Sophie An energetic waitress who's being worked to the bone. The cafe has been severely understaffed and she's been doing everything she can to keep things under control. She can be clumsy and prone to accidents, but she doesn't let that stop her. Her cheerful personality will help get you through the tough cafe shifts, even on the worst of days! There's also rumors that she's somewhat of a voyeur... Colette The original owner of the Resting Bean cafe. Her puppet like appearance is the result of a strange curse, but she refuses to go into details about it. On the outside, she can seem cold and uncaring, but in reality, she's extremely loyal when it comes to her employees. Her no bullshit attitude makes her one of the Resting Bean cafe's greatest assets. Cerise The childhood friend of Sophie. Cerise is a timid witch that comes from a long line of spell-casters. Her family had access to an ancient tome, from which she learned a unique type of magic that allows her to bring inanimate objects to life. Cerise takes up a job offer at the Resting Bean cafe and quickly learns that it's difficult work. Her cowardly personality hides the fact that she's into some really kinky bondage stuff. It's always the quiet ones. Mira The current manager and owner of the Resting Bean Cafe. Mira's seductive wiles have allowed her to get far in life, but there's something off about her. She doesn't seem to care much about the cafe, and is an extremely manipulative person. Just what is she hiding, and what are her goals? You control the action! Various toys have their own mechanics for you to experiment with. Original Story Spanning 4 Chapters. 8 Different Endings where your choices matter. Over 15 different toys to use! Involve yourself directly in the sex gameplay! Multitude of Fetishes! Bondage, Anal, Voyeurism, Public Humiliation, Tentacles and More. Original Soundtrack. 5 characters to take into sexual encounters. Use a myriad of toys to find out what they like best! 3 Different Locations for sex encounters, each with their own unique features. Shop System to buy new toys with your cafe money. (Sassy clerk included) Gallery System with over 80 Full Resolution Art Pieces. Free Play Mode to dive right into the action. Completely Uncensored! Easter Eggs and Secrets!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1117380/header.jpg?t=1633186087",
    "Price": 9.74,
    "Developers": "Tentakero",
    "Publishers": "Tentakero",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1117380/ss_f6921393a8c6facaa593a61907f7eccbad47d48d.1920x1080.jpg?t=1633186087,https://cdn.akamai.steamstatic.com/steam/apps/1117380/ss_cd57fb2f5cadeb2535c9cc6741a186be56762ec2.1920x1080.jpg?t=1633186087,https://cdn.akamai.steamstatic.com/steam/apps/1117380/ss_b214cb6bdc0aca3aab2c4d5595986ce9670ca7f7.1920x1080.jpg?t=1633186087,https://cdn.akamai.steamstatic.com/steam/apps/1117380/ss_73bc838b52cd4c987b6fb41a190348c01bc0d62f.1920x1080.jpg?t=1633186087,https://cdn.akamai.steamstatic.com/steam/apps/1117380/ss_e2af647afe3d0323f8515e10bee4a2158bf765ff.1920x1080.jpg?t=1633186087,https://cdn.akamai.steamstatic.com/steam/apps/1117380/ss_cb63069c6eea022ed4e106c5d89f38c8dd5cffb4.1920x1080.jpg?t=1633186087,https://cdn.akamai.steamstatic.com/steam/apps/1117380/ss_496b62c125043d286ba6dd063c2d96f61f89cfae.1920x1080.jpg?t=1633186087,https://cdn.akamai.steamstatic.com/steam/apps/1117380/ss_f0d7cf39dd25ec51e84eea27bf6e0cd344d010c7.1920x1080.jpg?t=1633186087,https://cdn.akamai.steamstatic.com/steam/apps/1117380/ss_a76b3088b7a455512a6dad19ababcb4f9554057c.1920x1080.jpg?t=1633186087,https://cdn.akamai.steamstatic.com/steam/apps/1117380/ss_f725f3806add6d6d42721bd582dfdf60d8bc60fa.1920x1080.jpg?t=1633186087,https://cdn.akamai.steamstatic.com/steam/apps/1117380/ss_8e72df6b2b92e0e60329c1dd042d46557c1ea5a8.1920x1080.jpg?t=1633186087,https://cdn.akamai.steamstatic.com/steam/apps/1117380/ss_480cc25e1964f0c74e0f95dfeca4fc5976ce4453.1920x1080.jpg?t=1633186087",
    "Slug": "project-cappuccino",
    "Meta Title": "Project Cappuccino: Nov 15, 2019, Tentakero and Full Over...",
    "Meta Description": "Looking for information on Project Cappuccino? Check out the release date (Nov 15, 2019), developer insights from Tentakero, and a complete game summary.",
    "Alt Text Image": "Official header image for Project Cappuccino game - Steam 1117380",
    "Canonical URL": "https://gusku.site/game/project-cappuccino",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Project Cappuccino\", \"description\": \"Looking for information on Project Cappuccino? Check out the release date (Nov 15, 2019), developer insights from Tentakero, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tentakero\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tentakero\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1117380/header.jpg?t=1633186087\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.74, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}