{
    "AppID": 252950,
    "Name": "Rocket League®",
    "Release date": "Jul 6, 2015",
    "About the game": "Rocket League is a high-powered hybrid of arcade-style soccer and vehicular mayhem with easy-to-understand controls and fluid, physics-driven competition. Rocket League includes casual and competitive Online Matches, a fully-featured offline Season Mode, special “Mutators” that let you change the rules entirely, hockey and basketball-inspired Extra Modes, and more than 500 trillion possible cosmetic customization combinations. Winner or nominee of more than 150 “Game of the Year” awards, Rocket League is one of the most critically-acclaimed sports games of all time. Boasting a community of more than 57 million players, Rocket League features ongoing free and paid updates, including new DLCs, content packs, features, modes and arenas. What's New: Rocket Pass - Purchase Rocket Pass Premium to get an initial 50% XP bonus and earn up to 70 unique rewards, including a new Battle-Car, Goal Explosion, Keys, and more! Challenge System - Play Online Matches and complete Weekly Challenges to tier up and unlock unique rewards only found in Rocket Pass. Esports Shop - Show off your team pride for your favorite teams in Rocket League Esports! The Rocket League Esports Shop pilot program brings new Decals, Wheels, and Player Banners that represent some of the best teams in the sport. of the best teams in the sport. SteamOS and Mac Beta Versions As we continue to upgrade Rocket League® with new technologies like DirectX 11 and a 64-bit client, it is no longer viable for us to maintain support for the macOS and Linux (SteamOS) platforms. As a result, the final patch for the macOS and Linux versions of Rocket League was released on March 10, 2020. This update disabled online functionality (such as Casual and Competitive Playlists) for players on macOS and Linux, but offline features including Local Matches, and splitscreen play are still accessible. Please note that Rocket League® on SteamOS and macOS may have bugs and stability issues not seen in the Windows version of the game, and these issues may not be fixed in future updates. NOTE: Because of agreements with our online service provider, there are certain regions that are unable to connect to Rocket League®’s online multiplayer component. As a result, server access is restricted in China, Crimea, Cuba, Iran, North Korea, Sudan, and Syria. Apologies to our customers in those regions. Software and online features are subject to license, terms of use, and privacy policy ( rocketleague.com/eula , rocketleague.com/tou , and rocketleague.com/privacy ).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/252950/header.jpg?t=1655312496",
    "Price": 0.0,
    "Developers": "Psyonix LLC",
    "Publishers": "Psyonix LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/252950/ss_8963270608c5f882344d8e4d0f71177fae209248.1920x1080.jpg?t=1655312496,https://cdn.akamai.steamstatic.com/steam/apps/252950/ss_0e9b729378b32312f854a80d6ef52fa67601798c.1920x1080.jpg?t=1655312496,https://cdn.akamai.steamstatic.com/steam/apps/252950/ss_fb7ae2d2d579395d0f3d87588545dbdd164395cf.1920x1080.jpg?t=1655312496,https://cdn.akamai.steamstatic.com/steam/apps/252950/ss_1f57538ff78065670dc336f099e6d36bf05d98a7.1920x1080.jpg?t=1655312496,https://cdn.akamai.steamstatic.com/steam/apps/252950/ss_5caac658d88a3a93381f6a8c7bcba9f5976c4a95.1920x1080.jpg?t=1655312496,https://cdn.akamai.steamstatic.com/steam/apps/252950/ss_02efccbe736d3150041aef5f8740baa0df8f2640.1920x1080.jpg?t=1655312496",
    "Slug": "rocket-league",
    "Meta Title": "Rocket League®: Jul 6, 2015, Psyonix LLC and Full Overview",
    "Meta Description": "Looking for information on Rocket League®? Check out the release date (Jul 6, 2015), developer insights from Psyonix LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Rocket League® game - Steam 252950",
    "Canonical URL": "https://gusku.site/game/rocket-league",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rocket League\\u00ae\", \"description\": \"Looking for information on Rocket League\\u00ae? Check out the release date (Jul 6, 2015), developer insights from Psyonix LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 6, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Psyonix LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Psyonix LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/252950/header.jpg?t=1655312496\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}