{
    "AppID": 492150,
    "Name": "RPG World - Action RPG Maker",
    "Release date": "Jul 17, 2020",
    "About the game": "RPG World - Where action RPG begins! RPG World is an action RPG adventure creator with built-in worlds; ready to be conquered and kick-start your imagination. Solid multi-player means you can battle alongside or against friends and foes with PvP and Co-Op modes. Explore friends worlds and host workshop games and join others games without restriction. Play Battle your way through enemies and quests in our pre-made adventures, such as 'The Blight' and 'Mushroom Realm'. Combat is rewarding, learn enemy timings and use 4 special abilities to smash apart your foes. Most world objects are breakable! These worlds amongst others are showcases for what can be crafted in RPG World. We can't wait to play yours! Create With a powerful yet easy to use Editor, you can create worlds within RPG World in exactly the way you want to play. We've put together a small starter pack of assets to get you started making your first RPG World levels, and if you want a complete game assets collection at your fingertips you can check out the Creative Pack, or one of the DLCs which add themed assets if you want your adventure set in a specific game environment. You can deform the terrain in real time with modelled pieces or use more traditional terrain tools. Place a building down, decorate the inside with tables, shelves, put items on them, then grab the house and move everything inside it. World Painter Get creative and totally change the feel of your worlds by painting its contents. From barrels to houses, let the paint flow! Tell stories, set quests Add depth to your worlds by easily dropping in NPCs from the Editor. Create unique quest chains with kill and collect objectives, harder the quests the more XP you or visitors to your world will get! Tell stories with 'Dialog' options. Chose a faction for any character (characters can fight alongside you or against others - create a huge battle and chose if the enemies will fight endlessly until you intervene or actually destroy each other), keys to unlock gates and doors, enemy stash drops - allowing you to have enemies hold the items needed for quests. Quests can chain together and end with a different NPC they started with. Character Progression and Loot When you play the games you make or games made by others, you will be able to level up your characters in many ways. You can use the built-in progression skills chart to increase your proficiency in health, stamina, luck and other attributes, or collect loot from fallen enemies to add to your character's inventory to boost your capabilities in combat. Mounts Available If you've created a large world, you will want to get around it quickly. You will find a stable of horses, ready for you to mount and ride the length and breadth of the games you create. Choose from simple dusty nags to armor-clad satans of the hoof. Hub World Control everything through your Hub World. Create, join, watch tutorials on 'RPG World TV', change your hero character and more, simply by running over buttons or through portals. Community &amp; Steam Workshop Run through the Steam Workshop portal in your Hub World to access worlds created by users. Join worlds via the hub world multiplayer portals, and get to know new players with in-game chat. You can even host worlds that come with RPG World, and worlds created by others too. Free Version restrictions You can make up to 2 worlds in the Free version, but you can't chain them together to make a game to host on the Steam workshop. If you want to create unlimited games with as many worlds chained together as you want, and then share that game on Steam, you'll need the Creative Pack DLC.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/492150/header.jpg?t=1595002347",
    "Price": 0.0,
    "Developers": "RaveyLarge",
    "Publishers": "RaveyLarge",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/492150/ss_9499f2e0d879e2a4acb9def993f5a415a792bb52.1920x1080.jpg?t=1595002347,https://cdn.akamai.steamstatic.com/steam/apps/492150/ss_48d41188170b1166a83537b33052a0bdbf47daec.1920x1080.jpg?t=1595002347,https://cdn.akamai.steamstatic.com/steam/apps/492150/ss_dad2eb29b36abaf917c26dad48f144c69d3c9389.1920x1080.jpg?t=1595002347,https://cdn.akamai.steamstatic.com/steam/apps/492150/ss_98e9cedabd0ef32b236afd60625cd1a52fb1e0e9.1920x1080.jpg?t=1595002347,https://cdn.akamai.steamstatic.com/steam/apps/492150/ss_8b1061bb2d8850e40618414af58e7c273896202d.1920x1080.jpg?t=1595002347,https://cdn.akamai.steamstatic.com/steam/apps/492150/ss_a860c14d775fc206082b112d12b365a49a995315.1920x1080.jpg?t=1595002347,https://cdn.akamai.steamstatic.com/steam/apps/492150/ss_fdb994cf3fc49fbe613316be3e12dc9d9205eddf.1920x1080.jpg?t=1595002347,https://cdn.akamai.steamstatic.com/steam/apps/492150/ss_0f73119aff054a67c708a63b3c0365e4dadaa96a.1920x1080.jpg?t=1595002347,https://cdn.akamai.steamstatic.com/steam/apps/492150/ss_2d200537af5f2c4ae7ccadbf1d70db2fbf43f791.1920x1080.jpg?t=1595002347,https://cdn.akamai.steamstatic.com/steam/apps/492150/ss_df9bbe9534d711124897bbe2c86c8d3ea6712f4b.1920x1080.jpg?t=1595002347",
    "Slug": "rpg-world-action-rpg-maker",
    "Meta Title": "RPG World - Action RPG Maker: Jul 17, 2020, RaveyLarge an...",
    "Meta Description": "Looking for information on RPG World - Action RPG Maker? Check out the release date (Jul 17, 2020), developer insights from RaveyLarge, and a complete g...",
    "Alt Text Image": "Official header image for RPG World - Action RPG Maker game - Steam 492150",
    "Canonical URL": "https://gusku.site/game/rpg-world-action-rpg-maker",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RPG World - Action RPG Maker\", \"description\": \"Looking for information on RPG World - Action RPG Maker? Check out the release date (Jul 17, 2020), developer insights from RaveyLarge, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 17, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"RaveyLarge\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"RaveyLarge\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/492150/header.jpg?t=1595002347\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}