{
    "AppID": 924130,
    "Name": "Slime-san: Creator",
    "Release date": "Dec 8, 2018",
    "About the game": "SUMMARY Create Slime-san based platforming levels with incredible precision and ease. Unleash your creativity using over 100 mechanics and enemies and share your creations with the world! Perhaps we'll see your levels in the popular list soon? Slime-san Creator is the newest the addition to the Slime-san line-up which allows you to create and share levels with the world! The intuitive UI, which is fully gamepad friendly as well, eases you into the creation process until you can create levels with ease. With over 100 mechanics and enemies to choose from, as well as a myriad of additional customization option, you'll be able to create truly unique levels for other players to enjoy and play online. Not into creating levels? No worries! Use our level browser to filter by new or popular levels and add them to your favorites. You can even search for level creators or level IDs. With the Slime-san Creator you'll have thousands of amazing levels to play, with more coming in each day! How exciting is that, huh?! FEATURES Create levels using over 100 different enemy types &amp; mechanics. Adjust the length of your levels and add modifiers on top of them like adding water or inverting gravity! Write descriptions, titles and pick your music, color palette and more! Customization galore! Share and browse for levels online! Sort by new or popular and favorite levels you like. Directly search for level creators or level IDs to share them easily with friends and family! A possibly infinite amount of Slime-san levels are waiting to be made and played! HISTORY Slime-san was picked as a 'Digital Gem' by Sony on the Playstation 4 Store and was highlighted as a 'Top Game of August' by Nintendo on the Nintendo Switch eShop. Slime-san was also nominated as one of the 'Best Platformers of 2017' by IGN and is currently listed in the top 30 best Switch Games of 2017 and top 30 best PS4 Games of 2018 in Metacritic. Slime-san's also available physically for the Nintendo Switch thanks to Limited Run Games. In addition to that Indiebox created some incredible Slime-san plushes and Blackscreen Records printed some beautiful vinyls to celebrate the all-star soundtrack of Slime-san. DISCLAIMER This is the standalone version of Slime-san's Level Editor, included in the Slime-san: Superslime Edition! / Levels are NOT shared across versions!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/924130/header.jpg?t=1649752093",
    "Price": 2.03,
    "Developers": "Fabraz,David Laskey",
    "Publishers": "Headup",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/924130/ss_66bd579341240381e8e4c48847eb240b9e7b5fa1.1920x1080.jpg?t=1649752093,https://cdn.akamai.steamstatic.com/steam/apps/924130/ss_db209f1a4df21e8fc4ea73ea19ca6db966b37f8b.1920x1080.jpg?t=1649752093,https://cdn.akamai.steamstatic.com/steam/apps/924130/ss_d2310774e035cf4c809f9d8ab962296cccb75473.1920x1080.jpg?t=1649752093,https://cdn.akamai.steamstatic.com/steam/apps/924130/ss_3e076c1c0dc9345cdf8167f40d865dbbdc43d5f5.1920x1080.jpg?t=1649752093,https://cdn.akamai.steamstatic.com/steam/apps/924130/ss_944cd4c8b7784b272f43f17e06e812b2779b6dd0.1920x1080.jpg?t=1649752093",
    "Slug": "slime-san-creator",
    "Meta Title": "Slime-san: Creator: Dec 8, 2018, Fabraz,David Laskey and ...",
    "Meta Description": "Looking for information on Slime-san: Creator? Check out the release date (Dec 8, 2018), developer insights from Fabraz,David Laskey, and a complete gam...",
    "Alt Text Image": "Official header image for Slime-san: Creator game - Steam 924130",
    "Canonical URL": "https://gusku.site/game/slime-san-creator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Slime-san: Creator\", \"description\": \"Looking for information on Slime-san: Creator? Check out the release date (Dec 8, 2018), developer insights from Fabraz,David Laskey, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fabraz,David Laskey\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Headup\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/924130/header.jpg?t=1649752093\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.03, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}