{
    "AppID": 1750900,
    "Name": "Super Punchy Face",
    "Release date": "Nov 6, 2021",
    "About the game": "Put your creativity to the test in the frenetic, sandbox combat . Do whatever it takes to win against equally capable opponents, in levels that are different every time. Between each fight, choose from a random selection of techniques to perfect your style . You’ll be breaking everything you touch , either by hitting someone with it or by hitting it with someone . Similar to the style of classic beat ‘em ups like Streets of Rage or River City Ransom, but with the unpredictable and highly replayable design of modern roguelites like Spelunky and Nuclear Throne. Combine all that with the slapstick improvisation of a Jackie Chan movie, and you got a beat 'em up with endless possibilities . Features Everything is a weapon - From beanbag chairs to ping-pong paddles, mop buckets to candy boxes, everything can be swung, thrown, kicked, and used in creative ways to defeat your opponents. No magic, no guns, no swords, no killing. You’ll have to take advantage of everyday objects around you just to stand a chance against the relentless opponents. It's up to you to decide how to use the objects you find. They break easy though, so make em count! Custom fighting styles – Choose from dozens of techniques to create your individual fighting style. No boring stat boosts, these upgrades change the way your moves work or introduce entirely new ones for you to master. Unlock new techniques through challenges and use them from the very start of new runs. Make careful decisions about which abilities to take between levels - do you want to be able to tear through enemies, or do you need more ways to defend yourself? Between each level, you get to choose one of three random techniques to take with you through the end of your run. Each run will feel different as you won’t be given the same options as last time. (These will have fun names and be represented as cool pins Punchy puts on their jacket in the final game) Sandbox gameplay - Players are encouraged to experiment with the overlapping systems, and are rewarded with a vast possibility space full of slapstick situations. You can fight like a choreographed action hero one minute, and then scramble to dodge an incoming car the next. The simple controls make it easy to navigate the chaos, as everything and everyone interacts with each other in exciting but predictable ways. Sometimes the best way to fight a group is to make them fight each other…. Story Control titular hero Punchy as they and their uncle stand up to the evil Landlord and embark on a heartwarming quest to save their dojo from being demolished. Punchy is a dedicated, idealistic martial artist. They usually spend their time trying to drum up business for their uncle Jaygo’s dojo, or training with him in the obstacle course. But with the community center - and the whole neighborhood - about to be destroyed, Punchy knows it’s time to take action. Jaygo is Punchy’s uncle, a long-time mentor to the community and a martial arts master. He’s spent years teaching Punchy how to kick ass and be kind, and now it’s time to put those skills to the test. Jaygo makes sure Punchy knows they can’t give up no matter how difficult things get. Up on top of the hill, looking down on the rest of the community, lives The Landlord. He owns the whole town, but no one even knows his name. He’s demolishing Punchy and Jaygo’s whole block, and with City Hall in his pocket, there’s enough red tape that no one can stop him. Brutus has been the Landlord's bodyguard for years, taking care of issues so he doesn’t have to dirty his hands. A job is a job - but something about Punchy’s tenacity makes her think twice… These baddies work for the Landlord too, though they’re not exactly thrilled about it. Here to make everyone’s lives more difficult, they seem to always be one step ahead of our heroes.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1750900/header.jpg?t=1637809930",
    "Price": 9.99,
    "Developers": "8points",
    "Publishers": "8points",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1750900/ss_aa20d3e1bd1941030add0870a72da4ac337e7def.1920x1080.jpg?t=1637809930,https://cdn.akamai.steamstatic.com/steam/apps/1750900/ss_2e6e61610800b7218f2d847ddedda04c1efb1313.1920x1080.jpg?t=1637809930,https://cdn.akamai.steamstatic.com/steam/apps/1750900/ss_c9dca9f8b78ae44473b60df0b8ad04506672cee0.1920x1080.jpg?t=1637809930,https://cdn.akamai.steamstatic.com/steam/apps/1750900/ss_0e008990caa08ba23546333fa61aa95d8e8caf58.1920x1080.jpg?t=1637809930,https://cdn.akamai.steamstatic.com/steam/apps/1750900/ss_dc7e98d270178929c34439cde23e4483debda806.1920x1080.jpg?t=1637809930,https://cdn.akamai.steamstatic.com/steam/apps/1750900/ss_cb3e9f6eb3b9f394dbbaad973b3199952c34eda7.1920x1080.jpg?t=1637809930",
    "Slug": "super-punchy-face",
    "Meta Title": "Super Punchy Face: Nov 6, 2021, 8points and Full Overview",
    "Meta Description": "Looking for information on Super Punchy Face? Check out the release date (Nov 6, 2021), developer insights from 8points, and a complete game summary.",
    "Alt Text Image": "Official header image for Super Punchy Face game - Steam 1750900",
    "Canonical URL": "https://gusku.site/game/super-punchy-face",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Super Punchy Face\", \"description\": \"Looking for information on Super Punchy Face? Check out the release date (Nov 6, 2021), developer insights from 8points, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 6, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"8points\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8points\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1750900/header.jpg?t=1637809930\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}