{
    "AppID": 1621980,
    "Name": "Territory: Animals Genetic Strategy",
    "Release date": "May 31, 2022",
    "About the game": "Territory is an isometric 2D real-time single-player strategy about genes and animal species. Animals are behaving the way they would in nature, but you can indirectly control them and mutate them to achieve various goals. Game Highlights Evolve: update genes to change behavior of your species Eat: animals need to eat food to survive, define what food they can eat Reproduce: increase your population, improve fertility, prolong your life, hide better from predators, too high population leads to diseases Expand: expand your territories, migrate to new territories to increase your population further Fight: fight species that stands in your way Play for more than 40 species and mutate them or define your own species Play on 3 different biomes with more than 80 different genes Play 12 maps in 3 different modes - standard, custom, creative Core Gameplay Mechanics You are entering the game with one or more species and can add multiple species later on. You are changing the species genome and that is changing its attributes and behavior. You are playing on the maps with an existing ecosystem that is producing various sources of food. You can expand to new territories. You can invade enemy species. You can defend your territories. Species are hostile only when they share the same source of food and have similar size. You can have various goals like target biomass, biodiversity, or dominance in ecosystem. Species in the ecosystem can die out or can mutate to new species in time. Species can be herbivores, omnivores, or carnivores and can have one of four different sizes. Species lives complete life from being born to death, need food to survive. Each species has its own territory, its size and shape can be adjusted. Individual animal can die in a fight, starve to death, can be killed by a predator, die by disease, or die by old age. You are evaluating your surroundings and the ecosystem to determine your next steps. Species react indirectly to your commands if certain conditions are met (migrate to new territory only when not being hungry, have certain genes, etc.). Game Modes Standard mode where you play on a map with predefined goals and settings. Custom mode where you can change map settings like initial number of species or genes generation speed. Creative mode where you play on an empty map without any limitations. Join us on Discord",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1621980/header.jpg?t=1655929856",
    "Price": 14.99,
    "Developers": "Simplemole",
    "Publishers": "Simplemole",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1621980/ss_c068dcdbcd477a554daf3ee4e763e9b81c442a62.1920x1080.jpg?t=1655929856,https://cdn.akamai.steamstatic.com/steam/apps/1621980/ss_2562808ea416f0bdd2c6d3a48eff9972f8f90afb.1920x1080.jpg?t=1655929856,https://cdn.akamai.steamstatic.com/steam/apps/1621980/ss_7fc7827c00cd0b0351c95fb1b07a1571fe04eff4.1920x1080.jpg?t=1655929856,https://cdn.akamai.steamstatic.com/steam/apps/1621980/ss_a06b36a4a13dd9b1d169d0c2c267b5bad675009b.1920x1080.jpg?t=1655929856,https://cdn.akamai.steamstatic.com/steam/apps/1621980/ss_14f382d15e128df4053141add82cc1b366f53e8b.1920x1080.jpg?t=1655929856,https://cdn.akamai.steamstatic.com/steam/apps/1621980/ss_533777275a918bc75b8417aca2dbb8b2d108ce53.1920x1080.jpg?t=1655929856,https://cdn.akamai.steamstatic.com/steam/apps/1621980/ss_ec5f40f8415cd37861815489c6595284a5d92eb6.1920x1080.jpg?t=1655929856",
    "Slug": "territory-animals-genetic-strategy",
    "Meta Title": "Territory: Animals Genetic Strategy: May 31, 2022, Simple...",
    "Meta Description": "Looking for information on Territory: Animals Genetic Strategy? Check out the release date (May 31, 2022), developer insights from Simplemole, and a com...",
    "Alt Text Image": "Official header image for Territory: Animals Genetic Strategy game - Steam 1621980",
    "Canonical URL": "https://gusku.site/game/territory-animals-genetic-strategy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Territory: Animals Genetic Strategy\", \"description\": \"Looking for information on Territory: Animals Genetic Strategy? Check out the release date (May 31, 2022), developer insights from Simplemole, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Simplemole\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Simplemole\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1621980/header.jpg?t=1655929856\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}