{
    "AppID": 582200,
    "Name": "The Physiology of the Eye",
    "Release date": "Jan 19, 2017",
    "About the game": "'The Physiology of the Eye' is an interactive VR platform, that features two modes. It starts in a real-time automatic training mode that guides you through our visual content. Then, at any time in the application, the user can push the 'Mode' button on the VR controller and switch to our interactive training mode. This allows the user to choose which areas they need to focus on and learn at their own pace. This includes a new labeling system which allows you to expand each label to find out more about the exact 3D piece you have selected and to get an in-depth understanding of each structure. These new labels also have audio clips attached to them so you can hear exactly how to pronounce the various parts of the model. Even in Chinese. This application also includes an assessment system to judge your learning comprehension with our interactive testing system. It will also provide you with a final GPA at the end of the course. Quotes: '...facilitates learning through active engagement in the content and allows learners to apply content in ways that quickly and effectively solve challenges and create new opportunities.' - Charles H. Patti, Ph.D. , University of Denver and Queensland University of Technology. '...photorealism aesthetics and scientific accuracy, the perfect mix to take education to the next level.' - Alban Denoyel , CEO &amp; Co-founder @ Sketchfab 'A beautiful example of how virtual reality is poised to transform life sciences and education.' - Sean Wagstaff , NVIDIA Features: Automatic mode: Like a traditional text book, with sections in the chapter and voice over talking to you about the model in front of you. Interactive mode: Use this mode to pick the models up, scale, rotate, as well as pull on different parts of the model to see how it functions. You can also select the different parts of the model to find out what they are and learn at your own pace. Scientifically accurate representations Quizzes with final GPA About the team: Intervoke was started to create world class scientifically accurate content applications and 3D animations to effectively communicate various complex biological interactions inside the human body. Our team consists of 3D animators, medical illustrators, Software engineers, virtual reality specialists, and custom tailored physicians. We have come together to custom engineer virtual reality training programs and 3D animations for scientific visualization. Using photo-realistic thought provoking visuals, we can achieve detailed scientific accuracy. All while presenting content using custom designed clean interactive interfaces. We are passionate about science and technology and maintain the highest possible quality.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/582200/header.jpg?t=1647360490",
    "Price": 1.99,
    "Developers": "Intervoke",
    "Publishers": "Intervoke",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/582200/ss_0ac2497b1c7c63e08f32a8420f4fb12788fae797.1920x1080.jpg?t=1647360490,https://cdn.akamai.steamstatic.com/steam/apps/582200/ss_56418fbe98d8f48d1aa83d083bcb1431b9c03f0a.1920x1080.jpg?t=1647360490,https://cdn.akamai.steamstatic.com/steam/apps/582200/ss_85e0e1905d0bd801a24f71e21465cc4db08c227c.1920x1080.jpg?t=1647360490,https://cdn.akamai.steamstatic.com/steam/apps/582200/ss_9b692776c7686c1b178607d60ed2c0a625801a4e.1920x1080.jpg?t=1647360490,https://cdn.akamai.steamstatic.com/steam/apps/582200/ss_3fe13735bd8aefae9b3b4e1f774daa4168ae195f.1920x1080.jpg?t=1647360490,https://cdn.akamai.steamstatic.com/steam/apps/582200/ss_385b3ae520eb27fe909f34780eb4d2767c9a5527.1920x1080.jpg?t=1647360490,https://cdn.akamai.steamstatic.com/steam/apps/582200/ss_60c9f7039d202591311294509d152e2456bf6e91.1920x1080.jpg?t=1647360490",
    "Slug": "the-physiology-of-the-eye",
    "Meta Title": "The Physiology of the Eye: Jan 19, 2017, Intervoke and Fu...",
    "Meta Description": "Looking for information on The Physiology of the Eye? Check out the release date (Jan 19, 2017), developer insights from Intervoke, and a complete game ...",
    "Alt Text Image": "Official header image for The Physiology of the Eye game - Steam 582200",
    "Canonical URL": "https://gusku.site/game/the-physiology-of-the-eye",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Physiology of the Eye\", \"description\": \"Looking for information on The Physiology of the Eye? Check out the release date (Jan 19, 2017), developer insights from Intervoke, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 19, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Intervoke\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Intervoke\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/582200/header.jpg?t=1647360490\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}