{
    "AppID": 868270,
    "Name": "The Cycle: Frontier",
    "Release date": "Jun 8, 2022",
    "About the game": "Welcome to Fortuna III, a forsaken world where the stakes are high and the rewards higher! Drop down onto the surface and fill your pockets with treasures and resources. Be wary though, only those who make it out alive are allowed to keep their spoils. Keep an eye out for bloodthirsty beasts and greedy players – or set out to actively hunt those and steal their hard-earned prizes for yourself. Secure a seat on the nearest evac ship to safeguard your loot. Upgrade your gear, purchase new equipment and complete faction-based contracts to increase your gains and unlock new combat options. Prospecting is a risky venture, but greed is sometimes rewarded by the promise of glory. After all, fortune favors the bold in the eye of the storm. GREATER RISKS YIELD GREATER REWARDS The life of a Prospector is full of danger, but any extra peril is sure to be worth it. You can go it alone or team up but be wary, the more valuable your haul the bigger the risk. Tread recklessly and risk attracting the attention of a pack of sneaky Striders or a monstrous Crusher. Cause too much noise fending off the wildlife and you may give away your position to another trigger-happy player. Remember, losers come home empty-handed, so watch your back. DROP DOWN AT A MOMENTS NOTICE Map instances stay open for several hours, so Prospectors can drop to the planets surface at any time as long as the storm is not raging. This means no waiting in a queue for other players – you just drop onto the surface and off you go. And while you're down there, be prepared for a constant ebb and flow of threats and opportunities, as others get taken out or evacuate, and are replaced by new arrivals! A WORLD OF TREACHEROUS BEAUTY Fortuna III is a lush, mysterious planet on the edge of the galaxy. Once prized for its natural resources, it was ravaged by the Cycle, a radioactive storm that quickly wiped-out civilization, leaving behind ghost settlements and forcing survivors to retreat to the orbiting station. The storm is still a threat and yet the surface is full of spoils and treasures. Will you hunker down to survive the stormy night or use this risky opportunity to look for rare materials? CALM ABOVE THE STORM Returning to the relative safety of Prospect Station will allow you to secure your spoils and turn in your completed contracts. Use your newfound resources to improve your personal quarters with permanent upgrades and purchase new equipment. Tune up your favorite weapons with a neat array of mods and gear up with the perfect tools for your next drop. This may not be a corner of paradise but it’s home. Your home.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/868270/header.jpg?t=1656338699",
    "Price": 0.0,
    "Developers": "YAGER",
    "Publishers": "YAGER",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/868270/ss_0ba9e10cc6e771dd5c212da88f76a9bbec89a3c6.1920x1080.jpg?t=1656338699,https://cdn.akamai.steamstatic.com/steam/apps/868270/ss_87ea6e482b12e36df52030d9ab16fd5c658e84a1.1920x1080.jpg?t=1656338699,https://cdn.akamai.steamstatic.com/steam/apps/868270/ss_c1e38723a15f3f8659e5a14b2194cdf1692f2cb5.1920x1080.jpg?t=1656338699,https://cdn.akamai.steamstatic.com/steam/apps/868270/ss_7441dda59a96f590d652df179cb6f7ccbb14ca6f.1920x1080.jpg?t=1656338699,https://cdn.akamai.steamstatic.com/steam/apps/868270/ss_a214b64faa84ac3e0488f060c4d7d034c5b6222b.1920x1080.jpg?t=1656338699,https://cdn.akamai.steamstatic.com/steam/apps/868270/ss_25217f82e2a448a86e62affd6b60619ea65f960d.1920x1080.jpg?t=1656338699,https://cdn.akamai.steamstatic.com/steam/apps/868270/ss_e261f44ac922e46035e18612655fe7db7ec86a4f.1920x1080.jpg?t=1656338699,https://cdn.akamai.steamstatic.com/steam/apps/868270/ss_763a356ffa8f9cebc0d40bf89b18259893b0745e.1920x1080.jpg?t=1656338699,https://cdn.akamai.steamstatic.com/steam/apps/868270/ss_36dc8ea9ac27b832864506895323fae7793d03f1.1920x1080.jpg?t=1656338699,https://cdn.akamai.steamstatic.com/steam/apps/868270/ss_f1eebf1b02bec10153ead259cd1d27a59f4f8559.1920x1080.jpg?t=1656338699,https://cdn.akamai.steamstatic.com/steam/apps/868270/ss_9af9882da7fcfb29b8ea7b22d886daa2d2c7245d.1920x1080.jpg?t=1656338699",
    "Slug": "the-cycle-frontier",
    "Meta Title": "The Cycle: Frontier: Jun 8, 2022, YAGER and Full Overview",
    "Meta Description": "Looking for information on The Cycle: Frontier? Check out the release date (Jun 8, 2022), developer insights from YAGER, and a complete game summary.",
    "Alt Text Image": "Official header image for The Cycle: Frontier game - Steam 868270",
    "Canonical URL": "https://gusku.site/game/the-cycle-frontier",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Cycle: Frontier\", \"description\": \"Looking for information on The Cycle: Frontier? Check out the release date (Jun 8, 2022), developer insights from YAGER, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"YAGER\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"YAGER\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/868270/header.jpg?t=1656338699\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}