{
    "AppID": 946720,
    "Name": "To The Rescue!",
    "Release date": "Nov 2, 2021",
    "About the game": "To The Rescue! is a dog shelter simulator where you are responsible for taking care of dozens of cute dogs in need of homes. It's not all cuddles and snoot boops though: running a shelter can be a lot of work. You have to manage all of the dogs' needs in order to maximize their chances of finding the right forever homes. Each day brings new challenges and rewards. Dogs have specific preferences, can get infectious diseases, and can have negative traits. But you can also hold fundraisers, get random donations, and, if you work hard, help someone find their new best friend. Unfortunately, there's never enough room, and always more dogs. Some dogs are more desirable than others, but maybe if you can afford to wait long enough, just maybe, every dog will have their day. Support real-world charity. 20% of the developer's profit from sales of To The Rescue! goes towards real dog shelters through our charity partner the PetFinder Foundation. Every dog is unique. Each dog is generated with its own traits and preferences to make them distinctive and memorable. Match dogs with adopters' needs. Adopters will often come into the shelter looking for specific things. Match their preferences to increase the chances of adoption. Upgrade and customize your shelter. If you end up with some spare funds, you can upgrade the shelter to have deluxe kennels, get help with cleaning or upkeep, and more! Keep the shelter open. Sometimes it can be tough to afford to take care of all the dogs in the shelter. You'll need to be thrifty and sometimes make tough decisions so that you can keep helping dogs find homes. ...and yes, of course you can pet the dogs! Every dog is unique - Each dog is generated with its own traits, food preferences, personalities, health quirks, names, training values, and more to make them unique and memorable. With 28 different breed variants, there are all kinds of dogs to take care of and show to potential adopters. These adopters will often come into the shelter looking for specific things. Match their preferences to increase the chances of adoption. Fulfill their needs - Dogs need food, water, and shelter. They also need to be kept clean and happy. It's up to you, as the main employee of the shelter, to take care of them. It can get hectic, but it's all worth it to see them find their forever homes. Minigames - For a break from the hectic day-to-day, there are other ways you can ensure that dogs are well taken care of. There are 4 minigames: Tug O’ War, Itchy Scritch, Fetch, and Bathtime Balance the Budget - The shelter runs on donations and adoptions, and there are multiple ways to spend your money. You'll have to manage your budget to make sure that you can pay for food, vaccines, and other unexpected expenses. Each day brings new challenges - In addition to your regular daily upkeep tasks and costs, random events can disrupt the routine. Diseases can break out and spread, new dogs can show up at the wrong time, and tough decisions will have to be made. Grow and Upgrade - Upgrade your shelter to increase the number of dogs you can house, make it more efficient to feed and water them, and make the shelter dogs as comfortable as you can. It's your shelter: guide how it grows! Event-driven story - In To The Rescue!'s main story mode you can progress from housing dogs in your own garage to running a giant, efficient shelter of your own. There will always be events that keep you on your toes, and story threads that develop between them. Fostering and Adopting - The most important part of running a shelter is helping animals find homes. Match dogs' traits with the preferences of visitors to maximize their chances of finding homes. Find fosters who can take care of dogs when you don't have room. In-Game Community Impact - It's not just the shelter activities that you have to manage; you also must establish the shelter as part of the community. Host events, promote, educate, and make sure that you stay in a positive light. From the very beginning of the project, we wanted to teach about the real world problems shelters face. The truth of the matter is that there are way more dogs and cats in need than shelters can handle. It can be hard for “no-kill” shelters to take in every animal that might need help. There are dogs that may be hard to adopt, rehabilitate, or find room for. No one ever wants to have to euthanize, but since we want to raise awareness, we don’t want to pretend that it’s not potentially part of the job. It’s not glorified or presented as an easy way out, but it’s an important part of the experience. That being said, we do include the ability to opt out of engaging with the euthanasia mechanic, for players who would rather experience the game without it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/946720/header.jpg?t=1658348516",
    "Price": 19.99,
    "Developers": "Little Rock Games",
    "Publishers": "Freedom Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/946720/ss_58a65d9b5f0c81b262823eca3c841abb839ae923.1920x1080.jpg?t=1658348516,https://cdn.akamai.steamstatic.com/steam/apps/946720/ss_de4188f4d180767b6a8aa79080d92888e2e18869.1920x1080.jpg?t=1658348516,https://cdn.akamai.steamstatic.com/steam/apps/946720/ss_c67461a100aa354dc99dcc0668fbe9d59a1dc8c5.1920x1080.jpg?t=1658348516,https://cdn.akamai.steamstatic.com/steam/apps/946720/ss_96179024f52ed69f23d4a62b45261045d3f0c987.1920x1080.jpg?t=1658348516,https://cdn.akamai.steamstatic.com/steam/apps/946720/ss_9ef7f99df65fc3f559ebe68a79fc74026144d6ec.1920x1080.jpg?t=1658348516,https://cdn.akamai.steamstatic.com/steam/apps/946720/ss_1b27e764802c70700000d1d477c76eb53fea5b56.1920x1080.jpg?t=1658348516,https://cdn.akamai.steamstatic.com/steam/apps/946720/ss_29f28fe7372ea64dcb0f808337e0745aaf24c8ae.1920x1080.jpg?t=1658348516,https://cdn.akamai.steamstatic.com/steam/apps/946720/ss_72ef332a76e728632fc65c716c7de175d42ef33a.1920x1080.jpg?t=1658348516,https://cdn.akamai.steamstatic.com/steam/apps/946720/ss_1266ffc5532bf0ea9a5dba5f106241ddc4b8c462.1920x1080.jpg?t=1658348516,https://cdn.akamai.steamstatic.com/steam/apps/946720/ss_d45322ec20ef3df441bedbe4d0329dbd1dea26a4.1920x1080.jpg?t=1658348516,https://cdn.akamai.steamstatic.com/steam/apps/946720/ss_91ba7ff0bf9dc7b63d609a8f2aa04bde7eec1244.1920x1080.jpg?t=1658348516,https://cdn.akamai.steamstatic.com/steam/apps/946720/ss_4f36e74cc52c93dfe926268a1d97195f1643c3e3.1920x1080.jpg?t=1658348516",
    "Slug": "to-the-rescue",
    "Meta Title": "To The Rescue!: Nov 2, 2021, Little Rock Games and Full O...",
    "Meta Description": "Looking for information on To The Rescue!? Check out the release date (Nov 2, 2021), developer insights from Little Rock Games, and a complete game summ...",
    "Alt Text Image": "Official header image for To The Rescue! game - Steam 946720",
    "Canonical URL": "https://gusku.site/game/to-the-rescue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"To The Rescue!\", \"description\": \"Looking for information on To The Rescue!? Check out the release date (Nov 2, 2021), developer insights from Little Rock Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Little Rock Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Freedom Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/946720/header.jpg?t=1658348516\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}