{
    "AppID": 505140,
    "Name": "Tribe Of Pok",
    "Release date": "Aug 23, 2016",
    "About the game": "Tribe Of Pok is a tribal survival strategy game featuring a deeply simulated environment. You manage a tribe of hunter-gatherers, helping them survive and thrive in a savage world. As you become more prosperous, rival tribes will take notice. At first they will judge you based on appearances, but you can change their opinion based on the actions you take. Simulated Natural Environment The natural environment is heavily simulated. Water flow, ground saturation, evaporation, fertility, temperature and humidity all contribute to shaping world. Cut down all the trees and eventually they will stop regrowing. Use up all the water in a pond and it will be dry until the rains return. Day/Night and Seasonal cycle Temperature and humidity are affected by the time of day and season. Winters can be harsh with below-freezing temperatures, so keep the camp fires going to prevent hypothermia. The Circle of Life Plants and animals adhere to the circle of life. Plants absorb organics from the soil as they grow, produce fruit during maturity and return organics upon death. Animals travel in herds around the map trying to fulfill their own needs. For predators, this means hunting other animals when hungry. For prey, this means running away from anything that views them as dinner. Nature is the Ultimate Provider Almost everything you need will come from nature. Plants are harvested for their produce, animal carcasses are butchered for materials and rocks are broken down to make tools. Procedural World Each time you start a new game, the world is procedurally generated. You can select which biome you want to embark on, which will affect yearly temperature and rainfall patterns, animals and plant species, and the ground layers that make up the world. Craft the Tools of Survival Craft spears to defend against wildlife and other tribes, axes to cut down trees and awls to make clothing. Some tools are even capable of performing several tasks. The stone knife speeds up fire creation, but can also be used as a weapon in a pinch. Stop the Decay Food left in the open decays very quickly. Build pits to slow down this process. Don't place it too close to camp, or the warmth from a campfire will speed up decay. If the pit gets wet, any food inside won't last very long either. It's all part of the deep simulation that drives Tribe Of Pok. Build Monuments Guide your tribe to prosperity by building monuments of the Stone Age. Arrange individual stones however you like, we provide the pieces for your designs! Take Charge in Combat When danger approaches, quickly take control of Pokian Warriors in Combat Mode to deal with the threat. In Combat Mode, you can select and order Pokians around just like in a real time strategy game. Diplomacy &amp; Discovery A unique diplomacy system where foreign tribes will initially judge you based on appearances. As they learn more about you, other factors will come into play that influence your relations. If your actions annoy them too much, watch out for raiding parties that will come to destroy you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/505140/header.jpg?t=1471988694",
    "Price": 4.99,
    "Developers": "Poking Water Games",
    "Publishers": "Poking Water Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/505140/ss_2be70b844a848914f61c7d8721f198f68dcd331a.1920x1080.jpg?t=1471988694,https://cdn.akamai.steamstatic.com/steam/apps/505140/ss_9e7944c048a24a572d7d395f4a5f130a78c3ab37.1920x1080.jpg?t=1471988694,https://cdn.akamai.steamstatic.com/steam/apps/505140/ss_f0f5e67a335acdbb5fffe2611f0304dd5a5fc48f.1920x1080.jpg?t=1471988694,https://cdn.akamai.steamstatic.com/steam/apps/505140/ss_93bdba55c7762371f857e1c679ca3fdec04dd9cc.1920x1080.jpg?t=1471988694,https://cdn.akamai.steamstatic.com/steam/apps/505140/ss_a06ff31fc8408af13980acf0061b74f11b170a1b.1920x1080.jpg?t=1471988694,https://cdn.akamai.steamstatic.com/steam/apps/505140/ss_a660214923f72d89495e327bc634360a4af008b3.1920x1080.jpg?t=1471988694,https://cdn.akamai.steamstatic.com/steam/apps/505140/ss_2f0e8bcf295a381c360b74993ed641b7f42e86e6.1920x1080.jpg?t=1471988694,https://cdn.akamai.steamstatic.com/steam/apps/505140/ss_378001d80120138bf994efb1cad56a2cb7c8ec70.1920x1080.jpg?t=1471988694,https://cdn.akamai.steamstatic.com/steam/apps/505140/ss_6d64d9d32cba98394ce2947ab011df112bde46e9.1920x1080.jpg?t=1471988694,https://cdn.akamai.steamstatic.com/steam/apps/505140/ss_e49dd075130ab0d0e3e070f569b8fdc48f7243ef.1920x1080.jpg?t=1471988694,https://cdn.akamai.steamstatic.com/steam/apps/505140/ss_634d40e9fee1200972aedd355db7a1a49c56a8a2.1920x1080.jpg?t=1471988694,https://cdn.akamai.steamstatic.com/steam/apps/505140/ss_c4b8e45b13a49d8554b23f85adcf4eb382d1d6e4.1920x1080.jpg?t=1471988694",
    "Slug": "tribe-of-pok",
    "Meta Title": "Tribe Of Pok: Aug 23, 2016, Poking Water Games and Full O...",
    "Meta Description": "Looking for information on Tribe Of Pok? Check out the release date (Aug 23, 2016), developer insights from Poking Water Games, and a complete game summ...",
    "Alt Text Image": "Official header image for Tribe Of Pok game - Steam 505140",
    "Canonical URL": "https://gusku.site/game/tribe-of-pok",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tribe Of Pok\", \"description\": \"Looking for information on Tribe Of Pok? Check out the release date (Aug 23, 2016), developer insights from Poking Water Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 23, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Poking Water Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Poking Water Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/505140/header.jpg?t=1471988694\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}