{
    "AppID": 351420,
    "Name": "Veteran Combat",
    "Release date": "Feb 16, 2015",
    "About the game": "Veteran Combat is a fun &amp; retro 2D side-scrolling (arcade) fighting game for PC. Don't take it too seriously! ;) Please read the manual for the extra movement key combinations: Classification Veteran Combat is a 2D side-scrolling (arcade) fighting game for PC. Background Be the leader of a small military unit from the 1940s. By defeating fifteen opponents, your goal is to convince the other members of the team that you are the one in charge. The fighting takes place in a tournament consisting of twelve scenes. Characters Twelve selectable characters and three hidden main opponents await the player. Playable characters include Igor the grenadier, Julia the nurse, Captain Ballast the sailorman, Dr. Bloodpressure the field surgeon, Natasha the spy, as well as several others emerging from the milieu of the 1940s. Control As for control, Veteran Combat follows the usual and proven standards used in other games of the genre, thus the basics can easily be mastered. Practicing the use of combos and hidden key combinations allows more spectacular and effective charges on the opponents. Please read the manual. Fields of Battle The fighting takes place on twelve exciting locations, such as the wings of a plane flight, the top of a traveling train, or even the dizzy heights of a viaduct. Music All the scenes of the game are filled with the musical ambience of the 1940s, be it in a smoky pub or the dubious and fishy piers. The Fight Apart from the regular punches and kicks, several combo movements can be called forth. Through hidden key combinations ten kinds of extra attacks and wizardry, peculiar to almost each character, can be involved. Choose your skill The three adjustable difficulty levels (from novice to professional) provide for three different levels of challenge in tournaments. Replay – when you need evidence The duels can be recorded and played back, so there is no need to assert that you have really defeated this or that hidden character. Varied and eventful game play Having launched the game, the player can choose from the following options on the mainscreen: beginning a tournament and face all the opponents, one after the other, and, finally, celebrate the victory with all the fighters (tournament); challenging a friend for a quick duel played on the same computer, matches can be played with two teams, each consisting of up to three players (face 2 face, teamfight); instant action with an unlocked (that is, already defeated in tournament) opponent (instant fight); entering a quick fight against a master, whose skill level can be freely set by the player (training mode); Reasons why this game is different visual appearance resembling old black-and-white films digitalized characters humor eventful scenes atmospheric music reminiscent of the 1940s",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/351420/header.jpg?t=1546078988",
    "Price": 1.99,
    "Developers": "CyberphobX",
    "Publishers": "CyberphobX",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/351420/ss_ea602d1a6501e406b4b3365ffdec51f24d966565.1920x1080.jpg?t=1546078988,https://cdn.akamai.steamstatic.com/steam/apps/351420/ss_c42e22368daa3baf09f1ab8fb301e253565fd5e6.1920x1080.jpg?t=1546078988,https://cdn.akamai.steamstatic.com/steam/apps/351420/ss_ca70def6e16e677dfe0f352945960824e5f89e23.1920x1080.jpg?t=1546078988,https://cdn.akamai.steamstatic.com/steam/apps/351420/ss_cd79a5879c592f77723981e177282246892c876a.1920x1080.jpg?t=1546078988,https://cdn.akamai.steamstatic.com/steam/apps/351420/ss_62c2016220cfd635e85f170a929a75e1f143fe47.1920x1080.jpg?t=1546078988,https://cdn.akamai.steamstatic.com/steam/apps/351420/ss_c28f424c8e18d46c932ee04b1556b8e30bd4ae4f.1920x1080.jpg?t=1546078988,https://cdn.akamai.steamstatic.com/steam/apps/351420/ss_4879463e82d8eb259a9f8b647e41283f86d60e21.1920x1080.jpg?t=1546078988,https://cdn.akamai.steamstatic.com/steam/apps/351420/ss_53e3f81d50c8e80bc7f3119b9df8289975d1985c.1920x1080.jpg?t=1546078988,https://cdn.akamai.steamstatic.com/steam/apps/351420/ss_a3ee70cecdbe9743c8ff3e59565b2edd0ca8e461.1920x1080.jpg?t=1546078988",
    "Slug": "veteran-combat",
    "Meta Title": "Veteran Combat: Feb 16, 2015, CyberphobX and Full Overview",
    "Meta Description": "Looking for information on Veteran Combat? Check out the release date (Feb 16, 2015), developer insights from CyberphobX, and a complete game summary.",
    "Alt Text Image": "Official header image for Veteran Combat game - Steam 351420",
    "Canonical URL": "https://gusku.site/game/veteran-combat",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Veteran Combat\", \"description\": \"Looking for information on Veteran Combat? Check out the release date (Feb 16, 2015), developer insights from CyberphobX, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 16, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberphobX\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CyberphobX\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/351420/header.jpg?t=1546078988\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}