{
    "AppID": 1051470,
    "Name": "Animal Friends Adventure",
    "Release date": "May 2, 2019",
    "About the game": "Completely updated and revised! This is a solo Indie Dev game starting small to make bigger and more awesome games. This game is designed to be simple, easy to play, super chill and still provide challenge and excitement. Having saved his homeland from a rotting plague, Super Panda embarks on an all new mission to save his beloved forest once more. Strange disappearances and animal abductions have been going on. New creatures and monsters have appeared and the world is in chaos. The elements and the forest balance is eroding. Once more the world is dying. So he's rounded up his crew for the most important mission of their life. They must find the forest's ancient nemesis and defeat him for good. The anticipated return of Super panda is finally here! With tons of content, including: 8 playable characters each with a unique special ability. 32 levels and 8 boss fights await you on your adventurous journey! Super Panda is Super Kid Friendly and has some pretty awesome controls that are simple and easy to learn. You even get 8 Collectable pets otherwise known as Spirit guardians. They are ancient spirits who strive to help you on your adventures. A huge variety of monsters to fight your way through. Square off against, forest Golems, naughty pixies, crazed mushrooms and hornets, not to mention the menacing mantis and the giant ladybugs, plus many more! 8 boss battles, one at the end of each unique landscape, leads to adventure on an epic scale. All that’s missing is you! Meet the characters 8 Playable and upgradable characters to choose from, each with their own special attack. Super Panda tosses acorn “grenades” and blows the enemies away Deer throws a Love bomb that explodes into magical hearts. Bear throws a giant angry weight that crushes enemies flat. It can open secret doors. Gorilla throws giant boulders that break down iron barriers in your path and crushes all opposition in his way. Fox, that clever man tosses a classic cartoon bomb that clears out small areas. But be careful it can hurt you too! Lenny the Lemur, has a sneaky spiked ball that rolls on the ground and hurts the monsters feet. Rabbit, our favorite little critter. Always thinking. He has a spiked spinning top than he throws, it zips across the ground wreaking comical havoc among the forest dwellers. Last but not least, only for the brave. Bad Panda! His attack is a little naughty. Bad Panda throws a fart bomb that hilariously explodes into poo, farting it's way through the monsters. Pets There's currently 8 collectable pets. Each has a unique personality and comical sayings to help you on your journey. They're a fun addition to the panda world. They all have special little abilities to help and can be used to search for free spins on Lemur's Lucky Spin. The Imp burns all in your path for that special time of need. Bunkins and his magnetic personality helps collect coins and other hard to reach items. Moony keeps you alive by offering up some health in times of need. Pumpky all plump with gold increases the level ending rewards for extra riches. Rockster is a treasure hunter and increases the chances of a successful treasure hunt. Shroomy helps see value in things and grants level end rewards. Teddy is a huge bonus to have with you at the end of each level. Take him along for the adventure if he's not sleeping. Cloudy is full of life and will spare some if you're in need. Level up your pets with fruits: Pineapple, banana, watermelon, strawberry and other delicious treats to gain even more abilities and powers.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1051470/header.jpg?t=1645791271",
    "Price": 13.99,
    "Developers": "Folkvang Studios, Inc",
    "Publishers": "Folkvang Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_1e2c8d7545f63501dcbc5aa4de19eca21605c216.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_64843fe93e9241807213308d14f69d8b2a92fde6.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_3e4ae1326de8d511bed1d16bca01ae9129dc6c77.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_e619077f2b14d41f7b1d942dcea9be4c68ca1647.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_3a3858f3ba7d6f3389ce23058bce186a498c1bb1.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_59c32fcf9961b41999a95e61a3af776188483c5f.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_35931b24ec9e775db077c6e37fa7814829c65f6e.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_04adf97e614e13f5b002703f471551fe1bedb49b.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_35d9d1bd50301fb23c5c85e26510eeadd2aa90d8.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_2a6dce6650bf8063ebc9df72fedf7346917e421e.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_83503293fddab4365aaa797b74daa1c96a68c4a3.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_1e61b6adc8b61e06a965774ccdcfef73852133c3.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_fc41dc864321a38f41595c0688080bd86495de80.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_434a339fec0ef73559e67178bd1f564a3cec7b7c.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_3bb62ce73a0f1320adafa73610f20788d7f856f6.1920x1080.jpg?t=1645791271,https://cdn.akamai.steamstatic.com/steam/apps/1051470/ss_d130fe4c9afdc3217dfb207c15b3b2056924f7af.1920x1080.jpg?t=1645791271",
    "Slug": "animal-friends-adventure",
    "Meta Title": "Animal Friends Adventure: May 2, 2019, Folkvang Studios, ...",
    "Meta Description": "Looking for information on Animal Friends Adventure? Check out the release date (May 2, 2019), developer insights from Folkvang Studios, Inc, and a comp...",
    "Alt Text Image": "Official header image for Animal Friends Adventure game - Steam 1051470",
    "Canonical URL": "https://gusku.site/game/animal-friends-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Animal Friends Adventure\", \"description\": \"Looking for information on Animal Friends Adventure? Check out the release date (May 2, 2019), developer insights from Folkvang Studios, Inc, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 2, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Folkvang Studios, Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Folkvang Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1051470/header.jpg?t=1645791271\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}