{
    "AppID": 311560,
    "Name": "Assassin’s Creed® Rogue",
    "Release date": "Mar 9, 2015",
    "About the game": "Story 18th century, North America. Amidst the chaos and violence of the French and Indian War, Shay Patrick Cormac, a fearless young member of the Brotherhood of Assassin’s, undergoes a dark transformation that will forever shape the future of the American colonies. After a dangerous mission gone tragically wrong, Shay turns his back on the Assassins who, in response, attempt to end his life. Cast aside by those he once called brothers, Shay sets out on a mission to wipe out all who turned against him and ultimately become the most feared Assassin hunter in history. Introducing Assassin’s Creed® Rogue, the darkest chapter in the Assassin’s Creed franchise yet. As Shay, you will experience the slow transformation from Assassin to Assassin Hunter. Follow your own creed and set off on an extraordinary journey through New York City, the wild river valley, and far away to the icy cold waters of the North Atlantic in pursuit of your ultimate goal - bringing down the Assassins for good. Key Features Become the Ultimate Assassin Hunter - For the first time ever, experience the Assassin’s Creed universe from the perspective of a Templar. Play as Shay, who, in addition to the deadly skills of a Master Assassin, also possesses never before seen skills and weapons: o Equip Shay’s deadly air rifle for both short and long range combat. Distract, eliminate, or confuse your enemies by using a variety of ammunition, including specialized bullets and grenades o Protect yourself from hidden Assassins with your enhanced eagle vision. Constantly assess your surroundings and detect Assassins hiding in the shadows, on rooftops, and in the crowds Slowly Descend into Darkness - Witness Shay’s transformation from an adventurous Assassin to a grim and committed Templar willing to hunt down his former brothers. Experience first-hand the events that will lead Shay down a dark path and set him on a course that will forever change the fate of the Assassin Brotherhood. New and Improved Naval Gameplay - Cast off in your ship, The Morrigan, and fight your way through the icy seas of the North Atlantic and the narrow waters of America’s river valleys. Assassin’s Creed® Rogue builds on the award winning naval experience from Assassin’s Creed® IV Black Flag™ with all new gameplay including: o New enemy tactics: Defend yourself from Assassins as they attempt to board your ship and overthrow your crew. Fight them off quickly to avoid losing too many crew members. o New weapons: Including burning oil, which leaves a trail of fire behind to burn enemy ships, and the puckle gun, capable of delivering continuous machine-gun-like fire. o An arctic world full of possibilities: Ram through ice sheets to discover hidden locations and use icebergs as cover during naval battles. Vast Diverse Open World to Explore - Shay’s story will allow you to explore three unique environments: o The North Atlantic Ocean Experience the cold winds and towering icebergs of the arctic in this expansive naval playground o The River Valley A large hybrid setting of the American Frontier mixing seamless river navigation and ground exploration o New York City One of the most well-known cities in the world, fully recreated as it existed in the 18th century. ENHANCE YOUR EXPERIENCE WITH EYE TRACKING Your eyes lead the way with Tobii Eye Tracking. Direct your character’s journey across North America and the North Atlantic as you focus on the path ahead. The Auto-Pause feature helps make sure you don’t miss out on any action – in the unlikely event you can peel your attention away from the screen, that is. Compatible Eye Tracking Devices: Tobii Eye Tracker 4C, Alienware 17 Notebook, Acer Predator Notebook 21 X, MSI GT72 Notebook, Acer Predator Monitors Z301CT, Z271T, XB271HUT",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/311560/header.jpg?t=1602601367",
    "Price": 19.99,
    "Developers": "Ubisoft Sofia,Ubisoft Kiev",
    "Publishers": "Ubisoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/311560/ss_907bf97f0b1f52e0f16afa2a86eab2d6d8a5c773.1920x1080.jpg?t=1602601367,https://cdn.akamai.steamstatic.com/steam/apps/311560/ss_a1fa7dde874ab03dacfd0dd62633e316d34aa672.1920x1080.jpg?t=1602601367,https://cdn.akamai.steamstatic.com/steam/apps/311560/ss_142c19862c8bb307252dedf7f17cda4eb5f3f2b8.1920x1080.jpg?t=1602601367,https://cdn.akamai.steamstatic.com/steam/apps/311560/ss_221f6e993cdfc946eb1d61129b535d9d18b1c603.1920x1080.jpg?t=1602601367,https://cdn.akamai.steamstatic.com/steam/apps/311560/ss_a4f6c24857db50d675f79e5a63773f9443b1c95d.1920x1080.jpg?t=1602601367",
    "Slug": "assassins-creed-rogue",
    "Meta Title": "Assassin’s Creed® Rogue: Mar 9, 2015, Ubisoft Sofia,Ubiso...",
    "Meta Description": "Looking for information on Assassin’s Creed® Rogue? Check out the release date (Mar 9, 2015), developer insights from Ubisoft Sofia,Ubisoft Kiev, and a ...",
    "Alt Text Image": "Official header image for Assassin’s Creed® Rogue game - Steam 311560",
    "Canonical URL": "https://gusku.site/game/assassins-creed-rogue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Assassin\\u2019s Creed\\u00ae Rogue\", \"description\": \"Looking for information on Assassin\\u2019s Creed\\u00ae Rogue? Check out the release date (Mar 9, 2015), developer insights from Ubisoft Sofia,Ubisoft Kiev, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 9, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ubisoft Sofia,Ubisoft Kiev\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ubisoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/311560/header.jpg?t=1602601367\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}