{
    "AppID": 1193300,
    "Name": "Axe Cop",
    "Release date": "Nov 25, 2020",
    "About the game": "In 2009, two brothers, Malachai (age 5) and Ethan (age 29) Nicolle, created the comic book, Axe Cop. Over the years, the brothers pitted Axe Cop and his team of strong fighters against the most deadly, disgusting, and horrifying bad guys that their imaginations could come up with. In celebration of over ten years of Axe Cop, we are proud to present the official Axe Cop Game! Play as Axe Cop and his team in this classic retro RPG! Take on challenging missions against his most devious enemies such as Bad Santa Claus, Dr. Stinkyhead, Dr. Doo doo and more! The Axe Cop Game is great for casual and hardcore RPG gamers alike, offering plenty of strategy, quests and story for any gamer to sink their axe into! After Axe Cop finds his axe at the scene of the fire, he'll meet up with Flute Cop and his career as the most epic hero begins. Once he recovers a mysterious machine, capable of turning any bad guy into a good guy, he and his team of heroes are convinced that they can stop all bad guys once and for all with it. But they must hunt down three magic gems to power it up. Along the way, Axe Cop will face off against his most diablocal rogues and visit some of the most dangerous locations from his comic book history, a volcano full of dinosaurs, the insides of a giant monster, even London itself! The bad guys are teaming up and will not be making it any easier for Axe Cop to find these magic stones. COMBAT: Traditional turn-based gameplay. Characters learn moves and power up based on decisions you make with their stats on each level up. ABILITIES: Each hero on Axe Cop's team has a unique ability in the field. Axe Cop can chop and break most cracked items, Flute Cop can interact with magic statues, Sockarang has a remote control sock boomerang. Every character offers something different to every level. CAMEOS: Odds are if Ethan Nicolle drew a character, they are likely in the game. Some of them even he is surprised are in the game, such as the obscure El Fuego (a wrestler who was turned into a potato). STORY: The game is a celebration of every comic the Nicolle brothers made together. Representation from every single published book is featured in the game, whether as full main missions or side content. Red Triangle Games is an independent game studio from Florida, that has been using the OHR.RPG.CE game making engine for over 20 years. In 2013 we made our debut on the Google Play store with a remastered version of our game Scare Spree. We have been continuously producing games ever since. The team consists of Matthew Edson (programming and game design), James Pandelis/Soda Piggy (battle artwork and music), Ryan McQuinn (sound effects), with minigames and other assistance by Richard Upchurch, James Paige and Ralph Versteegen.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1193300/header.jpg?t=1652884107",
    "Price": 9.99,
    "Developers": "Red Triangle Games",
    "Publishers": "Red Triangle Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1193300/ss_d1477e7298c544d5e79b9d0336ac84ea560e9e59.1920x1080.jpg?t=1652884107,https://cdn.akamai.steamstatic.com/steam/apps/1193300/ss_00312529911a2477858ff55ed038bbe3eb04c79d.1920x1080.jpg?t=1652884107,https://cdn.akamai.steamstatic.com/steam/apps/1193300/ss_cc901fb4fb0a5d087f1eb9fa255099e459a374a8.1920x1080.jpg?t=1652884107,https://cdn.akamai.steamstatic.com/steam/apps/1193300/ss_6386d3e69b51ac7c03dc811af9fff180843bc508.1920x1080.jpg?t=1652884107,https://cdn.akamai.steamstatic.com/steam/apps/1193300/ss_8c5cab145b6ecf5b2797744742bd18129baac7f7.1920x1080.jpg?t=1652884107,https://cdn.akamai.steamstatic.com/steam/apps/1193300/ss_74cbf471dec3d01233b3e9bda870fe4fca0bd9d5.1920x1080.jpg?t=1652884107,https://cdn.akamai.steamstatic.com/steam/apps/1193300/ss_f0144db5aec5d8a12a49ad5e654fbb548fe4b126.1920x1080.jpg?t=1652884107,https://cdn.akamai.steamstatic.com/steam/apps/1193300/ss_989e7af5026cf15d3142c537c9b740ef85d0b8b9.1920x1080.jpg?t=1652884107,https://cdn.akamai.steamstatic.com/steam/apps/1193300/ss_628111d19cebfea1c3a93749e75a4eb3ba97f853.1920x1080.jpg?t=1652884107,https://cdn.akamai.steamstatic.com/steam/apps/1193300/ss_c9df320680374ffa960b6feea6c8d383b81aba71.1920x1080.jpg?t=1652884107,https://cdn.akamai.steamstatic.com/steam/apps/1193300/ss_7a1660e309d68d6a9bc405e8c29d9753a7ba87ad.1920x1080.jpg?t=1652884107",
    "Slug": "axe-cop",
    "Meta Title": "Axe Cop: Nov 25, 2020, Red Triangle Games and Full Overview",
    "Meta Description": "Looking for information on Axe Cop? Check out the release date (Nov 25, 2020), developer insights from Red Triangle Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Axe Cop game - Steam 1193300",
    "Canonical URL": "https://gusku.site/game/axe-cop",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Axe Cop\", \"description\": \"Looking for information on Axe Cop? Check out the release date (Nov 25, 2020), developer insights from Red Triangle Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 25, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Red Triangle Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Red Triangle Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1193300/header.jpg?t=1652884107\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}