{
    "AppID": 1456280,
    "Name": "Battle Arena VR",
    "Release date": "Nov 26, 2020",
    "About the game": "Battle Arena VR is a multiplayer arena shooter, where you are automatically matched with opponents. Challenge yourself, challenge everyone in a deathmatch Battle Arena! Multiplayer - best fit for 2-5 users on each map, up to 10 players per map Short sessions - to invoke emotions through sometimes intensive play and discuss it later using voice chat Guided gameplay - warmup and cooldown stages to connect with other players, get familiar with landscape and physics. Time-limited play stage limits the amount of motion sickness and intensity each user can get Voice chat during the game - use an open microphone to chat with other players in realtime to share your excitement Multiple servers across the globe so everyone is included and can play with the local community and low latency (for now we have enabled 3 servers, which can be extended for worldwide coverage of 14 servers) Complete tutorial - learn controls and capabilities to get the most from your cyborg Every game gives you experience, level-ups, and change your position in the leaderboard, which is visible to all players Controls and mechanics In the lobby Customize your player, choose the model and the color Tap the Battle Arena sphere to join a currently active game where other players are Tap the spheres to select the desired level if you wish to play at a specific location Tap the button with ping/server to switch the server. “Players now” stats are calculated per server and apply to both lobby and levels Your name, XP, and the level is rendered above the avatar and other players can see it Check the level leaderboard and weekly challenge to see what is your current rank Inside a level Left thumb joystick for continuous movement in all directions Right thumb joystick left/right to for snap-turns and down for instant look back Left or right-hand trigger (Grab button) to jump Right index trigger to fire an active gun Right primary and secondary buttons (A/B) to switch an active gun Left primary button (X) to display the score Left secondary button (Y) to mute/unmute open mic Left menu button to exit to the lobby and control the number of bots in the game GL&amp;HF",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1456280/header.jpg?t=1610639294",
    "Price": 0.0,
    "Developers": "DreamTeam Mobile",
    "Publishers": "DreamTeam Mobile",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1456280/ss_aa7abcb46d644ed9694af3e7e3892ba94743bfe4.1920x1080.jpg?t=1610639294,https://cdn.akamai.steamstatic.com/steam/apps/1456280/ss_fdbbc9e3a0a8c5f62616690d11822277c701ea9c.1920x1080.jpg?t=1610639294,https://cdn.akamai.steamstatic.com/steam/apps/1456280/ss_817bfb491bf041c56493613cde3b7fa6d8607ed7.1920x1080.jpg?t=1610639294,https://cdn.akamai.steamstatic.com/steam/apps/1456280/ss_e853f3c8be67c6bf9da5377f1062d743bbb5ed33.1920x1080.jpg?t=1610639294,https://cdn.akamai.steamstatic.com/steam/apps/1456280/ss_dce03e96e0dcb4223c518aa78ebe245fcfeecc20.1920x1080.jpg?t=1610639294",
    "Slug": "battle-arena-vr",
    "Meta Title": "Battle Arena VR: Nov 26, 2020, DreamTeam Mobile and Full ...",
    "Meta Description": "Looking for information on Battle Arena VR? Check out the release date (Nov 26, 2020), developer insights from DreamTeam Mobile, and a complete game sum...",
    "Alt Text Image": "Official header image for Battle Arena VR game - Steam 1456280",
    "Canonical URL": "https://gusku.site/game/battle-arena-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Battle Arena VR\", \"description\": \"Looking for information on Battle Arena VR? Check out the release date (Nov 26, 2020), developer insights from DreamTeam Mobile, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 26, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"DreamTeam Mobile\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DreamTeam Mobile\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1456280/header.jpg?t=1610639294\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}