{
    "AppID": 588230,
    "Name": "Beckett",
    "Release date": "Feb 27, 2018",
    "About the game": "WHAT IS IT? Dark, disturbing, unsettling - Beckett is a powerful narrative adventure game that gets under your skin and makes you question everything about yourself and the very nature of reality. The game is a single-player, point-and-click style experience that lasts around 3 hours. But it will be in your head for a long time after. WHY WE MADE IT We made Beckett as a story that could stand shoulder-to-shoulder with the best of literature, theatre and independent world cinema. It won the Games category in the 2018 BAFTA Scotland awards, made various game-of-the-year lists (2018) and was made part of V&amp;A Dundee's permanent gallery collection. You could call it a psychological horror. You could call it an anti-love story. You could call it a surrealist nightmare. Beckett is a disturbing, unique experience that will make you question what it is to exist. The game puts reality under the spotlight, drawing you into a missing person's case set in a dark and unforgiving world. Our main character, Beckett, morns the loss of his wife - she was everything to him, but time has passed and life has lost meaning. Then there's the City, which plays with Beckett like cat with a baby bird, making him act against his will. You must take control, explore, navigate, interact, talk, defy... we're all memories waiting to happen, we're all memories waiting to fade. PRAISE FOR BECKETT 'A rare example of total and genuine auteurism in the games world' - Glixel, Rolling Stone 'convincingly uncompromised' - Alphr 'Beckett impresses at every turn.' - Cubed3 'An innovative and engrossing experience.' - Russell Lees, creator of The Dark Eye 'A powerful experience for those willing to dive into it.' - Big Boss Battle. 'The decisions that the game-player makes cause the story to squirm under the influence of the choices they make.' - 3AM Magazine 'Playing Beckett is wonderfully transcendent... It hones in on the disturbing and disgusting corners of society with little reprieve, making your stomach and your brain churn in tandem.' - Rely On Horror 'Always intriguing and defies the tried-and-true structure we’ve come to expect from adventure games.' - Game Bias Includes: - An original multi-layered story, discovered and reconstructed by the player and their imagination - A dynamic narrative that responds to the way you play the story and interact with its world - A bizarre and compelling world, filled with hand-made objects and artefacts - A unique soundtrack and soundscape composed and aligned to the story and the world it exists in - A pick-up-and-play interface, no gamer-skills necessary - just an inquisitive mind - Questions about what it is to exist, the fragile nature of reality and the dark-humour that underpins life Featuring: - Morgellon &amp; Ekbom Live Here - a short, interactive play, featuring the voice of John Otway (if you don't know it, you should check out his hit Really Free and its B-Side, Beware of The Flowers). - Spectacular abstract environments to be explored and discovered, digitally painted by Herman Serrano (Weird Dreams, Chaos Engine, StarGlider) - Illustrations by the incredibly talented Sean Mulvenna, and original screenprints by the fantastic Al White - Programming by Gordon Bell (MotorStorm, The Shoot, Need for Speed: The Run) - Design, direction, words, music and 'made-things' by Simon Meek (Slabovia.tv &amp; The 39 Steps) - Access to the dark recesses of your own mind",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/588230/header.jpg?t=1560280854",
    "Price": 9.99,
    "Developers": "The Secret Experiment",
    "Publishers": "The Secret Experiment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/588230/ss_44b24bfbad8dffb3ef99f53c6658d96d042a8b4c.1920x1080.jpg?t=1560280854,https://cdn.akamai.steamstatic.com/steam/apps/588230/ss_1c0ffa9ced93b8b1e5f852f6b8519ea3a7757ea6.1920x1080.jpg?t=1560280854,https://cdn.akamai.steamstatic.com/steam/apps/588230/ss_0b71468b9451ba3e76d838b30dbf647c843a02ac.1920x1080.jpg?t=1560280854,https://cdn.akamai.steamstatic.com/steam/apps/588230/ss_87da7f9e045106a52ae5c6cfbe7763c966d0697c.1920x1080.jpg?t=1560280854,https://cdn.akamai.steamstatic.com/steam/apps/588230/ss_b6ec4cc1e2f0d7c30469d2d9939606954a339f48.1920x1080.jpg?t=1560280854,https://cdn.akamai.steamstatic.com/steam/apps/588230/ss_0b32ac2de206f92a22be27d6fe73b03e3b90dd22.1920x1080.jpg?t=1560280854,https://cdn.akamai.steamstatic.com/steam/apps/588230/ss_a20e681d6e9d6c65966f10fe180ed7b4ffc119d6.1920x1080.jpg?t=1560280854,https://cdn.akamai.steamstatic.com/steam/apps/588230/ss_9d27c6dffebc943db1a1fe715ed11850293889e3.1920x1080.jpg?t=1560280854,https://cdn.akamai.steamstatic.com/steam/apps/588230/ss_8b8dda4f0fdfa390305e094b11f58d6a4680a2ec.1920x1080.jpg?t=1560280854",
    "Slug": "beckett",
    "Meta Title": "Beckett: Feb 27, 2018, The Secret Experiment and Full Ove...",
    "Meta Description": "Looking for information on Beckett? Check out the release date (Feb 27, 2018), developer insights from The Secret Experiment, and a complete game summary.",
    "Alt Text Image": "Official header image for Beckett game - Steam 588230",
    "Canonical URL": "https://gusku.site/game/beckett",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Beckett\", \"description\": \"Looking for information on Beckett? Check out the release date (Feb 27, 2018), developer insights from The Secret Experiment, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Secret Experiment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Secret Experiment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/588230/header.jpg?t=1560280854\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}