{
    "AppID": 494220,
    "Name": "Blight of the Immortals",
    "Release date": "Oct 25, 2016",
    "About the game": "Fantasy! Strategy! Zombies! A plague of undead creatures threatens to overwhelm the land and with the fall of each town to the Blight, more walking dead rise and the zombie apocalypse draws nearer. For the first time in centuries, the six great races of Alundria must stand together. The lawful races of Elves, Dwarves, and Men; and the chaotic races of Orcs, Goblins, and Trolls. The strengths that make each race unique... magic, money, and might are twisted and darkened as each creature returns from the dead as a zombie version of its former self. To save the world, you must recruit heroes, expand your empire, and raise armies as fast as you can because as time marches on, so does the zombie horde. Features Blight is a unique blend of Online Strategy Board game and Collectible Card Game. Multiplayer is Co-OP. Players must work together to defeat the zombies. Multiplayer is slow-real-time and always ticking away in the background. There is no need to wait for your turn, simply login throughout the day to command your forces and coordinate with the other players. In Single Player is turn-based and you can choose how far ahead in time to jump each turn. Earn Valour by throwing caution to the wind and jumping ahead 12 hours or pay Valour to micromanage your forces and jump ahead just 1 hour. The Single Player campaign include 36 missions spanning the 6 different races. Explore new strategies, collect new hero cards, and master the different races with each new scenario. Collect over 100 Hero Cards and explore new strategies and combinations with each deck you build. Early Access Help us test this Early Access build and let us know whats working and whats not. We love hearing from our community and so please join us and be a part of the game's development! About Iron Helmet Iron Helmet is the developer behind the award-winning strategy game, Neptune's Pride. Named PC Gamer's Webgame of the Year , Runner Up to Edge Magazine's Indie Game of the Year , and Honourable Mention in the IGF Grand Prize category. Iron Helmet is Jay Kyburz and Penny Sweetser, who have worked on AAA titles such as BioShock, BioShock 2, Total War, Tribes, Freedom Force, and SWAT 4.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/494220/header.jpg?t=1479187294",
    "Price": 0.0,
    "Developers": "Iron Helmet Games",
    "Publishers": "Iron Helmet Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/494220/ss_a1c74a9b1d4626b887671b384b54459ac8d99922.1920x1080.jpg?t=1479187294,https://cdn.akamai.steamstatic.com/steam/apps/494220/ss_9e88434dafe4869cf0897b02316d5c89948e2d25.1920x1080.jpg?t=1479187294,https://cdn.akamai.steamstatic.com/steam/apps/494220/ss_c0bce09363940e57939fffdd2023eea09b07feec.1920x1080.jpg?t=1479187294,https://cdn.akamai.steamstatic.com/steam/apps/494220/ss_e9ed17ed8926a3f7a6ffd887cf1ade5a0b90ef34.1920x1080.jpg?t=1479187294,https://cdn.akamai.steamstatic.com/steam/apps/494220/ss_cb404b2bda80c2b0f69a7876ba9e57789a7ef780.1920x1080.jpg?t=1479187294,https://cdn.akamai.steamstatic.com/steam/apps/494220/ss_4a2b1ef4f812a59261f5af421f77e409380977c0.1920x1080.jpg?t=1479187294,https://cdn.akamai.steamstatic.com/steam/apps/494220/ss_5a32707580e9bdd56d39a09182fd5aef29b2fd02.1920x1080.jpg?t=1479187294",
    "Slug": "blight-of-the-immortals",
    "Meta Title": "Blight of the Immortals: Oct 25, 2016, Iron Helmet Games ...",
    "Meta Description": "Looking for information on Blight of the Immortals? Check out the release date (Oct 25, 2016), developer insights from Iron Helmet Games, and a complete...",
    "Alt Text Image": "Official header image for Blight of the Immortals game - Steam 494220",
    "Canonical URL": "https://gusku.site/game/blight-of-the-immortals",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Blight of the Immortals\", \"description\": \"Looking for information on Blight of the Immortals? Check out the release date (Oct 25, 2016), developer insights from Iron Helmet Games, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 25, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Iron Helmet Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Iron Helmet Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/494220/header.jpg?t=1479187294\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}