{
    "AppID": 625220,
    "Name": "Building Blocks / Master Builder of Egypt",
    "Release date": "Dec 1, 2017",
    "About the game": "What's Building Blocks ? Building Blocks is a physics-based game of a special kind. Be a master-builder in Ancient Egypt! Building Blocks captivates the player with its clever gameplay, its accessibility and exciting challenges for both children and adults. Join the halls of the most famous architects with skill and quick actions and receive special awards! Are you ready to be one of the greatest master-builders of Egypt? Awards Building Blocks achieved 3rd place at the ”Living Games Festival Award 2009”. It was also nominated for “Gamesload Newcomer Award 2009″ and “German Developer Award 2009” and entered the “Independent Games Festival 2009” against Minecraft. Key features 16 Adventure Level of Building Blocks (all 3 Buildings 1 Adventure Level) nice graphics design designed with loving attention to detail easy to control Fun for the whole family specially designed for women and men two game modes over 15 ranks 16 unique trophies more than 45 buildings and 60 building blocks epic in-game soundtrack more than 500 highscore lists access help videos from right inside the game INTRODUCTION Building Block is a game of skill that takes place in Ancient Egypt. You play as a young man who dares to take on tricky building that will challenge all of your skills and craft. In competition with other players you'll earn experience and points which you can use to rise up in ranks and earn trophies. BUILDINGS At first the buildings are easy to rebuild. But the deeper you get into the game, the more demanding the buildings will be and the bulkier the blocks will be. Only true master builders will be able to overcome all of these challenges. CONSTRUCTION PLANS The blueprint of the current level is always visible in the background. This is the required state of the building to allow it to be approved. The plan also shows how the coloured blocks should be positioned. At easy difficulty this plan is only a rough outline, it allows some deviations at positioning the blocks. On the other side there's the hard difficulty: here the building has to fit the plan exactly. Both the position and the colour patterns have to match. THE BLOCKS The blocks of Building blocks come in many different shapes and colors. This diversity of blocks renders every newly achieved building a intriguing experience. Handles and weights differ from block to block. Movable and fixed blocks, simple and complex shapes, columns, letters and varying materials such as wood and stone will make every building a challenge. BLOCK HANDLING Every block has differing qualities that require different handling. Complex shaped blocks and sometimes strange gravity change the handling of some blocks, making the construction of some buildings even more challenging. The whole game is played using the PC mouse. You grab a block exactly at that position by clicking on it with the left mouse button. But the block still obeys gravity! Aside from the grabbed place the block will continue falling and swinging. You have to take the block's shape and mass into account before trying to move it. Game Mode NORMAL GAME A normal game is played without time measurement. Just tinker with the blocks and enjoy experimenting. Unfortunately you're not allowed to enter the highscore lists in this mode. TIMED GAME In this game mode you're playing against the time. Try to solve the level before time runs out. Outstanding performances are able to enter the highscore list! CREATE A PLAYER If there's no player yet you should click on 'Create player'. A new window opens which allows you to enter your name. After clicking on 'Accept' the new player now shows up in the player list. You start the game with a simple click at the desired player name. To delete a player you need to right-click it. MAP A beautiful map of Ancient Egypt shows all the various buildings. You can always view other sections of the map if scrolling is enabled at the top of the screen. By touching the gems at the map with your mouse you can get a preview of the building. You enter this building by left-clicking on it. Right-click on a gem shows the info screen explaining the meaning of the various gems. Only the finished buildings and the current building are shown at the map. TROPHIES The qualities coming with a received trophy hold true for all buildings in the whole game. That means that the qualities of each new trophy add up with the previously collected trophies or compensate them. MENU The main menu consists of the following five items: Start - Allows you to select or create a player. Options - Here you can adjust game settings such as resolution or brightness. Highscores - Shows the ranks of the best players worldwide for every building. Credits - Who created the Building Blocks? Quit - Ends the game. OPTIONS The following settings can be adjusted: Language - You can choose from English, German, Spanish, French and Japanese. There will be more languages later. Resolution - Drag the slider to select from 640x480, 800x600, 1024x768 and 1280x1024. Only works in windowed mode. Brightness - Can be adjusted if necessary. VSync - Vertical syncronisation avoids tearing but might slow down the game. LANGUAGES At first, Building Blocks will be available in English and German only but more languages will follow later on. You can switch the game language to your desired choice at the menu item 'Options'. INSTRUCTION VIDEOS For every building an instruction video is available at YouTube. You can get there in an instant by clicking the exclamation mark at the top-left corner of the Pause Menu. The Pause Menu is reachable via the Space key. RANKS There are 17 unique ranks in Building Blocks that can be reached by gaining experience. Screen",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/625220/header.jpg?t=1512352525",
    "Price": 4.99,
    "Developers": "Gunia Studios",
    "Publishers": "Gunia Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_0ccb2952c12f311a48aab54ae423a3ee78978855.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_a5e6a115d7c4abc4b12ea468e3c1168b5296bb1e.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_7c6c6607654954dbd5fec4d38aa2150172fffb02.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_a23af14e50872096734c46c4efd036b11034acb6.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_752f6e3da0c42b710c4ecc6a4a55c3fce894b06d.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_7fe489f4fe5dbc3dcc820afc43265531aa562e68.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_fc9e53365dd9978fed64c75105da02728b62eaf3.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_6839e465576bb72c927e9f575cff510596f903b1.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_7110999480203d1eb88bafd85ef79f514819733c.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_efa51a2eb65033524390cd9c8901e5addd422127.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_16e7372773e48ebdc6e3fe7ff88e69659eeb3579.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_61d80878c772bf79fe33e3e7da6a57461f16e31f.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_5514bd1304c101eb94a9c74a66e45f143b004be6.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_dfc0e4189ced491c598092ebae98693ee0bb4f13.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_4be3b1b7e50ec823c4591eae017e3e6f2168522c.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_c009fa83c8fb33863f64d06b72308a7658e397b5.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_a56841c436d92d30eeb3292aa23517551df40849.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_8645178fcd8f23839525e4437f4aa5420422ba9b.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_56c25bc22b92b285124b060ffad01a5e054aecb1.1920x1080.jpg?t=1512352525,https://cdn.akamai.steamstatic.com/steam/apps/625220/ss_7075f178d2c953fb084281a2513e2eee395ba524.1920x1080.jpg?t=1512352525",
    "Slug": "building-blocks-master-builder-of-egypt",
    "Meta Title": "Building Blocks / Master Builder of Egypt: Dec 1, 2017, G...",
    "Meta Description": "Looking for information on Building Blocks / Master Builder of Egypt? Check out the release date (Dec 1, 2017), developer insights from Gunia Studios, a...",
    "Alt Text Image": "Official header image for Building Blocks / Master Builder of Egypt game - Steam 625220",
    "Canonical URL": "https://gusku.site/game/building-blocks-master-builder-of-egypt",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Building Blocks / Master Builder of Egypt\", \"description\": \"Looking for information on Building Blocks / Master Builder of Egypt? Check out the release date (Dec 1, 2017), developer insights from Gunia Studios, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gunia Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gunia Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/625220/header.jpg?t=1512352525\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}