{
    "AppID": 1696240,
    "Name": "Chain Of Eroticism",
    "Release date": "Aug 8, 2021",
    "About the game": "'I don't care ... I don't care anymore' Today, the downtown area at night. The main character, Kotori Yurei [Takanashi_Rei], loses his job and residence due to a mischievous personality, and falls hungry. When you wake up, you will find yourself in a strange store. Rei, who was cared for at the club-style Chinese restaurant 'Eden', happened to be Having a relationship with the five men who were there, he will work as a temporary worker in Eden. Even if the life of sleeping in a store instead of an inn begins, it cannot be continued forever. There, 'living together' with one of the five men was proposed and accepted as it was swept away. Thus, the life of Rei and a man living together, which was related to the city at night, began. 《Main character: Uke》 Rei Kotori, 20 years old A young man who lost his job and lost his residence because he could not pay the rent. I'm indifferent to living a life, and I don't care about it. I don't hate working, but I'm not interested in finding it right away. If you have a job, you can work properly and be competent. Housework ability is usually weak. Cooking skills are not bad, but I can only make the minimum. Most dishes can be cooked by a manual person who can follow the recipe. My hands are uselessly dexterous, and only the decoration of the dishes is excellent. I don't buy it because it's a hassle to buy it myself, but I like sweets. He has few friends because he makes undressed remarks. It's basically unfriendly, but there are emotions and emotions. On the contrary, when emotions appear, it unexpectedly appears. Very weak against alcohol. When I get drunk, my face immediately becomes Tron, but my tone is as usual. Sexual orientation is normal, but it is dyed by the other party. ・ ・ ・ ・ ・ ・ ・ Relationship with 'Eden' The place where I fell down was picked up at a restaurant run by Yoichi, You will be able to live in as a short-term part-time job for a week. [Strategy character 1] Takumi Nanase, 21 years old Occupation: Members of the Boryokudan A terminal member of a gangster who manages and mediates a genre cast. Friendly and good at the world. Looks like a cheerful and cheerful optimist. The inner heart is computationally expensive, and although the front and back are intense, he does not show the back to others. I have never trusted others sincerely because I have both sides. ・ ・ ・ ・ ・ ・ ・ Relationship with 'Eden' It is a daily routine to take a break from work and come to the pool. [Strategy character 2] Futaba Kazuya 28 years old Occupation: Working at a trading company Strategy character The only company employee, a common sense person. I will not break the honorifics even younger. I'm not good at interacting with people other than work, and the non-interference of night society is more calming. His mother died due to excessive SM play, and his father committed suicide at that time. I grew up in a facility because of my parents, which distorts my outlook on love. ・ ・ ・ ・ ・ ・ ・ Relationship with 'Eden' It's annoying to be invited by colleagues and bosses after work I'm wandering around the city at night. I don't hate the lack of clinging to the city at night I often come to Eden, which I happen to stop by. [Strategy character 3] March Shirou 23 years old Occupation: Day Trader I love human observation. Read a person's words and actions in depth and apply them to psychology and ethology for analysis. His demeanor is cool and calm, but his remarks are often noisy. I like a lot of analysis, but I don't always talk about it in the open. However, he shows an analytical habit for acquaintances. Even when he deliberately takes a challenging attitude, he throws an analytical habit. I want to keep someone in my house as a guinea pig and analyze and observe it all the time. ・ ・ ・ ・ ・ ・ ・ Relationship with 'Eden' Interesting people gather, so I go to restaurants run by Yoichi. [Sub character] Yoichi Rikuno, 26 years old Occupation: Restaurant owner Former NO.1 host. I have my own shop now, but I leave it to others to wear bras. Arrogant, irreverent and confident. Wisdom works, but it is vulnerable to agitation and lacks cunning. He is good at bargaining, but he is not accustomed to being able to give honest favors. He is a common sense person for work and manages the store firmly. ・ ・ ・ ・ ・ ・ ・ Relationship with 'Eden' I run several restaurants, one of which is 'Eden', which is the main character It is a hangout. The store, which is a hangout, is originally stylish I was supposed to run a club, but a person in the kitchen I hired went out of control and went to Chinese food. Devoted, turned into a mysterious fashionable Chinese dining. The food is delicious and the sales are good, so I leave it as it is. [Sub character] Tokito Shogo, 25 years old Occupation: Restaurant part-time job I'm so tall. It's a bad fight, but it's very disciplined. Because of the strong quarrel, he is adored and becomes a bad guy. It looks scary, but it's kind and kind. The work is also serious. ・ ・ ・ ・ ・ ・ ・ Relationship with 'Eden' Work as a part-time job in Eden. The player becomes the main character and chooses his own destiny. Bring happiness to his beloved and many others. Visual novel. This work includes elements of sexual activity and disagreeable sex. Contains nudity or sexual content. There are depictions of drugs and alcohol. Contains explicit or fresh adult sexual content.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1696240/header.jpg?t=1628453625",
    "Price": 9.99,
    "Developers": "MagicHouse",
    "Publishers": "MagicHouse",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1696240/ss_8b42729d51d901d300a78c5879f336b80141ab56.1920x1080.jpg?t=1628453625,https://cdn.akamai.steamstatic.com/steam/apps/1696240/ss_e24b25dfe1f624b425ec0a986d3f0e3fa55819cd.1920x1080.jpg?t=1628453625,https://cdn.akamai.steamstatic.com/steam/apps/1696240/ss_d36f9acda69cc9dfffafd59e8db64273f1ba8508.1920x1080.jpg?t=1628453625,https://cdn.akamai.steamstatic.com/steam/apps/1696240/ss_03c9170bab5d422a7648fa9fcfb057dd4fee30d0.1920x1080.jpg?t=1628453625,https://cdn.akamai.steamstatic.com/steam/apps/1696240/ss_ba4a82ec4165dde133a53777480021bb7395a8f3.1920x1080.jpg?t=1628453625,https://cdn.akamai.steamstatic.com/steam/apps/1696240/ss_75d23a392da474dd4254aa07b015c904c749b52b.1920x1080.jpg?t=1628453625,https://cdn.akamai.steamstatic.com/steam/apps/1696240/ss_53fd3b6f9666402776e71d9a0f977d95ffeb8562.1920x1080.jpg?t=1628453625,https://cdn.akamai.steamstatic.com/steam/apps/1696240/ss_e16df3ca7366194b7a2ac68e279d0d29006d3489.1920x1080.jpg?t=1628453625,https://cdn.akamai.steamstatic.com/steam/apps/1696240/ss_ea213d7bb4b39b5c6a28f3a29326de4e12c3dad5.1920x1080.jpg?t=1628453625,https://cdn.akamai.steamstatic.com/steam/apps/1696240/ss_c6af942f3d36e366f3b5f8c477c059df62444282.1920x1080.jpg?t=1628453625",
    "Slug": "chain-of-eroticism",
    "Meta Title": "Chain Of Eroticism: Aug 8, 2021, MagicHouse and Full Over...",
    "Meta Description": "Looking for information on Chain Of Eroticism? Check out the release date (Aug 8, 2021), developer insights from MagicHouse, and a complete game summary.",
    "Alt Text Image": "Official header image for Chain Of Eroticism game - Steam 1696240",
    "Canonical URL": "https://gusku.site/game/chain-of-eroticism",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Chain Of Eroticism\", \"description\": \"Looking for information on Chain Of Eroticism? Check out the release date (Aug 8, 2021), developer insights from MagicHouse, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 8, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"MagicHouse\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MagicHouse\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1696240/header.jpg?t=1628453625\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}