{
    "AppID": 773210,
    "Name": "ControlMyJoystick",
    "Release date": "Jan 11, 2018",
    "About the game": "' It emulates. In a fun way. ' - RB Use your voice, joystick, smartphone or optional 3Dconnexion controller to send commands to your game as joystick, keyboard and mouse input. No programming knowledge required! Speak Your Mind Simply speak a command like ‘Gear Up’ to perform the corresponding command in-game. It is easier than searching for the correct key on your keyboard. Be Multi-Dimensional Add an optional 3Dconnexion controller to allow in-game movement up to six degrees of freedom. Perfect for flight and scrolling-type games. BYOJ Use one or more of your joysticks, throttle or pedals and tweak the curves to suit your tastes. You can even apply to all axis including the throttle. Just Tap It Use up to three iOS and Android devices simultaneously to send commands to your game with our free ControlMyJoystick Remote App. Try the Free Demo The Demo allows you to create two macros with unlimited script commands so that you can experiment. There's a 'Download Demo' button on the right side of this page. There's also a fully functional 14-day demo on our website. Features Driver Delight - ControlMyJoystick uses our own Tetherscript Virtual Keyboard, Joystick and Mouse drivers, which are legit, digitally signed and secure. Curve It - Easily create joystick and 3Dconnexion controller axis response curves, trim and dead-zones then switch between different curves by any trigger. Think separate curves for ‘cruising’ and ‘landing’. You can even curve a joystick throttle slider. Wonderful WASD - Use a 3Dconnexion controller or joystick to emulate a digital joystick for scroll-around-the-map kind of games. Multi-threaded Mayhem - Each macro runs on it’s own thread, so you can run more than one macro simultaneously. Prolific Profiles - Create one or more profiles per game. Then add macros, triggers and scripts to the profile. Change profiles easily without have to restart the game or ControlMyJoystick.. Mmmm Macros - Add macros to profiles for each command such as ‘Gear Up’ or ‘Show Map’. You can have as many as you like. Terrific Triggers - Use your voice, joystick, smartphone/tablet app or 3Dconnexion controller as a trigger to run a macro and it’s corresponding script. You can even embed scripts within scripts. Super Scripting - Create scripts to send commands to the game, switch axis curves, control external devices and other cool things. It’s point and click, so no programming knowledge is necessary. Share The Fun - Easily import and export your game profiles so that you can share them with other gamers. Hack It - If you are handy with code, you can create your own trigger sources and send notification events when a macro is run. We included UDP sender and receiver test apps so can see how it works. We even offer the not included, but free HVDK Standard, which is a SDK for accessing the drivers yourself. Windowed Wonderful...ness - If you are running a game in a window, you can set it as a profile target so that each macro sends command to the game, and not your web browser, etc. It's Pretty - Customize ControlMyJoystick’s look and feel by choosing from over 100 themes and adjustable font sizes. Real Support and Knowledge Base Post your question in the Steam forums. Browse the forums on our website at Search the knowledge base over at /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/773210/header.jpg?t=1591827812",
    "Price": 29.99,
    "Developers": "Russ Beuker",
    "Publishers": "Tetherscript Technology Corporation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/773210/ss_0bad2dbe4f060c5ec780d8bcd772acefcf5b6b46.1920x1080.jpg?t=1591827812,https://cdn.akamai.steamstatic.com/steam/apps/773210/ss_f2071309f3db94365e400df446ab611c4f86f2ba.1920x1080.jpg?t=1591827812,https://cdn.akamai.steamstatic.com/steam/apps/773210/ss_70db35219ee9986ab611193aa46b3cde4a90333e.1920x1080.jpg?t=1591827812",
    "Slug": "controlmyjoystick",
    "Meta Title": "ControlMyJoystick: Jan 11, 2018, Russ Beuker and Full Ove...",
    "Meta Description": "Looking for information on ControlMyJoystick? Check out the release date (Jan 11, 2018), developer insights from Russ Beuker, and a complete game summary.",
    "Alt Text Image": "Official header image for ControlMyJoystick game - Steam 773210",
    "Canonical URL": "https://gusku.site/game/controlmyjoystick",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ControlMyJoystick\", \"description\": \"Looking for information on ControlMyJoystick? Check out the release date (Jan 11, 2018), developer insights from Russ Beuker, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 11, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Russ Beuker\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tetherscript Technology Corporation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/773210/header.jpg?t=1591827812\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}