{
    "AppID": 511430,
    "Name": "CrossWorlds: Escape",
    "Release date": "Mar 20, 2020",
    "About the game": "CrossWorlds: Escape is a hardcore game in which you will have to deploy all your skills to survive in a huge open world that is susceptible to changes in weather, seasons and various natural phenomena. You have to start from scratch, supplying yourself with food, tools, clothing and shelter. You need to protect yourself against enemies who may turn out to be stronger than you, and you have to prepare for winter and summer. As you do all these, it would be quite good to at the same time look for a way to get out of this strange world where you happened to be against your will. Key features: A 64 km2 game world, which you can explore without any restrictions Change in seasons: Hot summer – time when you would want to be closer to the snowy peaks or at least to the cool creek Fertile fall – the period of big travels and discoveries, a time you shouldn't forget about the coming winter Severe winter – the time when a warm shelter with a hot fireplace and pre-readied stocks will be useful Refurbishing spring – ready to sweep away your shelter from places perfectly coping without it for centuries Weather phenomena: Gentle breeze that helps you to cope with the summer heat or that turns you into an icicle in winter playfully Long-awaited rain, which will prevent you from dying of thirst, but at the same time, will flood your shelter Mysterious fog, which will help you to escape from the crowds of enemies, but thanks to which you will pass the desired location without finding it you have missed your destination Soft snow that decorates everything around. The snowdrift, which you will turn into, will be quite beautiful Various biomes willing to share their wealth ... if you can cope with their inhabitants Enemies – both those that got trapped in this world against their will and the indigenous inhabitants with advanced intelligence, ready to call their friends to gladly kill you if they can’t do so alone. But if they can’t kill you with friends, they will play dirty tricks on you and crush your temporary shelter A construction and crafting system you can use to acquire strength, new clothes, armor and weapons. This system will force you to visit the most remote corners of the world, destroy already endangered species, explore the dark and inhospitable caves, where you will be seen as enemy number one Deadly creatures with immeasurable levels of strength. You will have to find or summon them, and then win them, to get out of this world. But if you don't hurry up, they may get bored and will come to you by themselves at the wrong time Severe and deadly magic that changes the laws of nature, gives enormous power, but demands long and difficult preparation and unreasonably huge cost in exchange",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/511430/header.jpg?t=1587425469",
    "Price": 11.99,
    "Developers": "Another Reality",
    "Publishers": "Another Reality",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/511430/ss_a5faf709d323109b45f947f87b1f4a7e658a263a.1920x1080.jpg?t=1587425469,https://cdn.akamai.steamstatic.com/steam/apps/511430/ss_6c40bbe12f3656b9ffec8a6b240c123e21adbde0.1920x1080.jpg?t=1587425469,https://cdn.akamai.steamstatic.com/steam/apps/511430/ss_ddc4cb11f32f7cc463c442cbfc3ac1922176b3be.1920x1080.jpg?t=1587425469,https://cdn.akamai.steamstatic.com/steam/apps/511430/ss_882225dcec65ff12940ae0d67a5f77ab5935dbda.1920x1080.jpg?t=1587425469,https://cdn.akamai.steamstatic.com/steam/apps/511430/ss_eaf4e4fe738c7abd3c9563b7c3607409972ea7a0.1920x1080.jpg?t=1587425469,https://cdn.akamai.steamstatic.com/steam/apps/511430/ss_ad57b7bd54afa29a7d571bfd615f7ecfa7d2ddd4.1920x1080.jpg?t=1587425469,https://cdn.akamai.steamstatic.com/steam/apps/511430/ss_d1f2c2821d2554dfc7ab23753ee07bb29849d7b2.1920x1080.jpg?t=1587425469,https://cdn.akamai.steamstatic.com/steam/apps/511430/ss_db808e4f2a6ceaf32e448768a0d9d807c5e3ba9b.1920x1080.jpg?t=1587425469,https://cdn.akamai.steamstatic.com/steam/apps/511430/ss_71613c361456602f754418db7e3e74e8a55fa8d9.1920x1080.jpg?t=1587425469,https://cdn.akamai.steamstatic.com/steam/apps/511430/ss_0cfaa6df6ea1d7e5e661d62595b8f673436ce59f.1920x1080.jpg?t=1587425469",
    "Slug": "crossworlds-escape",
    "Meta Title": "CrossWorlds: Escape: Mar 20, 2020, Another Reality and Fu...",
    "Meta Description": "Looking for information on CrossWorlds: Escape? Check out the release date (Mar 20, 2020), developer insights from Another Reality, and a complete game ...",
    "Alt Text Image": "Official header image for CrossWorlds: Escape game - Steam 511430",
    "Canonical URL": "https://gusku.site/game/crossworlds-escape",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CrossWorlds: Escape\", \"description\": \"Looking for information on CrossWorlds: Escape? Check out the release date (Mar 20, 2020), developer insights from Another Reality, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Another Reality\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Another Reality\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/511430/header.jpg?t=1587425469\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}