{
    "AppID": 1452280,
    "Name": "Devastator",
    "Release date": "Mar 25, 2022",
    "About the game": "Devastator is a retro-inspired arcade twin-stick shooter designed for modern systems. Everything from the visuals to the audio to the gameplay was designed and tweaked and polished to create the most intense and satisfying twin-stick shooter experience possible. SYSTEM initializing... Multiple virus infections detected... Launching DEVASTATOR program... You are the Devastator! Your objective is to eradicate 15 types of viruses in 3 unique modes: Quadrants, Sectors, and Cycles. In Quadrants, the wave layout is constantly changing as you battle increasingly intense waves of random viruses for 5 minutes. In Sectors, there are 55 unique waves of viruses across 5 sectors. And in Cycles, you'll battle semi-randomized spawning viruses across 5 variations of 11 waves. Complete your objective as the Devastator and take back control of the System! In addition to the main game modes, wave layouts, and various enemy virus types providing gameplay variety, Devastator's moment-to-moment gameplay contains surprising depth and subtlety. From the way you balance speed vs. firepower to the utilization of resources to knowing when to pick up powerups, Devastator rewards both fast reflexes and good strategy.                      Turbo-firing at the start (move fast without firing to build), and a charged blast at the end. Devastator features vector-inspired visuals mixed with HDR colors, four customizable full-screen filters and mesmerizing particle effects, all while running at insanely high framerates on high-resolution monitors. With modern graphics hardware, the game runs with ease on current high-end gaming monitors (such as 360hz at 1080p, 240hz at 1440p, or 120hz at 4k), and it can theoretically run faster at higher resolutions when better monitors and higher-throughput video cables exist in the future. Devastator was designed and developed by Luke Schneider (aka the Radiangames guy). Luke has been a huge twin-stick shooter fan since the 1980s, and has been developing twin-stick shooters since 2005. With Devastator, Luke decided it was time to make his ultimate and final 2D arcade-style twin-stick shooter. Devastator's features include: 15 different types of viruses 3 different game modes: Quadrants, Sectors and Cycles. Defeat random viruses for 3 minutes Wave layout changing constantly 55 unique waves of viruses across 5 sectors Battle semi-randomized spawning viruses Powerful powerup drops Built with next-gen in mind running at 4K 120FPS",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1452280/header.jpg?t=1648222104",
    "Price": 6.99,
    "Developers": "Radiangames",
    "Publishers": "2Awesome Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1452280/ss_c2860f80346c057a96b85c8208b9ce3598c1111f.1920x1080.jpg?t=1648222104,https://cdn.akamai.steamstatic.com/steam/apps/1452280/ss_ccf673f82ff267f20f693ad4fc1318a2eed402c8.1920x1080.jpg?t=1648222104,https://cdn.akamai.steamstatic.com/steam/apps/1452280/ss_b9a88e6ba08b1988e658b40fd515e2689c7d35a7.1920x1080.jpg?t=1648222104,https://cdn.akamai.steamstatic.com/steam/apps/1452280/ss_953dc02af8e005576d8338966339eb4ba06963b4.1920x1080.jpg?t=1648222104,https://cdn.akamai.steamstatic.com/steam/apps/1452280/ss_04ca2182e663234bb6432943be6d0563c3c704c5.1920x1080.jpg?t=1648222104,https://cdn.akamai.steamstatic.com/steam/apps/1452280/ss_5e915afdb4017e392a9e7258ab05d00c233f6d93.1920x1080.jpg?t=1648222104",
    "Slug": "devastator",
    "Meta Title": "Devastator: Mar 25, 2022, Radiangames and Full Overview",
    "Meta Description": "Looking for information on Devastator? Check out the release date (Mar 25, 2022), developer insights from Radiangames, and a complete game summary.",
    "Alt Text Image": "Official header image for Devastator game - Steam 1452280",
    "Canonical URL": "https://gusku.site/game/devastator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Devastator\", \"description\": \"Looking for information on Devastator? Check out the release date (Mar 25, 2022), developer insights from Radiangames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Radiangames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"2Awesome Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1452280/header.jpg?t=1648222104\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}