{
    "AppID": 1020020,
    "Name": "Dimension Two",
    "Release date": "Mar 8, 2019",
    "About the game": "DimensionTwo, Animate your anime wife! DimensionTwo is a software for creating and playing dynamic characters, allowing you to create fascinating dynamic characters from a variety of images and play them on the desktop. Strive for simplicity and speed, without too complicated interface, as long as you prepare the texture of the character, or you any picture, you can make it! What is DimensionTwo? It is a powerful and simple dynamic waifu creation and entertainment system that can place dynamic characters that you make or share with others on the desktop, play according to the character's built-in training scripts, and spend time with you. And it has a full set of character editing tools, which allows you to easily create character models, animations, scripts, and if you don't have much expertise, you can also make your own dynamic waifu through video tutorials or manuals step by step. What can she do? Play on your desktop Use Locker to record information and little secrets for you What can you do? Play it Place it on the desktop Download characters from Steam Workshop Modify the character through the editor Use desktop Widgets Inspire your imagination Characteristics Editor: Ability to create character models, edit character actions, synthesize animations Entertainment: Touch the character and interact with the mouse Interaction: Can switch between normal mode and desktop mode, or interact at any time via shortcut keys Widget: Built-in Electron, which can display any Electron program as a desktop component, built-in calendar, notes, system monitor, collapsible desktop system, and open source code can be modified at will Extension: Support lua scripts and provide a set of APIs to customize your desktop wife, set up various conversations and animations, etc. Format: support png and dds pictures More: More DIY features will be available in the future Q&amp;A how to use? Please refer to the built-in documentation, which can be opened from the system tray icon right-click menu, or visit the manual URL. Also refer to the official video tutorial / / / -XtJaH1IWSyZSG34AbW7jWCQbnvb&amp;disable_polymer=true How to make auto startup? The settings can be made via the system tray icon right-click menu -&gt; Settings. Will it take up resources? We have optimized the code, will enter a low-consumption state after being placed, need to actively click to re-operate, and can also be controlled in the setting of the tray right-click menu. How to use Steam workshop? You can browse and subscribe to the content directly at the Steam Workshop page. You can upload your own work to the Workshop through the function of the right-click menu of the system tray icon. Future plan The future will continue to enhance the editor's features, including optimizing the user experience, better animation systems, etc. will also make the video tutorial ------------------------------------------------------------------ At present, this software is still under development and improvement. If you encounter any problems, please send feedback to the Steam community, or send an email to us",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1020020/header.jpg?t=1625190487",
    "Price": 4.99,
    "Developers": "AeroRider",
    "Publishers": "AeroRider",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1020020/ss_ab52a640ac0ef953172a080ec1a5be9324c626e5.1920x1080.jpg?t=1625190487,https://cdn.akamai.steamstatic.com/steam/apps/1020020/ss_78bfb116302ad823f481b046ab803ccd433f4939.1920x1080.jpg?t=1625190487,https://cdn.akamai.steamstatic.com/steam/apps/1020020/ss_d08889359a1d77f99e4c61eea373ecd1afcb82c2.1920x1080.jpg?t=1625190487,https://cdn.akamai.steamstatic.com/steam/apps/1020020/ss_2edc1f2f9f2e9ade43c1f0d07d119cd8d038e834.1920x1080.jpg?t=1625190487,https://cdn.akamai.steamstatic.com/steam/apps/1020020/ss_d1623fddcca415d29579875f08532f23a59464f9.1920x1080.jpg?t=1625190487,https://cdn.akamai.steamstatic.com/steam/apps/1020020/ss_beca838153ddbd9b8372e9b6abbdbcfbe6f44c9f.1920x1080.jpg?t=1625190487,https://cdn.akamai.steamstatic.com/steam/apps/1020020/ss_7468dec9f9bdbd271b3cd40c1dd18353c7084d6b.1920x1080.jpg?t=1625190487,https://cdn.akamai.steamstatic.com/steam/apps/1020020/ss_4f4b08f02be8fe742a4301166bfc1629381edd37.1920x1080.jpg?t=1625190487,https://cdn.akamai.steamstatic.com/steam/apps/1020020/ss_7634f9d3c4a18e0cbe2702b00324ca12a8640813.1920x1080.jpg?t=1625190487",
    "Slug": "dimension-two",
    "Meta Title": "Dimension Two: Mar 8, 2019, AeroRider and Full Overview",
    "Meta Description": "Looking for information on Dimension Two? Check out the release date (Mar 8, 2019), developer insights from AeroRider, and a complete game summary.",
    "Alt Text Image": "Official header image for Dimension Two game - Steam 1020020",
    "Canonical URL": "https://gusku.site/game/dimension-two",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dimension Two\", \"description\": \"Looking for information on Dimension Two? Check out the release date (Mar 8, 2019), developer insights from AeroRider, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 8, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"AeroRider\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AeroRider\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1020020/header.jpg?t=1625190487\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}