{
    "AppID": 260930,
    "Name": "Emergency 2014",
    "Release date": "Nov 15, 2013",
    "About the game": "You have command of paramedics, fire brigades, police and disaster relief. Send your teams out on tense real-time missions to deal with disasters in Europe's major centres. In the series' most absorbing game yet, you will extinguish major fires, track down buried victims and save whole cities with their populations and landmarks. Develop your own strategy and remain in control of the situation at all times on sandbox maps. There are four new single player missions where meteorite strikes threaten the population. It is 1890. Asteroid Caligula passes the Earth’s orbit, coming so close to the planet that fragments breaking off it (meteorites) impact the Earth. A farmstead is struck and destroyed by a meteorite in the Rhine province of the German Empire. The conflagration threatens to spread to nearby towns. In this unique historical mission, the player takes charge of historical units (a pumper and firefighters) to get the situation back under control. About 100 years later, Caligula is approaching the Earth again. Only this time, it is on a direct collision course with our blue planet. Once again, its coming is heralded by meteorite impacts. The player with his forces and vehicles attempts to contain the local disasters and protect the civilians at three different locations, including the city of Pisa, in which the famous leaning tower is destroyed in a spectacular meteorite strike. Emergency 2014 includes the entire content of Emergency 2013 and Emergency 2012 DELUXE, and adds countless eventful hours of gameplay, new spectacular videos and new units such as fire helicopters and the historical horse-drawn pumper to the popular series. Protect! Rescue! Salvage! – Be where you are needed most! Key Features The ultimate collection of the popular simulation series, including new content for additional hours of fun! Includes the entire content of Emergency 2013 and Emergency 2012 DELUXE, and adds new units such as fire helicopters to the popular series 4 new missions where Earth is threatened by meteorite strikes, including Pisa and a historical bonus mission with horse-drawn pumper More than 20 missions and additional sandbox maps as well as unpredictable events",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/260930/header.jpg?t=1568366785",
    "Price": 9.99,
    "Developers": "Sixteen Tons Entertainment",
    "Publishers": "Sixteen Tons Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/260930/ss_01871238eac9ea56fcf9dcc8717872c715e0fcda.1920x1080.jpg?t=1568366785,https://cdn.akamai.steamstatic.com/steam/apps/260930/ss_f3d0aa232c9f96df25ff4789f4cf7d7ac181bae8.1920x1080.jpg?t=1568366785,https://cdn.akamai.steamstatic.com/steam/apps/260930/ss_3cc3c8b8131fb2949dc7cbdbc1fbe0c3710ba423.1920x1080.jpg?t=1568366785,https://cdn.akamai.steamstatic.com/steam/apps/260930/ss_797100774d54866687c4b27af6f0f5f4f30e0dca.1920x1080.jpg?t=1568366785,https://cdn.akamai.steamstatic.com/steam/apps/260930/ss_ae6d48cc57f91cca122004d665d4c4a9b2d0f94b.1920x1080.jpg?t=1568366785,https://cdn.akamai.steamstatic.com/steam/apps/260930/ss_e1e9fb482d0635616ccc315466e750e3b4d8ba3e.1920x1080.jpg?t=1568366785",
    "Slug": "emergency-2014",
    "Meta Title": "Emergency 2014: Nov 15, 2013, Sixteen Tons Entertainment ...",
    "Meta Description": "Looking for information on Emergency 2014? Check out the release date (Nov 15, 2013), developer insights from Sixteen Tons Entertainment, and a complete...",
    "Alt Text Image": "Official header image for Emergency 2014 game - Steam 260930",
    "Canonical URL": "https://gusku.site/game/emergency-2014",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Emergency 2014\", \"description\": \"Looking for information on Emergency 2014? Check out the release date (Nov 15, 2013), developer insights from Sixteen Tons Entertainment, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sixteen Tons Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sixteen Tons Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/260930/header.jpg?t=1568366785\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}