{
    "AppID": 1064620,
    "Name": "Forest of Evil",
    "Release date": "Jun 21, 2019",
    "About the game": "The year is 1291 and the crusades have come to an end. Off in a far away country a lone crusader makes his return journey back to his homeland. He decides to pass through an unfamiliar forest, but little does he know that it is a Forest Of Evil! A Knight of the crusades who specialized in assassination has decided to make a return journey back to his homeland now that the wars which he had been called to have come to an end. At the point of his journey where this game begins we find him traveling alone and deciding to pass through a large forest which is unfamiliar to him. He is in no hurry to return to his homeland and prefers his own company, so he thinks nothing of taking the long path through unfamiliar lands. However, he is about to stumble upon a land consumed by a Deep Darkness. Will he have the strength to overcome this Eternal Night? Can he tear through the Veil of Evil which covers this land and bring forth the Light of a New Dawn? Or, will he succumb to the Darkness and fall like all those who had lived in this land before his arrival? CAUTION: This game is intended to be very difficult. If you aren't looking for a challenge then this game may not be for you. A Quote From A Play-Tester: 'This game is hard as *&amp;#$^@#*%$#! But every time I rage quit in frustration I find myself coming back for the satisfaction of the challenge!' Game-play Synopsis Forest of Evil is a 2D Platformer partially inspired by games like the 1990s Castlevania. Although, it is fairly distinct from those games so one shouldn't compare them to Forest of Evil. Play through 9 unique levels each with their own unique boss. However, the player only needs to complete 5 levels to beat the game as the levels diverge at points into different paths from which the player may choose the course they feel best for them in order to continue. One therefore would need to play through the game multiple times and take different paths to experience every level and boss. Think about each level carefully and decide which weapon would best suit the enemies and boss within it. By default you will always have a dagger, but there are 5 other weapons which may be acquired through breaking weapon crates scattered within each level and each weapon has its own unique usage. You have 4 tries to complete each level before it is GAME OVER! But, you will be able to continue from the start of each level provided that you saved at the previous saving Cross. The riggors of the paths getting you down? Not finding the weapon you want in the crates or perhaps you have need of some armor? Find a gold coin hidden within each level and spend them as you desire when browsing the many goods held by the creepy wandering merchant; one of the few souls seemingly unaffected by the Forest's Deep Evil. Keep an eye out for the kindly wizard. He may help you on your journey by offering a wish. But, is there more to him than may be seen at first glance? This game is for those who desire a challenge. It is intended to be very difficult and this needs to be understood going in. So, if you feel that you are dying quite often, falling down holes that you thought you shouldn't have fallen down, are having a difficulty getting through even the first level or two, this is intended! If you are resilient and just keep trying, you will defeat it one day. But if not, then you will succumb to the Darkness and fall like many before you. Once you beat the game you will unlock a HARD MODE which you may play through if you felt the base game wasn't difficult enough and require a greater challenge! A BOSS RUSH MODE will be unlocked once you have defeated each of the 9 bosses. You do not have to play all the way through the game and defeat the final boss each time while taking different paths, but must simply have gotten to and defeated every single boss once. And saved having done so of course. Support! This game causing you to feel a bit low in the ground? Experiencing some problems with bugs or glitches? Having trouble with some spot? Or just want to give some constructive criticisms? Then please feel free to make a post in the discussions section of this game's community hub! You may also feel free to send a message to our official support email which can be found either by going through the Steam Support process online or by finding the discussion post in the discussions section of this game's community hub which will show it. About the Game's Development and Development Team This game was created by an independent 3 person development team of brothers in spare time over the course of approximately 1 year. One person uses the pixel software 'Aesprite' to create the sprites and pixel art and also composes the unique music. The second uses 'Unity 2D' to bring it all together with the coding\\programing. And the third offers encouragement, testing, criticisms, manages the store page, keeps track of discussions posted on the discussions page, and other support when needed.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1064620/header.jpg?t=1591299926",
    "Price": 2.99,
    "Developers": "Brown Studios",
    "Publishers": "Brown Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_0a61bc9ffcb7132d53ab0e78d239c63c8c7c2725.1920x1080.jpg?t=1591299926,https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_f1004b0ddf02331ca92b2b0a613dbeecd89806fe.1920x1080.jpg?t=1591299926,https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_6d81610502865772989bcb8c6fa7781d3beb2cd3.1920x1080.jpg?t=1591299926,https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_2ca599f9bcd75dcfdc0ab340a344373a2203844e.1920x1080.jpg?t=1591299926,https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_c92f91afcc8627f1de2af8b0dca342399f532a63.1920x1080.jpg?t=1591299926,https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_cd95e623260899ae4931556f3d9feaf4cfa92d25.1920x1080.jpg?t=1591299926,https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_2f09c0076bf3719a88583d2c31e4d378ec0b2ffa.1920x1080.jpg?t=1591299926,https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_e8524207f96337b5ddb6518e7e8301432e9031d5.1920x1080.jpg?t=1591299926,https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_77f8da0154da434b0f65c94f3ba336ac8177d5e2.1920x1080.jpg?t=1591299926,https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_c07216c59448f00e0f14b789c640b9f552b18808.1920x1080.jpg?t=1591299926,https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_88148b82ce8ecc6c83d8d0a95fb8b3fee7ce58e5.1920x1080.jpg?t=1591299926,https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_5c0566394fc6515b99e0502a9292951bf3128594.1920x1080.jpg?t=1591299926,https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_8bb7cc2f25aebe1a811e081f8655f56404699e24.1920x1080.jpg?t=1591299926,https://cdn.akamai.steamstatic.com/steam/apps/1064620/ss_4fc253954dec0ab25f44386f298c7d927465ca59.1920x1080.jpg?t=1591299926",
    "Slug": "forest-of-evil",
    "Meta Title": "Forest of Evil: Jun 21, 2019, Brown Studios and Full Over...",
    "Meta Description": "Looking for information on Forest of Evil? Check out the release date (Jun 21, 2019), developer insights from Brown Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Forest of Evil game - Steam 1064620",
    "Canonical URL": "https://gusku.site/game/forest-of-evil",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Forest of Evil\", \"description\": \"Looking for information on Forest of Evil? Check out the release date (Jun 21, 2019), developer insights from Brown Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 21, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Brown Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Brown Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1064620/header.jpg?t=1591299926\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}