{
    "AppID": 1921080,
    "Name": "Galaxy Splitter",
    "Release date": "Jun 14, 2022",
    "About the game": "Interstellar peace is at stake and only you can save it! Accept your mission as fighter pilot in Galaxy Splitter and free all the planets from hostile spaceships! This action game will beam you directly into a new galaxy with trigger-happy enemies and high-value cargo. Captain Smith will help start you on your galactic adventure. He’ll show you how to make your spaceship combat-ready with weapons and modules and what to collect on your missions. The galactic Action Game In this Vertical Shooter you will encounter a lot of enemies. Their spaceships are upgraded and the squadrons are ready to stop you on your mission. Beware of the projectiles and rockets – your protective shields won't last forever! Whether you will succeed in this action game highly depends on the right strategy. Choose an appropriate spaceship to liberate a planet: Will you choose the Fighter, the Interceptor or the Destroyer? All of them have completely different properties: speed, maneuverability, equipment capacity, and size of the cargo hold – there's the perfect spaceship for every mission! Also the right equipment will help you win: weapons – fire automatically modules – change / modify the values of weapons and spaceships special weapons – can be fired only once per mission but are particularly strong protective shield – resists enemy attacks A vertical shooter in front of epic 3D planets Your missions in Galaxy Splitter will lead you across a virtual galaxy with ever new challenges. Pick up your delivery and take on passengers. The opposing armada of spaceships will get in your way. Strike back with projectiles, rockets, and even stronger weapons! Also your ammunition has different characteristics: simple ammunition: causes damage on impact penetrating ammunition: shot continues flying after a hit splitting ammunition: project divides on impact into secondary projectiles explosion: causes damage in the whole region homing ammunition: follows its target and always finds its mark In case you're facing superior enemies, you can employ evasive maneuvers. When you get hit by the enemy, you can have your spaceship repaired in the Hangar. Let's start your interstellar combat mission with this action-packed Vertical Shooter – play Galaxy Splitter now!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1921080/header.jpg?t=1655193827",
    "Price": 0.0,
    "Developers": "NeoBird",
    "Publishers": "upjers GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1921080/ss_56d0408945fc08cacc2488fc5a1a57d015de3349.1920x1080.jpg?t=1655193827,https://cdn.akamai.steamstatic.com/steam/apps/1921080/ss_3a774af2fc6db420b1944e9997f6900b8df1ecd2.1920x1080.jpg?t=1655193827,https://cdn.akamai.steamstatic.com/steam/apps/1921080/ss_45f5c973ec659ebf49d86559fe3464f3c0af727a.1920x1080.jpg?t=1655193827,https://cdn.akamai.steamstatic.com/steam/apps/1921080/ss_f1f7849431d1afdf878657fb6c4e14eb61f159ae.1920x1080.jpg?t=1655193827,https://cdn.akamai.steamstatic.com/steam/apps/1921080/ss_b93854248722457c906437c0980c19d595d01a77.1920x1080.jpg?t=1655193827",
    "Slug": "galaxy-splitter",
    "Meta Title": "Galaxy Splitter: Jun 14, 2022, NeoBird and Full Overview",
    "Meta Description": "Looking for information on Galaxy Splitter? Check out the release date (Jun 14, 2022), developer insights from NeoBird, and a complete game summary.",
    "Alt Text Image": "Official header image for Galaxy Splitter game - Steam 1921080",
    "Canonical URL": "https://gusku.site/game/galaxy-splitter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Galaxy Splitter\", \"description\": \"Looking for information on Galaxy Splitter? Check out the release date (Jun 14, 2022), developer insights from NeoBird, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"NeoBird\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"upjers GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1921080/header.jpg?t=1655193827\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}