{
    "AppID": 551700,
    "Name": "Gunheart",
    "Release date": "Jun 4, 2018",
    "About the game": "Welcome to the fastest RPG shooter ever made Gunheart is an online co-op RPG shooter where you and your friends become customizable robotic bounty hunters trying to make a buck at the edge of the galaxy. KEY FEATURES Move across the battlefield at the speed of thought Strafe, teleport, or boost jump anywhere and everywhere to cover kilometer long battlefields instantaneously. With teleport at your fingertips it’s easier than ever to grab the high ground and destroy the invaders. 10 unique weapons to unlock and master Each weapon can be leveled up to unlock individual perks and additional weapon modification slots. Combine and dual-wield different side arms until you find your favorite combo. When taking on the bigger enemies, reach for a combo weapon like the chaingun or bow. 40+ weapon modifications means millions of combinations Completely overhaul how each weapon functions and turn your favorites into custom death-dealing masterpieces - for example augment an ordinary rocket launcher with guided rockets, then slap on rapid-reloader, and top it off with a full-auto mod. 9 campaign and 11 challenge missions Take an action-packed tour of Planet Fortune while battling the diverse Anthromite menace. Encounter a wide variety of enemies and multiple bosses along the way while battling through several unique environments. Elite mode and weekly missions keep the challenge fresh even after you have mastered the campaign. Frenetic PVP battles Pit yourself against other bounty hunters either in free-for-all or team-based skirmishes. Earn rewards and prestige titles for killing your fellow players - it’s a great way to cool off and show off after a long day of bounty hunting! 80+ cosmetics and 4 social gear to discover for your character Hats, rig vests, and facial expressions enable you to customize your look and show off your achievements. Make some cool pixel art with the pixel gun, stage a celebration with the balloon gun, or just whack some fools in the face with the handy Mr. Fish. Use the multi-tool to grab any physical object and turn it into an adhoc weapon Explosive barrels littered throughout the environment make for great impromptu grenades. Or simply grab the nearest creature and chuck them off a cliff for a quick kill. Drop-in/drop-out co-op with dynamic difficulty It's easy to join in with friends (or strangers) for some fun co-op shooting. You can always start a mission solo if you prefer to play as a lone wolf, or restrict the mission to just your friends list. Local Play Mode Co-op play is totally optional in Gunheart. If you'd rather brave the fight all alone, then simply choose local play mode at the server selection screen. You even get to use the same shared profile from your online game so no need to worry about losing progress no matter which version you want to play. VR players have a full suite of locomotion and comfort options Comfortably play standing, seated, or room scale. A full set of control options allow users to easily switch between layouts, enable smooth motion and jump, or toggle comfort options such as dynamic 'blinders'. Cross-play across all platforms Jump in and play together! Desktop (non-VR), Oculus Rift, HTC Vive, and Windows MR players! Jump in and start your bounty hunting career with PalCo today. The denizens of Planet Fortune are anxiously awaiting your arrival, why not stop in to say hi? Available for Arcades on SpringboardVR",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/551700/header.jpg?t=1569524890",
    "Price": 14.99,
    "Developers": "Drifter®",
    "Publishers": "Drifter®",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/551700/ss_f112ede438c17f51818ea631e796b7c9e8b74c84.1920x1080.jpg?t=1569524890,https://cdn.akamai.steamstatic.com/steam/apps/551700/ss_1789287ff59496f76f413e1a49ee42d140d960bf.1920x1080.jpg?t=1569524890,https://cdn.akamai.steamstatic.com/steam/apps/551700/ss_1ceab728303e512fe4237830860cef64b22998b6.1920x1080.jpg?t=1569524890,https://cdn.akamai.steamstatic.com/steam/apps/551700/ss_34501b7a0bbe2549b5c33044f3c0dcdccbc516a3.1920x1080.jpg?t=1569524890,https://cdn.akamai.steamstatic.com/steam/apps/551700/ss_2bb32db95e8de037216592e88b4f13a9ba3510ec.1920x1080.jpg?t=1569524890,https://cdn.akamai.steamstatic.com/steam/apps/551700/ss_2f5b54d9267fac18776d16bf823af496efb3ca6c.1920x1080.jpg?t=1569524890,https://cdn.akamai.steamstatic.com/steam/apps/551700/ss_2b6175eb5f1cf06d5480fdbb0953b806dc6cd191.1920x1080.jpg?t=1569524890,https://cdn.akamai.steamstatic.com/steam/apps/551700/ss_7b04ff71783289641121528ad6748c62091d01b5.1920x1080.jpg?t=1569524890,https://cdn.akamai.steamstatic.com/steam/apps/551700/ss_9866e23cf93ac3d1e050589a229f57b787ae1b30.1920x1080.jpg?t=1569524890,https://cdn.akamai.steamstatic.com/steam/apps/551700/ss_5fbaaba6e82aef2ef1814d5af2b8858fed165566.1920x1080.jpg?t=1569524890",
    "Slug": "gunheart",
    "Meta Title": "Gunheart: Jun 4, 2018, Drifter® and Full Overview",
    "Meta Description": "Looking for information on Gunheart? Check out the release date (Jun 4, 2018), developer insights from Drifter®, and a complete game summary.",
    "Alt Text Image": "Official header image for Gunheart game - Steam 551700",
    "Canonical URL": "https://gusku.site/game/gunheart",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gunheart\", \"description\": \"Looking for information on Gunheart? Check out the release date (Jun 4, 2018), developer insights from Drifter\\u00ae, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 4, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Drifter\\u00ae\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Drifter\\u00ae\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/551700/header.jpg?t=1569524890\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}