{
    "AppID": 1297470,
    "Name": "Inconsistencies",
    "Release date": "Jun 5, 2020",
    "About the game": "Inconsistencies is an immersive psychological-horror experience played from the ego perspective. You play as the young private investigator Sally Harrison as she explores an old lodge to uncover the mysterious, inter generational double suicide of the Rethan family. You collect interesting clues, combine objects and solve complex puzzles. An exciting and unique story that will change based on your decisions awaits! The game concentrates on exploring the environment and gathering information, which slowly builds up the atmosphere. The story is told through subtle environmental details and surreal insights of the gathered information. The decisions you make are all final and will significantly influence the story, which will create multiple storylines and endings. Death is also a major aspect of the game. Through a lot of hidden objects and different endings a high replay value is achieved. Environment You are investigating the family home of the Rethans, an old lodge near a lake, far away from civilisation. It's an eerie house that holds many secrets and dangers. You wander through dark corridors and investigate strange rooms while your head fills with the dark memories and experiences of the former inhabitants. Story The double suicide of Arthur and Marilyn Rethan made the rounds in all the newspapers a few decades ago, but now their son James and his wife were also found dead. It appears that they too committed suicide. The inter generational double suicides, from now on known as Rethan cases, are one of the most mysterious and unexplained cases in the career of the young private investigator Sally Harrison, who has now been assigned to solve the cases. As a player, you will uncover parts of the dark past and each new clue will scare and frighten you. It's up to you to find out the truth. But will you run away or will you try everything to uncover what happened? Game mechanics In Inconsistencies you are absolutely on your own. With no weapons to help you, you have to fight the strange incidents with your mind alone. By solving complex puzzles and finding clues, you will gain more and more information about what really happened in the house. Your decisions to deal with certain situations also have a major impact on the game. It is quite possible that you will miss many of the decisive clues if you don't pay attention to the small details. Your psyche becomes weaker and weaker as you surrender to your fears. You have to face the dangers of the past or run the risk of going insane forever. Only if your mind remains as healthy as possible, you can decipher the secrets of the house and solve the Rethan case.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1297470/header.jpg?t=1591347972",
    "Price": 4.99,
    "Developers": "Maxiig",
    "Publishers": "Maxiig",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1297470/ss_258202cedf998a6605e292266c01865ee7012c43.1920x1080.jpg?t=1591347972,https://cdn.akamai.steamstatic.com/steam/apps/1297470/ss_7fc8b278d0b190bc8807cd07afb63021b7d92f42.1920x1080.jpg?t=1591347972,https://cdn.akamai.steamstatic.com/steam/apps/1297470/ss_a3490169930c702c425616bfde57cc7617593f65.1920x1080.jpg?t=1591347972,https://cdn.akamai.steamstatic.com/steam/apps/1297470/ss_9c1ec0caa18b40e61ec34e95c605085b0be21ba0.1920x1080.jpg?t=1591347972,https://cdn.akamai.steamstatic.com/steam/apps/1297470/ss_8e71b7dfb0485408566df2228715d3c367dce470.1920x1080.jpg?t=1591347972,https://cdn.akamai.steamstatic.com/steam/apps/1297470/ss_f1bf6397d7651e565ddd33e55075f10660e5c5cc.1920x1080.jpg?t=1591347972,https://cdn.akamai.steamstatic.com/steam/apps/1297470/ss_103fd313b5d02c138b8c6ac39b398c42311f8b60.1920x1080.jpg?t=1591347972,https://cdn.akamai.steamstatic.com/steam/apps/1297470/ss_374084f01238c108b463e69da1f2d2eef94c9ac0.1920x1080.jpg?t=1591347972,https://cdn.akamai.steamstatic.com/steam/apps/1297470/ss_4b970779fd73424b90215080fc5772f8c256355a.1920x1080.jpg?t=1591347972",
    "Slug": "inconsistencies",
    "Meta Title": "Inconsistencies: Jun 5, 2020, Maxiig and Full Overview",
    "Meta Description": "Looking for information on Inconsistencies? Check out the release date (Jun 5, 2020), developer insights from Maxiig, and a complete game summary.",
    "Alt Text Image": "Official header image for Inconsistencies game - Steam 1297470",
    "Canonical URL": "https://gusku.site/game/inconsistencies",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Inconsistencies\", \"description\": \"Looking for information on Inconsistencies? Check out the release date (Jun 5, 2020), developer insights from Maxiig, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Maxiig\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Maxiig\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1297470/header.jpg?t=1591347972\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}