{
    "AppID": 1383700,
    "Name": "Jet Kave Adventure",
    "Release date": "Jan 15, 2021",
    "About the game": "FEATURES Master the jet-fueled platforming It won’t be easy with your clumsy caveman’s movements but try and do your best! Jetpack through 36 colorful levels Roam the amazing side-scrolling landscapes riddled with hazards and rich with secrets. Smack and whack 30 types of enemies Fight a variety of prehistoric beasts and bosses using your trusty bone club. Experience breakneck flight sequences and boss fights Soar across pitfalls, smash through rocky walls, and defeat the most terrific enemies using your continuously improving skills. Challenge yourself in ARCADE MODE Try the exciting arcade-like experience, where you have a limited number of lives, and getting to the checkpoint no longer replenishes your health. Plus, extra lives can be bought only between levels so if you lose them all, it means a good ol’ Game Over. It’s tough but fair. Reach the top of the leaderboard Take part in Time, Collectible, and No Damage Challenges, and compete against other players to get the best possible high score in online rankings. Find collectibles and upgrade your gear Return to the time when seashells were the only currency and collect as many of them to enhance your strength. Enjoy the unusual Stone-Fiction setting Whether you're ready for it or not, the fate of your island now depends on you. So put on your jet-fueled device and start your adventure in a world where the Stone Age and science fiction collide. Collect various achievements Some of them may seem odd, but they are all fun! SUMMARY: Jet Kave Adventure is a completely historically inaccurate yet highly entertaining 2.5D adventure platformer. Thaw out your inner caveman and join the skill-based action! Your name is Kave, and you’re the chief of your tribe – or rather you were until now. Banished by your own people you stumble upon… a jetpack! The device turns you into the only caveman who stands a chance against “the alien invader” – a rather unlikable guy from the sky who’ll readily kick off a disastrous volcanic eruption just so he can repair his spaceship. Begin your quest to save the whole island and prove your worth to the tribe!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1383700/header.jpg?t=1610729016",
    "Price": 14.99,
    "Developers": "7Levels S.A",
    "Publishers": "7Levels S.A.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1383700/ss_40aa6f3faa7ce0278c2d688a6e0366f2f8854b15.1920x1080.jpg?t=1610729016,https://cdn.akamai.steamstatic.com/steam/apps/1383700/ss_80131001bcf06c66865ba4e68db4042f3746774d.1920x1080.jpg?t=1610729016,https://cdn.akamai.steamstatic.com/steam/apps/1383700/ss_ba94e726279cf899ba17dec47f14178075656ec9.1920x1080.jpg?t=1610729016,https://cdn.akamai.steamstatic.com/steam/apps/1383700/ss_0310503d740a81724daa5edcc9390cffe6b0ab51.1920x1080.jpg?t=1610729016,https://cdn.akamai.steamstatic.com/steam/apps/1383700/ss_531e99527fb98057282add07e388200e970d7335.1920x1080.jpg?t=1610729016",
    "Slug": "jet-kave-adventure",
    "Meta Title": "Jet Kave Adventure: Jan 15, 2021, 7Levels S.A and Full Ov...",
    "Meta Description": "Looking for information on Jet Kave Adventure? Check out the release date (Jan 15, 2021), developer insights from 7Levels S.A, and a complete game summary.",
    "Alt Text Image": "Official header image for Jet Kave Adventure game - Steam 1383700",
    "Canonical URL": "https://gusku.site/game/jet-kave-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Jet Kave Adventure\", \"description\": \"Looking for information on Jet Kave Adventure? Check out the release date (Jan 15, 2021), developer insights from 7Levels S.A, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"7Levels S.A\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"7Levels S.A.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1383700/header.jpg?t=1610729016\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}