{
    "AppID": 1260960,
    "Name": "Kairos'Light",
    "Release date": "May 29, 2020",
    "About the game": "Go back to the past to rewrite Edmond's history, in the unique city of Thésye and its numerous mysteries ... In a dark and enigmatic future, a sad elder, Edmond, calls for help in his last hope. Hearing his call, the mage Kairos whose powers are infinite, gives him a chance to relive his youth to change his destiny. After an invigorating journey through time, you embody Edmond in his best age, the one of meetings at the pub and important life choices, in the pleasant city of Thésye. In this management game, your choices will have an impact on Edmond's life and his possible future alternatives. FEATURES : - A simulation of Edmond's life! Work, earn cash, and support Edmond's basic needs. You should always keep an eye on your hunger, stamina and health. Buy ingredients and cook! Use the cash to improve both of your living space and city ! - Improve your skills! By fulfilling various actions in the game, you will gain 3 types of experiences: blue, pink, yellow. Each can be placed in one of the three branches of the skills tree: STRENGTH, WORK, DIY (do it yourself). Unlock new features, new recipes, optimize your efficiency, make your own furniture and get unique items! - Personalize your living space. Your apartment is so empty. It will have to be furnished, and do not panic, the game offers many possibilities! Classic furniture, pop furniture or even diamond furniture for the richest few? Maybe pallets furniture, or even cardboard, handmade of course ! Discover the 8 sets of furniture that will allow you to personalize your apartment! - Take part in social life in the city. Interact with the 35 unique characters from your neighborhood in the city. Find what they love, become their friend by helping them and learn about their story. The time of day affects the characters activities and their dialogues! At night, it is at the bar that everything happens ... - Events that temporarily change the city. On certain special days, the city transforms to host exceptional events! The sets change, activities are offered, and the natives offer new dialogues. - Commit in the future of Thésye! The citizens of the city are very active, and to do this, a project table has been installed in the town hall. Contribute with your cash and time in these projects to change the appearance of the city, unlock new buildings with unique features, bring new characters into the town. - An interactive game and various endings. In this management game, your choices will have an impact on the future of Edmond and his possible future alternatives. You can play in many ways! Depending on your playing style, the projects available are not the same, and the city will change into something completely different! - A Point’n click with many mysteries to discover ... Click on the decor elements, discover humorous texts, pick up objects, use them or give them to the inhabitants! - Action in the mini games! In this simulation, you will be offered numerous mini-games to enhance your daily life: at work, in the quests of the locals, to wash, to try to win cash at the casino ... - Quests and random events. Your life will also be punctuated by many quests and events that will bring challenges that you can decide to complete. Quests will give you experience and cash bonuses! Events can also be binding…! - Amazing music! They will ingeniously accompany your progress in the different areas of the game depending on the time of day! A B.O. made to measure for the game. - Watch TV! Stay tuned about events in the city, and enjoy television debates, documentaries, reality TV shows of all kinds! - Jokes aside! A strange and wacky universe, full of questionable humor and steaming jokes! Test your resistance to sick jokes and get stronger in life. - Woaw, so many successes! [/] Unlock all successes of the game! OPTIONS : - 3 save slot",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1260960/header.jpg?t=1605017550",
    "Price": 0.0,
    "Developers": "Manon Carrier,Jean-marc Vanbalberghe,Arnaud Vanbalberghe",
    "Publishers": "Assoc. Let's Develop Change",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1260960/ss_da89dda9ee003092a83313c127db3b04e97d7885.1920x1080.jpg?t=1605017550,https://cdn.akamai.steamstatic.com/steam/apps/1260960/ss_6306942847b7c36050546584246bf51903df4a57.1920x1080.jpg?t=1605017550,https://cdn.akamai.steamstatic.com/steam/apps/1260960/ss_bb422f5aec4bedaf02caf4ee0b26bcc7159fced0.1920x1080.jpg?t=1605017550,https://cdn.akamai.steamstatic.com/steam/apps/1260960/ss_06bcc5236d5a7cda92d97f78b6d69289004ca4bf.1920x1080.jpg?t=1605017550,https://cdn.akamai.steamstatic.com/steam/apps/1260960/ss_84fbb4c826ba3a45a3a7fc73f084e1fb47d28c5a.1920x1080.jpg?t=1605017550,https://cdn.akamai.steamstatic.com/steam/apps/1260960/ss_cd2f36eb9bcee65761eb6ec8f23640050c823077.1920x1080.jpg?t=1605017550,https://cdn.akamai.steamstatic.com/steam/apps/1260960/ss_bf7b16fde3cd7fc88ce22db6b63e0dab7146a0dc.1920x1080.jpg?t=1605017550,https://cdn.akamai.steamstatic.com/steam/apps/1260960/ss_08d6b59174f980d916375125536bcfdf6bd80fd9.1920x1080.jpg?t=1605017550,https://cdn.akamai.steamstatic.com/steam/apps/1260960/ss_26e969dec95af778c28b4001a17fb492ebea07e9.1920x1080.jpg?t=1605017550,https://cdn.akamai.steamstatic.com/steam/apps/1260960/ss_9b1f60d73308fadf40ecff86e84ed201b9c3c44a.1920x1080.jpg?t=1605017550,https://cdn.akamai.steamstatic.com/steam/apps/1260960/ss_8d7f4eabafbc9ed8fbcc3fc45ddfa840b56a2fbd.1920x1080.jpg?t=1605017550,https://cdn.akamai.steamstatic.com/steam/apps/1260960/ss_f7294ba32e7bb64e6f49bfb19d12c94bd373fdee.1920x1080.jpg?t=1605017550,https://cdn.akamai.steamstatic.com/steam/apps/1260960/ss_e952710ed71e339445b58d811d7a9ed7e86f95eb.1920x1080.jpg?t=1605017550",
    "Slug": "kairos-light",
    "Meta Title": "Kairos'Light: May 29, 2020, Manon Carrier,Jean-marc Vanba...",
    "Meta Description": "Looking for information on Kairos'Light? Check out the release date (May 29, 2020), developer insights from Manon Carrier,Jean-marc Vanbalberghe,Arnaud ...",
    "Alt Text Image": "Official header image for Kairos'Light game - Steam 1260960",
    "Canonical URL": "https://gusku.site/game/kairos-light",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kairos'Light\", \"description\": \"Looking for information on Kairos'Light? Check out the release date (May 29, 2020), developer insights from Manon Carrier,Jean-marc Vanbalberghe,Arnaud ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Manon Carrier,Jean-marc Vanbalberghe,Arnaud Vanbalberghe\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Assoc. Let's Develop Change\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1260960/header.jpg?t=1605017550\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}