{
    "AppID": 280680,
    "Name": "Krita",
    "Release date": "Jun 10, 2014",
    "About the game": "Krita is an open source drawing, painting and animation application designed for illustrators, concept artists, comic book creators, animators, game artists, matte painters and more. Krita is used daily by artists all over the world from professionals, to students, to passionate hobbyists. Krita offers many features, including industry standards and innovative designs, which make painting more fun and productive. There are powerful brush engines for sketching and painting, stabilizers for smooth freehand inking, assistants for constructing a complex scene, a distraction-free canvas-only mode for painting without clutter, multiple types of layers and masks for non-destructive editing and, frankly, too many other features to list! You can also exchange files with other applications in a variety of different formats. Another thing that makes Krita truly stand out is that it's being developed in coordination with an international community of open source enthusiasts with the unified goal of making a great digital painting application that's available as widely as possible. There are no activation codes or mandatory monthly subscription fees, because as members of the digital art community, Krita belongs to all of us--to use, to modify, to design, and to share. In other words, the Krita community is the lifeblood of this project; none of this would have been possible without the generous contributions of our users, and together, the sky is the limit. Our transparent and collaborative process is empowered thanks to the support of our users, and by buying through Steam you will be directly supporting Krita's development. Buying through Steam also delivers the convenience of easy installation on all your supported devices and automatic updates each time a new version is released. Finally, because Krita is a community-driven project you can also download it for free from the Krita Foundation website. Part of our mission is to create a potent tool for artists everywhere, free from most of the socioeconomic boundaries typically associated with professional art software. If users cannot afford Krita or are still unsure about supporting our work, we encourage them to try it out first, supporting us only because you want to. However, you won't have access to the benefit of automatic updates through Steam. Have some questions? Need some help? Feel free to stop by the support section of Krita-Artists for both official and community support. Key Features: An OpenGL powered, modern canvas with high-bit-depth monitor support and high quality scaling. Powerful layer engine allowing deeply nested and grouped layers. Additional layer types, including vector layers , clone layers , file layers and dynamic filter-effect layers . Over a dozen different brush engines , supporting pressure sensitivity, tilt, rotation and other features of graphics tablets . Over a hundred default brushes carefully produced or curated by professional artists. An intricate brush editor , for tweaking presets or creating your own incredible brushes. A gallery of filters with real-time preview. You can use almost any filter as an effect layer , for non-destructive workflows. Traditional 2D animation with a full timeline and onion skinning. Assistants Tool and Guides ; which help you to sketch straight lines, perfect ellipses, linear perspective, and complex scenes. Wrap-around mode for easily creating and visualizing seamlessly tiled textures and animated patterns. Multibrush Tool ; for drawing with any brush in perfect radial symmetry. Supports a wide range of color models : RGB, CMYK, YCbCr, La*b*, XYZ, Grayscale Supports a wide range of 3rd party file formats : ORA (MyPaint) , xcf (GIMP) , JPEG, PNG, TGA, TIFF, BMP, PPM, PGM, PBM, XBM, SVG, WMF and also some support for PSD. Fully open source (C++) and scriptable (Python). Krita belongs to all of us - to use, to script, or to mod! There is no limit to what Krita can do if we put our minds to it, whether you can hack it by yourself for personal use or work within the community to make Krita better for everyone. A great online manual , and a fantastic, growing community . Need some help? Have some questions? Stop by the support section of Krita-Artists for both official and community support. So join the Krita community, create wonderful artwork, consider supporting us by buying through Steam or making a contribution and, most importantly, have fun!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/280680/header.jpg?t=1641775184",
    "Price": 14.99,
    "Developers": "Krita Team,Krita Community Contributors",
    "Publishers": "Krita Team",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_9a474daa379859a9ba27c43f2adef7f1ba025b07.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_ff06f18219994931b2964eae756c5bde4e8e4994.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_b2c174fad5f24804038c1926331d7a42ef4e567e.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_5d9152233919441a81349548704ae646c492b221.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_b621ec09748c13fc4bd6475b6b3244b8f9913ec7.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_3dc3c014814186f2e00198adc1daf934a734238a.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_64af91b1fb1f5023031c32268d32878db60c1ee0.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_3f4db38812ea6fdca3f90d20d6bf34370726dece.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_b5479593d24c7d56753f2898d595ee8462d1328a.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_b7e55a4868ee46ee012b15a40eaaaf4d9dab7060.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_27d01b1c8b488d33bf3af862b9678c5b353c7959.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_09e4e82ace14084dbe4bb38568f4e51c27174f48.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_98851a8720cf4d8abfba527b0931ef79e47c1a79.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_da570efc23bf586123cf6e4afe1720a47a6d057f.1920x1080.jpg?t=1641775184,https://cdn.akamai.steamstatic.com/steam/apps/280680/ss_76c59f4377b71cf17f2c785aaa519584c2121f42.1920x1080.jpg?t=1641775184",
    "Slug": "krita",
    "Meta Title": "Krita: Jun 10, 2014, Krita Team,Krita Community Contribut...",
    "Meta Description": "Looking for information on Krita? Check out the release date (Jun 10, 2014), developer insights from Krita Team,Krita Community Contributors, and a comp...",
    "Alt Text Image": "Official header image for Krita game - Steam 280680",
    "Canonical URL": "https://gusku.site/game/krita",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Krita\", \"description\": \"Looking for information on Krita? Check out the release date (Jun 10, 2014), developer insights from Krita Team,Krita Community Contributors, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 10, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Krita Team,Krita Community Contributors\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Krita Team\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/280680/header.jpg?t=1641775184\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}