{
    "AppID": 1481680,
    "Name": "Lab Craft Survival",
    "Release date": "Dec 21, 2020",
    "About the game": "In the Mens Lab, an unknown 'Creator' comes up with Extra and other creatures and releases them into a confined space to create the Dominant species. You are one of the artificially propagated creatures dwelling in one of the MENS laboratories set to identify your adaptation skills in an unknown environment. This small closed laboratory has an artificially recreated environment like in one of the universe's planets that back in the past ended up creating life — Earth. However, the knowledge about this extraordinary space object was significantly distorted due to the time flow and misrepresented by the odd mind of the lab's 'Creator.' Object 20 is the main character and one of Extra, who joined the fight for being 'Dominant' in the lab. Its feature lies in its ability to reproduce artificial objects and its outstanding body development by assimilating food and its distribution into basic elements. The player will have to face numerous life-threatening situations, survive in non-standard conditions, show ingenuity and ability to analyze. In the game, you'll sometimes have to find connections in the most different things possible to stay alive at first and later become 'Dominant' or even escape from the complex. You can develop yourself the way and how much you want in this limited environment. Examine mobs' behavior and their impact on the lab, experiment with creatures, objects, stats, and plants, develop your character infinitely, furnish your lab the way you want it: turn it into a testing ground for your experiments or into a cute and convenient farm for development. Keep track of the primary indicators and elements, study their effect on your body, and learn how to extract and form information yourself to share it with other players offline. There are many opportunities, but they are all obscure. Once got in an unknown environment, how will you behave? Are you going to destroy everything around you? Build? Farm? Or maybe collect information and learn the lab's mysteries and secrets? The main thing to remember is that things may seem mistakenly familiar and safe, but they are not. Features • Reproduction: craft limited resources from units obtained by food digestion. • Infinite character development: your Extra creature's peculiarity is its constant development. Health, Energy, Strength, Speed, and even Inventory have no boundaries for growth. However, this is not easy to do. • Diseases and treatments: your character can catch a cold, get poisoned, dirty, wounded, and much more. Learn to treat these disorders using your environment, food, and skills. • Evolution Points: unsuccessful experiences and failures will be converted into Evolution Points, so if your Extra dies, he will permanently receive a part of the accumulated evolution points to start a new survival with a significant advantage. • Herbalism: the herbs in the laboratory are always distinct from each other. Some can heal you for certain diseases, others are a food source, others are poisonous, and some are even carnivorous. Which ones are useful for you? That's up to you to find out. • Farming: grow different crops rich in essential nutrients, fertilize them, improve your cultivation skills, and protect your yields from those who want to enjoy the fruits of your labor. • Building: decorate your laboratory as you please. Do you want a small house? A bunker? Or maybe arrange everything for a testing ground for your experiments? You are free to do it. The stronger your home, the fewer problems can get into it. • Limited space: your habitat is surrounded by laboratory walls, so resources are strictly scarce, but the right approach can restore or save them. Think ahead and appreciate what you possess. • Ecosystem: everything has its place in nature. Ants carry objects useful to them, simultaneously fertilizing the soil for plants, hares eat an excess of harmful vegetation, containing its population. On the other hand, bees collect pollen for honey produced in hives on trees, while beavers destroy these trees, and various fruits and insects grow on the very trees, whereas wild boars eat those insects and so on. Be careful to upset the balance to either side. • Sleep and Crafting: while sleeping, you may dream of crafting ideas, but the recipe will be shown partially, so you will have to find out the rest of it on your own. • Flexible mechanics: Many things in the lab can interact with each other, the same items can be obtained in different ways, and the solution to specific issues can be completely different. For example, you can create a campfire by either crafting it or simply laying out logs and throwing dry grass on top of it, or you can even make it using a broken frame. Its ignition can be done in various ways as well: by hitting stone on stone, crafting a flint, or maybe just by blowing up some explosives nearby? • Ever-changing and complicating environment: not only does Extra develop in the lab, but others do it too. Some can evolve into more vigorous species, some grow in numbers, others simply cannot stand the competition and die out as species. • Miscellaneous: you may come across something that other players have not met, find out something that many do not yet know, or come up with something that can change your or the experience of others. The game does not give precise settings: you just find yourself among new possibilities and limitations.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1481680/header.jpg?t=1610909540",
    "Price": 2.99,
    "Developers": "Dorime",
    "Publishers": "DoriTeam",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1481680/ss_bb09545ad6d6de66df586353ff082346c939f445.1920x1080.jpg?t=1610909540,https://cdn.akamai.steamstatic.com/steam/apps/1481680/ss_fd4155c2486e85bdb16650862dc9597b5793232f.1920x1080.jpg?t=1610909540,https://cdn.akamai.steamstatic.com/steam/apps/1481680/ss_776c8beed7a52307483eaa7d6afb0c7876deac62.1920x1080.jpg?t=1610909540,https://cdn.akamai.steamstatic.com/steam/apps/1481680/ss_0d40a22ce9010b98533c47d35ac1ce00d4e16b4f.1920x1080.jpg?t=1610909540,https://cdn.akamai.steamstatic.com/steam/apps/1481680/ss_ece292937ee8121a54323c621e74790e79024961.1920x1080.jpg?t=1610909540,https://cdn.akamai.steamstatic.com/steam/apps/1481680/ss_13657e4b18c536f34ab8a331d430ec554d56da39.1920x1080.jpg?t=1610909540,https://cdn.akamai.steamstatic.com/steam/apps/1481680/ss_f632880e20e1255dc2ce5bae068404c5d801effd.1920x1080.jpg?t=1610909540,https://cdn.akamai.steamstatic.com/steam/apps/1481680/ss_d50f5db9d1a74b0dac6bdd4b683e0f6c118760a2.1920x1080.jpg?t=1610909540",
    "Slug": "lab-craft-survival",
    "Meta Title": "Lab Craft Survival: Dec 21, 2020, Dorime and Full Overview",
    "Meta Description": "Looking for information on Lab Craft Survival? Check out the release date (Dec 21, 2020), developer insights from Dorime, and a complete game summary.",
    "Alt Text Image": "Official header image for Lab Craft Survival game - Steam 1481680",
    "Canonical URL": "https://gusku.site/game/lab-craft-survival",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lab Craft Survival\", \"description\": \"Looking for information on Lab Craft Survival? Check out the release date (Dec 21, 2020), developer insights from Dorime, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dorime\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DoriTeam\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1481680/header.jpg?t=1610909540\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}