{
    "AppID": 719800,
    "Name": "Last Encounter",
    "Release date": "May 8, 2018",
    "About the game": "Last Encounter is a twin-stick action roguelite in deep space following a group of heroes trying to prevent the unavoidable by cloning their ships and designing their weapons with swappable components. Advanced technology lets you and your friends clone your avatars so death is not the end. Teleport into new sectors of space, discovering the ever-changing, procedurally generated layouts and hazards filled with strange beings and alien environments. Find dozens of advanced weapon components scattered throughout diverse galaxy biomes. Combine the pieces as you see fit to create the strongest weapon in the universe. Choose from a variety of unlockable ships and pilots and prove your skills against alien ships and bosses in the far reaches of space. Last Encounter does not have predefined weapons. Dr. Daniel Connor has found a way to use alien technology through a unique component based weapon system. Research enables you to combine components into deadly designs, like Homing Gatling Rockets, Poison Flak Shells or the Triple Bouncing Laser Beam on the image above. What components will you find in the depths of space? What weapons will you craft? Your mission sends you into deep space, many galaxies from home. Since not every pilot makes it back, or very far to be honest, Dr. Connor has a cloning device which lets him create new pilots to send on the mission. The problem with the portals though is that they are unreliable. You will end up in the same galaxies, most likely. But that does not mean they’ll be familiar. Every time you jump through a portal you’ll be in a galaxy sector you most likely have not seen before On your journey deep into unexplored sectors you will encounter both human remains and alien species. These strange beings might join you on your adventure and grow your pool of available pilots. Each pilot comes with their special traits. Some of them rely on speed and agility, while others prefer raw force. Besides pilots, you’ll also be growing your collection of space crafts in your home base. Ships have varied hulls and shields. But what mostly makes them apart are their special abilities. Cloaking devices, EMP bombs, Weapon Augmentations, you name it! Alien weaponry systems hold dozens of weapon components which can be designed into hundreds of weapons. With the various weapon systems, pilots and ships there are thousands of combinations you can use to your advantage, or doom. Although it’s perfectly acceptable for you to take on the mission by yourself, if you do prefer company, you can team up with three more pilots in local co-op. The friendly pilots will join in on your mission wherever you left off. You’ll be sharing the same progress, money pool and technology resources on your adventure into the unknown. Welcome to Last Encounter!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/719800/header.jpg?t=1612265678",
    "Price": 14.99,
    "Developers": "Exordium Games",
    "Publishers": "Exordium Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/719800/ss_c26907a7cf37f468a051956def6b2c5f2430041d.1920x1080.jpg?t=1612265678,https://cdn.akamai.steamstatic.com/steam/apps/719800/ss_cbf8f4e59a46e0bfcf298da1ed4145f065cc91dc.1920x1080.jpg?t=1612265678,https://cdn.akamai.steamstatic.com/steam/apps/719800/ss_343c4225c548a99388acf41d5d371db4209bd0f8.1920x1080.jpg?t=1612265678,https://cdn.akamai.steamstatic.com/steam/apps/719800/ss_3eadcfd98a8382406cafec00cf4e939c45057cc5.1920x1080.jpg?t=1612265678,https://cdn.akamai.steamstatic.com/steam/apps/719800/ss_9bc7813898006de9081b8b8107123078511e1785.1920x1080.jpg?t=1612265678,https://cdn.akamai.steamstatic.com/steam/apps/719800/ss_ebef469c7e4d113980ddb13a2d965a5a318d98bc.1920x1080.jpg?t=1612265678,https://cdn.akamai.steamstatic.com/steam/apps/719800/ss_b0748e84a02d5cac9f5e4d564715f8e6ba2566bd.1920x1080.jpg?t=1612265678,https://cdn.akamai.steamstatic.com/steam/apps/719800/ss_bc8a4210cdbdad9ce271cb4dbf8dc946cf83d4bd.1920x1080.jpg?t=1612265678,https://cdn.akamai.steamstatic.com/steam/apps/719800/ss_53e64c7e4ccb70943c8473e2421b45dc3b052f5a.1920x1080.jpg?t=1612265678,https://cdn.akamai.steamstatic.com/steam/apps/719800/ss_9a439be92656191c68f53182e08c2f7e524879d5.1920x1080.jpg?t=1612265678",
    "Slug": "last-encounter",
    "Meta Title": "Last Encounter: May 8, 2018, Exordium Games and Full Over...",
    "Meta Description": "Looking for information on Last Encounter? Check out the release date (May 8, 2018), developer insights from Exordium Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Last Encounter game - Steam 719800",
    "Canonical URL": "https://gusku.site/game/last-encounter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Last Encounter\", \"description\": \"Looking for information on Last Encounter? Check out the release date (May 8, 2018), developer insights from Exordium Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Exordium Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Exordium Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/719800/header.jpg?t=1612265678\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}