{
    "AppID": 1129580,
    "Name": "Medieval Dynasty",
    "Release date": "Sep 23, 2021",
    "About the game": "Europe in the early Middle Ages -- Nobles and clergy rule and the trade between nations brings prosperity as well as envy, distrust, and greed. Military conflict is everywhere and entire continents are changing. In Medieval Dynasty, you take on the role of a young man who has fled from war and wants to take his fate into his own hands. From being alone, inexperienced and poor you will develop into a master of many skills, a leader of your community and the founder of a prosperous dynasty which is meant to last and prosper for generations to come. Defending against wild animals while hunting for food, gathering resources and crafting equipment, building a house and erecting a whole bustling village while founding a family all contribute to a unique gameplay experience across many genres. Tough winters and unexpected events challenge your skills and dexterity as you strive to build your own legacy. You can choose to follow the main chapters, solve the questlines or just roam around and explore the vast medieval world – but be careful as wolves or bears may try to take a bite from you... Begin with the simplest things for your own survival like hunting and farming as well as building yourself a home. Found a family and have a heir - entice others to live near and work for you, erect many other buildings to transform your settlement into a vibrant village and, ultimately, a thriving dynasty that will reign for generations. A massive medieval open 3D world awaits… Be aware of harsh winters and unexpected events while honing your skills to turn from a medieval survivor into the ruler of a dynasty. Grab your axe, hammer, or hunting bow - and craft your legacy! Medieval Dynasty is a unique combination of multiple successful genres: Survival: The need to survive, feed and ensure survival through hunting, farming and cultivation of the land. Simulation: Create tools and weapons, construct and extend houses, stables and all manner of buildings as you grow an empire. Role playing: Develop your own character, interact with NPCs, take care of your family and form community alliances by helping others and trading freely. Strategy: While pioneering in the Middle Ages you will found and expand a village, manage the inhabitants, collect resources and produce all the goods you need and use or capitalise by trading them. Features: Beautiful and realistic open world 3D landscape with state-of-the-art graphics Full 4 seasons with day/night cycle and realistic weather conditions Interactive environment with trees to fell, various fruit to pluck, stones to collect, caves to explore and many more 18 different buildings with various levels from hay shacks to full stone mansions Over 60 pieces of equipment to craft, including weapons, tools, furniture and clothing Realistic wildlife interaction with plenty of different animals such as wolves, wild boars, deer, rabbits and others All activities will impact on food, water, health and endurance status Detailed skill tree for individual character development Unique events and decisions with direct impact on gameplay Dynasty reputation system triggering events with the king Quests, trade and economy, sandbox option, social connections to NPCs and many more",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1129580/header.jpg?t=1656927198",
    "Price": 34.99,
    "Developers": "Render Cube",
    "Publishers": "Toplitz Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1129580/ss_5031d1852546a140041257a835e087d7f1d130f3.1920x1080.jpg?t=1656927198,https://cdn.akamai.steamstatic.com/steam/apps/1129580/ss_babb9b4c89385300a9aff0e58f65bc307c47dc9d.1920x1080.jpg?t=1656927198,https://cdn.akamai.steamstatic.com/steam/apps/1129580/ss_0a3090a01388768927ab8b0a57fc6afcf5b90947.1920x1080.jpg?t=1656927198,https://cdn.akamai.steamstatic.com/steam/apps/1129580/ss_2f6818234c0a8400d5782f8d02a431807c8cd904.1920x1080.jpg?t=1656927198,https://cdn.akamai.steamstatic.com/steam/apps/1129580/ss_69be66501edbb4fad2d61579897efac521cc7372.1920x1080.jpg?t=1656927198,https://cdn.akamai.steamstatic.com/steam/apps/1129580/ss_92705b06ca47739c95298e00fdf33d700bfda60e.1920x1080.jpg?t=1656927198,https://cdn.akamai.steamstatic.com/steam/apps/1129580/ss_4565932e6f915c7d6878643a422cf7d41f6f561b.1920x1080.jpg?t=1656927198,https://cdn.akamai.steamstatic.com/steam/apps/1129580/ss_02aeeb6e9225852a01384f3c800fd43f9c900c46.1920x1080.jpg?t=1656927198,https://cdn.akamai.steamstatic.com/steam/apps/1129580/ss_804bf9dc2ec935d27635575ad82ba7be544d6ee3.1920x1080.jpg?t=1656927198,https://cdn.akamai.steamstatic.com/steam/apps/1129580/ss_ed796d91d55f268b4fcb5ae9639884fefb5508ae.1920x1080.jpg?t=1656927198,https://cdn.akamai.steamstatic.com/steam/apps/1129580/ss_e35167c4882b55079e9f6453eecdf8580326f3ad.1920x1080.jpg?t=1656927198,https://cdn.akamai.steamstatic.com/steam/apps/1129580/ss_4fe33c028797860cc2ff19595612420d8cd0d6d7.1920x1080.jpg?t=1656927198",
    "Slug": "medieval-dynasty",
    "Meta Title": "Medieval Dynasty: Sep 23, 2021, Render Cube and Full Over...",
    "Meta Description": "Looking for information on Medieval Dynasty? Check out the release date (Sep 23, 2021), developer insights from Render Cube, and a complete game summary.",
    "Alt Text Image": "Official header image for Medieval Dynasty game - Steam 1129580",
    "Canonical URL": "https://gusku.site/game/medieval-dynasty",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Medieval Dynasty\", \"description\": \"Looking for information on Medieval Dynasty? Check out the release date (Sep 23, 2021), developer insights from Render Cube, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 23, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Render Cube\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Toplitz Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1129580/header.jpg?t=1656927198\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}