{
    "AppID": 1747220,
    "Name": "Neverspring Chronicles",
    "Release date": "Nov 2, 2021",
    "About the game": "Far across the Northern Sea, as the crow flies, past the smokey coasts of Serpatia Trade City and over the sodded old ramps of Bridgeton lay the sprawling untamed wilds of the Frontier. Moss covered stones, wet with the mist of babbling brooks, line the creeks and rivers that run like veins through the upthrust mountains and rolling hills. Or so it was before... in the days when Mit and Manava were still just distant warring factions. Way out in the Frontier, no one ever expected they would be a threat to anyone but each other. The Twin Kingdoms had fought for 1,000 years... until the day the sky was wounded. Their reckless magic could not stop the sun, but the moon and stars were lost behind a scattered strata of bruised clouds. Reliable navigation ceased, crops withered to dust, and the world plunged into despair. It was then that the Twin Kingdoms came together in a joint effort to preserve the status quo, harnessing the fading power of magic into Mana Machines collectively known as Thaumatechnology. With that power they waged war to bring the world under one rule, for the good of all. But those who had settled the Frontier found their freedom replaced with nothing but service to a greater power. For three long years, they dared to fight for their freedom. ...they failed. A disgraced soldier and his magically gifted sister must confront the shadow of their estranged father to survive in a world where technology feeds on the death of magic. Hunt down fading magics to customize your combat abilities and explore a world on the edge of death and rebirth as you navigate a dynamic narrative toward multiple endings in this old school 90's style JRPG. Features: A rich and dynamic narrative designed for replayability through exploring the permanence of consequences. Choices matter in a branching storyline with multiple endings that change depending on the who, what, when, where of how you play the game. A simple yet meaningful Day/Night and Weather cycle that effects combat, NPC spawns, and exploration opportunities. Lots of easter eggs, hidden secrets, and optional content. Traditional sideview RPG combat with a renewed focus on party organization and resource management.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1747220/header.jpg?t=1635902599",
    "Price": 2.99,
    "Developers": "Durance Gaming",
    "Publishers": "Durance Gaming",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1747220/ss_a0056686cca48b5a80409f62dfebb906138c0b2f.1920x1080.jpg?t=1635902599,https://cdn.akamai.steamstatic.com/steam/apps/1747220/ss_71ac9d73987c9f5a7ac9a3e228c28886d1672a53.1920x1080.jpg?t=1635902599,https://cdn.akamai.steamstatic.com/steam/apps/1747220/ss_f3393d5384dc15b3cbdbbcec0bda2c3a18e5cf52.1920x1080.jpg?t=1635902599,https://cdn.akamai.steamstatic.com/steam/apps/1747220/ss_2e6a3aef20e6d7cdf6c9b992b9e880aeeaa05729.1920x1080.jpg?t=1635902599,https://cdn.akamai.steamstatic.com/steam/apps/1747220/ss_90aec545ee92b4dd8dfa6cff5b4e6ee40bceba6f.1920x1080.jpg?t=1635902599,https://cdn.akamai.steamstatic.com/steam/apps/1747220/ss_9dca49b47bad260ae98bebc822255965d95d5313.1920x1080.jpg?t=1635902599,https://cdn.akamai.steamstatic.com/steam/apps/1747220/ss_bc442c8f29e51bf4b8b1267ea87a2861637e9d89.1920x1080.jpg?t=1635902599",
    "Slug": "neverspring-chronicles",
    "Meta Title": "Neverspring Chronicles: Nov 2, 2021, Durance Gaming and F...",
    "Meta Description": "Looking for information on Neverspring Chronicles? Check out the release date (Nov 2, 2021), developer insights from Durance Gaming, and a complete game...",
    "Alt Text Image": "Official header image for Neverspring Chronicles game - Steam 1747220",
    "Canonical URL": "https://gusku.site/game/neverspring-chronicles",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Neverspring Chronicles\", \"description\": \"Looking for information on Neverspring Chronicles? Check out the release date (Nov 2, 2021), developer insights from Durance Gaming, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Durance Gaming\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Durance Gaming\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1747220/header.jpg?t=1635902599\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}