{
    "AppID": 597180,
    "Name": "Old World",
    "Release date": "May 18, 2022",
    "About the game": "Old World is a historical strategy game where you lead your empire through multiple generations, building a grand legacy to last beyond your own years. This is an era of great leaders, from the revered to the feared. Which will you be? Marry for politics, raise your heirs, and manage your relationship with the families of your kingdom. In the fast and furious world of kings and queens, family matters. Each of the 7 kingdoms has four noble families that provide various benefits when put in charge of your cities. Manage family ties through events, actions, and marriages to keep them happy and reap additional benefits. Upset them, or make them too powerful, and you risk their ire. Maintain a strong family unit, or distract yourself with more illicit adventures. The world is full of great characters with distinct personalities, strengths, and weaknesses. Use them to forge your kingdom, defend your borders, and build ties with other leaders. Seek out and recruit famed warriors, philosophers, builders, and more. Have them tutor your children, lead your armies, and further your reign. Different personality archetypes allow your court members to perform different tasks in similar roles. Find the right combinations to take full advantage of governors, diplomats, spymasters, and even your spouse. Characters develop new personalities and traits over time, growing old, gaining experience, and finally falling ill and passing away, leaving room for the next generation. Unsettled tribes, barbarian marauders, and remnants of previous cultures are all waiting in the vast unexplored wilderness. Discover artifacts and great heroes of the past at ruins scattered across the map. Experience over 3,000 unique events inspired by history and mythology. Contact with foreign dignitaries triggers event chains, stories, and courtroom drama. Pursue ambitions and legacies related to conquest, development, faith, and more. Historically inspired scenarios, weekly challenge games, and a choice between randomly generated and handcrafted maps to explore. Lead Carthage to victory as Hannibal in the Punic Wars, hold your own against Barbarian Hordes, or compete against other players in tackling fictional scenarios. Why do things the way they've always been done? Old World brings a new take to key elements of the 4X strategy genre: Go beyond the traditional resources. Buildings are made of wood and stone, not 'industry.' Population doesn't grow off 'food' alone. Orders are a resource shared across your realm. Instead of moving every unit once per turn, each unit can be moved multiple times until fatigued or Orders are depleted. Technological advancement is not predetermined. Randomization helps keep technology trees feeling fresh with each new playthrough. Quality of life improvements, such as the ability to undo mistaken commands and nested tooltips, ensure you're always making informed decisions. Play with friends in countless multiplayer modes — from hotseat, to asynchronous, to cloud play. Mods further open up infinite options for new worlds, empires, and dynasties — inspired by our real world, and by works of fiction as well.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/597180/header.jpg?t=1658278844",
    "Price": 39.99,
    "Developers": "Mohawk Games",
    "Publishers": "Hooded Horse",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/597180/ss_ce4d028d09bb38a9cd25601ce80ebb0d19a7f227.1920x1080.jpg?t=1658278844,https://cdn.akamai.steamstatic.com/steam/apps/597180/ss_beac7b76f069fa349b4c0821923467fe7b7af04c.1920x1080.jpg?t=1658278844,https://cdn.akamai.steamstatic.com/steam/apps/597180/ss_d61c3e34afd086cecf43c7d2bccdd5fde6c2fcf1.1920x1080.jpg?t=1658278844,https://cdn.akamai.steamstatic.com/steam/apps/597180/ss_45cb19bd1be697323a63678662493ed546ccc5a5.1920x1080.jpg?t=1658278844,https://cdn.akamai.steamstatic.com/steam/apps/597180/ss_af3c3394ac662b0e051ddbe81f3c43737707245a.1920x1080.jpg?t=1658278844,https://cdn.akamai.steamstatic.com/steam/apps/597180/ss_350ecd918f86eec642e02989e56cb046fbe5e6b7.1920x1080.jpg?t=1658278844,https://cdn.akamai.steamstatic.com/steam/apps/597180/ss_07ef9dab5ffc1fe4d22c24375fccba70e25e98a1.1920x1080.jpg?t=1658278844,https://cdn.akamai.steamstatic.com/steam/apps/597180/ss_0575d38f40f4f991a9c3946b9fbf56d5865bfb2f.1920x1080.jpg?t=1658278844,https://cdn.akamai.steamstatic.com/steam/apps/597180/ss_868cfda3973f843942bb2271ba7017554ed5bb3f.1920x1080.jpg?t=1658278844",
    "Slug": "old-world",
    "Meta Title": "Old World: May 18, 2022, Mohawk Games and Full Overview",
    "Meta Description": "Looking for information on Old World? Check out the release date (May 18, 2022), developer insights from Mohawk Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Old World game - Steam 597180",
    "Canonical URL": "https://gusku.site/game/old-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Old World\", \"description\": \"Looking for information on Old World? Check out the release date (May 18, 2022), developer insights from Mohawk Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 18, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mohawk Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hooded Horse\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/597180/header.jpg?t=1658278844\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}