{
    "AppID": 576960,
    "Name": "🧠 OUT OF THE BOX",
    "Release date": "Jul 19, 2018",
    "About the game": "Welcome to the Craziest Nightclub In this bouncer simulator you are Warren Baker, the new gatekeeper of the prestigious club The Box. After spending three years in jail, you just want to live an honest life and recover your daughter. However, the quirky clients of The Box will drive you closer to your turbulent past, involving you in a gangster scheme that threatens to destroy everything that you love. Every night, among the club’s visitors, you’ll find undercover cops, annoying celebrities, runaway criminals or ghosts from your past. As the new bouncer of The Box, you decide who enters and who doesn’t... by any means necessary. Be careful though, because each choice you make can influence the fate of the club and its clients. You’ll also need to keep your salary to avoid being evicted, to see your daughter again, and most importantly, to regain control of your life. Meet +300 unique characters, including celebrity cameos ! Face critical decisions with surprising (and hilarious) consequences! Live your own storyline inspired by classic gangster films Experience special events and funny side stories If diplomacy fails... Throw a punch or two! Comedy and thriller blend together in Out of The Box . Control the head of security of The Box and experience both hilarious situations and epic moments during the busy nights of the club. Will you let teenagers into the club in exchange for money? Will you allow drunk VIPs to get away with their awful behavior? Or will you work with the police to bring down the most powerful gangster in town? Everyone’s lives are in your hands. Only you can choose how their stories end. Key Features As head of security at The Box, you’ll have to: Follow the club’s rules, which become more complex with every day that passes. Find out who is lying and who is telling the truth. Who knows: you might even have to throw a punch or two! Not every day is the same: Be careful who you don’t let in. Maybe their significant other is a big fish, or the rest of their group might decide to go to another club. Dealing with VIPs won’t be easy. They expect the royal treatment. Beware of the people that enter the club. If you let rock fans in during an elite party, they may wreak havoc! The Box also organizes special events like St. Patrick’s, a day where everyone can get drunk and enter the club! Experience different storylines depending on your choices: Will you flirt with your boss’ girlfriend? Will you work with the police? Will you get along with a powerful but annoying gangster? Discover several alternate endings!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/576960/header.jpg?t=1657113011",
    "Price": 14.99,
    "Developers": "Nuclear Tales",
    "Publishers": "🚀 Raiser Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/576960/ss_50bed3e57da47019aeda67c7d93339b548b494c8.1920x1080.jpg?t=1657113011,https://cdn.akamai.steamstatic.com/steam/apps/576960/ss_49addd76c53ee23bbb790e4e629112108ed9035c.1920x1080.jpg?t=1657113011,https://cdn.akamai.steamstatic.com/steam/apps/576960/ss_cb4c27ad4b3b94f2c2f523f2cfe95776d912a910.1920x1080.jpg?t=1657113011,https://cdn.akamai.steamstatic.com/steam/apps/576960/ss_8bd9410fed8fc8e84b212889a07f8b2cba54e2c3.1920x1080.jpg?t=1657113011,https://cdn.akamai.steamstatic.com/steam/apps/576960/ss_8e0aea30bfef59cf9a8eb4a9e81827c1dcd0b673.1920x1080.jpg?t=1657113011",
    "Slug": "out-of-the-box",
    "Meta Title": "🧠 OUT OF THE BOX: Jul 19, 2018, Nuclear Tales and Full Ov...",
    "Meta Description": "Looking for information on 🧠 OUT OF THE BOX? Check out the release date (Jul 19, 2018), developer insights from Nuclear Tales, and a complete game summary.",
    "Alt Text Image": "Official header image for 🧠 OUT OF THE BOX game - Steam 576960",
    "Canonical URL": "https://gusku.site/game/out-of-the-box",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\ud83e\\udde0 OUT OF THE BOX\", \"description\": \"Looking for information on \\ud83e\\udde0 OUT OF THE BOX? Check out the release date (Jul 19, 2018), developer insights from Nuclear Tales, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 19, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nuclear Tales\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\ud83d\\ude80 Raiser Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/576960/header.jpg?t=1657113011\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}