{
    "AppID": 1948430,
    "Name": "Planet S",
    "Release date": "Jul 1, 2022",
    "About the game": "Planet S is a real-time strategy game where your goal is to colonize multiple planets in a solar system to advance your civilization, build a city and supply it to grow your faction. While the basic game is playable, many of the features we have planned are not yet implemented. You can look on our Roadmap above to see what we are planning for the future. Procedual planets The world consists of up to 14 procedually generated planets which you can colonize. A planets type affects things like the appearance, the farm productivity and the kind of resources you can find on it. Every player starts the game with a spaceship and enough materials to colonize their first planet. Uncolonized planets can be claimed by building a spaceport on it. Once you claimed a planet, you can integrate it into your economy! Build your civilization To advance your faction and unlock new buildings you need to attract residents and provide them the goods they require. By gaining more and more residents, you will unlock new production chains which will increase in complexity. At some point, your first planet won't be able to supply you with the resources you need, so you need to expand to other planets. Choose your path While you start your population with workers, you need to make a decision when you advance to the second tier. You can upgrade your residents to the science or military civilization type. You can adjust the direction in an adjacent city center. Your decision will determine your path for the game and set a focus on either a more peacefully or a violent way of playing and winning the game. It may be rational to carefully consider your decision and adapt to the situation you are in. Our plan is that residents of a civilization type generate science or military research points, which you can invest into research. The two research trees will unlock bonuses and unique buildings for the corresponding civilization type. Through that, the game experience will rely heavily on the path you select. Multiplayer You can start into a game alone or with up to three friends! At the moment, there are no direct multiplayer interactions implemented. We plan to add diplomatic and military interactions, which will make it interesting to play with multiple players. Combined with the possibility to select a unique way of playing the game, every match will differentiate from another.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1948430/header.jpg?t=1658518975",
    "Price": 0.0,
    "Developers": "TeamJA",
    "Publishers": "TeamJA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1948430/ss_0dd434d398e3ab7e446acf583df0a2e4b9d3cf1a.1920x1080.jpg?t=1658518975,https://cdn.akamai.steamstatic.com/steam/apps/1948430/ss_4c5af2a316a3ad7538a4102a4d8add8fb1b94b6b.1920x1080.jpg?t=1658518975,https://cdn.akamai.steamstatic.com/steam/apps/1948430/ss_c6f437b8481bcdbdbf34924b4019b5f88f614f74.1920x1080.jpg?t=1658518975,https://cdn.akamai.steamstatic.com/steam/apps/1948430/ss_f7e29db237501e639032b48dc6f7fa9c06001dbe.1920x1080.jpg?t=1658518975,https://cdn.akamai.steamstatic.com/steam/apps/1948430/ss_5cc3ea8c684bad7f8cf4e92ee6015911edbf868b.1920x1080.jpg?t=1658518975,https://cdn.akamai.steamstatic.com/steam/apps/1948430/ss_45fdcfcdf43d8f1158b5965c70851d8310214dcb.1920x1080.jpg?t=1658518975,https://cdn.akamai.steamstatic.com/steam/apps/1948430/ss_9174610ba518d5411a9e7c2ce96390fee60eba6c.1920x1080.jpg?t=1658518975,https://cdn.akamai.steamstatic.com/steam/apps/1948430/ss_70ff4dddeb04ea6abbc1fb2d03f862e6e946713c.1920x1080.jpg?t=1658518975",
    "Slug": "planet-s",
    "Meta Title": "Planet S: Jul 1, 2022, TeamJA and Full Overview",
    "Meta Description": "Looking for information on Planet S? Check out the release date (Jul 1, 2022), developer insights from TeamJA, and a complete game summary.",
    "Alt Text Image": "Official header image for Planet S game - Steam 1948430",
    "Canonical URL": "https://gusku.site/game/planet-s",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Planet S\", \"description\": \"Looking for information on Planet S? Check out the release date (Jul 1, 2022), developer insights from TeamJA, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"TeamJA\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TeamJA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1948430/header.jpg?t=1658518975\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}