{
    "AppID": 490280,
    "Name": "Realms of Magic",
    "Release date": "Jul 20, 2022",
    "About the game": "Realms of Magic is a fusion of classic, old-school game mechanics (such as crafting, talent trees, quests) presented in a modern, open-world structure. This 2D Action RPG transports you to the universe known as The Old Kingdom – a high fantasy setting filled to the brim with quests to complete, characters to meet, and monsters to beat. But let’s not get too confrontational with various imps or minotaurs. When you are not saving the villagers, you can also focus on gathering resources, leveling up your professions (such as lumberjacking, mining, or cooking… there are 16 of them for you to choose!), and building a house or a farm. Live your life in the Old Kingdom and write your own story. Create a character, choose one of many available races (such as humans, dwarfs, wild elves, or orcs) and show the world what you got! You can strive to become the most powerful knight or the best pyromancer. You can even try to make your playstyle more unique by combining many different techniques (Mixing fire and ice spells? Yep, sounds like a plan!). You can also lead a quieter, more laid-back life focused on woodcutting, planting vegetables, and trading with the locals. With time, you might be remembered as this inspiring self-made man who built a house, created an agricultural business, and enjoyed a little bit of leatherworking on the side (as a hobby). Oh, and also cooked some killer onion rings! The Old Kingdom is not a peaceful place. On the contrary, this world is inhabited by hundreds of various creatures that think about killing you. This is especially true when visiting the dungeons – these places are not for the faint of heart! However, you are far from powerless against the evils of this world. You have a whole arsenal of weapons, armors, spells, or traps at your disposal. Develop your skill tree (Have we mentioned that there are 7 of them for you to pick from?), choose the most suitable approach, and create your very own tactic. Become an ax-wielding, ice spike blasting machine that action rolls straight at the biggest guy in the group or focus your skills on necromancy and let your skeleton army do the job… when you sit back and rub your hands… in a rather dastardly manner. Crafting and building are essential components of Realms of Magic. These are the basic tools that will help you take this world head-on. There are 16 professions in the game (e.g., farming, alchemy, tailoring). All of them will help you reinvent your character and set your priorities. They might also prove to be vital in ensuring your survival during the roughest of days. These professions are your go-to stats when thinking about creating and managing your own keep. But even the most battle-hardened, wayfaring adventurers might want to take some time to learn how to mine or cook. Rich ores could prove to be a suitable source of income while on the road, and that onion rings recipe might save your life one day. Realms of Magic is also a narratively driven experience. The Old Kingdom, with all of its races and characters, has a very rich written history. There are volumes upon volumes of books for you to find. And they aren’t just about spells and history. Some of them are for pure entertainment and will allow you to lose yourself in the amazing adventures of two witch hunters - Hansel and Ritter. Who knows… you might even meet them during your journeys! Your adventure will also have a grand purpose. During your travels, you will find many diverse communities. Some of them might be hostile, and some of them might perceive you as their savior – a brave outlander capable of protecting them from all manners of beasts, bandits, or monsters. But watch out… because some of the biggest threats… are just on the horizon… ready to destroy the beautiful capital city of the Old Kingdom. Fascinating, vibrant epic fantasy world that provides you with a lot of freedom Beautifully crafted fantasy landscapes (including various villages, graveyards, dungeons, etc.). Ability to craft your own meaning of “adventure.” Flexible and intuitive fighting system that allows you to design your own strategies. 7 skill trees that allow you to reinvent your character and playstyle constantly. 16 professions that allow you to build, craft, gather, farm, etc. 9 playable races with a plethora of customizable options. Hundreds upon hundreds of items for you to wear, use or show off because why not? #flexing Living and breathing world with many diverse communities and rich lore. Monsters to slay, dungeons to conquer, spells to learn and loot to obtain… … but you can always simply become a farmer/alchemist/that weird herbalist that has a crazy look in his/her eyes, but somehow can cure people’s rash on their backs! what's it like to fuse old-school RPG mechanics with modern open-world structure? what's it like to shoot that fireball across the whole cave? what's it like to visit a fantasy world that is beaming with life? what's it like to admire a greatly detailed pixel-art? what's it like to summon a horde of undead rabbits? what's it like to protect the whole realm from evil? what's it like to explore a vast and beautiful world? what's it like to build a house from the ground up? what's it like to square up against the most dangerous creatures in the whole realm? what's it like to enjoy fine leatherworking? what's it like to FINALLY complete that copper armor set? #fashionrealms what's it like to discover the deepest secrets of the Old Kingdom? what's it like to have a purpose in your journey? Well… Realms of Magic might be the title you have been waiting for!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/490280/header.jpg?t=1658596233",
    "Price": 13.99,
    "Developers": "Polished Games",
    "Publishers": "Polished Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/490280/ss_40d402f6a10b15df1177e2b1c7d9de10b2b8d565.1920x1080.jpg?t=1658596233,https://cdn.akamai.steamstatic.com/steam/apps/490280/ss_d699a701757ab22291b17a2ecc9a918948bd40ea.1920x1080.jpg?t=1658596233,https://cdn.akamai.steamstatic.com/steam/apps/490280/ss_1b4ac1caf7c9c08997becc8b9e684c79552f7acc.1920x1080.jpg?t=1658596233,https://cdn.akamai.steamstatic.com/steam/apps/490280/ss_0281c680e3cf719da510038cb5b8ddedae859743.1920x1080.jpg?t=1658596233,https://cdn.akamai.steamstatic.com/steam/apps/490280/ss_a5b853cc8bce7b0b08110de5e2c8c9780e5a960f.1920x1080.jpg?t=1658596233,https://cdn.akamai.steamstatic.com/steam/apps/490280/ss_9f082bec7aedf838f0fc4cc916d465d3d2f7c104.1920x1080.jpg?t=1658596233,https://cdn.akamai.steamstatic.com/steam/apps/490280/ss_92d2bdd1ae86a79bfcb4d00807511cd16d248f53.1920x1080.jpg?t=1658596233",
    "Slug": "realms-of-magic",
    "Meta Title": "Realms of Magic: Jul 20, 2022, Polished Games and Full Ov...",
    "Meta Description": "Looking for information on Realms of Magic? Check out the release date (Jul 20, 2022), developer insights from Polished Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Realms of Magic game - Steam 490280",
    "Canonical URL": "https://gusku.site/game/realms-of-magic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Realms of Magic\", \"description\": \"Looking for information on Realms of Magic? Check out the release date (Jul 20, 2022), developer insights from Polished Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Polished Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Polished Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/490280/header.jpg?t=1658596233\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}