{
    "AppID": 1882230,
    "Name": "Rockstar Life",
    "Release date": "Apr 21, 2022",
    "About the game": "Wanna be a Rockstar but missing the skills or the time? No worries, I got you! Rockstar Life is a simple and fast, casual life simulation game with hand drawn graphics, in which you, through random events, deal with everyday decisions and dramas in a Rockstar's life. Everything from which drugs to use, to dealing with groupies and deciding the details of your upcoming tour; in this game you have to deal with every aspect of the Rockstar life! This game is heavily inspired by old classics like Rockstar and Rockstar Ate My Hamster! HUMBLE BEGINNINGS Start as a wannabe Rockstar in a basement flat and work your way up to becoming the most successful Rockstar. You don't get to decide your band members, but still you have to deal with problems caused by them. You don't get to choose the genre of Rock Music you want to perform, but you still have to deal with fans who don't think the sponsor you got fit your style. Yes, life is unfair, but the road to becoming a Rockstar is even more unfair and random. GO ON TOURS Decide where, which concert halls, how long and go on a tour. Earn popularity and money depending on the tour setup. Maybe some bigger band (for now) will offer you a support tour with them so you can become more popular, faster. Let's just hope that the tour doesn't end abruptly after an unlucky accident... WRITE SONGS Write songs and wait for the right moment to record and release them. You don't like the song you've written? Maybe some other band will, so you can sell it to them. Did you always want to write a song and give it the name of your dog? Now it’s possible! RECORD Choose songs, the studio you are going to record at and how many copies you are going to make. Deal with the opinions of your record label or your band mates during a recording. Will you self publish or are you gonna wait for the right record label to make you an offer you can't refuse before getting into the studio to record your magic? Release your recording and don't forget to check the TOP 100 list to see if you’ve reached the top. RANDOM EVENTS Decide on what to do in random events; the drugs you take, the groupies you diss, another band you respond to or a friend you choose to help, these things will all affect the outcome of your life as a Rockstar. Maybe taking drugs is not that bad after all, you’re a Rockstar after all, or will the moral values passed on to you from your parents be the compass to stardom? Up to you. (and a bit to the RNG) MANAGE YOUR HEALTH AND SKILLS Manage your health and other skills to get the best out of every action you are taking. Practice, check yourself into rehab or go on vacation. After several play throughs you will master the choices presented to you and start writing better songs, have better gigs and maybe reach the peak of your career. FESTIVALS Get invited to different festivals depending on your popularity. Earn money but also good popularity if you prepare right. BACKGROUND&amp;PERKS Get different perks that would affect your gameplay by answering few questions when starting your career. MAIN FEATURES Lots of random life events all affecting the outcome of the game. Hand drawn graphics. Great soundtrack that includes songs from amateur/semi-pro bands. Many different endings depending on the actions you take during the game. Very secret point system. Did you think that the Rockstar who sells the most albums is the most successful? I don't. 16 different types of tours to arrange; from local pubs to international stadiums. Rockstar difficulty mode always on. Every decision is for good. Unlimited replayability thanks to RNG. Your choices won’t always have the same consequences. Steam leaderboards to see if you’re as big of a Rockstar as you think. Steam achievements.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1882230/header.jpg?t=1657812324",
    "Price": 7.99,
    "Developers": "Worthy Game",
    "Publishers": "Worthy Game",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1882230/ss_254f398e631980802a7b1a0437253df08abcb4fa.1920x1080.jpg?t=1657812324,https://cdn.akamai.steamstatic.com/steam/apps/1882230/ss_e152365b5e15e241f6d21d36bf881eb0c31896f7.1920x1080.jpg?t=1657812324,https://cdn.akamai.steamstatic.com/steam/apps/1882230/ss_4a295b587492902d76524a507e8530886cf774cd.1920x1080.jpg?t=1657812324,https://cdn.akamai.steamstatic.com/steam/apps/1882230/ss_bc3d02eae9fd4f0202fb83f263e6cc909fc5cfdc.1920x1080.jpg?t=1657812324,https://cdn.akamai.steamstatic.com/steam/apps/1882230/ss_e30dd0940d62751758bde60eb9f50c4823cc09b7.1920x1080.jpg?t=1657812324,https://cdn.akamai.steamstatic.com/steam/apps/1882230/ss_c3587e24aaae2a0d666d2662df28afe79734bd19.1920x1080.jpg?t=1657812324,https://cdn.akamai.steamstatic.com/steam/apps/1882230/ss_ed2c20795de537b18a8bf2c4f528074b217720b6.1920x1080.jpg?t=1657812324,https://cdn.akamai.steamstatic.com/steam/apps/1882230/ss_00a74e0b6e3d707230008c06bf1a5ea37b5cc131.1920x1080.jpg?t=1657812324,https://cdn.akamai.steamstatic.com/steam/apps/1882230/ss_3a4bcae6b1c0048520c68e3debf5b09e9ef50136.1920x1080.jpg?t=1657812324,https://cdn.akamai.steamstatic.com/steam/apps/1882230/ss_dddb12bb851bc4ae3c9bf3ab8e8270b4032ee5b0.1920x1080.jpg?t=1657812324,https://cdn.akamai.steamstatic.com/steam/apps/1882230/ss_a9204ae53d225cdec1035fa56259b782786f5ea1.1920x1080.jpg?t=1657812324,https://cdn.akamai.steamstatic.com/steam/apps/1882230/ss_d5f711311c36645e827290d0ac61caada17a2e53.1920x1080.jpg?t=1657812324",
    "Slug": "rockstar-life",
    "Meta Title": "Rockstar Life: Apr 21, 2022, Worthy Game and Full Overview",
    "Meta Description": "Looking for information on Rockstar Life? Check out the release date (Apr 21, 2022), developer insights from Worthy Game, and a complete game summary.",
    "Alt Text Image": "Official header image for Rockstar Life game - Steam 1882230",
    "Canonical URL": "https://gusku.site/game/rockstar-life",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rockstar Life\", \"description\": \"Looking for information on Rockstar Life? Check out the release date (Apr 21, 2022), developer insights from Worthy Game, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Worthy Game\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Worthy Game\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1882230/header.jpg?t=1657812324\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}