{
    "AppID": 1274980,
    "Name": "Rogue Party 2",
    "Release date": "Jun 15, 2020",
    "About the game": "Your Turn Hero The golem's scream was lost in the myriad of crumbling dungeon passageways. Nailliv was already in the process of making the next one, so the loss didn't bother him in the slightest. He will stop at nothing to achieve his goal, killing Sargon and discovering the secrets of portal magic. You come to life suddenly. The loosely constructed essence of a fallen warrior within the cold stones of a golem. All you know is your current quest, and so you set out on your journey. Throughout the first dungeon you find a heavy sword and fire staff with magical properties that grant you life stealing powers. As you slay scores of enemies, you accumulate gold, potions and more items to aid in your adventure. The warrior spirit eminates from your reanimated body and you continue to grow in power. At last you reach him, Sargon, only to fall before his magic. As you crumble and the warrior spirit leaves you, your last thought is the hope that the next golem (or golems) will succeed where you have failed... Features * 1 to 4 Player Co-Op adventures - Scaling difficulty, but if players stick together they will have a slight advantage in multiplayer games. - Potions can be thrown at friends to help (or hurt them because it's hilarious). - Boss fights incentivize teamwork, especially on hard mode when additional enemies are spawned with the boss. * Randomized Levels, Items, Enemies, Bosses - Every one of the game's 20 levels is randomly selected so your experience will be different every playthrough. - Enemies are chosen from a random pool and placed on random spawn points. - Chests and their contents, likewise, are chosen from a random pool of items and placed on random spawn points. - Bosses are chosen from pools just like Enemies and Items. There are 4 different bosses to choose from for each Boss fight available. * Dynamic Potion System - Eight randomized potions chosen each game from 17 types (two are always healing). - Each potion is learned for the remainder of the game after using them on yourself, an enemy or an ally. - A person in town will sell you potions to help offset your bad luck finding them. * Item 'Prefix' System - Some items will roll a 'Prefix' with bonus affects. These stack up to three times with other items that have the same prefix. - Example: 'Shocking: 33% chance to launch lightning on hit.' If you had two of these it would be a 66% chance. - 32 Prefixes can randomly be rolled onto your items. - Procs from Prefix items can happen from other Prefixes. - Planning the Prefixes you want and changing your plan based on what you randomly find is half the fun! * Elite Item System - Defeating some bosses will unlock elite weapons and armor. - Once unlocked, these items will have a low chance of appearing in chests throughout the game. - Elite Items can also roll random Prefixes. * New Gem System - Each boss you defeat drops a gem that can be enchanted with a Prefix. - You get to choose from 4 random Prefixes which one goes on your gem. - These Gem Prefixes stack with whatever is on your other items. - Dying in multiplayer will not reset your Gems. * New Ghost System - In Rogue Party 2, the death system has been completely overhauled. - Until a player finds the exit or defeats the current boss, you will be a Ghost. - As a Ghost, players can knockback enemies every few seconds. - Use this ability to help or troll your friends. * New Town System - You are no longer on your own in Rogue Party 2. - After every boss, you will have a chance to revisit the town. - Rain will heal you. - Cookie will enchant your gems. - Nailliv will sell you potions. - Evalyn has upgrades for your items for sale. * New Hard Mode - Alternate Ending. - Enhanced enemy AI and upgraded combat abilities. - Unique rewards for beating Hard Mode. - Epic final multi-stage boss fight. Note from the Creator: Rogue Party 2 was a labor of love by one indie developer. Thank you to everyone who supported me in making this game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1274980/header.jpg?t=1592256557",
    "Price": 2.99,
    "Developers": "Chris Antoni",
    "Publishers": "Chris Antoni",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1274980/ss_5e7434f4af2492ef396176a1e7b26289f78b34db.1920x1080.jpg?t=1592256557,https://cdn.akamai.steamstatic.com/steam/apps/1274980/ss_5ea9a629025b72535cc24bcbbe591c6bed7aaebc.1920x1080.jpg?t=1592256557,https://cdn.akamai.steamstatic.com/steam/apps/1274980/ss_c99e5c9a6b7a3bf5fff9947d705c9e71f520f265.1920x1080.jpg?t=1592256557,https://cdn.akamai.steamstatic.com/steam/apps/1274980/ss_b5474d142e1ce9ad3f051f4d36c727223ab8239b.1920x1080.jpg?t=1592256557,https://cdn.akamai.steamstatic.com/steam/apps/1274980/ss_4efb71fcd234e6c6ef7c52ae4aa0f04200a06d10.1920x1080.jpg?t=1592256557,https://cdn.akamai.steamstatic.com/steam/apps/1274980/ss_0d9832ff63ad493bfd78dba747219f69923f0f9a.1920x1080.jpg?t=1592256557",
    "Slug": "rogue-party-2",
    "Meta Title": "Rogue Party 2: Jun 15, 2020, Chris Antoni and Full Overview",
    "Meta Description": "Looking for information on Rogue Party 2? Check out the release date (Jun 15, 2020), developer insights from Chris Antoni, and a complete game summary.",
    "Alt Text Image": "Official header image for Rogue Party 2 game - Steam 1274980",
    "Canonical URL": "https://gusku.site/game/rogue-party-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rogue Party 2\", \"description\": \"Looking for information on Rogue Party 2? Check out the release date (Jun 15, 2020), developer insights from Chris Antoni, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 15, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chris Antoni\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Chris Antoni\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1274980/header.jpg?t=1592256557\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}