{
    "AppID": 1843760,
    "Name": "Rogue Tower",
    "Release date": "Jan 28, 2022",
    "About the game": "Rogue Tower is a tower defense game with roguelike elements and a continuously expanding path which you can influence. Unlock new towers and buildings, build up your defenses, upgrade your towers through card draws and cash, expand the path tactically to control how enemies move and defend your tower. Where you build your towers is the most important aspect to any tower defense game. In rogue tower, the path the enemies must travel continuously extends and grows to much greater lengths than your average tower defense game making tower placement even more important in this game. Not only do you need to carefully consider what kind of coverage they will have, but towers also get a bonus to damage based on their elevation. This means that there are spots which are better than others, but they are limited; which towers do you place on these spots? do you save them for a tower you haven't unlocked yet? or do you put everything you have there now? are the good spots even in a good location or are they too far off the path? These are all strategical questions you will have to answer every game. Every level of the game you must choose a direction to expand the path. The path will randomly twist turn and split often. Wrangle what control you can over it to influence the shape of the level and how far enemies must travel down each path to get to the tower. Do you want enemies from all the paths to come one at a time as to not over saturate your defenses? Or do you want all of the enemies to merge together for your AOE damaging towers? During each game you will be able to choose random upgrade and unlock cards. These cards will let you build new towers or upgrade existing towers giving them better damage, range or new abilities. After each game you will gain experience which can be used to unlock further towers and upgrades to appear in game. You can also unlock permanent upgrades which will persist through every game you play giving you a small boost to the start of your next game. With over 400 unique cards and upgrades there is nearly endless replayability! Your tower will be attacked by several different types of monsters. As the game progresses you will encounter more complex and dangerous enemies. They can heal, sprint, launch attacks or even spawn more enemies themselves. Many of the abilities that monsters have will apply to nearby monsters making enemies dangerous in large packs depending on the enemies you are facing; even a weak monster can buff up a stronger one to dangerous levels. Each tower deals with certain types of enemies better than others. So every game you may have to consider whether to build up defenses in advance or to wait for the new threats to emerge and adapt on the fly. Join the Die of Death community to stay up to date with any new development, give feedback and suggestions or just chill with us in our memery. Discord: Twitter:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1843760/header.jpg?t=1643386141",
    "Price": 14.99,
    "Developers": "Die of Death Games",
    "Publishers": "Die of Death Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1843760/ss_bb8e78d081fb3edf05cef47afb061490641ac831.1920x1080.jpg?t=1643386141,https://cdn.akamai.steamstatic.com/steam/apps/1843760/ss_b1d5825e05fe7f009263272108c25b240d33adc2.1920x1080.jpg?t=1643386141,https://cdn.akamai.steamstatic.com/steam/apps/1843760/ss_566ac3e5077bc13498920e1c7c07ec8dbf3e9b77.1920x1080.jpg?t=1643386141,https://cdn.akamai.steamstatic.com/steam/apps/1843760/ss_e878536300761885ebd6b141c5ed76fbab7619db.1920x1080.jpg?t=1643386141,https://cdn.akamai.steamstatic.com/steam/apps/1843760/ss_081af94626360cd9986c9fadade4b3d040e3d689.1920x1080.jpg?t=1643386141,https://cdn.akamai.steamstatic.com/steam/apps/1843760/ss_9116068d3c53ecc090c6e0ff48df85c556dd7ca3.1920x1080.jpg?t=1643386141,https://cdn.akamai.steamstatic.com/steam/apps/1843760/ss_fb0af69304b475945a75f33448b0b862a36b7a85.1920x1080.jpg?t=1643386141,https://cdn.akamai.steamstatic.com/steam/apps/1843760/ss_a68949821cbc6e079b163d35f341a3623fec7e90.1920x1080.jpg?t=1643386141,https://cdn.akamai.steamstatic.com/steam/apps/1843760/ss_ee190257023b86dd82848b14cbd1372787439946.1920x1080.jpg?t=1643386141,https://cdn.akamai.steamstatic.com/steam/apps/1843760/ss_cb0269e5202cb96a616c6c975d0cce8622c40a7a.1920x1080.jpg?t=1643386141,https://cdn.akamai.steamstatic.com/steam/apps/1843760/ss_c8e5da91d0d4c9edf93a7a213eb8b4d9e3403605.1920x1080.jpg?t=1643386141,https://cdn.akamai.steamstatic.com/steam/apps/1843760/ss_08d5464482ef9c785d50afdad421c156ca575fda.1920x1080.jpg?t=1643386141,https://cdn.akamai.steamstatic.com/steam/apps/1843760/ss_52d8a2fdfd11816932e1d5019ac351c0084b66a6.1920x1080.jpg?t=1643386141",
    "Slug": "rogue-tower",
    "Meta Title": "Rogue Tower: Jan 28, 2022, Die of Death Games and Full Ov...",
    "Meta Description": "Looking for information on Rogue Tower? Check out the release date (Jan 28, 2022), developer insights from Die of Death Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Rogue Tower game - Steam 1843760",
    "Canonical URL": "https://gusku.site/game/rogue-tower",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rogue Tower\", \"description\": \"Looking for information on Rogue Tower? Check out the release date (Jan 28, 2022), developer insights from Die of Death Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Die of Death Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Die of Death Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1843760/header.jpg?t=1643386141\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}