{
    "AppID": 1579380,
    "Name": "Shadow Tactics: Aiko's Choice",
    "Release date": "Dec 6, 2021",
    "About the game": "Return to the beautiful world of Edo Japan Set in Japan around the early Edo period, Aiko's Choice is a stealth strategy game that takes place within the story of Shadow Tactics: Blades of the Shogun. The expansion focuses on one of the main game's protagonists: the kunoichi adept Aiko. She is a master of camouflage and distracts enemies disguised as a Geisha. Although Aiko was certain that she left her old life behind her, Aiko's former sensei, the cunning spymaster Lady Chiyo, reappears from the shadows to challenge her. Together with her deadly companions she sets out to hunt down the ghosts of her past... Play a team of five unique assassins In the style of the main game, you take control of five skillful assassins, including Aiko, to sneak in the shadows between dozens of enemies. Aiko's companions are just as deadly as her: Hayato is an agile ninja, who clears the way silently with his sword and shuriken. The mighty samurai Mugen prefers a more powerful approach and can defeat multiple foes at once. Yuki is a young thief, who places traps and decoys enemies towards their deadly fate. The wise marksman Takuma, however, relies on his sniper rifle and distracts enemies with his loyal pet companion Kuma. Define your playstyle Choose your approach when infiltrating enemy bases in hidden forest camps or lively Edo period towns. Set traps, poison and distract your opponents – or avoid enemy contact completely. Carefully plan your every move, utilize your characters' unique skills and execute your own ingenious tactics to outwit your enemies on the challenging missions that lie ahead! Return to the beautiful world of Shadow Tactics set in Japan, early Edo period. Rejoin your favorite characters for another adventure set within the story of the main game Shadow Tactics: Blades of the Shogun. Experience a previously untold tale centered around the kunoichi adept Aiko, who must face a vicious enemy connected to her past. Explore three fully fledged main missions, set in brand-new environments, and three shorter interlude missions. The expansion includes all the features of the main game Play a team of five different characters with their unique skill sets. Synchronize your team's actions to strike down your enemies at once with the 'Shadow Mode' feature. Choose between non-lethal or deadly stealth attacks. Find dozens of ways to take out or sneak past your opponents the way you want. Choose from three difficulty levels to match your skill. Disclaimer: You don't require a copy of Shadow Tactics: Blades of the Shogun to play Aiko's Choice. Even though you can enjoy this standalone expansion on its own, we recommend playing at least the first few missions of the main game to get a feeling of the game's mechanics as well as the characters and story! We are very happy to finally return to Shadow Tactics: Blades of the Shogun after all these years, and we hope that we were able to convert that joy into this standalone expansion. Join us on another visit… to Japan, early Edo period.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1579380/header.jpg?t=1651768654",
    "Price": 7.99,
    "Developers": "Mimimi Games",
    "Publishers": "Daedalic Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1579380/ss_56c90cced4129bc98ed9e1b4e46e356f3745e4b4.1920x1080.jpg?t=1651768654,https://cdn.akamai.steamstatic.com/steam/apps/1579380/ss_9e8f093c69f43331d025d56e8ba0c00a8df5edfa.1920x1080.jpg?t=1651768654,https://cdn.akamai.steamstatic.com/steam/apps/1579380/ss_cc2228fadb8a4db52a8d93051c89c97e27620524.1920x1080.jpg?t=1651768654,https://cdn.akamai.steamstatic.com/steam/apps/1579380/ss_49568f55667077be9232e8629a576d8ceac2d45a.1920x1080.jpg?t=1651768654,https://cdn.akamai.steamstatic.com/steam/apps/1579380/ss_59b6bbf48d9e7c235d5cce67b0f5abb0b9d3f33f.1920x1080.jpg?t=1651768654,https://cdn.akamai.steamstatic.com/steam/apps/1579380/ss_7005b4df29aa446f6c5d3957b022b4c88019d8aa.1920x1080.jpg?t=1651768654,https://cdn.akamai.steamstatic.com/steam/apps/1579380/ss_c3fb7a23257c1a65e9f1ea803b90c870c0cc6d76.1920x1080.jpg?t=1651768654",
    "Slug": "shadow-tactics-aiko-s-choice",
    "Meta Title": "Shadow Tactics: Aiko's Choice: Dec 6, 2021, Mimimi Games ...",
    "Meta Description": "Looking for information on Shadow Tactics: Aiko's Choice? Check out the release date (Dec 6, 2021), developer insights from Mimimi Games, and a complete...",
    "Alt Text Image": "Official header image for Shadow Tactics: Aiko's Choice game - Steam 1579380",
    "Canonical URL": "https://gusku.site/game/shadow-tactics-aiko-s-choice",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shadow Tactics: Aiko's Choice\", \"description\": \"Looking for information on Shadow Tactics: Aiko's Choice? Check out the release date (Dec 6, 2021), developer insights from Mimimi Games, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 6, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mimimi Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Daedalic Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1579380/header.jpg?t=1651768654\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}