{
    "AppID": 1240840,
    "Name": "Shadow Puppets & Beijing opera",
    "Release date": "Apr 8, 2020",
    "About the game": "The work is composed of a total of 4 acts with about 15 minutes. This is a short game of art appreciation, the main character is voiced by Beijing opera actor Miss Lv Yaoyao This is a horizontal clearance version of the game,In the game you will play Xue Xiangling, Experience the plot in a Peking opera The images and characters of this work are based on one of China’s intangible cultural heritage: Shadow Puppets[1], and the story and music of the game are based on another China’s intangible cultural heritage: Beijing Opera[2]. This work is designed to be dedicated to show you the traditional art of the ancient Chinese mainland in the form of a game. We hope you can enjoy and interact with the intangible cultural heritage of ancient China frame by frame. Meanwhile, “nostalgia” option in the game settings will add a translucent mask on the game screen so as to make the whole game more close to the real effect of enjoying Shadow Puppets. The characters in the work: Real shadow puppets are disassembled into small parts which then, are scanned and spliced together by the program, with the mode of operation of using a physical engine to simulate real Shadow Puppets. The story and music of the game are derived from the famous Beijing Opera “The Lucky Purse” and the actress is voiced by a professional Peking Opera actor. The work also includes a hidden level, a hidden skill, a hidden weapon . We hope you can appreciate the wonderful sparks of the collision of the most traditional and folk art of ancient China, and modern video games. [1]Shadows Puppets is first recorded in “Han Shu” in the Han Dynasty (about 100 B.C.): Emperor Wu of the Han Dynasty was extremely sad after his beloved wife died, so the minister made the image of his wife with cotton and silk, and installed the wooden poles as hands and feet, then after placing the curtain, the minister light the candle and invited Emperor Wu to enjoy, so as to alleviate his feelings of missing, which was recorded in “Han Shu” and is considered as the earliest source of Shadow Puppets. [2]Beijing Opera originated in the period of Emperor Qianlong of Qing Dynasty (in about 1790) when local opera teams from all over mainland China gathered in Beijing to celebrate Qianlong’s birthday, with its heyday of a drama stage being set up every dozens of steps with different accents from Xihua Gate to Gaoliang Bridge outside Xizhi Gate. Beijing Opera is mainly finally formed by the communication and fusion of four famous Hui Combo originally in the South and drama teams from all over the country.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1240840/header.jpg?t=1651132557",
    "Price": 0.99,
    "Developers": "好几万个脑洞",
    "Publishers": "好几万个脑洞",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1240840/ss_9f21cb49a613a03bc0532ac4cc531f645fd769df.1920x1080.jpg?t=1651132557,https://cdn.akamai.steamstatic.com/steam/apps/1240840/ss_5572675572027329ac8a2a801836ad79130a1252.1920x1080.jpg?t=1651132557,https://cdn.akamai.steamstatic.com/steam/apps/1240840/ss_328375094472f270f137b84b9c3767eac44f7502.1920x1080.jpg?t=1651132557,https://cdn.akamai.steamstatic.com/steam/apps/1240840/ss_b801192d9205144d574c867bf571a547dc91b005.1920x1080.jpg?t=1651132557,https://cdn.akamai.steamstatic.com/steam/apps/1240840/ss_cbed423e1939447a270d1f6fad7e7072b0eae920.1920x1080.jpg?t=1651132557",
    "Slug": "shadow-puppets-beijing-opera",
    "Meta Title": "Shadow Puppets & Beijing opera: Apr 8, 2020, 好几万个脑洞 and F...",
    "Meta Description": "Looking for information on Shadow Puppets & Beijing opera? Check out the release date (Apr 8, 2020), developer insights from 好几万个脑洞, and a complete game...",
    "Alt Text Image": "Official header image for Shadow Puppets & Beijing opera game - Steam 1240840",
    "Canonical URL": "https://gusku.site/game/shadow-puppets-beijing-opera",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shadow Puppets & Beijing opera\", \"description\": \"Looking for information on Shadow Puppets & Beijing opera? Check out the release date (Apr 8, 2020), developer insights from \\u597d\\u51e0\\u4e07\\u4e2a\\u8111\\u6d1e, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 8, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u597d\\u51e0\\u4e07\\u4e2a\\u8111\\u6d1e\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u597d\\u51e0\\u4e07\\u4e2a\\u8111\\u6d1e\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1240840/header.jpg?t=1651132557\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}