{
    "AppID": 1689280,
    "Name": "Spirit of Europe - Origins",
    "Release date": "Sep 30, 2021",
    "About the game": "The Spirit of Europe - Origins is a free edutainment jRPG independent game, developed in Unreal Engine 4. Embody a fragment of the mythical Europa and travel through history from the ancient times to the Renaissance, through the realm of thoughts and emotions, where spirits fight for supremacy over human consciousness. Experience a humanistic metaphor of historical events as we know them, possess over a hundred characters, drive their actions and witness their consequences in pivotal events of Europe’s past. Warning We would like to underline that this product is an indie effort, so please set your expectations accordingly. Special note: In order to gain access to the game, you will need to register &amp; complete our initial assessment, consisting of a few history-based questions that can be found on the game’s website: . The steps are described here: . Why the registration process? The explanations are given here: . Features : ● Free; ● Historically accurate educational content; ● Two realms: the spirit realm and the material one; ● Possession system, allowing you to take control of any NPC; ● Economy and building system used to upgrade and recruit units; ● Disciples II-inspired, tactical, turn-based combat; ● A deeply philosophical, fictional story-line involving gods, virtues, vices, concepts and thoughts, manifested as spirits; ● Over 15 hours of gameplay; ● 58 combat units with over 50 unique abilities; ● Over 240 NPCs to interact with, from ancient Greece to the 12th century European Renaissance; ● 13 unique maps offering over 20 quests; ● Possess &amp; explore the world with over 240 characters, from mere commoners to great figures of European history. Experience history with a twist : The perspectives of Gods, personalized virtues and vices are different from those of mere mortals in the spirit world we’ve built inspired by archetypal stories, western philosophy and core principles which the modern western society is built on: peace, democracy, rule of law, freedom, tolerance, pluralism - and we’ll let you discover the rest. Discover the forging of Europe &amp; the birth of the western ethos : Possess any mortal, be it a mere commoner or a great figure of history. Drive their actions and learn about their way of life, beliefs, fears and hopes, aspirations and ambition - and you may be surprised at what you uncover. Assemble your troops &amp; manage your resources : Gain influence with the living and inspire them to build the great edifices we know today. Gather the souls of defeated vices and use them to summon allies from among those fallen throughout the ages. Augment them with godly essences for they will be your shield against the forces that seek your undoing - and you will witness how the bitterest foes can become allies. By your hand shall history be made : Be the invisible hand that forges Europe’s history as we know it: from the ancient times of Classical Greece, throughout the glory of the Roman Empire, the tumult of its fall, the chaos that followed and the bonds formed in the Middle Ages. Your journey through Europe will only end once it’s reborn - or will it? Say hi, talk to the devs, ask questions, give us your feedback, talk history &amp; game dev! Most times, at least one of us is online during the day (CET time).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1689280/header.jpg?t=1642496920",
    "Price": 0.0,
    "Developers": "Predict Edumedia",
    "Publishers": "Predict Edumedia",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1689280/ss_6dc865e648e28ff1ddb700e2c7aa7521b279101d.1920x1080.jpg?t=1642496920,https://cdn.akamai.steamstatic.com/steam/apps/1689280/ss_acfd00cc208424df6665bd8b66ba580f4495df9e.1920x1080.jpg?t=1642496920,https://cdn.akamai.steamstatic.com/steam/apps/1689280/ss_9c5f00dea68ce7fe8902bae27f5543d48ea7f2b0.1920x1080.jpg?t=1642496920,https://cdn.akamai.steamstatic.com/steam/apps/1689280/ss_54f2e16f02f73b64cf349301a8f16be82b12b8e3.1920x1080.jpg?t=1642496920,https://cdn.akamai.steamstatic.com/steam/apps/1689280/ss_d2b670ad0bcd9f835238e4d5ff6980ac5910ba87.1920x1080.jpg?t=1642496920",
    "Slug": "spirit-of-europe-origins",
    "Meta Title": "Spirit of Europe - Origins: Sep 30, 2021, Predict Edumedi...",
    "Meta Description": "Looking for information on Spirit of Europe - Origins? Check out the release date (Sep 30, 2021), developer insights from Predict Edumedia, and a comple...",
    "Alt Text Image": "Official header image for Spirit of Europe - Origins game - Steam 1689280",
    "Canonical URL": "https://gusku.site/game/spirit-of-europe-origins",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spirit of Europe - Origins\", \"description\": \"Looking for information on Spirit of Europe - Origins? Check out the release date (Sep 30, 2021), developer insights from Predict Edumedia, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Predict Edumedia\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Predict Edumedia\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1689280/header.jpg?t=1642496920\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}