{
    "AppID": 781860,
    "Name": "Stick Adventures: Wizard Madness: Chapter 1",
    "Release date": "Jan 28, 2018",
    "About the game": "Stick Adventures: Wizard Madness mixes clicking games with strategy games. You can expect to face hundreds of enemies while trying to balance out the correct spells to survive. GAME FEATURES: 6 Levels of Clicking Madness. Various Enemies and vicious creatures to fight along your journey. In-Game Shop selling multiple Spells &amp; Abilities. Clothing/Equipment System Random Reward System for the Player. Pixel Art Graphic design. Full HD Soundtrack throughout the game. Cutscenes on each level. Auto-Save at the start of every level so no need for manual save. Shop System To use the Shop you need currency, the currency in this game is gold. Gold is dropped by defeating enemies, each enemy drops a random range of gold depending on their difficulty. The player will be able to view the entire shop from the start of the game with no limitations. Items purchased usually appear in the Shop Pit located in front of the player unless they are a direct buff. Spell System The spell system in Stick Adventures: Wizard Madness works based on the shop, the player first buys a spell scroll from the shop and then activates the scroll by clicking on it whilst it's in the Shop Pit. You can only have one spell at a time. Random Reward System The player will be rewarded throughout the game via the Random Reward System. This system is triggered via killing mobs to build up a behind the scenes counter, once this counter is at maximum capacity the player will be greeted with the Reward System. Clothing System The clothing system in Stick Adventures: Wizard Madness is very straight forward, the player has a large selection of clothing to choose from using the arrow keys on the keyboard. You do not have to pay for these clothes with in game currency all of it is available from the start. Save System Every time a new level starts the game automatically saves locally on your hard drive, please remember you only have one save file so if you start a new game it will erase the old one. Always press LOAD if you want to continue playing from where you left off previously. NEW will create a new save file erasing your old one. Developers Notes: This game is around 25 minutes long in total, I run Renegade Games as an Individual. This is the first title of what I hope to become a series of Stick Adventure games. Stick Adventures: Wizard Madness is the first game I have ever created. Any feed back would be greatly appreciated!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/781860/header.jpg?t=1517314287",
    "Price": 2.99,
    "Developers": "Renegade Games",
    "Publishers": "Renegade Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/781860/ss_2f3fb519fd770ff2ee4a8bce307ef759588baedc.1920x1080.jpg?t=1517314287,https://cdn.akamai.steamstatic.com/steam/apps/781860/ss_069180f17109d87c9451e0f80f5348c9330607a2.1920x1080.jpg?t=1517314287,https://cdn.akamai.steamstatic.com/steam/apps/781860/ss_fede562f91d434b3afc1e311b90ea086424933c2.1920x1080.jpg?t=1517314287,https://cdn.akamai.steamstatic.com/steam/apps/781860/ss_43274b818a05d125556f71485f81c8d0e5f3ec35.1920x1080.jpg?t=1517314287,https://cdn.akamai.steamstatic.com/steam/apps/781860/ss_67f462e9b7d7d0568b8698698554c61d10a60557.1920x1080.jpg?t=1517314287",
    "Slug": "stick-adventures-wizard-madness-chapter-1",
    "Meta Title": "Stick Adventures: Wizard Madness: Chapter 1: Jan 28, 2018...",
    "Meta Description": "Looking for information on Stick Adventures: Wizard Madness: Chapter 1? Check out the release date (Jan 28, 2018), developer insights from Renegade Game...",
    "Alt Text Image": "Official header image for Stick Adventures: Wizard Madness: Chapter 1 game - Steam 781860",
    "Canonical URL": "https://gusku.site/game/stick-adventures-wizard-madness-chapter-1",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Stick Adventures: Wizard Madness: Chapter 1\", \"description\": \"Looking for information on Stick Adventures: Wizard Madness: Chapter 1? Check out the release date (Jan 28, 2018), developer insights from Renegade Game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 28, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Renegade Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Renegade Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/781860/header.jpg?t=1517314287\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}