{
    "AppID": 486660,
    "Name": "Super Mixtape",
    "Release date": "Oct 24, 2016",
    "About the game": "Super Mixtape is a retro physics based rhythm-puzzle-platformer where you guide cassette tape ‘Mix’ across a fully reversible 2D world of A-Sides and B-Sides, completing puzzles as you progress to find the perfect beat. - “It throws everything you know about the standard platformer out of the window and creates its own rules.” – Otaku. - “My favourite game of EGX 2015” – GameGazm. Features World Flip – flip the world, like a cassette, playing forwards and backwards. The Flip Mechanic is the core mechanic of the game. Tumble – The tumble allows the player to correct themselves and rotate in the air. Challenging the rules of traditional 2D gameplay by allowing player rotation. The main character’s facial expression will change depending on his position. Jump and Physics – The jump in Super Mixtape is like no other jump and requires the player to jump from either the left or the right to gain height or distance based on the physics applied to the cassette. Supported by a considered and natural control scheme. Beat Switches – Being able to ‘switch the beat’ remixes the audio in the game and areas of the level will react to the change. The ‘beats’ are colour coordinated with supported differentiating patterns to assist players who suffer with colour-blindness or colour vision deficiencies. Puzzles – Navigate across puzzles in each level. Audio – The audio progresses with you as you progress through the levels. Zoom - Zoom out to see other parts of the puzzles. Future Narrative (currently being developed) 5 feature rich levels across multiple acts (totalling ~15 playable levels) More Puzzles Ingame Interactive OST - Original Sound Track featuring 12 full length customisable tracks Localisation in multiple languages including Russian, German, Polish, Finnish Local Multiplayer - Fun game modes (Depending on testing) Modding Support (Depending on testing) Basic Gameplay Rules “Throughout the design and construction of the game I have spent a lot of time thinking about the unique mechanics and elements of the game that create the overall experience.” As you progress through the game, your aim as a player is to traverse ‘Mix’ across the musical landscape to collect keys and unlock doors, allowing you to progress through the beat. You can only move when your magnetic strip is touching the ground. When you flip onto the B-Side, the amount of spooled tape is reversed and the cassette's stickers changes. You can jump from the left wheel (Left Trigger/Key) or the right wheel (Right Trigger/Key) allowing the cassette to jump and behave differently within the physics, giving you more distance or height.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/486660/header.jpg?t=1524576919",
    "Price": 12.99,
    "Developers": "Polygrammatic Limited",
    "Publishers": "Polygrammatic Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/486660/ss_8a8a5ab78095dde97027601744362afc31c3233b.1920x1080.jpg?t=1524576919,https://cdn.akamai.steamstatic.com/steam/apps/486660/ss_24db958993e6f35a4d5aff8b4c272c6717262c9c.1920x1080.jpg?t=1524576919,https://cdn.akamai.steamstatic.com/steam/apps/486660/ss_3e5f810413978e7a3aab4af78e12cff6f1c8401f.1920x1080.jpg?t=1524576919,https://cdn.akamai.steamstatic.com/steam/apps/486660/ss_1fb0d1c4e48b2b1d3490d8aea1d2f268bcb29146.1920x1080.jpg?t=1524576919,https://cdn.akamai.steamstatic.com/steam/apps/486660/ss_45bb99ffaf4c3f8f3e037515fcf35e1fd640a721.1920x1080.jpg?t=1524576919,https://cdn.akamai.steamstatic.com/steam/apps/486660/ss_73a866f6d79323e0dee95c8b96212d5a081354f9.1920x1080.jpg?t=1524576919,https://cdn.akamai.steamstatic.com/steam/apps/486660/ss_0c99e13e4a4bdd7a71d7a284bd38438c0456dcdc.1920x1080.jpg?t=1524576919,https://cdn.akamai.steamstatic.com/steam/apps/486660/ss_367cf4a5352081afefd847327baf0045939dc7a0.1920x1080.jpg?t=1524576919,https://cdn.akamai.steamstatic.com/steam/apps/486660/ss_0c82e57213573527cb60525315f81c62aeb15588.1920x1080.jpg?t=1524576919",
    "Slug": "super-mixtape",
    "Meta Title": "Super Mixtape: Oct 24, 2016, Polygrammatic Limited and Fu...",
    "Meta Description": "Looking for information on Super Mixtape? Check out the release date (Oct 24, 2016), developer insights from Polygrammatic Limited, and a complete game ...",
    "Alt Text Image": "Official header image for Super Mixtape game - Steam 486660",
    "Canonical URL": "https://gusku.site/game/super-mixtape",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Super Mixtape\", \"description\": \"Looking for information on Super Mixtape? Check out the release date (Oct 24, 2016), developer insights from Polygrammatic Limited, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 24, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Polygrammatic Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Polygrammatic Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/486660/header.jpg?t=1524576919\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}