{
    "AppID": 1044040,
    "Name": "Survive the Blackout",
    "Release date": "Feb 6, 2020",
    "About the game": "This is the way the world ends Not with a bang but a whimper. -- T.S. Eliot SURVIVE THE BLACKOUT is a narrative survival game set in a dark post-apocalyptic world where a mysterious global power outage sends the civilization spiraling down into chaos. In this modern-times tribute to the classic Oregon Trail, the player becomes the reluctant leader of a small group of survivors and tries to get them to a safe haven. In their journey, every step is a choice to make, and none of them will be simple. Manage a small team of survivors Carefully make your choices as a branching narrative unfolds Scavenge for supplies and manage your resources Explore the world after the fall of civilization in multiple unique playthroughs Be the relentless leader the survivors need in the harsh reality of the civilization in ruins, make all the dramatic choices, and face their consequences. Experience the story unfolding differently each time you play. Find out what are YOU willing to sacrifice to Survive the Blackout! The world of Survive the Blackout isn’t your average extravagantly stylized, farfetched post-apo setting. The game presents a plausible scenario of the fall of human civilization. A global power outage caused by factors unknown to the general public is enough for the better part of the modern world to crumble and the society to collapse. The dire consequences of such an event are powerful enough, without the need to include any supernatural or fantastic motifs. How did the Blackout affect the world? The survivors will travel to different regions, each with its own flavor, local storylines, unique risks, and opportunities. Through their eyes, the player will experience the familiar world reduced to ruin and filled with desperation. The apocalypse doesn’t make people more interesting than they already are. But it tends to bring out the best, the worst, and the weirdest in people. The story of post-apocalypse is best told from many different personal perspectives. Anyone who ever played a game like Fallout or other genre RPG or adventure will remember how the world came alive with all the NPCs, telling their stories, adding their own colorful presence to the overall experience. Preppers. Looters. Orphans. Healers. Murderers. Psychos. Beggars. Loners. Heroes. Opportunists. Thieves. Each of Everyone you meet on the road is a person with their own story, motivation, and personality. Each encounter lets you experience the story of humanity’s fall a little deeper. With all the rules gone, without the safety that civilization provides, each decision you make becomes a matter of life and death. Survive the Blackout is a narrative game where you make choices reacting to the circumstances your group of survivors face. It is up to you if you want to base them on morals, desperate will to survive, or some other ideals. Whatever you decide, you will have to bear in mind not only the immediate but also the long-term consequences of your actions. Managing supplies, issuing orders, moving forward, protecting the party, keeping the morale and giving everyone a sense of purpose is the daily labor of the leader. The party will offer you their take on the matters, but will you listen to them, or try to force your own ideas? It’s all up to you. Survive The Blackout is open-ended, and non-linear experience, because we want it to mimic life as well as a small indie game can manage. But we also want it to be finite and satisfying. Playing the game from start to finish will always provide you with a whole story. A different story in every playthrough, based on your decisions and luck, but a complete story nonetheless. While we hope that the sales of our title provide us with means and motivation to develop its world and the story even further via future content expansions, our main focus is to keep true to how we think games should be developed and sold: as complete products, and not as a “service”.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1044040/header.jpg?t=1581437627",
    "Price": 7.99,
    "Developers": "Baby Bison Games",
    "Publishers": "Baby Bison Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1044040/ss_3c711845c1fbda2251bf41efbfc8ed18412aefc3.1920x1080.jpg?t=1581437627,https://cdn.akamai.steamstatic.com/steam/apps/1044040/ss_9df5961638e3b69db84a3f1dee34754433508d29.1920x1080.jpg?t=1581437627,https://cdn.akamai.steamstatic.com/steam/apps/1044040/ss_52b36b81c0830e5410828b0b3377b725fdf61c14.1920x1080.jpg?t=1581437627,https://cdn.akamai.steamstatic.com/steam/apps/1044040/ss_6bf23819798c9ba4d6ad487addb1fd72b8d7c3c0.1920x1080.jpg?t=1581437627,https://cdn.akamai.steamstatic.com/steam/apps/1044040/ss_34b483fa726eded6d689352e5c3261bcb6f17c2d.1920x1080.jpg?t=1581437627,https://cdn.akamai.steamstatic.com/steam/apps/1044040/ss_462937ddfd24c9df04be698f5dd32a9fdfd31bd0.1920x1080.jpg?t=1581437627",
    "Slug": "survive-the-blackout",
    "Meta Title": "Survive the Blackout: Feb 6, 2020, Baby Bison Games and F...",
    "Meta Description": "Looking for information on Survive the Blackout? Check out the release date (Feb 6, 2020), developer insights from Baby Bison Games, and a complete game...",
    "Alt Text Image": "Official header image for Survive the Blackout game - Steam 1044040",
    "Canonical URL": "https://gusku.site/game/survive-the-blackout",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Survive the Blackout\", \"description\": \"Looking for information on Survive the Blackout? Check out the release date (Feb 6, 2020), developer insights from Baby Bison Games, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 6, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Baby Bison Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Baby Bison Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1044040/header.jpg?t=1581437627\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}