{
    "AppID": 1192440,
    "Name": "The Monster Breeder",
    "Release date": "Jan 19, 2022",
    "About the game": "This is a turn-based fantasy strategy game with RPG elements. The game has two main layers: the first is the monster breeding, the second is the tactical turn-based arena combat. Main Features Create Monsters Tactical Arena Combat Large variety of tournaments Warrior training Forging Alchemy Base upgrading Players can purchase eggs and juvenile creatures from local hunters. The next step is to set up a magical treatment to enhance the creatures’ strength, agility, and other attributes. Nearly all these traits can be manipulated with magic scrolls, potions, blood infusions and runestones, although overuse of magic and potions can cause severe illness, infertility, shorter lifespan, or even death. Natural species are weak and perform poorly in the arena, but all have at least one valuable ability. There are three classes of creature available: insect, reptile and carnivora. Players can only crossbreed species within the same class, and the best offspring can then be selected for magic treatments to improve their combat performance. Only eggs and juvenile creatures can be treated. Adult monsters earn experience fighting in the arena and learn new skills when leveling up, but these skills are not inheritable. There are multiple options for players to house their monsters in the various chambers and cellars of the Old Keep, or they can build a small hut or kennel in the courtyard and upgrade it. Depending on their temperature tolerance, some creatures can live in a flooded dungeon cellar while some others need a warm environment to remain healthy. Only healthy creatures can fight and earn money for their masters. Combat in the arena is tough but not always deadly. Beginners can participate in non-lethal tournaments without the risk of losing a character or monster. Lethal combat pays much better, but this is a game with permadeath, so be aware! How much risk are you willing to take? Which tournament are you going to enter? Only you decide. Players get money if they take part in a tournament, but only the winners receive the glory and extra rewards. Warriors, archers and sorcerers can be hired to fight side-by-side with monsters in the arena. Players can personalize their training and equip them with weapons that match their skills and strength, although to be overburdened with armor comes with serious penalties in combat. Characters earn experience in the arena and gain new skills when leveling up, and older warriors can be valuable trainers depending on their intelligence and trainer skills. Some hired characters may refuse to participate in lethal tournaments, but slaves can also be trained for combat. Players need to hire a blacksmith and alchemist to be able to craft items like weapons, armor or potions. Every craftsman has unique skills and traits affecting their products’ quality, their rate of work, and the amount of material they use. Various types of equipment can be purchased to enhance productivity: recipe books, alembics and extractors are all useful accessories of the alchemist's lab, while weapon and armor molds, alloy smelters and special forges are exceedingly beneficial to the blacksmith. Apprentices can be hired to improve productivity and players can employ them as blacksmiths or alchemists when they graduate. Players can construct or upgrade various types of buildings, allowing them to keep more monsters, incubate more eggs, create more weapons and potions, or increase storage capacity and the size of their living quarters. Some buildings have unique features: Hatchling's Cabin provides the possibility of using runestones and magic fields to modify juvenile creatures’ traits, while the Alchemist's Shack and Blacksmith's Hut provide more places to hire craftsmen and also give an efficiency bonus. The Old Keep is the default building at the beginning of the game. It has multiple chambers and cellars, all of which can be assigned to any purpose.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1192440/header.jpg?t=1658511014",
    "Price": 19.99,
    "Developers": "Fantasy Creations",
    "Publishers": "Fantasy Creations",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_9aadab5ffe4072a3811e044f4526e342adae86d7.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_25874871af89fca5deb9ee89dcc2879999325bbf.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_b7618fb97c767e31564d72ace97d1dcd6d1a90a8.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_3af1cb7f726d40df7611767df6a143d3567f962e.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_4f529a235358f1796aeef134e0bcaa833ed51cb8.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_9a308aeef831b269c5a2a5459bd78ea80f13ccf9.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_0b7f5df7d7ae097cf891a61e19fe06d5f77b5e96.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_e653f0f003ef011478273505d0c5fa9ac8dc2213.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_fbd748ed55cbe925f6ac77676a08f2b09984773e.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_895018ba2d0eb9411b87ad15f9ff57f57daacee2.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_d756761670a97791fb5befb7888c41ac184209a4.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_9524d634b3e9cdfb183f21930182a6b092d4679a.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_844b0e835c6a8d31ef007f937925f95ab39d891f.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_7318d39a8dfe6ecc4de8cbc17529e19d752cd5d7.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_d64b43b82ab4930ca084598ce2293515a3cb9132.1920x1080.jpg?t=1658511014,https://cdn.akamai.steamstatic.com/steam/apps/1192440/ss_8f5133c29e17618d161465efd628057ba76facd5.1920x1080.jpg?t=1658511014",
    "Slug": "the-monster-breeder",
    "Meta Title": "The Monster Breeder: Jan 19, 2022, Fantasy Creations and ...",
    "Meta Description": "Looking for information on The Monster Breeder? Check out the release date (Jan 19, 2022), developer insights from Fantasy Creations, and a complete gam...",
    "Alt Text Image": "Official header image for The Monster Breeder game - Steam 1192440",
    "Canonical URL": "https://gusku.site/game/the-monster-breeder",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Monster Breeder\", \"description\": \"Looking for information on The Monster Breeder? Check out the release date (Jan 19, 2022), developer insights from Fantasy Creations, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fantasy Creations\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fantasy Creations\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1192440/header.jpg?t=1658511014\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}