{
    "AppID": 1885130,
    "Name": "The Future You've Been Dreaming Of",
    "Release date": "Jul 14, 2022",
    "About the game": "※All characters involved in sexual content are over the age of 18. ※Gamepad operation recommended About Is Sachi Usui in your future? Take on the role of a Zashiki-Warashi, a house-bound spirit that can bring good fortune, and peer into Sachi's life (though she can't see you). You'll see some of her more vulnerable moments and have no choice but to intervene from time to time, but it's all to guide her toward a bright future! Give her direction while she's at home and help her grow her parameters in all kinds of ways. Your guidance will determine the future she ultimately heads toward. There are 20 total paths awaiting Sachi, and it's up to you to help her find them! STORY The economy is in recession, the job market is a fruitless tundra, and Sachi Usui is a college student in the middle of it all. It's almost time for her to take her next step as an adult by seeking employment, but she spends her lazy days unsure of what to become. However, she's suddenly told that her current building will be demolished and forced to find something new. Sachi's search leads her to an older but recently renovated dwelling with no special qualities besides...a 'resident god'?! The apartment seems fishy, but she moves in anyway hoping to benefit from the resident god's power. SYSTEM ■Search for useful items and draw Sachi to them with the sound of your bell! Sachi Usui's room is full of items that can alter her parameters. Seek them out and ring your bell to draw Sachi over to them. When she uses that item, she will experience some kind of change! The items available to use change by chapter, so search carefully every time. Her parameters at the end will open the path to her future! ■Sometimes Sachi will lower her guard. Sachi Usui, the resident of this apartment, cannot see the player. This gives you the chance to see how she lives her day-to-day life at home, as well as get glimpses of her unguarded as well as in some more compromising positions. There is a time limit on each chapter, so don't just sit and stare—be sure to focus on finding the items she needs to improve herself! Got it?! CHARACTER Sachi Usui(Voice: Yuuki Takada） A college student unsure of what path to take in the future. Her previous apartment is going to be demolished, so she's temporarily moved into a room overseen by an apprentice Zashiki-Warashi. She's average in every way imaginable, and is a laid-back optimist. Despite her overall awful luck, her personality and outlook are bright and positive. STAFF ・Character Design:Haruyuki Morisawa ・Producer:Yujiro Usuda",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1885130/header.jpg?t=1657851196",
    "Price": 17.99,
    "Developers": "qureate",
    "Publishers": "qureate",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1885130/ss_15e29dc4f548d78e36bf9d43c6ff2953a34f9dd3.1920x1080.jpg?t=1657851196,https://cdn.akamai.steamstatic.com/steam/apps/1885130/ss_cce3a1ee309ab89d029fce70510b046f6dbcd9b8.1920x1080.jpg?t=1657851196,https://cdn.akamai.steamstatic.com/steam/apps/1885130/ss_c1ab269798b22083c7ecd849db179395d42548be.1920x1080.jpg?t=1657851196,https://cdn.akamai.steamstatic.com/steam/apps/1885130/ss_7b4e042f175c96de11bfc5ab36cf9bbe80b9eb82.1920x1080.jpg?t=1657851196,https://cdn.akamai.steamstatic.com/steam/apps/1885130/ss_e8eabc2800f5528892594c47caaae5cc8dee4286.1920x1080.jpg?t=1657851196,https://cdn.akamai.steamstatic.com/steam/apps/1885130/ss_a6b7be3f80ba1e419eac02d9682222d19836831f.1920x1080.jpg?t=1657851196",
    "Slug": "the-future-you-ve-been-dreaming-of",
    "Meta Title": "The Future You've Been Dreaming Of: Jul 14, 2022, qureate...",
    "Meta Description": "Looking for information on The Future You've Been Dreaming Of? Check out the release date (Jul 14, 2022), developer insights from qureate, and a complet...",
    "Alt Text Image": "Official header image for The Future You've Been Dreaming Of game - Steam 1885130",
    "Canonical URL": "https://gusku.site/game/the-future-you-ve-been-dreaming-of",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Future You've Been Dreaming Of\", \"description\": \"Looking for information on The Future You've Been Dreaming Of? Check out the release date (Jul 14, 2022), developer insights from qureate, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"qureate\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"qureate\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1885130/header.jpg?t=1657851196\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}