{
    "AppID": 405820,
    "Name": "Turok",
    "Release date": "Dec 17, 2015",
    "About the game": "Turok is back and no dinosaur is safe! When it was first released in 1997, Turok introduced gamers to a world teeming with cunning enemies, traps, puzzles and deadly weapons all within a vast 3D environment ready to explore. Now the classic game has been restored and enhanced with a new visual engine and exciting new features to sink your teeth into! New features include: Support for high resolutions, and widescreen Improved gameplay and level design OpenGL for video backend to provide portability and support for vertical sync Dynamic lighting, bloom, FXAA, enhanced water effects, lights shafts and more Ability to freely rebind all keyboard, mouse, and gamepad inputs Steam Achievements The Lost Land... A world where time has no meaning - and evil knows no bounds. Torn from a world long gone, the time traveling warrior Turok has found himself thrust into a savage land torn by conflict. An evil overlord known as 'The Campaigner' seeks to shred the fabric of time and rule the universe using an ancient artifact known as 'The Chronoscepter'. The Chronoscepter was shattered thousands of years ago in an effort to keep it from falling into evil hands. The Campaigner has constructed a massive focusing array which he plans to use to magnify and pervert the power of the Chronoscepter in order to shatter the barriers between the ages and rule the universe. Turok has vowed to find the eight pieces of the Chronoscepter spread throughout the Lost Land and put an end to The Campaigner's evil plot... To learn more you must enter the world of Turok Completely 3-D Virtual World Run, jump, climb in any direction in a fully 3D world, with the ability to independently look and aim your weapons up, down, or sideways. Intelligent Enemies Programmed for Ferocity Variable aggression profiles make each enemy behave uniquely. 14 Monstrous High-tech Weapons From the Grenade Launcher, Plasma Pulse Rifle and Alien Weapon, to the Quad Rocket Launcher and, the mother of all guns, the Atomic Fusion Cannon! Advanced Interactive Backgrounds with Particle Technology Cobwebs sway. Bubbles form rings on the water's surface. Bullets ricochet. Trees explode into flames and crash to the ground. Waterfalls boil with foam. Bionically Engineered Dinosaurs Razor-toothed Raptors. Artillery-packing Triceratops. Alien Infantry and a Laser-Guided T-Rex. Following your every move with head-tracking technology.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/405820/header.jpg?t=1591116079",
    "Price": 19.99,
    "Developers": "Iguana Entertainment,Nightdive Studios",
    "Publishers": "Nightdive Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/405820/ss_8ec8f8fe9207e82e0cd9284fcb43b3ad30965691.1920x1080.jpg?t=1591116079,https://cdn.akamai.steamstatic.com/steam/apps/405820/ss_befd462c17208ca9fec9aa2c1f3044cb7956356f.1920x1080.jpg?t=1591116079,https://cdn.akamai.steamstatic.com/steam/apps/405820/ss_c0e0ba567f600912f7d76bb76781ab9a15f81aac.1920x1080.jpg?t=1591116079,https://cdn.akamai.steamstatic.com/steam/apps/405820/ss_f8fa66bef9727f9240f0bfd42b1da0027ca62988.1920x1080.jpg?t=1591116079,https://cdn.akamai.steamstatic.com/steam/apps/405820/ss_20ba762d010eb5cbd739589b8da5ca81a922f88c.1920x1080.jpg?t=1591116079,https://cdn.akamai.steamstatic.com/steam/apps/405820/ss_bb0d1dff5bdb6d160b88d1cb3a579a4bd1e7aade.1920x1080.jpg?t=1591116079,https://cdn.akamai.steamstatic.com/steam/apps/405820/ss_29cd59327c6e3011271faf51dc870d598e210473.1920x1080.jpg?t=1591116079",
    "Slug": "turok",
    "Meta Title": "Turok: Dec 17, 2015, Iguana Entertainment,Nightdive Studi...",
    "Meta Description": "Looking for information on Turok? Check out the release date (Dec 17, 2015), developer insights from Iguana Entertainment,Nightdive Studios, and a compl...",
    "Alt Text Image": "Official header image for Turok game - Steam 405820",
    "Canonical URL": "https://gusku.site/game/turok",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Turok\", \"description\": \"Looking for information on Turok? Check out the release date (Dec 17, 2015), developer insights from Iguana Entertainment,Nightdive Studios, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 17, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Iguana Entertainment,Nightdive Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nightdive Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/405820/header.jpg?t=1591116079\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}