{
    "AppID": 1926260,
    "Name": "Tuwas vs MUDA",
    "Release date": "Mar 28, 2022",
    "About the game": "In this business simulation, you take over the management of a small business and try to increase productivity by avoiding MUDA. Muda (無駄) is the Japanese word for meaningless activity. It is defined as '...any human activity that consumes resources but produces no value.' - Wallace J. Hopp In this game, MUDA is represented by the little colorful monsters that sit in the factory and do unproductive nonsense. Productivity is represented by clever squirrels 'Tuwas' (German for 'DoSomething'). They are always productive and always work hard. The more efficiently the operation is managed, the more Tuwas work in the hall. With bad management, MUDAs are everywhere and waste valuable working time. Other companies send you inquiries for which you calculate offers with a suitable price. Always remember to stay profitable. Some of the inquiries are initially not lucrative and would be a financial loss for you. So go to your office to negotiate directly with the customer and secure a profit for yourself. If the companies accept your offers, the planning of the production begins. Strategically distribute the orders to your machines. With clever planning, you can process many orders at the same time and still on schedule. If your financial resources allow, you can rent more machines, which will make it easier for you to distribute the work in the short term. However, more machines cost more money and require more employees, which leads to higher expenses. If, on the other hand, you plan cleverly, a few machines are sufficient to meet the delivery dates. If you do not meet a delivery date, the customer is not willing to pay the full price, which has a negative effect on your sales and thus also on your profit. All machines must be serviced regularly, which inevitably causes downtime. If the maintenance of a machine is not carried out regularly, this can lead to defects. Repairing a defect always takes longer than maintenance. It is therefore worth scheduling maintenance. All of these factors above must be carefully considered when planning business operations so that your company does not go bankrupt. Can you still remain profitable despite the many orders and the higher turnover? Unlock the infoBoard planning board, which can help you with planning through automation. This gives you a constant overview of your machines, employees and orders. Backward scheduling means that you always meet your delivery dates and get the agreed price. infoBoard planning board helps you to reduce the costs of your company and thereby increase profits.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1926260/header.jpg?t=1648536005",
    "Price": 0.0,
    "Developers": "infoBoard Europe GmbH",
    "Publishers": "infoBoard Europe GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1926260/ss_e0cb6df0bdf4ef6bc813840b97d116d5586476cd.1920x1080.jpg?t=1648536005,https://cdn.akamai.steamstatic.com/steam/apps/1926260/ss_fc547c1d99798d2f2a6fd32dbdb00b729907df5b.1920x1080.jpg?t=1648536005,https://cdn.akamai.steamstatic.com/steam/apps/1926260/ss_091ff4832f6a3ba4820cc83da801b259946cd23c.1920x1080.jpg?t=1648536005,https://cdn.akamai.steamstatic.com/steam/apps/1926260/ss_92902dd759e561060d4746f173e112aa06caba79.1920x1080.jpg?t=1648536005",
    "Slug": "tuwas-vs-muda",
    "Meta Title": "Tuwas vs MUDA: Mar 28, 2022, infoBoard Europe GmbH and Fu...",
    "Meta Description": "Looking for information on Tuwas vs MUDA? Check out the release date (Mar 28, 2022), developer insights from infoBoard Europe GmbH, and a complete game ...",
    "Alt Text Image": "Official header image for Tuwas vs MUDA game - Steam 1926260",
    "Canonical URL": "https://gusku.site/game/tuwas-vs-muda",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tuwas vs MUDA\", \"description\": \"Looking for information on Tuwas vs MUDA? Check out the release date (Mar 28, 2022), developer insights from infoBoard Europe GmbH, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"infoBoard Europe GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"infoBoard Europe GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1926260/header.jpg?t=1648536005\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}