{
    "AppID": 1296560,
    "Name": "Vectromirror 0™",
    "Release date": "Jul 2, 2020",
    "About the game": "The store page for Vectromirror™ is live! If you enjoy our free game, Vectromirror 0™, you're going to love the next chapter, Vectromirror. New levels, new features, Virtual Reality support, and more! Head to our new store page and add the game to your Steam Wishlist to get it when it releases October 13th! Click here to go to our new store page! Experiment Report #279 Our primary objective continues to be to establish an emotional response from an artificially intelligent life form. The goal is to trigger a set of “anthropomorphic” behavioral patterns by extrapolating data through a shared experience with the Test Subject. In lieu of prior failures, we will force-engage the Subject to traverse through a series of virtual perils in hopes of optimizing its potential to process emotional stimuli at the homosapien level. Our research team is developing two separate platforming simulation programs, dubbed Vectromirror, in which to test our hypothesis. This first program has been designated 'Vectromirror 0' as the starting point to test the functionality of the Subject inside the simulation. We will be monitoring the Extrapolator A.I.'s ability to comprehend as the Subject traverses a set course of static and movable obstacles utilizing several skills resembling parkour, such as wall-running. This will require the Test Subject to demonstrate significant levels of athleticism utilizing jumps and other physical techniques while also testing its advanced cognitive functioning. It will be required to adjust its approach to our designed puzzles and physics-based challenges. We have provided the Subject with the ability to manipulate its environment to provide a more favorable outcome in these iterations by defying normal physics to push and pull objects. While we are not anticipating the Subject to develop emotional responses within Vectromirror 0, it is worth noting that we have designed each course in a way that would evoke a specific emotion as if a human were running the course. We will be monitoring every action for indications of success in this design choice. To recap our current progress on the Extrapolator A.I. and it's developments, the Test Subject currently has developed it's core functionality in the following areas: Advanced Movement and Reflexes The Extrapolator has undergone significant kinesthetic and reflex learning and testing which allows it to travel at speeds unobtainable by all known bipedal species. This accelerated motion has taught our A.I. to calculate and execute the optimal path to it's destination through whatever path possible, whether that be the floor or wall. Early testing shows uploading the A.I. into Vectromirror 0 has reverted the Subject's reflexes to mere human levels. We shall see if this improves, but early testing does not look promising. Accelerated Jumping By programming a false repetition compulsion, the Extrapolator has been forced through rigorous tests to hone its ability to jump great heights and distances. Further, by combining its advanced movement features with this, the A.I. unit has acquired the ability to force it's momentum upward a second time, without requiring a counter force to propel it again. This 'Double Jumping,' as we've come to call it, will be closely monitored as our Subject may be learning at levels far quicker than we anticipated. Memory Recall and Testing Pain Stimuli In the event the Subject does not successfully complete an obstacle, it is destroyed by the simulation. As we are attempting to teach the subject emotional response, we have created a virtual hypothalamic-pituitary-adrenocortical axis inside it's core. Upon destruction we will send significant levels of pain stimuli to this axis in hopes of generating a pain response and subsequent dopamine release, to further our efforts of true sentience. After this instant pain signal, the Subject will regenerate, or respawn, in an area of close proximity, forcing it to reattempt the obstacle until they achieve the required outcome. During this entire process, the A.I. Extrapolator program will do exactly that...and will learn what the Subject learns. Our hypothesis being that this shared experience will allow the Extrapolator to awaken emotionally without the scars of being the one in jeopardy itself. Once completed, we can simply toss the Subject away. It is...disposable. Propulsion Ability Part of the design of Vectromirror 0 features a variety of objects the Subject will be forced to interact with to continue it's course. We have outfitted the subject with the ability to defy physics by forcefully pushing away or pulling these objects to it. The Subject will need to apply both mechanics to create a more favorable path through the obstacles or remove the obstacle all together. Team, having collected the data from Vectromirror 0, some of which you have been privy to, I am now in the process of upgrading to the new iteration, simply called Vectromirror. This will take the form of a more…let us say…extreme methodology. Some might call me to task for this, but as you have, yourself, seen firsthand, the previous attempt to awaken the Extrapolator A.I. emotionally has shown promise in Vectromirror 0, which beckons further experimentation. Fortunately, the knowledge gained has led me to understand that to force/awaken the Extrapolator A.I. through the use of a secondary Subject all that is truly required is, shall we say, a more…visceral…set of experiences. That is to say…the Subject will be put through a more dangerous course of obstacles to overcome and feel compromised to a significantly greater degree. Again, you may question the morality of my decision. But it is true, after all, that sometimes the ends do in fact justify the means. When the cause is important enough. And in this case, it is. As more, merciful options have clearly failed to simulate, putting the Subject through, what some might view as a... series of atrocities, is now the preferable option.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1296560/header.jpg?t=1602626393",
    "Price": 0.0,
    "Developers": "The Vectromirror Initiative",
    "Publishers": "Burnout Game Ventures",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1296560/ss_461f780103270138c0b65aecd0c09ce3f7d6aa90.1920x1080.jpg?t=1602626393,https://cdn.akamai.steamstatic.com/steam/apps/1296560/ss_dfcfa0264642048639dca469b4fef6c250e0410b.1920x1080.jpg?t=1602626393,https://cdn.akamai.steamstatic.com/steam/apps/1296560/ss_1a2684139d49f7353e11c24227fe62bff76d40d5.1920x1080.jpg?t=1602626393,https://cdn.akamai.steamstatic.com/steam/apps/1296560/ss_9dd3c9ef8bd0a1a5b960c7147ca24163d91f3982.1920x1080.jpg?t=1602626393,https://cdn.akamai.steamstatic.com/steam/apps/1296560/ss_1d7c39beef3ce65fb94b4b8e9bed7b04b06c7b7a.1920x1080.jpg?t=1602626393",
    "Slug": "vectromirror-0",
    "Meta Title": "Vectromirror 0™: Jul 2, 2020, The Vectromirror Initiative...",
    "Meta Description": "Looking for information on Vectromirror 0™? Check out the release date (Jul 2, 2020), developer insights from The Vectromirror Initiative, and a complet...",
    "Alt Text Image": "Official header image for Vectromirror 0™ game - Steam 1296560",
    "Canonical URL": "https://gusku.site/game/vectromirror-0",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Vectromirror 0\\u2122\", \"description\": \"Looking for information on Vectromirror 0\\u2122? Check out the release date (Jul 2, 2020), developer insights from The Vectromirror Initiative, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 2, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Vectromirror Initiative\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Burnout Game Ventures\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1296560/header.jpg?t=1602626393\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}