{
    "AppID": 1509520,
    "Name": "White Girl",
    "Release date": "Jan 31, 2021",
    "About the game": "This is a growth note of colorful and pitiful girls... In spite of just an indie game, this game is supported by network multi-play, and up to 4 players can play together! Also, effectively used Live2D graphic express girls cutely. This game's category is very original, which is 'Real-time-color-changing-strategy Game'. This game sets 'color' itself as a battle states and it makes this game unique. Three attributes of colors, which are expressed as R, G and B, have a value from 0 to 255. The value of the color becomes the states and appearance of the girl. In the game, the girls' appearance is a public information for all players, but the actual color states that girls have is a private information. This means, this game is a world-first “half perfect information battle game”! ---To be the 'White Girl', that is my purpose. While being a battle game, its original world view is also a special feature. AI girls gain emotions as 'color', and try to become a human being. As they gain various emotions, their R, G and B status change. The girls' aim is to make all those three status 255, which is a color called 'white'. To be the 'White Girl' is the goal for players, and it also is the goal of world view. [Game summary] #Four players real-time battle royal! This game is a battle royal game which in-game time goes by in real-time. The main game mode is randomly matching world battle mode, but you can also play friend match mode if you want to play with friends casually. #Update the AI girl and fight against other players! By gaining cards called 'piece of memory', you can update your girls and/or attack opponents' girls. As the girls get updated, their bodies gain various colors. The colors are expressed in three values, which are 'R', 'G' and 'B'. The values themselves become the girl's status and her appearance. #Color affection makes brand new strategy! 'R', 'G' and 'B' affect each other. Since this game is real-time four players game, you always need to check two things. How other players are making their girls and how you should make your girl to compete with them. This feature will give you a brand new strategy battle! #This game is recommended for these gamers! *Those who are interested in novel strategy games *Those who want to have fun with a network battle game casually *Those who want to play a game with your friends just like a party game *Those who like to customize a cute girl as you like",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1509520/header.jpg?t=1612140771",
    "Price": 5.99,
    "Developers": "Otorakobo Inc.",
    "Publishers": "Otorakobo Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1509520/ss_d5fc33b18b7a71f37d2760f4105db38dcd8583fb.1920x1080.jpg?t=1612140771,https://cdn.akamai.steamstatic.com/steam/apps/1509520/ss_8e2004348c80d195a52ceb3591172fd4ea226220.1920x1080.jpg?t=1612140771,https://cdn.akamai.steamstatic.com/steam/apps/1509520/ss_57ec6e96fefb8d1279a4d18faf9ec121d7f2d9de.1920x1080.jpg?t=1612140771,https://cdn.akamai.steamstatic.com/steam/apps/1509520/ss_46b09db27dc79d796e65b1bc0b6b9105212327b6.1920x1080.jpg?t=1612140771,https://cdn.akamai.steamstatic.com/steam/apps/1509520/ss_f0d9fbbb720b72be07e6489249bdd6153ad5cc1e.1920x1080.jpg?t=1612140771,https://cdn.akamai.steamstatic.com/steam/apps/1509520/ss_8ce2aa3d327a6a47406775c7e3b87b66c25d7337.1920x1080.jpg?t=1612140771",
    "Slug": "white-girl",
    "Meta Title": "White Girl: Jan 31, 2021, Otorakobo Inc. and Full Overview",
    "Meta Description": "Looking for information on White Girl? Check out the release date (Jan 31, 2021), developer insights from Otorakobo Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for White Girl game - Steam 1509520",
    "Canonical URL": "https://gusku.site/game/white-girl",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"White Girl\", \"description\": \"Looking for information on White Girl? Check out the release date (Jan 31, 2021), developer insights from Otorakobo Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Otorakobo Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Otorakobo Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1509520/header.jpg?t=1612140771\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}