{
    "AppID": 1398590,
    "Name": "1001 Jigsaw World Tour Asia",
    "Release date": "Sep 18, 2020",
    "About the game": "1001 Jigsaw World Tour: Asia is an exciting puzzle game and a fantastic tour guide. Put together jigsaw puzzles from a multitude of pieces and study the history, traditions and sights of Asia in 500 high-quality photos. Now you can solve your favorite jigsaw puzzles and travel the world without leaving the comforts of home! For more enjoyable and comfortable gameplay, we’ve provided a whole host of options! Set a difficulty to suit you for each puzzle – choose the number of pieces, their grade and turn function! Save your progress at any time and go back to assembling your saved puzzles whenever you want! For those who love a challenge, there are tasks and colorful trophies! Simple controls and plenty of hints and tools make the game a joy to play. With all this flexibility, the game is suitable for both new players and true professionals in the logic puzzle genre. An exciting tour across Asia awaits you: see the mysterious pyramids of Egupt, the fairytale isles of Thailand, the antiquities of China, the beautiful temples of India, the unique traditions of Japan, the paradise of the Maldives, the unity of life in the East and the modern technologies of Bahrain and the United Arab Emirates. 1001 Jigsaw World Tour: Asia allows you to enter the Forbidden City, stroll along the Great Wall of China, delve into Taj Mahal – the heart of India, touch the ancient walls of Angkor Wat in Cambodia, sail across the Halong Bay in Vietnam, and stay in the Burj Al Arab hotel-sail. Take advantage of this unique opportunity to visit over 20 countries in Asia – play 1001 Jigsaw World Tour! 1001 Jigsaw World Tour: Asia is a game and global tour guide. 500 high-quality photos: famous sights galore, plus architecture, monuments, art, national traditions and glory, history, cuisine… The real and unique Asia! And you can start your journey through it right now! - 500 high quality unique images - well designed game-play: useful hints, sort tool and magnifying glass. - optional game difficulty control makes your gameplay infinite - custom styles of pieces with rotation - save game progress and continue to collect the puzzle at any time - tasks and colorful trophies for those who love excitement - pleasant and relaxing music - 2 in 1: a game and a tour guide for Asia! - get 500 puzzles for one purchase. It is beneficial!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1398590/header.jpg?t=1600430564",
    "Price": 0.49,
    "Developers": "Creobit",
    "Publishers": "8floor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1398590/ss_0c437c37b699d5a83ac2cdbc00b30106bf4542f8.1920x1080.jpg?t=1600430564,https://cdn.akamai.steamstatic.com/steam/apps/1398590/ss_dc47e11a716a9a801df3cdc1eee5daee80b81e8c.1920x1080.jpg?t=1600430564,https://cdn.akamai.steamstatic.com/steam/apps/1398590/ss_fa69cd2ed8c95fbcc6f8d02a469faa66395ea3d2.1920x1080.jpg?t=1600430564,https://cdn.akamai.steamstatic.com/steam/apps/1398590/ss_4fbbf0c3fd23ad597977a9c6502cc7176c88d4c5.1920x1080.jpg?t=1600430564,https://cdn.akamai.steamstatic.com/steam/apps/1398590/ss_08522d99acae03d387f5400a15e23df0e8f5dde1.1920x1080.jpg?t=1600430564,https://cdn.akamai.steamstatic.com/steam/apps/1398590/ss_ce538a95512402bd5ca04788d7ce79bff60638b9.1920x1080.jpg?t=1600430564",
    "Slug": "1001-jigsaw-world-tour-asia",
    "Meta Title": "1001 Jigsaw World Tour Asia: Sep 18, 2020, Creobit and Fu...",
    "Meta Description": "Looking for information on 1001 Jigsaw World Tour Asia? Check out the release date (Sep 18, 2020), developer insights from Creobit, and a complete game ...",
    "Alt Text Image": "Official header image for 1001 Jigsaw World Tour Asia game - Steam 1398590",
    "Canonical URL": "https://gusku.site/game/1001-jigsaw-world-tour-asia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"1001 Jigsaw World Tour Asia\", \"description\": \"Looking for information on 1001 Jigsaw World Tour Asia? Check out the release date (Sep 18, 2020), developer insights from Creobit, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Creobit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8floor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1398590/header.jpg?t=1600430564\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}