{
    "AppID": 344890,
    "Name": "A.R.M. PLANETARY PROSPECTORS EP1 Asteroid Resource Mining",
    "Release date": "Oct 1, 2015",
    "About the game": "3012 A.D EARTH, 10 YEARS after the comet hit our home Terra Firma, (Earth) is on life support after an iron-based comet cut straight through like a bullet, destroying more than 70% of life on the planet... Prospectors on an expedition, investigate a strange signal coming from inside a hollowed-out asteroid, stumble upon a glowing ancient alien artifact. After touching the artifact, the team is suddenly teleported to another dimension... Separated and suffering from amnesia the crew is split up, then captured &amp; enslaved aboard a malevolent AI-controlled mining barge. Enslaved and forced against their wills to mine asteroids in a mech suit, all while, collecting and crafting, while devising a plan to escape to freedom! SPOILER ALERT Flashbacks and dreams of the once vibrant Earth, and glimpse back of the advanced old Gaia, showing ancestors, a young girl piloting a mech suit carrying her wounded grandfather up a mountain...she seems almost like my Sister, that I haven't seen since being thrown into this jail cell, just after touching the alien artifact that pulled me into some kind of time dimensional portal, or alternative multiverse of hell...I must find a way out of the prison, I may have to work off my debt as a slave asteroid miner, and try to make some friends find some answers about this place...There must be a way out, and then I need to find that Alien Artifact and try to return it back home. Once escaping from the Barge, the quest to recover the alien artifact, a time dimensional device, can turn back the time to help her Grandfather use the alien artifact to deflect the comet from devastating Earth's destruction . Experience survival in an immersive sim as a space flight, asteroid mining prisoner, explore, mine and craft to find unique ways to escape from the Mining Barge that is under control of an advanced AI alien race. Explore a procedural generated open world with fully destructible environments governed by Newtonian physics in this space flight sim, psychological survival horror game. First-Person, Survival Psychological Horror, Adventure, Immersive Space Mining Flight Simulator with JRPG inspired elements + Episodic content including rescue, repair, racing, and archaeological missions (EP1 currently in Early Access) + Character-driven, Singleplayer story-focused for Episode one (Multiplayer coming in future episodes) + Psychological Survival Horror mixed with Anime-style Quest and RPG elements + Explore, Expedition, Prospect, Mine, Rescue, Repair, Survey, Salvage, Scavenge, Survive + Outwit or fight Pirates, various aliens, rival asteroid miners, and Overlords + Procedural Generated near infinite 'Open World Multiverse' (Player is reborn, as the consciousness has been trapped and now controlled by the AI) + Expansive, and growing organic procedurally generated, fully destructible environments (Ever-expanding with future updates and episodes) + Fully Destructible Environments, mine asteroids and collect minerals to trade or have crafted + Trade with merchant ships, while avoiding hostile raiders and rival mining corporations + Find tools and have them crafted in order to escape the prison + Component and Systems damage, oxygen, water, fuel are only some of the systems set in play for survival in an immersive simulation + Science-based GeoPhysics inspired by Thermodynamics and Aeronautics, Simulated Newtonian Physics based on Real factual science simulations + VR Oculus Rift and HOTAS/Gamepad Support (Vive HMD support coming soon) + Community driven receives points and rewards for finding bugs and coming up with new ideas Can you be clever and find a way to escape the prison of being a slave space miner? Escape, find freedom and independence, then build a mining fleet and become the wealthiest Space Mining Jockey in the Universe! Live the life of an ordinary Deep Space Asteroid Miner, that wakes up every day enslaved to mine asteroids for precious resources and minerals while being under surveillance and supervision of an advanced alien A.I.-controlled mega-mining corporation A.R.M. All while the Andromeda Galaxy is doomed to collide with the Milky Way, is all hope lost. Is there no way to stop it? Can some unlike heroes from different species set aside their differences and utilize each other strengths to endure fate, adapt, and overcome destiny. Find a way to escape the mining prison barge, and save your Family! Experience hands-on futuristic sci space mining simulation in gameplay-focused, and character-driven first-person VR and non-VR immersion, in an episodic universe centered around unlikely heroes from very different origins. Play the role of a vulnerable space miner trapped as a prisoner aboard a mining barge converted into a prison for asteroid miners. Wake up, Mine, explore, then use your wits and skills to find a way to escape the barge and find the family. Work as an enslaved wrongfully captive Asteroid Miner, pay off your debt, or find other clever means to escape the malevolent AI overlords, orbiting Earth Episode One EARLY ACCESS (nDiG crew vows to continue to support Planetary Prospectors for years to come) Still EARLY ACCESS our graphics and gameplay are subject to change. We reward our Community for making suggestions and finding bugs. We are an indie team, some only working part-time until we receive more funding from our upcoming Kickstarter. nDiG promises to not give up on this series and continue to build for years to come, even if development is slowed down and have to source work from the community that we love to listen to and work with. Your support is greatly appreciated and it will keep ARM in EarlyAccess until it is ready to LAUNCH! Expected Episode ONE for Fall 2022. Come join the Community and make a difference and real impact! If you are having any difficulties OR suggestions with the game, PLEASE reach out, and report it to us first before putting negative comments. We only have a few reviews, and every review counts, and we are investigating fixes to hopefully change any negative reviews. We want to work with you and make ARM a memorable and amazing game that players will appreciate for generations to come. ARM PLANETARY PROSPECTORS EP1 is still EARLY ACCESS and subject to change, we are utilizing this time to make improvements and iterations to the design, art, story, tech, and performance. Once the pilot episode 1 is completed to quality, we will continue with the future episodic content. This game is not abandoned or vaporware, we are a small indie, some of us with other full-time jobs in the game and other industries. PLEASE have PATIENCE and we THANK YOU for your SUPPORT. We have some big announcements coming up with our breakthrough in improving the voxel destruction tech",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/344890/header.jpg?t=1620188196",
    "Price": 9.99,
    "Developers": "Nefarious Dimensions Interactive Games,NDiG",
    "Publishers": "Nefarious Dimensions Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_17a89534ecfee3ac480388a86df1c0ec35d88306.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_32ff95e40e70f0a7e45d7929dfa584d067f1700a.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_c38604ae0dd610285044808cc208a8338cb658d2.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_4ee0cbfa905826960cf53a68b7407053121cc700.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_2e3e0438a227e218b5ef4ad0c7e2c0f7bbc07e0d.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_c828699a82e1edac18996d036d3b3b1cde8c4c75.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_215a57187c5389f8913ff515dc3f067dbc362742.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_5fa9d8eaf7a962e151af9b6bb6e718a05888c794.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_3d79647b28e0c5f04b66ae8f2171bf77b314d4ab.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_bb3f69d0d6d8d5505fcc572c5c44b52d67aa5b37.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_ca90bfc1ebbe0957edcc3e3890cf7aa96ad65068.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_820fd1e13e12913342db52c74e4ca2a9efac7d68.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_5cf7b0a8df050b2afde1a69128ac1189ed9d6d5d.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_0d0df8af44ea5cdd07cd464728cacfec43ff5432.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_05de8c8853844b5c431eebbe21a0d20dd9ca2140.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_ac13b35fffd32d1774340d74c4209c690150f2dc.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_847d4563db3b3a4073f92eec6337ffdcb249c8f5.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_146e19e6e3ed6b333a4285ac03c501963e0cf467.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_36fe5c9b8284a820c558dd0d1162e9787c3643ac.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_d2d1799d7a80cf9856ab930ebc8e2f7f3a6a64de.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_ac13b35fffd32d1774340d74c4209c690150f2dc.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_738ab7602dda69b07bc099751004e178d0759311.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_65ce1d3ac4e2c9ca84e617f62dba3172a6fb0a66.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_09f901d8dd80b993edb4a99746ab866db212130d.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_133d20d8e0684bd94f9f44403f23d19b4b4b3519.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_11f8b6effda5a3ada7c1bc802468541c4a2a5f6c.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_3ca6267a58a62d46fa57562fa66fdf7c2f5eaedd.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_6b463ca122b7380789e3b4a822c840aedf26b211.1920x1080.jpg?t=1620188196,https://cdn.akamai.steamstatic.com/steam/apps/344890/ss_41c795856a3b72492481b556ca6f2885990ce843.1920x1080.jpg?t=1620188196",
    "Slug": "a-r-m-planetary-prospectors-ep1-asteroid-resource-mining",
    "Meta Title": "A.R.M. PLANETARY PROSPECTORS EP1 Asteroid Resource Mining...",
    "Meta Description": "Looking for information on A.R.M. PLANETARY PROSPECTORS EP1 Asteroid Resource Mining? Check out the release date (Oct 1, 2015), developer insights from ...",
    "Alt Text Image": "Official header image for A.R.M. PLANETARY PROSPECTORS EP1 Asteroid Resource Mining game - Steam 344890",
    "Canonical URL": "https://gusku.site/game/a-r-m-planetary-prospectors-ep1-asteroid-resource-mining",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"A.R.M. PLANETARY PROSPECTORS EP1 Asteroid Resource Mining\", \"description\": \"Looking for information on A.R.M. PLANETARY PROSPECTORS EP1 Asteroid Resource Mining? Check out the release date (Oct 1, 2015), developer insights from ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 1, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nefarious Dimensions Interactive Games,NDiG\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nefarious Dimensions Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/344890/header.jpg?t=1620188196\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}