{
    "AppID": 943710,
    "Name": "Arauco Saga - Rpg Action",
    "Release date": "Nov 1, 2019",
    "About the game": "Arauco Saga is an action RPG, inspired by 2D classics for snes and megadrive. Arauco Saga mixes the best elements of the action. The story is based on the Loyola comic (4 issues, limited series), written by Marcelo Tapia. Long time ago, the mythical serpents Tren – Tren and Cai-Cai created the Southern Lands. The Araucanos lived there peacefully for years, under the protection of the Pillanes. This harmony was broken by northern invaders who wanted to extend their territory and civilization. They used their beliefs and weapons to race and burn the land. The equilibrium between worlds was lost, so did the power of the Pillanes. They decided to shut themselves away to Sacred Lands and created eight Tokens to close the gates to the Magic Lands. The pact between the Araucanos y the Pillanes was sealed. The Araucanos chose to Caupolicano as their lonco to lead them against the invaders. But first Caupolicano needed to show his strength: he had to defeat Cai-Cai’s daughter. The battle was fierce. Caupolicano was defeated and sent into an ice prison. After being 10 years in a cold and dark cave, Caupolicano was made a slave by El ChonChon, a powerful wizard who defeated Cai-Cai´s daughter. Tired of being made a tool and an assassin by El ChonChon, Caupolicano tried to kill his captor and break free, but the wizard was a step ahead and sent Caupolicano to prison again. Two hundred years have passed. Caupolicano continues punching his ice jail, the Sacred Gates are still closed and the Tokens are forgotten. But the wizard has made a plan for being the absolute master of these lands and offer to Caupolicano a last deal. If he accomplishes the mission, he will be free. He needs to go back 200 years and find the Seven Sacred Tokens. Combat Action is the main objective in this mode. There are menus to select weapons, potions and objects ... and also battles with brutal creatures! Weapons There are 6 different weapons and they are designed according to the actual weapons used by the Mapuche warriors and also mythological weapons and transformations to beasts. Exploration There are vast lands to explore, people of different races and also fortresses and temples located in forests, deserts, magical lands and eternal glaciers. There are two large islands to explore without loading times. Enemies There is a great variety of enemies equipped with powerful weapons: minions, soldiers, armored skeletons and mythological creatures and giant bosses.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/943710/header.jpg?t=1596830937",
    "Price": 17.99,
    "Developers": "Ánimas Games",
    "Publishers": "Ánimas Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/943710/ss_e15284cca629b7084f8fbfd35fe1e1458d3b9455.1920x1080.jpg?t=1596830937,https://cdn.akamai.steamstatic.com/steam/apps/943710/ss_c40e5153b8b4d36a14fe062d1ed0f0a02d1b09a7.1920x1080.jpg?t=1596830937,https://cdn.akamai.steamstatic.com/steam/apps/943710/ss_4f99c5cf82b8269cef988e2acd143fec54be0929.1920x1080.jpg?t=1596830937,https://cdn.akamai.steamstatic.com/steam/apps/943710/ss_635b8c1c68fc4e2b69ca3a9e05cc7c073abc1ae2.1920x1080.jpg?t=1596830937,https://cdn.akamai.steamstatic.com/steam/apps/943710/ss_dd7febc807cfdd5869431da2e7849c3786296028.1920x1080.jpg?t=1596830937,https://cdn.akamai.steamstatic.com/steam/apps/943710/ss_0e87b1e7f785858229c2bafe719d060f736ddf59.1920x1080.jpg?t=1596830937",
    "Slug": "arauco-saga-rpg-action",
    "Meta Title": "Arauco Saga - Rpg Action: Nov 1, 2019, Ánimas Games and F...",
    "Meta Description": "Looking for information on Arauco Saga - Rpg Action? Check out the release date (Nov 1, 2019), developer insights from Ánimas Games, and a complete game...",
    "Alt Text Image": "Official header image for Arauco Saga - Rpg Action game - Steam 943710",
    "Canonical URL": "https://gusku.site/game/arauco-saga-rpg-action",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Arauco Saga - Rpg Action\", \"description\": \"Looking for information on Arauco Saga - Rpg Action? Check out the release date (Nov 1, 2019), developer insights from \\u00c1nimas Games, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u00c1nimas Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u00c1nimas Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/943710/header.jpg?t=1596830937\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}