{
    "AppID": 701280,
    "Name": "Askutron Quiz Show",
    "Release date": "Nov 12, 2017",
    "About the game": "Askutron Quiz Show is a trivia game for up to 8 players that can be played with keyboard and mouse, gamepads or mobile devices. It features fully voiced questions both for official and user-generated questions. 10,000+ official questions fully voiced in English and German (more to come) Official questions contain 21 categories such as movies, entertainment, science and nature Even user-generated questions are read out aloud in up to 18 languages Workshop integration allows creating your own quizzes and playing those of other players Local and Online Multiplayer: Support for up to 8 gamepads and/or mobile devices (iOS, Android) Optional asynchronous online multiplayer ('Quizatars') Single-player mode that lets you play against a bot trained by all Askutron players 3D graphics; players can choose between various avatars and buzzer sounds Party game bringing together 8 players locally or online* (*: online mode is still experimental) Steam Cloud support for synchronizing your profiles and custom quizzes Play on Windows, Mac and Linux / SteamOS Play with your friends using gamepads and mobile devices Askutron Quiz can be played locally with 8 players on one (preferably big) screen. It supports not only most gamepads with Xbox-compatible layouts, but also the original 'Buzz!' Playstation 2/3 controllers (Windows/Mac). Don't have 8 gamepads lying around? No problem, just scan the lobby QR code with your phone and play using the Askutron Buzzer app! Your friends are not in the same room right now? Don't worry, just invite them via Steam or use the online* match making to find other players! (*: Online mode is still experimental) Asynchronous Online Multiplayer (Quizatars) Play against your friends even when they are not online! The game remembers every given answer and allows you to play against your friends' 'Quizatars' who will answer exactly like they would. Or Play Alone: You Against the Community If you'd rather play alone we got you, too! Play against the latest 'Communi-tron', an advanced AI that uses sophisticated machine learning algorithms and is trained on input vectors of all Askutron players (Or in layman's terms: The bot picks the answers that on average have been picked most often by players). Find out if you are above the average! Various Quiz Modes Currently the game has five selectable quiz modes that can be mixed freely and will be extended in the future. Point Hunt - Speed is not important, just select the right answer within 25 seconds to get the points Blitz Quiz - The faster you answer, the more points you get Cut the Cake - Players are divided into two team and the first answers decides for the team while answers are only gradually revealed Viewpoints - Players first answer a opinion question and then have to guess the most popular answer Finale - In the finale players get a podium position based on their total score, then every wrong answer can cost you a rank! Create and share your own quizzes, or play quizzes uploaded by other players Using the included quiz editor you can create your quiz in any of the supported 18 languages (see below)! Using Steam Workshop you can upload your own quizzes for other players and download quizzes created by other players. Supports up to 18 languages While the game's UI is not (yet) translated to all languages and our official question packs only cover English and German right now, the game can display and read out aloud custom quizzes created by users in any of these supported languages: Danish Dutch French Icelandic Italian Japanese Norwegian Polish Portugese Romanian Russian Spanish Swedish Turkish Welsh",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/701280/header.jpg?t=1524071815",
    "Price": 14.99,
    "Developers": "Goldsaucer Ltd",
    "Publishers": "Goldsaucer Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/701280/ss_b4dbdda609ace384d711b4ce257ffd357b73e5a6.1920x1080.jpg?t=1524071815,https://cdn.akamai.steamstatic.com/steam/apps/701280/ss_8c3f2b93bea54c719112538695a79616d0ef5b5c.1920x1080.jpg?t=1524071815,https://cdn.akamai.steamstatic.com/steam/apps/701280/ss_01582feae298f5fcc1f989a81c35341b3acb887e.1920x1080.jpg?t=1524071815,https://cdn.akamai.steamstatic.com/steam/apps/701280/ss_dd17ca467a61d3871ce72aa7b09cad901f2f5b10.1920x1080.jpg?t=1524071815,https://cdn.akamai.steamstatic.com/steam/apps/701280/ss_cca35af493ca46ae9243e2606c2a699f3f3a1d5c.1920x1080.jpg?t=1524071815,https://cdn.akamai.steamstatic.com/steam/apps/701280/ss_eb213b509e9661d8275fae67762967b039097d28.1920x1080.jpg?t=1524071815,https://cdn.akamai.steamstatic.com/steam/apps/701280/ss_1c6fd7defae133939258f430e9ed1d8a38e59406.1920x1080.jpg?t=1524071815,https://cdn.akamai.steamstatic.com/steam/apps/701280/ss_13acd6e795ebf7c773bce324cb215eeae8115787.1920x1080.jpg?t=1524071815,https://cdn.akamai.steamstatic.com/steam/apps/701280/ss_8ebb2a188704816b5c1150ff2f7deb735924f2e5.1920x1080.jpg?t=1524071815,https://cdn.akamai.steamstatic.com/steam/apps/701280/ss_b937299dd5d8a389aafde91e4453df425e482b84.1920x1080.jpg?t=1524071815,https://cdn.akamai.steamstatic.com/steam/apps/701280/ss_dce90deb209a50b98f81aba79083dd3ade976bbd.1920x1080.jpg?t=1524071815,https://cdn.akamai.steamstatic.com/steam/apps/701280/ss_93f918bd7d356bbdfd8350e7db40c18aafc53fcc.1920x1080.jpg?t=1524071815",
    "Slug": "askutron-quiz-show",
    "Meta Title": "Askutron Quiz Show: Nov 12, 2017, Goldsaucer Ltd and Full...",
    "Meta Description": "Looking for information on Askutron Quiz Show? Check out the release date (Nov 12, 2017), developer insights from Goldsaucer Ltd, and a complete game su...",
    "Alt Text Image": "Official header image for Askutron Quiz Show game - Steam 701280",
    "Canonical URL": "https://gusku.site/game/askutron-quiz-show",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Askutron Quiz Show\", \"description\": \"Looking for information on Askutron Quiz Show? Check out the release date (Nov 12, 2017), developer insights from Goldsaucer Ltd, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 12, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Goldsaucer Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Goldsaucer Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/701280/header.jpg?t=1524071815\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}