{
    "AppID": 943590,
    "Name": "BlitzKeep Unleashed",
    "Release date": "Oct 14, 2018",
    "About the game": "BlitzKeep Unleashed , the sequel to BlitzKeep, where billiards meets a roguelite RPG! Or maybe where pinball meets an RPG? Something like that! Point your hero where you want him to attack, and he won't stop moving until he's reached a safe zone or has died! The latter happens far too often... Pick up gear to increase your power, and kill weak enemies first so that you can level up enough to kill the stronger ones. Eventually, you may even become strong enough to kill a massive boss! Don't be disheartened by frequent deaths - it takes only moments to try again! You can also play with your friends cooperatively. Up to 16 can play at once on the same screen! Unlockables galore! As you traverse The Island, you’ll pick up coins, which you can use to buy permanent unlocks and upgrades, including: 15+ unique classes, all with different strengths and weaknesses 6 permanent ability upgrades to make future runs easier 5 unlockable and upgradeable spell scrolls to destroy your enemies The Story Long ago, The Island was home to ten prospering noble houses, each controlling their own Fiefdom and living in harmony. The Fiefs were divided into two Realms, separated by a great chasm. Those who were in the South Realm were known for their battle prowess and powerful warriors, whereas those from the North Realm practiced the arcane arts to get things done. The two realms were connected by the Askar Bridge, a large highway that kept goods, services, and ideas flowing between the two Realms. Then calamity struck. A disagreement between the North and South caused the champion of the North, the Blitz Mage, to attack the South. The South had its own champion: the Old Codger, who bravely fought back. Although the South put up a valiant fight, all was lost when the Blitz Mage seized control of all 10 pieces of The Conductrex – a powerful magical artifact. This gave the Blitz Mage enough power to cast a giant pall of darkness across all the land, transforming all the people into mindless monsters and dooming the island forever. The Old Codger battled on, and managed to fight his way to the Blitz Mage despite the droves of monsters along the way. He reached his enemy and the two fought – but the Blitz Mage won. Gravely wounded, the Old Codger still managed to break apart the Conductrex once again, spreading its pieces across The Island. It was all he could do before he dragged himself to a ship and fled the island... It was there, on the ship, that he managed to sire a line of heroes, from which you, your siblings, and your cousins are born. The Old Codger's spirit remains tied to the ship, giving you advice and training you on how to fight. It's finally time to take your family back to The Island, and defeat The Blitz Mage! You will travel through 10 Fiefdoms on your way to The Blitz Mage. Each Fief has multiple levels, each with a miniboss, and finally a Lord that has been transformed into the most horrible of creatures – a huge boss monster. Defeat the boss to take his piece of the Conductrex and move on to the next land. There are 10 Fiefdoms to defeat: Puddland – Home of the Crustacean Commander Archeologia – Domain of the Granite Gurkhan Spookane – Realm of the Ectoplasmic Emperor Amphibia – Land of the Toadlike Tsar Impopolis – Kingdom of the Malicious Maharaja The Abyss – A cursed level that never ends... until you die! Askar Bridge – Pass of the Owlish Overlord Verdantopia – Garden of the Demonic Duke Mausolia – Crypt of the Skeletal Sovereign The Blitz Keep – Palace of the Blitz Mage Praise for the original BlitzKeep “BlitzKeep combines pinball with a dastardly RPG.” - Pocket Gamer “The visuals in the game look gorgeous.” - It’s New “My favorite new game release this week.” - App Advice “I love the freshness of the idea.” - Modern Jamming “Game of the week.” - Macgasm",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/943590/header.jpg?t=1539586276",
    "Price": 8.99,
    "Developers": "Flint Games",
    "Publishers": "Flint Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/943590/ss_941015670f6f69d26dc874ae41385001a9eff458.1920x1080.jpg?t=1539586276,https://cdn.akamai.steamstatic.com/steam/apps/943590/ss_b0e948c4470274b8aede7b332fcc7476f49912e9.1920x1080.jpg?t=1539586276,https://cdn.akamai.steamstatic.com/steam/apps/943590/ss_28379683a4bfd4491c1020b4c26081b0f1174e7d.1920x1080.jpg?t=1539586276,https://cdn.akamai.steamstatic.com/steam/apps/943590/ss_d49e2998aaa3b4141424e6f177d4810432a5b5e4.1920x1080.jpg?t=1539586276,https://cdn.akamai.steamstatic.com/steam/apps/943590/ss_9507e8c9d56a3aa0e2698e747ca1af70936b98d4.1920x1080.jpg?t=1539586276,https://cdn.akamai.steamstatic.com/steam/apps/943590/ss_92435ef92f98d8228c9d31beae86e330b703b263.1920x1080.jpg?t=1539586276,https://cdn.akamai.steamstatic.com/steam/apps/943590/ss_2b0b1f398c95ca3f4f6c6d13693bc4914988aa9e.1920x1080.jpg?t=1539586276,https://cdn.akamai.steamstatic.com/steam/apps/943590/ss_54ab852c75dfb7339f94908fafd6f26d145fcf9d.1920x1080.jpg?t=1539586276,https://cdn.akamai.steamstatic.com/steam/apps/943590/ss_b6d78fb28e647f7ffade2598be5c359648ae5295.1920x1080.jpg?t=1539586276",
    "Slug": "blitzkeep-unleashed",
    "Meta Title": "BlitzKeep Unleashed: Oct 14, 2018, Flint Games and Full O...",
    "Meta Description": "Looking for information on BlitzKeep Unleashed? Check out the release date (Oct 14, 2018), developer insights from Flint Games, and a complete game summ...",
    "Alt Text Image": "Official header image for BlitzKeep Unleashed game - Steam 943590",
    "Canonical URL": "https://gusku.site/game/blitzkeep-unleashed",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BlitzKeep Unleashed\", \"description\": \"Looking for information on BlitzKeep Unleashed? Check out the release date (Oct 14, 2018), developer insights from Flint Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 14, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Flint Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Flint Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/943590/header.jpg?t=1539586276\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}