{
    "AppID": 489260,
    "Name": "Brut@l",
    "Release date": "Feb 9, 2017",
    "About the game": "Brut@l is a modern re-imagining of the classic ASCII dungeon crawler, fusing old-school gaming with a stunning 3D visual style to create an adventure that's totally unique! Choose your hero – Ranger, Mage, Warrior or Amazon – and descend into a procedurally generated world constructed entirely from ASCII. Your goal? Reach the 26th floor, vanquish the fearsome Guardian of the Dungeon and claim his crown. Sound easy? It won’t be. It'll be... Brut@l. How long will you survive as you battle against Trolls, Orcs, Rockmonsters, Lycanthorpes and the many other dangerous monsters found lurking in the Brut@l dungeon? Each enemy type has its own attack style and weakness which you can discover by unlocking hidden pages in your adventurer’s Field Guide. It’s not just the individual monsters alone that make Brut@l challenging though – the combination and groupings of monsters, called Squads, make the game interesting, challenging and satisfying to defeat. Take the Minotaur, for example: the formidable part man/part bull monster uses his ferocious charge attack to inflict seriously heavy damage. Fortunately, this dim-witted beast’s attack can be easily dodged by the skilled adventurer. However, add in some Frozen Skeleton Archers – a fast-firing, ranged enemy whose arrows can freeze you in place – and suddenly you find yourself rooted to the spot with an angry minotaur bearing down on you. The deeper you progress into the dungeon, the more challenging the squads that confront you will become... Every hero starts the Brut@l dungeon in the same way: armed only with an unlit torch, a battle-worn shield and their bare fists. In order to survive and progress, adventurers will need to learn the skills and find the raw materials to craft and enchant weapons, brew potions and forge magical talismans to aid them on their dangerous journey from Floor 1 down to Floor 26. Weapon Crafting No matter how heroic they are, every adventurer will require a deadly weapon to survive the depths of Brut@l. Thankfully, weapons can be crafted by finding and combining a Weapon Codex - basically a blueprint or recipe – and combining it with the required raw materials (ASCII letters). There are five weapon types in Brut@l: short-swords, long-swords, spears, hammers and bows. Each weapon type has a unique special move that can be used to turn the tide in combat, be it the ground pound from the Skullcrusher Warhammer that deals AOE damage and applies a knockback, or the charge and thrust of the Goblin Pike that allows adventurers to engage enemies quickly from a longer range. Weapon Enchanting Weapons are great but for the discerning adventurer on an epic quest, sometimes a deadly blade, bow, hammer or spear isn't always enough. Each weapon in Brut@l has a key ASCII letter that, when replaced with an enchanted letter, can bestow a special ability to that weapon. Engulf your enemy in flames, freeze them in place, poison them, electrocute them or even to transform their monster form! Use fire-enchanted letters to craft the Flaming Thunderstrike bow which allows you to set enemies alight from a distance, or apply the mysterious arcane letters to your sword to give you a random chance of transforming your enemy into something smaller and weaker. Be careful though: arcane magic is fickle and sometimes you’ll find your foe transformed into something bigger and more deadly! Potion Brewing Potion ingredients are scattered throughout the dungeon, and adventurers can combine these ingredients to brew useful potions to aid themselves, or hinder an enemy! Be careful however, the effects of these potent potions are unknown until consumed or thrown at an enemy. Suffice to say, drinking a Potion of Inferno isn't recommended; neither is throwing a Potion of Rage at an already angry Orc! Oh! Did we mention that Brut@l randomizes every potion’s color, effect and recipe on every new play through so you’re never sure which potion does what exactly? No? Well… surprise! Talisman Forging Talismans are powerful magical relics found deep within the dungeon – wearing these items can bestow special abilities upon an adventurer. For example, the Gift of Farsight which reveals the entire map or the Rune of Methuselah that grants a healthy bonus to experience points gained. Evoke the nostalgia of all night gaming sessions from years past! Share the adventure by exploring Brut@l’s dungeon with a friend in local co-op and lay waste to the hordes of enemies that stand between you and floor 26. Be careful though… if your friend dies, you’ll need to make it to the next floor alone and revive them later on! Even once you've successfully beaten Brut@l, things don't stop there – you can dive into Brut@l’s Level Editor, an intuitive editing tool that lets you build, play, share and even die in your very own dungeon. Start with a blank canvas or adapt a procedurally generated level with your own flair! Place weapons, furniture, loot, traps and monsters and then share your dungeon with your friends and the world. Get creative! Some of the best levels we’ve seen internally range from traditional dungeon crawling levels and platformers all the way to wave survival! Show us what you can do! What others have said about Brut@l so far: “Gorgeous in motion… fluid movement and combat… utterly m@gic” – Official Playstation Magazine “Brutal is a game with damn cool graphics” – Kotaku “A cybergorgeous ASCII rogue-like come to life' – VentureBeat “Gorgeous retro aesthetic” – Game Informer “This is one indie title that we sure have our eyes on...” – Push Square",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/489260/header.jpg?t=1587728001",
    "Price": 14.99,
    "Developers": "Stormcloud Games",
    "Publishers": "Rising Star Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/489260/ss_57c80e81a3d268111bde42ef33825a2f356de97c.1920x1080.jpg?t=1587728001,https://cdn.akamai.steamstatic.com/steam/apps/489260/ss_27bf14e00546cf8ef869d271212e7c6a48f488da.1920x1080.jpg?t=1587728001,https://cdn.akamai.steamstatic.com/steam/apps/489260/ss_f422bad4dc5e7338212723071ceb027ad7229aa8.1920x1080.jpg?t=1587728001,https://cdn.akamai.steamstatic.com/steam/apps/489260/ss_7978e299a145bf9f803c9d7c30860a2b920b7f94.1920x1080.jpg?t=1587728001,https://cdn.akamai.steamstatic.com/steam/apps/489260/ss_8a6197952f6510b9e6cb9e045ed2238e8f9617f8.1920x1080.jpg?t=1587728001,https://cdn.akamai.steamstatic.com/steam/apps/489260/ss_ba7f825d91d1faa90bad532b56bfd2332c20aba3.1920x1080.jpg?t=1587728001",
    "Slug": "brut-l",
    "Meta Title": "Brut@l: Feb 9, 2017, Stormcloud Games and Full Overview",
    "Meta Description": "Looking for information on Brut@l? Check out the release date (Feb 9, 2017), developer insights from Stormcloud Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Brut@l game - Steam 489260",
    "Canonical URL": "https://gusku.site/game/brut-l",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Brut@l\", \"description\": \"Looking for information on Brut@l? Check out the release date (Feb 9, 2017), developer insights from Stormcloud Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 9, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Stormcloud Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rising Star Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/489260/header.jpg?t=1587728001\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}