{
    "AppID": 985930,
    "Name": "::CallBack",
    "Release date": "Oct 4, 2019",
    "About the game": "Welcome to the arena! Take control of a boosted ship and throw the projectiles at high speed to your opponents in this competitive local arcade party-game! NOW with Remote Play Together, play ::CallBack Online with your friends ! ::CallBack is inspired on the tables of Air-Hockey ( a classic game in the arcade rooms where you need to send disks to the opponent goal), where the objective is to crush your opponents' avatar! Move around and use your boosts to reach or avoid the projectiles, master the art of rebounds and trajectory for reaching your target. With a variety of arenas and settings it is up to YOU to choose the kind of game that you'll play from 2 to 4 players. Create challenge according to your style, whether if its competitive or casual, thanks to our personalised settings! Easy to play, hard to master ::CallBack can be learnt easily in a few moments and it can adapt to the player needs : you can choose to set up the target in the same stick as the movement command or you can have it on the second stick for a more technical approach. Training is key for mastering the subtilities of ::CallBack : whether its the rebounds, movement, dash management (boosts) or the terrain...even the specifics of each arena! Only perseverance will take you to glory in the Arena! Some of the actual characteristics in-game: Move and Aim with two sticks or only one with the Manual or Automatic control modes. Propel projectiles with your impulsion while aiming. Dash to avoid attacks or make your own attacks more powerful. Use your impulsion without aiming to shield-block projectiles. Your support will help us to push the game even further! Our main ambition is to offer ::CallBack and its intense local experience to reach as many people as possible worldwide. The more the community grows, the more the game will have the opportunity to reach other platforms for supporting the Party-Game spirit of the game. So don't hesitate! Let us discuss in the Steam forums and the official Discord server, so we can make ::CallBack a game that will make your gaming nights more salty ! Thank you for your support, it's thanks to the community and their many players that we were able to get this far! Let us keep it like this! ::CallBack team: Gregory Chicoine - Management, Game &amp; Level Design Germain Lefebvre - UX Design, Game Design Cléa Renard - Latest 2D &amp; 3D Art Dánae Alba González - Initial 2D Art Quentin Richard - Gameplay Programming Rémi Fusade - AI Programming Jérémie Guigue-Rodet - Musical Composition Lucie Desurvire - Communication manager Special thanks to : Théo Ziakovic - Support in Programming and Game Design on the early prototypes Pierre Coursimault - Support in Programming Gameplay on the first version of ::CallBack Valentin 'Pepito' Bourmault - Trailer realisation And of course Tiasu for his awesome musics ! You can listen to his work here on his Bandcamp The trailer music is Delusion You can join our social medias with @CallBackGame Discord server code : uQdMszD",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/985930/header.jpg?t=1580825660",
    "Price": 4.99,
    "Developers": "Water Temple Studio",
    "Publishers": "Water Temple Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/985930/ss_ac96e1487b45b979de7ef8a0e7e48a5d8fd81bc0.1920x1080.jpg?t=1580825660,https://cdn.akamai.steamstatic.com/steam/apps/985930/ss_ba629022335136e51622c62f1f6dafde50241437.1920x1080.jpg?t=1580825660,https://cdn.akamai.steamstatic.com/steam/apps/985930/ss_57a8ea8de837c841e4e1969cdd6c0ce3339240b6.1920x1080.jpg?t=1580825660,https://cdn.akamai.steamstatic.com/steam/apps/985930/ss_ec04ba5c28419badf3cdd16bc8c4b2056edb56e0.1920x1080.jpg?t=1580825660,https://cdn.akamai.steamstatic.com/steam/apps/985930/ss_0e950f2f917a97d065cdce8dfc77ea01239690c0.1920x1080.jpg?t=1580825660,https://cdn.akamai.steamstatic.com/steam/apps/985930/ss_80f83b90a0e4d6d323f3fdb3e4732c7bb7e62217.1920x1080.jpg?t=1580825660,https://cdn.akamai.steamstatic.com/steam/apps/985930/ss_6aafdc6ea7cbfba19e3b7327c5b45c2fc478d0ef.1920x1080.jpg?t=1580825660",
    "Slug": "callback",
    "Meta Title": "::CallBack: Oct 4, 2019, Water Temple Studio and Full Ove...",
    "Meta Description": "Looking for information on ::CallBack? Check out the release date (Oct 4, 2019), developer insights from Water Temple Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for ::CallBack game - Steam 985930",
    "Canonical URL": "https://gusku.site/game/callback",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"::CallBack\", \"description\": \"Looking for information on ::CallBack? Check out the release date (Oct 4, 2019), developer insights from Water Temple Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Water Temple Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Water Temple Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/985930/header.jpg?t=1580825660\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}