{
    "AppID": 1803700,
    "Name": "Castle in the Sky - Clash of Sky Palace",
    "Release date": "Nov 19, 2021",
    "About the game": "-3QjA The sky city on the earth will fall with a loud noise, and it will appear like a blue star... What do you think about The Hopi, Abhigya Anand, Michel de Nostredame, Dato Anthony Cheng, Baba Vanga and Jeane Dixon? Are you interested in their predictions about the future? Do you want to know the trend of the world? When people act with good deeds, heaven responds with blessings When people commit evil crime, heaven responds with unstoppable disasters If we act against the good and do bad things, bad omens will come from the sky, and the world will suffer from drought and rain, floods, mutiny and civil chaos, and war will begin. Therefore, the ancients attached great importance to the observation of celestial phenomena. You can piece together the hidden fragments of riddle from this graphic novel comic style game... Tales of Terra Ocean Long before the distant past, Earth was an organic whole without form and void. A divine goddess named Pan Gu separated Earth from Heaven to form Terrestrial continents. Once every sixty six thousand six hundred and sixty six year, a disastrous scourge would be brought upon this land. Floods, drought, famines, earthquakes and disease epidemics spread through out Earth. Four Sages walked across the continents and discovered the myth of contrary forces, which were interconnected and interdependent in the dynamic natural cycle. Relying on absorbing the spirits of sun, moon, fire, water, wind and earth, an animating force was formed within stones which could summon the catastrophic destruction brought upon land but also able to preserve the existence of mankind. Weapons were forged with spiritual gemstones, passed down through generations and were called 「Eternal Summoning Weapons of the Ancient」. As the plot progresses throughout this Visual Novel ARPG, readers will be able to browse inside an ordinary youngster’s extraordinary journey, retroactively entering the chronological time warp of paranormal summoning monsters, and witnessing a new era of fantasy stories. This is not a series of Hayao Miyazaki , not Studio Ghibli Animation's castle in the sky This is not Onepiece, not Naruto, not attack on titan, not demon slayer, not Dragon ball, not bleach, not fullmetal alchemist, not X-Men, not final fantasy, not sword and fairy, not chrono trigger, not resident evil, not Minecraft, not Zelda or Super Mario This is a story rich Indie game completely made by one person, this Visual Novel Manga style ARPG game guarantees an unprecedented scale in the classical Taiwanese literature. A literature of fantasy moniker Description: Castle in the Sky - Clash of Sky Palace is a hybrid game of Survival Platform ARPG &amp; Visual Novel inspired &amp; developed by Reed. Players will enter the virtual world to find themselves explored Sky Palace Island and must fight their ways to survive in an unknown land of enemies, to unravel the mythical story behind this flying island. key features: Survive, Strive, and Thrive the Quadra Martial Artist Life: Face aggressive troops while taking on unknown enemies on the flying island. Explore the flying Island: Sky palace An interesting story &amp; a hyper-manga style experience that keep you immersed in the fantasy world of Sky Palace island, a rich story is waiting to be discovered.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1803700/header.jpg?t=1638777640",
    "Price": 12.99,
    "Developers": "Reed",
    "Publishers": "CS Publish",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1803700/ss_6b04e8599fa33d9964b80826f8f69cb967ed30fb.1920x1080.jpg?t=1638777640,https://cdn.akamai.steamstatic.com/steam/apps/1803700/ss_1daab8964d5fcff7ab84ea305c656cb6eafc3f56.1920x1080.jpg?t=1638777640,https://cdn.akamai.steamstatic.com/steam/apps/1803700/ss_71bb95fddee631245ae61f8591f8c055dc613a7e.1920x1080.jpg?t=1638777640,https://cdn.akamai.steamstatic.com/steam/apps/1803700/ss_c28d27a95b58338ba67d37f4611db94761808af7.1920x1080.jpg?t=1638777640,https://cdn.akamai.steamstatic.com/steam/apps/1803700/ss_0c320eb5d1929668150580dbcec41109d3d14eae.1920x1080.jpg?t=1638777640",
    "Slug": "castle-in-the-sky-clash-of-sky-palace",
    "Meta Title": "Castle in the Sky - Clash of Sky Palace: Nov 19, 2021, Re...",
    "Meta Description": "Looking for information on Castle in the Sky - Clash of Sky Palace? Check out the release date (Nov 19, 2021), developer insights from Reed, and a compl...",
    "Alt Text Image": "Official header image for Castle in the Sky - Clash of Sky Palace game - Steam 1803700",
    "Canonical URL": "https://gusku.site/game/castle-in-the-sky-clash-of-sky-palace",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Castle in the Sky - Clash of Sky Palace\", \"description\": \"Looking for information on Castle in the Sky - Clash of Sky Palace? Check out the release date (Nov 19, 2021), developer insights from Reed, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Reed\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CS Publish\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1803700/header.jpg?t=1638777640\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}