{
    "AppID": 1593750,
    "Name": "Creatures of Aether",
    "Release date": "Aug 2, 2021",
    "About the game": "Creatures of Aether is a free to play card game created by Tako Boy Studios in collaboration with Dan Fornace and the Rivals of Aether team. Collect elemental creatures from around the world of Aether including powerful Rival cards from the indie fighting game, Rivals of Aether! Inspired by the card game, Triple Triad, Creatures of Aether blows the doors off the formula with its elemental gameplay. Once you learn the basics of flipping cards, you'll need to account for the four elements and powerful abilities to turn the board to your favor. Creatures of Aether features a ranked ladder with online cross-platform PvP matches. Matches are around 3 minutes long and matchmaking pits you against players with similar skills. Earn Medals to climb the ladder and reach the Master tier to earn yourself a free Rival card! Once you hit Master, the race is on to the top of the leaderboard, but be careful because you can also lose medals in the Master tier! Creatures of Aether features over 150 unique elemental cards each with their own set of numbers. The four numbers on the cards determine it's power in that direction. Place a card with a higher number facing a card on the board to flip it to be under your control! But where Creatures of Aether really shines is the card abilities! After you master the 15 unique card abilities, you'll be able to build a deck that can counter any strategy. Multiple deck types are viable at the top level and its up to you to decide what kind of deck you want to build! Creatures of Aether features a fun single player experience to obtain more cards known as Dungeons. These miniature roguelite experiences require Abyss Orbs to enter in exchange for fantastic rewards. Players are given a new dungeon deck and must improve their deck by defeating computer opponents in 3x3 and 4x4 board battles. Throughout the Dungeon, you'll encounter some awesome rewards including chests, boosters and even a safe that allows you to add a card from your Dungeon deck to your loot. At the end of the Dungeon, is the Dungeon Boss who has powerful cards from a single element. Beating the boss allows you to take a large stack of one of their cards! One of the most exciting features in Creatures of Aether are the Rival cards! These cards act like classes or heroes in other card games and give your deck its flair. You need to have a Rival card and can only have one in your deck. Your opponent can also see which Rival you are using. There are 16 Rivals in the game and each of them mix up your strategy. The cards are pulling from characters across the Aether Universe featuring favorites from both Rivals of Aether and the upcoming Dungeons of Aether. Creatures of Aether is the perfect card game if you are looking for deep and strategic gameplay with a short match time. There are always improvements you can make to your deck and strategies you can adjust in order to make sure the board ends in your favor!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1593750/header.jpg?t=1627916462",
    "Price": 0.0,
    "Developers": "Tako Boy Studios,Dan Fornace",
    "Publishers": "Dan Fornace",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1593750/ss_7443a45601c6709e544db0856b254c733d9775dc.1920x1080.jpg?t=1627916462,https://cdn.akamai.steamstatic.com/steam/apps/1593750/ss_acda1d5c5408e71344c9a40ce728f25a4a595f99.1920x1080.jpg?t=1627916462,https://cdn.akamai.steamstatic.com/steam/apps/1593750/ss_6dae8fa461c7c7a16291e3d272c9ae41e061ca06.1920x1080.jpg?t=1627916462,https://cdn.akamai.steamstatic.com/steam/apps/1593750/ss_38a4888801f5e1c18ea4bd7d8f069f18d491acf7.1920x1080.jpg?t=1627916462,https://cdn.akamai.steamstatic.com/steam/apps/1593750/ss_f7882bbd7b72b7e77c82e83926614c20a58b14d6.1920x1080.jpg?t=1627916462",
    "Slug": "creatures-of-aether",
    "Meta Title": "Creatures of Aether: Aug 2, 2021, Tako Boy Studios,Dan Fo...",
    "Meta Description": "Looking for information on Creatures of Aether? Check out the release date (Aug 2, 2021), developer insights from Tako Boy Studios,Dan Fornace, and a co...",
    "Alt Text Image": "Official header image for Creatures of Aether game - Steam 1593750",
    "Canonical URL": "https://gusku.site/game/creatures-of-aether",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Creatures of Aether\", \"description\": \"Looking for information on Creatures of Aether? Check out the release date (Aug 2, 2021), developer insights from Tako Boy Studios,Dan Fornace, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tako Boy Studios,Dan Fornace\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dan Fornace\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1593750/header.jpg?t=1627916462\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}