{
    "AppID": 868410,
    "Name": "DAISENRYAKU PERFECT 4.0",
    "Release date": "Oct 1, 2018",
    "About the game": "What is Daisenryaku? Daisenryaku is a full-scale, turn-based, single player strategic simulation game. Up to 8 factions compete against each other on large hex maps. The game features more than 300 maps, with more than 50 terrain types, from oceans to deserts, forests and cities. Make use of over 1500(!) different units representing the latest military technology from all over the world. These include classics, such as tanks and fighter aircraft, but also more unorthodox options like electronic warfare airplanes and nuclear submarines. The amount of possible strategies is near limitless. Bring in your units from the seas, attack from the sky, build roads and take the ground - the choice is all yours. Gameplay Battles take place on massive, hex-based maps. Plan your turns carefully to overcome your opponents. Each turn consists of 6 phases: 'Missile', 'Income', 'Supply', 'Replenishment', 'Action', and 'Production'. State-of-the-Art Real World Weaponry! Units represent real weapons and vehicles from all over the world, including over 70 of the latest real world ships, airplanes and other vehicles. For example, the 'Asahi'-class destroyer was just launched in March 2018 and is already playable. In total there are over 1520 different units! Multiple Editors Players can edit maps, units, production rosters and game rules to turn the game into an original experience for themselves. ・Use the Map Editor to build your own maps. ・Create original units with the Unit Editor. ・Assemble your favorite units in the Production Roster Editor. ・The Rule Editor lets you set the conditions for your next battle. With all these editors, the amounts of possible content are sheer endless! New: Neo Master Combat Mode This new game mode offers the ultimate strategic challenge. Conquer the world one map at a time in the Neo Master Combat Mode campaign. Earn combat points for each victory and spend them to purchase new units in between games. You can keep and customize your surviving units. Try to clear the game with one of your originals! Occupy cities, destroy the enemy troops, escort a VIP - a large variety of missions is awaiting you. Fight your way through a total of 60 maps. Easy to Understand Tutorials From the basics of moving troops and occupying cities, to complex maneuvers like electronic warfare and organizing supply chains - detailed tutorials will show you how to master the battlefield. There are 14 tutorial maps, climaxing in a final exercise to test all the skills you have learned.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/868410/header.jpg?t=1613634051",
    "Price": 59.99,
    "Developers": "Systemsoft beta, Inc.",
    "Publishers": "Systemsoft beta, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/868410/ss_cc49ba82894f2610715fd2736fdc5cff6e73db05.1920x1080.jpg?t=1613634051,https://cdn.akamai.steamstatic.com/steam/apps/868410/ss_9e796e785dfc2d90ff42d570958d54b1c5179344.1920x1080.jpg?t=1613634051,https://cdn.akamai.steamstatic.com/steam/apps/868410/ss_ced22c364ac573200c949175603918a7914f4d68.1920x1080.jpg?t=1613634051,https://cdn.akamai.steamstatic.com/steam/apps/868410/ss_1318433c6f575009fc29fe2ff89a339feee9860c.1920x1080.jpg?t=1613634051,https://cdn.akamai.steamstatic.com/steam/apps/868410/ss_ac8266c47efbe7d304238b6b807038c0eda4ab06.1920x1080.jpg?t=1613634051,https://cdn.akamai.steamstatic.com/steam/apps/868410/ss_2d61f4baa42d3f069593bb1adf004d9f35db771a.1920x1080.jpg?t=1613634051",
    "Slug": "daisenryaku-perfect-4-0",
    "Meta Title": "DAISENRYAKU PERFECT 4.0: Oct 1, 2018, Systemsoft beta, In...",
    "Meta Description": "Looking for information on DAISENRYAKU PERFECT 4.0? Check out the release date (Oct 1, 2018), developer insights from Systemsoft beta, Inc., and a compl...",
    "Alt Text Image": "Official header image for DAISENRYAKU PERFECT 4.0 game - Steam 868410",
    "Canonical URL": "https://gusku.site/game/daisenryaku-perfect-4-0",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DAISENRYAKU PERFECT 4.0\", \"description\": \"Looking for information on DAISENRYAKU PERFECT 4.0? Check out the release date (Oct 1, 2018), developer insights from Systemsoft beta, Inc., and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 1, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Systemsoft beta, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Systemsoft beta, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/868410/header.jpg?t=1613634051\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}