{
    "AppID": 1353730,
    "Name": "送外卖模拟器 Delivery Simulator",
    "Release date": "Jul 9, 2020",
    "About the game": "This is a game that simulates delivery. The player is a rider, and the job is to deliver the delivery from the merchant to the customer. Players want to make more money in the shortest time, they need to plan the route, take the delivery from the merchant to the customer, the player can take multiple orders together, but be careful not to timeout, overtime orders will be deducted by half Shipping fee. At the same time, the number of orders will increase as the player's level increases. This game can pick orders, you can choose to pick the way, so that you can make more money in a short time, but the orders you grab must be sent out. Each order will have a different unit price. Players can take orders based on the cost performance of each order. The shorter the distance, the higher the unit price and the higher the price. After delivering the takeaway to the customer, it is delivered at the click of a point, and there is another amount of money in the account, which is also a very happy thing. How to play: After entering the game, wait a few seconds, there will be a lot of takeaway orders on the right hand side, the grabbed orders will be placed in the 'waiting for pickup', click into the inside is the order that the player grabs, and then go to the merchant according to the information on the order Take the meal, the place to take the meal is in front of the merchant's cash register, when you get there, you need to press 'to the store', and then wait a few seconds, after successfully getting the meal, click 'I have taken the meal', and then the order for the meal will be Go to 'delivery', then take the delivery to the customer's door, wait for the customer to open the door to pick up the meal, after the customer gets the meal, press 'order delivery', the delivery is completed, and the account has an extra amount of money. Press the Tab key to switch between walking mode and mobile phone mode, pay attention to safety, do not look at the mobile phone when walking. Tip: The more you know about delivery, the faster your meal delivery. Press the M key to view the map, and you can also see where you are on the map. The map is only an aid, and the most important thing is to rely on yourself.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1353730/header.jpg?t=1597329463",
    "Price": 4.99,
    "Developers": "会玩游戏工作室",
    "Publishers": "会玩游戏工作室",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1353730/ss_fce0919488c9fc0fffb0bcad3c40a2efb383495c.1920x1080.jpg?t=1597329463,https://cdn.akamai.steamstatic.com/steam/apps/1353730/ss_a2fdf04c9c1f9b2a0fb579cb6f5905c45854a394.1920x1080.jpg?t=1597329463,https://cdn.akamai.steamstatic.com/steam/apps/1353730/ss_a2ff0b833ee010fc6ba766310d13390b479f1f9c.1920x1080.jpg?t=1597329463,https://cdn.akamai.steamstatic.com/steam/apps/1353730/ss_2f58919cd14d7f583115c9b544dc69a3e79dcef6.1920x1080.jpg?t=1597329463,https://cdn.akamai.steamstatic.com/steam/apps/1353730/ss_12143163ad2f866d231c56aec7dbb0513d2fd8a7.1920x1080.jpg?t=1597329463,https://cdn.akamai.steamstatic.com/steam/apps/1353730/ss_cdbce96e592a27611420330ae62e55c0d095cd77.1920x1080.jpg?t=1597329463",
    "Slug": "delivery-simulator",
    "Meta Title": "送外卖模拟器 Delivery Simulator: Jul 9, 2020, 会玩游戏工作室 and Full ...",
    "Meta Description": "Looking for information on 送外卖模拟器 Delivery Simulator? Check out the release date (Jul 9, 2020), developer insights from 会玩游戏工作室, and a complete game sum...",
    "Alt Text Image": "Official header image for 送外卖模拟器 Delivery Simulator game - Steam 1353730",
    "Canonical URL": "https://gusku.site/game/delivery-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u9001\\u5916\\u5356\\u6a21\\u62df\\u5668 Delivery Simulator\", \"description\": \"Looking for information on \\u9001\\u5916\\u5356\\u6a21\\u62df\\u5668 Delivery Simulator? Check out the release date (Jul 9, 2020), developer insights from \\u4f1a\\u73a9\\u6e38\\u620f\\u5de5\\u4f5c\\u5ba4, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4f1a\\u73a9\\u6e38\\u620f\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u4f1a\\u73a9\\u6e38\\u620f\\u5de5\\u4f5c\\u5ba4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1353730/header.jpg?t=1597329463\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}