{
    "AppID": 1714730,
    "Name": "Every day is more incredible than the previous",
    "Release date": "Oct 23, 2021",
    "About the game": "______________________________________________________________________ Greetings, stranger. Which brings you to our cozy tavern full of mischievous fun. Sit closer to the fireplace, let in one hand you hold a fragrant foamy beer, complemented to the brim, and in the other you wash the lush boobs of a juicy girl who would twirl her ass on her knee, so that when bringing beer to your mouth, it flows down your mustache yes did not get into the mouth. And everywhere you hear fascinating stories, one after another they are replaced, just like the beer in the mug was refreshed and in every sip, you are ready to absorb more and more new adventures. So delight your passionate curiosity to see our adventure story, where vices are glorified in a dance of recklessness and passion. ______________________________________________________________________ About the game ______________________________________________________________________ Plot You have to play for the main character, named Sergei. He is a strong guy, but there is one but, he is lazy and neurotic and a homebody, he even forgot what a woman's caress is. Sat at home doing constant self-medication, just not to go out into the white light from home, to people. And he gave up his job a long time ago, and he is trying to make money on the internet. But all these efforts are in vain. And then one day he still gathered his will into a fist and went to get a job. And then his life regained its colors, positivity and adventure. Not without romance with girls. Romantic adventures with three girls Visual Novel 18+ The game contains scenes of sex and adult content Ability to select an action and move along a different branch of the plot Specific humor The game is made on the Ren'Py engine A day like a day, nothing remarkable, a normal hot and stuffy summer day.Time to go to the river, with friends or family. Prepare kebabs, drink alcohol and dance to hardbase music. The music turned on at all volume, so that the whole society would enjoy it, concentrated around you on the lake, because they are surely, in your opinion, the same esthetas and connoisseurs of high-air bonds and that such a mischievous event cannot scare them away and even more so shatter the nervous system. Similar spiritual bonds, were everywhere and they manifested themselves in everything, every minute a person arrives in a similar location, they manifested themselves completely spontaneously and unexpectedly for him, gradually shaking his psyche.Hopelessness and despair became faithful companions and there was no salvation and no one will reach you even his finger, from somewhere from above, to help you and pull out of this abyss of eternal darkness. So thought the protagonist of this story, prone to panic attacks, trying in vain day after day to get out of this woeful state. So far, however, on one of these days, it does not launch its fascinating adventure, when suddenly every day is more incredible than the previous. ______________________________________________________________________ Another 18 + incentive game ► / Attention! There may be an incorrect translation in the game, since I do not speak all the languages of the world except my native language. I am sorry for that. But! I want as many people as possible to play my game, so I undertook to translate the text from Russian into different languages myself.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1714730/header.jpg?t=1637737953",
    "Price": 7.99,
    "Developers": "Draumara",
    "Publishers": "Witch thick tits",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1714730/ss_c1b3e50c3d53e273b562e73f941eddc9e0626fee.1920x1080.jpg?t=1637737953,https://cdn.akamai.steamstatic.com/steam/apps/1714730/ss_6aa2d6aa2411eca433c3c2ce9b34e58bb13c1caa.1920x1080.jpg?t=1637737953,https://cdn.akamai.steamstatic.com/steam/apps/1714730/ss_98242bd46f450174506df0a6987b458ca548c59e.1920x1080.jpg?t=1637737953,https://cdn.akamai.steamstatic.com/steam/apps/1714730/ss_b4f68137102007c18692bdd14705e638b20cc14f.1920x1080.jpg?t=1637737953,https://cdn.akamai.steamstatic.com/steam/apps/1714730/ss_e8e69accd0aa88330756633c0084f3d8e946249a.1920x1080.jpg?t=1637737953,https://cdn.akamai.steamstatic.com/steam/apps/1714730/ss_68bcc3e4a2bbe5c80fd7412c55a0cbd2be714f39.1920x1080.jpg?t=1637737953,https://cdn.akamai.steamstatic.com/steam/apps/1714730/ss_989e40644803c4bdd7daec5f475884b06e8af36a.1920x1080.jpg?t=1637737953,https://cdn.akamai.steamstatic.com/steam/apps/1714730/ss_b9173e510f7a0146848fb7e21d4396c0048fb2b0.1920x1080.jpg?t=1637737953",
    "Slug": "every-day-is-more-incredible-than-the-previous",
    "Meta Title": "Every day is more incredible than the previous: Oct 23, 2...",
    "Meta Description": "Looking for information on Every day is more incredible than the previous? Check out the release date (Oct 23, 2021), developer insights from Draumara, ...",
    "Alt Text Image": "Official header image for Every day is more incredible than the previous game - Steam 1714730",
    "Canonical URL": "https://gusku.site/game/every-day-is-more-incredible-than-the-previous",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Every day is more incredible than the previous\", \"description\": \"Looking for information on Every day is more incredible than the previous? Check out the release date (Oct 23, 2021), developer insights from Draumara, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 23, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Draumara\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Witch thick tits\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1714730/header.jpg?t=1637737953\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}