{
    "AppID": 1565830,
    "Name": "Expert on Domestication",
    "Release date": "Jun 9, 2021",
    "About the game": "For hundreds of years, the inhabitants and creatures of the continent of Vestria lived in harmony until In the game, you will play an adventurous young man. You can visit towns all over the mainland, enjoy the beautiful history and culture, challenge and collect a variety of wild animals, and uncover the secrets hidden in the dark. 1、 The game contains a variety of natural features of the area, a large number of towns and wild exploration points, wild exploration points have common areas (yellow) and dangerous areas (red), dangerous areas of the beast will be more powerful, and they will block you through the area. 2、 Pet and Treasure Collection: you can collect various types of pets, treasures and materials through pet fight, trading and other ways. Pets and treasures with higher star rating have stronger basic attributes. Pets and treasures may also have some 'traits'. Some traits can improve attributes, while others can provide some combat capabilities. The types of materials are related to traits. 3、 Synthesis: materials are primary raw materials, pets and equipment are advanced raw materials, synthetic stones are special raw materials, and synthetic stones can also be used as synthetic catalysts. The catalyst can increase the probability of the highest possible star of the product. *Special raw material synthesis: only special raw materials. The synthetic product is synthetic stone, and the star level is determined by the star level of raw materials. *Primary raw material synthesis: there are primary raw materials, there can be special raw materials. When there are special raw materials involved, special raw materials are regarded as primary raw materials of equal star level. The type of synthetic product is material, and the star level is determined by the star level of raw material. *Advanced raw material synthesis: there are advanced raw materials, there can be special raw materials. When there are special raw materials, special raw materials are regarded as high-grade raw materials. The type of synthetic product is pet or equipment, the star level is determined by the star level of raw materials, and the type and star level of characteristics are determined by the characteristics of advanced raw materials. *Mixed synthesis: both high-grade raw materials and primary raw materials, can have special raw materials. When there are special raw materials involved, special raw materials are regarded as primary raw materials of equal star level. The type of synthetic product is pet or equipment, the star level is determined by the star level of high-grade raw materials, and the type and star level of characteristics are determined by the characteristics of high-grade raw materials and primary raw materials. 4、 Lineup matching and fight: during the pet fight, you can adjust the lineup and the pets in the fight to enhance the combat effectiveness to defeat the powerful wild creatures, so as to get better rewards. You can master several formations, and the maximum number of pets you can arrange is determined by your level. 5、 Level: Defeating wild creatures can increase their level, which will also enhance the ability of pets, but wild creatures will also become stronger according to your level. Take your pet and let's go!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1565830/header.jpg?t=1623254587",
    "Price": 3.99,
    "Developers": "武汉渲美时光网络科技有限公司",
    "Publishers": "武汉渲美时光网络科技有限公司",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1565830/ss_2556d47d996e2af62103e3e79450fbaf79bc1ff2.1920x1080.jpg?t=1623254587,https://cdn.akamai.steamstatic.com/steam/apps/1565830/ss_c8f0418e9048600968280b3509245306acae7ca6.1920x1080.jpg?t=1623254587,https://cdn.akamai.steamstatic.com/steam/apps/1565830/ss_7c357a499100446847a7f574549a43896bc0a9f5.1920x1080.jpg?t=1623254587,https://cdn.akamai.steamstatic.com/steam/apps/1565830/ss_8c2d0da9f42615f4000de8a38a9f38ec54016b0e.1920x1080.jpg?t=1623254587,https://cdn.akamai.steamstatic.com/steam/apps/1565830/ss_dccb6d258e898e5f508e7474a71abba25ebae3dd.1920x1080.jpg?t=1623254587,https://cdn.akamai.steamstatic.com/steam/apps/1565830/ss_b60280917f6e4874bb5cc2664e144b5e1d38f823.1920x1080.jpg?t=1623254587,https://cdn.akamai.steamstatic.com/steam/apps/1565830/ss_7908a85fc0c503c6b029bdefdbbf044d7eb2b934.1920x1080.jpg?t=1623254587,https://cdn.akamai.steamstatic.com/steam/apps/1565830/ss_77a0ef000612e1c86879fc61bdb38759a8416e18.1920x1080.jpg?t=1623254587,https://cdn.akamai.steamstatic.com/steam/apps/1565830/ss_996c923deaab51e231d446640df065096a2e8f64.1920x1080.jpg?t=1623254587,https://cdn.akamai.steamstatic.com/steam/apps/1565830/ss_f48f8f97edb6f139a7adbe32c2ef88d7ab9ba4bf.1920x1080.jpg?t=1623254587",
    "Slug": "expert-on-domestication",
    "Meta Title": "Expert on Domestication: Jun 9, 2021, 武汉渲美时光网络科技有限公司 and ...",
    "Meta Description": "Looking for information on Expert on Domestication? Check out the release date (Jun 9, 2021), developer insights from 武汉渲美时光网络科技有限公司, and a complete gam...",
    "Alt Text Image": "Official header image for Expert on Domestication game - Steam 1565830",
    "Canonical URL": "https://gusku.site/game/expert-on-domestication",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Expert on Domestication\", \"description\": \"Looking for information on Expert on Domestication? Check out the release date (Jun 9, 2021), developer insights from \\u6b66\\u6c49\\u6e32\\u7f8e\\u65f6\\u5149\\u7f51\\u7edc\\u79d1\\u6280\\u6709\\u9650\\u516c\\u53f8, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 9, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6b66\\u6c49\\u6e32\\u7f8e\\u65f6\\u5149\\u7f51\\u7edc\\u79d1\\u6280\\u6709\\u9650\\u516c\\u53f8\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6b66\\u6c49\\u6e32\\u7f8e\\u65f6\\u5149\\u7f51\\u7edc\\u79d1\\u6280\\u6709\\u9650\\u516c\\u53f8\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1565830/header.jpg?t=1623254587\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}