{
    "AppID": 839040,
    "Name": "Fasaria World: Ancients of Moons + Server",
    "Release date": "Feb 3, 2020",
    "About the game": "*All games included are titles that have been discontinued and are being provided to you “as is”. All games have been tested to work under the system requirements suggested. Please Note: You need to run the simple server to play locally (single player). Please shut down all background applications. 1. The server needs to be on to play. 2. Install and load the simple server from Steam. 3. Turn the server on. 4. Select the local server option (first one). 5. Create a new account. (You should see it appear in the server list). 6. Create a character. 7. Exit the first screen and start to play. ***READ FULL INSTRUCTIONS HERE*** *Resolution options can also be changed but full screen will not work through Steam. What is Fasaria World: Ancients of Moons MMORPG? Fasaria World: Ancients of Moons is a single/multiplayer fantasy online experience that can be played locally from your PC (single player offline). Instructions are included on how to host your own server and how other players can join your game. Fasaria World was originally released in 2005 and then re-produced and re-released in 2012. The game was eventually taken down but based upon user requests, it is being updated and released for players to play off of their own local PCs as single player or they can host a private server. Unravel the mystery behind an elusive force threatening Fasaria and her 3 moons. Build your character, space station and travel through the planetarium to discover Fasaria's secrets. *Includes server application with easy edit scripts. You can easily launch the game from your PC for single player by launching the simple server application or set up a network where you can invite friends to play on your server. Modify the game to your liking provided you maintain the game's name and logo. The game or server can NOT be re-sold in whole or part. The game client or server can not be re-distributed in whole or in part. *This game is an older title that was discontinued using a game engine that has been long discontinued and is being re-released with updates. With community support and suggestions, we can still go back and update the game design and some features to enhance the game experience. Please provide feedback and suggestions to help us improve the game. NO MONTHLY or ADDITIONAL FEES. New in game Leaderboard added. Climb the ranks and reach greatness. Explore Fasaria and her 3 moons. Journey through the Planetarium. Populate and build your space station. Level up your skills and character. Collect tribute from your fleet. Play slots to earn Platinum Tokens. Gain karma and earn rewards. Play locally or set up a network and invite friends.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/839040/header.jpg?t=1646416470",
    "Price": 4.99,
    "Developers": "Fasaria Works",
    "Publishers": "Fasaria Works",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/839040/ss_832bb5caa6604e1a2a93c79f9ba9e5597282847d.1920x1080.jpg?t=1646416470,https://cdn.akamai.steamstatic.com/steam/apps/839040/ss_087e35f37b1cf8148ba2ec8ca9dbe96f035a04ed.1920x1080.jpg?t=1646416470,https://cdn.akamai.steamstatic.com/steam/apps/839040/ss_5a5120528a71e9cbf2de5c17c8e187c83df1cd21.1920x1080.jpg?t=1646416470,https://cdn.akamai.steamstatic.com/steam/apps/839040/ss_2a92d22cefb184fed4d3cd77cbc1683042cc8717.1920x1080.jpg?t=1646416470,https://cdn.akamai.steamstatic.com/steam/apps/839040/ss_e24a8e8caf0ee101e7fae71293cf76afa5cf9536.1920x1080.jpg?t=1646416470",
    "Slug": "fasaria-world-ancients-of-moons-server",
    "Meta Title": "Fasaria World: Ancients of Moons + Server: Feb 3, 2020, F...",
    "Meta Description": "Looking for information on Fasaria World: Ancients of Moons + Server? Check out the release date (Feb 3, 2020), developer insights from Fasaria Works, a...",
    "Alt Text Image": "Official header image for Fasaria World: Ancients of Moons + Server game - Steam 839040",
    "Canonical URL": "https://gusku.site/game/fasaria-world-ancients-of-moons-server",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fasaria World: Ancients of Moons + Server\", \"description\": \"Looking for information on Fasaria World: Ancients of Moons + Server? Check out the release date (Feb 3, 2020), developer insights from Fasaria Works, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 3, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fasaria Works\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fasaria Works\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/839040/header.jpg?t=1646416470\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}