{
    "AppID": 690130,
    "Name": "FlatFatCat",
    "Release date": "Aug 15, 2017",
    "About the game": "Relax with cats FlatFatCat is a funny cat billiard game which can help relax, but also offer some challenge. Push 'Bruno' our male cat around and try to match different cat pairs. Same colors will fit together and disappear, if you are able to solve the level with just a few shots you can enter a very special game mode. There are hundreds of levels available which offer a variety of different obstacles or objects with special game mechanics. Can you solve all the levels? This is Bruno, our man character, he is a lazy fat and sometimes a bit crazy male cat. Bruno wants to bring more fun and joy into his life by getting in contact with other cats. This is not always as easy as it sounds, it takes skill and patience. Sometimes there is a couch or seat in his way, in other rooms are shelves or fish tanks. You need to bounce him, like you would do in a Billiard game, over the floor and throw him in the direction of the other fat cats. If you contact the other cats they will dive over the floor as well. The goal is to resolve all same colored cats by let them bounce together. How to play If you match two same colored cats together they will disappear. Your goal is to solve all pairs of cats within the given moves. At the point all cats except Bruno disappeared, the level is cleared – Congratulations! You can reach the Supercat-Mode, when you are able to finish a level with moves left! Stars and points are rewarded according to Combos. Solve over 200 different level in this adventure with many setups and unique objects. Interactive objects Bruno’s owner is an ambitious artist. This is why it is possible some buckets of color lay on the floors. It is a big pleasure for Bruno to bounce other cats into this paint. His wife on the other hand is a florist, and she displays her flowers all over the floor. You can break them! Bruno dislikes dogs in general, but Chihuahuas are a special treat for him. Their craziness is unpredictable. He also has to deal with weird looking wheels from time to time. They create an enormous amount of wind, which can be hard to handle. Some boxes were left after tidying up – the first cat which comes to close will be occupied shredding it for some time… Conclusion A crazy cat game with a lot of action ongoing and special Supercat-Mode is available. FlatFatCat is super cute, but it requires some skill to solve all the levels within the given moves. Relax with cats!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/690130/header.jpg?t=1618837762",
    "Price": 2.99,
    "Developers": "Rainware",
    "Publishers": "Rainware",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/690130/ss_bf1c4fa9da9941c3fe4a8721eef22402f9b07844.1920x1080.jpg?t=1618837762,https://cdn.akamai.steamstatic.com/steam/apps/690130/ss_7645c7e600ab221abee18e271acda72d57058d1b.1920x1080.jpg?t=1618837762,https://cdn.akamai.steamstatic.com/steam/apps/690130/ss_961449ef2eb50de303e0d66b4952028146a38d12.1920x1080.jpg?t=1618837762,https://cdn.akamai.steamstatic.com/steam/apps/690130/ss_ee9646bc077b8f13ff6369f3ae4c3cef6ee7cec8.1920x1080.jpg?t=1618837762,https://cdn.akamai.steamstatic.com/steam/apps/690130/ss_d98fd1be0834893ff26d768aa74e29c6bb4e4a66.1920x1080.jpg?t=1618837762,https://cdn.akamai.steamstatic.com/steam/apps/690130/ss_16a7be02882b507bd502914febc00200e0127066.1920x1080.jpg?t=1618837762",
    "Slug": "flatfatcat",
    "Meta Title": "FlatFatCat: Aug 15, 2017, Rainware and Full Overview",
    "Meta Description": "Looking for information on FlatFatCat? Check out the release date (Aug 15, 2017), developer insights from Rainware, and a complete game summary.",
    "Alt Text Image": "Official header image for FlatFatCat game - Steam 690130",
    "Canonical URL": "https://gusku.site/game/flatfatcat",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"FlatFatCat\", \"description\": \"Looking for information on FlatFatCat? Check out the release date (Aug 15, 2017), developer insights from Rainware, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 15, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rainware\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rainware\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/690130/header.jpg?t=1618837762\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}