{
    "AppID": 1104330,
    "Name": "Founders' Fortune",
    "Release date": "Dec 18, 2020",
    "About the game": "Build Your Village When your colonists arrive, they have nothing but the clothes on their backs. You take control and tell them to gather materials and build walls, floors and furniture. You are not limited to predefined buildings! Design your own houses and style them to your liking. There are dozens of construction and furniture elements that you can use to create the settlement you’ve always dreamed of! Take Care Of Your Villagers The villagers are your top priority. At first, you simply need to provide them with food and shelter. But the world is full of dangers! An infection might prove fatal to the strongest warrior and a plague can wipe out your entire settlement. Each villager reacts to events, happy or sad, and reflects that in their behavior. Happy villagers will receive a boost to their productivity – Unhappy villagers might throw a temper tantrum. Raise your Family Villagers go through a lot together, so they value their friendships very high. Some might even decide to start a family – and you’ll soon be welcoming new members to the group! The little ones are the future of the village, so make sure they have a happy childhood and an adequate education – sometimes achieving both can be difficult. Set up your Farm Food matters. Good food makes colonists happy, wrong food makes colonists sick, little food makes colonists slow, and no food makes colonists die. Grow a variety of seasonal crops and set up a kitchen to make delicious meals. Be sure to stock up before winter hits and act quick when a swarm of hungry bugs descends upon your fields! Survive Winter Use the time you have and make sure you have enough food stored away, for winter is coming. Let’s hope you won’t have to halve rations – because that will make your colonists weak. When supplies dwindle and the freezing cold wind howls outside, it’s easy to lose hope. Trade Goods and Get Rich Word got around that your colony has started producing wares. Greet traveling traders and see if you can get a good deal on some ancient scrolls or buy additional food to prepare for winter. Try to keep production up so you’ll always have something to sell. A mature colony needs to pay good salaries to keep everyone happy. If morale is low, additional funds can even buy a tiny bit of happiness! Research Technologies Building your home is a long process and resources and manpower are not the only things you need. Smart Settlers dedicate a lot of time to researching new technologies, thereby unlocking better equipment, new furniture and construction elements. Select scholars carefully – if their personality doesn’t fit this type of work, they are not going to make a lot of progress. Protect Your Outpost You are not alone in this new land you call ‘home’. Some Tikigoblins living there are not all that happy about your settling efforts and might pay you a visit to try to get you to stop. Train your colonists in the art of warfare and equip them with the best weapons and armor you have. Build walls and towers to ensure the security of your colony – that way, your enemies will have a difficult time trying to mess with you! Play and make Mods Sometimes there are mods that just give the game just the extra something you were looking for. This is why Founders’ Fortune has a full ModKit with accompanying tutorials – so that modders have an easier time getting started. Check out new mods for Founders’ Fortune on the Steam Workshop or make your own!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1104330/header.jpg?t=1633554617",
    "Price": 21.99,
    "Developers": "Dionic Software",
    "Publishers": "Dionic Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1104330/ss_5680bf9edb51a2599122e739033564ba6b9a43f5.1920x1080.jpg?t=1633554617,https://cdn.akamai.steamstatic.com/steam/apps/1104330/ss_4da864d4c36656fece574959b9ff4e81586f64a2.1920x1080.jpg?t=1633554617,https://cdn.akamai.steamstatic.com/steam/apps/1104330/ss_5e7fe0cbfc9c1bdf4570f7b09a1c445a1c7bf18b.1920x1080.jpg?t=1633554617,https://cdn.akamai.steamstatic.com/steam/apps/1104330/ss_2276cc21f40c4949a0eb176f3a6241457b314658.1920x1080.jpg?t=1633554617,https://cdn.akamai.steamstatic.com/steam/apps/1104330/ss_6cb827a107d56963dfa7ccf68d39e8aed087eb68.1920x1080.jpg?t=1633554617,https://cdn.akamai.steamstatic.com/steam/apps/1104330/ss_4082e65920b6ec735abafd699a8c10f947dff2bb.1920x1080.jpg?t=1633554617,https://cdn.akamai.steamstatic.com/steam/apps/1104330/ss_342b780fa4a162bba5660ed44beead4e940ad4cc.1920x1080.jpg?t=1633554617,https://cdn.akamai.steamstatic.com/steam/apps/1104330/ss_5c5e6d2331f39dfc9eb61d03744dbf8ee0c946ef.1920x1080.jpg?t=1633554617,https://cdn.akamai.steamstatic.com/steam/apps/1104330/ss_4d83930227b167c14d0ba13180ddc42f67cd3c65.1920x1080.jpg?t=1633554617",
    "Slug": "founders-fortune",
    "Meta Title": "Founders' Fortune: Dec 18, 2020, Dionic Software and Full...",
    "Meta Description": "Looking for information on Founders' Fortune? Check out the release date (Dec 18, 2020), developer insights from Dionic Software, and a complete game su...",
    "Alt Text Image": "Official header image for Founders' Fortune game - Steam 1104330",
    "Canonical URL": "https://gusku.site/game/founders-fortune",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Founders' Fortune\", \"description\": \"Looking for information on Founders' Fortune? Check out the release date (Dec 18, 2020), developer insights from Dionic Software, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dionic Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dionic Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1104330/header.jpg?t=1633554617\", \"offers\": {\"@type\": \"Offer\", \"price\": 21.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}