{
    "AppID": 1544510,
    "Name": "Симулятор Сидения на Крыше",
    "Release date": "Apr 1, 2021",
    "About the game": "Симулятор Сидения на Крыше - проект об опыте людей выросших в 2000ых. Игра позволит позволит вжиться в роль молодого человека, вернуться в 2007 ой год, и посидеть на крыше с 18летней эмо-тяночкой. Собственно, в этом и вся её суть - дать возможность испытать это, полюбоваться эстетикой родных нам панельных домов, которые в некоторых кругах стало модно хейтить. Если некоторые игры признаются в ненависти к панелькам, то мы им признаемся в любви. Симулятор Сидения на Крыше - это не совсем в привычном понимании игра. Так уж сложилось, что всё, имеющее програмный код и 3д графику называется играми. Мы предпочитаем называть этот проект нечто вроде цифровой мечты, аналог брейнданса киберпанка. Нынешние техологии позволяют нам лишь ассоциироваться с играми, но покупателю, в том числе чтобы не разочароваться - важно понимать, что 'игры' здесь нет. Это кусочек мечты, и пусть он упакован в машинный код - игрой он не является. Проект отдаёт дань уважения пост-советской культуре и запечатлевает жизнь нашего поколения в веках, давая возможность окунуться людям в прошлое и посмотреть на мир нашими глазами. Особенности: ⚫ Ностальгия. Вернись в 2007 год. Снова. ⚫ Не все сидели на крышах домов с тяночками, и желающие понять какого это - могут купить этот экспириенс. ⚫ Симулятор Сидения на Крыше - духовный наследник Симулятора Сидения у Подъезда и Platzkart Simulator. ⚫ Kavkaz Sila Games продолжает бесстыдно доить тематику 2007 года ⚫ Симулятор Сидения на Крыше - кто-то должен был сделать такой проект и эти кто-то как всегда мы ⚫ Мы усиливаем российский культурный пузырь. Уехав из России начинаешь понимать, что твой русский мир не универсален, и у людей в головах совсем другое. Другое искусство, другая история, для них не было тех же эпох - не было тяжелых 90ых, не было свободных, неформальных и ламповых 2000ых, у тебя c людьми не общий мир. В такие моменты ты перестаешь воспринимать что-либо русское как данное, и понимаешь хрупкость твоего восприятия мира. Каждая игра по русской тематике - это не должное, а исключение из правил, и люди должны гордиться что их страна достаточно важная, чтобы её культура запечатлевалась в играх. ⚫Если ты из тех, кто каждый день пишет о том, КАК ЖЕ ему ХОЧЕТСЯ ТЯНОЧКУ, БЛЕДНУЮ, НЕ ОЧЕНЬ ВЫСОКУЮ - то этот проект для тебя ⚫ 3д графика, возможность рассматривать пост-советские пейзажи от первого лица ⚫ Мы боремся с каргокультом. Порой складывается впечатление, что люди в России не осознают, что у них за окном. Каждый второй российский рассказ состоит из 'Джонов' и 'Стэйси', с местом дейстия обязательно на западе. Мы хотим сказать, что нет ничего страшного в том, чтобы осознать где ты находишься, и перестать воспринимать нативную для себя среду как экзотику. Проекты в СНГ сэттинге от СНГ разработчиков не должны удивлять, точно также, как и не удивляют проекты в западных сэттингах от западных разработчиков, и мы хотим этому поспособствовать.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1544510/header.jpg?t=1617291051",
    "Price": 0.99,
    "Developers": "ТЯН ТЯН ТЯН ЛАМПОВАЯ ТЯН INDUSTRIES,Kazakhstan Sila Games",
    "Publishers": "Kavkaz Sila Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1544510/ss_7df7faeefa3fe87e3dca76d1adbff121c602a3f3.1920x1080.jpg?t=1617291051,https://cdn.akamai.steamstatic.com/steam/apps/1544510/ss_4f3661cdcc1fa7ccaa8fe5d8ddef331961627e60.1920x1080.jpg?t=1617291051,https://cdn.akamai.steamstatic.com/steam/apps/1544510/ss_767cbcbf16e912c6dadeda0a8cfe77ed057ce226.1920x1080.jpg?t=1617291051,https://cdn.akamai.steamstatic.com/steam/apps/1544510/ss_813eca87d5ab89e8e6ab1fd2eeec10c458afbbb6.1920x1080.jpg?t=1617291051,https://cdn.akamai.steamstatic.com/steam/apps/1544510/ss_9b821a13f061c183264aceb49d3d80c0393def6a.1920x1080.jpg?t=1617291051,https://cdn.akamai.steamstatic.com/steam/apps/1544510/ss_e803069609b88bdbe8f4a432e4e6390b004b405f.1920x1080.jpg?t=1617291051,https://cdn.akamai.steamstatic.com/steam/apps/1544510/ss_96fb193298acd9007527ad38fd92012dabe883b0.1920x1080.jpg?t=1617291051",
    "Slug": "",
    "Meta Title": "Симулятор Сидения на Крыше: Apr 1, 2021, ТЯН ТЯН ТЯН ЛАМП...",
    "Meta Description": "Looking for information on Симулятор Сидения на Крыше? Check out the release date (Apr 1, 2021), developer insights from ТЯН ТЯН ТЯН ЛАМПОВАЯ ТЯН INDUST...",
    "Alt Text Image": "Official header image for Симулятор Сидения на Крыше game - Steam 1544510",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u0421\\u0438\\u043c\\u0443\\u043b\\u044f\\u0442\\u043e\\u0440 \\u0421\\u0438\\u0434\\u0435\\u043d\\u0438\\u044f \\u043d\\u0430 \\u041a\\u0440\\u044b\\u0448\\u0435\", \"description\": \"Looking for information on \\u0421\\u0438\\u043c\\u0443\\u043b\\u044f\\u0442\\u043e\\u0440 \\u0421\\u0438\\u0434\\u0435\\u043d\\u0438\\u044f \\u043d\\u0430 \\u041a\\u0440\\u044b\\u0448\\u0435? Check out the release date (Apr 1, 2021), developer insights from \\u0422\\u042f\\u041d \\u0422\\u042f\\u041d \\u0422\\u042f\\u041d \\u041b\\u0410\\u041c\\u041f\\u041e\\u0412\\u0410\\u042f \\u0422\\u042f\\u041d INDUST...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u0422\\u042f\\u041d \\u0422\\u042f\\u041d \\u0422\\u042f\\u041d \\u041b\\u0410\\u041c\\u041f\\u041e\\u0412\\u0410\\u042f \\u0422\\u042f\\u041d INDUSTRIES,Kazakhstan Sila Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kavkaz Sila Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1544510/header.jpg?t=1617291051\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}