{
    "AppID": 758170,
    "Name": "Krampus Quest",
    "Release date": "Dec 20, 2017",
    "About the game": "Story In the dark depths of a prison cell sits a mythic being, stripped of his powers, all but forgotten by time. Neither man, nor beast, but closely resembling parts of both. A one-of-a-kind being, known only as Krampus. Once a being both respected and feared, serving as the personal right-hand-man of Santa Claus, but also as his opposite. While the mission of Santa Claus was to reward the good-hearted children of the world with gifts, Krampus on the other hand was to do the dirty deed of punishing the wicked children. The world was in balance. But one day, Santa in all of his saintly wisdom had an idea, a change of heart. He no longer wished for the wicked children to be punished, but rather have all children be rewarded equally. Krampus, for the first time in millennia, spoke up with his disagreement. But Santa Claus would not have any insubordination, and immediately had Krampus thrown in a cell and his hook removed. More than a century has passed since then, with Krampus growing angrier and angrier for every day spent imprisoned, patiently waiting for the day he will walk free. That day has finally come. When a mysterious stanger throws Krampus the key to the cell, the tides has finally turned, and the day of reckoning is here. With his soul-bound chain of punishment, Krampus must swing, jump, and fight his way up the snowy mountains of the North Pole, and in the end, enact his vengence upon the one who put him in that dark pit. Santa Claus. Gameplay Krampus Quest is a back-to-basics retro-style action-platformer with a christmas theme. You go from one side to the other, fighting enemies and bosses, absorbing souls, dodging traps and pitfalls, and upgrade your abilities. There is some exploring and backtracking, but mostly this is a straight-forward kind of game. Features include: Controller support and Save files. Glorious 8-bit pixel graphics. Catchy chiptune music. Jumping, walljumping, and swinging platform ACTION . Exploring levels to find upgrades and souls. Buying upgrades and sub-weapons with souls absorbed from fallen foes. Dramatic still-frame cutscenes. Short but sweet .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/758170/header.jpg?t=1516395336",
    "Price": 3.99,
    "Developers": "Frozen Rose",
    "Publishers": "Frozen Rose",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/758170/ss_24ca103e063c29b60e5e1f7259230419eb38cb07.1920x1080.jpg?t=1516395336,https://cdn.akamai.steamstatic.com/steam/apps/758170/ss_85ddb9e78b4925dbb84d8ed62cbb511a17ea2874.1920x1080.jpg?t=1516395336,https://cdn.akamai.steamstatic.com/steam/apps/758170/ss_f20f83e6bf66783259de1ace0981f5b581b47a5e.1920x1080.jpg?t=1516395336,https://cdn.akamai.steamstatic.com/steam/apps/758170/ss_2ffbeaff3f80985c479aeca69dcf36775f4b4208.1920x1080.jpg?t=1516395336,https://cdn.akamai.steamstatic.com/steam/apps/758170/ss_4c5ee0d0069f61fc5b75e0308ed3ae604482a3ca.1920x1080.jpg?t=1516395336,https://cdn.akamai.steamstatic.com/steam/apps/758170/ss_46dff82d02268c79795cea1a3f9c93fec4253577.1920x1080.jpg?t=1516395336",
    "Slug": "krampus-quest",
    "Meta Title": "Krampus Quest: Dec 20, 2017, Frozen Rose and Full Overview",
    "Meta Description": "Looking for information on Krampus Quest? Check out the release date (Dec 20, 2017), developer insights from Frozen Rose, and a complete game summary.",
    "Alt Text Image": "Official header image for Krampus Quest game - Steam 758170",
    "Canonical URL": "https://gusku.site/game/krampus-quest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Krampus Quest\", \"description\": \"Looking for information on Krampus Quest? Check out the release date (Dec 20, 2017), developer insights from Frozen Rose, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Frozen Rose\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Frozen Rose\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/758170/header.jpg?t=1516395336\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}