{
    "AppID": 1253760,
    "Name": "Little Adventures",
    "Release date": "Sep 29, 2020",
    "About the game": "Gameplay Little Adventures is a randomly generated Dungeon crawler, with heavy Rogue-like elements. Start by picking a Dungeon and a Adventurer, who is going into the dungeon. Following the Adventurer on their journey, players will find shops and upgrades which helps the Adventurer, to fight mysterious creatures throughout 5 randomly generated levels. By defeating enemies you receive coins which you can use to buy upgrades for your character. However the only enemies you have to defeat to proceed, is the boss at the end of each level. Think you have the skills to make it pass the bosses and defeat the final boss? Full Release The game is in early access, but when the game gets fully released there will be 9-12 playable characters, all with 3 different unique hero powers and 3 different unique starting skills. There will be 3 distinctive dungeons, all with different themes. The dungeon will be filled with challenging enemies and bosses, along with many upgrades for your character. There will be 4 different kinds of shops, all with different unique upgrades and payments. Early Access The game is in Early Access, meaning that many new updates will be added to the game throughout the next year. There are 3 playable characters, all with 3 different unique hero powers and starting skills. The dungeon is filled with many enemies, upgrades and bosses. The Dungeon as well as the rooms are randomly generated, giving each game a unique experience. You can play the game by yourself or with up to 4 friends in local co-op. Key Features: Local co-op with up to 4 Players Endless gameplay Randomly generated rooms and dungeons, with random picked blocks &amp; enemies Heavy focus on high risk, high reward You proceed by killing bosses not enemies Many challenging enemies Power ups that can be used as combos Many different power ups Lots of different shops, some with different types of payment Can be played in very low and/or very high difficulty Many choices, you decide how the game should be played Lots of characters to choose from which all have different starting skills and Hero Powers to choose from Integrated controller support for popular controls The ultimate roguelike A bunch of achievements",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1253760/header.jpg?t=1601395275",
    "Price": 6.99,
    "Developers": "Pennie Entertainment Aps",
    "Publishers": "Pennie Entertainment Aps",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1253760/ss_149559f1f6639f56c51f026c9a75b85729b55d28.1920x1080.jpg?t=1601395275,https://cdn.akamai.steamstatic.com/steam/apps/1253760/ss_6e1dcb7c3c3e6b7eeb3b77b2a7ada1b53e7d0906.1920x1080.jpg?t=1601395275,https://cdn.akamai.steamstatic.com/steam/apps/1253760/ss_ddd8db3768142cda7b4dea2d3917c3d83e7d9ca6.1920x1080.jpg?t=1601395275,https://cdn.akamai.steamstatic.com/steam/apps/1253760/ss_610e1e65f7a7365b44c97b8e2ad22e68793a6383.1920x1080.jpg?t=1601395275,https://cdn.akamai.steamstatic.com/steam/apps/1253760/ss_37576d4e6fd59d164d3fcfe2da7d1a6b56ae6202.1920x1080.jpg?t=1601395275,https://cdn.akamai.steamstatic.com/steam/apps/1253760/ss_9a505a1c666986dfcb52d474cfdfafca8e392f02.1920x1080.jpg?t=1601395275",
    "Slug": "little-adventures",
    "Meta Title": "Little Adventures: Sep 29, 2020, Pennie Entertainment Aps...",
    "Meta Description": "Looking for information on Little Adventures? Check out the release date (Sep 29, 2020), developer insights from Pennie Entertainment Aps, and a complet...",
    "Alt Text Image": "Official header image for Little Adventures game - Steam 1253760",
    "Canonical URL": "https://gusku.site/game/little-adventures",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Little Adventures\", \"description\": \"Looking for information on Little Adventures? Check out the release date (Sep 29, 2020), developer insights from Pennie Entertainment Aps, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pennie Entertainment Aps\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pennie Entertainment Aps\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1253760/header.jpg?t=1601395275\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}