{
    "AppID": 628660,
    "Name": "Lode Runner Legacy",
    "Release date": "Jul 13, 2017",
    "About the game": "Lode Runner, the Legendary Platformer Returns! Lode Runner Legacy is the latest edition in the classic Lode Runner series, a masterpiece of action puzzle gaming introduced in the U.S. in 1983. Players manipulate “Runner” to infiltrate the evil empire and recover stolen gold while avoiding enemies and minefields. The ingenious balance of puzzle and action gameplay from the original Lode Runner is alive in Lode Runner Legacy, along with many new features that offer a fresh experience to both new players and returning fans alike, including an updated Voxel visual style and powerful game editors. features! Adventure Mode: Infiltrate the evil Empire and bring back stolen gold! NEW! Two Player Mode: Local Co-Op Multiplayer with up to 2 players, along with new levels! Controlled required. NEW! Extra Mode: More levels featuring new enemies that have new movements! Puzzle Mode: It’s all puzzles, all the time. No enemies allowed. Classic Mode: Play the original 150 levels in 3D! World Levels: An outstanding collection of user-created levels. Craft Mode: Create your own levels, characters, items, combine them and share with other fans. Online Rankings: Compete against other fans in global standings. NEW! varying Level Sizes more Technical Bonuses deadly Enemies challenging New Ai local 2player Co-op Play Named one of “The Greatest Games of All Time” by GameSpot, Lode Runner was created by Douglas E. Smith in 1983 while a student at the University of Washington. The game was not only an award-winning bestseller, but also a significant milestone that influenced many in the video game industry. Alexey Pajitnov, creator of Tetris, said of the game, “My favorite for many, many years. Every level was a real puzzle with its own mechanics, its own dynamics, its own kind of solution. … I can’t imagine any other game with such inventive and unusual design.” In a tribute to Smith after his death in 2014, US Gamer editor-in-chief Jeremy Parish commented, “[He] created one of the most innovative formative works of the medium, a game that managed to transcend international boundaries and become a beloved classic among American PC gamers and Japanese console fanatics alike.” As a classic from video game history looks to the future, “Lode Runner Legacy” can keep evolving with your support. We hope you enjoy the game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/628660/header.jpg?t=1525164401",
    "Price": 11.99,
    "Developers": "Tozai Games, Inc.,O-TWO inc.,ESQUADRA,inc.",
    "Publishers": "Tozai Games, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/628660/ss_a8117b5b6f42100aa4d654923744cb175fd2c121.1920x1080.jpg?t=1525164401,https://cdn.akamai.steamstatic.com/steam/apps/628660/ss_8416701906004745f144c6d577daa4f1434b4a02.1920x1080.jpg?t=1525164401,https://cdn.akamai.steamstatic.com/steam/apps/628660/ss_52e6e1dce4494b8739076664a1f36a68527d4cc8.1920x1080.jpg?t=1525164401,https://cdn.akamai.steamstatic.com/steam/apps/628660/ss_e46ba9a8aa7e97f271a0c9f536e757b4cb5681f4.1920x1080.jpg?t=1525164401,https://cdn.akamai.steamstatic.com/steam/apps/628660/ss_182f6637b3f91efe0c7db88818f661f2445d13a6.1920x1080.jpg?t=1525164401,https://cdn.akamai.steamstatic.com/steam/apps/628660/ss_bad6bb0fc7c6a4a5cbd4d13a6ae29fc304bab4d8.1920x1080.jpg?t=1525164401",
    "Slug": "lode-runner-legacy",
    "Meta Title": "Lode Runner Legacy: Jul 13, 2017, Tozai Games, Inc.,O-TWO...",
    "Meta Description": "Looking for information on Lode Runner Legacy? Check out the release date (Jul 13, 2017), developer insights from Tozai Games, Inc.,O-TWO inc.,ESQUADRA,...",
    "Alt Text Image": "Official header image for Lode Runner Legacy game - Steam 628660",
    "Canonical URL": "https://gusku.site/game/lode-runner-legacy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lode Runner Legacy\", \"description\": \"Looking for information on Lode Runner Legacy? Check out the release date (Jul 13, 2017), developer insights from Tozai Games, Inc.,O-TWO inc.,ESQUADRA,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 13, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tozai Games, Inc.,O-TWO inc.,ESQUADRA,inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tozai Games, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/628660/header.jpg?t=1525164401\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}