{
    "AppID": 1038000,
    "Name": "Makross",
    "Release date": "Aug 30, 2019",
    "About the game": "!DOES NOT REQUIRE STEAM TO RUN! Makross is a multi-functional power tool for PC users that will considerably accelerate your productivity. You can download a free demo with full functionality here: Imagine being able to quickly access any folder, any hotkey, any file or website relevant to your current application, game or project. Everything you need is all in one place! Once you use Makross you won't know how you ever lived without it. With Makross you can: Organize everything with easy drag and drop functionality! Access shortcuts to your files, folders and favorite websites in a click! Assign shortcut keys /Hotkeys to Makross buttons for all your favorite programs and games! Create and Export your own Hotkey sets for other users easily! Steam Workshop Integration! Create macro sequences accessible on a single button that perform a series of inputs in your *games and applications. Speed up your productivity with everything just a click away! Features: Activate the Makross dial to your mouse position on a single configurable button press or shortcut key. Drag and Drop multiple files and folders to Makross to quickly create shortcuts and lists that are always at hand. Fast access to any file, folder, drive or website. Jump Lists for organizing related files, folders and links. Macro creator for function sequences that can be used in all apps and games and even your desktop. 'Auto' mode can detect the app that you are currently using and adjust the functions available in Makross to a set of related buttons and shortcuts. Eg..When you use Blender all of your Blender shortcut keys will be accessible, but then if you move applications to Outlook; then all of you Outlook shortcuts become available. Permanent functions that can be used in any app at any time. Fully configurable icons, names and tool tips for each command. Create and Share your own Hotkey sets for other users easily using the Command Set Manager! Import Hotkey Command sets made by other users! Multiple folders for an infinite amount of commands, Save custom Clip Tray lists and paste from your clip tray history. Use your saved settings on multiple PCs. Easy to use, always at hand and never in the way! Doesn't require Steam to be running. Tested to work perfectly in conjunction with Fences and Display Fusion *Only windowed or border-less / full-screen-windowed games are supported at this time. Additionally due to the vast number of games and how they are written, not all are supported. Be sure to try the free demo of Makross available on our website if specific software compatibility is important to you. You can download a free demo with full functionality here:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1038000/header.jpg?t=1594638465",
    "Price": 9.99,
    "Developers": "Rule of Fun",
    "Publishers": "Rule of Fun",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1038000/ss_7f846ca3e0a3aef366404d35be566986e40fb0f3.1920x1080.jpg?t=1594638465,https://cdn.akamai.steamstatic.com/steam/apps/1038000/ss_46a69ba64d36da3d297fb159f90ba9defefe0ea2.1920x1080.jpg?t=1594638465,https://cdn.akamai.steamstatic.com/steam/apps/1038000/ss_a8bb0113029172884c5430cab67e9ce1c85da70b.1920x1080.jpg?t=1594638465,https://cdn.akamai.steamstatic.com/steam/apps/1038000/ss_de7fb3d835e388a728dc4267b3db8071ed291d6b.1920x1080.jpg?t=1594638465,https://cdn.akamai.steamstatic.com/steam/apps/1038000/ss_d4c6c3ec716885980b1ac4e6fadd6fbe3f843ace.1920x1080.jpg?t=1594638465,https://cdn.akamai.steamstatic.com/steam/apps/1038000/ss_a726c2074c2a8737384ea00aa632d7ccd4119a9b.1920x1080.jpg?t=1594638465",
    "Slug": "makross",
    "Meta Title": "Makross: Aug 30, 2019, Rule of Fun and Full Overview",
    "Meta Description": "Looking for information on Makross? Check out the release date (Aug 30, 2019), developer insights from Rule of Fun, and a complete game summary.",
    "Alt Text Image": "Official header image for Makross game - Steam 1038000",
    "Canonical URL": "https://gusku.site/game/makross",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Makross\", \"description\": \"Looking for information on Makross? Check out the release date (Aug 30, 2019), developer insights from Rule of Fun, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 30, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rule of Fun\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rule of Fun\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1038000/header.jpg?t=1594638465\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}