{
    "AppID": 499660,
    "Name": "Medieval Kingdom Wars",
    "Release date": "Jan 3, 2019",
    "About the game": "Medieval Kingdom Wars brings a fresh perspective to the grand strategy genre, combining world map kingdom management with a full-on real time approach. It`s 1336, the time of the Hundred Years' War Grand Campaign Awaits You start the game as a minor noble, in service to your King. With over a dozen nations and over 50 Lords to choose from, each playthrough is truly unique and tells it`s own story. There are many ways to play the game. The Grand Campaign. Classical RTS skirmish with solo, coop and multiplayer options. And a story driven introductory campaign that introduced the player to the the time period through 9 crafted scenarios. Redefining the Genre Everything takes place in real-time, with rogue like game progression - everything you do is constantly saved, even during the battle. There are no second chances, no turns, or multiple reloads. This is a first game to fuse Fixed Force and RTS gameplay. As you bring your army to battle, you can also set up your siege camp or town, collect resources and train new troops as the battle unfolds. Brutal Epic Battles Battles are truly epic - with up to 120 battalions per battle. Bloody sieges, pitched field battles, and naval warfare unfolds with brutal historical realism and survival elements. Includes looting corpses, or taking apart towns for resources. Manage Towns Up-close You have the freedom to manage everything up-close and personal by entering towns in RTS mode. Task your peasants, construct buildings and walls, and position your troops. Same time you can also manage everything on the world map. Complex Tech Tree Late Middle ages was a time of many technological breakthroughs. The game represents this with complex historical tech tree - with over 240 innovations and local technologies - from religious matters to military and innovative siege tactics. Feudal Diplomacy As you improve your lordship, you will engage in complex feudal system within your Kingdom. Serving your King and maintaining relations with your fellow lords, as well as influencing larger European politics. Eventually you can rebel, and overthrow your King. This opens entire new level of gameplay. As you hire new Lords, divide the land between them, and engage in a complex diplomatic system of European politics. Beautiful Game World Beautiful, living and ever changing game world awaits you. The map of Western Europe is complete with nearly 200 towns and hamlets. The towns are enormous and hand-crafted historical reproduction of actual medieval towns. And last, but not least, you can also expect… Dynamic weather and season changes effecting the gameplay Social component to the grand campaign – with chat and other social features Over 30 units and siege weapons, unique for each nation Wonderful music, using real musical instruments Powerful World Editor and other modding tools Free updates for months after launch Rare indie production value, with the game created by only 3 developers Real time in-game help from volunteer Mods and Developers …and so much more awaits you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/499660/header.jpg?t=1658346742",
    "Price": 19.99,
    "Developers": "Reverie World Studios",
    "Publishers": "Reverie World Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/499660/ss_140d368f470eb5c823f25bb7fcfad84394072f46.1920x1080.jpg?t=1658346742,https://cdn.akamai.steamstatic.com/steam/apps/499660/ss_bee46ff426c92fecd8dd018adf2521af55296ecb.1920x1080.jpg?t=1658346742,https://cdn.akamai.steamstatic.com/steam/apps/499660/ss_72c3e28d0f15f3fbfe87a478740bda1dd4e68abc.1920x1080.jpg?t=1658346742,https://cdn.akamai.steamstatic.com/steam/apps/499660/ss_43afb0ac1310bfd66d62f43656cee22a55c20ce9.1920x1080.jpg?t=1658346742,https://cdn.akamai.steamstatic.com/steam/apps/499660/ss_e938363dc54c3e40ec0b8fe8b2930504cbfdc738.1920x1080.jpg?t=1658346742,https://cdn.akamai.steamstatic.com/steam/apps/499660/ss_3de1df61ec484c31e56e910f04a835bf0a615fd6.1920x1080.jpg?t=1658346742,https://cdn.akamai.steamstatic.com/steam/apps/499660/ss_4eabcdefb63fc00921bc95fd37ca4a154d782994.1920x1080.jpg?t=1658346742,https://cdn.akamai.steamstatic.com/steam/apps/499660/ss_6d9f0e45eb7bc4c85392a38b84260f97236f97f9.1920x1080.jpg?t=1658346742,https://cdn.akamai.steamstatic.com/steam/apps/499660/ss_140fc3d605e9879ba943af2cf762c8361d21c7a9.1920x1080.jpg?t=1658346742,https://cdn.akamai.steamstatic.com/steam/apps/499660/ss_ac2436cf9508cedb4600811889e48462f19fcbd4.1920x1080.jpg?t=1658346742,https://cdn.akamai.steamstatic.com/steam/apps/499660/ss_4c37fc9a5d4fd4f6d90a76ab28cbda6fccdf341d.1920x1080.jpg?t=1658346742",
    "Slug": "medieval-kingdom-wars",
    "Meta Title": "Medieval Kingdom Wars: Jan 3, 2019, Reverie World Studios...",
    "Meta Description": "Looking for information on Medieval Kingdom Wars? Check out the release date (Jan 3, 2019), developer insights from Reverie World Studios, and a complet...",
    "Alt Text Image": "Official header image for Medieval Kingdom Wars game - Steam 499660",
    "Canonical URL": "https://gusku.site/game/medieval-kingdom-wars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Medieval Kingdom Wars\", \"description\": \"Looking for information on Medieval Kingdom Wars? Check out the release date (Jan 3, 2019), developer insights from Reverie World Studios, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 3, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Reverie World Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Reverie World Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/499660/header.jpg?t=1658346742\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}