{
    "AppID": 669050,
    "Name": "Mutiny!!",
    "Release date": "Oct 20, 2017",
    "About the game": "Mutiny!! is set in a world of fantasy, and adventure. A realm where airships can sail among the clouds as well as the sea, entering the flogiston to journey to other planes. There’s treasure spread out over many planes if you’re brave or curious enough to find it! At the bottom of the sea or within mysterious ruins, protected by curious animated guardians. The world of Mutiny!! is in every way ‘fun’, silly and sexy as you imagine! Everything begins with you sat at a table, adjusting your clothes and blowing a kiss to the cute little Fairy you’d spent the afternoon with. The ‘Captain’ comes in; a haggard and tired figure. Still, they might make for some interesting company, seeing as how captains have ships, money, and go on exciting adventures. It becomes readily apparent that she’s on her last legs, announcing that the Pirate life is hard, and her luck is drained to the final dregs. The Navy is on her tail, and her ship is being scuttled with debt. Of course, you’re happy to offer a little ‘Stress Relief’, but she confesses she hasn’t a penny to her name. Hell— she probably couldn’t find gold in a chest. You sigh and shrug; you’ve always been particularly lucky. The Captain seems awfully enticed at the whole prospect of some life-changing luck. The little conversation is brought to a screeching halt by the sound of Navy boots stomping their way through the building next door. Not an issue to you of course, but the ‘Captain’ seems to be missing some facial coloration all of a sudden. Then with a snap of her fingers, she’s up and out of her seat with a brand new purpose, tossing her hat onto your head. “Must be fate!” she announces pleasantly, and while you’re still trying to figure out what’s going on, her jacket is thrown over your shoulders. There’s a scampering, a yelping of alarm from one of the patrons, and then silence. Once you’ve got the hat off from over your eyes, the ‘Captain’ is nowhere to be seen. Skipping past the Navy isn’t an issue for you, and the real culprit is long gone. Nothing for it but to find this woman’s ship and get things sorted out. … Or at least give back the hat and jacket… despite how totally cool they are. Once you get there, you find a mismatched crew of helplessly inept girls who weren’t even a hundred percent sure they were pirates the whole time. The crew announce that it’s unlikely the ‘ex-captain’ is coming back. She gave over the hat and jacket after all! That’s all it takes; its proof! You scoff at the ridiculousness of it all, intending to drop the hat onto one of the girl’s heads. She gasps and scrambles away, begging you not to put that evil on her. It takes you a while to come to terms with it all, but it seems you’re in charge now! First step, re-name the ship. Second step? Find a way out of debt. Third step? … We’ll figure it out somehow. Key Game Features • 11 unique girls to encounter • A long, sprawling campaign story comprises the main game • 2 free additionaly character side-stories are included with the game, with more adventures and side-stories to come after launch! • 12 different locations • Puzzle-solving minigames, and ship combat • Monster Girl romance • Different social options shape your relationships and ending • Visual Novel style interactions • Charming music and sexy, glamorous art • DRM Free • Windows, Mac, and Linux",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/669050/header.jpg?t=1513925607",
    "Price": 9.99,
    "Developers": "Lupiesoft",
    "Publishers": "Lupiesoft,MangaGamer",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/669050/ss_cfed9e14cfd08ca24afaaa9354a83f28ed9db8c1.1920x1080.jpg?t=1513925607,https://cdn.akamai.steamstatic.com/steam/apps/669050/ss_1a8dcc4c8abc1585abc01aeb213ab50bcd7fb60e.1920x1080.jpg?t=1513925607,https://cdn.akamai.steamstatic.com/steam/apps/669050/ss_dfda4f3e6cd46e409058ba821aa542e1b16a5d22.1920x1080.jpg?t=1513925607,https://cdn.akamai.steamstatic.com/steam/apps/669050/ss_cc5fbc940b7a49c072832c1f8d7ce0471bc51528.1920x1080.jpg?t=1513925607,https://cdn.akamai.steamstatic.com/steam/apps/669050/ss_9398ecc43f76901c5d91cdaa9c64d141078e33e5.1920x1080.jpg?t=1513925607,https://cdn.akamai.steamstatic.com/steam/apps/669050/ss_0c306b566695bb380b8a54ca8c4c65d1ae40fc18.1920x1080.jpg?t=1513925607,https://cdn.akamai.steamstatic.com/steam/apps/669050/ss_a6ca009876a70ab15fed1ea8297882df454583d6.1920x1080.jpg?t=1513925607,https://cdn.akamai.steamstatic.com/steam/apps/669050/ss_95c75db9f3dc13c99ddc0a5bb568ee6615668219.1920x1080.jpg?t=1513925607,https://cdn.akamai.steamstatic.com/steam/apps/669050/ss_592078513bafbcc712b4b254fb73361273124300.1920x1080.jpg?t=1513925607,https://cdn.akamai.steamstatic.com/steam/apps/669050/ss_632202323087a3845e6866c730901329a753a05e.1920x1080.jpg?t=1513925607,https://cdn.akamai.steamstatic.com/steam/apps/669050/ss_1b1d5c612ff1d0412c6be07050959741b4714fbc.1920x1080.jpg?t=1513925607",
    "Slug": "mutiny",
    "Meta Title": "Mutiny!!: Oct 20, 2017, Lupiesoft and Full Overview",
    "Meta Description": "Looking for information on Mutiny!!? Check out the release date (Oct 20, 2017), developer insights from Lupiesoft, and a complete game summary.",
    "Alt Text Image": "Official header image for Mutiny!! game - Steam 669050",
    "Canonical URL": "https://gusku.site/game/mutiny",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mutiny!!\", \"description\": \"Looking for information on Mutiny!!? Check out the release date (Oct 20, 2017), developer insights from Lupiesoft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lupiesoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lupiesoft,MangaGamer\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/669050/header.jpg?t=1513925607\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}