{
    "AppID": 1891300,
    "Name": "Pic Fed Evolution",
    "Release date": "Mar 12, 2022",
    "About the game": "The genesis of pic fed evolution is here with the digital wrestling figure sandbox. As a wrestling content creator, I wanted to create a system to make the pic fed process easier and more modular. This tool attempts to evolve this traditional practice into a digital experience. This experience makes it easier, more convenient, faster, and cleaner to create wrestling pic feds than ever before. Along with that, the creation suite allows you to create your own custom figures, scene props, and even scene layouts. Build your way! This tool is an all encompassing system to do the following: Create digital action figures Create custom props to use in figure staging Create custom setups for figure staging Take high quality digital images for your Action Figure fed As this tool is in the infancy stages, I crave your feedback to make it a deeper experience. Figure Creator This tool fails to exist without this mode. The single most important aspect of pic fed, is the assortment of action figures in your collection. The figure creator allows you to build your custom figures out to your liking. The system is equipped to allow you to build a figure by morphing the head sculpt and adjusting the colors of the assets. You can also take this a step further by importing your own custom figure parts and custom textures. Use this to bring in your own head sculpts, body parts, and attires and simply disable the body parts you no longer want to see. Once created, these figures can be used in your scenes to pose to your delight. Prop Creator The Prop Creator is used to craft custom variations of built-in 3D models. Use this to create your own ring, printouts, stage elements, crowd panels and more. I wanted to give you a good amount of flexibility here thus, you can import your own images for many of the assets. Once created, these props can be placed around your setup to your heart’s desire. Instances of the props are all connected. Therefore, changing the designing on one will alter all instances in use! Setup Creator This is the fun part for me! The setup creator allows you to build your fantasy stages or replicate real arenas. Take your custom props and place them all of the place. Hang pictures on the walls, place 10 rings in your setup, and more! These setups are then available to be used in the Scene Creator mode to spruce up the backgrounds or foregrounds or your images. Scene Creator This is the primary system that you will be using in Pic Fed Evolution. Scene creator is your spot to pose and frame your images. This system uses a combination of Figures, Props, and a Setup for your environment. The premise is simple: Choose an environment setup Choose figures to be in your scene Create a frame Pose your figures Place the camera Update the frame “Rinse and repeat” Once you’ve gotten all of the frames that you want captured, you can either screenshot each frame individually or screenshot them automatically. There are some quality of life features included to help out your process such as Duplicating, Cycling, and Deleting frames as well. The upcoming Steam Workshop integration will be used to share custom figures, props, and setups with the community to expedite your growing collection and enhance your pipeline",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1891300/header.jpg?t=1647127410",
    "Price": 14.99,
    "Developers": "Shannon Williams",
    "Publishers": "Shannon Williams",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1891300/ss_6193353e61b129363b1e19e8b2cafd990dbfdad7.1920x1080.jpg?t=1647127410,https://cdn.akamai.steamstatic.com/steam/apps/1891300/ss_78246117e3eb5269ed4c9d8e138c4643a02a5e79.1920x1080.jpg?t=1647127410,https://cdn.akamai.steamstatic.com/steam/apps/1891300/ss_7ecbe640cad71349fe6b69ebee98a53c443721ac.1920x1080.jpg?t=1647127410,https://cdn.akamai.steamstatic.com/steam/apps/1891300/ss_ca71ef2955308255f62f9a45a2f4ebdc491ceb12.1920x1080.jpg?t=1647127410,https://cdn.akamai.steamstatic.com/steam/apps/1891300/ss_9fa40044e1f3263b4216f17a6fdf479f599e2ecb.1920x1080.jpg?t=1647127410,https://cdn.akamai.steamstatic.com/steam/apps/1891300/ss_e610842c300d424c6c3e3e94f304d1589361ab4e.1920x1080.jpg?t=1647127410,https://cdn.akamai.steamstatic.com/steam/apps/1891300/ss_c5d87b6228848bd2c1ee321aa35506811f463f38.1920x1080.jpg?t=1647127410",
    "Slug": "pic-fed-evolution",
    "Meta Title": "Pic Fed Evolution: Mar 12, 2022, Shannon Williams and Ful...",
    "Meta Description": "Looking for information on Pic Fed Evolution? Check out the release date (Mar 12, 2022), developer insights from Shannon Williams, and a complete game s...",
    "Alt Text Image": "Official header image for Pic Fed Evolution game - Steam 1891300",
    "Canonical URL": "https://gusku.site/game/pic-fed-evolution",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pic Fed Evolution\", \"description\": \"Looking for information on Pic Fed Evolution? Check out the release date (Mar 12, 2022), developer insights from Shannon Williams, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Shannon Williams\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shannon Williams\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1891300/header.jpg?t=1647127410\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}