{
    "AppID": 636580,
    "Name": "Primal Reign",
    "Release date": "May 29, 2017",
    "About the game": "Setting the scene It’s World War Two, and you’re in Egypt taking back lands claimed by the Nazis. You’re exploring an ancient Egyptian Chamber when you stumble upon a Nazi experiment in time travel gone wrong. The time gate has gone into reverse, pulling primal beasts from the past into the present. And your pal Tommy has been dragged through the portal. WTF? Play in VR and take on the role of Archie – one of the soldiers fighting for his life from the waves of marauding beasts, and struggling to save his friend. Battle the beasts with a WW2 submachine gun and as much ammo as you need in a frantic fight to the death, as you try to survive on limited health. But beware – the enemy can appear from anywhere around you and you’re their next tasty meal! With more content, levels and episodes to be added soon, this base version of the game will get you ready for the fight to come… Current Minimum PC Specs The current minimum specifications are based on our limited tests at ImmersiveVR, if you find it plays on your machine, which is a lower specifcation then the minimum, let us know! Development For us at ImmersiveVR, this has been a bit of fun we’ve been having in between our client projects. What started out at as a quick experiment in AI, turned into the chance to make a really fun, arcade-like and slightly wacky (Nazis, dinos, tombs anyone?) VR shooter game. There’s a few things we’ve put into this game that we are yet to see being done for a ground up VR game, such as cutscenes. Plus there are elements we plan to add that we feel will stand out from other games, such as the player seeing their character’s demise, without the nausea that VR can sometimes cause! And hopefully Primal Reign ups the quality expectations of VR games in terms of visuals, while keeping it fun and light-hearted. Features The game currently has a few simple features: 10 increasingly difficult waves or hordes of enemies trying to kill you 1 World War Two era sub-machine gun and access to a currently unlimited supply of magazines An ancient sword to defend yourself with 1 Word War Two era Fully Automatic Rifle and access to a currently unlimited supply of magazines Grenades! Some witty banter A teleporter to move you around the game The goal? To survive the waves and escape the ruins through the portal. If you fail? We’ll leave that up to the bad guys. Going Forward If this does really well both in the Steam Store, we’ll make more levels, different settings, different bad guys – the full works – and release an even bigger game. Is there any more to this game? This game is always evolving. We will constantly add, remove (remove less then we add!), change and update this game as we think of cool things to do with it, as well as respond to player feedback. We do plan to integrate more and more with Steam, by adding achievements and leader boards, so watch this space. Currently, there is just one level but if there’s interest for this sort of casual, arcade VR game – and this one in particular – we’ll design and add more levels. One last thing - building VR games has its challenges and there are a lot of limitations on what you can and can’t do – some of the visual limitations are the equivalent to game engines from 5-7 years ago! You’ve got to keep the polygon count as low as possible, keep lighting as simple as possible, and much more. All this means being inventive with the technology at hand and super-optimisation. Currently, VR games can’t have the graphics fidelity of a non-VR AAA FPS game. On our to-do list is working out the best optimisations so it looks great, plays great, but plays on as many VR rigs as possible. We do hope you enjoy our game, and hope you get it and allow us to share the fun..",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/636580/header.jpg?t=1497879442",
    "Price": 0.0,
    "Developers": "Immersive VR Limited",
    "Publishers": "Immersive VR Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/636580/ss_f19fafc39e89e9eccb7401fae291fab38856d57b.1920x1080.jpg?t=1497879442,https://cdn.akamai.steamstatic.com/steam/apps/636580/ss_9d59947ee412575bac428e6574928ca85e730e82.1920x1080.jpg?t=1497879442,https://cdn.akamai.steamstatic.com/steam/apps/636580/ss_b8d47a274902dc5a5b94bc7d2f851b05bc01a279.1920x1080.jpg?t=1497879442,https://cdn.akamai.steamstatic.com/steam/apps/636580/ss_2b7f6743ad9ea111a39d8ded790da55285f9c654.1920x1080.jpg?t=1497879442,https://cdn.akamai.steamstatic.com/steam/apps/636580/ss_4d1c3e97e025154a0410629c62c700c41a58ddc2.1920x1080.jpg?t=1497879442,https://cdn.akamai.steamstatic.com/steam/apps/636580/ss_a725b3ec974da2dcb4d51f0afa0d793ead0ff85f.1920x1080.jpg?t=1497879442,https://cdn.akamai.steamstatic.com/steam/apps/636580/ss_bd3efc257313d52329cafb11ff5d367b5a358c91.1920x1080.jpg?t=1497879442,https://cdn.akamai.steamstatic.com/steam/apps/636580/ss_d38f07a5d970b0389c655736e4f46aa09d8d07f7.1920x1080.jpg?t=1497879442",
    "Slug": "primal-reign",
    "Meta Title": "Primal Reign: May 29, 2017, Immersive VR Limited and Full...",
    "Meta Description": "Looking for information on Primal Reign? Check out the release date (May 29, 2017), developer insights from Immersive VR Limited, and a complete game su...",
    "Alt Text Image": "Official header image for Primal Reign game - Steam 636580",
    "Canonical URL": "https://gusku.site/game/primal-reign",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Primal Reign\", \"description\": \"Looking for information on Primal Reign? Check out the release date (May 29, 2017), developer insights from Immersive VR Limited, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 29, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Immersive VR Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Immersive VR Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/636580/header.jpg?t=1497879442\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}