{
    "AppID": 1404660,
    "Name": "Psych",
    "Release date": "Sep 10, 2021",
    "About the game": "Psych is a psychological horror thriller with a big focus on a suspenseful, hand-written story and an unforgettable atmosphere . Through unique, self-developed systems, Psych offers a new and innovative gaming experience that will not be forgotten. The open world invites you to explore, if you dare. Every corner of the park is filled with stories, puzzles or secrets to uncover. However, the biggest mystery is what happened on the day of the accident with Alex. While the main story has a few ways to unravel the mysteries, the side stories also provide plenty of clues and information. Psych is divided into 5 chapters that advance the story immersively, without the player noticing. The customized and countless sound effects will give you goosebumps after goosebumps. With Psych we want to create real horror , a game that will shake up the horror genre. Here in detail the main features of Psych: An emotional, thrilling and unforgettable main story divided into 5 chapters. Plenty of side stories, puzzles and secrets to uncover A mysterious and dark atmosphere you won't forget Consequences based on your decisions A dynamic and interactable world to explore A custom made system to experience horror in a new way A dozen of goosebump-inducing sound effects Realistic, modern and stunning graphics Average play time of the current version: 2h 30m Planned play time of all chapters: 3 hours You are a murderer. You, Alexander Green, are a goddamn murderer. Now you're finally out of the asylum, and what have you learned from it? Not a damn thing! That your guilt is chasing you into your dreams is something you deserve. You shouldn't even be alive. Look at you, a hopeless man, wandering the streets, without any sense of life. What do you want to do now? Do you want to run away or face your own enemy, yourself? Experience the story of Alexander Green and find out what happened on the day of the accident. Follow the development of Alex, solve puzzles around the event and try not to fall into madness. Nothing is as it seems. Something or someone is following you. You must always be on your guard and be prepared for possible dangers. Especially at night, it can be quite dangerous when you see things you'd rather not see. Unstoppable tension. Not a minute will pass when you can feel safe. New clues will keep coming up and will tempt you to take another step. No step is like the other and leads to ever new exits. Scary horror atmosphere at every step of the game will make you fear. Whether you are prepared for it or not. There is no one who will not be afraid here. Self-developed systems that control the horror and your state of mind bring a new, intuitive and exciting way to play this psychological horror thriller. A small pinch of coincidence to the emotional and harrowing story of Psych brings each player a personalised gaming experience that can differ from time to time. Dozen side stories, puzzles and secrets to discover in the open world of Psych. Each with its own unique story that will captivate you. Goose-pimple sound effects will send a cold shiver down your spine. If you think that you have already seen and, above all, heard everything, you will be mistaken. There are so many tailor-made sound effects, perfectly tuned to the atmosphere, that will take your breath away again and again. Fascinating graphics through modern technology and a little bit of dexterity, additionally provides the right thrill while playing and takes you on an unforgettable journey through the world and story of Alexander Green.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1404660/header.jpg?t=1658343047",
    "Price": 9.99,
    "Developers": "MediaTale",
    "Publishers": "MediaTale",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_8d9a4b2478dac8ec88059b335463031c561ef374.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_b43c9110b2a1695831e422f84e2cec3c9c4f33a3.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_90003555e2d4f21d772f1326bb5b942c57016ae5.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_2d562e6cf17083c3cdeea667f2ed3c24002bca17.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_8afe4f44ce32c0e19141c2ab4c802daca4d5783c.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_ba5d61378c2151353edd736ffed8baccde8fae0d.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_54e9bdac5e29c5efffb6acde2e745f5d3489aedc.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_ce3b5191e0a9c2c7b216a17668ed2889533a0112.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_096b99f2f77a98281bf69ad7145c43b47453ffde.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_91da7f05648183dfbada81675324d11ca71c211d.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_3692292379d14afbc2fabdde0e5f0d31ff151d9f.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_ca3128ea1d5546cbf892b23f83fb95706fa227c8.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_01dd5bc4754c17011e45dd52763cd80c5f12b787.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_d4e89dc5a4df365ab7c2d26744f1196b320a3b5c.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_c2dfd4bd6ba473012ef0e2958b018b5e28063c9b.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_2a018985e452a39400dd31139faa20a3ea79aae4.1920x1080.jpg?t=1658343047,https://cdn.akamai.steamstatic.com/steam/apps/1404660/ss_fb187a0ce2ab77abf6beb0aeab338b44d58ccc80.1920x1080.jpg?t=1658343047",
    "Slug": "psych",
    "Meta Title": "Psych: Sep 10, 2021, MediaTale and Full Overview",
    "Meta Description": "Looking for information on Psych? Check out the release date (Sep 10, 2021), developer insights from MediaTale, and a complete game summary.",
    "Alt Text Image": "Official header image for Psych game - Steam 1404660",
    "Canonical URL": "https://gusku.site/game/psych",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Psych\", \"description\": \"Looking for information on Psych? Check out the release date (Sep 10, 2021), developer insights from MediaTale, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"MediaTale\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MediaTale\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1404660/header.jpg?t=1658343047\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}