{
    "AppID": 1161650,
    "Name": "Sakura Gamer 2",
    "Release date": "Dec 12, 2019",
    "About the game": "A year has passed since the events of Sakura Gamer. Nekohime and her friends have since released their debut visual novel, MikoMaid, to great success. With an even bigger budget than before, and a rapidly growing fanbase, Nekohime sets out to make and sell a hotly anticipated sequel: MikoMaid 2. Unfortunately, every silver lining has a cloud. MikoMaid’s acclaim was by no means universal, and the negative press the first title garnered is staring to get our heroine down. Nekohime’s self-confidence begins to flag, and she soon starts to doubt all her life choices. Was it a mistake to become a visual novel writer? Maybe she should’ve stayed a computer repair technician instead! Nekohime’s doubts are further compounded when she runs into Kurumi, a hot-headed young woman who despises MikoMaid (and lewd visual novels in general). What will Nekohime do?! Will she be able to maintain her bonds with her close companions and fellow developers, Suki and Clover? Can she overcome her own crippling self-doubt? Will MikoMaid 2 be just as popular as its predecessor… Otherwise known as Sayo, Nekohime is the heroine of this story. Anxious, asocial, and prone to self-doubt, she’s a shut-in in the making. If not for her friends, she might have turned her back on society already. She’s well aware of her flaws, and she’s working hard to improve both herself and her (admittedly shoddy) writing. Do your best, Nekohime! You can do it! Otherwise known as Chika, Clover is Nekohime’s long-time friend and stalwart supporter. Based on your choices in Sakura Gamer, she can also be something more. Clover is a spunky, cheery, no-nonsense kind of gal, and though she might seem ditzy, she’s surprisingly good at giving life advice. Reliable in a crisis, she’s always there when you need her! You can count on Clover! Otherwise known as Tsukiko, Suki is a relatively new addition to Nekohime’s life. It was all thanks to Suki’s ambitions that Nekohime and Clover found themselves roped into making visual novels in the first place. Suki’s an aspiring artist, and she works insane hours on her pieces every single day. When work’s over for the day, however, she loves having fun. She has a mischevious streak, and she particularly likes teasing pretty girls. Kurumi is a brand new character in the Sakura Gamer universe, and she acts as an antagonist towards our three main girls. Brash and short-tempered, Kurumi hates MikoMaid with a passion that seems almost personal. She makes quite a poor first impression, but at least she wears cute panties!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1161650/header.jpg?t=1587984142",
    "Price": 9.99,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1161650/ss_df9027c2863e7cb664e0a90e6d5ea5a569839d19.1920x1080.jpg?t=1587984142,https://cdn.akamai.steamstatic.com/steam/apps/1161650/ss_ba03afb437f093089640f6e268883a9662b12e95.1920x1080.jpg?t=1587984142,https://cdn.akamai.steamstatic.com/steam/apps/1161650/ss_8403fec564317088e0e7e4441f9a848e98a285c0.1920x1080.jpg?t=1587984142,https://cdn.akamai.steamstatic.com/steam/apps/1161650/ss_d2bf0aa1b7e8a322346d88cd2d2496e3897eebd2.1920x1080.jpg?t=1587984142,https://cdn.akamai.steamstatic.com/steam/apps/1161650/ss_1fa74c83dfaddb039692a8ccfe4ef98f1fb38930.1920x1080.jpg?t=1587984142,https://cdn.akamai.steamstatic.com/steam/apps/1161650/ss_e04db3b06f3a37ed68743260f40583c30d9a3f56.1920x1080.jpg?t=1587984142,https://cdn.akamai.steamstatic.com/steam/apps/1161650/ss_e635b596c51d84743a1131883798f60e7e30dda6.1920x1080.jpg?t=1587984142,https://cdn.akamai.steamstatic.com/steam/apps/1161650/ss_9655bcb6b7ffe0c0f206aefd441fe23c8dba3bf1.1920x1080.jpg?t=1587984142",
    "Slug": "sakura-gamer-2",
    "Meta Title": "Sakura Gamer 2: Dec 12, 2019, Winged Cloud and Full Overview",
    "Meta Description": "Looking for information on Sakura Gamer 2? Check out the release date (Dec 12, 2019), developer insights from Winged Cloud, and a complete game summary.",
    "Alt Text Image": "Official header image for Sakura Gamer 2 game - Steam 1161650",
    "Canonical URL": "https://gusku.site/game/sakura-gamer-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura Gamer 2\", \"description\": \"Looking for information on Sakura Gamer 2? Check out the release date (Dec 12, 2019), developer insights from Winged Cloud, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1161650/header.jpg?t=1587984142\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}