{
    "AppID": 1917870,
    "Name": "STAY ALIVE",
    "Release date": "Jun 8, 2022",
    "About the game": "Are you ready to travel to the mysterious island that you discovered on your way to Siberia? But what awaits you, not on the map, not on GPS, this island has not been subsidized anywhere. Can you still leave this island as soon as possible? The right decision! But will you be able to survive? LEARN You are a typical average journalist, hungry for sensationalism. Finally, for such a long period of work, you are assigned a major report related to multiple forest fires in Siberia. But during the preparation for the trip, a strange series of events happens, after which you find yourself on an unknown island with dense forests in an unknown way. What kind of adventure without horror? That's right, no! Every night, and not only on the island, strange creatures wake up who want to feast on you. Oh no, they're in trees, they're behind rocks, they're behind a rock or behind a house, they're everywhere! How can I be saved? Explore the island, adapt and use everything you find on the island in order to survive elementary. The main thing to remember is that monsters are afraid of fire, right? Mysterious signal towers that stand all over the island, why are they and for whom are they? I wonder what kind of strange military base, maybe it's worth exploring? Find chests with a unique loot that will help you get off the island or at least not die in the first days! OPEN WORLD A beautiful world covered with secrets! At first glance, a pretty little island with interesting landscapes and a fascinating sunset. What could be better? But unfortunately, every night the 'cute and beautiful' island turns into a cage surrounded on all sides by water with an abnormally fast current. A cage where every wrong decision or step will lead to incredible pain, and maybe even death. SHALL WE TRY TO SURVIVE? Fortunately, an interesting fauna is attached to the 'cute and beautiful' island, which will help you survive. Collect and get items and food for basic survival. Never forget your backpack, because it can be stolen. Learn to hide from enemies with the help of local flora to escape. If you see a person in a military uniform or in strange clothes, then you can try to talk to them, but we are not sure that this is the best solution. Your only friend is a bonfire. Do not forget to feed him, otherwise it will be bad all alone, in the dark and surrounded by monsters. You may be an electrician, but that's not for sure. Why? Well, you know how to set up towers for communication and improve communication on your phone. From time to time you will get bored, use the phone to entertain yourself somehow. BRAND NEW TECHNOLOGIES At the head of the graphics process is the latest Unreal Engine 5. Which allows you to achieve high performance without loss of image quality. The unique Lumen system allows you to recreate fully dynamic lighting and high-quality reflections in the water and not only. And the Nanite system allows you to use highly detailed models in the game, without loss of performance and quality.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1917870/header.jpg?t=1658159420",
    "Price": 19.99,
    "Developers": "Mad Games Company",
    "Publishers": "Mad Games Company",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1917870/ss_54f98b73998e8e8a075d3b7e2085eb6ae0702a5e.1920x1080.jpg?t=1658159420,https://cdn.akamai.steamstatic.com/steam/apps/1917870/ss_a5dca6ff514d68582e8180cefdc6e94b7543e4c2.1920x1080.jpg?t=1658159420,https://cdn.akamai.steamstatic.com/steam/apps/1917870/ss_a439496670e44257fb2906d1e7f6fc2a3e8fdb36.1920x1080.jpg?t=1658159420,https://cdn.akamai.steamstatic.com/steam/apps/1917870/ss_9efa0baadb74582ecc31a65082ba914466a5401c.1920x1080.jpg?t=1658159420,https://cdn.akamai.steamstatic.com/steam/apps/1917870/ss_7fd63b4dccc29e0f59be420d34440a4c6cd046ce.1920x1080.jpg?t=1658159420,https://cdn.akamai.steamstatic.com/steam/apps/1917870/ss_f9ab66d27730aa2fa94b108dd8dc11bc8b5fb5b3.1920x1080.jpg?t=1658159420,https://cdn.akamai.steamstatic.com/steam/apps/1917870/ss_7c5bad467ed38e2dd1cc70de6c0a4d5e188d94fc.1920x1080.jpg?t=1658159420,https://cdn.akamai.steamstatic.com/steam/apps/1917870/ss_b699ca8bdec85387781dcdb2fabaae2423e09570.1920x1080.jpg?t=1658159420,https://cdn.akamai.steamstatic.com/steam/apps/1917870/ss_11079ef2bbab7e8b8c9761c54fe476ea4b9ef129.1920x1080.jpg?t=1658159420,https://cdn.akamai.steamstatic.com/steam/apps/1917870/ss_7810fa22a0963b9603fc137123e9fb46aeea53bb.1920x1080.jpg?t=1658159420",
    "Slug": "stay-alive",
    "Meta Title": "STAY ALIVE: Jun 8, 2022, Mad Games Company and Full Overview",
    "Meta Description": "Looking for information on STAY ALIVE? Check out the release date (Jun 8, 2022), developer insights from Mad Games Company, and a complete game summary.",
    "Alt Text Image": "Official header image for STAY ALIVE game - Steam 1917870",
    "Canonical URL": "https://gusku.site/game/stay-alive",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"STAY ALIVE\", \"description\": \"Looking for information on STAY ALIVE? Check out the release date (Jun 8, 2022), developer insights from Mad Games Company, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mad Games Company\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mad Games Company\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1917870/header.jpg?t=1658159420\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}