{
    "AppID": 1522870,
    "Name": "Supraland Six Inches Under",
    "Release date": "Jan 14, 2022",
    "About the game": "Supraland Six Inches Under is a First-Person-Metroidvania. That means, you're in a gated world and the more abilities you gather, the more parts of the world you can access. - You don't need to have played other Supraland games before you play this - The gameplay consists of roughly 55% exploration, 40% solving puzzles and 5% combat. - The adventure will take between 8-20 hours. - Has absolutely zero skilltrees - Hundreds of gags - 2 funny gags Compared to the first Supraland game: - Half of the player abilities are the same, the other half is new - The puzzles are simpler in the main path; hard puzzles are mostly optional - There is less combat and all enemy types are new - Much more optional content, a lot of it only accessible after the credits - Almost all music was tailor made for the game while the first Supraland was using inexpensive, licensed music - The credits roll a few hours earlier than in the first game but there is much more significant endgame content The story behind the game 'Six Inches Under' was a little sideproject that was established to introduce new dev team members to our tools and workflow. Essentially it's our preparation for the sequel to Supraland. While David Münnich made the first Supraland game pretty much alone, he had a smaller role in this one. The core team for this one had 6 people. Pretty much everyone on team built 1 or 2 regions of the game world and in that sense it is very experimental. It was supposed to be a little DLC for Supraland , but it got a bit out of hand and got more and more ambitous. Instead of 3 months it took us 27 months to make this (Supraland 1 was in development for 16 months). It can be considered 'Supraland 1.5' because there are still a lot things from the first game, but at the same time it's a new world with a bunch of new mechanics. Combat: If you're a fan of the first Supraland you might be interested in the approach to combat in this new game. After having learned a lot of lessons, the core concept was changed a lot and can still be considered experimental. We will surely learn some more lessons from this one for the next game. The enemies are now much more separated from puzzles and won't get in your way there. The all new enemy types behave much more different from each other and there is no more one-fits-all solution to them. Hope you like it!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1522870/header.jpg?t=1651690822",
    "Price": 19.99,
    "Developers": "Supra Games UG",
    "Publishers": "Supra Games UG",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1522870/ss_f358dc1a938d2aebaa56702d3320cc2378f93189.1920x1080.jpg?t=1651690822,https://cdn.akamai.steamstatic.com/steam/apps/1522870/ss_c33aef415b817a45a3cb6733e0e7f33e4d86a10c.1920x1080.jpg?t=1651690822,https://cdn.akamai.steamstatic.com/steam/apps/1522870/ss_b919327496f8bf0272098c2206e1f54bcf0c7767.1920x1080.jpg?t=1651690822,https://cdn.akamai.steamstatic.com/steam/apps/1522870/ss_e12606a60071b003afc953e41ace5f8aec83d5f2.1920x1080.jpg?t=1651690822,https://cdn.akamai.steamstatic.com/steam/apps/1522870/ss_094ee7ad6747f7c10431cb8db7494f9e090b17e5.1920x1080.jpg?t=1651690822,https://cdn.akamai.steamstatic.com/steam/apps/1522870/ss_766e10f86c2a52377f4e595f02ac90dbb3de6b91.1920x1080.jpg?t=1651690822",
    "Slug": "supraland-six-inches-under",
    "Meta Title": "Supraland Six Inches Under: Jan 14, 2022, Supra Games UG ...",
    "Meta Description": "Looking for information on Supraland Six Inches Under? Check out the release date (Jan 14, 2022), developer insights from Supra Games UG, and a complete...",
    "Alt Text Image": "Official header image for Supraland Six Inches Under game - Steam 1522870",
    "Canonical URL": "https://gusku.site/game/supraland-six-inches-under",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Supraland Six Inches Under\", \"description\": \"Looking for information on Supraland Six Inches Under? Check out the release date (Jan 14, 2022), developer insights from Supra Games UG, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Supra Games UG\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Supra Games UG\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1522870/header.jpg?t=1651690822\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}