{
    "AppID": 1424980,
    "Name": "The Solitaire Conspiracy",
    "Release date": "Oct 6, 2020",
    "About the game": "High Stakes, Highly Powered Protego, the world’s leading spy agency, has been destroyed. Only one person can wield C.A.R.D.S to take control of Protego’s scattered spy crews and save the world. You. Guided by Protego’s only remaining analyst, Jim Ratio (Greg Miller), you must master the unique powers of each crew in a game of tactical Solitaire like none you’ve ever played before. Guide your crews home in a tale of intrigue where nobody can be trusted. Keep your cool in a world of AI spies and cyber-enhanced operators. Once you’ve taken back control of Protego, play infinitely via Skirmish, or test your skills against the clock in Countdown, a survival mode that will test your grasp of the game’s surprising tactical depths. For a new challenge every day take part in the Daily Hotspot leaderboards! Key Features: Five modes and counting makes this the biggest Bithell Short yet! Campaign tells a tightly packed story and introduces the game’s mechanics. For an added challenge, take on Campaign Plus instead, with its turn limits and locked tables requiring optimal tactics. The popular Countdown mode tests your endurance with wave after wave of unique decks. Skirmish gives you an infinite playground to enjoy unlocked crews. And, finally, the Daily Hotspot tosses crews into a new bite-size challenge every day. Beautiful original character artwork and atmospheric design put you at the heart of your own cyberpunk conspiracy. No heightened game of Solitaire would be complete without full FMV cutscenes, featuring Greg Miller and Inel Tomlinson in an original story from the team behind Thomas Was Alone, Volume, Subsurface Circular and John Wick Hex . FREE UPDATE The Return of The Merry adds new cards, new music, and new FMV cutscenes featuring Samantha Béart (North Star Rising, The Hitchhiker’s Guide to the Galaxy - BBC Radio). The soundtrack for your adventures is provided by Jon Everist ( Battletech, Shadowrun: Hong Kong, Shadowrun: Dragonfall ). The game has received several updates since launch with more planned in 2021. FAQs Is this a solitaire game? Yes-ish. The Solitaire Conspiracy is inspired by a variant of solitaire called Streets and Alleys, but with some small adjustments and the big addition of suit based powers. Campaign, Campaign Plus, Daily Hotspots and Skirmish (choose your own suits and powers) are take-at-your-own-pace experiences that fit into your schedule. Countdown mode is a place to test your skills with nuanced powers against a ticking clock. This game is endlessly replayable. Are there microtransactions? Nope. We know we made a card game, and we know that there’s a risk you might think this game will charge you for unlocks, speed bonuses or aesthetics. We won’t. We may come up with a cool DLC at some point, and if so, will probably charge in the traditional way, but we won’t be charging you for double XP or a particularly shiny new colour theme. Is this Bithell Short an entry in the “Circular” series? No. While our previous Bithell Shorts ( Subsurface Circular and Quarantine Circular ) have been twists on the text adventure, The Solitaire Conspiracy is a new take on solitaire. We love storytelling and world-building, so it absolutely contains a full narrative experience, which we’re telling via full-motion video (FMV) and in-game lore. We decided to use the Bithell Short name to signal something digestible and original. Thanks for continuing to support these odd experiments between our larger projects. If this game is ‘short’, what’s to stop me getting a refund when I’m done? The Solitaire Conspiracy is our third Bithell Short (and with continued support from the player base our biggest). Our previous two games, Subsurface Circular and Quarantine Circular , both have a return rate of less than 2%. Steam players have shown us that they understand the work that goes into games, and are up for paying for ones that entertain them. Thank you (again). Do I need to have played other Bithell Shorts games to enjoy this one? Not at all. The Solitaire Conspiracy is an entirely different game from Subsurface Circular and Quarantine Circular . It tells its own self-contained story set in a world of spies and intrigue. Of course, our games are all set in a shared universe, so expect some mentions of old friends.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1424980/header.jpg?t=1623405126",
    "Price": 11.99,
    "Developers": "Bithell Games",
    "Publishers": "Bithell Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1424980/ss_82bd691273fc11e520fc437d09f1a5c0a3d51035.1920x1080.jpg?t=1623405126,https://cdn.akamai.steamstatic.com/steam/apps/1424980/ss_ea7989add5ff365260a87fd33e904e4fc447efc4.1920x1080.jpg?t=1623405126,https://cdn.akamai.steamstatic.com/steam/apps/1424980/ss_8f7d8ad2fdb7baa4061d9887c438d02fef4a628c.1920x1080.jpg?t=1623405126,https://cdn.akamai.steamstatic.com/steam/apps/1424980/ss_182ee0f505df2615cbb4c480d61944732f833e32.1920x1080.jpg?t=1623405126,https://cdn.akamai.steamstatic.com/steam/apps/1424980/ss_aa97d5c43728d3f6a341378c1bb084c0866027fa.1920x1080.jpg?t=1623405126",
    "Slug": "the-solitaire-conspiracy",
    "Meta Title": "The Solitaire Conspiracy: Oct 6, 2020, Bithell Games and ...",
    "Meta Description": "Looking for information on The Solitaire Conspiracy? Check out the release date (Oct 6, 2020), developer insights from Bithell Games, and a complete gam...",
    "Alt Text Image": "Official header image for The Solitaire Conspiracy game - Steam 1424980",
    "Canonical URL": "https://gusku.site/game/the-solitaire-conspiracy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Solitaire Conspiracy\", \"description\": \"Looking for information on The Solitaire Conspiracy? Check out the release date (Oct 6, 2020), developer insights from Bithell Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 6, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bithell Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bithell Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1424980/header.jpg?t=1623405126\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}