{
    "AppID": 825300,
    "Name": "To Trust an Incubus",
    "Release date": "Nov 22, 2018",
    "About the game": "The temp worker Kenta is trapped in a lab with four sexy incubus aliens from another dimension. Kenta dates Incubi, incubi date each other, and even the lab workers can get together! A long gay sci-fi yaoi/bara dating sim loaded with 400 CGs! Kenta, a temp worker, gets a job in a lab that's holding four muscly incubi aliens in quarantine. They came through Professor Raiden's interdimensional portal like several other beings who visited Japan before them. Past interdimensional visitors have warned Professor Raiden about aliens that look just like these ones. They might be ravagers who are scouting Earth to plunder it. The top linguist working for the lab can barely communicate with the incubi. He's figured out they need to bond with someone in order to learn their language. Will Kenta be the one to bond with the incubi? And if so, will he be able to figure out if they're the evil ravagers or some other benign race? A Dynamic, Story-driven Dating Sim with over 150,000 Words Four Routes, 35 Endings, 50 Steam Achievements 24 Original Music Tracks Full Voice Acting from Top Anime and Game Voice Actors Twosome and Threesome Romance Options All Characters Versatile Over 200 Gorgeous CGs Three Unique Mini-Games An Intricate 'Choices Matter' Stats System Will the incubi stay in our world? Will Kenta get a permanent job? Make the right choices to get happily-ever-afters for everyone's endings, or the wrong choices for some magnificently effed-up endings. Sexually explicit art is censored with chibi stickers. If you live in a country that allows adult content you will be able to use a free 'Patch to Uncensor Artwork' in the list of DLC (downloadable Content) of the final game. If you are in one of the 28 countries that ban games with adult content (sorry Australia and Germany) the patch and art book links will not work for you. If we offered it to you our game would be banned in your country. :( Look through the community posts for solutions. Kenta saw the incubi in the news and was fascinated by them. He can't believe he'll get to work with the amazing beings. He's been a temp worker for a while and hopes he can impress Professor Raiden so he'll have a permanent job. Voiced by Kiba Walker (Zoolaplex, Seiyuu Danshi). The interdimensional portal is the result of a lifetime of hard work and dedication by Professor Raiden. He gave up on any chance of serious romance to focus 100% on his discoveries. Voiced by Nathan Matthews (Yaoikuza, Tender Master). Arata has been Raiden's faithful assistant for years. He considers Raiden his senpai...and wonders when he'll notice him. Voiced by Steve Warky Nunez (Final Fantasy XIV: A Realm Reborn, Heroes of Newerth, Yandere Simulator) Harsi came through the interdimensional portal the day after Saji arrived and seems to be looking for him. This rough and tough incubus is nothing but trouble! Voiced by Sean Chiplock (Full Service, Persona 5, Danganronpa V3, Legend of Zelda: Breath of the Wild). Devi came through the interdimensional portal with his leader Vald. Little is known about the incubus, but he seems kind, warm, and gentle. Voiced by Reece Bridger (Fare Thee Well, Bulletville). Saji came through the interdimensional portal a week after Vald and Devi arrived. Though quiet and withdrawn it appears like he's running from someone. Voiced by John Masterson. Vald came through the interdimensional portal with his subordinate Devi. He gives off the cool air of a born leader--or an evil general? Voiced by Terrance Drye (Fare Thee Well, The Braggers Club). Chiyoko’s running the Professor's institute while he's stuck in quarantine. Maybe he'll promote her to be the director one day. Voiced by Lisle Weapon. Also featuring the voice of Michaela Laws (Seduce Me 2: The Demon Wars, War Clash), Cole Feuchter (Camp Buddy), Christopher Escalante (Dungeon Fighter Online, Anima: Gates of Memories), and Elsie Lovelock (The Letter, XOXO Droplets). Other Games from Y Press Games",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/825300/header.jpg?t=1654984139",
    "Price": 19.99,
    "Developers": "Y Press Games",
    "Publishers": "Y Press Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/825300/ss_d350a6fb5aa1b95cb68bdd14070c02b4287d3bd0.1920x1080.jpg?t=1654984139,https://cdn.akamai.steamstatic.com/steam/apps/825300/ss_d58a3b0fd2c39af169a26a5431ddb1d4e5e41307.1920x1080.jpg?t=1654984139,https://cdn.akamai.steamstatic.com/steam/apps/825300/ss_37012c73bbbfb2fdddbe531b9514a54830620acc.1920x1080.jpg?t=1654984139,https://cdn.akamai.steamstatic.com/steam/apps/825300/ss_f9507dbec476719798ee1e5aadede5d74bae72cd.1920x1080.jpg?t=1654984139,https://cdn.akamai.steamstatic.com/steam/apps/825300/ss_f2f26d3444c780a2207d0caa956480ab965d4173.1920x1080.jpg?t=1654984139,https://cdn.akamai.steamstatic.com/steam/apps/825300/ss_c0a9db4eb4104c57105879b05770a9cb49af020c.1920x1080.jpg?t=1654984139,https://cdn.akamai.steamstatic.com/steam/apps/825300/ss_a08898dbe11355f4916e234a28187f254d172ab4.1920x1080.jpg?t=1654984139,https://cdn.akamai.steamstatic.com/steam/apps/825300/ss_14421f92387babbf79df1c6e37c06949ffe9e692.1920x1080.jpg?t=1654984139,https://cdn.akamai.steamstatic.com/steam/apps/825300/ss_284899378e084b286191f74dc5581c42ac3dee23.1920x1080.jpg?t=1654984139,https://cdn.akamai.steamstatic.com/steam/apps/825300/ss_794639c55a7af7b5212a128fd1076dae5d9b81be.1920x1080.jpg?t=1654984139,https://cdn.akamai.steamstatic.com/steam/apps/825300/ss_adac9a3b44d670706c271b8ebf115475af3f2b30.1920x1080.jpg?t=1654984139,https://cdn.akamai.steamstatic.com/steam/apps/825300/ss_fb28c8c59d82250f618b0e89d2c43d867366d7e4.1920x1080.jpg?t=1654984139,https://cdn.akamai.steamstatic.com/steam/apps/825300/ss_ad2ea32e239cb1d714f0ece7fba4a67ec31d32a5.1920x1080.jpg?t=1654984139",
    "Slug": "to-trust-an-incubus",
    "Meta Title": "To Trust an Incubus: Nov 22, 2018, Y Press Games and Full...",
    "Meta Description": "Looking for information on To Trust an Incubus? Check out the release date (Nov 22, 2018), developer insights from Y Press Games, and a complete game su...",
    "Alt Text Image": "Official header image for To Trust an Incubus game - Steam 825300",
    "Canonical URL": "https://gusku.site/game/to-trust-an-incubus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"To Trust an Incubus\", \"description\": \"Looking for information on To Trust an Incubus? Check out the release date (Nov 22, 2018), developer insights from Y Press Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 22, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Y Press Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Y Press Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/825300/header.jpg?t=1654984139\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}