{
    "AppID": 1852000,
    "Name": "[Tongue kissing Specialization] My girlfriend's here for a visit.",
    "Release date": "Feb 25, 2022",
    "About the game": "Let's get squeezed by Mengele girlfriend This work When the player sticks out his tongue, she sticks out hers, too, and they continue to tongue each other. They rub their tongues against our facial movements. They are just saying erotic things and squeezing me a lot. During the act, you can play with only facial movements. Both hands can be free. Also, you can choose from 3 different types of clothes for her. Works in a variety of environments Quest 2 (OculusLink) HtcVive　 All have been tested on actual devices Works on PC desktops. Motion gesture support You can answer her questions by shaking your head. She reacts to various facial movements. If you stick out your tongue, she will move her face closer to you. She will respond to your facial movements. Interlocking with VR controller movement When you tell her to move by herself, the controller is linked to the movement. Vibration function of VR controller If you do not have an electric masturbator, you can use this one. Compatible with electric masturbators Full voice They say lots of naughty things! Compatible with electric onahole Manual operation is also supported During the act, she will move in conjunction with the player's movements by selecting 'Please→Move by myself'. On the PC desktop, she will move with the movement of the mouse, and in VR, she will move with the swing of the controller. Normally, she moves automatically. At this time, an electric onahole and a controller vibrator are interlocked. Only PC, but electric masturbator is supported. It works with Buttpulg compatible devices. Connection is automatic. You can check if the device is connected or not by pressing You can check the number of electric onahole devices connected by increasing or decreasing the number of devices on the menu screen. Operation has been confirmed with A10 Cyclone SA. How to operate 0 VR Controller Hand Trigger' Movement Hand Trigger + Analog Stick' Turn Index Trigger' Selection, hand menu Menu, buttons 1, 2, 3, 4 Menu 0 Hand menu 　After selecting with analog keys, release index trigger to select 0 Motion gestures (common) Vertical face wave Yes Sideways face wave' No 0 Motion gesture (in action) Bow deeply. Stick out tongue. Look away from her, either to the left or right, and then look at her again.　 0 In PC desktop mode Mouse: Viewpoint control, motion gestures Left mouse click' Selection, sticking out tongue Right mouse click' menu Esc' Mouse cursor On/Off SKey' Tongue in and out WKey - Speed up XKey: Speed down AKey, I'm coming. DKey' I like it. About the operation 0 Desktop PC win10GamingPC (can be displayed and played on a monitor) 0 PCVR win10GamingPC Oculus Quest 2 (OculusLink) confirmed to work on actual equipment HtcVive Operation confirmed",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1852000/header.jpg?t=1649201110",
    "Price": 9.09,
    "Developers": "GamesSafu",
    "Publishers": "GamesSafu",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1852000/ss_2da88ee3f54e2c9783153c00f9551a7eaf711522.1920x1080.jpg?t=1649201110,https://cdn.akamai.steamstatic.com/steam/apps/1852000/ss_08ee2f0ae64175adf71b7dcbd0dc46b490d83a81.1920x1080.jpg?t=1649201110,https://cdn.akamai.steamstatic.com/steam/apps/1852000/ss_87098892e9d49d55caa0d105fe884f5b5e3d0e85.1920x1080.jpg?t=1649201110,https://cdn.akamai.steamstatic.com/steam/apps/1852000/ss_bd93793be53215bdbc392e5f34299fa5cbaee942.1920x1080.jpg?t=1649201110,https://cdn.akamai.steamstatic.com/steam/apps/1852000/ss_5e16dfe28f7a8fc06a3a1b7f7d75114689064e60.1920x1080.jpg?t=1649201110,https://cdn.akamai.steamstatic.com/steam/apps/1852000/ss_d9460d968691ffdb53752b33359f15a452e14dbc.1920x1080.jpg?t=1649201110,https://cdn.akamai.steamstatic.com/steam/apps/1852000/ss_f08528f7667943a74f9d74ff8e8a6cc4d3123a45.1920x1080.jpg?t=1649201110",
    "Slug": "tongue-kissing-specialization-my-girlfriend-s-here-for-a-visit",
    "Meta Title": "[Tongue kissing Specialization] My girlfriend's here for ...",
    "Meta Description": "Looking for information on [Tongue kissing Specialization] My girlfriend's here for a visit.? Check out the release date (Feb 25, 2022), developer insig...",
    "Alt Text Image": "Official header image for [Tongue kissing Specialization] My girlfriend's here for a visit. game - Steam 1852000",
    "Canonical URL": "https://gusku.site/game/tongue-kissing-specialization-my-girlfriend-s-here-for-a-visit",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"[Tongue kissing Specialization] My girlfriend's here for a visit.\", \"description\": \"Looking for information on [Tongue kissing Specialization] My girlfriend's here for a visit.? Check out the release date (Feb 25, 2022), developer insig...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"GamesSafu\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GamesSafu\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1852000/header.jpg?t=1649201110\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.09, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}