{
    "AppID": 1820710,
    "Name": "VR Dodgeball Trainer",
    "Release date": "Apr 30, 2022",
    "About the game": "Welcome to VR Dodgeball Trainer! It's time to practice your skills in this dodging focused training game! Try out 3 different game modes that train you for dodgeball avoidance in realistic and... unorthodox ways. Are you ready to dodge like the pros? VR Dodgeball Trainer was designed from the ground up by professional dodgeball players to give you the dodging prowess to survive out on the court. Watch out as these red menaces soar over your dome, leaving you constantly on your toes. Can you take on waves of beefy cubed up'd enemies as the pressure rises? Train like never before with a fully customizable court of foes! Looking for a light workout, or an unending onslaught of face smashin' rubber? With Training mode you have full customizability: Train with the pros Change the # of opponents Control Throw speed Increase # of opponents throwing at once Bring opponents to court front or back And some secret controls... Unending wave combat with Classic Mode. Enter the Classic Mode to take on an ever increasing court of enemies who can bring the heat! Each time you survive a wave, more players get added to your field for a max of 6. But think fast! After your court is filled with all 6 players, they'll head back to the locker room and bring out their faster players. By the end of Classic Mode, you'll be up against the fastest 6 throwers VR Dodgeball Trainer has to offer! Get silly with it! Ready to relax after a hard day of head bobbin'? Hop into arcade mode and play around with our stupidly fun mini-game modes! Take on a range of unexpected challenges while the waves get harder and harder. Arcade Gamemodes Saber Mode Bullet Time Mode Shield Mode Gun Mode Curveball Mode Big Balls Mode and more... Watch your back in 360 Mode! That's right! You thought dodging straight ahead was challenge? Well, just wait until you're surrounded by all sides with nothing but your raw speed and agility to keep you from getting absolutely wailed on. In 360 Mode challengers begin spawning all around you, forcing you to keep moving your body and ducking at every turn. Use 360 Mode to do Training, Classic, or even Arcade Mode!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1820710/header.jpg?t=1651331766",
    "Price": 7.99,
    "Developers": "Grounded",
    "Publishers": "Clique Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1820710/ss_d6b448d014571a7bc43e17b9788bb700de88b566.1920x1080.jpg?t=1651331766,https://cdn.akamai.steamstatic.com/steam/apps/1820710/ss_4d5ca4371c7ac5e3417940303051028519e35cee.1920x1080.jpg?t=1651331766,https://cdn.akamai.steamstatic.com/steam/apps/1820710/ss_d293ae6ccc6c3ca2eedf3838f09f265338861105.1920x1080.jpg?t=1651331766,https://cdn.akamai.steamstatic.com/steam/apps/1820710/ss_8673dd1aaaab8f065f79487bd5a613d69b2ff436.1920x1080.jpg?t=1651331766,https://cdn.akamai.steamstatic.com/steam/apps/1820710/ss_99716f0440e7c07f8ffa48f3b04168238fe60782.1920x1080.jpg?t=1651331766",
    "Slug": "vr-dodgeball-trainer",
    "Meta Title": "VR Dodgeball Trainer: Apr 30, 2022, Grounded and Full Ove...",
    "Meta Description": "Looking for information on VR Dodgeball Trainer? Check out the release date (Apr 30, 2022), developer insights from Grounded, and a complete game summary.",
    "Alt Text Image": "Official header image for VR Dodgeball Trainer game - Steam 1820710",
    "Canonical URL": "https://gusku.site/game/vr-dodgeball-trainer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VR Dodgeball Trainer\", \"description\": \"Looking for information on VR Dodgeball Trainer? Check out the release date (Apr 30, 2022), developer insights from Grounded, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Grounded\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Clique Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1820710/header.jpg?t=1651331766\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}