{
    "AppID": 243470,
    "Name": "Watch_Dogs™",
    "Release date": "May 26, 2014",
    "About the game": "All it takes is the swipe of a finger. We connect with friends. We buy the latest gadgets and gear. We find out what’s happening in the world. But with that same simple swipe, we cast an increasingly expansive shadow. With each connection, we leave a digital trail that tracks our every move and milestone, our every like and dislike. And it’s not just people. Today, all major cities are networked. Urban infrastructures are monitored and controlled by complex operating systems. In Watch_Dogs, this system is called the Central Operating System (CTOS) – and it controls almost every piece of the city’s technology and holds key information on all of the city’s residents. You play as Aiden Pearce, a brilliant hacker and former thug, whose criminal past led to a violent family tragedy. Now on the hunt for those who hurt your family, you'll be able to monitor and hack all who surround you by manipulating everything connected to the city’s network. Access omnipresent security cameras, download personal information to locate a target, control traffic lights and public transportation to stop the enemy…and more. Use the city of Chicago as your ultimate weapon and exact your own style of revenge. KEY FEATURES HACK THE CITY Watch_Dogs takes place in a fully simulated living city where, using your smartphone, you have real-time control over the city’s infrastructure. Trap your enemy in a 30-car pileup by manipulating the traffic lights. Stop a train, and then board it to evade the authorities. Narrowly escape capture by quickly raising a drawbridge. Anything connected to the city’s CTOS can become your weapon. STREET JUSTICE Living in inner city Chicago where violence is best answered by violence, you have the skills to take the fight to the streets. Take down enemies by delivering devastating blows with your baton, or experience a shoot-out like never before with a physics simulation that rivals anything in the shooter category. Use a combination of shooting and hacking to gain advantage in any given situation. The streets are designed for you to create your own plan of attack. Overall, you will have access to more than 30 traditional weapons. HIGH OCTANE DRIVING Ubisoft Montreal has partnered with studios such as Ubisoft Reflections, the acclaimed studio behind the award-winning Driver series to bring you a game bursting with horsepower. Get behind the wheel of more than 65 vehicles, each with state of the art physics and handling, and explore the massive city while completing missions. EVERYTHING IS UNDER CONTROL Disrupt, the all-new game engine dedicated to Watch_Dogs, uses advanced processing and graphics to deliver a stunning visual and an incredibly realistic experience. Disrupt gives you the power to affect the story, the city and the life of the population with your choices creating a ripple effect throughout the city. DYNAMIC NAVIGATION Watch_Dogs gives you the ability to not only use the city’s ctOS to your advantage, but the streets as well. In real-world Chicago, cut through buildings or climb to the rooftops to catch your target. SEAMLESS MULTIPLAYER EXPERIENCE Discover new levels of interaction, cooperation and confrontation between players thanks to a brand new multiplayer game system that links the single and multiplayer modes into one seamless experience. That means no menus, no loading screens, just instant open world multiplayer action.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/243470/header.jpg?t=1602605619",
    "Price": 29.99,
    "Developers": "Ubisoft",
    "Publishers": "Ubisoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/243470/ss_752aefdfdf2c55dfc8a94d1e9b8d9f6dd42a359c.1920x1080.jpg?t=1602605619,https://cdn.akamai.steamstatic.com/steam/apps/243470/ss_e898214ffaeef618f63e4171a4bd415e7a1f391b.1920x1080.jpg?t=1602605619,https://cdn.akamai.steamstatic.com/steam/apps/243470/ss_0ce6b9f9a11b038f9d1e5dcf12a5d9a9043e6c16.1920x1080.jpg?t=1602605619,https://cdn.akamai.steamstatic.com/steam/apps/243470/ss_98649913909e245fb7c7f34fbcc8145ec662b1dc.1920x1080.jpg?t=1602605619,https://cdn.akamai.steamstatic.com/steam/apps/243470/ss_ad985b3cf8444e2fe1867b388bf5658a5a2bc3bc.1920x1080.jpg?t=1602605619,https://cdn.akamai.steamstatic.com/steam/apps/243470/ss_b2de18725a4da0bf539824b48b562922a8500299.1920x1080.jpg?t=1602605619,https://cdn.akamai.steamstatic.com/steam/apps/243470/ss_a9bd4c4fc828db47130d3c9a39c972a589adffb6.1920x1080.jpg?t=1602605619,https://cdn.akamai.steamstatic.com/steam/apps/243470/ss_fc07f88aabd355dde6decf3c8c61cfd0ef964d7f.1920x1080.jpg?t=1602605619,https://cdn.akamai.steamstatic.com/steam/apps/243470/ss_85b388c915972a4fd3730bf7b9bb5126245d8f19.1920x1080.jpg?t=1602605619,https://cdn.akamai.steamstatic.com/steam/apps/243470/ss_0411e96cf2a9007ad6e931f819a9ea4ef95e001b.1920x1080.jpg?t=1602605619",
    "Slug": "watch-dogs",
    "Meta Title": "Watch_Dogs™: May 26, 2014, Ubisoft and Full Overview",
    "Meta Description": "Looking for information on Watch_Dogs™? Check out the release date (May 26, 2014), developer insights from Ubisoft, and a complete game summary.",
    "Alt Text Image": "Official header image for Watch_Dogs™ game - Steam 243470",
    "Canonical URL": "https://gusku.site/game/watch-dogs",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Watch_Dogs\\u2122\", \"description\": \"Looking for information on Watch_Dogs\\u2122? Check out the release date (May 26, 2014), developer insights from Ubisoft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ubisoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ubisoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/243470/header.jpg?t=1602605619\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}