{
    "AppID": 588040,
    "Name": "WILL: A Wonderful World / WILL：美好世界",
    "Release date": "Jun 6, 2017",
    "About the game": "Use your heart and wisdom to help those in need. There was an urban legend… Write your troubles down on a note. Hold it in your hand at midnight and pray. “God, please help me…” Then god will hear your plea. And change your fate. It was only a legend though. It wasn’t even popular for very long… A young girl wakes up, groggy in an unknown room. A talking dog appears before her and she becomes startled by the revelation he tells her: They are gods and it is their duty to change the fate of any humans that ask for their help. Letters appear in the mail and with pen in hand she begins her job. People who believe in this legend live all over the world, in every shape and form. They write and pray to the gods, seeking help for their troubles: A quiet nerd stuck in a hopeless, one-sided crush. An impoverished artist who’s lost all hope and contemplates suicide. A rookie police officer who burns with justice and hopes for his first big case. A young woman desperately chasing her dream against all odds. Evan a stray cat who would be simply satisfied with some dried fish to eat. They say that a god is good and makes choices for the greater good. However, are these really the best choices for mortals? With the power to change the fate of humankind, dive deep into the story and learn about those that seek out your help but remember, changing someone’s fate will have an effect on others whether they are interconnected or not. As you read through each story, perhaps the young girl’s memory will also return but what will she learn about herself and her mission? Gameplay Receive letters from people seeking help. Investigate their situations and alter their fate. The stories of the characters are gradually revealed to you in the letters they wrote. From these letters, you will learn about their lives, and help solve their problems. You might not become friends, but they will be forever grateful for all you have done. Use your powers to change the events that happen and watch as the story takes on a new course! But exercise caution as altering the fate of one person may change the course of another. “Everything happens for a reason” Be sure to put on your detective hat before making decisions. The fates of the characters could be completely changed with your acute observation and wise deduction. Life is full of surprises. Sometimes, thinking outside the box could uncover beautiful hidden gems. Be bold, be brave, and create the best memories together with our heroes! Features Read stories and use deduction to determine how to alter the fate of the people in these stories. Each decision opens up the story and may even impact the stories of others. Progress through the game and also learn more about the two gods, the mysterious girl and her companion.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/588040/header.jpg?t=1656138376",
    "Price": 14.99,
    "Developers": "WMY Studio",
    "Publishers": "WMY Studio,PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/588040/ss_eb00ae86ca001509e2ad3345134c0d5c1e45f82c.1920x1080.jpg?t=1656138376,https://cdn.akamai.steamstatic.com/steam/apps/588040/ss_a1c6f8e2ef1565d918a2d05a4c8f27eb3aefd168.1920x1080.jpg?t=1656138376,https://cdn.akamai.steamstatic.com/steam/apps/588040/ss_83960df38f3ab2451d7a7424738a4292f7433afd.1920x1080.jpg?t=1656138376,https://cdn.akamai.steamstatic.com/steam/apps/588040/ss_d5155f61be16a616a3ab863fc070fd3369cc3291.1920x1080.jpg?t=1656138376,https://cdn.akamai.steamstatic.com/steam/apps/588040/ss_549bb05a6d96b5dceb6d546278adf3d420e735db.1920x1080.jpg?t=1656138376,https://cdn.akamai.steamstatic.com/steam/apps/588040/ss_d97e9b5b6bc6585ae25fdc0d528b4d51f4b10362.1920x1080.jpg?t=1656138376,https://cdn.akamai.steamstatic.com/steam/apps/588040/ss_883227f9b16d844c0efb4b85ba61a479aea09b87.1920x1080.jpg?t=1656138376,https://cdn.akamai.steamstatic.com/steam/apps/588040/ss_330b0aa7b985d859f392816efd4c5d57ae2a994b.1920x1080.jpg?t=1656138376,https://cdn.akamai.steamstatic.com/steam/apps/588040/ss_95f5abc30d054c15f5c45e9eef28b9f17cdb3a60.1920x1080.jpg?t=1656138376,https://cdn.akamai.steamstatic.com/steam/apps/588040/ss_eeada0017760e75b95852d5d57f7ac4a19909d4a.1920x1080.jpg?t=1656138376",
    "Slug": "will-a-wonderful-world-will",
    "Meta Title": "WILL: A Wonderful World / WILL：美好世界: Jun 6, 2017, WMY Stu...",
    "Meta Description": "Looking for information on WILL: A Wonderful World / WILL：美好世界? Check out the release date (Jun 6, 2017), developer insights from WMY Studio, and a comp...",
    "Alt Text Image": "Official header image for WILL: A Wonderful World / WILL：美好世界 game - Steam 588040",
    "Canonical URL": "https://gusku.site/game/will-a-wonderful-world-will",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"WILL: A Wonderful World / WILL\\uff1a\\u7f8e\\u597d\\u4e16\\u754c\", \"description\": \"Looking for information on WILL: A Wonderful World / WILL\\uff1a\\u7f8e\\u597d\\u4e16\\u754c? Check out the release date (Jun 6, 2017), developer insights from WMY Studio, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 6, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"WMY Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"WMY Studio,PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/588040/header.jpg?t=1656138376\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}