{
    "AppID": 676830,
    "Name": "Xenomarine",
    "Release date": "Apr 23, 2019",
    "About the game": "XENOMARINE is a dark, atmospheric, sci-fi/horror themed roguelike in which you play a space marine exploring an alien-infested space station. Starting out with little more than a crowbar, you will fight to survive against over 120 increasingly powerful alien species, as you progress as far as you can through infinite randomly generated levels. With no starting classes, develop your character into the ultimate fighting machine by means of in-game choices: create a unique build each time you play by finding and choosing between a large and distinctive range of unique usable items and individually upgradable weapons and armor. And although the focus in Xenomarine is on items rather than skills, there are also 70 skill levels to be learned you gain experience from combat and from randomly generated missions. NEW in Ascension Edition: Search for the truth behind the alien infestation and gain control over extraordinary multidimensional technology with an all-new storyline and game mechanic that gives the option to 'win' the game. WARNING: This game is hard: expect to die soon and often when first starting out! Also, in the default 'roguelike' game mode, death is permanent - meaning you will have to start again from level 1. But don’t worry: each playthrough will be different because so many parts of the game are randomly generated (in a way that’s carefully fine-tuned for balance). And there's a second 'adventure' game mode in which you can continue your game if you die, for those who prefer a more relaxed experience. *This game contains flashing images and may not be suitable to all users* Setting You are a Xenomarine, stranded in a dark alien-infested space station. Your squad are all dead, and you have nothing but a crowbar, a torch running low on power and some battered armor. Death seems certain,  but you're sure as hell going to take as many Xenos as possible down with you before you go! And you've not forgotten the rumours of powerful alien tech, and of illegal experiments involving the seventh dimension... Features Of Xenomarine Rich, Tactical Turn-based Combat infinite, randomly Generated Levels Atmospheric lighting and procedurally generated sound effects Unique useable items such as scanners, forcefields and night-vision goggles 10 alien types with 12 variants each, making 120 enemies: all with unique behaviours No starting class: develop your class on the fly with over 70 skill upgrades Multiple damage types and status effects Crafting (craft items from scrap and upgrade weapons and armor) Hack drones and turrets; deploy traps; find and use mysterious alien tech Random mini-quests Intuitive user interface, with mouse-only and keyboard-only support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/676830/header.jpg?t=1612195877",
    "Price": 9.99,
    "Developers": "Fourfold Games",
    "Publishers": "Fourfold Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/676830/ss_f7145fb127b65665942099ff312e356053f88ddc.1920x1080.jpg?t=1612195877,https://cdn.akamai.steamstatic.com/steam/apps/676830/ss_428f77c05ced717b53d4df4d4c5d3f6b415bf802.1920x1080.jpg?t=1612195877,https://cdn.akamai.steamstatic.com/steam/apps/676830/ss_108e2ea6765df3ef3a08ae129cad725125f2bd47.1920x1080.jpg?t=1612195877,https://cdn.akamai.steamstatic.com/steam/apps/676830/ss_20a6aeb7e056b0da966022d8fcd9ad88be7d77a7.1920x1080.jpg?t=1612195877,https://cdn.akamai.steamstatic.com/steam/apps/676830/ss_3bcc3cca3d63da632b771f65de8dc2c9af70ebdd.1920x1080.jpg?t=1612195877,https://cdn.akamai.steamstatic.com/steam/apps/676830/ss_05e3235b029a03775150cda055bf0ce702660800.1920x1080.jpg?t=1612195877,https://cdn.akamai.steamstatic.com/steam/apps/676830/ss_17215b85870d050f336eeb1e00ad95a27f139144.1920x1080.jpg?t=1612195877,https://cdn.akamai.steamstatic.com/steam/apps/676830/ss_590f3e7ec3889bd9f8afc8265d5b4811ee4e82ff.1920x1080.jpg?t=1612195877",
    "Slug": "xenomarine",
    "Meta Title": "Xenomarine: Apr 23, 2019, Fourfold Games and Full Overview",
    "Meta Description": "Looking for information on Xenomarine? Check out the release date (Apr 23, 2019), developer insights from Fourfold Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Xenomarine game - Steam 676830",
    "Canonical URL": "https://gusku.site/game/xenomarine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Xenomarine\", \"description\": \"Looking for information on Xenomarine? Check out the release date (Apr 23, 2019), developer insights from Fourfold Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 23, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fourfold Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fourfold Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/676830/header.jpg?t=1612195877\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}