{
    "AppID": 1060460,
    "Name": "Apollo 17 - Moonbuggy VR",
    "Release date": "Jul 17, 2019",
    "About the game": "Apollo 17 - Moonbuggy VR - Lunar Rover Experience Last Man on the Moon Explore the Moon on the Apollo 17 Mission in Virtual Reality Walk on the Moon Drive the Lunar Rover Find the Original Apollo 17 Sites Experience Photogrammetric Reconstructions of the Lunar Surface Enter the Lunar Module Visit Mission Control Discover little known Facts about the Apollo 17 Adventure Experience the dream of driving a Lunar Rover on the moon! Re-live the lunar rover exploration on the last moon mission - Apollo 17. This is the apogee of the most extreme travel, camping, and hiking expedition in mankind’s history. Imagine not only landing on the moon, but then having an incredible moon buggy to explore far beyond where you can see or easily get back to the landing module. The application employs realistically modeled moon terrain and mountains from satellite images, real moon photographs, and photogrammetry to bring the moon closer than ever before. Travel the actual rover route and visit the sites from the original expeditions. Get out and walk around to explore in more detail. Go places the astronauts never could, but maybe dreamed of. 'This is what it feels like, this is what it looks like' You are Commander Gene Cernan, the last man to walk and drive on the moon. This is what he said he felt as he was preparing to leave the moon - 'I couldn’t get out of my mind this almost science fiction world I was living in. I wanted to press the freeze button and stop time. I wanted to reach out, stick it in my space suit, and bring it back home with me. I wanted to show it to everybody - This is what is feels like, this is what it looks like .' - This is the mission of this VR application, to really bring the experience of the moon to you like never before. Apollo 17 was the last and most advanced moon mission to date. This mission was refined using knowledge from all the other Apollo missions. They stayed on the moon longer and traveled further than ever before and ever since. The Apollo 17 astronauts traveled over 22 miles in the rover. Much of the time in the rover, they were not even in sight of the lander. The application also chronicles the astronauts discoveries on this mission and little known facts. This includes the massive Camelot Crater over half a mile across, orange dirt discovered at Shorty crater, an emergency repair or the rover, and other adventures. You will see the moon just as the astronauts did. Some site details are brought to clarity with photogrammetric regions generated from collections of astronaut photos. The mountains and horizon are generated from low lunar orbit elevation data. Intermediate terrain is formed with the aid of high resolution orbital images. The rover itself is modeled on the original using real physics simulation with 4 wheel suspension, 4 wheel stearing, damping, gravity and power just like the original. You can also use VR teleport portal to cover huge distances in seconds rather than hours. The original photos the astronauts took are displayed in certain areas allowing you to compare and validate this computer reconstruction of the moon. Come experience the Real-Moon like never before! Instructions Use the Left Controller for Walking and Menus Use the Right Controller for Driving Use the Trigger for Rover Brake Keyboard Commands These commands are not required but give users enhanced capabilities. L = Lunar Rover Enable Entry/Driving - So you can get into the rover at any time Y = Cycle thru Skyboxes – Black is what the astronauts reported seeing on the bright moon, actual Milky Way, and Surreal close earth F = Flip Rover - If the rover gets stuck or flips over, can hit repeatedly if needed",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1060460/header.jpg?t=1565863576",
    "Price": 9.99,
    "Developers": "VRX",
    "Publishers": "VRX",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_0851f2df76707af540c8e7c5c591f4a2a5d09a91.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_75d8e440cb8511d917723ecd5cd5269a19883164.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_1ee1061a19b54b827c75fc0fb157012ca2395ba4.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_ef3142512c06260ca7b57335460b6aa81ce892cb.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_a220bc37636a15fd6fdd2e9316846152f0340fd1.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_73da667eae519dbf02068b885a09c3c2ef5b7e1f.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_de583a811e1868b04dbd8eec380c46d100b01ebf.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_3bbfebddf2c12a9e12aa0f381212ed500cbdae08.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_85352dbcae2622ee4c5b4e7b6a2f6c50b4480015.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_c9a27f6ffdd8fec3a3f9ce2c3c90b5fe5fd653c0.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_d3f9eaf0002e15b006cb07229b4045a0dff861e5.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_bcddfb6ea985d97c7d8cc49a903778d801a7c7ad.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_255f51ac67e6b0c446797e4a8023129daa307a21.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_83c7d71c505b48774690a93f9741b4cb99c7bb76.1920x1080.jpg?t=1565863576,https://cdn.akamai.steamstatic.com/steam/apps/1060460/ss_944b5dd819886505f113f69aa8f5d36e7ff2887f.1920x1080.jpg?t=1565863576",
    "Slug": "apollo-17-moonbuggy-vr",
    "Meta Title": "Apollo 17 - Moonbuggy VR: Jul 17, 2019, VRX and Full Over...",
    "Meta Description": "Looking for information on Apollo 17 - Moonbuggy VR? Check out the release date (Jul 17, 2019), developer insights from VRX, and a complete game summary.",
    "Alt Text Image": "Official header image for Apollo 17 - Moonbuggy VR game - Steam 1060460",
    "Canonical URL": "https://gusku.site/game/apollo-17-moonbuggy-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Apollo 17 - Moonbuggy VR\", \"description\": \"Looking for information on Apollo 17 - Moonbuggy VR? Check out the release date (Jul 17, 2019), developer insights from VRX, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 17, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"VRX\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VRX\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1060460/header.jpg?t=1565863576\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}