{
    "AppID": 1301590,
    "Name": "Beyond Mankind: The Awakening",
    "Release date": "Aug 31, 2021",
    "About the game": "INTRO Beyond Mankind: The Awakening is an old school type indie RPG taking place in a post-apocalyptic world. The game sports a mature and deep narrative, rich exploration, tense combat, and immersive RPG mechanics. STORY In the year 2121, Earth is in the last stages of a nuclear winter. A new species dominates the frozen landscape of ruined cities and devastation. The new megafauna, quickly evolving in the cold and radiation, has made the world even more dangerous. The remnants of civilization are faced with an existential dilemma: whether to keep hope in humankind and embark on an uncertain war to regain Earth, or to simply accept the slow extinction of a failed species. Visionaries emerge, but it is far from clear whether following them will lead to glory or destruction. The species is at a crossroads, and the consequences of all options seem dire. It is into this relentless, frozen, and violent world that you awaken, newly born of the Techno-Womb and engineered for success, with implanted memories from a century before. You could be just one more of the hundreds that rummage through the ruins for lost treasures or tirelessly train for a war that may never come, but fate holds a surprise that will change everything. GAME OVERVIEW You create your character and embark on a mission to help human civilization, which is currently exiled off-world. You will be part of H.O.P.E., an elite military unit at the vanguard of a war to recover Earth. You will start under the ruins of what once was the town of Avalon on the island of Santa Catalina. From there, you will embark on an epic journey that will test both your character and ability. As you play, you will face unexpected challenges with surprising solutions. Social interaction within the game is deep, and you will develop personality-based kinship, loyalty, and even romance with other characters. KEY FEATURES Intriguing and dark narrative - Beyond Mankind provides a unique experience in which you will discover a post-apocalyptic world through the main story and secondary quests shaped by your decisions. A rich and dynamic world - Help human civilization, exiled in space, avoid extinction while exploring an Earth devastated by nuclear war. Unique character generation - Create a character based on DNA and culture selection, then accumulate experience to improve your abilities. Complex social interactions - Experience personality-based kinship, loyalty, and romance with other characters. Real dilemmas - Face problems that may not always have a completely positive solution, let alone an obvious one. Challenging survival mechanics - Explore, collect or hunt for food, craft tools, light fires for cooking and warmth, and construct a shelter. Above all, monitor your psychological state. 3D inventory management - Pick your resources at your camp. Storage space is limited, so choosing well can make the difference between life and death. Are you up to the challenge?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1301590/header.jpg?t=1655929137",
    "Price": 19.99,
    "Developers": "Brytenwalda",
    "Publishers": "Brytenwalda",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1301590/ss_1e2411d8a5d4dd4e0926432bbfa7b062984f5142.1920x1080.jpg?t=1655929137,https://cdn.akamai.steamstatic.com/steam/apps/1301590/ss_89256c53f557a1cbeca140e2d96c809b7bb35cc2.1920x1080.jpg?t=1655929137,https://cdn.akamai.steamstatic.com/steam/apps/1301590/ss_116beb664daab0b88b658c86344d46839bfdb294.1920x1080.jpg?t=1655929137,https://cdn.akamai.steamstatic.com/steam/apps/1301590/ss_f0f682a4c3921bf67922d87d88dd7fb563ff539b.1920x1080.jpg?t=1655929137,https://cdn.akamai.steamstatic.com/steam/apps/1301590/ss_c7a78c6ca59e5341d9b368dce053c88f8e8e464c.1920x1080.jpg?t=1655929137,https://cdn.akamai.steamstatic.com/steam/apps/1301590/ss_b619159189cbcfc32599d45f8eb1a98dd20011a3.1920x1080.jpg?t=1655929137,https://cdn.akamai.steamstatic.com/steam/apps/1301590/ss_840aa20b02710dc5ce8bc6d81ca52be136ac17a4.1920x1080.jpg?t=1655929137,https://cdn.akamai.steamstatic.com/steam/apps/1301590/ss_6fb82c1b2f1130d17470c6a7e8c8888053f8bf65.1920x1080.jpg?t=1655929137,https://cdn.akamai.steamstatic.com/steam/apps/1301590/ss_fc8668c838671145fefa2a20ee12656a94d2becd.1920x1080.jpg?t=1655929137,https://cdn.akamai.steamstatic.com/steam/apps/1301590/ss_9855279a0f9f339cc033a36858a3e2fc6b517903.1920x1080.jpg?t=1655929137,https://cdn.akamai.steamstatic.com/steam/apps/1301590/ss_2ef11b98da7558cd7ed0383e07f7a777763de6bf.1920x1080.jpg?t=1655929137,https://cdn.akamai.steamstatic.com/steam/apps/1301590/ss_dcf0fe622d4fffdbfa71183601644273651f8083.1920x1080.jpg?t=1655929137,https://cdn.akamai.steamstatic.com/steam/apps/1301590/ss_9cc3fe1d19c4790a0e6ea531d65861e590fd8ed2.1920x1080.jpg?t=1655929137",
    "Slug": "beyond-mankind-the-awakening",
    "Meta Title": "Beyond Mankind: The Awakening: Aug 31, 2021, Brytenwalda ...",
    "Meta Description": "Looking for information on Beyond Mankind: The Awakening? Check out the release date (Aug 31, 2021), developer insights from Brytenwalda, and a complete...",
    "Alt Text Image": "Official header image for Beyond Mankind: The Awakening game - Steam 1301590",
    "Canonical URL": "https://gusku.site/game/beyond-mankind-the-awakening",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Beyond Mankind: The Awakening\", \"description\": \"Looking for information on Beyond Mankind: The Awakening? Check out the release date (Aug 31, 2021), developer insights from Brytenwalda, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 31, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Brytenwalda\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Brytenwalda\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1301590/header.jpg?t=1655929137\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}