{
    "AppID": 1294120,
    "Name": "Bragger's Run",
    "Release date": "Nov 25, 2020",
    "About the game": "Can You Make The Run? Get ready to put your skills to the test. Bragger's Run takes you on a whirlwind adventure across a continent, facing hundreds of enemies and four distinct bosses (plus a hidden one!). You'll gain experience and level up, you'll find incredibly powerful items, and you'll find currency that you can use to buy enhancements that will truly take your runs to another level. The best player's names will be displayed prominently for all to see in game. 3 Classes to choose from! The Duelist - A dual wielding, whirling dervish of danger! The duelist is fast and deadly. Deflect bullets back at attackers with well timed swings, teleport across the map for flashy kills, and throw and control your sword to damage enemies from afar. The duelist is the hardest, but most rewarding character to play. The Wizard - Weak on the surface, the wizard brings powerful crowd control and mobility spells to the table. Able to shape fights to his liking, his area of effect basic attack can take care of the rest. Phase shift across the map, stunning enemies as you pass by, or hit them with chain lighting to leave them temporarily helpless and ripe for your wrath. The Gunslinger - A simple man, but a big threat. The Gunslinger takes things back to basics. Bullets and grenades are his specialty. The Gunslinger does his dirty work from afar, and he does it well. Over 100 items and treasures: Your build, your item abilities, and your play style will depend on what you find and what you don't find. Valuable items not usable by your class can be carried over for your next run for a big head-start, but only if you tuck them into your very limited storage space... you can't bring everything home safely, so choose wisely! Randomly Generated Gameplay: No two runs will be the same. A good run is as much about luck as it is skill. Level up! Gain experience from kills, and use it to further enhance your champion! A Challenge, to be sure! The world of The Run is not full of pushovers! Be ready to learn boss mechanics, make mistakes, and suffer painful defeats. A completed run is an achievement to be proud of, and who knows - maybe you'll be the fastest in town! Steam Leader boards and Periodic Challenges: Achieve internet fame! The fastest completion time for each character will be prominently displayed in-game, and the elusive 'Triple Crown' will go to the player who has the fastest combined times for all characters.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1294120/header.jpg?t=1641353757",
    "Price": 3.99,
    "Developers": "Burgee Media",
    "Publishers": "Burgee Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1294120/ss_302c24be7c258e248f871292ec87c1a804600d7c.1920x1080.jpg?t=1641353757,https://cdn.akamai.steamstatic.com/steam/apps/1294120/ss_e06b30e3353abdde688ddac8fd3a9b8c15a29f0f.1920x1080.jpg?t=1641353757,https://cdn.akamai.steamstatic.com/steam/apps/1294120/ss_ae02f0feb32aa488e9ba6a7dec7c3734e9b455fe.1920x1080.jpg?t=1641353757,https://cdn.akamai.steamstatic.com/steam/apps/1294120/ss_2ad74a73cfa85a1a1e1ebd37e5171bf93fadfb13.1920x1080.jpg?t=1641353757,https://cdn.akamai.steamstatic.com/steam/apps/1294120/ss_56831f054f85f7ed67e612b580c63452e0ef988c.1920x1080.jpg?t=1641353757,https://cdn.akamai.steamstatic.com/steam/apps/1294120/ss_c129bd169506cd197b4e34581536f39812f9b48f.1920x1080.jpg?t=1641353757,https://cdn.akamai.steamstatic.com/steam/apps/1294120/ss_358325a654f50567817ed22369d7da8d7fdb0149.1920x1080.jpg?t=1641353757",
    "Slug": "bragger-s-run",
    "Meta Title": "Bragger's Run: Nov 25, 2020, Burgee Media and Full Overview",
    "Meta Description": "Looking for information on Bragger's Run? Check out the release date (Nov 25, 2020), developer insights from Burgee Media, and a complete game summary.",
    "Alt Text Image": "Official header image for Bragger's Run game - Steam 1294120",
    "Canonical URL": "https://gusku.site/game/bragger-s-run",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bragger's Run\", \"description\": \"Looking for information on Bragger's Run? Check out the release date (Nov 25, 2020), developer insights from Burgee Media, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 25, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Burgee Media\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Burgee Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1294120/header.jpg?t=1641353757\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}