{
    "AppID": 1399910,
    "Name": "Crisis Arcana",
    "Release date": "Sep 18, 2020",
    "About the game": "There you were, ecstatic that you had been chosen to serve as the grand wizard's newest apprentice. Next thing you knew he's legless and horrific monstrosities are now roaming the realms. It's your job now to go throughout these realms and defeating the horrors that lie in wait. Yes you barely know any spells and now you've got to hunt down the world-ending abominations but I'm sure it'll be fine. You'll get stronger as you traverse through the almost randomly designed worlds and will have the option to learn some new spells along the way. Plus the enemies will drop money which can happily be transmuted into further upgrades for you. Good Luck!!! So what is this game? Crisis Arcana is a procedurally generated dungeon crawler where you the player runs around these dungeons, blasting away all the enemies that infest them. It is played from a top-down perspective and rewards you even greater the further into a world you get before dying. To help get further, you can level up your character, becoming stronger as you do. Plus defeating enemies causes them to drop money which can be exchanged for more upgrades. Sometimes they will even drop their soul which you can use to learn new abilities. Key features 3 randomly generated worlds 6 unique schools of magic that the player can learn a variety of spells from Astromancy - Want to mess around with cosmic powers then this is the school for you Cyromancy - This school gives you permission to say cool thinks like 'Ice to meet you' as everyone around you can't react as they exist as a snowman now Mixomancy - Why learn how to cast spells when you can just make bombs and potions that turn you into a god Pyromancy - Likelihood of your house, your family and the entire world burning down after you invest in this is 100% Necromancy - Death is just a new way to life with this school Terramancy - Remember that one time when an earthquake made you spill your tea? Well now you can make that happen to anyone you want thanks to terramancy Levelling up system A simple shop where you can buy further upgrades A Grand Wizard who totally isn't like really peeped off that you caused all these issues. Also he'll help you A boss at the end of each world that has a unique behaviour you have to deal with Play around in the blood puddles and leave trails because I decided to work on that instead of more important things (I'm not a psychopath I swear) Note from the developer (that's me) 'Thank you so much for spending part of your day looking at my game!!! It means the absolute world to me. If you end up getting it then I hope you enjoy it :) This is the first game I've ever made from start to finish and unfortunately there were quite a few things I had to cut as I set myself a deadline and really wanted to stick to it. That was the challenge after all haha. I'm back off to university soon but if I have time I will update the game and add little things throughout the year. From the bottom of my heart have a wonderful time and hope you have a lovely day or night, I dont know when you're reading this :D Kind Regards, ThatBoopGuy (Me)'",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1399910/header.jpg?t=1600422739",
    "Price": 2.99,
    "Developers": "ThatBoopGuy",
    "Publishers": "ThatBoopGuy",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1399910/ss_b861af6d22fd3fef2dfa0f60c432ee6ba38b3930.1920x1080.jpg?t=1600422739,https://cdn.akamai.steamstatic.com/steam/apps/1399910/ss_50173f3d5a092d10ab3ee836a2d7fb4b57103d54.1920x1080.jpg?t=1600422739,https://cdn.akamai.steamstatic.com/steam/apps/1399910/ss_197cbc051b2de7f7dd6054f42b0200757d5a8a28.1920x1080.jpg?t=1600422739,https://cdn.akamai.steamstatic.com/steam/apps/1399910/ss_7a5c899ceaaf456c552116964056c01462754db3.1920x1080.jpg?t=1600422739,https://cdn.akamai.steamstatic.com/steam/apps/1399910/ss_8aac5df7068e59337475eb154261435f26f93e29.1920x1080.jpg?t=1600422739",
    "Slug": "crisis-arcana",
    "Meta Title": "Crisis Arcana: Sep 18, 2020, ThatBoopGuy and Full Overview",
    "Meta Description": "Looking for information on Crisis Arcana? Check out the release date (Sep 18, 2020), developer insights from ThatBoopGuy, and a complete game summary.",
    "Alt Text Image": "Official header image for Crisis Arcana game - Steam 1399910",
    "Canonical URL": "https://gusku.site/game/crisis-arcana",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crisis Arcana\", \"description\": \"Looking for information on Crisis Arcana? Check out the release date (Sep 18, 2020), developer insights from ThatBoopGuy, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"ThatBoopGuy\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ThatBoopGuy\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1399910/header.jpg?t=1600422739\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}