{
    "AppID": 1727650,
    "Name": "死寂（Deathly Stillness）",
    "Release date": "Sep 4, 2021",
    "About the game": "More games information, please subscribe to: About the game: This is a boring third-person zombie game with no plot Please don’t have high expectations for the game, this is just a game I made for the tutorial, there is no gameplay, no plot, pure entertainment Complete the quest to kill all the zombies Unless you have super high marksmanship, you'll need to search the scene for ammunition supplies 5 or more melee attacks will trigger a skill that can kill a zombie in one blow There are no health packs, which means you have to keep an eye on your health There are two maps and weapons of different difficulty for players to choose from The total production time is only 17 days This game is a teaching case game of bilibili Chen Jiacheng, not an officially released game The reason why I list Steam is just to allow my fans to quickly download the experience Game production history: 2020-6-7: The production of this game originated from a live broadcast by Bilibili titled 'Challenge to make a Zombie Game in half an hour'. 2020-8-30: Although the challenge failed, I found time to spend 3 days to improve the game slightly, and made it free for fans to try out 2020-12-3: Over the course of a few months, the number of people playing this game increased, so I spent another 7 days, 10 days in total, completely perfect the game. Development stops at this point. 2021-6-26: In order to better showcase the game, I spent the last 2 months building a website to publish my own free games for fans to play 2021-8-22: Because the download speed of Baidu online disk is slow, SO I pay 100 USD to register Steam developer and release the game here for everyone to play 2021-8-25: I spent 3 days adding new features and fixing bugs to make the game a better experience 2021-9-5: The game is officially available for download on Steam. From that day, it takes a total of 4 days to fix the bugs and add new features, and the total production time of the game is 17 days 2021-9-13: No more counting game production time There are many imperfections in the game, and there is no story, so I'm going to share it with you for free just for fun! Development cost: The total development cost of the game (excluding the time cost) includes purchasing model resources + server fees + Steam developer deposit =￥8000+ Q&amp;A Why was the game released and released on Steam? It's not an official game, it's a teaching case, just to give my fans who support me and want to play my game a way to download it quickly Why should the game be free? Because I knew the game had a lot of flaws, and it took a short time to make, but it was complete Part of the reason is that if the game is paid and the player is the consumer, but if the game is free AND I have a relaxed state What development experience do you have? As of 2021, I have 4 years of Unreal Engine experience and 2 years of Unreal Engine lecture experience. In 2018, I started to record free Unreal Engine 4 tutorials at bilibili. I also obtained an official Unreal Certified Lecturer in 2019. This game is not mine. Strength If you want to learn Unreal Engine 4 friends, bilibili searches for Unreal 4 and the first one is my tutorial. What did you do in this game? In addition to the characters and scene models I paid for, THE UI, UI interaction, functional logic, character movement system, pickup system, shooting system, damage system, scene atmosphere, AI system, game optimization, etc., were all done by myself. There was no need to apply any template In the end, thank you for playing the game. I am aware of many shortcomings, but these improvements need time and energy. I am happy to share my game, but please respect the results of my labor.[url][/url]",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1727650/header.jpg?t=1650564009",
    "Price": 0.0,
    "Developers": "谌嘉诚",
    "Publishers": "谌嘉诚",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_7a7a2c70e279615e8816d364f0cc637adfaf0128.1920x1080.jpg?t=1650564009,https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_e01b69b692a6bbf68fa4597b94b36e05b9166725.1920x1080.jpg?t=1650564009,https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_916ab5adc98da7b50c16d2bb71e54aa4835ac0e7.1920x1080.jpg?t=1650564009,https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_45035cabc904b768fca96f493b5e183f690d8d4c.1920x1080.jpg?t=1650564009,https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_522a6377239dfd5409beef14c2f4163c7d4ac90d.1920x1080.jpg?t=1650564009,https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_71d98ce1fdc3721b2402f88fb941bfa7007880c1.1920x1080.jpg?t=1650564009,https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_e31b1a8f0902c6830e59f136c7e69856a8912d04.1920x1080.jpg?t=1650564009,https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_95f4b0100eac9967d87097d1fbddafa18796ee44.1920x1080.jpg?t=1650564009,https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_277d611e70f2059185a02ded50858e448c9c42d7.1920x1080.jpg?t=1650564009,https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_8f5d082fb916281e7c0a180e9817a262a504e856.1920x1080.jpg?t=1650564009,https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_51c5a74d4f6d889e98ec573bafcf9c69f2757a6e.1920x1080.jpg?t=1650564009,https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_b09f061a3eb0bb4781a90d1a48b5ea057b59b958.1920x1080.jpg?t=1650564009,https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_a638b4e24cc387d3b581511f33ea5c3de4d231ee.1920x1080.jpg?t=1650564009,https://cdn.akamai.steamstatic.com/steam/apps/1727650/ss_9763a1e0b4542bd31c65743af665d8df4a685a7f.1920x1080.jpg?t=1650564009",
    "Slug": "deathly-stillness",
    "Meta Title": "死寂（Deathly Stillness）: Sep 4, 2021, 谌嘉诚 and Full Overview",
    "Meta Description": "Looking for information on 死寂（Deathly Stillness）? Check out the release date (Sep 4, 2021), developer insights from 谌嘉诚, and a complete game summary.",
    "Alt Text Image": "Official header image for 死寂（Deathly Stillness） game - Steam 1727650",
    "Canonical URL": "https://gusku.site/game/deathly-stillness",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6b7b\\u5bc2\\uff08Deathly Stillness\\uff09\", \"description\": \"Looking for information on \\u6b7b\\u5bc2\\uff08Deathly Stillness\\uff09? Check out the release date (Sep 4, 2021), developer insights from \\u8c0c\\u5609\\u8bda, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u8c0c\\u5609\\u8bda\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u8c0c\\u5609\\u8bda\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1727650/header.jpg?t=1650564009\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}