{
    "AppID": 1131530,
    "Name": "Dum-Dum",
    "Release date": "Sep 19, 2021",
    "About the game": "Are you ready for Hogo OS 1985 Edition? Hey, it isn't 1984 anymore! Time to trade in your dad's operating system for the next generation of computing technology! UNRAVEL THE MYSTERY In the mid-1980s, the Hogo computer operating system was considered the next big thing. It powered cutting-edge computers by providing stunning color displays, generating amazing sound, and supporting huge 426x240 pixel display monitors. It really was the future. And then practically overnight, Hogo OS disappeared. What happened is one of the biggest mysteries of the 1980s. Rumors say that an evil mastermind attempted to use Hogo OS to take over the world, and was only stopped by the bumbling actions of a complete idiot. Those rumors are true. The year is 1985. And you are that idiot. A FULL OPERATING SYSTEM EXPERIENCE FROM 1985 Dum-Dum is equally a simulator and an adventure game. You must solve puzzles and decipher clues to uncover its secrets. The interface is a full simulation of a fictional computer operating system: Hogo OS 1985 Edition. It includes everything you'd expect to find on a computer from 1985. Numerous games like Solitaire 1985 and Hogoworm Dungeon. Creativity applications like Animator and Piano Composer. Digital books, interactive stories, and features to customize your desktop. There's even a simple working BASIC programming language. But digging a little deeper will uncover new secrets, hidden activities, and quests. Part of the fun is exploring and uncovering the many programs and features of Hogo OS. Ultimately, the main story requires you to figure out how to best use the Hogo operating system to solve a puzzling mystery. Hogo OS 1985 Edition is your key to interacting with quirky characters, uncovering the strange history of the Hogo Company, and saving the world. Or...you can ignore the main story for awhile &amp; just enjoy the open-ended sandbox gameplay. That evil mastermind isn't going anywhere. OFFICIAL HOGO PRESS RELEASE, CIRCA 1985 Are you still using Hogo OS 1984 Edition? Well, time to throw that garbage in the trash can!* Welcome to Hogo OS 1985 Edition, sure to become the greatest operating system of all time! It includes many great features worthy of the name Hogo: Rad interface graphics! Clock program that keeps real time! Over 30 system colors, now including cyan! WE DID IT! Ability to open three programs at the same time! Did someone say multiple tasking?? Hogo OS 1985 Edition also comes with an exclusive new game called Dum-Dum. Interact with a virtual friend who is forced to play with you, using multiple floppy disks worth of video. And you don't even need a floppy drive to play! In addition, Hogo OS 1985 Edition includes a cutting-edge new system called Electro-sharing. Through the use of proprietary Hogo technocode, it will soon be possible to connect your computer directly with someone who isn't even in the same room as you! Imagine: instead of going to the post office, you could send digital messages to Hogo computing professionals who could receive them IMMEDIATELY!** You could also use it to install new programs, expand your computer's capabilities, and so much more! We call it Electro-sharing, but we think you'll call it The Future! *Seriously, stop using Hogo OS 1984 Edition. **Hogo computing professionals are not required to respond to messages they receive through Electro-sharing.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1131530/header.jpg?t=1650494336",
    "Price": 14.99,
    "Developers": "Hogo Company",
    "Publishers": "Hogo Company",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1131530/ss_8a7dea343d1d7ced2b663063d749aa2a7c38c137.1920x1080.jpg?t=1650494336,https://cdn.akamai.steamstatic.com/steam/apps/1131530/ss_ac91bc234c36dc8bd2e46f6f672653b7d7dc6bec.1920x1080.jpg?t=1650494336,https://cdn.akamai.steamstatic.com/steam/apps/1131530/ss_3c2de4abe5e5031d57f7fdf2d7503546b69d9166.1920x1080.jpg?t=1650494336,https://cdn.akamai.steamstatic.com/steam/apps/1131530/ss_141389c924a47264bee5796acea46f7364b9aec6.1920x1080.jpg?t=1650494336,https://cdn.akamai.steamstatic.com/steam/apps/1131530/ss_a8f98fb7647e964a0371b1d3fbdec4965d663519.1920x1080.jpg?t=1650494336,https://cdn.akamai.steamstatic.com/steam/apps/1131530/ss_9f5372b5b18aaf7d3e8b45f9979be6d66d78a58c.1920x1080.jpg?t=1650494336,https://cdn.akamai.steamstatic.com/steam/apps/1131530/ss_c439e4371b61e4e5b9a6472ffa6f2806f99403f4.1920x1080.jpg?t=1650494336,https://cdn.akamai.steamstatic.com/steam/apps/1131530/ss_26f1d84944225e146e1f48eefdc4dfd4dba6e582.1920x1080.jpg?t=1650494336,https://cdn.akamai.steamstatic.com/steam/apps/1131530/ss_e882b37a87d0895267d4919542d5513b7f2897f8.1920x1080.jpg?t=1650494336",
    "Slug": "dum-dum",
    "Meta Title": "Dum-Dum: Sep 19, 2021, Hogo Company and Full Overview",
    "Meta Description": "Looking for information on Dum-Dum? Check out the release date (Sep 19, 2021), developer insights from Hogo Company, and a complete game summary.",
    "Alt Text Image": "Official header image for Dum-Dum game - Steam 1131530",
    "Canonical URL": "https://gusku.site/game/dum-dum",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dum-Dum\", \"description\": \"Looking for information on Dum-Dum? Check out the release date (Sep 19, 2021), developer insights from Hogo Company, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hogo Company\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hogo Company\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1131530/header.jpg?t=1650494336\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}