{
    "AppID": 1891090,
    "Name": "Final Vendetta",
    "Release date": "Jun 16, 2022",
    "About the game": "Final Vendetta is a hard-hitting action packed beat ‘em up for 1 or 2 players in the vein of classic arcade titles. Featuring stunning pixel art and a thumping soundtrack with exclusive tracks from Utah Saints! Brawl with bad dudes and tough girls as you fight through dangerous environments. Story The notorious “Syndic8” gang are slowly taking control of the capital and have kidnapped Claire Sparks’ younger sister. Unfortunately for them, Claire will do whatever it takes to get her back and crush anyone who stands in her way! She teams up with her two friends (and housemates) - retired pro-wrestler Miller T. Williams and Duke Sancho, the streetwise bare-knuckle fighter. Together they must battle and brawl their way through the mean streets of London in a risky mission to reunite Claire with her sister. Characters Claire Sparks, a student and martial arts expert, who has become unwillingly embroiled in the rescue of her sister. Duke Sancho is a quick-witted, bare-knuckle fighter from London, earning his nickname after a brawl in the Duke of Wellington pub. Not forgetting the towering figure of Miller T. Williams; a Canadian ex-pro wrestler, controversially removed from competitions for use of excessive force. Together the three friends must battle their way through the streets of London on a dangerous journey to bring back Claire’s sister! Gameplay The gameplay mechanics are sure to go down well with fans of the genre, giving players a vast array of moves and the ability to block, run, dodge, strike downed opponents, and even perform juggle combos! Each character has a unique feel and move set that the player will have to master. Soundtrack Final Vendetta has a thumping soundtrack featuring brand new and exclusive tracks from Utah Saints, Featurecast and Krafty Kuts! The UK is known for its dance music scene and this electrifying soundtrack compliments all the action Final Vendetta has to offer in tremendous style.  Key Features Hardcore fighting action that pulls no punches. Stunningly animated pixel art. A thumping dance/techno soundtrack featuring exclusive tracks from Utah Saints and Featurecast. 1 or 2 player co-op. 3 playable characters with varying fighting styles. 6 areas to battle your way through. Classic beat-‘em-up gameplay with fresh mechanics. 4 exciting game modes – Arcade, Survival, Versus &amp; Boss Rush. 3 difficulty settings. Several unlockables. Dozens of moves and combos to master. An array of succulent street food to sample.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1891090/header.jpg?t=1657547011",
    "Price": 24.99,
    "Developers": "Bitmap Bureau",
    "Publishers": "Numskull Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1891090/ss_6d1e9cb6ec65e535f4489563277013b159ff7af0.1920x1080.jpg?t=1657547011,https://cdn.akamai.steamstatic.com/steam/apps/1891090/ss_f72558edc058549a6a2362a3e5d2bf8aa3740131.1920x1080.jpg?t=1657547011,https://cdn.akamai.steamstatic.com/steam/apps/1891090/ss_e88a09bd88290e1471f430cb958064f9c7e6998c.1920x1080.jpg?t=1657547011,https://cdn.akamai.steamstatic.com/steam/apps/1891090/ss_ef351c55221c27ecaa152ad4432e5bdb6577cf53.1920x1080.jpg?t=1657547011,https://cdn.akamai.steamstatic.com/steam/apps/1891090/ss_57d0d901de34cbe9cc2537af4ea8f6d690e1d20d.1920x1080.jpg?t=1657547011,https://cdn.akamai.steamstatic.com/steam/apps/1891090/ss_ee30e3a569c426d414674a948802f13d2a42b16c.1920x1080.jpg?t=1657547011",
    "Slug": "final-vendetta",
    "Meta Title": "Final Vendetta: Jun 16, 2022, Bitmap Bureau and Full Over...",
    "Meta Description": "Looking for information on Final Vendetta? Check out the release date (Jun 16, 2022), developer insights from Bitmap Bureau, and a complete game summary.",
    "Alt Text Image": "Official header image for Final Vendetta game - Steam 1891090",
    "Canonical URL": "https://gusku.site/game/final-vendetta",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Final Vendetta\", \"description\": \"Looking for information on Final Vendetta? Check out the release date (Jun 16, 2022), developer insights from Bitmap Bureau, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bitmap Bureau\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Numskull Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1891090/header.jpg?t=1657547011\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}