{
    "AppID": 1882240,
    "Name": "Forgotten Realms: The Archives - Collection One",
    "Release date": "Mar 29, 2022",
    "About the game": "The Forgotten Realms world of Dungeons &amp; Dragons has been home to many a hero and imagination since its publication, producing adventures and stories to be retold and enjoyed for years to come. The Forgotten Realms Archive - Collection One allows you to journey through one such set of adventures: the Eye of the Beholder trilogy, a set of first-person, real-time role-playing games. EYE OF THE BEHOLDER A new evil is plaguing the city of Waterdeep, stalking the streets and preying on its citizens. Though initially thought to come from afar, this great evil, known only as Xanathar, instead resides within Waterdeep and, if not stopped, threatens to overwhelm the city. The Lords of Waterdeep believe that the evil lurks in the sewers below and have commissioned a party of adventurers to investigate and foil this nefarious plot. Granted full rights of marque and ownership of any treasure, artifacts or valuables you find on your quest, you must venture into the chasms, discover the nature of this evil and destroy it by any means necessary. EYE OF THE BEHOLDER II: THE LEGEND OF DARKMOON Following your quest in the sewers beneath, you and your party are recovering with Waterdeep’s finest healers, when a letter arrives from Khelben Blackstaff, mystic advisor to the Lords of Waterdeep. Trouble is brewing in the Northern and Western regions, and he has tasked you with exploring the land and investigating these incidents. Although nothing has been confirmed, renowned but troublesome archaeologist, Wently Kelso believes the disturbances are related to an evil uprising and the presence of a powerful ancient artefact. These troubles could, of course, simply be the work of unruly bandits, but since Kelso’s previous findings in the sewers of Waterdeep proved true, one would be wise not to easily dismiss his opinion on the matter. Therefore, you should exercise greater care and vigilance as you begin your next adventure. EYE OF THE BEHOLDER III: ASSAULT ON MYTH DRANNOR Having rid the sewers of Waterdeep and the dreaded Temple Darkmoon of the evil forces within, you and your companions are surely deserving of a strong drink, good food and a warm fire. And so, your first port of call is to the nearest tavern, where you slop ale all over yourself and engage in jovial antics as you regale your adventures to your captivated listeners and admirers. However, in the midst of your retelling, the tavern door is thrust open by a hooded figure, whose eyes scan the crowd before locking on you and your party. Approaching you, he quickly introduces himself and explains his reasons for disturbing the festivities; his master wishes you to free the ruined city of Myth Drannor from the clutches of a Lich and restore it to its former glory. Looks like your adventures aren’t over just yet… With an original story set in the Forgotten Realms universe, the Eye of the Beholder trilogy is based on the Advanced Dungeon &amp; Dragons 2nd Edition’s game rules. Bringing the immersion, wonder and epicness of a D&amp;D campaign to the PC, the Eye of the Beholder is a genre-defining and beloved series for RPG and Dungeons &amp; Dragons fans alike. Assemble your party across various races and classes - from human to dwarf, cleric to thief Use weapons, magic and resolve to ensure your survival as you complete your quests Transfer your party across all three titles to keep your band of adventurers together to the very end Explore the various dungeons, ruins and secrets that Waterdeep Sewers, Temple Darkmoon and Myth Drannor have to offer Fight a wide array of monsters and restore peace to the Forgotten Realms",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1882240/header.jpg?t=1648566055",
    "Price": 7.49,
    "Developers": "Westwood Associates,Strategic Simulations",
    "Publishers": "SNEG",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1882240/ss_674164a27c66d986ee4e0cf04fac85d4843c5efa.1920x1080.jpg?t=1648566055,https://cdn.akamai.steamstatic.com/steam/apps/1882240/ss_9a150bceab33e382a4129e614e065a9640b10dc4.1920x1080.jpg?t=1648566055,https://cdn.akamai.steamstatic.com/steam/apps/1882240/ss_0950d3b693ff4106849f30af1e4efc52b758db3f.1920x1080.jpg?t=1648566055,https://cdn.akamai.steamstatic.com/steam/apps/1882240/ss_f08cb732f5d1b692377c2131f7051691a80097d9.1920x1080.jpg?t=1648566055,https://cdn.akamai.steamstatic.com/steam/apps/1882240/ss_19c4dbeb2191cc8e2b003d559c51b42a0c4c6fa3.1920x1080.jpg?t=1648566055,https://cdn.akamai.steamstatic.com/steam/apps/1882240/ss_0bb6019e9d5c4a272c98aa169563848bb847b4f1.1920x1080.jpg?t=1648566055,https://cdn.akamai.steamstatic.com/steam/apps/1882240/ss_02edc47bd53f1418e15eaa86d388085578b6746c.1920x1080.jpg?t=1648566055,https://cdn.akamai.steamstatic.com/steam/apps/1882240/ss_2c7c74c58b53efc9a2ddc0b24910545f0f4222df.1920x1080.jpg?t=1648566055,https://cdn.akamai.steamstatic.com/steam/apps/1882240/ss_911655984386b3ff1701ebb7b2577f4d63d5e37c.1920x1080.jpg?t=1648566055,https://cdn.akamai.steamstatic.com/steam/apps/1882240/ss_6fdec6c858a53495baf4f1e3e3a3061fb25932d1.1920x1080.jpg?t=1648566055,https://cdn.akamai.steamstatic.com/steam/apps/1882240/ss_c8e0426d14f72de7e29da5f8190bed0b289fb3ea.1920x1080.jpg?t=1648566055",
    "Slug": "forgotten-realms-the-archives-collection-one",
    "Meta Title": "Forgotten Realms: The Archives - Collection One: Mar 29, ...",
    "Meta Description": "Looking for information on Forgotten Realms: The Archives - Collection One? Check out the release date (Mar 29, 2022), developer insights from Westwood ...",
    "Alt Text Image": "Official header image for Forgotten Realms: The Archives - Collection One game - Steam 1882240",
    "Canonical URL": "https://gusku.site/game/forgotten-realms-the-archives-collection-one",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Forgotten Realms: The Archives - Collection One\", \"description\": \"Looking for information on Forgotten Realms: The Archives - Collection One? Check out the release date (Mar 29, 2022), developer insights from Westwood ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Westwood Associates,Strategic Simulations\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SNEG\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1882240/header.jpg?t=1648566055\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}