{
    "AppID": 1109160,
    "Name": "Giants Uprising",
    "Release date": "Nov 2, 2021",
    "About the game": "You probably have fought giants in other games and it was a challenging task but... How about playing as one? In Giants Uprising you take control of big and very angry guy and noone should stand in your way. YOU are the embodiment of revenge and havoc! Destruction: crush everything standing in your way. If you see something - most likely you can flatten it! Feel the unrelenting force and sheer dominance! Epic battles: fight hundreds of infantry and their siege equipment or pick someone your size and clash with other bloodthirsty giants. Impactful abilities: pick your destiny and passive abilities to guide you in your journey. Customization: cause mayhem with style! Customize your giant and soak your new clothes in blood. STORY BEHIND THE CARNAGE The ancient race of giants dwindles. Their wisdom is all but forgotten, powerful kings of old dead, and their once proud, great cities lie in ruin, slowly consumed by time and elements. Betrayed by humans - their former friends and allies - nowadays enslaved giants serve as workers and terrible machines of war, used by humans to expand their vast domains. But the time of reckoning is nigh. As a runaway giant slave, accompanied by your fellow human convict, you will carry your wrath, anger and lust for revenge to the oppressor's settlements. Reclaim your right to freedom, find what happened with your enslaved kin, smash your enemies and be the spark of the Giant's Uprising! The giant’s blood pumping through your veins boils and demands a sacrifice now. Feel the real power coming from the deep-seated origins of domination and violence. Since the human race enslaved your kin, you only know to hate, shed blood. But there is only one way to quench your thirst for righteousness - to kill everyone on your way, destroy village after village, and depose leaders whose wealth got paid in giant’s freedom. Humiliation and slavery are the crude everyday realities of being a Giant. But do not abandon your brothers, and do not forget that through this darkness you and your human companion will carry the light of freedom.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1109160/header.jpg?t=1657138375",
    "Price": 19.99,
    "Developers": "VARSAV Game Studios",
    "Publishers": "VARSAV Game Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1109160/ss_7c6db1542b442e4f0fd2f2253214ee9e3a8c8637.1920x1080.jpg?t=1657138375,https://cdn.akamai.steamstatic.com/steam/apps/1109160/ss_db3deba13f37e18644b793bc533a59581cd12c52.1920x1080.jpg?t=1657138375,https://cdn.akamai.steamstatic.com/steam/apps/1109160/ss_804d7b4bdffabad70cc39d7221985d3df79d29eb.1920x1080.jpg?t=1657138375,https://cdn.akamai.steamstatic.com/steam/apps/1109160/ss_0ad9a05598ff062510ab479c6bec70322f20699d.1920x1080.jpg?t=1657138375,https://cdn.akamai.steamstatic.com/steam/apps/1109160/ss_24911cb3ea1bcac8c20fec5fab8a0a3cb420384c.1920x1080.jpg?t=1657138375,https://cdn.akamai.steamstatic.com/steam/apps/1109160/ss_8bb218fe4ae3976e700f1ed5f5246252ec3465d4.1920x1080.jpg?t=1657138375",
    "Slug": "giants-uprising",
    "Meta Title": "Giants Uprising: Nov 2, 2021, VARSAV Game Studios and Ful...",
    "Meta Description": "Looking for information on Giants Uprising? Check out the release date (Nov 2, 2021), developer insights from VARSAV Game Studios, and a complete game s...",
    "Alt Text Image": "Official header image for Giants Uprising game - Steam 1109160",
    "Canonical URL": "https://gusku.site/game/giants-uprising",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Giants Uprising\", \"description\": \"Looking for information on Giants Uprising? Check out the release date (Nov 2, 2021), developer insights from VARSAV Game Studios, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"VARSAV Game Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VARSAV Game Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1109160/header.jpg?t=1657138375\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}