{
    "AppID": 605230,
    "Name": "Grey Hack",
    "Release date": "Dec 14, 2017",
    "About the game": "Grey Hack is a massively multiplayer hacking simulator game. You're a hacker with full freedom to act as you wish on a vast network of procedurally generated computers. File Explorer, Terminal and Text Editor are some of the programs that will be available from the start of the game. As you improve your skills you will find new utilities that you may install and use. A living persistent world Explore the Grey Hack universe and forge your own reputation in a world shared by all players. When you leave the game, the online universe remains actively running 24/7 . This always active game session means that the changes you have made in any computer in the world can be seen by players who connect to them even if you are no longer online. Your progress will be saved, but your actions may have consequences. Plan your attacks Each network in the world has a totally different configuration, size and security, also using a dynamic and deep exploit system so that each network and computer poses a different challenge. Study your target; use social engineering, scan the system for administrator flaws that allow a backdoor to be opened, test different possible exploits, but above all, cover your tracks when you're done. Create, modify, share The terminal has a fundamental role, based on real UNIX commands; it is an indispensable tool for carrying out successful attacks. Terminal commands and exploits have been built using the scripting language available in the game, this means that you can modify any existing command or create your own if you wish. In the same way you can create your own exploits if the ones that are already available in the world do not satisfy your needs. Sandbox Grey Hack offers a non-linear experience where you progress at your own pace. Publish web pages to share your creations, create guilds and organize attacks against other players, carry out commissioned missions to earn money and reputation, or explore the world on your own where special missions and other secrets are hidden. Single Player Mode Grey Hack is intended to be played in Multiplayer Mode, benefiting from the richer environment of an always-online universe, but the game also offers a single player mode for those so inclined. In Single Player mode, you play in a world created on your computer. Unlike Online Mode, when you exit the game in Single Player, the in-game universe stops, and progress resumes only upon your return. Roadmap Grey Hack is in the Alpha phase version 0.7. You can check the Roadmap here . I am open for suggestions. If there is any feature you would like to see in the game, do not hesitate to let me know through the Steam forums or the official Discord server .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/605230/header.jpg?t=1646941560",
    "Price": 19.99,
    "Developers": "Loading Home",
    "Publishers": "Loading Home",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/605230/ss_57a5e89d6a2a51a2d8bea405c79ea9b387a57391.1920x1080.jpg?t=1646941560,https://cdn.akamai.steamstatic.com/steam/apps/605230/ss_38c356d35aa72a3dbfdbf6ffe1d6f001eec1e1cc.1920x1080.jpg?t=1646941560,https://cdn.akamai.steamstatic.com/steam/apps/605230/ss_d401a0163ac0d5e42cff330829230c21f97308b8.1920x1080.jpg?t=1646941560,https://cdn.akamai.steamstatic.com/steam/apps/605230/ss_7d90c7f76c67a713cfa9f157d61b772f4d178cba.1920x1080.jpg?t=1646941560,https://cdn.akamai.steamstatic.com/steam/apps/605230/ss_5b629c403a2ccd05b933b82eb1d7ceffce21c21d.1920x1080.jpg?t=1646941560,https://cdn.akamai.steamstatic.com/steam/apps/605230/ss_30262fb9a7a9bb57386edb1c165a34d6c21a5f59.1920x1080.jpg?t=1646941560,https://cdn.akamai.steamstatic.com/steam/apps/605230/ss_f782af2351b789f34190d30dd94fad1b2cbb43a9.1920x1080.jpg?t=1646941560,https://cdn.akamai.steamstatic.com/steam/apps/605230/ss_3fa81aa80455b07136c915a53dca57074ced09d8.1920x1080.jpg?t=1646941560,https://cdn.akamai.steamstatic.com/steam/apps/605230/ss_3db21f95e353b43470013d9ab751955933ae7b20.1920x1080.jpg?t=1646941560",
    "Slug": "grey-hack",
    "Meta Title": "Grey Hack: Dec 14, 2017, Loading Home and Full Overview",
    "Meta Description": "Looking for information on Grey Hack? Check out the release date (Dec 14, 2017), developer insights from Loading Home, and a complete game summary.",
    "Alt Text Image": "Official header image for Grey Hack game - Steam 605230",
    "Canonical URL": "https://gusku.site/game/grey-hack",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Grey Hack\", \"description\": \"Looking for information on Grey Hack? Check out the release date (Dec 14, 2017), developer insights from Loading Home, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Loading Home\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Loading Home\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/605230/header.jpg?t=1646941560\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}