{
    "AppID": 1253880,
    "Name": "Heart Fragment",
    "Release date": "Jul 30, 2021",
    "About the game": "Can you collect all of the fragments, solve the mysteries, and find your way to a happy ending? In this mysterious otome game, play as a protagonist (name customizable but 'Xani' by default) struggling to cope with the hand life has dealt you. Your mother's death was a tragedy that left you cynical and numb to the world. Now, though, greater challenges are piling up fast - and it all begins when you find out you are not entirely human. The disappearance of a friend. A sudden attack that leaves you wounded. Mysterious characters entering and leaving your life. Growing bonds. Coming to terms with what exactly 'humanity' is... Please. Find a happy ending. Don't let tragedy be the only option. Six main paths containing a variety of romantic, platonic, and family-based endings - and bad endings too, so stay on guard. You influence the story with hundreds of choices to make in-game, and at the same time you have the potential to influence the protagonist's personality traits. An in-game feature to check the protagonist's social media feed and unlock bonus content &amp; CGs in a unique artstyle. Your endgame partner is your choice. The final route allows you to pick your endgame romantic partner / endgame BFF. Over 40 endings in the main paths and additional 10+ in the final route. A diverse and fun cast of characters to learn about. Beautiful artwork in your choice of two different styles, gorgeous OST, and partial voice acting (including optional main character voice options). Male protagonist/gender &amp; pronoun selection with alternate CGs and voice lines. Heart Fragment is split into four 'books'. Wishlist the DLC for Book Two: Belief Fragments coming summer 2022! Available now, Heart Fragment Book One: Fantasy Fragments contains the full routes for Kay &amp; Clive. A mysterious figure that appears to you and sets the events of the story into motion is a young man named Kay who always seems to have a smile plastered on his face as he reveals strange secrets to you. His friendly personality makes him easy to open up to despite the odd circumstances. On the other hand, Clive seems to have a knack for popping up at 'just the right moment'. A string of coincidental encounters combined with his awkward demeanor cause you to wonder what his intentions really are. With strong elements of fantasy present in this book, a lot of questions are raised and shocking reveals begin. The second installment to Heart Fragment is coming out as DLC to add to Book One in summer 2022. It has the full routes for Shannon &amp; Lana. Your established bond with your best friend Shannon makes you hesitant to open up to her about your struggles. Not out of any desire to hide things - you just don't want Shannon to be dragged into a potentially dangerous situation. Meanwhile, you haven't seen Lana in ten years; not since the death of your mother. Lana looks a bit different now with her dyed pink hair but she's still the same caring girl with a bit of a wild side that you remember from your youth. Book Two focuses on the reality of things, dealing with matters at a surface level. If you strip away fantasy and leave only belief in those around you behind, what answers will you be able to find? Coming later on in 2022, Book Three (another free update) has the full routes for Jasper &amp; Natalia. The antagonist of your story, a man named Jasper Finley, despises you for the history of disputes between your families and an ingrained hatred for mutated DNA. You know how dangerous he is, but... will your curiosity get the best of you? Natalia is an enigma. Her entrance into your life could be seen as either a blessing or a horrible curse as she introduces both a way out of your struggles and a way to dive head-first into misery. Book Three reveals intentions and motives that you may have begun to piece together through the previous routes, but what will you discover by examining that evidence from the viewpoint of the villain? These updates were unlocked from the Heart Fragment Kickstarter stretch goals that all you lovely players helped out with! Epilogues for all good endings &amp; major bad endings (coming late 2022) Flashback scene CGs for all characters (coming in summer 2022) More retellings of major events in alternate POVs (coming in summer 2022) Inigo added as a bonus romance (coming in the Finale release)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1253880/header.jpg?t=1654153478",
    "Price": 0.0,
    "Developers": "Starfield Gaming",
    "Publishers": "Starfield Gaming",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_66cf386b034c0f5528237d7cdea5ed3556bd0f30.1920x1080.jpg?t=1654153478,https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_36266b8083de200dc4d37531b7a6e1b7148debff.1920x1080.jpg?t=1654153478,https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_213f1a89c48fb4a54c3bf50bf477ede009392384.1920x1080.jpg?t=1654153478,https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_55fa7a1909b2f1a504416bfbc683bf0471063e17.1920x1080.jpg?t=1654153478,https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_6c252fc15604f29c3ca4d34fca7da371f198511e.1920x1080.jpg?t=1654153478,https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_d9e079c84cd34607661ec82887a98c601530c6cc.1920x1080.jpg?t=1654153478,https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_5878280932368ebc0d215f44d5a0a2bccbbfedb7.1920x1080.jpg?t=1654153478,https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_80b44327037e68b1088dfd380d067390ae5cc82f.1920x1080.jpg?t=1654153478,https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_9b39d2a0fcf7885ca1d41118791e0267c22a7656.1920x1080.jpg?t=1654153478,https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_a100c9b25add19a1c203989188df6d02dd4dcfec.1920x1080.jpg?t=1654153478,https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_02d5a692bd5875de7ada284fe68529b2e9b8ee71.1920x1080.jpg?t=1654153478,https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_ec15d2015765108618bde8c62df68e9ab6a8354f.1920x1080.jpg?t=1654153478,https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_2286e622644c3378f2eec5a73f18f652512895b7.1920x1080.jpg?t=1654153478,https://cdn.akamai.steamstatic.com/steam/apps/1253880/ss_b01530e3bce0bbe3c59982fbd36d93da09e22ee8.1920x1080.jpg?t=1654153478",
    "Slug": "heart-fragment",
    "Meta Title": "Heart Fragment: Jul 30, 2021, Starfield Gaming and Full O...",
    "Meta Description": "Looking for information on Heart Fragment? Check out the release date (Jul 30, 2021), developer insights from Starfield Gaming, and a complete game summ...",
    "Alt Text Image": "Official header image for Heart Fragment game - Steam 1253880",
    "Canonical URL": "https://gusku.site/game/heart-fragment",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Heart Fragment\", \"description\": \"Looking for information on Heart Fragment? Check out the release date (Jul 30, 2021), developer insights from Starfield Gaming, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Starfield Gaming\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Starfield Gaming\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1253880/header.jpg?t=1654153478\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}