{
    "AppID": 1453920,
    "Name": "Heroes of Three Kingdoms",
    "Release date": "Dec 11, 2020",
    "About the game": "Introduction to the game The plot of this work is very rich. In the plot, it is planned to develop the biography of Shu, Wei, Wu and Lv Bu. At present, we have developed the history oriented biography of Shu Han in the history of the Three Kingdoms, and planned to develop the legend of Lv Bu of the Three Kingdoms in the direction of myth. In the future, we will develop the biography of Cao Cao and the biography of Dongwu. If there are any problems in the game, you can add players to communicate with QQ group: 640192884, give us feedback, let's enrich and improve the story of the Three Kingdoms. a brief introduction to the story of Shu Han in the annals of the Three Kingdoms At the end of the Eastern Han Dynasty, eunuchs disordered politics, frequent border troubles, natural disasters, and the imperial court constantly increased troops and taxes, which made the people miserable. At this time, a huge force has accumulated for a long time, ready to change the world. And our story begins with a marriage in a small village There are millions of words in the script of the plot. Referring to various classical books, each level has been carefully designed, and the single game chess playing method is adopted. Not only can the SL method of traditional war chess be used, but also the level can be selected to play at any time. With the development of the plot, military generals, equipment and props can be obtained. The concept of 'difficulty' and 'dynamic level' is also added to the game story, which allows players to repeatedly choose different difficulty stories to challenge, and does not need to start over again. fine art there are more than 100 generals in the game. All the image models are modeled by 3D high plane number and rendered into 2D, restoring the classic painting style; the voice of each military general is independently configured by a professional voice engineer, and even the soldiers have their own special voice; high resolution (up to 1920 * 1080) is adopted for the new internal and external scenes; rich in various kinds of action, animation, particles, special effects and other art effects; particularly delicate plot, even when the characters enter the door and cross the threshold, there are actions; [/] humanized general in the game scenario, players will continuously obtain new generals and equipment, and gain experience through combat, and upgrade their ability. Therefore, we specially designed a set of unique experience system, in which players control the unique growth path. For specific experience rules, please refer to the game encyclopedia. the general transfer system, talent system and strategy system ensure the uniqueness of each general. Different professions have different positioning. You can create a highly effective team through reasonable lineup matching. every famous general has his own unique must kill and passive special effects. When we create character skills, we also restore them according to the historical characteristics of the characters. If you observe the skills of each character carefully, you will find many interesting things. deep game mechanism We designed a very deep game mechanism for the game complex and changeable terrain, which affects the combat effectiveness of heroes; the weather affects the fighting ability of the hero. Some heroes can even change the weather all kinds of attack types, such as physical attack, physical double-click, physical combo, magic counterattack, physical counterattack, physical counterattack, counterattack after counterattack, physical pursuit attack, magic pursuit attack, physical pursuit attack, magic pursuit attack, guided attack, fight attack, double-click attack, spell combo, spell physical Combo, and spell fight combo; ha ha! Don't worry, our game encyclopedia will explain these concepts in detail. However, if you are a novice player of war chess, you don't need to care too much about these concepts. We have designed a plot with simple difficulty for you:) there are more than 200 special effects, such as hate attack, armor breaking attack, wind attack, killing attack, first attack, flanking attack, and anger attack. Of course, they are not listed here to show that this is not a mindless game. It has skills and depth. In difficult mode, players can not even take a wrong step to win, just like he Gao Just like playing chess, you need to accurately calculate the move of each step. Of course, we have designed a simple mode for novice players:) very intelligent AI. We have designed more than 50 AI segments and a huge AI behavior tree for the game. According to the situation on the field, AI will intelligently choose the most reasonable arrangement to give players higher challenges.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1453920/header.jpg?t=1616569502",
    "Price": 9.99,
    "Developers": "Wuwei",
    "Publishers": "Bantu",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1453920/ss_101b36b514f0552f6baf8cf462211a0aa8369099.1920x1080.jpg?t=1616569502,https://cdn.akamai.steamstatic.com/steam/apps/1453920/ss_12eeeb4ec2e1ee05ce9d00200d447a8ef85cfb70.1920x1080.jpg?t=1616569502,https://cdn.akamai.steamstatic.com/steam/apps/1453920/ss_24f48fbecfcf04fcc43d872463f4f54059baf584.1920x1080.jpg?t=1616569502,https://cdn.akamai.steamstatic.com/steam/apps/1453920/ss_117ba0973a03facc38d136e265cd1fc76a982b08.1920x1080.jpg?t=1616569502,https://cdn.akamai.steamstatic.com/steam/apps/1453920/ss_fb507cfcc5156150b813529c3d50a5d1d8061db7.1920x1080.jpg?t=1616569502,https://cdn.akamai.steamstatic.com/steam/apps/1453920/ss_13c21629bfe72feccf953e8a90feddde0a36af1a.1920x1080.jpg?t=1616569502,https://cdn.akamai.steamstatic.com/steam/apps/1453920/ss_5fc03a5370b12ccdfea1c9f7aee3321897b42cd5.1920x1080.jpg?t=1616569502,https://cdn.akamai.steamstatic.com/steam/apps/1453920/ss_9024e2aa4dca54d0b03c621a8ee4f515e7cd4fd8.1920x1080.jpg?t=1616569502,https://cdn.akamai.steamstatic.com/steam/apps/1453920/ss_535011186eb2347f4a723b6d25a2cfc9332b412e.1920x1080.jpg?t=1616569502,https://cdn.akamai.steamstatic.com/steam/apps/1453920/ss_1094e638417c5bf410c1ce442b5cb6421ae9af58.1920x1080.jpg?t=1616569502,https://cdn.akamai.steamstatic.com/steam/apps/1453920/ss_a984e37afb79d86eff8c34d82cd0e32ce1fe8742.1920x1080.jpg?t=1616569502,https://cdn.akamai.steamstatic.com/steam/apps/1453920/ss_39bd068aab3b9cca8fcb328b408bddf7d3364bff.1920x1080.jpg?t=1616569502,https://cdn.akamai.steamstatic.com/steam/apps/1453920/ss_af60342afd0fb5c05cfa65b82a378f918dda2a5c.1920x1080.jpg?t=1616569502",
    "Slug": "heroes-of-three-kingdoms",
    "Meta Title": "Heroes of Three Kingdoms: Dec 11, 2020, Wuwei and Full Ov...",
    "Meta Description": "Looking for information on Heroes of Three Kingdoms? Check out the release date (Dec 11, 2020), developer insights from Wuwei, and a complete game summary.",
    "Alt Text Image": "Official header image for Heroes of Three Kingdoms game - Steam 1453920",
    "Canonical URL": "https://gusku.site/game/heroes-of-three-kingdoms",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Heroes of Three Kingdoms\", \"description\": \"Looking for information on Heroes of Three Kingdoms? Check out the release date (Dec 11, 2020), developer insights from Wuwei, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 11, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wuwei\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bantu\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1453920/header.jpg?t=1616569502\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}