{
    "AppID": 463290,
    "Name": "Kismet",
    "Release date": "May 2, 2016",
    "About the game": "Now available for non-VR PCs! A quick announcement from Team Kismet: Since releasing Kismet as a VR title, we have been extremely grateful to receive such a positive response. However, because there are so many more PC owners out there in the world who are still yet to adopt VR, we wanted to find a way to get Kismet to them as well. For that reason, we have added in a third launch option, in addition to HTC Vive and Oculus Rift -- a new non-VR version. We have also dropped the price and added subtitles for English, French, Spanish, German and Japanese. (VR versions will also now feature these subtitles.) The below description is still accurate to the game, and anyone on Steam who has purchased Kismet in the past or purchases it in the future will have access to the VR and non-VR versions. Would you like to know what the future holds in store for you? Put on your Oculus Rift or HTC Vive headset and take part in a first-of-its-kind VR experience: Kismet . Developed by award-winning creative studio Psyop, Kismet is a collection of three activities, including a past-present-future Tarot Card reading (“ The Cards ”), daily Astrology session (“ The Stars ”), and ancient boardgame Ur (“ A Game of Wit ”). Powered by a deck of 22 hand-painted Tarot cards and an accurate real-time map of the solar system, Kismet is meant to be experienced daily, with unique outcomes that are directly tied to not only the cards that you choose, but your birthday and the actual alignment of celestial bodies at the time of your reading. Seated across a table from an enchanted automaton with the power to look into the future, you’ll be transported to a place where magic is real, brought to life in a beautifully detailed, handmade, Gothic style. Attention Oculus Rift Users: Kismet is available in two versions, one for Vive and one for Rift. To launch the Rift version, you need to find the game in your Library, right click it, and launch it in the 'Other VR' mode (as opposed to Vive mode). If you accidentally launch Vive mode, such as through an icon created during the game's Steam installation process, the game will be unable to find your Xbox controller. Attention HTC Vive Users: Because Kismet is a sitting experience in a room scale environment, we recommend that you find a comfortable place to sit down and then reset your seated position at that point. To do that on the Vive, push the bottom button on your motion controller to bring up the Steam menu, aim at the Settings cog at the bottom of the menu, pull the trigger, and select 'Reset Seated Position' from the General VR Settings menu. After that, you can move your head around to inspect the details of the environment and take advantage of positional audio within the experience. Kismet is designed to work with each individual headset's bundled controllers. On Vive it is compatible with motion control, on Rift it is compatible with Microsoft Xbox One gamepad. Kismet has multiple graphics quality settings which are bound to the keyboard. The Lowest quality setting is mapped to the '1' key, Medium is set to '2', and the High graphics setting is mapped to '3'. Kismet's default render quality is set to '2' Medium, and will run on minimum specification hardware. If your machine is more powerful than minimum specifications, try bumping up to the next rendering level!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/463290/header.jpg?t=1638898723",
    "Price": 0.0,
    "Developers": "Psyop",
    "Publishers": "Psyop",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/463290/ss_207d448d2f96597f671fbd6d4568e72a9f4dbbf3.1920x1080.jpg?t=1638898723,https://cdn.akamai.steamstatic.com/steam/apps/463290/ss_6b6ff1dae86ca8bbb58d44d032148d5c1e7cc1b7.1920x1080.jpg?t=1638898723,https://cdn.akamai.steamstatic.com/steam/apps/463290/ss_3da807df7214405b3a178645663a0282161063a9.1920x1080.jpg?t=1638898723,https://cdn.akamai.steamstatic.com/steam/apps/463290/ss_34dc3ffa453ab48de7c7b39a9f0fd03e39ec8bd4.1920x1080.jpg?t=1638898723,https://cdn.akamai.steamstatic.com/steam/apps/463290/ss_46d1cf09113325376f1994502722b1958e96ec85.1920x1080.jpg?t=1638898723",
    "Slug": "kismet",
    "Meta Title": "Kismet: May 2, 2016, Psyop and Full Overview",
    "Meta Description": "Looking for information on Kismet? Check out the release date (May 2, 2016), developer insights from Psyop, and a complete game summary.",
    "Alt Text Image": "Official header image for Kismet game - Steam 463290",
    "Canonical URL": "https://gusku.site/game/kismet",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kismet\", \"description\": \"Looking for information on Kismet? Check out the release date (May 2, 2016), developer insights from Psyop, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 2, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Psyop\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Psyop\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/463290/header.jpg?t=1638898723\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}