{
    "AppID": 926470,
    "Name": "Kolkhoz: The Red Wedge",
    "Release date": "Oct 19, 2018",
    "About the game": "The Soviet Union... the 1929 ... It was the realization of perhaps the most interesting experiment of modern times. Kolkhoz: The Red Wedge is inviting players to be a small part of the experience of this time and tells the story of an adventure from a communal farm in a Cossacks village. The villagers were expected to give up all property used for agricultural cultivation, and collectively carry out their agricultural labor. Kolkhoz is the name of this institution. As a laborer connected to the Soviet government, Gleb was sent to speed up the establishment of the Kolkhoz. The Kulaks, landowners who have lost their previous power and property; the villagers who toiled together to have only a few oxen and a small plot of land; the fanatics who came having left a piece of their souls behind with their youths spent fighting in the civil war; the poor who cannot understand in no way what they will give to Kolkhoz since they already have nothing on their hands; those who unconditionally followed the Soviet government and the revolution; or those who presented themselves as loyal while every night dreaming of drowning the revolution in a spoonful of water... worried and confused people who contributed and 'collectivized' their horses keep watching barns day and night to  make sure they sleep in better places and be fed well. And wherever one looks, one sees people, who harbor their own secret agendas in their minds. In the role of Gleb, the player carries out their duty, traveling through a universe of such stories, the establishment of the Kolkhoz, and must convince all the people involved in this project. Gleb's task is to confront the humanity even of those who take steps backward in this crucial moment, despite their insane desire in the service of creating a “new” life. By the end of the game, this confrontation will happen, one way or another. - A rich story shaped by the influence of historical and political events. - 2D character controls and interactions. - Puzzle concept built with symbols and shapes that have abstract and concrete connotations. - The choices that the player had to make during the story's flow.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/926470/header.jpg?t=1645008576",
    "Price": 5.99,
    "Developers": "Deniz Kayacan",
    "Publishers": "Deniz Kayacan",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/926470/ss_bcbbd131accf4c078bd4cc233b00b4a04b23b64c.1920x1080.jpg?t=1645008576,https://cdn.akamai.steamstatic.com/steam/apps/926470/ss_f2c737e641f76701c75d6ef54449740a543bda41.1920x1080.jpg?t=1645008576,https://cdn.akamai.steamstatic.com/steam/apps/926470/ss_6bb49e84c92207765558ae8305ea66daba145ec1.1920x1080.jpg?t=1645008576,https://cdn.akamai.steamstatic.com/steam/apps/926470/ss_a489fb73a8232584232814ab8ebe74f4e2de4742.1920x1080.jpg?t=1645008576,https://cdn.akamai.steamstatic.com/steam/apps/926470/ss_aab86c90296c68c7b0c228156271999d28ef0852.1920x1080.jpg?t=1645008576,https://cdn.akamai.steamstatic.com/steam/apps/926470/ss_91a2e39f69ff4e3421db79b23202707a13b1a5e5.1920x1080.jpg?t=1645008576",
    "Slug": "kolkhoz-the-red-wedge",
    "Meta Title": "Kolkhoz: The Red Wedge: Oct 19, 2018, Deniz Kayacan and F...",
    "Meta Description": "Looking for information on Kolkhoz: The Red Wedge? Check out the release date (Oct 19, 2018), developer insights from Deniz Kayacan, and a complete game...",
    "Alt Text Image": "Official header image for Kolkhoz: The Red Wedge game - Steam 926470",
    "Canonical URL": "https://gusku.site/game/kolkhoz-the-red-wedge",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kolkhoz: The Red Wedge\", \"description\": \"Looking for information on Kolkhoz: The Red Wedge? Check out the release date (Oct 19, 2018), developer insights from Deniz Kayacan, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 19, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Deniz Kayacan\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Deniz Kayacan\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/926470/header.jpg?t=1645008576\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}