{
    "AppID": 765790,
    "Name": "Legend of Long Night",
    "Release date": "Apr 17, 2018",
    "About the game": "Legend of Long Night hearkens back to the golden age of online real-time strategy games. Choose toplay on your own or with a team.Experience adventure, casual matches, challenging competition and survival!The four game modes provide endless replayability. Variouscore game features like fog exploration, resource gathering, building construction, and army battling gives Legend of Long Night the classic RTS feel.There are three races and dozens of heroes for you to select and combine. Creatingan intensely immersive and unsurpassed strategy game. Features: 1. The game features current popular game trend and adds a survival mode. 2. Game pace has been spedup and the game operation has been simplified. The unnecessary time consumption and excessive operation frequency have been optimized. 3. Focus is placed on the strategic level providing in-depth gameplay. 4. In 3vs3 game mode, we’ve created special racial strengths that complement and encourage cooperation.Grantingthe player a MOBA likeexperience. Gameplay Instructions; 1. Adventure Mode: The splendid game story depicts a gratitude or resentment relationship among Chaos, Templar and the Gnomes. Play throughthe stories ofthe Nazgul King, Light Priest and Gnome Doctor. These kings of thethree races appear right beforethe arrival of the long night. 2. Casual Mode Invite your friends and share resources with them to have a cooperative and casual game tour! In the casual mode, you can choose 1vs1, 2vs2 or 3vs3, either playing on your own or in a group. 3. Competition Mode Authentic and classic RTS game type. Theperfect combination of strategy and operations grantsyouan amazing game experience. Show the power of your heroes and army to win the honor of becoming the strongest commander! 4. Survival Mode: 20 elite squads will fight each other in the dangerous and toxic forest. Natural attacks, monsters and treasure chests will appear at random. Who will be the final winner?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/765790/header.jpg?t=1559097116",
    "Price": 0.0,
    "Developers": "Joyo Games",
    "Publishers": "Joyo Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/765790/ss_a488e59a9cd7141bed8dababfc0f92b2cff3dc46.1920x1080.jpg?t=1559097116,https://cdn.akamai.steamstatic.com/steam/apps/765790/ss_eb6c2a22aa32edfa86dd72326b513d6fdef5977e.1920x1080.jpg?t=1559097116,https://cdn.akamai.steamstatic.com/steam/apps/765790/ss_9f73864a1096646f4d0cb9ecd36868bb5a55ad2d.1920x1080.jpg?t=1559097116,https://cdn.akamai.steamstatic.com/steam/apps/765790/ss_e2ca76bb72e84023f294e240038b831c23666068.1920x1080.jpg?t=1559097116,https://cdn.akamai.steamstatic.com/steam/apps/765790/ss_95e3ed969d61903e5ab175bb5b474dc01c335ab0.1920x1080.jpg?t=1559097116",
    "Slug": "legend-of-long-night",
    "Meta Title": "Legend of Long Night: Apr 17, 2018, Joyo Games and Full O...",
    "Meta Description": "Looking for information on Legend of Long Night? Check out the release date (Apr 17, 2018), developer insights from Joyo Games, and a complete game summ...",
    "Alt Text Image": "Official header image for Legend of Long Night game - Steam 765790",
    "Canonical URL": "https://gusku.site/game/legend-of-long-night",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Legend of Long Night\", \"description\": \"Looking for information on Legend of Long Night? Check out the release date (Apr 17, 2018), developer insights from Joyo Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Joyo Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Joyo Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/765790/header.jpg?t=1559097116\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}