{
    "AppID": 1943710,
    "Name": "Meth Master",
    "Release date": "May 10, 2022",
    "About the game": "Are you ready to build your own drug empire? Start your journey with growing ruderalis, upgrade production to get new recipes, the better the product, the more it costs. Buy different types of dealers to sell your product faster. Do not forget that you need production and workers in order to produce it. If you have already mastered the production of grass, it’s time to move on to serious matters, for example meta, you can improve each of your products to the 2nd, and later the 3rd level, as an example, there are grasses of such types: ruderalis, sativa, indica, hybrid . Having developed a new recipe, the price of the goods will certainly increase, but be careful, the more your empire the more likely unpleasant things can happen to you, the police will try to raid your production or dealers as soon as you lose vigilance but for the safety of your production and dealers there are various corrupt police and lawyers who will compete for your property and dealers, if you have already made enough money you can use the services of a banker to increase your capital and reduce costs for dealers, productions and chemists and bribe a politician to reduce the chance of an outside attack on you. Production: Buy various plants for growing, cocking meth and making coca. Hire employees to your production to increase the quantity of goods produced. Control the amount of goods produced with the help of sliders, you decide how many chemists will work. For each type of product, 2 types of production and one type of growers or chemists are available. Management: Manage dealers so as not to sell all the goods or in which case all your dealers will stop working and you will need to send them to the streets again. Track and manage the economy of your empire with the management tools and statistics provided to you. Dealers: Buy a variety of dealers from common street dealers to professional smugglers to sell your goods faster. In total, 4 types of dealers are available for each type of product, each of them costs differently and requires an additional payment for each one. Product: Keep track of the filling of your warehouses, the extraction and sale of your goods, as well as the current prices of products. Do not forget to buy new warehouses in a timely manner so that the warehouse is not full and does not sell out completely. Improvements: Improve your products from ruderalis to hibrid, create various recipes for meth and coca, improve your production and buy new chemists and growers to achieve success in this matter and create your own empire. Assistants: Buy various helpers to strengthen the empire. Each of the assistants does his job, the boss increases the limit of dealers, and the policeman insures your dealers from prison, a lawyer will help if your production are under arrest, and the politician will reduce the pressure of the authorities on you. Support and plans: Contact our community forums for support or help, we will be happy to help you and listen to your wishes to make the game even better. We will be happy to try and develop the game with you. New languages ​​will be added at the request of the community in the forums, each new language requires time and financial investment, as well as font support for new characters of foreign languages.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1943710/header.jpg?t=1653427589",
    "Price": 0.0,
    "Developers": "Oleh Baziv",
    "Publishers": "Oleh Baziv",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1943710/ss_15abcfa8b7d8ba4f812844115e2be17b582f384a.1920x1080.jpg?t=1653427589,https://cdn.akamai.steamstatic.com/steam/apps/1943710/ss_dfb70a207d3b4fbba48d15b0038c90343ed0be27.1920x1080.jpg?t=1653427589,https://cdn.akamai.steamstatic.com/steam/apps/1943710/ss_dc75cc03a0cb5085a345e6f77d306d492617b0e7.1920x1080.jpg?t=1653427589,https://cdn.akamai.steamstatic.com/steam/apps/1943710/ss_5f5ad19dee0ddacea4b628b42f1fc0a61820faf0.1920x1080.jpg?t=1653427589,https://cdn.akamai.steamstatic.com/steam/apps/1943710/ss_cb83f7425e4e0dbb17909296f3831c691401d0c0.1920x1080.jpg?t=1653427589,https://cdn.akamai.steamstatic.com/steam/apps/1943710/ss_8bc8d8f922edc79a8537cc93d4e002471848f023.1920x1080.jpg?t=1653427589",
    "Slug": "meth-master",
    "Meta Title": "Meth Master: May 10, 2022, Oleh Baziv and Full Overview",
    "Meta Description": "Looking for information on Meth Master? Check out the release date (May 10, 2022), developer insights from Oleh Baziv, and a complete game summary.",
    "Alt Text Image": "Official header image for Meth Master game - Steam 1943710",
    "Canonical URL": "https://gusku.site/game/meth-master",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Meth Master\", \"description\": \"Looking for information on Meth Master? Check out the release date (May 10, 2022), developer insights from Oleh Baziv, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Oleh Baziv\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Oleh Baziv\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1943710/header.jpg?t=1653427589\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}