{
    "AppID": 469720,
    "Name": "Monsters' Den: Godfall",
    "Release date": "Jul 6, 2017",
    "About the game": "The popular dungeon-crawling RPG series comes to Steam! Monsters' Den: Godfall is a new game, larger in scope and richer in content than ever before. A turn-based role playing game focused on dungeon crawling and advancement. Found and manage a Mercenary Company. Maintain a roster of heroes, upgrade your keep and adopt doctrines for universal bonuses. Take direct control of a party of up to four adventurers to lead on missions. Battle groups of enemies in turn-based tactical combat. Procedurally generated dungeons, loot and missions. Overland travel- visit new cities and dungeons, search ruins and find hidden places of interest. Improved character advancement means increased freedom to personalize your team of heroes. Hundreds of unique items that can be customized with enchantments. More than 100 enemy types , each with unique skills requiring different tactical approaches. Random dungeon modifiers add new wrinkles to each mission. Story missions uncover the mysteries of the Godfall. Story In the beginning, there were many gods. Until war came to heaven. One by one, the gods fell. Each Godfall brought with it a fierce meteor shower, as well as the sudden deaths of their worshippers. As the gods continued to fall and entire kingdoms were brought to ruin by the sympathetic deaths of the devout, many renounced their faith in the hope of being spared. Without divine protection, large numbers succumbed to possession and corruption as the demonic powers forced their entry into the world. Now, there is but one god. Her clerics exert dominance over the human remnants, ruling with an iron fist. Nomadic greenskin tribes pillage and burn their way across the land. Ambitious necromancers harvest the bones of fallen civilizations to amass undead armies of incredible size. The human heretics of the Cult of the Outward Path seek to break free from this world, risking it in the process. The dwarves of the Earthern Nations burrow ever deeper, trying to escape the madness of the surface world. Horrors wait there in the depths, ready to boil out and claim the old places. And all the while, sinister forces yet unseen lurk in the shadows and lay their plans. The fate of humanity hangs by a thread. Time to get to work. Fifty years after the last Godfall, the winnowing of humanity has passed. The survivors and their descendants struggle to survive and rebuild in a world whose balance has dramatically shifted against them.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/469720/header.jpg?t=1622261879",
    "Price": 14.99,
    "Developers": "Monstrum",
    "Publishers": "Monstrum",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/469720/ss_ab4a471fb1bf409196b20e0cd4195be36ecc8abb.1920x1080.jpg?t=1622261879,https://cdn.akamai.steamstatic.com/steam/apps/469720/ss_4b5afb7ab864ed018932a21fcb9b23424176602d.1920x1080.jpg?t=1622261879,https://cdn.akamai.steamstatic.com/steam/apps/469720/ss_3f1078747a9059ddaac148c46d6a3836e05d88c5.1920x1080.jpg?t=1622261879,https://cdn.akamai.steamstatic.com/steam/apps/469720/ss_49fa8e13e2e67f40449c5820670d05e2704e7197.1920x1080.jpg?t=1622261879,https://cdn.akamai.steamstatic.com/steam/apps/469720/ss_2ba5f4123b5f0d000e6554a0f51525235323fa53.1920x1080.jpg?t=1622261879,https://cdn.akamai.steamstatic.com/steam/apps/469720/ss_28d98f49a73f0447062f6904dbe828584087bc83.1920x1080.jpg?t=1622261879,https://cdn.akamai.steamstatic.com/steam/apps/469720/ss_de2402bd6644aa4d188efbe30d240d7e668fa93a.1920x1080.jpg?t=1622261879,https://cdn.akamai.steamstatic.com/steam/apps/469720/ss_863192c94d93a790678baf5cb11b924d2845b5a2.1920x1080.jpg?t=1622261879",
    "Slug": "monsters-den-godfall",
    "Meta Title": "Monsters' Den: Godfall: Jul 6, 2017, Monstrum and Full Ov...",
    "Meta Description": "Looking for information on Monsters' Den: Godfall? Check out the release date (Jul 6, 2017), developer insights from Monstrum, and a complete game summary.",
    "Alt Text Image": "Official header image for Monsters' Den: Godfall game - Steam 469720",
    "Canonical URL": "https://gusku.site/game/monsters-den-godfall",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Monsters' Den: Godfall\", \"description\": \"Looking for information on Monsters' Den: Godfall? Check out the release date (Jul 6, 2017), developer insights from Monstrum, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 6, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Monstrum\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Monstrum\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/469720/header.jpg?t=1622261879\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}