{
    "AppID": 1787090,
    "Name": "MyDockFinder",
    "Release date": "Nov 25, 2021",
    "About the game": "MyDockFinder MyDockFinder is a software for quick system startup and control viewing system functions. You can drag and drop to add your favorite programs or files, and drag and drop to directly use the program to open the file. Based on WinUI using GPU rendering, smooth animation effects, Bezier curve rounded corners and blur and the blur intensity can be adjusted. Minimize the animation of all windows in the management system. Regular and continuous updates. If the program crashes sometimes, please leave a message below to report the problem. The next few versions will bring many features such as creative workshops, more achievements, and skin changes, so stay tuned! The development progress by one person is slow, and each update takes two to three weeks or even a month. Main functions Global real-time dynamic blur effect can adjust the blur intensity Support 4K high resolution and multi-display environment The light and dark mode of the system can be modified simultaneously Steam cloud backup configuration file (manual backup, steam achievement) MyDock Dock icons can quickly launch applications You can manually modify the icon Window minimization animation (three effects are optional) Starting station quick start program panel Special program message reminder function Quickly view all files in the open folder View current city weather details Window preview management application window Display the progress bar of application downloading and playing media Apply a unified mask to the icons to make them more coordinated Multiple hidden display modes Each application can set an independent hidden mode MyFinder Quickly shut down, restart, log off the computer CPU, memory, disk, network speed, temperature monitoring(Need to manually open, steam achievement) Manage WiFi network connection System tray icon display management operation Bluetooth connection pairing Adjust the brightness of the monitor, including desktop monitors (Adjusting the brightness of the desktop monitor may damage your monitor, the HDMI interface may fail, and the DP interface can adjust the brightness perfectly) Quickly adjust the volume, switch the audio output device, you can modify the volume of each program separately The right mouse button of all function buttons can display the corresponding system functions Media control function Volume change prompt Immersive display, better fusion window background",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1787090/header.jpg?t=1658667039",
    "Price": 3.99,
    "Developers": "MyDockFinder",
    "Publishers": "MyDockFinder",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1787090/ss_57a02ca396d2e5ef48159810e163fd83f120eb05.1920x1080.jpg?t=1658667039,https://cdn.akamai.steamstatic.com/steam/apps/1787090/ss_0c982b2ca4240d64072871fffd76786e0613e36e.1920x1080.jpg?t=1658667039,https://cdn.akamai.steamstatic.com/steam/apps/1787090/ss_57e73d8a78508e425c7f3803e5607f5bbc727209.1920x1080.jpg?t=1658667039,https://cdn.akamai.steamstatic.com/steam/apps/1787090/ss_59be7b8e102e44dfdd113a184183108888aa877d.1920x1080.jpg?t=1658667039,https://cdn.akamai.steamstatic.com/steam/apps/1787090/ss_d986c9fb99d5cb9f0e8901d5c1f18190358dd51d.1920x1080.jpg?t=1658667039,https://cdn.akamai.steamstatic.com/steam/apps/1787090/ss_3bf51531c2feb29666ffc2b32c05628524fc4441.1920x1080.jpg?t=1658667039,https://cdn.akamai.steamstatic.com/steam/apps/1787090/ss_e30cb4dcf90c3f1e430687789625191cb13e658d.1920x1080.jpg?t=1658667039,https://cdn.akamai.steamstatic.com/steam/apps/1787090/ss_663c4bd2dbac29b778c334c16a9c8cae694c5dbe.1920x1080.jpg?t=1658667039",
    "Slug": "mydockfinder",
    "Meta Title": "MyDockFinder: Nov 25, 2021, MyDockFinder and Full Overview",
    "Meta Description": "Looking for information on MyDockFinder? Check out the release date (Nov 25, 2021), developer insights from MyDockFinder, and a complete game summary.",
    "Alt Text Image": "Official header image for MyDockFinder game - Steam 1787090",
    "Canonical URL": "https://gusku.site/game/mydockfinder",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MyDockFinder\", \"description\": \"Looking for information on MyDockFinder? Check out the release date (Nov 25, 2021), developer insights from MyDockFinder, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"MyDockFinder\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MyDockFinder\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1787090/header.jpg?t=1658667039\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}