{
    "AppID": 597860,
    "Name": "Nightmare Boy",
    "Release date": "Oct 25, 2017",
    "About the game": "Nightmare Boy is a metroidvania style, action/adventure 2D game. It takes place in a diverse world, full of enemies from your worst Nightmares! In your quest to save the Noctum from a self-proclaimed ruler, you'll meet weird and unique friends and foes. But tread carefully when talking or interacting with NPCs: Quirky characters and their reactions can have game-changing consequences. Fast reflexes and a taste for exploration are key if you intend to collect rare items, vanquish enemies, and eventually face your deepest fears. This story takes place in Donorok, in the state of Noctum. After the King of Noctum, Aster, disappears, chaos rules over the world. The relationships between Monsters, Mongos and Dreamers are completely unstable, and Donorok - the land so heavily affected by the chaos - slowly absorbs terrain from the surrounding regions. Balder has taken over and has ordered the monsters to retain any child who falls into the Nightmare. The key to continuing his rule is with the Nightmare Boy, Billy. A colorful palette and an aesthetic straight out of your worst Nightmare! Main character animations are made up of over 500 drawings. Each level has its own unique enemies and atmosphere. Character control is responsive and dynamic. As you progress through the story you will discover new abilities such as double jump, triple jump and hanging on walls. Powerful spells, explosives, and friends along the way will aid you in untraveled paths. As the player exploring every corner that forms the Nightmare World, you will slowly complete your map. There are many collectibles throughout the World that will decide which of the different endings the story concludes with. Characters on your journey will offer advice, but it's up to you to take it - or not! Each scene has its own musical composition and atmosphere. This provides an immersive experience and truly surrounds the player in the Nightmare World. This has been made possible thanks to the collaboration of Vic Hernand. Nightmare Boy started out as a way of learning programming and game development. We’ve ended up making a game we have loved to play. We’re an Indie team of just 2 people: Mr. Garcai and Víctor Ávila. All graphical assets are credited to Mr. Garcai - illustration, design, scenarios, etc. He’s the creative mind in the team. Víctor takes the programming, development, animation integration…and puts all of Garcai creations to work!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/597860/header.jpg?t=1614682074",
    "Price": 9.99,
    "Developers": "The Vanir Project",
    "Publishers": "BadLand Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/597860/ss_f952e08a2f076ffa916f259adb85784af505a7fb.1920x1080.jpg?t=1614682074,https://cdn.akamai.steamstatic.com/steam/apps/597860/ss_190b5d1a662b8b30edd8bf8c04f127d861a5a2bb.1920x1080.jpg?t=1614682074,https://cdn.akamai.steamstatic.com/steam/apps/597860/ss_198610a439825d27f31a3faba21fae140d34a151.1920x1080.jpg?t=1614682074,https://cdn.akamai.steamstatic.com/steam/apps/597860/ss_bfccf18b0d6fb6cb966ff9cc15f9c17ff4c5027e.1920x1080.jpg?t=1614682074,https://cdn.akamai.steamstatic.com/steam/apps/597860/ss_2fd07af191d20a1719c89515d5292a03bd7b0560.1920x1080.jpg?t=1614682074,https://cdn.akamai.steamstatic.com/steam/apps/597860/ss_a59e2d7db012a188e6062a3794612f22f805cb38.1920x1080.jpg?t=1614682074,https://cdn.akamai.steamstatic.com/steam/apps/597860/ss_d3745dd899c157f7cfc586c59ae7ae550e97d5d5.1920x1080.jpg?t=1614682074",
    "Slug": "nightmare-boy",
    "Meta Title": "Nightmare Boy: Oct 25, 2017, The Vanir Project and Full O...",
    "Meta Description": "Looking for information on Nightmare Boy? Check out the release date (Oct 25, 2017), developer insights from The Vanir Project, and a complete game summ...",
    "Alt Text Image": "Official header image for Nightmare Boy game - Steam 597860",
    "Canonical URL": "https://gusku.site/game/nightmare-boy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nightmare Boy\", \"description\": \"Looking for information on Nightmare Boy? Check out the release date (Oct 25, 2017), developer insights from The Vanir Project, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 25, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Vanir Project\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BadLand Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/597860/header.jpg?t=1614682074\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}