{
    "AppID": 363270,
    "Name": "O3DX",
    "Release date": "Jan 22, 2016",
    "About the game": "O3DX From the dusty chasms of the underground 4x4 world, comes an adventure unlike anything you have experienced before. Prepare yourself for fast tracks, furious physics and a rush of adrenaline as you tackle daring obstacles and puzzles. O3DX will be the ride of your life! - Obstacle Playground: Overcoming obstacles is the focus of the fun; daring physics, brainteasers, speed and leaps will test your off road skills. Complete each level, beat the time and collect all the stars to receive a bonus. -AAA visual fidelity: Through harnessing the latest rendering technology and fine tuning resources to match your device, you are presented with immersive, realistic rides through breath-taking terrains of exquisite detail and class leading special effects. -Unlike any predecessor: By rethinking and redesigning the way you interact with a vehicle, O3DX presents a whole new gaming experience. Intuitive controls, maximum playability and camera angles that keep you in the thick of the action at the right moments, ensure a healthy dose of addictive adrenaline in what promises to become a whole new game genre. - Easy controls. - Ridiculously Realistic physics! - Spectacular graphics! - Classic 4x4 vehicles, Military Off road Vehicles, Modern sporty all terrain vehicles and more. - More level packs in development for non-stop entertainment. - Plug and play Xbox 360 controller support. Smell the diesel, taste the dust! O3DX will be the new game you love.. What is O3DX? O3DX is an offroad racing and physics obstacle game with a whole new approach. It blends the fun factor and playability of side scroller racing games with the artistic splendour of free roam full 3d games that utilise cinematic camera angles. O3DX is the first game to employ this new type of genre. This is not a free roam game. It behaves like a side scroller but all action happens in 3D space with 360 degree camera angles. If I purchased early access do I also get the ‘official’ version? Yes! Everyone who purchased Early Access has the game and will recieve all future updates. How complete is the Alpha? The game is finished and ready to launch. We want this brief Alpha phase to discover any remaining bugs and get your feedback. If any feature request is in high demand we will add it to the game before the launch. Please try it out and let us know what you think.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/363270/header.jpg?t=1466492995",
    "Price": 7.99,
    "Developers": "Egamea Game Studios",
    "Publishers": "Egamea Game Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/363270/ss_c67405e318564ee54d955605a2b6897643c25bbc.1920x1080.jpg?t=1466492995,https://cdn.akamai.steamstatic.com/steam/apps/363270/ss_c8bfbb41c8ee51eb18e046380cb77c95ece2568b.1920x1080.jpg?t=1466492995,https://cdn.akamai.steamstatic.com/steam/apps/363270/ss_f69d752ff5b7fe201abe5ce37fc80f7254ac2cc6.1920x1080.jpg?t=1466492995,https://cdn.akamai.steamstatic.com/steam/apps/363270/ss_2ea21b5140b89ca1969e9ee77340009eec44dbd2.1920x1080.jpg?t=1466492995,https://cdn.akamai.steamstatic.com/steam/apps/363270/ss_b41766c68cb63a62c3712ad6223b08c1083078dc.1920x1080.jpg?t=1466492995,https://cdn.akamai.steamstatic.com/steam/apps/363270/ss_b57eb962f2b86a1a9fd381e4fee2f25fa864a057.1920x1080.jpg?t=1466492995,https://cdn.akamai.steamstatic.com/steam/apps/363270/ss_a86deadbf0e09eef84f7c09941d73d3ab513c3f7.1920x1080.jpg?t=1466492995",
    "Slug": "o3dx",
    "Meta Title": "O3DX: Jan 22, 2016, Egamea Game Studios and Full Overview",
    "Meta Description": "Looking for information on O3DX? Check out the release date (Jan 22, 2016), developer insights from Egamea Game Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for O3DX game - Steam 363270",
    "Canonical URL": "https://gusku.site/game/o3dx",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"O3DX\", \"description\": \"Looking for information on O3DX? Check out the release date (Jan 22, 2016), developer insights from Egamea Game Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 22, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Egamea Game Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Egamea Game Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/363270/header.jpg?t=1466492995\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}