{
    "AppID": 282740,
    "Name": "Organic Panic",
    "Release date": "May 14, 2014",
    "About the game": "XboxHub - 'Who the hell comes up with this stuff?.' - (XB1, 2016, 8/10) FanBoyNation - 'extremely well made... hours of delectable violence and hilarious fun.' - (PS4/XB1, 2016, 8/10) Hardcoregamer - '...most certainly my game of the show' - (PAX East 2014) Organic Panic It's is a wild grown, char grilled, bash 'em up, physics action puzzler! Play 1 to 4 magically enhanced organism's and battle your way through a barrage of crazy full flavored levels - each is totally destructible (real world materials) and features completely reactive liquids. Lava burns wooden homes down, melts cheddar chunks, and fries food fast. Ice shards crash to the ground, crushing everyone, melts (on contact with the lava) into water, water puts out fire, cools lava, and bad guys drown in water - The cycle of life continues...or not! Organic Panic is a BIG Game The single player adventure mode propels you through over 130 mind twisting levels , across 12 beautiful hand painted and animating background environments, via 4 game modes all driven by a colorful comic story. Play local Co-op and Versus with friends - It's time draining addictive fun, where you have to work together to solve maddening puzzles. Over 200 challenging levels! Completely dynamic physics engine - Based on the 'DAFT Engine' (Destructible And Fluid Technology) completely break everything, all elements have real world properties based on their material, wood burns, metal conducts electricity, ice melts into water (that your characters can swim in), rubber is bouncy but melts, Diamond is super tough, and if cherry is standing on it will blast through everything! Groundbreaking liquid simulation - With this technology you can literally fill an entire level with completely reactive liquids, all flowing and effecting the level structures, lava will flow with more viscosity, burn wood and heat materials, water will put out fires but evaporate on contact with hot surfaces, and acid will melt through most materials except glass and diamond! Local Co-op mode - Play Organic Panic with your friends - Use your combined brain power to help each other solve mad physics based puzzles and a good side heaping of action blast 'em up! Local Versus mode - Battle through mini tournament play in this super intense versus mode featuring 20 extra Versus levels and surprise power attacks! Comic Driven Story - The single player adventure mode is driven by a twisted comic book. 4x Unique players characters - Play as Kiwi, Carrot, Coconut or Cherry each with their own unique abilities, powers and special powers, learn each one, then work with them in combination. Each players has a completely different and unique abilities, which make for challenging gameplay and longevity. Cool game modes - Play different game modes, Swapzy, Morphy, Choosy, Timerun, Co-op and Versus - learn them, play them, master them, then battle your friends. Languages - English, French, Italian, German, Spanish, and Portuguese. Achievements and Leaderboards - Help us to set up the ranking system for the level building and sharing and the tourney game modes. Trading Cards - Collect the Trading Cards. Meet The Crew Do it Coconut! Kiwi's making waves Don't Mess with Cherry All together Now!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/282740/header.jpg?t=1483741304",
    "Price": 0.0,
    "Developers": "Last Limb LLC",
    "Publishers": "GameMill",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/282740/ss_7cc071dac01894d73f1f009bccf1ea4226777095.1920x1080.jpg?t=1483741304,https://cdn.akamai.steamstatic.com/steam/apps/282740/ss_8efffbc3087a0aaac112f7fdbae32c76c0ecffa2.1920x1080.jpg?t=1483741304,https://cdn.akamai.steamstatic.com/steam/apps/282740/ss_991bdb98a8f63e83523c99e7221f043816f3e8c3.1920x1080.jpg?t=1483741304,https://cdn.akamai.steamstatic.com/steam/apps/282740/ss_0a4dd671ac31eb8a2b5433ebfa9c24640bed8d19.1920x1080.jpg?t=1483741304,https://cdn.akamai.steamstatic.com/steam/apps/282740/ss_918dbdaa0c6b12750eed30e11d4b6f512ccba197.1920x1080.jpg?t=1483741304,https://cdn.akamai.steamstatic.com/steam/apps/282740/ss_bb85cc6798282a0fcf7e6fc3a9a837eaefee060a.1920x1080.jpg?t=1483741304,https://cdn.akamai.steamstatic.com/steam/apps/282740/ss_aaf58f641ddb66779a0f826a0aab0f6a77088063.1920x1080.jpg?t=1483741304,https://cdn.akamai.steamstatic.com/steam/apps/282740/ss_e3a530d872a47093257d508abaf86382a037cc6b.1920x1080.jpg?t=1483741304,https://cdn.akamai.steamstatic.com/steam/apps/282740/ss_38717b815cbad686caea5be6e30f6461ad1a4dc2.1920x1080.jpg?t=1483741304,https://cdn.akamai.steamstatic.com/steam/apps/282740/ss_5d32cdd54efe1e07078b43c8bb6c2cc404f72b4a.1920x1080.jpg?t=1483741304,https://cdn.akamai.steamstatic.com/steam/apps/282740/ss_2e6412db9b658fb3451f0de1a0fea8f8f19b6291.1920x1080.jpg?t=1483741304,https://cdn.akamai.steamstatic.com/steam/apps/282740/ss_ab9ec0e61199cd8bdd71b719b516e1934c317582.1920x1080.jpg?t=1483741304",
    "Slug": "organic-panic",
    "Meta Title": "Organic Panic: May 14, 2014, Last Limb LLC and Full Overview",
    "Meta Description": "Looking for information on Organic Panic? Check out the release date (May 14, 2014), developer insights from Last Limb LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Organic Panic game - Steam 282740",
    "Canonical URL": "https://gusku.site/game/organic-panic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Organic Panic\", \"description\": \"Looking for information on Organic Panic? Check out the release date (May 14, 2014), developer insights from Last Limb LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 14, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Last Limb LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GameMill\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/282740/header.jpg?t=1483741304\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}