{
    "AppID": 685240,
    "Name": "Paradiddle",
    "Release date": "Oct 31, 2017",
    "About the game": "Drumming Reimagined For Virtual Reality Paradiddle lets you explore your percussion skills freely in a flexible and responsive VR environment. Drag and drop as many drums as you want from your palette. Arrange and scale them with ease to create the setup that works best for you. Save custom drum sets and load your favorites whenever you come back. Virtual Drums, Realistic Sound In Paradiddle, drums give off different sounds based on a variety of factors, with some drums supporting over 100 sounds just based on how hard they were hit. Certain percussion instruments, such as the ride cymbals, also play different audio samples depending on what part of the instrument was hit. A Platform for Sharing and Learning Record your songs and share them with others in the Paradiddle community. In a song playback, Paradiddle uses visual cues to show when each drum is about to get hit. Speed up, slow down and play along to a recording in a uniquely immersive learning environment—or just sit back and the watch the show. Full Feature List Play different types of percussion instruments without worrying about making noise, having a dedicated space for them, or buying them. The current list of playable drums are: hi-hat, bass drum, snare, 3 types of toms, 2 types of crash cymbals and 2 types of ride cymbals. Realistic and responsive sound system , powered by FMOD. Create and customize your own drum kit . Record and share the songs you’ve played with others in the Paradiddle community. MIDI input/output support . MIDI devices (such as electronic drum pedals) can be integrated into Paradiddle to trigger any drums within the environment. Likewise, Paradiddle can also send MIDI output, which means you can use the app to trigger your own samples in your favorite digital audio workstation. This transforms Paradiddle into an extremely powerful audio creation tool. Peripheral integration. In addition to MIDI devices, any peripheral that can emulate keyboard input (such as USB pedals) can be used in Paradiddle as a way to trigger the kick drum or control the hi-hat. Customizable controls. Remap your VR controller buttons to different actions such as opening/closing the hi-hat or triggering the kick. ASIO Support. Audio enthusiasts that want maximum customization of their audio settings can switch their output device to ASIO. By default, the app uses WASAPI, and a lot of time was spent to ensure that the latency was kept to a minimum with the default settings. Customizable drum sound options. You can customize settings of individual drums, such as their pitch and max volume. These settings will expand in the future to give users greater control over the sound that comes out of their drums. Ability to load and play back audio files from your system as you play on your drums.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/685240/header.jpg?t=1614807625",
    "Price": 9.99,
    "Developers": "Emre Tanirgan",
    "Publishers": "Emre Tanirgan",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/685240/ss_457e7d43eedb4604ea92f3a56bc2dfc79a22cf60.1920x1080.jpg?t=1614807625,https://cdn.akamai.steamstatic.com/steam/apps/685240/ss_c3211551116289b7e17bfd83decd0e57475ef8ae.1920x1080.jpg?t=1614807625,https://cdn.akamai.steamstatic.com/steam/apps/685240/ss_a455f4c1acaac56b4c3c57c66a6f1e084a8478ee.1920x1080.jpg?t=1614807625,https://cdn.akamai.steamstatic.com/steam/apps/685240/ss_4ac099ddbf810124e47577c423bfe0b3ab84a3e6.1920x1080.jpg?t=1614807625,https://cdn.akamai.steamstatic.com/steam/apps/685240/ss_349e4828837e98b97711fcaf110670efe831de3e.1920x1080.jpg?t=1614807625",
    "Slug": "paradiddle",
    "Meta Title": "Paradiddle: Oct 31, 2017, Emre Tanirgan and Full Overview",
    "Meta Description": "Looking for information on Paradiddle? Check out the release date (Oct 31, 2017), developer insights from Emre Tanirgan, and a complete game summary.",
    "Alt Text Image": "Official header image for Paradiddle game - Steam 685240",
    "Canonical URL": "https://gusku.site/game/paradiddle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Paradiddle\", \"description\": \"Looking for information on Paradiddle? Check out the release date (Oct 31, 2017), developer insights from Emre Tanirgan, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 31, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Emre Tanirgan\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Emre Tanirgan\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/685240/header.jpg?t=1614807625\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}