{
    "AppID": 1240050,
    "Name": "Pendragon",
    "Release date": "Sep 22, 2020",
    "About the game": "AD 673. Camelot has fallen. The jealous Sir Mordred has broken the fellowship of the Round Table with hatred and lies. Now King Arthur faces his final battle. Who will keep the dream of Camelot alive? 'Edge-of-your-seat moves are core to Pendragon. Your pieces are characters that talk as you shift them around the board, and through quick decisive sacrifices and killer moves they grow and begin to form relationships with one another. A pawn’s sacrifice or Queen’s prowess will be remembered after the battle, and carried on into the next encounter.' - NME 'Pendragon is a strategy game where conversations are as tense as battles, and there's not always a difference...' - Kotaku Pendragon is a turn-based strategy game, where every move you make drives the narrative, and every story twist opens new gameplay opportunities. Will you advance and show your mettle, or cautiously retreat? Will you slip round enemies, or encounter them head-on? And when sacrifices are required, who will you put in harm's way? From the creators of the multi-award-winning 80 DAYS and Heaven’s Vault . Rally the Knights of the Round Table. Some will make it to Camlann and King Arthur. Others will fall. But every turn will change history. Will Sir Lancelot be reunited with Queen Guinevere? Will she spurn him, or embrace him? Will Sir Kay ever forgive Sir Gawaine for siding with Sir Mordred? Can Morgana le Fay be trusted? Where is Merlyn? Who lies buried in Mordred’s graveyard? Who is the archer in the woods? What has become of Excalibur? Secrets will be uncovered. Hearts will be broken. People will die. But maybe, just maybe, King Arthur can be saved... Journey across Dark Ages Britain to face wild creatures, brutal rogues, and Sir Mordred’s dark knights. A randomized game board ensures every playthrough is new. Fight turn-based battles with simple yet deeply strategic combat where position is everything, losses are inevitable, and every step permanently shapes the narrative. Experience story and gameplay as one: Pendragon’s story plays out on the field of battle itself, driven by your decisions - and those of your enemies. Choose a character to lead the adventure. Their personality will shape the story: Morgana le Fay is treacherous; Queen Guinevere is haunted by her mistakes; Sir Lancelot is French; Sir Gawaine is usually drunk... Assemble a ragtag band of knights, heroes, and peasants whose dispositions and abilities grow and change with the story. Live the legend: there will be love, suspicion, revenge, sacrifice and murder — and no one is safe, not even your leader. Determine the fate of the kingdom: your actions determine whether Arthur faces Mordred alone or with his friends by his side. Powered by the ink engine, the narrative technology behind Heaven’s Vault , Sorcery! , 80 Days , NeoCab , Sable , Where the Water Tastes Like Wine and many more, Pendragon is a digital storytelling board game of elegance, emotion, and infinite possibility.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1240050/header.jpg?t=1603889168",
    "Price": 16.99,
    "Developers": "inkle Ltd",
    "Publishers": "inkle Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1240050/ss_5cebe8eae86f445768dfa89ea373cbd96a6697cb.1920x1080.jpg?t=1603889168,https://cdn.akamai.steamstatic.com/steam/apps/1240050/ss_8b5d2d0426a48c1b962260d54ac3e0f8fab7ef88.1920x1080.jpg?t=1603889168,https://cdn.akamai.steamstatic.com/steam/apps/1240050/ss_ecfbd3a604bee6e5c7bfb5581451d226b02f3cdf.1920x1080.jpg?t=1603889168,https://cdn.akamai.steamstatic.com/steam/apps/1240050/ss_fe6d35769b6bb7bc79fa3cc36d9ef0cb0d5730a2.1920x1080.jpg?t=1603889168,https://cdn.akamai.steamstatic.com/steam/apps/1240050/ss_8a9ceffd4a469d8f36b4a2ef95a140a511326f7b.1920x1080.jpg?t=1603889168,https://cdn.akamai.steamstatic.com/steam/apps/1240050/ss_289c84d3c3c9a4994d18a436ee7a67e50cbe6d9a.1920x1080.jpg?t=1603889168,https://cdn.akamai.steamstatic.com/steam/apps/1240050/ss_a91e76b7f6a3e0b782231b56875387d3d02e5a48.1920x1080.jpg?t=1603889168,https://cdn.akamai.steamstatic.com/steam/apps/1240050/ss_e008fa84211ce01454e3796fa1fa00f2928e7525.1920x1080.jpg?t=1603889168,https://cdn.akamai.steamstatic.com/steam/apps/1240050/ss_f99be1a0d763b4603259b7f501ffcb93bfd63083.1920x1080.jpg?t=1603889168,https://cdn.akamai.steamstatic.com/steam/apps/1240050/ss_b89f008d3ca5d6ac2bcf11f0a1b50ede47aa3948.1920x1080.jpg?t=1603889168",
    "Slug": "pendragon",
    "Meta Title": "Pendragon: Sep 22, 2020, inkle Ltd and Full Overview",
    "Meta Description": "Looking for information on Pendragon? Check out the release date (Sep 22, 2020), developer insights from inkle Ltd, and a complete game summary.",
    "Alt Text Image": "Official header image for Pendragon game - Steam 1240050",
    "Canonical URL": "https://gusku.site/game/pendragon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pendragon\", \"description\": \"Looking for information on Pendragon? Check out the release date (Sep 22, 2020), developer insights from inkle Ltd, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 22, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"inkle Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"inkle Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1240050/header.jpg?t=1603889168\", \"offers\": {\"@type\": \"Offer\", \"price\": 16.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}