{
    "AppID": 423580,
    "Name": "Project Highrise",
    "Release date": "Sep 8, 2016",
    "About the game": "Your job as the architect and developer is to build world-famous skyscrapers that will be the envy of the entire city, masterpieces of art and engineering. But a skyscraper is more than just steel and glass, it’s an intricate ecosystem, full of people that live and work in the building. They become a complex machine that needs your steady hand to keep it running smoothly and efficiently. From the moment you break ground, every decision rests with you. As the architect you must coordinate the construction of everything - every wall and wire, every office and apartment. As the building owner you must keep your tenants happy - and paying rent on time. As a savvy developer you must keep an eye on the bottom line and invest in the future. Succeed and you will reap the rewards of a prestigious address where everyone will clamor to live and work. Fail and you will watch tenants leave in disgust, taking their business elsewhere and leaving your reputation in tatters. Will you create an exclusive office highrise that attracts business leaders from around the world? Will you construct luxury apartments in the sky, penthouses for the elite and playgrounds for the famous? Perhaps greed will get the better of you and you’ll build a tenement building that trades tenant happiness for loads of cash? All these choices and more are yours. Success is entirely in your hands. Features Deep and complex simulation of a modern skyscraper. Huge variety of tenants with their own unique characteristics, from restaurants, to offices, retail stores, or residential apartments. Open sandbox play with several difficulty levels and starting conditions allowing you to build your dream skyscraper towering above the surrounding city. Campaign mode that tests your skill at building a successful highrise in challenging scenarios. Test your management mettle by keeping up with your buildings diverse population and their ever-increasing demands. Hire specialized consultants to increase your building's curb appeal, operational efficiency, and pull with city hall.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/423580/header.jpg?t=1627897561",
    "Price": 19.99,
    "Developers": "SomaSim",
    "Publishers": "Kasedo Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/423580/ss_78de1c33ad524110a1874feb028184b3ac3cc6dc.1920x1080.jpg?t=1627897561,https://cdn.akamai.steamstatic.com/steam/apps/423580/ss_2a387567ced3ef86d6f76658896c749ed2a12265.1920x1080.jpg?t=1627897561,https://cdn.akamai.steamstatic.com/steam/apps/423580/ss_4b9dddf0d856b5631242a87c09d5a91ee4827bb3.1920x1080.jpg?t=1627897561,https://cdn.akamai.steamstatic.com/steam/apps/423580/ss_fff1c35fc450267314bf7c4e61c9751d512b7283.1920x1080.jpg?t=1627897561,https://cdn.akamai.steamstatic.com/steam/apps/423580/ss_19cf6a91da7bf9b190ff9b7c9164c05bb97b4c9f.1920x1080.jpg?t=1627897561,https://cdn.akamai.steamstatic.com/steam/apps/423580/ss_9f33176a25af8316d8d3fae1c88af03d6d787a48.1920x1080.jpg?t=1627897561",
    "Slug": "project-highrise",
    "Meta Title": "Project Highrise: Sep 8, 2016, SomaSim and Full Overview",
    "Meta Description": "Looking for information on Project Highrise? Check out the release date (Sep 8, 2016), developer insights from SomaSim, and a complete game summary.",
    "Alt Text Image": "Official header image for Project Highrise game - Steam 423580",
    "Canonical URL": "https://gusku.site/game/project-highrise",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Project Highrise\", \"description\": \"Looking for information on Project Highrise? Check out the release date (Sep 8, 2016), developer insights from SomaSim, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 8, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"SomaSim\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kasedo Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/423580/header.jpg?t=1627897561\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}