{
    "AppID": 947880,
    "Name": "Radio Violence",
    "Release date": "Apr 16, 2019",
    "About the game": "Radio Violence is a multiplayer 'tower offense' game for up to four players on the same screen. Build radio towers to spread the influence of your cheeky dictators and take control of the board in this fast paced, action-strategy battle for supremacy! An unsettling calm has shrouded the world. In the wake of a great war, an international armistice binds a temporary peace among the rival nations of the world. Democracy died in the war, and a cast of charismatic dictators — who lead their people through a veil of manipulation and propaganda — has risen to fill the power vacuum. The war may have gone cold, but that hasn't stopped these cunning leaders from finding... alternative ways to influence the people. No nation has the military strength to conquer the world by force and so, in times of hardship, the people turn to the radio for guidance from their glorious leaders. Who says a strategy game can't be the life of the party? Radio Violence is a real-time strategy game that replaces hour long bouts with bite-size, action packed rounds. Played on a hex-board, players start with a small group of tiles and are tasked with taking over the board. This is done by building a variety of radio towers which influence the board, converting nearby tiles to your glorious leader's color. Spreading your influence means growing your territory, but be wary! It's a competitive world out there. When opposing borders meet, it becomes a battle of influence decided by quick thinking and careful placement of towers. The tide of battle can change quickly — with triumphant victory or crushing defeat ever hanging in the balance — but don't be discouraged! A wide variety of customizable game modes, features, and tower loadouts offer near limitless possibilities. Learn the ropes, challenge your friends, master the tower, and achieve radio supremacy! Master a unique brand of strategy we call 'tower offense'. A procedurally generated game board offers a new challenge each play. For a quick round with your friends, choose from a variety of preset game modes. Each one offers a different way to win using the same core mechanics. Got the hang of it? Build yourself a playlist of modes. Want to spice up your games? Add unique features to any mode to change how it plays. Found a combination of features you like best? Make your own custom mode to include them for easy access! Make a loadout of towers to bring into each round. Experiment, and see which ones suit your play style.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/947880/header.jpg?t=1590277780",
    "Price": 4.99,
    "Developers": "No Sleep Software Ltd.",
    "Publishers": "No Sleep Software Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/947880/ss_d2b2a2a8c4b255689445ad355caea51736ff1a00.1920x1080.jpg?t=1590277780,https://cdn.akamai.steamstatic.com/steam/apps/947880/ss_83ed0cf25a123856e6ff3715f7753b03a09f5d57.1920x1080.jpg?t=1590277780,https://cdn.akamai.steamstatic.com/steam/apps/947880/ss_492789ae097eaad9ecf635eac8a9826a8fbc5f4f.1920x1080.jpg?t=1590277780,https://cdn.akamai.steamstatic.com/steam/apps/947880/ss_b18820fd060491dd1598eb0b9259c46a5790be09.1920x1080.jpg?t=1590277780,https://cdn.akamai.steamstatic.com/steam/apps/947880/ss_ca63017dea6eda333740b3ab91a280d7473bcd38.1920x1080.jpg?t=1590277780",
    "Slug": "radio-violence",
    "Meta Title": "Radio Violence: Apr 16, 2019, No Sleep Software Ltd. and ...",
    "Meta Description": "Looking for information on Radio Violence? Check out the release date (Apr 16, 2019), developer insights from No Sleep Software Ltd., and a complete gam...",
    "Alt Text Image": "Official header image for Radio Violence game - Steam 947880",
    "Canonical URL": "https://gusku.site/game/radio-violence",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Radio Violence\", \"description\": \"Looking for information on Radio Violence? Check out the release date (Apr 16, 2019), developer insights from No Sleep Software Ltd., and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 16, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"No Sleep Software Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"No Sleep Software Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/947880/header.jpg?t=1590277780\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}