{
    "AppID": 263940,
    "Name": "Red Baron Pack",
    "Release date": "Jan 7, 2016",
    "About the game": "The Red Baron flies again! Return to the classic Red Baron games with this digital collection featuring the original Red Baron, Red Baron 3D, the Mission Builder and high-quality scans of the original manuals, maps and reference cards. This is a digital-only standard edition. All content is delivered as download-only digital scans, and is both games in their original form. No enhancements or extended content was added to either title. Immerse yourself in the thrill of spectacular World War I dogfights in this timeless classic set in an age when wooden biplanes and triplanes ruled the air. Includes the following bonus content: Red Baron Manual. This digital scan of the original Red Baron manual contains a wealth of information, including detailed history on World War I along with its airplanes, aces and flight strategies. Red Baron Maps. The historically accurate World War I maps originally bundled with Red Baron are included as digital scans. Red Baron Reference Cards. The original reference cards accompanying Red Baron are included as digital scans. Experience updated graphics, improved mechanics and full multiplayer support in this critically acclaimed sequel to the original Red Baron game. Includes the following bonus content: Red Baron 3D Manual. Like its original counterpart, this digital scan of the Red Baron 3D manual is filled with game tips, strategies and World War I history. Red Baron 3D Reference Cards. The original reference cards accompanying Red Baron 3D are included as digital scans. Red Baron Details 'I can't say how much it hit me to be sitting up there, a couple of miles high, looking down on the battlefield, in fact, on four or five battlefields, and sweeping them all in one glorious bird's-eye view.' -World War I Pilot The year is 1914 — it is the dawn of World War I. Patriotic fervor runs high as young men across Europe prepare for a new age. For the first time ever, men will take to the air with the sole objective of blasting another airplane from the sky. Aviation is yet in its infancy. There are no books, no teachers — here and now, these young pilots must invent the skills and strategies that will keep them alive. Only the very best will survive, and they will perfect an artform all their own. These are the Aces, and this is the birth of aerial combat. Red Baron takes you back to this bygone era, where you will experience the look, feel, and the experience of aerial warfare in W.W.I Engage in close-range dogfights, go balloon-busting to take out the aerial eyes of the enemy, take on Zeppelins, escort bombers deep into enemy territory, go undercover in nighttime missions and go head-to-head with such famous Aces as the Red Baron himself! Features Fly on either side of the war as a British pilot in the Royal Flying Crops or a German pilot in the German Air Service. Includes 28 different aircraft, including the Sopwith Camel, The D.H.2 Pusher, the Spad 7, the Albatros D.III, the Fokker Triplane, and many others. Unique mission record feature lets you record an entire mission to disk—jump back into the game at any point to begin playing again! Accurately detailed 3Space worlds including the length of the German-French front, Verdun, the Somme, Paris, and London. Play Single Mission or enlist for the full tour in Campaign Play with more than 40 missions played back-to-back from 1915 to 1918. Progress in skill and rank, and become eligible for medals and awards, including the coveted Victoria Cross and Blue Max. 200 page manual complete with maps, technical specifications, historical backgrounds, pilot profiles, and aerial tactics. Instructions on how to access the bonus content and join multiplayer games can be found in the Community Hub forums.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/263940/header.jpg?t=1575393618",
    "Price": 9.99,
    "Developers": "Mad Otter Games",
    "Publishers": "Mad Otter Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/263940/ss_6d2cce1de0f6e2c198c6de08216af23c47e1d541.1920x1080.jpg?t=1575393618,https://cdn.akamai.steamstatic.com/steam/apps/263940/ss_313ef150ab3ac77e2bf6102c3ae0cf72ea5e2fc4.1920x1080.jpg?t=1575393618,https://cdn.akamai.steamstatic.com/steam/apps/263940/ss_4bd5db228430b197842df73402a5239d2c2e4cb2.1920x1080.jpg?t=1575393618,https://cdn.akamai.steamstatic.com/steam/apps/263940/ss_f4af80555f72fce557bfcb0175a4f8b2a30f5225.1920x1080.jpg?t=1575393618,https://cdn.akamai.steamstatic.com/steam/apps/263940/ss_97e2ad4c962e6ca8efe2630d6fba0494410c63c1.1920x1080.jpg?t=1575393618,https://cdn.akamai.steamstatic.com/steam/apps/263940/ss_fb52b22f2660fcdafd4844a47ce4f86fc50a05b6.1920x1080.jpg?t=1575393618,https://cdn.akamai.steamstatic.com/steam/apps/263940/ss_316e6e3017ff92f18d29778be70c12f0b308a087.1920x1080.jpg?t=1575393618,https://cdn.akamai.steamstatic.com/steam/apps/263940/ss_05ce84c36582408c607294188fdc73dc7a27cfa5.1920x1080.jpg?t=1575393618,https://cdn.akamai.steamstatic.com/steam/apps/263940/ss_ef015753fb7f18f79a405b3b24de1e07763957be.1920x1080.jpg?t=1575393618,https://cdn.akamai.steamstatic.com/steam/apps/263940/ss_68f88c4af7cf3732c977fc899bd6aac0649e1c1c.1920x1080.jpg?t=1575393618,https://cdn.akamai.steamstatic.com/steam/apps/263940/ss_8ce013ca8702cc3a53b9eb7cc23f870cfc31a5da.1920x1080.jpg?t=1575393618",
    "Slug": "red-baron-pack",
    "Meta Title": "Red Baron Pack: Jan 7, 2016, Mad Otter Games and Full Ove...",
    "Meta Description": "Looking for information on Red Baron Pack? Check out the release date (Jan 7, 2016), developer insights from Mad Otter Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Red Baron Pack game - Steam 263940",
    "Canonical URL": "https://gusku.site/game/red-baron-pack",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Red Baron Pack\", \"description\": \"Looking for information on Red Baron Pack? Check out the release date (Jan 7, 2016), developer insights from Mad Otter Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 7, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mad Otter Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mad Otter Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/263940/header.jpg?t=1575393618\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}