{
    "AppID": 1480140,
    "Name": "RPG Sounds",
    "Release date": "Jan 27, 2021",
    "About the game": "Bring your tabletop sessions to life. RPG Sounds i s a friendly audio software for Dungeon Masters. Users can easily set the mood of the session by adjusting Music, Soundscapes, , and triggering Sound Effects to greatly enhance their great game sessions. RPG Sounds boosts your immersion and grants the best auditive tabletop experience. RPG Sounds is a tool, not a service. It lets you import and store in a single place all your favorite songs, ambient sounds, and sound effects. It supports most of the mainstream types of audio files. You will never lose track of your sounds , it does a great job sorting and categorizing them by libraries and game sessions . That way, you will always know where your sounds are exactly when you need them. Prepare for a game session in advance. Pulling only the sounds you need from your library into your session will let you focus on actually running the campaign while letting RPG Sounds do its job. Forgot a track or sound effect? Don't worry, you can still add more tracks on the fly to your session without the current ambient sounds and musing stopping. With Online Play, you don't even have to be in the same room with your players to use RPG Sounds . Have them join your audio room and enjoy the immersive audio experience live. With the SFX Pad, you will be in control of your sound effects at all times . This feature greatly enhances combat in your sessions. Being able to trigger any sound on the fly is super easy and fun to do. Local import for Sounds and Music. That's right, bring your own music too, if you want. Easy to edit and organize Sessions and Presets Reverb and transition types for different environments. Playlist mode with adjustable time intervals and option to shuffle. Key Mapping for SFX. Spells, Combat Sounds, and effects are just one keystroke away at all times. 5 Sound Packs included (a bunch of sounds), for you to start playing with right away. Add +10 Epicness to your TTRPGs. SFX Pad with 14 Customizable Slots. Online Play. UI Color Tweaker. Customize every single color and save presets. (COMING SOON) World Class Sound Design and Music provided. No sounds? No problem! If you don't have an existing library or you just don't feel like accumulating sounds from all over the web. We got you! We're constantly creating new sound and audio packs specially designed to work seamlessly with RPG Sounds. That means that music and ambient sound loop seamlessly and each SFX comes with several iterations. It means that every time you play that Sword Slash SFX you get a new variation. That's pretty sweet, especially during combat when attacks and abilities are being used over and over. We really think this is the best audio tool there is for Dungeon Masters (spoiler: it's not just for Dungeon Masters). We are currently working on improving and adding new features to RPG Sounds on desktop and also developing mobile versions of it for tablets and phones. Hopefully, we'll be able to launch them before the end of 2021. We thank you for checking out our Steam Page.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1480140/header.jpg?t=1642614930",
    "Price": 0.0,
    "Developers": "Cast n Play",
    "Publishers": "Cast n Play",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1480140/ss_a9f8e832d406061ba32a5cce0438261172a3ad0e.1920x1080.jpg?t=1642614930,https://cdn.akamai.steamstatic.com/steam/apps/1480140/ss_eab450f4a5aeb12e03651c22494beefc0527e174.1920x1080.jpg?t=1642614930,https://cdn.akamai.steamstatic.com/steam/apps/1480140/ss_3864e4dfad523f941130071ac8c3ff570d84b427.1920x1080.jpg?t=1642614930,https://cdn.akamai.steamstatic.com/steam/apps/1480140/ss_8e64d58ec70489cdfee5717d458776d3d1199ed6.1920x1080.jpg?t=1642614930,https://cdn.akamai.steamstatic.com/steam/apps/1480140/ss_e0d417c902dd07b8b3157045299b825fc8f9c311.1920x1080.jpg?t=1642614930",
    "Slug": "rpg-sounds",
    "Meta Title": "RPG Sounds: Jan 27, 2021, Cast n Play and Full Overview",
    "Meta Description": "Looking for information on RPG Sounds? Check out the release date (Jan 27, 2021), developer insights from Cast n Play, and a complete game summary.",
    "Alt Text Image": "Official header image for RPG Sounds game - Steam 1480140",
    "Canonical URL": "https://gusku.site/game/rpg-sounds",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RPG Sounds\", \"description\": \"Looking for information on RPG Sounds? Check out the release date (Jan 27, 2021), developer insights from Cast n Play, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cast n Play\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cast n Play\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1480140/header.jpg?t=1642614930\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}