{
    "AppID": 1795430,
    "Name": "Sakura Succubus 5",
    "Release date": "Apr 4, 2022",
    "About the game": "In this visual novel Ogasawara Hiroki was a thoroughly ordinary man, until one fateful night, where - quite inadvertently - he learns of the existence of succubi. After meeting and wooing a series of succubi, Hiroki is now prepared to settle down with his harem and enjoy a quiet life. Fate, however, has other plans, after Hifumi becomes embroiled with Princess Stephania Sofia Maria Isabella: a noblewoman who hails from the small European country, Astoria. Stephania, as it transpires, is a big fan of Japan, and of Japanese culture, and - having lived an isolated life within the palace's walls - she's overjoyed at meeting a Japanese beauty like Hifumi. After tasting defeat by Hifumi's hands in the karuta championships, Stephania extends an invitation to Hifumi. Stephania asks Hifumi to stay with her in Astoria, so she might teach her about karuta, and share with her stories about Japan. Not wanting to travel to Astoria on her own, Hifumi invites Hiroki alongside her, and - through a series of happenstances - Marina and Hazel find themselves tagging along for the ride. In Astoria, Hiroki meets and befriends both Princess Stephania and her dutiful maid, Elizabeth. The days pass, and both the princess and her maid begin to show an interest in Hiroki. There's something a touch unsettling about Elizabeth, however; something which immediately catches Marina's attention. Could Elizabeth be more than she's letting on - and what, exactly, is she scheming? Hifumi is a well-known actress who has been working in the movie industry for many years. Her fame is so great, even Hiroki's father is a fan of hers. Hifumi appears elegant and demure, but she can be surprisingly aggressive when it comes to matters of romance. She dreams about marrying Hiroki one day, and she's determined to set her plans into motion so she can one day wear a white dress. In addition to being a national superstar, an incredible cook, and a hopeful bride-to-be, Hifumi is the reigning queen of karuta. She has held this title for four years running; a fact which Stephania admires her for. Marina is a wealthy businesswoman who owns her own company. As one of the oldest succubi in Hiroki's harem, she often finds herself in the role of a disciplinarian, and is forever being obliged to quell Ayu and Cosmos's silly arguments. Marina might be bossy and quick to take charge, but she can be gentle despite this. She refers to Hiroki as her 'darling', and she's determined to let him know how much she cares for him... At least, she would - if she wasn't so busy attending various business meetings! Hazel is a tennis star with a Japanese mother and an American father. She's a cheerful, free-spirited woman, who often says whatever she's thinking, whenever she thinks it, often to Marina's irritation. Hazel loves both pretty women and handsome men, and she isn't ashamed to admit it. While staying in Astoria, Hazel spends her time drooling over the maids, while decrying Hiroki's popularity with the austere Elizabeth. Why, Hazel wants to know, can't she have her own retinue of maids to dote upon her?! Life just isn't fair! Stephania is the princess of Astoria, a small European country that borders Germany and the Netherlands. As a princess, Stephania grew up in a palace, and has never wanted for anything. Her upbringing was a blessed one but, owing to the over-protectiveness of her parents, Stephania knows little about the outside world, and is incredibly naïve. Stephania is invested in Japan and Japanese culture, and she can speak the language fluently. She is particularly fond of karuta, and spends hours every day honing her craft, in the hopes of one day becoming the reigning queen of karuta. Elizabeth is Stephania's loyal maid. A polite woman, but somewhat aloof, it can be hard to discern what she's thinking. Despite appearing emotionless, Elizabeth takes quite the shine to Hiroki upon meeting him. She appears drawn to him, and is willing to go to great lengths to catch his attention. When questioned about this, however, she claims she is acting in Stephania's best interests. Whatever Elizabeth's true intentions, it's apparent she is dedicated to her mistress, whom she adores beyond all reason.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1795430/header.jpg?t=1649426674",
    "Price": 9.99,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1795430/ss_ec64372ca0d697679c1e06c8b0aad5b18255bc7c.1920x1080.jpg?t=1649426674,https://cdn.akamai.steamstatic.com/steam/apps/1795430/ss_347d2e13cf62ecab2c9aa1680d304f63b09ab49f.1920x1080.jpg?t=1649426674,https://cdn.akamai.steamstatic.com/steam/apps/1795430/ss_33d1613b7911bd16adf791975d5324a7288ceac3.1920x1080.jpg?t=1649426674,https://cdn.akamai.steamstatic.com/steam/apps/1795430/ss_e739b2829c637b55fe17e31812fe6d2862a92e72.1920x1080.jpg?t=1649426674,https://cdn.akamai.steamstatic.com/steam/apps/1795430/ss_6b803eb1ba615a1dc913abb1323b5491489d687d.1920x1080.jpg?t=1649426674,https://cdn.akamai.steamstatic.com/steam/apps/1795430/ss_90709e34526898feb838114a1b267a4278355701.1920x1080.jpg?t=1649426674,https://cdn.akamai.steamstatic.com/steam/apps/1795430/ss_15e012ec485edc796c8290d6cd84b8a9347af3de.1920x1080.jpg?t=1649426674,https://cdn.akamai.steamstatic.com/steam/apps/1795430/ss_8616284785587ca27cf0b011d69e28065d2570dc.1920x1080.jpg?t=1649426674,https://cdn.akamai.steamstatic.com/steam/apps/1795430/ss_7523be59f0359862a0e2a71d8650d0b27c49709f.1920x1080.jpg?t=1649426674,https://cdn.akamai.steamstatic.com/steam/apps/1795430/ss_f59ee07be33a093b22a8a85fa4c56aaec927052c.1920x1080.jpg?t=1649426674",
    "Slug": "sakura-succubus-5",
    "Meta Title": "Sakura Succubus 5: Apr 4, 2022, Winged Cloud and Full Ove...",
    "Meta Description": "Looking for information on Sakura Succubus 5? Check out the release date (Apr 4, 2022), developer insights from Winged Cloud, and a complete game summary.",
    "Alt Text Image": "Official header image for Sakura Succubus 5 game - Steam 1795430",
    "Canonical URL": "https://gusku.site/game/sakura-succubus-5",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura Succubus 5\", \"description\": \"Looking for information on Sakura Succubus 5? Check out the release date (Apr 4, 2022), developer insights from Winged Cloud, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1795430/header.jpg?t=1649426674\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}