{
    "AppID": 1861870,
    "Name": "Shadow Fate",
    "Release date": "Apr 5, 2022",
    "About the game": "Shadow Fate is an epic JRPG that fuses the best traditional elements of the genre with modern gaming sensibilities. Its story is rich and complex with deep characterization. Relationships between the members of the main cast evolve and grow throughout the game's approximate playtime of 40 hours. All enemy encounters are visible on screen - no more random whooshes! Combat is intricate and challenging but immensely fun and satisfying, relying more on intelligent choices than repetitive grinding. The vast open game world is entirely comprised of 'real' maps that achieve unprecedented levels of immersion in the environments. STORY In the city of Atro, a clandestine organization dedicated to vengeance has recruited a supernatural being known as a 'shadow spawn'. Unburdened by a human soul and composed of pure darkness, his incredible powers make him an unparalleled killer. When the immortal leader of the Vengeance Guild reawakens, she sends the shadow spawn on a mission that will forever change his destiny, and that of the world too. The story of Shadow Fate will take you from an urban metropolis to snowy tundras to arid deserts and many locales in-between. It will take shocking and dramatic turns as an epic conflict unfolds. Alongside the grand main story, the characters you meet and team up with will become a dysfunctional family, providing smaller, more intimate moments in the plot. Side quests will further expand on the mythology and backstory in the game. GAMEPLAY The turn-based battle system has been designed to be uniquely dynamic and compelling. It eschews button mashing old school rpg grinding in favor of a more challenging and rewarding combat flow. A major mechanic is the 'EX' feature, more commonly seen in the fighting game genre. Alongside the traditional HP and SP meters, a third EX meter allows characters to 'meter burn' the majority of their skills! For example, a skill that has a small circular area-of-effect can be meter burned to target all onscreen enemies. Or a combo skill can use the character's EX meter to boost its damage by the number of hits in the combo. Which skill to meter burn in which battles will allow deep player strategy and enable different approaches to the challenges of the game. All battles are side-view and feature custom sprites with awesome animations that ensure that every battle is visually interesting. Turn-based has never been so epic! Alongside the battles, the player's choice of party (max of 3 characters) will change the way they explore the environments in the game! The 8 characters in the game all have 'exploration skills', ranging from telekinetically floating out of range treasure chests, to charming on screen enemies, to speaking with the dead for hints about the current dungeon. Bringing certain characters along with you will open up new options and provides great replayability of previously visited areas.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1861870/header.jpg?t=1649142024",
    "Price": 14.99,
    "Developers": "HuntingSwan",
    "Publishers": "HuntingSwan",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1861870/ss_e937de5a537753706b591eac3e4262f7b0004d63.1920x1080.jpg?t=1649142024,https://cdn.akamai.steamstatic.com/steam/apps/1861870/ss_aa50856c27fe364668ef786471bbcd2decc735f8.1920x1080.jpg?t=1649142024,https://cdn.akamai.steamstatic.com/steam/apps/1861870/ss_8a2c69f82191e0e5365aa72e9fa891ba9277c25a.1920x1080.jpg?t=1649142024,https://cdn.akamai.steamstatic.com/steam/apps/1861870/ss_721a6e0f4157abc5d7ea5b063c652c4e266d6918.1920x1080.jpg?t=1649142024,https://cdn.akamai.steamstatic.com/steam/apps/1861870/ss_c20bb18bc244ec85eb6b8f9dda0c9b8f279f3ec6.1920x1080.jpg?t=1649142024,https://cdn.akamai.steamstatic.com/steam/apps/1861870/ss_4e32bc264b24f2ba07c9d0431212c7f2f532b174.1920x1080.jpg?t=1649142024,https://cdn.akamai.steamstatic.com/steam/apps/1861870/ss_0166b48db4f740942d74c8802e33797d8e304de2.1920x1080.jpg?t=1649142024,https://cdn.akamai.steamstatic.com/steam/apps/1861870/ss_3c21840d890385c9178512b349899339c1c0ea86.1920x1080.jpg?t=1649142024",
    "Slug": "shadow-fate",
    "Meta Title": "Shadow Fate: Apr 5, 2022, HuntingSwan and Full Overview",
    "Meta Description": "Looking for information on Shadow Fate? Check out the release date (Apr 5, 2022), developer insights from HuntingSwan, and a complete game summary.",
    "Alt Text Image": "Official header image for Shadow Fate game - Steam 1861870",
    "Canonical URL": "https://gusku.site/game/shadow-fate",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shadow Fate\", \"description\": \"Looking for information on Shadow Fate? Check out the release date (Apr 5, 2022), developer insights from HuntingSwan, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 5, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"HuntingSwan\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HuntingSwan\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1861870/header.jpg?t=1649142024\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}