{
    "AppID": 247140,
    "Name": "Soundodger+",
    "Release date": "Oct 11, 2013",
    "About the game": "Soundodger+ combines the twitchiness of bullet hell shooters with the sonic thrills of rhythm games to create a wholly unique experience. Studio Bean has updated the original Adult Swim Games title with all-new tracks, controller support, and a fully-featured level editor. Plus, auto-generate stages from your own music library! Update! March 6, 2017 19 new tracks in the third free DLC update, all choreographed by the community! New bullet type: 'hug' - touch it before it leaves the arena Folder support added for User Levels Many bugs fixed throughout game and Editor Many features added to Editor See update news for more info Update! October 13, 2014 6 new music tracks (see below for full track list) Steam Trading Cards support Update! March 7, 2014 6 new music tracks (see below for full track list) Smooth Listening Mode: play for score without audio penalties when getting hit Larger window sizes added: press F3 when in windowed mode to cycle between them Key Features 35 music tracks, over half new to the Steam edition Artists include celebrated game musicians Disasterpeace (FEZ, Runner2), Danny Baranowsky (The Binding of Isaac) and more Auto-generate levels in a snap using your personal music collection Create and share original levels using the all-new level editor Engage slo-mo for the trickiest sequences, or embark on a risk-free musical journey in Zen mode Full Track List Anoctave - Frog of Lore Austin Wintory - Lost Age Bean - Senioritis Bean - Sixteen &amp; Dangerous Bean - Solvalou Bill Kiley - Foxtail Socks Bill Kiley - Glowing Cubes Bill Kiley - Rake Leaves Into Piles Bill Kiley - Ye Olde Future Chelsea Howe - A Walk In The Park D.WIGHT - Outside Wars D.WIGHT - Waves From Nothing Danny Baranowsky - Kirkhope Delasaurus - Fields &amp; Reaches Disasterpeace - Daisy Wheel Ghost Kollective - Dummy (Radio Edit) Lifeformed - Chloroplast Skin Lifeformed - Forgotten Tea Louis Gorenfeld - MIDI Murder Box Mike Forst - I Do, What I Want Mike Forst - Katapult North Base - Overdose Sonic - Distant Stars New Tracks! March 7, 2014 Bean - Shibuya Ben Prunty - Crispy Static Chipzel - Tokyo Skies Doseone - Samurai Gunn (Title) Eirik Suhrke - Menu (Super Crate Box) Jukio Kallio - Nuclear Throne (Theme) New Tracks! October 13, 2014 A_Rival - Venus Constrobuz - HP Restored Popskyy - Samurai Sferro &amp; Tommy - Rapture (Rex Ronan Remix) Tommy - Nocturnal Wanderings trash80 - missing_you New Tracks! March 6, 2017 ambinate - Bloom Bean - Stroke of Misfortune CHRISTINE - Gonna Fear Now Circuit Bent - Tonic Dan Salvato - Spellslave Disasterpeace - Forgotten Ghost Kollective (ft Snowflake) - Waking Me Softly grogle - After All ft. Megurine Luka Hinkik - Time Leaper Kevin MacLeod - Exit the Premises Lifeformed - 9-bit Expedition Lifeformed - A Safe Place to Sleep lo tag blanco - slumlord MakeAcid - Voltage Sawtooth - Carcinogens Tabrill, Domonic - Cold Pill The Kyoto Connection - Hachiko (The Faithful Dog) Wolfgun - Galaxian (Starfighter) Xtrullor - Zelda II: Palace Theme (Xtrullor remix)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/247140/header.jpg?t=1600922266",
    "Price": 7.99,
    "Developers": "Studio Bean",
    "Publishers": "Adult Swim Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/247140/ss_a87cab850e42b897ddd2932a0d53675d97bd5cf3.1920x1080.jpg?t=1600922266,https://cdn.akamai.steamstatic.com/steam/apps/247140/ss_3cfcaaa77ec9a62fc9ef893d7f266b71a4319c3a.1920x1080.jpg?t=1600922266,https://cdn.akamai.steamstatic.com/steam/apps/247140/ss_c29918423560703b796672de127da908ab75bf94.1920x1080.jpg?t=1600922266,https://cdn.akamai.steamstatic.com/steam/apps/247140/ss_adcc44773bb2d61441676d1a6ec8fab2276fd12a.1920x1080.jpg?t=1600922266,https://cdn.akamai.steamstatic.com/steam/apps/247140/ss_4b0ced6618b8214ee01d6846aef08a048b2e4da9.1920x1080.jpg?t=1600922266,https://cdn.akamai.steamstatic.com/steam/apps/247140/ss_680bbda8637fa33ec6031d541d676553d52d3adb.1920x1080.jpg?t=1600922266,https://cdn.akamai.steamstatic.com/steam/apps/247140/ss_52d9d084d05e0b6df2a9c0d84b38469d3425cc11.1920x1080.jpg?t=1600922266",
    "Slug": "soundodger",
    "Meta Title": "Soundodger+: Oct 11, 2013, Studio Bean and Full Overview",
    "Meta Description": "Looking for information on Soundodger+? Check out the release date (Oct 11, 2013), developer insights from Studio Bean, and a complete game summary.",
    "Alt Text Image": "Official header image for Soundodger+ game - Steam 247140",
    "Canonical URL": "https://gusku.site/game/soundodger",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Soundodger+\", \"description\": \"Looking for information on Soundodger+? Check out the release date (Oct 11, 2013), developer insights from Studio Bean, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 11, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Bean\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Adult Swim Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/247140/header.jpg?t=1600922266\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}