{
    "AppID": 1986930,
    "Name": "Spellslinger VR",
    "Release date": "Jul 8, 2022",
    "About the game": "Welcome to the magical world of Spellslinger VR! Here you will run into a variety of monsters, puzzles, and challenges you must overcome by casting a wide array of elementally-aligned spells. The core of Spellslinger VR's gameplay comes from its unique spellcasting system, which grants you the ability to string together specific arm and hand movements to cast spells. Each spell has a unique set of movements that must be done in order to be cast, and learning to perform these motions quickly and smoothly will pay off as you get faster and more efficient at slinging deadly spell combos! Current Features As the game is releasing in Early-Access, we fully intend on adding many more features and tons of content to the game. Here's what you can expect to see in the first Early-Access launch, though! Eight spells that each require a specific set of hand motions to cast. Spell motions vary in length and complexity, including ones that require multiple movements or movements with both hands at the same time. Two enemy types, each with elemental variants, as well as stronger versions of each variant with visual changes. Experience and Level-up system that allows players to customize their stats. These are permanent across play sessions and grant players great benefits for playing the game more. The status effect system allows various effects to be applied to players and enemies over time. Fire-based spells can burn enemies for a duration, and temporary damage bonuses can be applied to the player. A fully-voiced tutorial, as well as a lengthy instructional page to help players understand the basic mechanics of the game. There is also a list of all available spells in the game that can be accessed at any point, with visual instructions on how to cast them. We have great plans for the future of Spellslinger VR to expand it in many ways. If you are interested in seeing what's to come, please check out our Devlogs on the Spellslinger VR Steam page!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1986930/header.jpg?t=1657303267",
    "Price": 0.0,
    "Developers": "Spellslinger VR Team",
    "Publishers": "Spellslinger VR Team",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1986930/ss_6bd3180afebf953b7b4fc8ace26c356207837732.1920x1080.jpg?t=1657303267,https://cdn.akamai.steamstatic.com/steam/apps/1986930/ss_a2d0017231c70730cac6c1bee46953652405f5a9.1920x1080.jpg?t=1657303267,https://cdn.akamai.steamstatic.com/steam/apps/1986930/ss_038a9ef75fd567daf02d69b9e19dfa38c532f523.1920x1080.jpg?t=1657303267,https://cdn.akamai.steamstatic.com/steam/apps/1986930/ss_95156e677e47e7ed70540b026bc626d19492aef2.1920x1080.jpg?t=1657303267,https://cdn.akamai.steamstatic.com/steam/apps/1986930/ss_0831790b8e539548ccf4558702785f3665c347a7.1920x1080.jpg?t=1657303267",
    "Slug": "spellslinger-vr",
    "Meta Title": "Spellslinger VR: Jul 8, 2022, Spellslinger VR Team and Fu...",
    "Meta Description": "Looking for information on Spellslinger VR? Check out the release date (Jul 8, 2022), developer insights from Spellslinger VR Team, and a complete game ...",
    "Alt Text Image": "Official header image for Spellslinger VR game - Steam 1986930",
    "Canonical URL": "https://gusku.site/game/spellslinger-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spellslinger VR\", \"description\": \"Looking for information on Spellslinger VR? Check out the release date (Jul 8, 2022), developer insights from Spellslinger VR Team, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Spellslinger VR Team\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Spellslinger VR Team\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1986930/header.jpg?t=1657303267\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}