{
    "AppID": 454120,
    "Name": "Starbase",
    "Release date": "Jul 29, 2021",
    "About the game": "Starbase is a massively multiplayer online game with gameplay focused on building and designing spaceships and stations, exploration, resource gathering, crafting, trading, and combat. Set in a universe of vast scale and detail, the fully-destructible environment and hybrid voxel/vertex-based game mechanics enable simulations in Starbase at immense depth, giving players the ultimate freedom to exploit their innovativeness and creativity. From constructing spaceships that can endure the hazards of space, such as collision and corrosive damages, to creating massive automated factories and designing electricity and data networks, the players are free to do it their own way. A single persistent Universe - Play and interact online with thousands of players and start shaping the world with your fellow robots. Build, fight, chat and group up with other players to discover and settle the vast galaxy that is waiting for its first conquerors to make their mark. Mine asteroids by yourself, trade and haul cargo with your friends, or build a station with a huge company. Success in Starbase is not measured in hours played or an endless grind, but in the ingenuity of each player and their ability to work together. The environment in Starbase is fully destructible, made possible by a mixture of voxel and fracture damage - Everything can be destroyed or disassembled with the right kind of tools and weaponry. The in-depth physics simulation enabled by hybrid voxel/vertex-based game mechanics make fights, exploration and flying spaceships a creative paradise The simulation of structural and elemental durability in the game adds its own twist and challenge to the efforts to conquer space; poorly designed superstructures combined with overpowered steering thrusters can snap the spaceships in half if cutting corners too much in a space race. Note: Station destruction will be added in the September Siege Mechanics Update Design and build your spaceship, stations and devices down to the tiniest detail, and live the spaceship designer dream by selling your blueprints. The smallest building unit in Starbase is a single bolt, allowing you to build, repair and modify spaceships, stations, and devices as you wish. Even the smallest ships have thousands of parts, each with their own detailed damage model, making building and designing a truly creative process. Learning to use the in-game programming chips will take building and designing to a new level; innovation, automation of ships and creating clever ship layouts will make all the difference! Engage in seamless FPS and spaceship combat with thousands of players simultaneously. Fly solo or crew up with others to divide roles and responsibilities. Creative thinking, crazy ideas and daring maneuvers can turn the tide of battles! Explore the infinitely expanding universe, and discover stations, asteroid fields, spaceship wrecks, social hubs and fellow travelers. Arrange an exploration mission with friends and find out what's hidden in the depths of space and the faraway moons Beware of pirates and unknown dangers when venturing into the uncharted territories! Mine raw minerals from asteroids and salvage different parts from broken ships, trade your salvaged goods at trading stations, or steal from others if that floats your (space)boat. Buy, sell and trade ship parts, materials, weapons, tools, ammo, designs, and invent new ways of earning credits in a player driven economy. Form friendships and alliances, group up with others and establish factions to build massive stations and tackle the most difficult hurdles space has to offer. Starting station safe zones safeguard the new player experience Dynamic safe zones configurable on player-owned stations Developer-lead faction Empire provides protection and security About Starbase Starbase is developed with Frozenbyte’s internal game engine that is custom-built for conquering space, enabling the use of extremely challenging combination of voxel and vertex technologies in the game. The modern engine has been built specifically with Starbase in mind and the engine’s architecture is designed to handle all the quirks of simulation, damage, building, player amounts and the ever-growing universe to match the challenges the ambitious vision of the game can pose. Similarly, all features of the game have been developed with the infinite scale and the creative freedom of the players in mind. Starbase has been in secret development for five years without restraints and the development will continue until the game’s bold vision is achieved. In the ever-expanding space the scale can range from the unit of one bolt to massive space station structures, with exploration missions varying from journeys to nearby asteroid fields, to salvaging ship debris, and eventually to other galaxies. In Starbase players are given the freedom to build the kind of universe they want to, and a small group of players can eventually form large factions that challenge the powers that be. Being inventive will also help, as cleverness often triumphs over brute force in Starbase, and the only limitation is the creativity of the players. Early Access Starbase Early Access will introduce the players, the pioneers, to a new galaxy that they can begin to explore from a bunch of huge stations located at the orbit of a single planet. As the players eventually settle the entire orbit, they can start finding ways to travel to the planet’s moons and someday all the way to other planets and distant star systems. The still unoccupied universe of Starbase offers players the chance to take part in the building of the galaxy and in discovering what will be the first steps in the twilight of space travel. Early Access allows the players to design, build &amp; modify spaceships, explore the universe, form social connections, and earn money by mining, gathering, crafting and selling resources. The players can start building their home stations and begin the expansion of the Starbase universe together with the developers. Starbase launches into Early Access in a clear alpha stage, however the core features are well established and there's fun to be had for sure. The next big upcoming updates can be seen below: A full roadmap of ready and upcoming features can be found here: /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/454120/header.jpg?t=1638964907",
    "Price": 34.99,
    "Developers": "Frozenbyte",
    "Publishers": "Frozenbyte",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/454120/ss_3590d2d08fc0c009eb85838919e9671a87956c24.1920x1080.jpg?t=1638964907,https://cdn.akamai.steamstatic.com/steam/apps/454120/ss_211211e65f2037b1ace7da817dd805076d26990e.1920x1080.jpg?t=1638964907,https://cdn.akamai.steamstatic.com/steam/apps/454120/ss_6b6ade60e52826edfe1362a3dfac9de0086dddca.1920x1080.jpg?t=1638964907,https://cdn.akamai.steamstatic.com/steam/apps/454120/ss_906d3cfa39c91c7a0a6aa3e36026c30129f04387.1920x1080.jpg?t=1638964907,https://cdn.akamai.steamstatic.com/steam/apps/454120/ss_2965823f094042c4e293470c091b71839818600c.1920x1080.jpg?t=1638964907,https://cdn.akamai.steamstatic.com/steam/apps/454120/ss_f74c44521247c84707e246929d9297d1da0f8895.1920x1080.jpg?t=1638964907,https://cdn.akamai.steamstatic.com/steam/apps/454120/ss_6ca1ce9cb412e9c9230ea2b8cb53b36897333015.1920x1080.jpg?t=1638964907,https://cdn.akamai.steamstatic.com/steam/apps/454120/ss_99fb61e046c892098eabe4d9f88d405612db502b.1920x1080.jpg?t=1638964907,https://cdn.akamai.steamstatic.com/steam/apps/454120/ss_3abc5537a3063a1bc1312f51d8883edcbdaee9ce.1920x1080.jpg?t=1638964907,https://cdn.akamai.steamstatic.com/steam/apps/454120/ss_b530b36b9ce17adbffffc7d4d0eeb72531702588.1920x1080.jpg?t=1638964907,https://cdn.akamai.steamstatic.com/steam/apps/454120/ss_589c3bfed322d6640b8d129fc098cee42f93850c.1920x1080.jpg?t=1638964907",
    "Slug": "starbase",
    "Meta Title": "Starbase: Jul 29, 2021, Frozenbyte and Full Overview",
    "Meta Description": "Looking for information on Starbase? Check out the release date (Jul 29, 2021), developer insights from Frozenbyte, and a complete game summary.",
    "Alt Text Image": "Official header image for Starbase game - Steam 454120",
    "Canonical URL": "https://gusku.site/game/starbase",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Starbase\", \"description\": \"Looking for information on Starbase? Check out the release date (Jul 29, 2021), developer insights from Frozenbyte, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 29, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Frozenbyte\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Frozenbyte\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/454120/header.jpg?t=1638964907\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}