{
    "AppID": 1039580,
    "Name": "Super Welder",
    "Release date": "May 20, 2019",
    "About the game": "'Super welder' is a simple and easy to play leisure puzzle games, without any buttons, just move the mouse can play all levels, play the game, fingers tired, let it have a good rest! Pure mouse operation method of play, can also bring you fun! ■ Control the movement of the light spot on the screen with the mouse, just like controlling the mouse to move the pointer. ■ Each level has a variety of organs and includes a large green circle, which represents the end of the level, so that the light point can reach the end without any obstacles. ■ When the level contains small green dots, it is necessary to eat them with their own light spots before reaching the end point. ■ When the level contains yellow dots, it needs to be burned off by an electric arc from an electric welder (light spot) to open the mechanism. ■ Each pass will reward a certain score (power value). The new level will be deducted with a certain score to unlock, so the more points you pass the reward The more values ​​you have, the more levels you can unlock, and the points can be used to purchase a variety of welders (light spots) that generate arc sparks. ■ 100 independent levels, with an average of 3 difficulty levels and changes per level. ■ Easy to learn, all levels can be played by simply moving the mouse. ■ Contains more than a dozen dynamic music for you to choose. ■ Automatically loop back and play back the video after customs clearance. ■ A variety of channels and institutions. ■ A variety of welding machines are available to produce arc sparks in a variety of different colors. ■ About difficulty: Each chapter has similar levels arranged vertically. Different levels are arranged horizontally. For vertically arranged levels, the level is increased from low to high. Players can choose the difficulty that suits them according to their skill level. ■ The level is rich in creativity and plays in a variety of ways. deficiencies: ■ due to the special playing method of the game, we did not add stories to the game. We spent more time and energy on the design and optimization of levels. Games without stories may have less fun, but it also means that you can play more interesting and creative levels. Update notification: 2020/9/9 Super welder: seeking truth 1, we have brought a major content update for players, In the past few months, we have been exploring how to create more valuable and meaningful content for players. How to make players become more meaningful in the process of playing the game, and how to get happiness and benefit from it in the process of playing. We find that there is one thing that people can easily get, but it is easy to ignore. That is the famous sayings of ancient and modern Chinese and foreign celebrities. It's easy to get because we just need to sit in front of a computer or use a mobile phone to type in a few keywords. But people have such a mentality, too easy to get things, often will not cherish. Those things that can leave deep memories in life are usually obtained after many hardships and difficulties. Famous quotes are the cream of human thought, and the crystallization of wisdom contains profound philosophies and brilliant radiance. If we want to get benefits from it, we must start from paying attention to it, because only when you attach importance to something, it will leave a deep impression in your memory, and it will become a part of your memory and benefit you for life. We follow the model of 'pilgrimage to the west', in order to get the Scriptures, the monks and disciples of Tang Dynasty need to go through many difficulties and dangers to obtain the Scriptures. We have prepared classic sayings for each level as a reward, which can only be obtained after customs clearance, and each famous saying has a beautiful picture. There are many advantages in reading famous sayings It is like a mirror, which can make me see my own advantages and disadvantages. It is like a pillar, which can give us spiritual support in the flashy and vain reality. It is like a beacon of life, shining on people's way forward. In the face of the vast sea of books and the vast number of words, it is a wise choice for everyone to understand famous sayings. Famous sayings and sayings can also be like the Buddhist scriptures in journey to the West. Only after experiencing some difficulties can they be meaningful. In the journey to the west, monks and disciples of the Tang Dynasty trekked through various states and countries on foot. They went through the difficulties of 9981 and walked a hundred and eight thousand Li just to go to the west to seek the true scriptures (only books recorded in words). What is it for? Sun Wukong has great powers. He can complete the task as long as he carries his master on his back. Why didn't they do it? The monkey king's ability will certainly be able to achieve, but if this is the case, the Buddha will certainly not give the Sutra to the four people. Only in this way can we transcend the vulgarity and achieve the fruit position. The visible scriptures are on the paper, while the invisible scriptures are in the heart. Of course, the Tang Monk would not let the monkey king carry himself to the West. Because the purpose of Tang monks is to let the people in the Tang Dynasty appreciate the difficulty of getting scriptures from the Western Heaven, so as to promote Buddhism in the eastern land. It can be seen that the difficult process of learning from scriptures is the true meaning of it. Over the past few months, we have read a lot of books, searched a lot of materials, and carefully selected 325 famous sayings and maxims, including ancient and modern philosophers, thinkers, writers, artists and so on. The immortal sayings are related to all aspects of life, such as inspirational life, success psychology, etc., which will definitely benefit you for life. Coupled with 325 interesting and creative levels, you can also experience the fun of 'learning from the fire'. 2. We have added the difficulty adjustment function for each level. The difficulty is divided into 10 levels, from - 5 to + 5. You can adjust the difficulty of each level according to your own preference. (- 5 represents 50% reduction of level difficulty) 3. The pause interface is optimized.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1039580/header.jpg?t=1606319922",
    "Price": 0.49,
    "Developers": "BlockGames",
    "Publishers": "BlockGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_22b03be16650196f78e5145178d76fe76857d6c5.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_34b1144a8513eacf01470205f6117fe143010fd0.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_aafd55823567bfbdef306af48045416b7e74136e.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_c8eb2fd5e1fed4721863b2d228683c91578e34bf.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_e326f2011730c73a3e8f9a20174215a6b1e6386f.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_c4601084c8eb9cbadeb5cd40f18acb286dc03b33.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_2a0099e44265b7d794a5e562933047054c4f040b.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_9620883d029c4a86daf11b4380b0d6b1961881d2.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_4d3d5993984c6b005a2a7a277f08197ee42f76dc.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_cfdaca75b25c3fa011f110b6d303af807660e453.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_4edbfb8faacb25d8889f163cbfb3531f3593eed8.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_c87091c8d45093e324c1b07cd0fd3650130bfb4b.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_ec6a8fd7cc93eff6e944e60f056c134f376cff93.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_a925f58513187f8cf7dda27921be802c9578ab12.1920x1080.jpg?t=1606319922,https://cdn.akamai.steamstatic.com/steam/apps/1039580/ss_d15346e3f04a4363fba81ae01f735695ec33df60.1920x1080.jpg?t=1606319922",
    "Slug": "super-welder",
    "Meta Title": "Super Welder: May 20, 2019, BlockGames and Full Overview",
    "Meta Description": "Looking for information on Super Welder? Check out the release date (May 20, 2019), developer insights from BlockGames, and a complete game summary.",
    "Alt Text Image": "Official header image for Super Welder game - Steam 1039580",
    "Canonical URL": "https://gusku.site/game/super-welder",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Super Welder\", \"description\": \"Looking for information on Super Welder? Check out the release date (May 20, 2019), developer insights from BlockGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 20, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"BlockGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BlockGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1039580/header.jpg?t=1606319922\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}