{
    "AppID": 800190,
    "Name": "The Adventures of Elena Temple: Definitive Edition",
    "Release date": "Mar 15, 2018",
    "About the game": "The Adventures of Elena Temple: Definitive Edition Experience The Adventures of Elena Temple in a Definitive Edition, including more content, more features, more fun and more... black and white pixel art! Available as a free update, the Definitive Edition includes: 2 new dungeons, totaling 47 new rooms - some very well hidden - with unique gameplay elements 40 achievements you can also track in-game - doesn't get any more old-school than that! Unlockable game modifiers - Limited Lives, Campfires, Double Jumps, Infinite Ammo - combine them for unique gameplay experiences On the fly switching between the virtual old machines Various tweaks to the rooms in the original dungeon, now dubbed Chalice of the Gods - you got shivers, didn't you? Overall improvements: new background in the selection screen, new pixel art splash image, dungeon selection screen, game modifiers screen etc. Easter Eggs                  New to Elena Temple? Read on! Ever miss being a child, playing games at your grandma's or in your old bedroom? Then look no further! The Adventures of Elena Temple is the classic you never knew existed. And the best part is that you can play it on virtual old machines that kind of sort of maybe existed. It's not like you can remember for sure anyway, right? The Adventures of Elena Temple is a monochromatic puzzle platformer made to look as if it were created in the 80s. Overcome obstacles, figure out how to advance, collect everything in sight, find all the secrets and remember your childhood while doing it. Progress through the game's three dungeons through non-linear exploration, then unlock the new game modifiers and re-experience the game in whole new ways.                     Features 3 dungeons with a total of 100+ rooms to overcome, each its own mini-level Unique gameplay elements for each dungeon Open exploration, choose which way to go, but don't worry, a helpful map is just one button press away Challenging, old-school platforming Put your puzzle solving skills to the test and figure out how to collect all the coins, gems, hearts and so on Track the progress of all 40 achievements in-game Unlockable game modifiers for completely new ways to experience the game Secrets and easter eggs to find for the more observant player Play on a selection of 7 virtual old machines, from the Pomo D'or 4, to Maple and Some Toy and all the way to the NS-Bos PC    Heads up The Adventures of Elena Temple is just one game you can play on seven simulated machines. Aside from the different look, the game plays the same on all machines and has the exact same content! The purpose of these old machines is to remind you of the old days, so feel free to pick whichever you like best without any fear of missing out on game content. The game should run on most Windows computers that aren't on display in a museum, but if you have one that doesn't run it, you have my deepest sympathy. Just to be safe, you should have at least the below specs. I'm a solo indie developer, I loved making The Adventures of Elena Temple and I hope you enjoy it! Please leave me some feedback if you play it. Thank you for your support!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/800190/header.jpg?t=1657786970",
    "Price": 4.99,
    "Developers": "GrimTalin",
    "Publishers": "GrimTalin",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/800190/ss_47c2173a0f08be7e541cdee7bc2a45bc62ae8b06.1920x1080.jpg?t=1657786970,https://cdn.akamai.steamstatic.com/steam/apps/800190/ss_bcd194d9fc743673b77021b2bc20328db9417717.1920x1080.jpg?t=1657786970,https://cdn.akamai.steamstatic.com/steam/apps/800190/ss_161a38bb8860ec9e62cf40ebdd04b4aa29b27212.1920x1080.jpg?t=1657786970,https://cdn.akamai.steamstatic.com/steam/apps/800190/ss_79848cc8d324799760a2e051d8bc47f534c62ab1.1920x1080.jpg?t=1657786970,https://cdn.akamai.steamstatic.com/steam/apps/800190/ss_06514bf57e4d195a10fd3b90dd0c6a435409587a.1920x1080.jpg?t=1657786970,https://cdn.akamai.steamstatic.com/steam/apps/800190/ss_f84c34eb531c43bfd26bcd932c5f6ec6788757fc.1920x1080.jpg?t=1657786970,https://cdn.akamai.steamstatic.com/steam/apps/800190/ss_10975ec10a61f17f1d6385db0c19e9b6a58155d4.1920x1080.jpg?t=1657786970,https://cdn.akamai.steamstatic.com/steam/apps/800190/ss_f32ac0cabeee8355ee415f1a34e9ed8ec9605a60.1920x1080.jpg?t=1657786970",
    "Slug": "the-adventures-of-elena-temple-definitive-edition",
    "Meta Title": "The Adventures of Elena Temple: Definitive Edition: Mar 1...",
    "Meta Description": "Looking for information on The Adventures of Elena Temple: Definitive Edition? Check out the release date (Mar 15, 2018), developer insights from GrimTa...",
    "Alt Text Image": "Official header image for The Adventures of Elena Temple: Definitive Edition game - Steam 800190",
    "Canonical URL": "https://gusku.site/game/the-adventures-of-elena-temple-definitive-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Adventures of Elena Temple: Definitive Edition\", \"description\": \"Looking for information on The Adventures of Elena Temple: Definitive Edition? Check out the release date (Mar 15, 2018), developer insights from GrimTa...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"GrimTalin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GrimTalin\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/800190/header.jpg?t=1657786970\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}