{
    "AppID": 440880,
    "Name": "The Count Lucanor",
    "Release date": "Mar 3, 2016",
    "About the game": "Join Hans in a fantasy world and experience a unique adventure, full of surprises and challenges. Get hooked on an immersive tale, where every decision counts and every clue is a piece to solve the puzzle and get the treasure. Unravel the sordid secrets of the castle, meet colorful characters, and remember: horror always lurks beneath the surface. With a retro, halfway-between-8-and-16-bit style and inspired by classic games like The Legend of Zelda, Yume Nikki, Silent Hill or Dark Souls, among others, The Count Lucanor is an amazing mystery and horror adventure set in a fairytale world. The game features important choices, alternative endings, secrets and different ways to solve puzzles. The title is in development for PC, Mac and Linux. Exploration: Walk the Tenebre Castle and place candles on the ground to light up your path. Conversation: Talk to NPCs to get important clues and unravel the mystery of the Count Lucanor. Choices: Your actions change the course of story, with five different endings and several subplots. Stealth: Hide under tables and behind curtains to go undetected. Puzzles: Use the items you found wisely in order to progress. Skill: Avoid traps and enemies in the castle by anticipating them. Once upon a time, there was a poor boy named Hans who lived with his mother near the woods. On his birthday, the boy had no presents nor sweets. He got so upset he decided to leave home for good. Before he left, his mother gave him his grandfather's cane, some cheese and three pieces of gold. Hans walked into the forest in search of adventure. Soon it was night and the boy was really scared, so he tried to go back. But then, a quaint kobold happened to cross his path and Hans decided to follow him to a castle. The kobold told him he would inherit great wealth if he passed a simple trial... guessing his name. Trapped in the castle, Hans will live a spooky mystery, fantasy and horror adventure to become the new Count Lucanor. We’ve hired the greatest composer of all time - Johann Sebastian Bach - to create a soundtrack that will remain etched in your mind forever. Using chiptune tools, we’ve transformed a series of hidden gems of the author to create unique soundscapes for our tale.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/440880/header.jpg?t=1639466835",
    "Price": 9.99,
    "Developers": "Baroque Decay",
    "Publishers": "Neon Doctrine",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/440880/ss_c304fda9f689d5b95bbe70cf4eddf431f3f1d80f.1920x1080.jpg?t=1639466835,https://cdn.akamai.steamstatic.com/steam/apps/440880/ss_46003c0795da1ad6d9608ca1998afbb68de90f1b.1920x1080.jpg?t=1639466835,https://cdn.akamai.steamstatic.com/steam/apps/440880/ss_acf08d9e516d69cec95cbdac8afb9f15471b20ec.1920x1080.jpg?t=1639466835,https://cdn.akamai.steamstatic.com/steam/apps/440880/ss_e0258b41a1bead66b89306ac70e7bee37caf9390.1920x1080.jpg?t=1639466835,https://cdn.akamai.steamstatic.com/steam/apps/440880/ss_57d39a6cc644b340e11796020447ff21066319f2.1920x1080.jpg?t=1639466835,https://cdn.akamai.steamstatic.com/steam/apps/440880/ss_361abf12f732db79a3a7d2cde6f2c2657f3e0011.1920x1080.jpg?t=1639466835,https://cdn.akamai.steamstatic.com/steam/apps/440880/ss_c4e39e036921e7641e48f6358325120eedd1a738.1920x1080.jpg?t=1639466835",
    "Slug": "the-count-lucanor",
    "Meta Title": "The Count Lucanor: Mar 3, 2016, Baroque Decay and Full Ov...",
    "Meta Description": "Looking for information on The Count Lucanor? Check out the release date (Mar 3, 2016), developer insights from Baroque Decay, and a complete game summary.",
    "Alt Text Image": "Official header image for The Count Lucanor game - Steam 440880",
    "Canonical URL": "https://gusku.site/game/the-count-lucanor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Count Lucanor\", \"description\": \"Looking for information on The Count Lucanor? Check out the release date (Mar 3, 2016), developer insights from Baroque Decay, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 3, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Baroque Decay\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Neon Doctrine\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/440880/header.jpg?t=1639466835\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}