{
    "AppID": 880210,
    "Name": "The Red Moon",
    "Release date": "Jul 17, 2018",
    "About the game": "Gamplay The Red Moon features hack and slash like gameplay, fighting your way through the difficult dungeons and boss battles. With house upgrades you can further the experience, with such things like Farming, Intimate moments with your spouse, Bathing together and more to come! This game is quite harsh when it comes to saving, as you can only save once per day, and retry with a fee of gold, so make sure to upgrade your equipment to prepare for the battles to come! Story Our protagonist, Shiro and his friends are trapped in a past mistake made in their younger days, You and your friends must avenge the destroyed town of Inishigari and save the newly founded village of Mizunara, which has had reported sightings of The Red Moon, meaning total destruction was soon to come. Can you and your Childhood friends stop the cursed Red Moon and save Mizunara Village? Characters Shiro The Leader of the group, and main protagonist of the story. Takema The Warrior of the group. He is quite a bit stubborn, however, the most confidence to take action in dire situations. Ryo The Thief of the group, Stubborn and childish, but the fastest attacker in our group. Saya Our mage. he is very confident in his abilities and can read ancient scriptures. Hana The Archer of the group. She may be a bit shy, but she is an excellent archer and a great teammate to have. Gameplay Features Throughout the game you can do activities such as; Farming After heading to the Upgrade Store, you can purchase the basement upgrade, allowing you to plant crops down there. These crops will give small amounts of HP on consumption Marriage There are several marriageable patrons throughout the town, mainly residing in the Inn. Build your relationship each day and get married and have a future together. Intimate Moments With Your Spouse When married you and your spouse may have a few Intimate Moments in the bedroom, Of course you can't do this all the time, however when the time is right you will know. House Upgrades In town, there is a store for House Upgrades, Going in here and purchasing one of the many upgrades will add new additions to your home. They will take a few days depending on which upgrade, but the end result is always worth it. Mining and Gathering Throughout the Dungeons you may find certain things you can hit with your sword to gather, such as Vines or Petals. Not all of these things will give you items of course but if you know where to look they will benefit you greatly. And more to come throughout the early access period!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/880210/header.jpg?t=1574074545",
    "Price": 4.99,
    "Developers": "Pink Cloud",
    "Publishers": "Pink Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/880210/ss_0a7dcbee8fe198420e7475e23ff2f88e1cf16d9c.1920x1080.jpg?t=1574074545,https://cdn.akamai.steamstatic.com/steam/apps/880210/ss_7915c29cb020936043a20a610bd601d3e508714b.1920x1080.jpg?t=1574074545,https://cdn.akamai.steamstatic.com/steam/apps/880210/ss_39db287ba3ebee9b1bd99b4451b6050c6f7da5b2.1920x1080.jpg?t=1574074545,https://cdn.akamai.steamstatic.com/steam/apps/880210/ss_6c3bb799e1350586829ebc3126a29d36eb0aaf05.1920x1080.jpg?t=1574074545,https://cdn.akamai.steamstatic.com/steam/apps/880210/ss_e9a30c42c119141bfbda8bbc1c9bc31752a8d9f8.1920x1080.jpg?t=1574074545,https://cdn.akamai.steamstatic.com/steam/apps/880210/ss_c6c16a7dc422f67e508f25cbbb186db5d4602a16.1920x1080.jpg?t=1574074545,https://cdn.akamai.steamstatic.com/steam/apps/880210/ss_4682915d9c1ae49ba58ae935ff1666c2e0807233.1920x1080.jpg?t=1574074545",
    "Slug": "the-red-moon",
    "Meta Title": "The Red Moon: Jul 17, 2018, Pink Cloud and Full Overview",
    "Meta Description": "Looking for information on The Red Moon? Check out the release date (Jul 17, 2018), developer insights from Pink Cloud, and a complete game summary.",
    "Alt Text Image": "Official header image for The Red Moon game - Steam 880210",
    "Canonical URL": "https://gusku.site/game/the-red-moon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Red Moon\", \"description\": \"Looking for information on The Red Moon? Check out the release date (Jul 17, 2018), developer insights from Pink Cloud, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pink Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pink Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/880210/header.jpg?t=1574074545\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}