{
    "AppID": 1944440,
    "Name": "The Farmer's Story of Slow Life",
    "Release date": "May 7, 2022",
    "About the game": "■Game Summary Sisters inherit a ranch and mountains from their father's estate. But the island is no longer vibrant. The older sister is a blacksmith in the mountains, and you, the younger sister, are trying to rebuild the ranch and the town. Enjoy a relaxing ranch life with great music. ■Great music by musicians working in Japan! Music is very important in games. Especially in a lifestyle game, it is important to be relaxing. We have selected songs by musicians to provide a relaxing gaming experience for everyone. List of musicians . ■Gather resources while watching your strength! Gather various resources while eating food, resting early once in a while, and collecting resources. . The game has a stamina and satiety level, which gradually decreases as you perform actions. You can recover them at the restaurant. There is a hot spring in the mountains behind the house, and you can also recover from fatigue in the hot spring. . Croissants for breakfast are especially important. Just by possessing it, you can recover both your strength and satiety every morning. . At 11:00 p.m., you will run out of energy. Try to get home before then. ■Grow crops for all seasons! The items that can be grown in spring, summer, fall, and winter are different. They will not wither, but can be harvested earlier if you water them more. . Some crops can be harvested again after a few days without re-sowing the seeds. You can also set up fish cages and mushroom saplings in the hills behind the house, shrimp cages in the sea, and many other things to obtain foodstuffs. . Also, the changes in scenery shown by time and season will delight your visual senses. . ■Let's go fishing! Fishing is easier in the morning, but becomes more difficult with each hour later in the day. The items you can catch will differ depending on the location, so try fishing in different places. You may be able to catch a rare item...? . ■Cooking and blacksmithing! Cooking and blacksmithing based on the items you have collected. Cooking will greatly restore your strength and satiety, making it an essential item when you are away from home. Blacksmithing and synthesizing items will allow you to create new items. . ■Make rice and bread! Brown rice and bread are often used for cooking. These take time to process, so take your time and wait. . ■Raise the animals! You will be able to grow grass, you will be able to have animals. You should raise grass every day. . Grass can be grown or purchased if you don't have the time. They produce a harvest, which can be used for a variety of dishes or shipped. . ■Make money by shipping! Put your harvest in the shipping area. At 5:00 p.m., the pickup company will collect your harvest and transfer the money. If you go to bed before 5:00, the money will be transferred the next morning. . ■A new expedition, to a remote island! As the story progresses and you have more money and ingredients to spare, you will be able to take on the challenge of visiting remote islands. Monsters will appear here, but you will also be able to get new items. You may be able to get rare items when you defeat monsters or while searching for items...? . ■Enjoy a slow life that changes from day to day, season to season, and day of the week! Enjoy a slow life with slightly different days, such as animals becoming grumpy without firewood in the winter, or different characters appearing on different days of the week. Sometimes there will be townspeople who will ask you for a favor.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1944440/header.jpg?t=1656514456",
    "Price": 24.99,
    "Developers": "OikariBuncho",
    "Publishers": "OikariBuncho",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_f501962f1d9a1e24060b8e0bf7e5fd80acd48a26.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_6adc93cd37b65664a7ed4ba5eaf360129f208b09.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_47802265db3ca5a68b75baa8003591c056938bde.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_b4af5c6c27a4d13193b6de20994b6cb9cc652411.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_72a86f231137e82012c326c39034d04ce28d6000.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_86b2136d96f6bd1dc2714cae517345ab7e48ce16.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_5b4181530447d196fd78a7d70a132c637690296a.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_77fb29bb61051984f9e4ec5ab752cf5b705bd42b.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_e5bed99980b807c8aa4825c719647c5dc17e0714.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_247e8d6ecce7594c31d1538783b8dfc9bb6804b2.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_34cacd5bddfb0c4960898c250c9be521dcf06e12.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_c3bd958465ae04fcdcb9f4bc5aa4ea3492f11ba7.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_2e893a02e5078c64c2d00598071ee4b30e20e971.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_dc46d93f3c45108fde418a919fc7156e9f7cec31.1920x1080.jpg?t=1656514456,https://cdn.akamai.steamstatic.com/steam/apps/1944440/ss_c0bac57908884b46a8cbbe53e626e0a966b022a3.1920x1080.jpg?t=1656514456",
    "Slug": "the-farmer-s-story-of-slow-life",
    "Meta Title": "The Farmer's Story of Slow Life: May 7, 2022, OikariBunch...",
    "Meta Description": "Looking for information on The Farmer's Story of Slow Life? Check out the release date (May 7, 2022), developer insights from OikariBuncho, and a comple...",
    "Alt Text Image": "Official header image for The Farmer's Story of Slow Life game - Steam 1944440",
    "Canonical URL": "https://gusku.site/game/the-farmer-s-story-of-slow-life",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Farmer's Story of Slow Life\", \"description\": \"Looking for information on The Farmer's Story of Slow Life? Check out the release date (May 7, 2022), developer insights from OikariBuncho, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"OikariBuncho\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OikariBuncho\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1944440/header.jpg?t=1656514456\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}