{
    "AppID": 1477320,
    "Name": "Warring States",
    "Release date": "Dec 23, 2020",
    "About the game": "'All warfare is based on deception' - The Art of War Command your armies to crush your opponents in a head-to-head turn-based game of war, strategy, and deception. But beware! Enemy unit types are hidden, so victory and defeat are never guaranteed. Determine the formations of your opponents by testing their strength, interpreting their movement, and exchanging hints with your teammates. Based on the classic Chinese board game 'Lu Zhan Qi.' Playing through voice chat is highly recommended. Guest Edition - Join games created by other players for free Host Edition - Host your own games for others to join A Game of War Defend your base from enemies. If you lose your base, it's over. Achieve victory by destroying all of your opponents. The Map Units move along a graph-based system. Roads allow units to move across many nodes in a single turn. Use roads to build support networks between units. Towers cannot be attacked if occupied by a unit. Put valuable units in the tower if you don't want to lose them. Collaborate with Teammates The strength of your teammate's units are hidden as well. Talk to your teammate to coordinate troop movements and to share information. However, don't give away too many details, or your opponents will know too! The Army Pagoda - Defend your Pagoda against enemy units. If you lose your Pagoda, your army is destroyed. Infantry - Each unit can have 1-9 soldiers in it. When two armies fight, the army with the largest number of soldiers wins. Enemy units remain hidden after a battle. Kamikaze - Kamikazes can destroy any enemy by sacrificing themselves. Each player only has a few, so use them wisely. Landmine - Landmines cannot move, and destroy any infantry unit that attacks it. Landmines are not destroyed during a battle. Ninja - Ninjas can defuse landmines. They are very agile and can take turns along roads without stopping. However, they are very weak, so don't send them head-first into an army of infantry. Community We have a highly active community. If you're in search of buddies to play with, new tips and tricks, or just new faces to meet, then please join our Discord server: .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1477320/header.jpg?t=1608739494",
    "Price": 0.0,
    "Developers": "Paper Games",
    "Publishers": "Paper Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1477320/ss_f72660ba707a41727fd09abd755bd870d3d85bd3.1920x1080.jpg?t=1608739494,https://cdn.akamai.steamstatic.com/steam/apps/1477320/ss_84256841e1c8d578f3aac40ac3a0a228b585c557.1920x1080.jpg?t=1608739494,https://cdn.akamai.steamstatic.com/steam/apps/1477320/ss_5ce27c0c2f9f3e1b966a95e8bbdedf65d472e854.1920x1080.jpg?t=1608739494,https://cdn.akamai.steamstatic.com/steam/apps/1477320/ss_73610773357fda31615c51aadf441c32780ddffe.1920x1080.jpg?t=1608739494,https://cdn.akamai.steamstatic.com/steam/apps/1477320/ss_bb1f274ee25f9780da5826d9ddb23953b4a9ed2a.1920x1080.jpg?t=1608739494",
    "Slug": "warring-states",
    "Meta Title": "Warring States: Dec 23, 2020, Paper Games and Full Overview",
    "Meta Description": "Looking for information on Warring States? Check out the release date (Dec 23, 2020), developer insights from Paper Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Warring States game - Steam 1477320",
    "Canonical URL": "https://gusku.site/game/warring-states",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Warring States\", \"description\": \"Looking for information on Warring States? Check out the release date (Dec 23, 2020), developer insights from Paper Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 23, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Paper Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Paper Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1477320/header.jpg?t=1608739494\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}