{
    "AppID": 1807750,
    "Name": "封神榜2022",
    "Release date": "Jan 6, 2022",
    "About the game": "'Feng Shen Bang 2022' is a traditional large-scale turn-based role-playing game, the game tells the legendary story of Nezha and others helping Zhou Fachang. In this work, an orthodox script with eight chapters is included: Stage1 'Nezha Naps the Sea' Stage2 'Hell Adventure' Stage3 'Four Wicked Men' Stage4 'Four Generals of the Magic House' Stage5 'Rescue Nishiki' Stage6 'Seven Monsters of Meishan' Stage7 'The War News' Stage8 'Offensive Chaoge' Turn-based system and special gameplay In this work, thousands of enemy monsters are on the stage, and the enemy monsters will release special skills as their levels increase. In this work, a variety of items can be collected through plots and hiding, and they can be used in battle to strengthen our army's combat capabilities. In this work, the number of hidden objects that can be found is close to hundreds. In this work, a variety of treasures can be obtained through scripts and hiding. These treasures can be used to improve our combat ability. In this work, the skills of each character are unique, and each character can perform its own functions. In this work, the equipment can be upgraded through specific props, and the upgraded equipment may have new hidden effects. In this work, battle data statistics are provided, and you can see the benefits of players in the battle. Chapter One Nezha’s Trouble in the Sea Nezha was born with supernatural power, set off huge waves in the sea, stirred the Dragon Palace, and offended the Sihailongwang. The dragon kings cast a spell to drop heavy rain and Chentangguan was flooded. In order to calm the flood, Nezha made a big disturbance in the Sihailong Palace... Chapter Two: Adventures in Hell The real Nezha Taiyi gave instructions to go to hell to practice. In the hell, Nezha needs to defeat ten palace kings to return to the world. Chapter Three The Four Wicked Men Nezha got the help of good friends Xiaolongnv and Yang Jian along the way, and the three of them worked together to defeat the four evil men who harmed one party and eliminated harm for the people. Chapter Four The Four Generals of the Magic Family Nezha and his party came to Jiadong Town, where they eliminated the human-eating monster Flower Fox Mink, and then they moved on and came to the daughter country, defeated the monster Pipa Jing, rescued Huang Tianhua, and got it from Huang Tianhua After that, Nezha and the others defeated the four demon generals who guarded Jia Mengguan with the drill, and they were able to move on. Chapter Five Rescue Xiqi Nezha and his party came to Xiqi City and found that there was a plague in Xiqi City. In a dream, Yang Jian got the guidance of Master Yuquan, and learned that the immortals in Huoyun Cave had medicine for the plague, so they went to Huoyun Cave. The immortals in China asked for medicine, and finally they succeeded in asking for medicine and successfully cured the plague in Xiqi City. Chapter Six The Seven Monsters of Meishan After Nezha and his party went on to destroy the two magical monsters Taojing and Liugui next to Qipanshan, they came to Meishan Town and learned that there were seven human-shaped monsters in the town that were harming people, so they found the end. The fairy Yun Zhongzi on Nanshan borrowed a mirror to take the magic mirror and finally wiped out the monsters in Meishan Town. Chapter Seven The Great Master Wen Wen Nezha and others came to Qinglong Pass. Unexpectedly, there was a strong wind at Qinglong Pass, which made it impossible to get close to Qinglong Pass. Nezha and others went on to arrive at Wansha Village. They did not expect to be ambushed by Master Wen. Jiang Ziya caught the sound. Taishi’s soul-locking curse fell, and everyone ran around and finally learned the way to save Jiang Ziya. After that, they found the grass man and saved Jiang Ziya. Jiang Ziya was in a coma under the guidance of Master Yuanshi Tianzun and learned of the strong wind at Qinglong Pass. They needed to use the Ding Fengzhu to stay there before they could get close to Qinglong Pass. Finally, they borrowed the Ding Fengzhu to settle the gale, and fought a fierce battle with Master Wen, and finally defeated Master Wen. Chapter eight Attacking Chaoge After all the hardships, everyone finally came to Chaoge City. They learned that the blood gourd was Daji’s nemesis in Baishi Village. After that, they found the blood gourd in the maelstrom and began to advance towards Chaoge City when they were ready. After destroying Da Ji’s two younger sisters, Pipa Jing and Pheasant Jing, Da Ji fled back to her old nest Xuanyuan Tomb, after which everyone went to Xuanyuan Tomb and destroyed Da Ji, and found a large number of magic weapons from her lair. After getting on the magic weapon, everyone went to the Star Picking Tower and defeated King Zhou. King Zhou had a magical body and could not destroy him directly. Everyone had to go to the fairy for help. The fairy gave Nezha and the others an ancient artifact Nine Dragons cover, and everyone finally The Nine Dragon Mask successfully eliminated King Zhou and saved the people of the world. Since then, the world is peaceful and the people live and work in peace and contentment. After success, Nezha and others continued their practice. ----------------------- | Branch chapter plot | ----------------------- NO.1 Weihe Dragon King When Nezha and others came to the Weihe Dragon Palace, they encountered constant provocations by the arrogant Weihe Dragon King. They had no choice but to compete with the Weihe Dragon King and defeat the Weihe Dragon Queen. The Weihe Dragon King gifted him with a dragon ball and asked Nezha and others to help find the Moonlight Treasure. Box, Nezha and others came to the sea cave to find the Moonlight Treasure Box, but they encountered the deep sea giant shark. After a hard fight, they finally defeated the deep sea giant shark. Finally, Nezha and others found the Moonlight Treasure Box in the sea cave. It was handed over to the Weihe Dragon King. The Weihe Dragon King obeyed the agreement and gifted the dragon ball to Nezha. After that, Nezha and others left Weihe and continued on. NO.2 Humming two generals The second general of Erlongshan was invited by Shen Gongbao, the national teacher of the Shang Dynasty, to stop Nezha and others. The second general of Humha trained the impervious body of King Kong. In order to defeat the second general, Nezha and others came to the vicinity of Erlong Mountain. Xianshan looked for ways to restrain the two generals of Huo Ha, and happened to encounter a Taoist with a profound knowledge of the truth of the two generals. In order to defeat the second general, Nezha and others paid a lot of money to ask the Taoist for help. Yuan Wu Lei Dafa was given to Nezha, and then Nezha and others used this spell to defeat the second general, Huo Ha, and then Nezha and others continued on their way. NO.3 Ten Definite Array Nezha and others broke into Jin'ao Island, and happened to see the ten immortals of Jin'ao Island finishing the ten perfect array. The two sides did not speculate and provoke each other. The ten immortals of Jin'ao Island asked Nezha and others to break the formation, and Nezha was full of blood. , I didn't know the murderous intent in the formation, and directly agreed to break the formation, and finally, after hard work and paid a huge price, finally broke the Shijue formation and defeated the Ten Immortals of Jin'ao Island. NO.4 Jiuqu Yellow River Array The big disciple Zhao Gongming of Biyou Palace was invited by Taishi Wen to come to Qinglongguan to help out. With the help of Taoist Lu Ya, Nezha and others killed Zhao Gongming with the nail-headed seven arrows. The fairy of Sanxian Island is In order to help Zhao Gongming get revenge, Zhao Gongming’s younger sister set up the Jiuqu Yellow River Array. Finally, with the help of the Weihe Dragon King, Nezha and others broke the Jiuqu Yellow River Array and defeated Fairy Sanxiao. March towards Chaoge. NO.5 Zhuxian Formation Nezha and others came near Chaoge, who knew that Shen Gongbao laid down the Zhuxian formation, preparing to destroy Nezha and others. The Zhuxian formation is infinitely powerful, and the four swords in the formation are unstoppable. Fortunately, Nezha and others are highly skilled. After breaking through various obstacles, he finally drew out the four swords of Zhuxian and broke the Zhuxian formation. Shen Gongbao saw this and made chaos with the magic treasure and took the opportunity to escape. NO.6 Ten Thousand Immortals Nezha and the rest of the army pressed the realm, Shen Gongbao invited the masters of the Biyou Palace to join forces to set up the Ten Thousand Immortal Array, ready to fight with Nezha and the others. The ten thousand immortal formations are full of murderous intent, and there are many masters, Nezha and others pass by. Fighting hard, paying a huge price, finally defeated the master in the formation, broke the Wanxian formation, and finally Shen Gongbao was rescued by a mysterious force. After Nezha and others broke the Wanxian formation, the last barrier of Chaoge City was Breaking, in order to eliminate King Zhou as soon as possible, Nezha and the others struck the iron while it was hot and launched an attack on Chaoge City.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1807750/header.jpg?t=1641492042",
    "Price": 9.99,
    "Developers": "FC Maker",
    "Publishers": "FC Maker",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_5dd9af9afc30958b56bb8b15a11296cda4185fdf.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_a0f8c4748f96ad63d7aab57f509c17102352e1f2.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_cccd414bf915ce3fe97a2a63b721cc9e9670a86b.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_765298684eec3f5fcb40528bf225d7d86d4cc5aa.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_f1fbf4c55d7d1c8a2efeaa82284e33449a4b3a00.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_a6b287850551599d5ebf8258f9e732b390c530e2.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_7dade6b7da3e8a8808ed4be1a0cdb6acc03a9cf2.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_c08f55cb2883b2994b7622a7e454420fa5510472.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_aff91f4d696df32fd9e6452376b20a0f96f378ca.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_3d92e02d200336c3a0f6a882ebad408b944d4f4e.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_6b42d911286e275bb62e637e683ee381adf76a05.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_ec928ec173693682073401b4d7d55fbb009755d6.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_1e152eb4ff3a07946ae39829b4651c89036b05b9.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_38a5872c401e2dec288b80244039b7f951ce720b.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_dc9a2abf543d6077062b7eb6857d858e5a8202bb.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_f8df85adb231a10baec10e0dcb40c18bf895f3b9.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_0ede52780843bc70bff911ed060890f23b0c42f7.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_09947957b8b55ab30dbc44463aa2fd362200d2ef.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_21cde6aae5ea715658a2c5c07659f7d4eac0bda0.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_a02b43dc2618a10e1a2c39356e3a0281dfd65999.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_0ae5f5edc6a3d9f642ff98fbb133aede26bf4cf7.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_16b7b487701e139c557ddebfe8ec16645afdc789.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_680bd5de9d6ec3d0c867f8b42e0785fdcae871e2.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_68745e7d9df3bd6e9816c272b8a1e44a0561113b.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_c24ef555a99391c8dd8611d7e96b0893f507273a.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_243d73c7778d96e7a76e43906689459ffc4891e3.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_72f5ecc859eb0b01ce46c78a4b6cc6b885e99d5f.1920x1080.jpg?t=1641492042,https://cdn.akamai.steamstatic.com/steam/apps/1807750/ss_ae6c98b8f856d0c75c54ed8cfeec3d10599569f1.1920x1080.jpg?t=1641492042",
    "Slug": "2022",
    "Meta Title": "封神榜2022: Jan 6, 2022, FC Maker and Full Overview",
    "Meta Description": "Looking for information on 封神榜2022? Check out the release date (Jan 6, 2022), developer insights from FC Maker, and a complete game summary.",
    "Alt Text Image": "Official header image for 封神榜2022 game - Steam 1807750",
    "Canonical URL": "https://gusku.site/game/2022",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5c01\\u795e\\u699c2022\", \"description\": \"Looking for information on \\u5c01\\u795e\\u699c2022? Check out the release date (Jan 6, 2022), developer insights from FC Maker, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"FC Maker\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FC Maker\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1807750/header.jpg?t=1641492042\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}