{
    "AppID": 956580,
    "Name": "9Dragons : Kung Fu Arena",
    "Release date": "May 27, 2019",
    "About the game": "About This Game Nine Dragons, selected by 7M global players has returned with a brand new type of gameplay and dynamic Martial-Art action. From the Gado island, the mysterious place that has a rumor of nine dragon’s legacy, overcome the adversity which comes from deadly enemies and hopeless environment to prove yourself the worthy one to be a master of nine dragon’s world. [Gado Island] Gado island became a bloody battleground by 50 unknown mercenaries who try to obtain the nine dragon’s legacy because of the rumor that tells whoever obtains the legacy, will gain enough power to rule the nine dragon’s world. As one of the mercenaries, without any allies, you must fight through the battleground to find “Dragon’s Jade” which is the key to enter the place that nine dragon’s legacy is hidden and reveal the ancient mystery. [Prepare for the battle] You will be dragged to the island with nothing to help you fight or survive and therefore, must search for supplies and farm yourself before you face another mercenary with nothing in your hand. Even a single dumpling could cause a serious difference during the combat. To maintain survivability and chance to win the battle, we recommend checking every item that you find and make a way to use it in your own way. Like just said, every item has their own way to support your gameplay. Sometimes, you will be able to find a hidden item from the unexpected place or a mysterious NPC and of course, it will be a game changer once you find it. There are several weapon types and various socket items that you can insert to the weapon. Experience every weapon type you can find, build your own combat style and choose them strategically to cope with all the situations you may face during the gameplay. [History will only remember the survivor] Remember, it is not honor that keeps you alive on the battleground and wins the battle, and the only one who can discuss the honor is the one who survived from the battle. Sometimes you'll learn to turn your back on your enemies and run away promising the next opportunity, and when the opportunity comes, you'll learn how to use all the things that are given for victory, even if it’s way far from the honor. [The Dragon’s Jade] There are nine ruins that use to be a clan house for each nine clans of this world in Gado island and three of those ruins have the dragon’s Jade which is the key to the chamber that nine dragon’s legacy is hidden. The key will show the location of the chamber in your map by a mark, and once the key gets out from the ruins, it will show the chamber’s location to every people after a certain time after it. Some of you will try to visit the ruins while some of you will search for the one who already has key. It’s obvious in this world when you kill someone, you take everything that they had. [It is only the beginning] Do not be disappointed when you hear someone already got the key and revealed the legend of nine dragon’s legacy. We’re going to provide another thrilling adventure to you in an early day.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/956580/header.jpg?t=1575312155",
    "Price": 0.0,
    "Developers": "Joongwon Entertainment",
    "Publishers": "Joongwon Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/956580/ss_9576784e5d600bbab63814f89065131de17ca8c9.1920x1080.jpg?t=1575312155,https://cdn.akamai.steamstatic.com/steam/apps/956580/ss_bacb2d36c2a025de2702e571ed2d37a18bf6d4f1.1920x1080.jpg?t=1575312155,https://cdn.akamai.steamstatic.com/steam/apps/956580/ss_d38b1568391705f2d744b3ccd14a48c0eb6d061e.1920x1080.jpg?t=1575312155,https://cdn.akamai.steamstatic.com/steam/apps/956580/ss_32a47d01461936afd5921d49d40cd960cd06ebe4.1920x1080.jpg?t=1575312155,https://cdn.akamai.steamstatic.com/steam/apps/956580/ss_2640aac2d908e573954c591a80ae839e5b177292.1920x1080.jpg?t=1575312155,https://cdn.akamai.steamstatic.com/steam/apps/956580/ss_a102cc7675757f5610247e82cf2a78496daf5029.1920x1080.jpg?t=1575312155,https://cdn.akamai.steamstatic.com/steam/apps/956580/ss_37d30685507b6f797cc068eb864f8b142ebef5bf.1920x1080.jpg?t=1575312155",
    "Slug": "9dragons-kung-fu-arena",
    "Meta Title": "9Dragons : Kung Fu Arena: May 27, 2019, Joongwon Entertai...",
    "Meta Description": "Looking for information on 9Dragons : Kung Fu Arena? Check out the release date (May 27, 2019), developer insights from Joongwon Entertainment, and a co...",
    "Alt Text Image": "Official header image for 9Dragons : Kung Fu Arena game - Steam 956580",
    "Canonical URL": "https://gusku.site/game/9dragons-kung-fu-arena",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"9Dragons : Kung Fu Arena\", \"description\": \"Looking for information on 9Dragons : Kung Fu Arena? Check out the release date (May 27, 2019), developer insights from Joongwon Entertainment, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 27, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Joongwon Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Joongwon Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/956580/header.jpg?t=1575312155\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}