{
    "AppID": 1183170,
    "Name": "All World Pro Wrestling",
    "Release date": "Dec 2, 2019",
    "About the game": "Gay Pro Wrestling Has Never Been This Sexy! You’re a trainee in the male Erotic Professional Wrestling Federation... and you’re ready to take on all comers. Training includes sparring, matches in the ring against the other trainees, tag team competitions, a battle royal, antics in the showers and locker room, and even ringside seats at the Championship Match. All-World Pro Wrestling is a 315,000 word interactive erotic gay novel by David Monster and Jim Dattilo. It’s entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. You’re just a young cub, but you have former Tag Team Champions for trainers, and the recently dethroned Heavyweight Champ, Dyer Anderson who just lost his belt to an arrogant pretty boy you love to hate... and hate that you love. He’s “The Golden Boy,” the dirtiest wrestler in the business, whose last match was more sexually charged than any you’ve ever seen. Then there’s Rory, the wholesome blond eighteen-year-old boy scout, who’s a killer in the ring; Bravon, a handsome black, elite athlete who struggles between wanting to be a dirty or clean wrestler; Mandrew, a class-clown white jock boy who swears he’s straight; Marcos, a burly, submissive Latin bear who doesn’t hate to lose; and Stan, an aggressive Hawaiian mountain of muscle who seems invincible. You’ll enjoy downtime in a lavish, private mansion with your fellow trainees, along with ten other veterans of the training program, each one eager to tangle with you. They come in all shapes and sizes, and each with a range of abilities: Muscle Bears, Bodybuilders, Twinks, Beefy Men, and Jock Boys, all with the dream of being a Pro Wrestler. Play as a male trainee among an all-male cast of characters. Romance one of five of your trainees, or enter into poly relationship with multiple partners. Choose just how far your erotic encounters go. You can focus on wrestling and training or easily get distracted by a myriad of partners. Be dominant, submissive, or give-and-take during the matches or outside the ring. Be as romantic or as raunchy as you want to be: it’s gay erotica the way you want it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1183170/header.jpg?t=1575303817",
    "Price": 5.99,
    "Developers": "Heart's Choice",
    "Publishers": "Heart's Choice",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1183170/ss_cea1fe63f9dd1f7522213467d86339bca3b3f8ae.1920x1080.jpg?t=1575303817,https://cdn.akamai.steamstatic.com/steam/apps/1183170/ss_4cd8695bdb3a184cb51aaea2271d7c650872ebe8.1920x1080.jpg?t=1575303817,https://cdn.akamai.steamstatic.com/steam/apps/1183170/ss_9b727ea490cbb28f64d2b05caecd244c58c99c71.1920x1080.jpg?t=1575303817,https://cdn.akamai.steamstatic.com/steam/apps/1183170/ss_ee3cacd15c8a155d754a86d55a83ec69b76090a8.1920x1080.jpg?t=1575303817,https://cdn.akamai.steamstatic.com/steam/apps/1183170/ss_d50dd739e33d369da3a32ff8695f02365f050464.1920x1080.jpg?t=1575303817",
    "Slug": "all-world-pro-wrestling",
    "Meta Title": "All World Pro Wrestling: Dec 2, 2019, Heart's Choice and ...",
    "Meta Description": "Looking for information on All World Pro Wrestling? Check out the release date (Dec 2, 2019), developer insights from Heart's Choice, and a complete gam...",
    "Alt Text Image": "Official header image for All World Pro Wrestling game - Steam 1183170",
    "Canonical URL": "https://gusku.site/game/all-world-pro-wrestling",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"All World Pro Wrestling\", \"description\": \"Looking for information on All World Pro Wrestling? Check out the release date (Dec 2, 2019), developer insights from Heart's Choice, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 2, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Heart's Choice\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Heart's Choice\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1183170/header.jpg?t=1575303817\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}