{
    "AppID": 834170,
    "Name": "Chameleon Video Player",
    "Release date": "May 16, 2018",
    "About the game": "Chameleon Media Player is non-profit utility software that helps multitaskers reclaim their computer screen space and increase productivity. Windows and Mac users can play video files or stream with their favorite services fullscreen, transparently atop their desktop with full control of the apps beneath. Ideal for gaming on Steam while watching Twitch TV, or simultaneously binging your favorite movies and TV shows while you play. Chameleon Player loads video files (mkv, mov, mp4, avi) or one of several supported streaming sites, (YouTube, Twitch TV, HBO GO, ABC, NBC, TBS, TNT, ESPN and others*) and displays playback in a fullscreen window over your desktop. By making this window semi-opaque and controllably transparent, your desktop is visible and fully interactable beneath. Since Chameleon is a tray application, all mouse and keyboard events can be passed on to all background programs or Steam games on your computer while playing your favorite videos, youtube videos or streaming shows in the foreground. I created the software for myself initially and found it to be such a useful tool that I wanted to share it with others. It's completely changed the way I work -- I’ve fit an extra Coursera course into my monthly routine and was able to catch up on the latest season of Rick and Morty with little drop in my work productivity. I also play games on Steam (of course) and being able to watch Twitch and YouTube in the background while gaming is just awesome. I would often mute these games and listen to WNYC or other educational podcasts, but opening this up to videos as well changes everything. Give the free demo of Chameleon a try and see what I mean! All proceeds help our non-profit, Cinq-Mars Media, to continue its mission of educational research and technology. Originally devised as an educational tool to help busybodies aborb online classes while multitasking and practice learned concepts while watching lecutres, Chameleon can also function as an entertainment app. ** Cinq-Mars Media does not endorse or provide any of the aforementioned streaming services. These may require paid subscriptions and are not included in the purchase of Chameleon Video Player. * Widevine is a DRM plugin some popular streaming services like Netflix and Hulu use, and while Google offers a path for companies to license the plugin, repeated attempts to reach out have gone ignored. Certified letters, phone calls, emails, you name it, but rest assured we haven't given up as all the code is already baked in, awaiting certification from Widevine.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/834170/header.jpg?t=1642775835",
    "Price": 0.0,
    "Developers": "Christopher Cinq-Mars Jarvis",
    "Publishers": "Cinq-Mars Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/834170/ss_5f7c4ea0356391469fb00e18d3463f7931a73800.1920x1080.jpg?t=1642775835,https://cdn.akamai.steamstatic.com/steam/apps/834170/ss_f44a18e77d9c30db09f000e19c2ff44da49532c8.1920x1080.jpg?t=1642775835,https://cdn.akamai.steamstatic.com/steam/apps/834170/ss_ebe01649df096d1424ea17e8b64c3da3ad4f324a.1920x1080.jpg?t=1642775835,https://cdn.akamai.steamstatic.com/steam/apps/834170/ss_0b9e68c1d99454485d2d5bce6fc59e7312b5c373.1920x1080.jpg?t=1642775835,https://cdn.akamai.steamstatic.com/steam/apps/834170/ss_b6a4e069feb98796c4eff9bfcf72ea1b1778d153.1920x1080.jpg?t=1642775835",
    "Slug": "chameleon-video-player",
    "Meta Title": "Chameleon Video Player: May 16, 2018, Christopher Cinq-Ma...",
    "Meta Description": "Looking for information on Chameleon Video Player? Check out the release date (May 16, 2018), developer insights from Christopher Cinq-Mars Jarvis, and ...",
    "Alt Text Image": "Official header image for Chameleon Video Player game - Steam 834170",
    "Canonical URL": "https://gusku.site/game/chameleon-video-player",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Chameleon Video Player\", \"description\": \"Looking for information on Chameleon Video Player? Check out the release date (May 16, 2018), developer insights from Christopher Cinq-Mars Jarvis, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 16, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Christopher Cinq-Mars Jarvis\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cinq-Mars Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/834170/header.jpg?t=1642775835\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}