{
    "AppID": 1365800,
    "Name": "City Of Thugs",
    "Release date": "Oct 2, 2021",
    "About the game": "City of Thugs is a turn-based roguelite RPG, set in the modern world, where you'll have to fight your way through a city full of randomly generated thugs. Gameplay: At the beginning of each game you'll be able to create your own character, with a highly customizable look, attributes, active and passive skills, weapons and more. It all depends on you that you're gonna go all-in for high damage, or you'll follow a more balanced approach. You can try different tactics to find out which playstyle fits you the most. After you'll die you'll lose your stuff and your progress you've made in the city, but you can keep your earned XP. After leveling up you'll receive more money to spend on weapons and more points to spend on attributes. There are several active and passive skills and all of them have their unique advantages. Be sure to try all of them to find out which of them are the most useful for your style. The game uses a first person perspective, so your enemies will stand in front of you. You'll not only see their health bar, but their wounds too, which will be different depending on whether it was caused by your knife or your gun. Also, injuries do matter: for example, you can do higher damage by aiming at their body, but severely injuring their shooting arm will cause a massive drop in their aiming skill. After a successful fight, loot your defeated enemies for money, food or bulletproof vests.. Or buy these at the specialized vendors, if you'll manage to come across with them in the city. Find and kill the boss to complete the game.. and before you'll start another round!! Key Features (version 0.1): -Highly customizable player character and randomly generated unique enemies -Nearly 150 clothing items (pants,skirts,T-shirts,jackets,shoes and more!) -Nearly 200 facial items (hairstyles,beards,eyes,noses,etc.) -19 weapons, including melee weapons (like hatchet or machete), and ranged weapons (from simple pistols to machine guns and shotguns) -Turn-based combat system -Visible injury system, which affects gameplay too -12 attributes to spend points on -9 active skills and 6 passive skills to choose from -3 locations (pub, city streets, office) -3 different vendors (arms dealer, doctor, food vendor) -Randomly selected map (maps are currently pre-made, later it will change) -Beautiful hand-drawn graphics -Hours of fun and a high replay value (due to the roguelike elements you'll never play the same level again)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1365800/header.jpg?t=1633197860",
    "Price": 0.0,
    "Developers": "Forever Young Games",
    "Publishers": "Forever Young Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1365800/ss_f8ac25a400827eb8f2c44a1cba14be7d8439487f.1920x1080.jpg?t=1633197860,https://cdn.akamai.steamstatic.com/steam/apps/1365800/ss_96d7c0d9eee3865160a78c90087bcf605f54f7f4.1920x1080.jpg?t=1633197860,https://cdn.akamai.steamstatic.com/steam/apps/1365800/ss_22761334766711c519264844024908c695c5bced.1920x1080.jpg?t=1633197860,https://cdn.akamai.steamstatic.com/steam/apps/1365800/ss_6fc333aeb7bf7802da28d3816bc6779ff3f181f1.1920x1080.jpg?t=1633197860,https://cdn.akamai.steamstatic.com/steam/apps/1365800/ss_58c79129fda8e7e6b3570f8dc0067a06d9bee10f.1920x1080.jpg?t=1633197860,https://cdn.akamai.steamstatic.com/steam/apps/1365800/ss_25ae4324a3cece00d44e0db5cb6dec7b186af790.1920x1080.jpg?t=1633197860,https://cdn.akamai.steamstatic.com/steam/apps/1365800/ss_8085af109439c2de94f042ac5113131f1f123fbf.1920x1080.jpg?t=1633197860",
    "Slug": "city-of-thugs",
    "Meta Title": "City Of Thugs: Oct 2, 2021, Forever Young Games and Full ...",
    "Meta Description": "Looking for information on City Of Thugs? Check out the release date (Oct 2, 2021), developer insights from Forever Young Games, and a complete game sum...",
    "Alt Text Image": "Official header image for City Of Thugs game - Steam 1365800",
    "Canonical URL": "https://gusku.site/game/city-of-thugs",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"City Of Thugs\", \"description\": \"Looking for information on City Of Thugs? Check out the release date (Oct 2, 2021), developer insights from Forever Young Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Forever Young Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Forever Young Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1365800/header.jpg?t=1633197860\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}