{
    "AppID": 1727140,
    "Name": "CYNOROID FORSAKEN",
    "Release date": "Jun 3, 2022",
    "About the game": "CYNOROID FORSAKEN is a free aim platformer that uses the mouse to aim and It is a free aim platformer where you aim with the mouse and move with the WASD keys. With multiple weapons, a laser chainsaw that can be used by right-clicking, and the ability to eat enemy carcasses, you can make your way through a facility full of deformities. Use multiple weapons, a right-clickable laser chainsaw, and eat enemy carcasses as you make your way through the xenomorph-infested facility! . Eat the enemies. . HEAD SHOT! Find the SECRET! Valuable ammunition can often be found. Special weapons and items that will help you to attack the enemy.... Whats this!? Contaminated earth. The weapons that walk the land continue to fight without knowing who they are up against. Civilization has vanished, and on this barren land, giant machines and brutal bio-weapons devour each other. The few surviving humans are being hunted down by mindless enemies. There is nothing left to do but to wait for extinction. The provisional government dispatches a captured bio-weapon 'CYNOROID' to a certain facility, hoping for a ray of hope. He is given two missions. To land at the legacy of a centuries-old mechanical civilization and secure a base of operations. To access the mother computer left in the depths of the site, and To obtain weapons to reverse the human race. A CYNOROID is the only one who enters a research facility infested with deformities. His eyes are just glowing red. CYNOROID 'gula' The latest model of CYNOROID captured by humans. Optimized for long-term exploratory missions. It can temporarily enhance its self-healing ability by ingesting protein from outside. Furthermore, it can generate energy from its normal activities. This energy can be used to stimulate the nervous system of the entire body It is also possible to temporarily enhance physical abilities. In addition to being able to handle a variety of weapons, he also carries an energy chainsaw in his arm.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1727140/header.jpg?t=1654442020",
    "Price": 5.99,
    "Developers": "Crush-vAdin",
    "Publishers": "Crush-vAdin",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1727140/ss_d431f18d6557d033bf24f43d327843a79f83f5df.1920x1080.jpg?t=1654442020,https://cdn.akamai.steamstatic.com/steam/apps/1727140/ss_d270d0ecd88fe8813c5142941c69be35aea89df0.1920x1080.jpg?t=1654442020,https://cdn.akamai.steamstatic.com/steam/apps/1727140/ss_ffeda44b50c1428450894e7abc585393c468f36f.1920x1080.jpg?t=1654442020,https://cdn.akamai.steamstatic.com/steam/apps/1727140/ss_8e0818d600a7736d9d27166416eed97b0e4539a7.1920x1080.jpg?t=1654442020,https://cdn.akamai.steamstatic.com/steam/apps/1727140/ss_cd5dc34db34adcf681b6d641e12c7e0f7476ab2b.1920x1080.jpg?t=1654442020",
    "Slug": "cynoroid-forsaken",
    "Meta Title": "CYNOROID FORSAKEN: Jun 3, 2022, Crush-vAdin and Full Over...",
    "Meta Description": "Looking for information on CYNOROID FORSAKEN? Check out the release date (Jun 3, 2022), developer insights from Crush-vAdin, and a complete game summary.",
    "Alt Text Image": "Official header image for CYNOROID FORSAKEN game - Steam 1727140",
    "Canonical URL": "https://gusku.site/game/cynoroid-forsaken",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CYNOROID FORSAKEN\", \"description\": \"Looking for information on CYNOROID FORSAKEN? Check out the release date (Jun 3, 2022), developer insights from Crush-vAdin, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crush-vAdin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crush-vAdin\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1727140/header.jpg?t=1654442020\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}