{
    "AppID": 854680,
    "Name": "DeepLands",
    "Release date": "Jul 1, 2020",
    "About the game": ". Please read this before you buy DeepLands! DeepLands is the first game that I have ever made, I started working on it when I was fifteen years old. While I was making this game I was really just starting to discover how game design worked and I didn’t have a clear vision of what the core mechanics would be, or what type of game it would become, I just made some levels in my own fictional world named Aris and added the mechanic's way later on. I have made multiple updates and fixed a lot of bugs, but because my coding and game making from back in the day are now so unclear to read and hard, to basically impossible to work with I have decided to go from early access to full release, and do very minimal updates from time to time. It is now 2020 by the time I put this on the store page, I am almost nineteen, and I fear that any updates I will make to the game will only result in more bugs and ultimately in an endless amount of fixing, to the point where I basically have to remake the entire game, this means that most bugs currently in the game will likely remain, though, from the feedback that I have had, I hear that it is still definitely playable at this stage. Please keep this in mind before you buy DeepLands, I still like to play it myself, even though it is not the best game out there, obviously, and I believe that you can certainly still enjoy playing this game. Thank you to all those that have already played DeepLands, I hope you enjoyed it, and to all those that will buy it I also hope you enjoy it and I thank you as well! Tim Venekamp The Game DeepLands is a First-Person Single Player Fantasy game with Puzzle game elements as well as some horror game elements. The player will play mainly as a man who will have to find a way through the DeepLands in order to find his wife and a way home. The game is set in a dark and mysterious setting in the Fantasy world named Áris. The Story The story begins on earth in the near future. The main character you play is a man who just bought an old house and is renovating it. Then all of a sudden strange things start to happen and then his wife disappears one day. Before even getting the chance to call the police he discovers that something is in the house... Then before he knows it he also gets dragged into the same place his wife disappeared into. But luckily he is not alone, a small friend is helping him on his journey through the DeepLands and into the strange world where he is looking to find his wife.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/854680/header.jpg?t=1609220741",
    "Price": 2.99,
    "Developers": "Tim Venekamp",
    "Publishers": "Tim Venekamp",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/854680/ss_f4eb93822517980ae1136ca20e5df6c6f4b65387.1920x1080.jpg?t=1609220741,https://cdn.akamai.steamstatic.com/steam/apps/854680/ss_f02461d4e310645a0d38fb732bc5a2194427d4db.1920x1080.jpg?t=1609220741,https://cdn.akamai.steamstatic.com/steam/apps/854680/ss_fee3995f43d56445abf3641395e0a5452490bfc1.1920x1080.jpg?t=1609220741,https://cdn.akamai.steamstatic.com/steam/apps/854680/ss_eda0810f903d78e2be0db7be0d167f1e7b4614e7.1920x1080.jpg?t=1609220741,https://cdn.akamai.steamstatic.com/steam/apps/854680/ss_154ffd8ce642ef583602a1dd9f6fb8dd7bde6f4f.1920x1080.jpg?t=1609220741,https://cdn.akamai.steamstatic.com/steam/apps/854680/ss_8b308b4fd8c17473a822fee145423e3fc52478bd.1920x1080.jpg?t=1609220741,https://cdn.akamai.steamstatic.com/steam/apps/854680/ss_831ad59520f7a096d35cd36020fcf369bb33cea0.1920x1080.jpg?t=1609220741,https://cdn.akamai.steamstatic.com/steam/apps/854680/ss_dad65602d29bba751e93f831fe21cd0861fd136f.1920x1080.jpg?t=1609220741,https://cdn.akamai.steamstatic.com/steam/apps/854680/ss_4dd28fac5d7600504e8725bf53b270712aeca01a.1920x1080.jpg?t=1609220741",
    "Slug": "deeplands",
    "Meta Title": "DeepLands: Jul 1, 2020, Tim Venekamp and Full Overview",
    "Meta Description": "Looking for information on DeepLands? Check out the release date (Jul 1, 2020), developer insights from Tim Venekamp, and a complete game summary.",
    "Alt Text Image": "Official header image for DeepLands game - Steam 854680",
    "Canonical URL": "https://gusku.site/game/deeplands",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DeepLands\", \"description\": \"Looking for information on DeepLands? Check out the release date (Jul 1, 2020), developer insights from Tim Venekamp, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 1, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tim Venekamp\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tim Venekamp\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/854680/header.jpg?t=1609220741\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}