{
    "AppID": 428660,
    "Name": "Deliver Us The Moon",
    "Release date": "Oct 10, 2019",
    "About the game": "Deliver Us The Moon is a Sci-Fi thriller set in an apocalyptic near future where Earth's natural resources are depleted. In an effort to solve the energy crisis, global powers created the World Space Agency and secured a promising new source of energy on the moon. The World Space Agency colonized and operated from the moon until one fateful night all communications with Earth ceased and the energy source was lost. Now, years later, you assume the role of Earth's last astronaut on a do-or-die mission to investigate what happened and save humanity. During this adventure, your only companion is a small robot named ASE. Together you will traverse the moon, explore abandoned facilities, gather clues and ultimately uncover the secrets and hidden agendas of those long gone! Will you save mankind or be forgotten in the dark abyss of Space? REAL WORLD THEMES The narrative focuses on topical issues, like climate change and the depletion of the world’s natural resources MULTIPLE GAMEPLAY STYLES Experience sequences of 1st and 3rd person play, as Deliver Us The Moon takes you on a genre busting narrative adventure BE AN ASTRONAUT Launch a rocket from Earth, journey through the WSA space station and explore the open lunar landscape with weightless freedom - by foot, rover or monorail UNCOVER THE PAST Ruins of previous lunar missions have many stories and secrets to tell. Use your Astrotool to uncover the history of the lunar colony SUIT UP WITH SPACE AGE TECH With the ASE drone as your sole companion, utilise the greatest technology mankind has to offer from new age space-suits, cutting lasers, rockets and robot arms SURVIVE HAZARDOUS ENVIRONMENTS With oxygen tanks running out and the never-ending void of Space staring you down, staying alive won’t be so easy CRACK THE CODE Overcome obstacles, dangers blocking your path and uncover the secrets of the past by using various tools and all of your wits to solve intricate puzzles FEEL WEIGHTLESS WITH A BREATHTAKING &amp; ATMOSPHERIC SOUNDTRACK Inspired by the greatest works of Sci-Fi in cinema, Deliver Us The Moon has an awe inspiring soundtrack to rival the movies with three hours of original music POWERED BY UNREAL® ENGINE 4 Deliver Us The Moon uses Unreal® Engine 4 to deliver incredible gameplay and stunning graphics GeForce RTX Recommended Spec: GPU: RTX 2060 or higher. CPU: i3-9100F @3.6GHz RAM: 16GB Settings: RT Epic, DLSS Quality, 1080p. Max Settings. Win 10 OS: RS5 or newer",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/428660/header.jpg?t=1654869339",
    "Price": 24.99,
    "Developers": "KeokeN Interactive",
    "Publishers": "Wired Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/428660/ss_f28616e27f6093717e42e18b6793b14b597414ad.1920x1080.jpg?t=1654869339,https://cdn.akamai.steamstatic.com/steam/apps/428660/ss_39a5f0281840495fef2589ad0914f74300fc9e16.1920x1080.jpg?t=1654869339,https://cdn.akamai.steamstatic.com/steam/apps/428660/ss_c92035d34be90aa9b4e3b0bbfe3a32d96c8c6236.1920x1080.jpg?t=1654869339,https://cdn.akamai.steamstatic.com/steam/apps/428660/ss_bc075f8f78673c070b5883e03491364e3e94eada.1920x1080.jpg?t=1654869339,https://cdn.akamai.steamstatic.com/steam/apps/428660/ss_c7c82630d09281e8a03aea8df9a366dc6ac8ef15.1920x1080.jpg?t=1654869339,https://cdn.akamai.steamstatic.com/steam/apps/428660/ss_35bb95f203869418b98da8fc9e707ef1cca600c6.1920x1080.jpg?t=1654869339,https://cdn.akamai.steamstatic.com/steam/apps/428660/ss_89ea36ebd4f4a366e59af23ceecbbafb8fa6b25d.1920x1080.jpg?t=1654869339,https://cdn.akamai.steamstatic.com/steam/apps/428660/ss_1e76e79d099afc32bd735d832ac68ff438e0ea0f.1920x1080.jpg?t=1654869339",
    "Slug": "deliver-us-the-moon",
    "Meta Title": "Deliver Us The Moon: Oct 10, 2019, KeokeN Interactive and...",
    "Meta Description": "Looking for information on Deliver Us The Moon? Check out the release date (Oct 10, 2019), developer insights from KeokeN Interactive, and a complete ga...",
    "Alt Text Image": "Official header image for Deliver Us The Moon game - Steam 428660",
    "Canonical URL": "https://gusku.site/game/deliver-us-the-moon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Deliver Us The Moon\", \"description\": \"Looking for information on Deliver Us The Moon? Check out the release date (Oct 10, 2019), developer insights from KeokeN Interactive, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 10, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"KeokeN Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wired Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/428660/header.jpg?t=1654869339\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}