{
    "AppID": 1484280,
    "Name": "Demeo",
    "Release date": "May 6, 2021",
    "About the game": "Adventurers, it’s time to unite! A dark force has taken over the underworld in the RPG dungeon crawler, Demeo, and it’s a world you’re not likely to survive alone. Demeo is a cross-platform cooperative adventure for up to four players that recreates all of the magic and camaraderie of gathering around a tabletop with friends to do battle against the forces of evil. Assume the role of the eagle-eyed hunter, mystical sorcerer, deadly assassin, or protective guardian, melodic bard or powerful warlock. But choose your heroes wisely in this cooperative adventure, for once players have accepted their quest, they must work together to vanquish the unholy force that corrupts everything... or die trying. Gilmerra is a place of contrast, consisting of eight provinces stretching across mountains, forests, caves and oceans. It holds the beauty of a sunset over a meadow where sherp bunnies and brins feed their younglings, or perhaps a wedding taking place in the village of Torp. At the same time, there is also an ugly side. Maybe a reaver drags you down below in a murky river or a vílther attacking you as you explore the ruins of Castle Hollowmark. One might state that The 5th Earth the world of Demeo is an ancient coin with two sides - one light and one dark. Gathering your best friends for a night of casting spells, rolling dice, and moving miniatures are some of your fondest memories -- and now you can have this same experience with players from anywhere in the world! Demeo recreates all the fun of tabletop dungeon crawling in the digital space by connecting players for table talk, treasure hunts, and plenty of turn-based action with infinite replayability. Demeo has an extensive content map planned to ensure adventurers have a steady supply of new stories, settings, and villains to contend with. It’s dangerous to go alone! Grab your friends and assemble a party, because plumbing the depths of Demeo requires strategy, cunning, and teamwork. Every character has their own unique approach to managing magic and monsters — and they’ll need to work together if they want to survive! Take the mantle of the hunter, sorcerer, assassin, guardian, bard, or warlock, all with their own unique abilities and skills, and use them wisely if you are ever to vanquish the darkness that is Rackarn and Alfaragh. Construct a deck from more than 60 unique cards to deal damage, cast spells, and heal your party as you battle your way through the world of Demeo together. Unlock new cards and abilities for your class as you build your hero for conquest and glory! Our story originated inside the Elven Necropolis — but that was just a mere overture! Following the first Demeo adventure, The Black Sarcophagus, players have already explored the Realm of the Rat King and Roots of Evil — and with our latest adventure Curse of the Serpent Lord, they’ll venture into Ronth Desert for the first time and meet Demeo’s newest playable character Oana, Warlock of the Ancients. Join your fellow adventurers in Heroes’ Hangout, a social space where players can meet and share their stories of treacherous quests and tantalizing encounters. Come together with new friends to start your next Demeo adventure together, or pal around as you play archery and arcade mini-games, paint miniatures, learn tips, listen to cassettes on the boombox, customize your avatar and more. Go on an adventure with friends on PC and other VR devices! Cross-play multiplayer lets you play Demeo with players wherever they are, including Oculus — and with Demeo: PC Edition now available, you can even play with friends who still need to equip a VR headset of their own!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1484280/header_alt_assets_3.jpg?t=1658163715",
    "Price": 23.99,
    "Developers": "Resolution Games",
    "Publishers": "Resolution Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1484280/ss_eb42b4d31bb8bb1184995bf1cde240366890a14e.1920x1080.jpg?t=1658163715,https://cdn.akamai.steamstatic.com/steam/apps/1484280/ss_038d3ce6b91da44d90bf967154059280301c45e1.1920x1080.jpg?t=1658163715,https://cdn.akamai.steamstatic.com/steam/apps/1484280/ss_8d09aec62c923f2bd2cba22aa0c3fef68d193ff4.1920x1080.jpg?t=1658163715,https://cdn.akamai.steamstatic.com/steam/apps/1484280/ss_55caba44349af4b8837bfded7b7477dfb7c08bf9.1920x1080.jpg?t=1658163715,https://cdn.akamai.steamstatic.com/steam/apps/1484280/ss_9ea0f7c008b9f4d9c4bd28b3f0ffd040431984e3.1920x1080.jpg?t=1658163715,https://cdn.akamai.steamstatic.com/steam/apps/1484280/ss_765de2f75f3a1685c6ace1dda8a556bb8ab9a831.1920x1080.jpg?t=1658163715,https://cdn.akamai.steamstatic.com/steam/apps/1484280/ss_bac1a9e1f58a14cb813c99373dbc011a100e87bc.1920x1080.jpg?t=1658163715,https://cdn.akamai.steamstatic.com/steam/apps/1484280/ss_507061d77e1cfdffe9167ad4053649048ece6eb6.1920x1080.jpg?t=1658163715,https://cdn.akamai.steamstatic.com/steam/apps/1484280/ss_f815791e5206aa14b9c7b90120fa2e5f126ab883.1920x1080.jpg?t=1658163715,https://cdn.akamai.steamstatic.com/steam/apps/1484280/ss_95d3473d72a7aa464b1ebb61aa39820830ad3e04.1920x1080.jpg?t=1658163715,https://cdn.akamai.steamstatic.com/steam/apps/1484280/ss_e231e2ba4a757c8593895ebff56f52581872e8d5.1920x1080.jpg?t=1658163715,https://cdn.akamai.steamstatic.com/steam/apps/1484280/ss_6af7dbb6c0dc92e86c40a94b9d1f267f017ad42f.1920x1080.jpg?t=1658163715",
    "Slug": "demeo",
    "Meta Title": "Demeo: May 6, 2021, Resolution Games and Full Overview",
    "Meta Description": "Looking for information on Demeo? Check out the release date (May 6, 2021), developer insights from Resolution Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Demeo game - Steam 1484280",
    "Canonical URL": "https://gusku.site/game/demeo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Demeo\", \"description\": \"Looking for information on Demeo? Check out the release date (May 6, 2021), developer insights from Resolution Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 6, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Resolution Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Resolution Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1484280/header_alt_assets_3.jpg?t=1658163715\", \"offers\": {\"@type\": \"Offer\", \"price\": 23.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}