{
    "AppID": 1107860,
    "Name": "Dofense",
    "Release date": "May 16, 2022",
    "About the game": "Dofense is a Tower Defense RTS focused on the variety of strategies and maps . Dynamic Terrain The map is not static. Enemy can dig through the weak rock and change the map drastically by creating shortcuts. On the other hand, you can drill obstacle tiles to change the map to your advantage too. The dynamic terrain opens new opportunities for interesting strategies. Distinct towers Every tower has a unique advantage. Shock can only damage Shield, Laser can only damage health. Gun can damage both. Pyro can damage health, even with shield intact. Area damage towers are effective against dense crowds; while the Gun engages enemies one at a time. In the tight single lanes, use Spike and Glitch traps without blocking the path. You can craft unique strategies to win a given map. More than just the Towers Look out for these helpful gadgets. The Train and the Grinder can get rid of a huge chunk of the enemy, if you build the maze to take advantage of it. The Core Mint offers an opportunity for a gameplay where you start with a tight budget, but with careful moves build your energy output gradually towards victory. Quirky Bosses Healing Lips that offer Kisses of health to the enemies. A Constipated Eye that spoils towers at random. A Restless hand that can't make up its mind about destroying towers. The Haunted Tree with guardian ghosts. These surreal bosses add a new flavor to the gameplay. Campaign The campaign has a central track that introduces you to different game mechanics one at a time. It branches into 11 missions in which you get to play interesting maps with high crystal count. Crystals are the currency to encode your strategy. The goal of the campaign is to offer a variety of strategies and not to grind you for XP. Level editor with Workshop support In addition to the carefully designed campaign, you can make and play your own levels. You can do this in the built-in level editor. It's the same editor that was used to design the campaign levels, so you have access to every game mechanic. It is also integrated with the Steam workshop, so you have access to the community designed maps too.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1107860/header.jpg?t=1653410654",
    "Price": 12.99,
    "Developers": "Blue Math",
    "Publishers": "Blue Math",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1107860/ss_341581ec7995b143b044a7e83cfcead631384476.1920x1080.jpg?t=1653410654,https://cdn.akamai.steamstatic.com/steam/apps/1107860/ss_c9d46a24e5544ce352eb48f39b166baafc53a0f2.1920x1080.jpg?t=1653410654,https://cdn.akamai.steamstatic.com/steam/apps/1107860/ss_86f0f1cc579715e33d315726940ffdca6fcfd142.1920x1080.jpg?t=1653410654,https://cdn.akamai.steamstatic.com/steam/apps/1107860/ss_b903e6dd498f3e5fdf45140e5be651b1ff4ab139.1920x1080.jpg?t=1653410654,https://cdn.akamai.steamstatic.com/steam/apps/1107860/ss_49f85c44be3140a1e9532c9add9f4bd15caaa6bc.1920x1080.jpg?t=1653410654,https://cdn.akamai.steamstatic.com/steam/apps/1107860/ss_f047862cc73c505aba11c9d39fc94661080dcd9b.1920x1080.jpg?t=1653410654,https://cdn.akamai.steamstatic.com/steam/apps/1107860/ss_cfe3ad07b3bff161ad299260f022a1a1a83ec222.1920x1080.jpg?t=1653410654",
    "Slug": "dofense",
    "Meta Title": "Dofense: May 16, 2022, Blue Math and Full Overview",
    "Meta Description": "Looking for information on Dofense? Check out the release date (May 16, 2022), developer insights from Blue Math, and a complete game summary.",
    "Alt Text Image": "Official header image for Dofense game - Steam 1107860",
    "Canonical URL": "https://gusku.site/game/dofense",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dofense\", \"description\": \"Looking for information on Dofense? Check out the release date (May 16, 2022), developer insights from Blue Math, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blue Math\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blue Math\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1107860/header.jpg?t=1653410654\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}