{
    "AppID": 1693430,
    "Name": "Dungeon Overseer",
    "Release date": "Dec 21, 2021",
    "About the game": "Become the Overseer! Dungeon Overseer is a colony simulator with a focus on base building and resource management. Dungeon Overseer looks to combine the fun elements of games like Dungeon Overlord and Fallout Shelter. Don the crown and pursue glory by building a unique dungeon layout, constructing your lair, upgrading and expanding your creation, questing, crafting, researching, recruiting, defending your base, and raiding. Build a resource production pool that will sustain your minion army. Level up your rooms and your minions. Become the Overseer and let everyone witness your true power! FEATURES Build Your Lair Construct your dungeon with a multi tier tile system. All construction is based on your tile layouts so you can shape your dungeon the way you want. Certain minions hang out in certain rooms so designing your layout can assist with defense. Design the perfect dungeon layout with the tile foundation system Construct 10 different unique room types Upgrade and expand each room type 4 times with special bonuses each tier Purchase add ons for each room type to further add bonuses and unlock special features Recruit Recruit from a variety of minions each with a specific benefit and purpose. Level them up and increase not only their power but the rewards they can earn while raiding. Higher tier minions can collect higher tier resources. Construct your lair, library, and temple rooms to unlock new minions Higher tier minions collect rarer resources while raiding Level up your recruits to increase their power and their raiding results Quest Detailed quests will help guide you through each part of becoming The Overseer. Continue to advance and unlock new quests that will assist in the construction and recruitment of your minions. Learn the ropes while collecting rewards Complete over 50 initial current quests The current quest line will have your dungeon up and running in no time Raid While in base your minions gain experience but the best experience is while they are sent out into the world on raids. Monitor their progress, revive, level up, and order them to return home through the minion raid screen. Demand obedience and send minions on raids via the Overseers Roster Each minion collects experience, resources, and a tier specific rare while raiding Monitor each minions progress via the Overseers Raid screen and level them up, revive them, and order their return to collect spoils Defend The elemental golems that protect the mountain haven't taken kindly to your constant construction inside their home. Defend your base from invasions by designing a well laid out base and hiring the proper minions to defend against each incursion. While you maybe the Overseer your new mountain home is plagued by Golems who dislike your industrious efforts Construct a solid base layout to protect your troops from the golems Hire minions to fight off the golem armies. Collect rewards for defending or lose resources for failing the challenge is yours Research Research plays a vital role in the development of your dungeon. Unlock new add ons for each room type, upgrade your minions power, and even unlock the best minion and resource through research. Collect research points from your library Research upgrades for your rooms to unlock add ons Research upgrades to increase your minions power Craft You collect base resources throughout your dungeon as minions produce them for you. You can then use the foundry to craft rare ingots from those base resources. These ingots are the foundation for the toughest minions and highest tier room construction. Unlock rare resource crafting in the foundry room Upgrade your foundry to increase the rate at which rares are produced Upgrade your foundry to unlock higher tier rare resources needed for your base and minions Let's get to ordering about minions, building an empire, and crushing the weak. Don the crown and become the Dungeon Overseer!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1693430/header.jpg?t=1640192930",
    "Price": 0.0,
    "Developers": "Ripknot",
    "Publishers": "Ripknot",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1693430/ss_e128d6c677a1025a2dd916ba4e6295c054d4e3f7.1920x1080.jpg?t=1640192930,https://cdn.akamai.steamstatic.com/steam/apps/1693430/ss_e7e5f4c7c153363d9b987975277ada183a56745a.1920x1080.jpg?t=1640192930,https://cdn.akamai.steamstatic.com/steam/apps/1693430/ss_3904d998968655505677c00105d45bd43802b95b.1920x1080.jpg?t=1640192930,https://cdn.akamai.steamstatic.com/steam/apps/1693430/ss_030a1ffca2f659a7131eb95a1592128b8742f646.1920x1080.jpg?t=1640192930,https://cdn.akamai.steamstatic.com/steam/apps/1693430/ss_6b0044ed3e42fd77e3f6c0fdc5c145c29b7759d4.1920x1080.jpg?t=1640192930,https://cdn.akamai.steamstatic.com/steam/apps/1693430/ss_2d2d419395a4e52de78fe05676f02454075012c0.1920x1080.jpg?t=1640192930,https://cdn.akamai.steamstatic.com/steam/apps/1693430/ss_6f2b702731b73035f19ce260e0b5236b010a3cb2.1920x1080.jpg?t=1640192930,https://cdn.akamai.steamstatic.com/steam/apps/1693430/ss_770fd71b088eda562e1d64d8faf1c31316e72f81.1920x1080.jpg?t=1640192930,https://cdn.akamai.steamstatic.com/steam/apps/1693430/ss_26d268cd7e293fe25b20c85f39f2bea7ed8eaabd.1920x1080.jpg?t=1640192930,https://cdn.akamai.steamstatic.com/steam/apps/1693430/ss_d4c8088a290aed135be9b207ac822ca30ddd58dd.1920x1080.jpg?t=1640192930,https://cdn.akamai.steamstatic.com/steam/apps/1693430/ss_96f4278e880e4633a6d4e8d5fa5d080d2ab3887d.1920x1080.jpg?t=1640192930",
    "Slug": "dungeon-overseer",
    "Meta Title": "Dungeon Overseer: Dec 21, 2021, Ripknot and Full Overview",
    "Meta Description": "Looking for information on Dungeon Overseer? Check out the release date (Dec 21, 2021), developer insights from Ripknot, and a complete game summary.",
    "Alt Text Image": "Official header image for Dungeon Overseer game - Steam 1693430",
    "Canonical URL": "https://gusku.site/game/dungeon-overseer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dungeon Overseer\", \"description\": \"Looking for information on Dungeon Overseer? Check out the release date (Dec 21, 2021), developer insights from Ripknot, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ripknot\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ripknot\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1693430/header.jpg?t=1640192930\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}