{
    "AppID": 793490,
    "Name": "Exocraft",
    "Release date": "Mar 12, 2019",
    "About the game": "Set on a dying alien world, Exocraft places you in command of your very own space mining fleet. Design custom spaceships, manage your crew members and wield the elemental powers of your army of worker drones to defeat the ancient guardians that litter the landscape. Engage in action-packed battles and use your strategy (and a bit of luck) to conquer the richest resource deposits throughout the dynamic world. Or, team up with friends to test your skills in competitive gameplay modes as part of this ever-growing open world full of danger and untold riches. BUILD CUSTOM SPACESHIPS Let your imagination run wild with nearly limitless combinations of ship parts, paints and other customizations to create your own unique spacecraft for strategy, looks and total domination. BATTLE FOR RESOURCES Command your arsenal of drones in epic space battles against ancient guardians for valuable resources. Compete with other pilots for the most valuable deposits of crystals, gems, elemental cores and scrap spacecraft parts, or team up with them to take on the most fearsome of opponents. GROW YOUR FLEET One mining spaceship is great, but in Exocraft you can design and build an entire fleet. Manage each starship’s crew members, control your elemental drones and expand your space mining empire to become the ultimate space tycoon. SURVIVE THE ALIEN LANDSCAPE This alien world is an unforgiving desert wasteland, and not everyone makes it out alive. Hone your skills and strategy as you build up your defenses to survive and prosper as the ultimate space mining fleet. TEAM UP WITH FRIENDS It’s dangerous to go alone into the vast desert. Dangers are at every turn, so team up with friends to take on the most dangerous and valuable of guarded mines. Or, enter your best spaceships in the competitive Team Race mode where you and others compete for the most resources in an exciting race against time. JOIN A SQUAD Build an alliance of the best pilots to challenge yourself to new heights as part of monthly tournaments and rankings. Squad chat helps you to organize around common goals and defeat your enemies with even more precision. DYNAMIC MULTIPLAYER WORLD Exocraft is a true massively multiplayer online game where your progression is saved and everyone shares the same massive world. Instead of splitting the world between servers like most IO games, the game world grows and shrinks to match the online players, meaning you can always play with everyone and compete for the same resources in a truly unique gaming experience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/793490/header.jpg?t=1642531106",
    "Price": 0.0,
    "Developers": "GoldFire Studios",
    "Publishers": "GoldFire Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/793490/ss_879ffbecbc31408a6c8d4eb279cc7eff28ec4baa.1920x1080.jpg?t=1642531106,https://cdn.akamai.steamstatic.com/steam/apps/793490/ss_5b11215d9f4f1d3fc13836276c6ee13ccaa42e32.1920x1080.jpg?t=1642531106,https://cdn.akamai.steamstatic.com/steam/apps/793490/ss_e1d9903876490435f690391bc63feb5b8edf914c.1920x1080.jpg?t=1642531106,https://cdn.akamai.steamstatic.com/steam/apps/793490/ss_1652211e96ceb6218f38e42ffd424fd788cd5fd0.1920x1080.jpg?t=1642531106,https://cdn.akamai.steamstatic.com/steam/apps/793490/ss_bec36147899a68a6d9d5847cad5c84179dfdf257.1920x1080.jpg?t=1642531106,https://cdn.akamai.steamstatic.com/steam/apps/793490/ss_526669f5324f01814357c0890ec7bde0f70495ab.1920x1080.jpg?t=1642531106,https://cdn.akamai.steamstatic.com/steam/apps/793490/ss_74a5b5ebd43d72eb6e1cb274b65a7fabffe662ca.1920x1080.jpg?t=1642531106,https://cdn.akamai.steamstatic.com/steam/apps/793490/ss_536e9bcb564008ad2d9e0723a15556a3beca6d94.1920x1080.jpg?t=1642531106",
    "Slug": "exocraft",
    "Meta Title": "Exocraft: Mar 12, 2019, GoldFire Studios and Full Overview",
    "Meta Description": "Looking for information on Exocraft? Check out the release date (Mar 12, 2019), developer insights from GoldFire Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Exocraft game - Steam 793490",
    "Canonical URL": "https://gusku.site/game/exocraft",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Exocraft\", \"description\": \"Looking for information on Exocraft? Check out the release date (Mar 12, 2019), developer insights from GoldFire Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"GoldFire Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GoldFire Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/793490/header.jpg?t=1642531106\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}