{
    "AppID": 1695340,
    "Name": "西湖断桥白娘子",
    "Release date": "Aug 12, 2021",
    "About the game": "Introduction to the game: The white lady of the bridge breaking in West Lake is a large-scale online game with the background of the white snake biography. The player will play a disciple of a certain sect in this continent, collect more partners through constant adventure and cultivation, get better pets and explore it constantly in this continent. Welcome to join us *Steam's first game of large scale network round without recharge *A surprise game of fair competition in strong social and strong team Come to capture your pet, make your best lineup, and hope the game will bring a lot of fun to every player If you have any opinions and suggestions on this product, please join our official QQ communication group: About this game As a large online online online game, white lady of the bridge broken in West Lake is not ready to open any recharge. So games tend to be more team-based and social. Game features *Different sects The selection of the corresponding school will affect the growth of your own attributes and the positioning of the battle in the whole game. *Match your own lineup Players can adjust the formation and lineup to deal with different levels and competitions. You can make yourself stronger by improving your level, cultivating skills and building equipment. Any group in the game may improve your combat power and expect the players to explore and explore. *A variety of ways to play The total number of games is more than 30 kinds of play. Besides the daily play methods, we also add some limited time play and periodic play to increase the fun and exploration of the game. And each play has a relatively good output, so that players can play every day to play different and interesting patterns. *Rich task lines There are not only main line tasks, but also regional tasks and special tasks. In order to assist the players to understand, there are corresponding guidance tasks when players unlock new functions. You will get a lot of rewards for completing all tasks. *Create exclusive partners and pets In addition to some basic skills, players can adjust the way and skills of partners and pets according to their own needs. There are rich skill systems in the game for players to choose from. Come and join our game, and win the fame in the school. Press the crowd in the arena! Hope the game can bring different surprises to all players!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1695340/header.jpg?t=1628832933",
    "Price": 7.99,
    "Developers": "Wuwukai studio",
    "Publishers": "Wuwukai studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1695340/ss_bc00733edf1429dd29baa2208a7d3e31a161cb77.1920x1080.jpg?t=1628832933,https://cdn.akamai.steamstatic.com/steam/apps/1695340/ss_6007b6518223fac841730369926975de552d47b9.1920x1080.jpg?t=1628832933,https://cdn.akamai.steamstatic.com/steam/apps/1695340/ss_e37a125d6d056216da9b9d839b4d27d1d879b094.1920x1080.jpg?t=1628832933,https://cdn.akamai.steamstatic.com/steam/apps/1695340/ss_cfbd2810d52a58760aa0a196353936b7ad5c461d.1920x1080.jpg?t=1628832933,https://cdn.akamai.steamstatic.com/steam/apps/1695340/ss_66bc10041341011528565d867e9f9c41c6dfe480.1920x1080.jpg?t=1628832933,https://cdn.akamai.steamstatic.com/steam/apps/1695340/ss_b2caf96ac2bb918894ac5039ef440e692b468ffb.1920x1080.jpg?t=1628832933,https://cdn.akamai.steamstatic.com/steam/apps/1695340/ss_6ea5fa3f5c9764f1c7fb5c76fd7075d15ca562fc.1920x1080.jpg?t=1628832933",
    "Slug": "",
    "Meta Title": "西湖断桥白娘子: Aug 12, 2021, Wuwukai studio and Full Overview",
    "Meta Description": "Looking for information on 西湖断桥白娘子? Check out the release date (Aug 12, 2021), developer insights from Wuwukai studio, and a complete game summary.",
    "Alt Text Image": "Official header image for 西湖断桥白娘子 game - Steam 1695340",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u897f\\u6e56\\u65ad\\u6865\\u767d\\u5a18\\u5b50\", \"description\": \"Looking for information on \\u897f\\u6e56\\u65ad\\u6865\\u767d\\u5a18\\u5b50? Check out the release date (Aug 12, 2021), developer insights from Wuwukai studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wuwukai studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wuwukai studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1695340/header.jpg?t=1628832933\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}