{
    "AppID": 370590,
    "Name": "Gem Wars: Attack of the Jiblets",
    "Release date": "Dec 14, 2015",
    "About the game": "Gem Wars: Attack of the Jiblets is a combat party platformer for up to 4 players. It's a local/online party game centered around the concept of 'constant one-upmanship.' Power-ups include gems that can be picked up to empower your character with a certain element. Each element has a strength and a weakness (i.e, fire is strong against earth, but water is strong against fire). Also available are Lethal Arms, which can change your default weapon shot from a normal pea-shot to a Gatling, Barrage, Launcher, Ball or Thrower. When these two power-ups are combined they can make a deadly new weapon (i.e, Fire Gem + Thrower = Flamethrower or Water Gem + Thrower = Super Soaker). Mix and match your equipment with an expansive arsenal of unique Tactical Arms (which include a teleporter, cement block-maker, homing beacon, bear trap dropper, swingable rope, shot-reflecting shield, magnetball that rips off enemy equipment and a claw that forces your opponents to wear whatever gem you want) and the extra-transportational Power Boots (jet boots for flying, rocket boots for speed and spike boots for stomping out enemies). Features include: - Single player Challenges Mode with 30 Challenges - Survival Mode for 1-4 Players - Infection Mode - 4 Players (or AI-controlled players) lock into battle for 4 rounds. Each round, someone is selected as an Infected player. That player has to infect everyone else to win the round. - 7 Multiplayer Battle Modes for Local and Online, including: Deathmatch, King of the Hill, Super Gem, Mixed, Last Standing, Trophy and Domination - All Battle Modes can be played with score/stock/time variants, Free-For-All or Team game types and wide variety of gameplay modifiers like Gem Roulette (where every 15 seconds, the player's element switches) - Create-A-Character with 50 unlockable character parts - 6 Unique Arenas - 20 Pieces of Equipment - 47 Steam Achievements - Steam Trading Card Support The Story: The Jiblets were a benevolent species that inhabited the world of Septia. Due to overpopulation, a large portion of Jiblets were forced to move underground (these were appropriately referred to as The Descended). Years later, elemental gems and weaponry began sprouting around Septia. The Jiblets, never having experienced such power, became corrupt. War broke out. Turns out that the appearance of the elemental gems and weaponry was all a scheme by The Descended, whose numbers have been decimated over the years due to similar infighting caused by the same gems. The exposure to the gems in their purest form have turned The Descended into deformed monstrosities with great power and intellect. The Descended have plotted to wipe out the unevolved Jiblets and replace them as the master race. By releasing the gems, The Descended let the Jiblets battle among each other, setting the Jiblets' own genocide in motion.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/370590/header.jpg?t=1503676528",
    "Price": 0.0,
    "Developers": "Queen Birdface Productions",
    "Publishers": "Queen Birdface Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/370590/ss_9bd873e3c61fd7c25382d4f05de7682a90f69c6a.1920x1080.jpg?t=1503676528,https://cdn.akamai.steamstatic.com/steam/apps/370590/ss_3e047bb33ec7991397e6b58346716aa300acc3cf.1920x1080.jpg?t=1503676528,https://cdn.akamai.steamstatic.com/steam/apps/370590/ss_ab0699f8a272f4e5c0e20e933f3945cb068f5316.1920x1080.jpg?t=1503676528,https://cdn.akamai.steamstatic.com/steam/apps/370590/ss_d68fc1db75d983b50e84ed63f9688528d86e8b64.1920x1080.jpg?t=1503676528,https://cdn.akamai.steamstatic.com/steam/apps/370590/ss_bc814495f761fdd4574271d90ac2fffae3a8ec5a.1920x1080.jpg?t=1503676528",
    "Slug": "gem-wars-attack-of-the-jiblets",
    "Meta Title": "Gem Wars: Attack of the Jiblets: Dec 14, 2015, Queen Bird...",
    "Meta Description": "Looking for information on Gem Wars: Attack of the Jiblets? Check out the release date (Dec 14, 2015), developer insights from Queen Birdface Production...",
    "Alt Text Image": "Official header image for Gem Wars: Attack of the Jiblets game - Steam 370590",
    "Canonical URL": "https://gusku.site/game/gem-wars-attack-of-the-jiblets",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gem Wars: Attack of the Jiblets\", \"description\": \"Looking for information on Gem Wars: Attack of the Jiblets? Check out the release date (Dec 14, 2015), developer insights from Queen Birdface Production...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Queen Birdface Productions\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Queen Birdface Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/370590/header.jpg?t=1503676528\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}