{
    "AppID": 280540,
    "Name": "GhostControl Inc.",
    "Release date": "Jun 6, 2014",
    "About the game": "Manage a team of ghosthunters and free London from paranormal terror in turn-based battles. Develop your own strategy and build your business well. Let's be honest - a ghost in your house can be a real pest. For centuries we have accepted hauntings as unexplained phenomena which we can do little to stop. Side affects of living in a haunted home can include sleepless nights, headaches, smog everywhere and in some cases even physical damage in the house. Enough is enough, with your help we intend to put an end to these paranormal pests. Build, manage and develop your own team of talented ghost hunters. With the income from your team's work you can equip them with some amazing gadgets, but manage your budget with care not everything is as useful as it may appear. Hunt your customers ghosts down - property damage should be kept to a minimum. Take on the ghosts, follow the map, take in the lovely sites and stunning landmarks. Features Be the hero of the day and save the city! True, challenging turn-based strategy gameplay Loads of ghost hunting with various equipment Team management and strategic investment decisions A London city map with famous landmarks Tons of humour in text messages and game action Original game music soundtrack GhostControl Inc. Backstage Some data London Map pixeled in 786,432 dots with several well known buildings like Buckingham Palace, Big Ben, London Eye, St Paul's Cathedral and many more. Different level settings like apartment, office, graveyard, The Tube or restaurant will create different challenges for the player. About 150 ghost hunter portraits for „Harry Frankle“, „Hazel Nuts“ or „Roger Rapid“ - some of them depicting well known gaming celebrities. About 20 hours of game play. 18 different ghost types and numerous variations with nifty AI. Challenging boss fights with special scripting and a story line for each of them. More than 58 achievements. Alarm phone calls start a mission with a unique dialogue systems that creates about 70,000 unique dialogues. On top 800 hand written crazy phone call lines for surprises and to develop the story line. More than 350 funny context sensitive shoutouts that pop up in speech bubbles and as audio, recorded with female and male voices of professional voice actors. Over 100 hidden references to other classical video games, movies or books are hidden as text or graphics in the game. We have created over 90 devices of which most are actually useful in the game and a few dozen are actually pretty useless, but funny. About 100 news messages are sent to the in-game smartphone to tell players about the story line or some absurd 100% made up stories that the player may or may not read. Also presenting 20 manufacturers of ghost hunting equipment in company profiles. Original music score composed by Sound Of Games. Over 100 hand crafted original sound effects. Background information: The developers of GhostControl Inc. are big fans of classic games such as GhostBusters, the original XCOM, Theme Hospital and FTL. In it's classic pixel art retro style the game comes with outstanding original graphics and a funny story line.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/280540/header.jpg?t=1606207715",
    "Price": 6.79,
    "Developers": "bumblebee",
    "Publishers": "Application Systems Heidelberg",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/280540/ss_6f325486ee511b3b5b1d9c05d8c326c7a718cb30.1920x1080.jpg?t=1606207715,https://cdn.akamai.steamstatic.com/steam/apps/280540/ss_427de83d3b9e3a71c0da7f3cceb139aeadd06696.1920x1080.jpg?t=1606207715,https://cdn.akamai.steamstatic.com/steam/apps/280540/ss_7709a00e381546778d6436013f80116243eb9fd0.1920x1080.jpg?t=1606207715,https://cdn.akamai.steamstatic.com/steam/apps/280540/ss_946af23ac4e60dc6eaf4f0e9b039da996ad9552b.1920x1080.jpg?t=1606207715,https://cdn.akamai.steamstatic.com/steam/apps/280540/ss_b455311ab9852b451f2337999eafd49d33850c68.1920x1080.jpg?t=1606207715,https://cdn.akamai.steamstatic.com/steam/apps/280540/ss_df0b38c3ecd10af2a42b3b5f4cfd946d6f3c8cbe.1920x1080.jpg?t=1606207715,https://cdn.akamai.steamstatic.com/steam/apps/280540/ss_4845eb90371536e799a96b56750f5b968f49b9aa.1920x1080.jpg?t=1606207715,https://cdn.akamai.steamstatic.com/steam/apps/280540/ss_5a02485fe1f51db0c550d0d2de3a27aa539b779e.1920x1080.jpg?t=1606207715,https://cdn.akamai.steamstatic.com/steam/apps/280540/ss_e6762c7184708a4ae2fc371739e6509fad6e7cbf.1920x1080.jpg?t=1606207715",
    "Slug": "ghostcontrol-inc",
    "Meta Title": "GhostControl Inc.: Jun 6, 2014, bumblebee and Full Overview",
    "Meta Description": "Looking for information on GhostControl Inc.? Check out the release date (Jun 6, 2014), developer insights from bumblebee, and a complete game summary.",
    "Alt Text Image": "Official header image for GhostControl Inc. game - Steam 280540",
    "Canonical URL": "https://gusku.site/game/ghostcontrol-inc",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"GhostControl Inc.\", \"description\": \"Looking for information on GhostControl Inc.? Check out the release date (Jun 6, 2014), developer insights from bumblebee, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 6, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"bumblebee\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Application Systems Heidelberg\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/280540/header.jpg?t=1606207715\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}