{
    "AppID": 1157010,
    "Name": "Him and I",
    "Release date": "Oct 4, 2019",
    "About the game": "Him &amp; I tells a story about a father and son ,and their struggle to survive after the virus broke out. Niel ,the protagonist, tries to go to North Star which is the last castle built by men in order to save his son. Him &amp; I; is an indie 2D action/adventure game. One year after the virus spreads, it is about the relationship between a father and his son on their journey to the North Star. In this process, it tells the fears, feelings, losses and struggles of our main characters. -A new game! Experience Him &amp; I's dramatic and funny story! -Save your son! No matter who confronts Niel - zombies, bandits, even the army - he must survive to save his son! - Join the adventure! Help Niel and Tom in this difficult and terrifying journey. Join your adventurous journeys! -2D return to retro styles! Experience the story of Him and I presented to its users with pixel art! -Virus! A devastating and shocking virus has swept the world, find out why and try to survive! -Solve puzzles! Find the answers to the questions and riddles Tom couldn't get out of or answer! -Let's not forget our tin wars! Experience this battle where robots try to separate each other to the screw! -Jump off the platforms to avoid lunch for the zombies! Try to escape from barricades, obstacles and platforms just in time to escape the zombies! - A charismatic enemy! Help Niel and Tom defeat our archenemy, who has a full story, not lacking muscle and charisma! -Help Tom with his nightmares! Help our son, who has different tragicomic nightmares every night, wake up from his nightmares! - Protect your comrades and take them with you! Protect the comrades and friends you meet, no matter what happens, and help them get to the North Star! -Feel the atmospheres! Witness the story of Him &amp; I by experiencing the atmosphere of an abandoned city and experiencing a desolate forest or a house arrest full of spirits! -Feel the emotions! Feel the relaxation when the tension comes to the right; It's a relaxing, scary, hilarious and funny story! -Dark secrets! Experience our characters' backgrounds, mistakes and losses! -Humor! Have fun with his unique style of humor! -It is an indie production! An action and adventure game that shows that every frame has an independent production! The dangerous are not just infected! In the Him &amp; I story, it's not just the infections that you have to tackle; beings from another dimension, cannibalized gangs and even the army. You have to go through it all for your son! -Music festival Unique music for every scene. Experience Him &amp; I to relax, to be sad and happy! -Nobody is as innocent as they seem. In the Him &amp; I universe, nobody is an angel, but each character's own goals are their own right, they do not make them innocent, you experience who is innocent or not! Improve your reflexes! With sudden quick-time events, you have to be careful to survive! -Gameplay! Your gun may not always aim correctly! The knife is a more reliable friend in this world. Open and kill your combos by chopping your enemies with your knife, it will be the most effective way to kill multiple enemies. -Stage design! Witness the glow of the sky or the fierceness of nightfall with 2D Retro pixel art. See abandoned cities, forests, rivers all illuminating with your own eyes like a star!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1157010/header.jpg?t=1598018436",
    "Price": 9.99,
    "Developers": "Xenmentia Softworks",
    "Publishers": "Xenmentia Softworks",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1157010/ss_ae9c7d42347dd1adbfb07b2fe4324abbec924d3a.1920x1080.jpg?t=1598018436,https://cdn.akamai.steamstatic.com/steam/apps/1157010/ss_2cf16df3aa06629c3852da89713ec9d75b4a24b6.1920x1080.jpg?t=1598018436,https://cdn.akamai.steamstatic.com/steam/apps/1157010/ss_5c01ad95aae6c4fe9e48a21094beb010982b50bd.1920x1080.jpg?t=1598018436,https://cdn.akamai.steamstatic.com/steam/apps/1157010/ss_48379824f7a7d364a159b849abe6285e1ddfc144.1920x1080.jpg?t=1598018436,https://cdn.akamai.steamstatic.com/steam/apps/1157010/ss_5fd12966a38241816b3c182fb95eff240afb4599.1920x1080.jpg?t=1598018436,https://cdn.akamai.steamstatic.com/steam/apps/1157010/ss_74fc97ea689df16131b099e26a6f74ef53c8535e.1920x1080.jpg?t=1598018436,https://cdn.akamai.steamstatic.com/steam/apps/1157010/ss_404372a9a15d033103d69870689df3ac5beb2e0f.1920x1080.jpg?t=1598018436,https://cdn.akamai.steamstatic.com/steam/apps/1157010/ss_3d5477e14e4ac875310ebb9dc7fb1ebf9e7cbe8b.1920x1080.jpg?t=1598018436,https://cdn.akamai.steamstatic.com/steam/apps/1157010/ss_9aeb1ef34d7b926673f34ff162bb19cfcbb1abfd.1920x1080.jpg?t=1598018436",
    "Slug": "him-and-i",
    "Meta Title": "Him and I: Oct 4, 2019, Xenmentia Softworks and Full Over...",
    "Meta Description": "Looking for information on Him and I? Check out the release date (Oct 4, 2019), developer insights from Xenmentia Softworks, and a complete game summary.",
    "Alt Text Image": "Official header image for Him and I game - Steam 1157010",
    "Canonical URL": "https://gusku.site/game/him-and-i",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Him and I\", \"description\": \"Looking for information on Him and I? Check out the release date (Oct 4, 2019), developer insights from Xenmentia Softworks, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Xenmentia Softworks\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Xenmentia Softworks\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1157010/header.jpg?t=1598018436\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}