{
    "AppID": 1744270,
    "Name": "Indigo Loop",
    "Release date": "Jun 30, 2022",
    "About the game": "How fast can you think? Indigo Loop is a quick-count, time management puzzle game with a splash of strategy and luck. It shares the classic puzzle game spirit of being easy to pick up and challenging to master. Gameplay revolves around counting and submitting cards whose values add up to 15. Test your skills across two distinct game modes and see how many points you can score. Make plays to keep the action going Strategically and carefully plan your moves to keep seconds on the clock. The more skilled you become, the longer your rounds will last, and the higher scores you'll achieve. Playing cards of the same color will result in more points, but might take a little more time to submit. You can also swap cards if a play isn't possible or you're hoping for a better hand. Features Arcade: Arcade mode is open-ended and can last as long as you have the skill to keep your game alive. Speed, strategy and a little bit of luck will lead to the most success. Gameplay involves managing time and the number of cards in your hand, as you shift between a counting and combo phase by clicking and submitting cards whose values add up to 15. Gameplay is simple, but there are several factors that can greatly affect your score, including a jackpot card, which can result in a massive windfall Time Attack: Time Attack is a pure test of speed and skill and has a set three minute timer, so it's a great for when you're short on time and want to get in a quick session. Like Arcade mode, click cards that add up to 15 to start racking up points! Unlock New Themes: reach higher scores to unlock new Arcade themes, each with their own music and artwork In-Game Achievements: several in-game achievements to challenge you and test your skills Steam Leaderboards: see how your high score rates against others across the world with Steam leaderboard support for both game modes Customizable Keyboard Controls: the game can be completely controlled with a mouse, but it's recommended to use keyboard controls for faster action",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1744270/header.jpg?t=1656617096",
    "Price": 1.99,
    "Developers": "mwroberts",
    "Publishers": "mwroberts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1744270/ss_5505ed1dc2c1730eb7f15cef71534601ddf09774.1920x1080.jpg?t=1656617096,https://cdn.akamai.steamstatic.com/steam/apps/1744270/ss_9c20899d9bc0568807746ab533bb46988829cd01.1920x1080.jpg?t=1656617096,https://cdn.akamai.steamstatic.com/steam/apps/1744270/ss_98d2ccb90f7999c1481bc25ea18a32e15537a76f.1920x1080.jpg?t=1656617096,https://cdn.akamai.steamstatic.com/steam/apps/1744270/ss_8a5f66d33e4ba943956957755848251cb87ebdcc.1920x1080.jpg?t=1656617096,https://cdn.akamai.steamstatic.com/steam/apps/1744270/ss_050061d80cea8a1a1b658a89565d1a9fa07a5bb4.1920x1080.jpg?t=1656617096",
    "Slug": "indigo-loop",
    "Meta Title": "Indigo Loop: Jun 30, 2022, mwroberts and Full Overview",
    "Meta Description": "Looking for information on Indigo Loop? Check out the release date (Jun 30, 2022), developer insights from mwroberts, and a complete game summary.",
    "Alt Text Image": "Official header image for Indigo Loop game - Steam 1744270",
    "Canonical URL": "https://gusku.site/game/indigo-loop",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Indigo Loop\", \"description\": \"Looking for information on Indigo Loop? Check out the release date (Jun 30, 2022), developer insights from mwroberts, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"mwroberts\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"mwroberts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1744270/header.jpg?t=1656617096\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}