{
    "AppID": 1140970,
    "Name": "Inside The Park VR",
    "Release date": "Aug 30, 2019",
    "About the game": "Inside The Park VR is an immersive baseball training simulator for virtual reality technology. Compatible with the Valve Index headset, Inside The Park VR delivers a true to life baseball experience in the comfort of your own home. Fully accurate physics allow for a vast amount of hit types and high fidelity graphics enable you to feel like you are actually standing on a baseball field. Not good at baseball? Inside The Park VR includes three different levels of play to fit your skill level. Features include a ball machine, dynamic statistics, throwing and catching, Vive tracker support, AI pitcher and fielder, and more. So step up to the plate and immerse yourself in the next generation of baseball training with Inside The Park VR by Intelimmerse LLC. Inside The Park VR is also compatible with the HTC Vive and other OpenVR compatible headsets. HTC Vive Racket Sport Set from the Vive Store Recommended for Best Experience Features: Realistic Physics (Multiple colliders with unique restitutions resulting in accurate bat-ball collisions, real life values for mass, drag, and magnus coefficient, physics interpolation) Various Difficulty Levels (Amateur, Competitive, Professional) Customizable Pitch Speeds (Up to 90+ MPH) Multiple Environments (Stadium, Batting Cages) Unique Drills (Targets, Soft Toss, AI Catch) High Fidelity Graphics (Day/Night Lighting, HDR Reflections, Ambient Occlusion, High Resolution Shadows, Bloom) Vive Tracker Support (Attach Tracker to Bat and Edit 3D Bat Position to Match Tracker) Smooth Performance (Optimized for GTX 2060, Runs at 90 FPS, GTX 1070 or Above Recommended) Dynamic Statistics (Pitch Speed, Pitch Type, Bat Speed, Exit Velocity, Spin Rate, Distance) Batting Tee (Adjust Tee Height to Your Liking) Teleportation Locomotion (Auto-Teleport, Manual Teleport) Up to Three Unique Camera Views (Requires Multiple Displays) Customizable Equipment (Metal and Wood Bats, Various Glove Colors) Artificial Intelligence (Left and Right Handed AI Pitcher, AI Ball Machine, AI Fielder with auto catch functionality) Left Handed Support Visible Strike Zone Ball Trail (Customizable Length to Visualize Path) Multiple Pitch Types (Fastball, Changeup, Slider, Curveball) Play Any Position (Catcher, Pitcher, 1st, 2nd, Short, 3rd, Left, Center, Right) Multiple Hit Types (Ground Ball, Line Drive, Fly Ball, Pop Up) Realistic Catching and Throwing Background Music Controls: Valve Index Trigger: Spawn Ball, Grab Ball, Catch Ball Grip: Catch Ball, Grab Panel B Button: Toggle Menu Touchpad/A Button: Select Thumbstick: Teleport, Turn HTC Vive Trigger: Spawn Ball, Grab Ball, Catch Ball Grip: Catch Ball, Grab Panel Menu Button: Toggle Menu Touchpad: Select, Teleport, Turn Oculus Rift Trigger: Spawn Ball, Grab Ball, Catch Ball Grip: Catch Ball, Grab Panel Y/B Button: Toggle Menu X/A Button: Select Thumbstick: Teleport, Turn Windows Mixed Reality Trigger: Spawn Ball, Grab Ball, Catch Ball Grip: Catch Ball, Grab Panel Menu Button: Toggle Menu Touchpad: Select Thumbstick: Teleport, Turn Planned Features: Realtime Crowd (Ability to toggle crowd on or off, animations and sound effects based on play) Full Game Mode (Actual Baseball Game) Online Play (Play With Friends) Dynamic achievements AI Batter (Pitch to an AI batter and field balls from him) Dynamic Weather (Rain, Wind) And more!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1140970/header.jpg?t=1587915046",
    "Price": 14.99,
    "Developers": "Intelimmerse LLC",
    "Publishers": "Intelimmerse LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1140970/ss_6b9cc2c00fc454595ee8bc87fefe3f8ef2c10967.1920x1080.jpg?t=1587915046,https://cdn.akamai.steamstatic.com/steam/apps/1140970/ss_50421e8859b2560b9a0b261fb4fae0ec1a6a09ee.1920x1080.jpg?t=1587915046,https://cdn.akamai.steamstatic.com/steam/apps/1140970/ss_93b6cf2fe42c63bcfd23b4921558047a05f5d5e1.1920x1080.jpg?t=1587915046,https://cdn.akamai.steamstatic.com/steam/apps/1140970/ss_5f1f608e659e50b9ba9685482a4cce2a5a39fe88.1920x1080.jpg?t=1587915046,https://cdn.akamai.steamstatic.com/steam/apps/1140970/ss_4ddd248f2b24ff8c47a3abff86ea860fea7e50c2.1920x1080.jpg?t=1587915046,https://cdn.akamai.steamstatic.com/steam/apps/1140970/ss_9d696eda2a76167aa81bd7dc8bfd7a463d5d6fe2.1920x1080.jpg?t=1587915046,https://cdn.akamai.steamstatic.com/steam/apps/1140970/ss_e83415348755f3884996767e0af9e707abb9dd57.1920x1080.jpg?t=1587915046,https://cdn.akamai.steamstatic.com/steam/apps/1140970/ss_4b85bda077d5b672b8c7107691ee121f4857f467.1920x1080.jpg?t=1587915046",
    "Slug": "inside-the-park-vr",
    "Meta Title": "Inside The Park VR: Aug 30, 2019, Intelimmerse LLC and Fu...",
    "Meta Description": "Looking for information on Inside The Park VR? Check out the release date (Aug 30, 2019), developer insights from Intelimmerse LLC, and a complete game ...",
    "Alt Text Image": "Official header image for Inside The Park VR game - Steam 1140970",
    "Canonical URL": "https://gusku.site/game/inside-the-park-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Inside The Park VR\", \"description\": \"Looking for information on Inside The Park VR? Check out the release date (Aug 30, 2019), developer insights from Intelimmerse LLC, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 30, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Intelimmerse LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Intelimmerse LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1140970/header.jpg?t=1587915046\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}