{
    "AppID": 1014130,
    "Name": "Jitsumi's Game Booster",
    "Release date": "May 20, 2019",
    "About the game": "For AMD GPU / Integrated Graphic Card Users: Currently, we do not fully support AMD's GPUs ( Radeon ) and Intel Integrated Graphic Card. For any users with laptops or PC with no Nvidia GPU, please note that there will be a few features which will be locked. We will be adding support for both AMD and integrated Graphic cards very soon. However, you can still choose to purchase the program. Un-Supported features will be locked. About Us We are a small team of developers with one goal in mind. Pushing low spec PCs to the limit. We plan to improve gaming for both gamers without a beast of a PC and gamers just looking to boost their computer's performance. We also offer services outside of gaming such as cleaning junk files. We have a huge list of things to do which will change the low spec gaming experiences altogether. Join us on our journey and get your own booster now! Feature List: - Unused Memory Cleaner - Background Processes Manager - Junk Files Remover - Drive Maintainer - Performance Monitor - Automation of Features - System / Drive Error Repairer - Drive Maintainer - Blue Light Filter - Open Windows Manager .. More to come Light-weight Jitsumi Game Booster is a light and fast tool which scans for games that had been launch while providing features such as suspending background processes and cleaning junk files without using much CPU. From the tests we conducted, Jitsumi Booster only had used below 2% of the PC's CPU. Jitsumi Booster also will slow itself down when a game is detected, this is to provide the best experiences while playing. Using less than 2% of the PC's CPU, this allows you to game without any disturbance. Jitsumi Booster will also slow itself down whenever it is not in focus, this makes Jitsumi Booster use extremely little CPU usage while in the background. Fullscreen / Windowed Mode Jitsumi Game Booster allows users to change window modes for any games which have been detected by Jitsumi Game Booster. This allows you to switch to windowed or fullscreen at a click of a button. This is to allow users to have an easier time changing games to windowed to fullscreen without visiting the settings and manually changing it. However, some games such as Counter-Strike does not allow resizing, therefore, it might bug the program in a way not expected. Jitsumi Booster also allows you to increase the game's Priority / IO Priority to any detected games it finds. To use these features, the game must be detected by the program. Currently, we support steam games, Fortnite, OSU! and League Of Legends. More support coming soon! Junk File Removal &amp; Maintaining Drives Jitsumi Game Booster allows users to clear some files also known as junk files or temporary files from their PC. Doing this both provides a slight boost of performance and space for the user. We do also provide features to clean the user's Registry, cleaning system errors, defragging drivers and cleaning any errors in said drive. This is all done in a single click of a button. Providing this allows the user to maintain their drives and getting rid of any bad sectors in any of their drives. This speeds up the drives and allows for a much better gaming experience. Automation Jitsumi Game Booster allows users to automate some of the features that it has to offer. This makes it so that the user does not need to manually use some of the functions Jitsumi Game Booster provides, but rather, tick a checkbox which automatically enables the feature when the event is triggered. This includes game launches, which triggers the selected features when a game has been detected, or on a timer, which enables the feature on a timer. This allows users to avoid using some of the functions all the time but rather on two triggers, game launch or timer. Ram &amp; CPU Optimizer Jitsumi Game Booster provides features which allow users to clear any unused RAM / Memory from their PC. We also provide users the ability to close any high RAM / Memory usage programs such as Chrome and Spotify! This can Increase / Boost your PC performance by cutting your memory usage almost by half or more. We also allow users to suspend those programs to free up CPU, however, suspending will not free their memory. Our feature which closes high RAM/CPU usage program currently allows you to auto close programs such as chrome and Spotify. We are planning on adding a feature which allows you to add programs of your choice to the list. Performance Monitor Jitsumi Game Booster allows users to view their CPU, GPU, RAM Usage and GPU temperature. We also allow you to view this data in a graph which can be used to monitor how much your GPU and CPU load increases when playing certain games and even allows you to monitor the temperature of your GPU. This can be used to view your performance whenever you are benchmarking to see which settings can be used to have a balance between FPS and performance load. Easy To Use Jitsumi Game Booster's UI ( User Interface ) is extremely simple to use ( Special Thanks To IMGUI ). We provide checkboxes and buttons for everything we offer. We also provide a console that logs everything that has happen and things that had been toggled or pressed. We also provide some commands that users who are used to the UI can use. This goes from dumping every process in your program list to just a simple suspend and resume commands. This can be useful to users who want things to be customized or are looking to tweak the booster. We are also planning to add a lot more commands in the near future!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1014130/header.jpg?t=1574828689",
    "Price": 5.99,
    "Developers": "THEEY STORE PTE. LTD.",
    "Publishers": "THEEY STORE PTE. LTD.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1014130/ss_00440aba889c65abd437a51a7c9b7000f7c6fefc.1920x1080.jpg?t=1574828689,https://cdn.akamai.steamstatic.com/steam/apps/1014130/ss_47862e6dfd7a9cc3649147205d32c45b69742d3e.1920x1080.jpg?t=1574828689,https://cdn.akamai.steamstatic.com/steam/apps/1014130/ss_d93b343566804f5b05df28a9f1ee037427e0c930.1920x1080.jpg?t=1574828689,https://cdn.akamai.steamstatic.com/steam/apps/1014130/ss_6a0a6c3285aa2ca4e5a47a73626a8f62b78adea6.1920x1080.jpg?t=1574828689,https://cdn.akamai.steamstatic.com/steam/apps/1014130/ss_c5bbfc6327a98eeb533c63df0b3e2e5bed1f007c.1920x1080.jpg?t=1574828689,https://cdn.akamai.steamstatic.com/steam/apps/1014130/ss_a0049d4c6c09479eec04953447587362fe72356c.1920x1080.jpg?t=1574828689,https://cdn.akamai.steamstatic.com/steam/apps/1014130/ss_14226856fff6562cc422efe6d5cbb7d9c2b250c8.1920x1080.jpg?t=1574828689,https://cdn.akamai.steamstatic.com/steam/apps/1014130/ss_5a9bfa0a5f7494624250ccb4244d78ca9d5542e2.1920x1080.jpg?t=1574828689",
    "Slug": "jitsumi-s-game-booster",
    "Meta Title": "Jitsumi's Game Booster: May 20, 2019, THEEY STORE PTE. LT...",
    "Meta Description": "Looking for information on Jitsumi's Game Booster? Check out the release date (May 20, 2019), developer insights from THEEY STORE PTE. LTD., and a compl...",
    "Alt Text Image": "Official header image for Jitsumi's Game Booster game - Steam 1014130",
    "Canonical URL": "https://gusku.site/game/jitsumi-s-game-booster",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Jitsumi's Game Booster\", \"description\": \"Looking for information on Jitsumi's Game Booster? Check out the release date (May 20, 2019), developer insights from THEEY STORE PTE. LTD., and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 20, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"THEEY STORE PTE. LTD.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"THEEY STORE PTE. LTD.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1014130/header.jpg?t=1574828689\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}