{
    "AppID": 1810000,
    "Name": "Kuroi Tsubasa",
    "Release date": "Apr 4, 2022",
    "About the game": "The story I just wanted to laze around in the sun... Man, why did it come to this? Name's Blackwing by the way, I'm not exactly sure how I got this name, but hey, it's something, right? Anyway, I just left... the underground recently. Even as a devil it's all fire and brimstone down there, really not my style. Up here with all the earthlings it's so much nicer. Just gotta keep the evil inside in check, right? Can't be that hard. It would be unimaginable if that part of me splits up, manifests as shadows, and causes havoc all over town. Can't happen. Nuh-uh. It happened. Oh dear, Now I have to find someone with enough positive emotions, that can contain my glorious self, and help me defeat the shadow, so I can go back to my dreams of laziness. This plain office lady over there... Kureha, was it? She and her newfound friends will help me. Let's play pretend magical girl, kukuku. The Game Kuroi Tsubasa is a linear Visual novel with different paths to take. The game features over 120.000 words of dialogue and a whole town to explore! Meet Kureha and her friends on this charming adventure. A full original soundtrack of over 50 songs, dozens of high quality art pieces, a unique cast, and a heartwarming story await you! All main characters are based on ACTUAL VTUBERS. The Cast The main character of this game. She recently moved to this small town, got a new job at an insurance company, and is trying her best to survive in mediocrity. Her big secret is that she is a fan of MeTubers and Idols - a fact that she keeps close to her heart, in fear of losing face. Good-natured, well-mannered, and loyal to a fault. The narrator of this game. Originally a devil from 'down there', he succeeded in escaping to the human world. However, because he is kind of arrogant, and also a bit... dim, he neglected to keep his evil side in check, which split off of him and is now wreaking havoc. His big dream is to laze around in the sun, on a patch of soft grass. The spunky office lady, with a slightly mischievous streak. Puka loves all things retro, be it old manga or video games. She usually can be seen slacking off instead of working properly. Puka is definitely the goofball of the group. Her odd mannerisms and her love for anime make her a great friend to have around. This huge and intimidating man has a heart of gold. Recently he managed to fail his college entry exams and now has to get by with some odd jobs. Not many people can see past his rough exterior, but those who do will find a lifelong friend. Alize gave him a chance by offering him a part-time job in the Kazoku Mart. A high school girl. Always ready to play some sports, or buy some snacks at the local supermarket. Always happy and cheerful, she brightens up the day of everybody that meets her. Can usually be seen around the local city park with her friends. This odd street musician always marches to the beat of his own drum. He recently arrived in town, to follow his dream: making good music, and opening the hearts of his listeners. However... he seems to have some troubles connecting with the people of this city. A cool beauty. Her aura practically oozes 'High society', but her background is unknown. Currently, she's visiting a relative in town, but everything - aside from her slightly goofy streak - is shrouded in mystery. Rurika is oddly knowledgeable about tea... and hard liquor. The team leader and 'Senpai' of Kureha and Puka. Egocentrical and abusive. Do not engage! Aside from that, he seems surprisingly diligent and proper, if he is not abusing his kouhais, that is. Most people just see him as a bully, but maybe there's more beneath the surface. Probably not. The totes kewl trendy gal from the local supermarket. Besides her weird speech pattern, she dreams of leaving this small town to be something great. However, she is surprisingly smart, as is evident by her job as local branch manager at the Kazoku Mart.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1810000/header.jpg?t=1656071472",
    "Price": 0.0,
    "Developers": "Blackwing Gaming",
    "Publishers": "Blackwing Gaming",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1810000/ss_51e0681a04113ad349860ea1f6b5852b9b82c587.1920x1080.jpg?t=1656071472,https://cdn.akamai.steamstatic.com/steam/apps/1810000/ss_b26992bbbef6290d0861b437c249904c11bf2d12.1920x1080.jpg?t=1656071472,https://cdn.akamai.steamstatic.com/steam/apps/1810000/ss_91b82d568aa62b72595e95d9539ebfda21b53e59.1920x1080.jpg?t=1656071472,https://cdn.akamai.steamstatic.com/steam/apps/1810000/ss_f8aac69c7fffbbd891dd1dcefb190e1f52b5ca53.1920x1080.jpg?t=1656071472,https://cdn.akamai.steamstatic.com/steam/apps/1810000/ss_f089fdbbec16095335dedb929dbf6b00ae187c07.1920x1080.jpg?t=1656071472,https://cdn.akamai.steamstatic.com/steam/apps/1810000/ss_1e20d3b17993b19fe635fe0ecfb2a58d19cce8c9.1920x1080.jpg?t=1656071472,https://cdn.akamai.steamstatic.com/steam/apps/1810000/ss_01b4d09f4ce8fc3030f52fcd4708b3702deff666.1920x1080.jpg?t=1656071472,https://cdn.akamai.steamstatic.com/steam/apps/1810000/ss_8471270f4563be8cdbfb0e1f0ec44c2339aca90d.1920x1080.jpg?t=1656071472,https://cdn.akamai.steamstatic.com/steam/apps/1810000/ss_359f46a478901c6615c56171da83decb0880839a.1920x1080.jpg?t=1656071472,https://cdn.akamai.steamstatic.com/steam/apps/1810000/ss_d788df8b9a466993f916ec164b718872fe430428.1920x1080.jpg?t=1656071472,https://cdn.akamai.steamstatic.com/steam/apps/1810000/ss_227054152cfd876220afdf80261d2a651d38b4ff.1920x1080.jpg?t=1656071472",
    "Slug": "kuroi-tsubasa",
    "Meta Title": "Kuroi Tsubasa: Apr 4, 2022, Blackwing Gaming and Full Ove...",
    "Meta Description": "Looking for information on Kuroi Tsubasa? Check out the release date (Apr 4, 2022), developer insights from Blackwing Gaming, and a complete game summary.",
    "Alt Text Image": "Official header image for Kuroi Tsubasa game - Steam 1810000",
    "Canonical URL": "https://gusku.site/game/kuroi-tsubasa",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kuroi Tsubasa\", \"description\": \"Looking for information on Kuroi Tsubasa? Check out the release date (Apr 4, 2022), developer insights from Blackwing Gaming, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blackwing Gaming\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blackwing Gaming\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1810000/header.jpg?t=1656071472\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}