{
    "AppID": 1585360,
    "Name": "Live/Wire",
    "Release date": "May 14, 2021",
    "About the game": "Live/Wire is the arena-based FPS of the future. Players take on the role of the “Breakers”, a group of radicals that use 3D-printed electric guns to resist the oppressive megacorporation called “DarLINK”. Each player can quickly recharge their guns by plugging into various power sources around the city, or use their plug like a grappling hook to swing around at incredible velocity. Teams of breakers use these tools to face off in illegal underground tournaments, creating a fast-paced, skill-intensive rhythm of combat that rewards speed, accuracy, and aggression. Game Features Shock Weapons : Rather than using traditional guns which fire bullets, in Live/Wire you wield electricity-powered shock weapons, which must be recharged by plugging them into power sources scattered throughout the arena. There are four different types of shock guns that you can find, each with its own unique set of strengths and weaknesses. As you recharge, all the guns that you have will recharge at the same time so you don’t need to switch between every weapon. Grappling : The plug that you use to recharge your guns also doubles as a grappling hook to help you move around the arena. It’s easy to use but difficult to master, allowing for players of all skill levels to engage in high-speed midair gunfights. Online Multiplayer : With the ability to host and join lobbies anywhere in the world, play against friends in order to prove your skill! Disclaimer: Can only play with people currently on your Steam friends list. Team Deathmatch : In a classic game mode, teams of 4 players will go head to head to try and get the most KOs before the cops show up. Development Live/Wire is developed by Wild Village Games, a dedicated team of undergrad students that created Live/Wire for our senior project during the COVID-19 pandemic. This means that we have all been using remote working practices over the past year to develop this game. While doing this, our goal was to create a fun and exciting shooter with unique gunplay and movement mechanics that make it stand out from the crowd. We are all very proud of the work we have done and are excited for you to play it. We hope you enjoy Live/Wire and we look forward to swinging through the city with you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1585360/header.jpg?t=1621004428",
    "Price": 0.0,
    "Developers": "Wild Village Games",
    "Publishers": "Wild Village Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1585360/ss_dacb984b510dfae2287016ea1d7463254fd7c7e4.1920x1080.jpg?t=1621004428,https://cdn.akamai.steamstatic.com/steam/apps/1585360/ss_e52b86ddcc756f2e27aa2001ea5d59d4575f1643.1920x1080.jpg?t=1621004428,https://cdn.akamai.steamstatic.com/steam/apps/1585360/ss_32324be34dad2ed9220112854e167f242f1925e0.1920x1080.jpg?t=1621004428,https://cdn.akamai.steamstatic.com/steam/apps/1585360/ss_d3b7f01507671e04de098d2cede5216c4d3c3557.1920x1080.jpg?t=1621004428,https://cdn.akamai.steamstatic.com/steam/apps/1585360/ss_0c8b1958e539da80012ecfaebf2f2c1de87dd94d.1920x1080.jpg?t=1621004428",
    "Slug": "live-wire",
    "Meta Title": "Live/Wire: May 14, 2021, Wild Village Games and Full Over...",
    "Meta Description": "Looking for information on Live/Wire? Check out the release date (May 14, 2021), developer insights from Wild Village Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Live/Wire game - Steam 1585360",
    "Canonical URL": "https://gusku.site/game/live-wire",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Live/Wire\", \"description\": \"Looking for information on Live/Wire? Check out the release date (May 14, 2021), developer insights from Wild Village Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wild Village Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wild Village Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1585360/header.jpg?t=1621004428\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}