{
    "AppID": 1674780,
    "Name": "Lone Fungus",
    "Release date": "Mar 27, 2022",
    "About the game": "Lone Fungus is a true Metroidvania set in a world built by mushrooms where you play as the last mushroom alive. Explore an ancient world, acquire new abilities and discover secrets! Exploration In the Early Access version as of now there are 8 Unique areas you can explore, each area consists of enemies and obstacles distinctive to that area. There are plenty of secrets to be found and you will truly be rewarded for exploring every corner in each area. The game always rewards player exploration with meaningful upgrades in terms of Relics, Emblems, Health or Mindpoints upgrades which will prove very useful to any player. Read more about what these are in the combat section! Features - Explore a huge interconnected world gated with true Metroidvania progression. - Fast and responsive combat, play as an acrobatic mushroom! - A spell-system based on how you strike spells with your sword, giving spells multiple uses and a creative approach to combat. - Unique and challenging platforming gameplay reminiscent of modern platformers such as Celeste but set in a fully open world. - Play the game how you want! Pick between four difficulty modes or use the accessible Assist Mode! Combat The Combat in Lone Fungus is simplistic but has depth in terms of customization. You can for instance parry anything that would normally would damage you, but parrying incoming projectiles in particular will shoot them back at foes. You are however never forced to parry and you can even change how the parry system works by equipping Emblems! Emblems are items you will find all over the world. Equipping an Emblem might change how the parried projectile behaves, for instance you can make it home into enemies but deal less damage. Or instead of bounce a projectile off your cap you will do damage to anything near you. There is even a Vortex Emblem which destroys multiple projectiles around the player. Upgrades and Build customizations In addition to Emblems there are Relics which work very similarly to the Charm system in Hollow Knight. Some change how your healing works, other increase your sword damage or give you additional protection. There are currently 35+ Relics in the game and you chose what your strengths will be through the Relics. You can make some really specialized builds focusing on defense, healing, speed, melee attacking or spell-casting! And then there are permanent upgrades which you gain from fighting bosses, these are all from spells to new moves and types of attacks! Bosses Lone Fungus currently features 21 bosses you can fight and gain new powers by beating them! My aim is to create fun and fair boss fights that technically always are possible to win without taking any hits from the boss. I do this by giving the bosses memorable patterns and clear telegraphs in their attacks. I also try to stay away from too much randomization in their attacks! My aim is to create fun and challenging bosses where when you know how to fight them then you should be able to beat them every time! Platforming Lone Fungus is a precision platformer at heart, however it never forces you to do any very challenging platforming in order to progress in the game. All the platforming gauntlets are relegated to side challenge rooms and you can totally enjoy this game as a combat and exploration type Metroidvania but with the tight controls of a precision platformer! However if you do want to delve deep into the games hardcore mechanics the game does offer practice rooms where you can fine tune your skills and take on the hardest platforming challenges the game has to offer. Play the game how you want! The game features 4 difficulty modes, several ways to customize controls (like a dedicated down-attack button) and a full featured Assist-Mode! The Assist-Mode allows you to turn on 6 different features which will drastically make the game more accessible. Platforming Pause - Increases the pauses between platforming mechanics like Mushmovers, giving you a larger room to react and breathe in between platforming sections. Magic Platforms - Adds special platforms to some sections in the game to make them much easier. Worldmap Hints - Will show items you have missed in rooms you have already visited. Stronger Sword - Increases your swords base damage, allowing you to beat bosses easier. Infinite MP - Play without having to manage your Mindpoints, heal and cast spells as much as you want! Invincibility - You cannot die! Keep in mind that the Assist-Mode is not only for players that might think the game is too tough, but it can also be used to just mess around and have fun with the game in your own way!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1674780/header.jpg?t=1656922212",
    "Price": 19.99,
    "Developers": "Basti Games",
    "Publishers": "Basti Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1674780/ss_c8757a6bf8fa2611fdf6f2504e9a170e8ae583ec.1920x1080.jpg?t=1656922212,https://cdn.akamai.steamstatic.com/steam/apps/1674780/ss_aa762f472778abb744f27e4daf7b2fabbaac56c2.1920x1080.jpg?t=1656922212,https://cdn.akamai.steamstatic.com/steam/apps/1674780/ss_b103862b1f230532c56530bc12e5b1a6d17f8146.1920x1080.jpg?t=1656922212,https://cdn.akamai.steamstatic.com/steam/apps/1674780/ss_90561af4b8330403cc51e301746b797074face1c.1920x1080.jpg?t=1656922212,https://cdn.akamai.steamstatic.com/steam/apps/1674780/ss_6bbef2c6fe729598fe823d8b942a700a64ebbb81.1920x1080.jpg?t=1656922212,https://cdn.akamai.steamstatic.com/steam/apps/1674780/ss_3489e7dad92e153c992d8d0157291685a41d071f.1920x1080.jpg?t=1656922212,https://cdn.akamai.steamstatic.com/steam/apps/1674780/ss_243861efef8a70613d6e1af4f23f8310988e4450.1920x1080.jpg?t=1656922212",
    "Slug": "lone-fungus",
    "Meta Title": "Lone Fungus: Mar 27, 2022, Basti Games and Full Overview",
    "Meta Description": "Looking for information on Lone Fungus? Check out the release date (Mar 27, 2022), developer insights from Basti Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Lone Fungus game - Steam 1674780",
    "Canonical URL": "https://gusku.site/game/lone-fungus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lone Fungus\", \"description\": \"Looking for information on Lone Fungus? Check out the release date (Mar 27, 2022), developer insights from Basti Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Basti Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Basti Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1674780/header.jpg?t=1656922212\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}