{
    "AppID": 555510,
    "Name": "MachiaVillain",
    "Release date": "May 16, 2018",
    "About the game": "Welcome to Villain City, a luxury community entrenched in the hills of horror. Ax murderers, mad scientists and tax evaders, all kinds of bad guys consider this place to be their sweet home. This is the perfect place to rest, relax, and pursue a career in the noblest of professions: professional Villain!! The real estate agent promised you a haunted house with jump scare devices and terrifying traps. Instead, you have a piece of empty land full of Vermin near a rubbish forest. But do not flee yet! With a little elbow grease, the help of your minions and a lot of murders, you can turn this house into a happy and dreary mortal trap. Just lure locals inside, then trigger your deadly traps or let your minion feast on their brains and flesh. Every night you'll multiply your evil level until everyone calls your mansion ' scary, nasty and horrible.' Be aware that the League of MachiaVillain Villains has adopted a strict policy that governs the level of wickedness that you have to adhere to in order to stay in the community. Drs Frank and Stein, Siamese co-Chairmen of the Board of evil ( BDM ), dictated a series of rules to follow when conducting your villainous business. They cover everything from how to kill intruders- to what salads are considered the most evil (no surprise, grated carrots). Follow the rules of the League and become the scariest neighborhood Villain! Build your mansion: Create the evil mansion of your nightmares! Put together the perfect crypt for your vampire, the insanest lab for your mad scientist, an irresistible swimming pool for your victims (and your shark) and don't forget the cannibal kitchen! Gather your evil nightmare team: Choose your minions wisely though, as each possesses different traits and have different needs that must be tended to. They also have different fighting styles, such as long range, bare handed, and of course, bare fanged. Manage your monsters: No evil mansion is complete without a cadre of minions to keep it running. Order them to do your evil deeds, and don’t forget to have them clean the blood stains. Slaughter innocent victims…and bankers!: Our menu tonight includes a wide array of victims from famous tropes such as jocks, nerds, potheads, party girls or horror movie celebrities. A good variety ensures your minions stay well-fed. Fight all the things: The environment is full of hostile creatures who want to take your place at the top of the food chain. Chupacabra, Wendigo, Sasquatch... There are also pro monster hunters who come knocking at your door with stakes, holy water or baseball bats. Show them who's the boss… the Villain boss! Bloody good crafting: Sawing through countless victims means you'll end up with a few spare parts. Why not use those bits and bobs to craft something useful? MachiaVillain lets you create things using ingredients gathered from victims and harvested from the environment. Put them together and you'll get something horrifying, but also useful. Follow the Rules!: The key to evil survival in MachiaVillain is to follow the unspoken rules of the horror movie genre. You do have an Evil Mastermind Reputation to think about after all. Follow the villain's rules to be a real success. So slaughter them when they're alone, kill the virgin last, and never, ever hurt the dog!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/555510/header.jpg?t=1572630276",
    "Price": 19.99,
    "Developers": "Wild Factor",
    "Publishers": "Good Shepherd Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/555510/ss_6bddd35b17792987b9071cc712f4902a407b31dc.1920x1080.jpg?t=1572630276,https://cdn.akamai.steamstatic.com/steam/apps/555510/ss_29d591214fe933293f2ac0227f076a46a47b8b15.1920x1080.jpg?t=1572630276,https://cdn.akamai.steamstatic.com/steam/apps/555510/ss_adc686a5d3a8d178a8f8f9cbeab3ad33b78f5e63.1920x1080.jpg?t=1572630276,https://cdn.akamai.steamstatic.com/steam/apps/555510/ss_f62b8832bef0b6fc28c3bc97d480a5ebc3a014e6.1920x1080.jpg?t=1572630276,https://cdn.akamai.steamstatic.com/steam/apps/555510/ss_e0b7389f70a8672cc7d8691d6e54ce157948cca9.1920x1080.jpg?t=1572630276,https://cdn.akamai.steamstatic.com/steam/apps/555510/ss_09a3e2fc4c88eaf5569a574bc5d42141ee9eafbb.1920x1080.jpg?t=1572630276,https://cdn.akamai.steamstatic.com/steam/apps/555510/ss_280029cb418c936823393eed0cf9e69501ce1a60.1920x1080.jpg?t=1572630276,https://cdn.akamai.steamstatic.com/steam/apps/555510/ss_e35e5aec47ab12d151c9e3afffb3c85c2451c0ed.1920x1080.jpg?t=1572630276,https://cdn.akamai.steamstatic.com/steam/apps/555510/ss_8a3c9f27d2df91ab442363a468e9d10bde667a00.1920x1080.jpg?t=1572630276,https://cdn.akamai.steamstatic.com/steam/apps/555510/ss_83715eb5fe8ea61742fbfd5875d08d2cdd95a31f.1920x1080.jpg?t=1572630276,https://cdn.akamai.steamstatic.com/steam/apps/555510/ss_424dc81fd4924c8bf6d3bc7b69cf49393e041421.1920x1080.jpg?t=1572630276",
    "Slug": "machiavillain",
    "Meta Title": "MachiaVillain: May 16, 2018, Wild Factor and Full Overview",
    "Meta Description": "Looking for information on MachiaVillain? Check out the release date (May 16, 2018), developer insights from Wild Factor, and a complete game summary.",
    "Alt Text Image": "Official header image for MachiaVillain game - Steam 555510",
    "Canonical URL": "https://gusku.site/game/machiavillain",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MachiaVillain\", \"description\": \"Looking for information on MachiaVillain? Check out the release date (May 16, 2018), developer insights from Wild Factor, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 16, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wild Factor\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Good Shepherd Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/555510/header.jpg?t=1572630276\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}