{
    "AppID": 865060,
    "Name": "Murasaki Tsurugi",
    "Release date": "Dec 18, 2018",
    "About the game": "Murasaki Tsurugi is an explosive puzzle game. Immerse yourself in the pleasure of using explosions to clear the screen of intrusive objects as they pile up. Requiring only the directional keys +2 more to play, it’s extremely simple. The wonderfully composed music is also a huge key point. While this is a sequel to Murasaki , you can also play the previous title as well. Compared with the last game, this one is even more refreshing and fun to play. You can take control of one of two characters: Kairi or Satsuki. Do what you can to help them to reach their final destination. Character Introduction Kairi While his movement speed is average, his shots boast quite a long range, and they ricochet off the top of the screen and bounce back to the bottom. However, his rapid fire speed is relatively slow. his bombs suck in and absorb enemy shots, and the more Bullet Hell-ish the screen becomes, the more powerful his bombs’ explosions also become. Satsuki While her movement speed is quite fast, her shot range is relatively short and she is often prevented from defeating enemies by thick waves of bullets. Her shot speed is fast, meaning she can move exploding blocks longer distances, and when used wisely she can make even far away blocks explode in a chain. Her bombs are extremely powerful and explode quickly. She can’t hold onto them for long, but they are devastating. How to Play Murasaki Tsurugi uses a shooter-style control scheme. However, the point of the game isn’t avoiding the hails of bullets, but rather how you eradicate them. All enemies and bullets on the screen can be destroyed. Bullets can be destroyed with normal shots, but when eradicating large amounts at once, that’s where the red and blue blocks floating onscreen come in. Knocking two blocks of the same color together causes a chain of explosions, allowing you to wipe out huge swaths of bullets in one fell swoop. During boss battles, destroying enemy attacks with explosions will cause a deluge of backfire to spread and further damage the boss, making these chain explosions even more critical for boss battles. Another feature of this title is the “Collection” system. Fulfilling certain conditions will unlock various items, providing detailed descriptions of both characters and background information on the game’s storyline. As you go along filling up your Collection, you’ll get more and more information, helping to build up a more detailed and deep story inside your imagination. Comments from the Developer For this game, we were able to get the whole team from the previous title back together to complete this sequel. This latest installment is even more fun and refreshing to play than its predecessor. We hope you enjoy the wonderful characters drawn by Yomogimochi and the original music composed by watson of MusMus, as well as some good ol’ fashioned explosions. Developer Katatema Tetsu: scenario, programming Yomogimochi: graphics watson: music Falcarius: Original English translation",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/865060/header.jpg?t=1578972520",
    "Price": 4.99,
    "Developers": "Katatema",
    "Publishers": "PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/865060/ss_3153fd1e32359ecf149ab7a4c6f86f0708175080.1920x1080.jpg?t=1578972520,https://cdn.akamai.steamstatic.com/steam/apps/865060/ss_907dfbc5a3f61bfa6c11ed618c0cdd281e020bad.1920x1080.jpg?t=1578972520,https://cdn.akamai.steamstatic.com/steam/apps/865060/ss_ecd983527515d5562a9ba69c3522e270d283ce3c.1920x1080.jpg?t=1578972520,https://cdn.akamai.steamstatic.com/steam/apps/865060/ss_066d44c4b0ba902209c9cc7e620593dd22dea6e5.1920x1080.jpg?t=1578972520,https://cdn.akamai.steamstatic.com/steam/apps/865060/ss_a4bdcb0edd9b80d70b48bf3f44c685b62f6a3402.1920x1080.jpg?t=1578972520,https://cdn.akamai.steamstatic.com/steam/apps/865060/ss_3d6eb6cf7e55a5c362d54172b24838e9e6c3d71d.1920x1080.jpg?t=1578972520,https://cdn.akamai.steamstatic.com/steam/apps/865060/ss_118ce328ddfdc49ece20d975a7aae3e750e6000f.1920x1080.jpg?t=1578972520,https://cdn.akamai.steamstatic.com/steam/apps/865060/ss_0a3ef7d6e087295a0b99e9df645ee440e114b88f.1920x1080.jpg?t=1578972520,https://cdn.akamai.steamstatic.com/steam/apps/865060/ss_583b0a87f5722643b952a0578ff1ea36498a00a0.1920x1080.jpg?t=1578972520,https://cdn.akamai.steamstatic.com/steam/apps/865060/ss_f968da70a85412ac4ad32cd4c441f66c30b136b5.1920x1080.jpg?t=1578972520,https://cdn.akamai.steamstatic.com/steam/apps/865060/ss_ae44a733ce95fd8a5d728414993b438caa5f8332.1920x1080.jpg?t=1578972520,https://cdn.akamai.steamstatic.com/steam/apps/865060/ss_46d714c93fdba72cc7515564a391a51e7d5b5897.1920x1080.jpg?t=1578972520",
    "Slug": "murasaki-tsurugi",
    "Meta Title": "Murasaki Tsurugi: Dec 18, 2018, Katatema and Full Overview",
    "Meta Description": "Looking for information on Murasaki Tsurugi? Check out the release date (Dec 18, 2018), developer insights from Katatema, and a complete game summary.",
    "Alt Text Image": "Official header image for Murasaki Tsurugi game - Steam 865060",
    "Canonical URL": "https://gusku.site/game/murasaki-tsurugi",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Murasaki Tsurugi\", \"description\": \"Looking for information on Murasaki Tsurugi? Check out the release date (Dec 18, 2018), developer insights from Katatema, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 18, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Katatema\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/865060/header.jpg?t=1578972520\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}