{
    "AppID": 1379050,
    "Name": "Mystical Mayhem",
    "Release date": "Oct 29, 2020",
    "About the game": "You are Bob, Bob Mayhem. Bob is a genius. Bob has no friends. Bob makes machines and gadgets that are out of this world. Bob frequently streams himself conceptualizing and building his inventions on both “glitch teevee” and “facelock gaming”. Bob is having a hard time getting more viewers other than himself to watch him play god in his workshop of creation. Bob has been at it for 293 days straight. One day Bob decides that he has had enough and that streaming platforms weren’t being fair to give new streamers like him an equal opportunity to get famous. Bob decides to give himself a cooler name, Mystical Mayhem which might be a questionable taste to some. Mystical Mayhem uses his genius level intellect to create a friend, Chloe, the android cat who also double’s up as roving action camera for his reality streams. Mystical Mayhem has decided to throw logic to the wind and to craft up mystical powered weapons in search of what he calls the “Orb of Voodoo Hoodoo” (for entertainment sake) that’s said to grant immortality and call back from the dead those who are already in the afterlife. So off Bob goes, searching for the biggest baddest scariest mansion filled with ghosts and stuff that go bump in the night hoping to create enough unique content to lure viewers to tune in order to rival the world’s top livestreaming entertainers such as Ninju and PuddlePie. It’s time to show the world a new Bob. **Mystical Mayhem’s reboot stream #1 begins now.** Story Mode Explore the haunted house containing different experiential rooms ranging from combat to puzzle solving while you stream the footage online in a quest to gain audiences. Discover and use powerful weapons to aid you in your quest to uncover the 'Orb of Voodoo Hoodoo”. Endless Mode Fight against endless waves of ghosts with increasing difficulty with the aid of a weapon of your choice. It's all about strategy and conserving your energy to see how you fair against the ghosts of the mansion. Timed Mode Otherwise known as the house party mode! Compete against family and friends to get the highest score against the ghosts based on an allocated time to see who is the best ghost hunter. Steam Achievements Unlock steam achievements and view your progress against others! Out-of-Visor View for the REAL STREAMERS A streamer streaming a streamer? If you are an online streamer, tap into our nifty feature to stream both your desktop view and visor view for your online audience to get a better perspective of the action.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1379050/header.jpg?t=1604284816",
    "Price": 11.99,
    "Developers": "Rock Nano",
    "Publishers": "Refract Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1379050/ss_8f0838ccec75e6b7ed750dd9c51b202826d24f9e.1920x1080.jpg?t=1604284816,https://cdn.akamai.steamstatic.com/steam/apps/1379050/ss_cf7d02b9f35ed87490649b744e28678992f03d83.1920x1080.jpg?t=1604284816,https://cdn.akamai.steamstatic.com/steam/apps/1379050/ss_734fa5bb4d35549a385996dab3c17e143147c26b.1920x1080.jpg?t=1604284816,https://cdn.akamai.steamstatic.com/steam/apps/1379050/ss_5c95d57ae0f47c52246742fdf0889598f4b68d35.1920x1080.jpg?t=1604284816,https://cdn.akamai.steamstatic.com/steam/apps/1379050/ss_1f6d48246a69d7640d0a10aa74f9c3a11978219f.1920x1080.jpg?t=1604284816",
    "Slug": "mystical-mayhem",
    "Meta Title": "Mystical Mayhem: Oct 29, 2020, Rock Nano and Full Overview",
    "Meta Description": "Looking for information on Mystical Mayhem? Check out the release date (Oct 29, 2020), developer insights from Rock Nano, and a complete game summary.",
    "Alt Text Image": "Official header image for Mystical Mayhem game - Steam 1379050",
    "Canonical URL": "https://gusku.site/game/mystical-mayhem",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mystical Mayhem\", \"description\": \"Looking for information on Mystical Mayhem? Check out the release date (Oct 29, 2020), developer insights from Rock Nano, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rock Nano\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Refract Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1379050/header.jpg?t=1604284816\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}