{
    "AppID": 378700,
    "Name": "Neptune Flux",
    "Release date": "Nov 15, 2016",
    "About the game": "Neptune Flux is a story-driven, open world adventure game set in a sci-fi ocean full of mystery and haunting beauty. The world above the water is a dust bowl and an escape into space is out of reach. Humanity's last hope of survival is the untouched ecosystem of the deep sea, and A.Q.U.A. is the worldwide market leader in underwater colonization. In Neptune Flux, you take on the role of Sarah, an A.Q.U.A. employee tasked with finding the source of strange energy surges that are disrupting A.Q.U.A. operations. As you carry out A.Q.U.A. missions and explore the sea floor, you’ll discover the dark secrets that lurk below. EXPLORE THE OCEAN In the deep sea there’s no natural sunlight, but every A.Q.U.A. dive pod comes equipped to see in the dark. Tools like flood lights and flares illuminate nearby areas, while more advanced gear like visual sonar can cut through the deep sea fog and highlight distant objects. Earn cash by recovering treasure and reporting lost wreck sites to A.Q.U.A. Invest your earnings into dive pod upgrades to increase your effectiveness as an explorer. DISCOVER THE TRUTH Working for A.Q.U.A. means being in the dark, literally and figuratively. Sarah has learned to stop asking questions about her missions, but when her assignments become increasingly unusual, she begins her quest to learn the truth. Discover an open ocean filled with sci-fi wonder and supernatural secrets. Experience the personal story of Sarah's struggle to survive in a world that might be beyond saving. IMMERSE YOURSELF IN VR Neptune Flux can be played with or without a VR headset, but if you're chasing that feeling of VR 'presence', this game is for you. Strap on a headset like the HTC Vive or Oculus Rift, grab your favorite gamepad, and get lost in a fully realized world. Look around the humble interior of Sarah's dive pod and hear her snarky comments. See the huge scale of wreck sites in stunning stereoscopic 3D. Listen to professionally mastered positional audio and hear everything - from creaking wooden ships to percolating bubbles - in remarkable clarity.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/378700/header.jpg?t=1479218410",
    "Price": 7.99,
    "Developers": "Zoxide Games",
    "Publishers": "Zoxide Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/378700/ss_56e48b0f7975b6b7ad03a6027e6c6016f2531390.1920x1080.jpg?t=1479218410,https://cdn.akamai.steamstatic.com/steam/apps/378700/ss_4e510237bbba205bc33a65d0a43e690b76563001.1920x1080.jpg?t=1479218410,https://cdn.akamai.steamstatic.com/steam/apps/378700/ss_74f2e610cbbdb025959d8d47d088df8fa6e26b3a.1920x1080.jpg?t=1479218410,https://cdn.akamai.steamstatic.com/steam/apps/378700/ss_0635fedbf683dabe872c76f751fcaf6274c0e0f6.1920x1080.jpg?t=1479218410,https://cdn.akamai.steamstatic.com/steam/apps/378700/ss_83aeea66da7bf04620d910a899fb81e4b81be18e.1920x1080.jpg?t=1479218410,https://cdn.akamai.steamstatic.com/steam/apps/378700/ss_95232a904dffc5342e6aadca38c26968467224f1.1920x1080.jpg?t=1479218410",
    "Slug": "neptune-flux",
    "Meta Title": "Neptune Flux: Nov 15, 2016, Zoxide Games and Full Overview",
    "Meta Description": "Looking for information on Neptune Flux? Check out the release date (Nov 15, 2016), developer insights from Zoxide Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Neptune Flux game - Steam 378700",
    "Canonical URL": "https://gusku.site/game/neptune-flux",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Neptune Flux\", \"description\": \"Looking for information on Neptune Flux? Check out the release date (Nov 15, 2016), developer insights from Zoxide Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zoxide Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zoxide Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/378700/header.jpg?t=1479218410\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}