{
    "AppID": 1962770,
    "Name": "Nova Empire",
    "Release date": "May 26, 2022",
    "About the game": "To achieve domination of the galaxy, you will immerse yourself in action-packed space battles, define your space strategy, forge alliances among other players, and use a space base &amp; spaceship builder to develop your space station and dominate the universe. Find out why this is one of the most thrilling and exciting sci fi spaceship games! Challenge other players worldwide in epic Interstellar Battles Develop your strategy to establish space domination! Command space and conquer other commanders in one of the most engaging strategy games. Fight in intense universe PvP battles against hostile commander’s spaceships. Your skills as a commander will be tested vigorously in a battle for control of the galaxy! Customize your fleets and build your Space Empire Using a spaceship builder, you will customize your fleets and prepare them for space domination! Customize your fleet by unlocking unique weapons and armor and become the most powerful commander in the galaxy! Send your spaceships out to scan for enemy fleets or to battle and conquer your rivals. Unlock space frigates, drones, cruisers, and more spaceships! Decide your strategy and conquer the galaxy Design a space strategy capable of dominating enemy alliances and controlling the galaxy! Decide early on how to manage your resources in this universe (energy, minerals, crystals and alloy). Create a fleet strategy with your allies, whether you want to prepare for an all-out attack with dreadnoughts or an agile attack fleet of light cruisers, the decision is yours. Recruit admirals from your academy and guide your fleets to victory! Develop your space station using a space base builder As a Commander, you oversee building up a space base from scratch! Construct your space station by building energy plants, trading posts, and defense modules to protect your space station from enemy attacks! Strengthen your space empire by building research labs, naval academies and a ship design center! Upgrade and unlock new versions of your building to create the most powerful empire in the galaxy and defeat your rivals! Create Alliances - Team up with other commanders In this sci fi multiplayer space game you can forge alliances from across the galaxy. Control entire galaxy sectors in the universe and fight alongside allies versus your rivals with a planned space strategy! Join legions and help your fellow commanders acquire weaponry, construct a space station, and acquire resources faster. Help your allies! Count on your fellow commanders to defend from outside attacks and to plan raids in other space battles, join forces with your allies to defeat your rivals!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1962770/header.jpg?t=1653580836",
    "Price": 0.0,
    "Developers": "Gamebear Tech",
    "Publishers": "Aquila Interactive Co., Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1962770/ss_403c39c82c11b4e319a2da2590b8255e9ca18934.1920x1080.jpg?t=1653580836,https://cdn.akamai.steamstatic.com/steam/apps/1962770/ss_d5d534ea78aa2df70df6cfb8e7beac0eea856bdf.1920x1080.jpg?t=1653580836,https://cdn.akamai.steamstatic.com/steam/apps/1962770/ss_8b4a5ac41c6851920d033e76bb76693d872b58f1.1920x1080.jpg?t=1653580836,https://cdn.akamai.steamstatic.com/steam/apps/1962770/ss_467c9768523c08d518262f1f0173e255e74c66c1.1920x1080.jpg?t=1653580836,https://cdn.akamai.steamstatic.com/steam/apps/1962770/ss_bce84f916537acec100f4e61b0a1f8875dc5241c.1920x1080.jpg?t=1653580836,https://cdn.akamai.steamstatic.com/steam/apps/1962770/ss_d51e76ed1489b816a7b6985306a8ee433393f986.1920x1080.jpg?t=1653580836,https://cdn.akamai.steamstatic.com/steam/apps/1962770/ss_f4745587bbeb6dd7c51801e509ade3504affa301.1920x1080.jpg?t=1653580836",
    "Slug": "nova-empire",
    "Meta Title": "Nova Empire: May 26, 2022, Gamebear Tech and Full Overview",
    "Meta Description": "Looking for information on Nova Empire? Check out the release date (May 26, 2022), developer insights from Gamebear Tech, and a complete game summary.",
    "Alt Text Image": "Official header image for Nova Empire game - Steam 1962770",
    "Canonical URL": "https://gusku.site/game/nova-empire",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nova Empire\", \"description\": \"Looking for information on Nova Empire? Check out the release date (May 26, 2022), developer insights from Gamebear Tech, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gamebear Tech\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aquila Interactive Co., Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1962770/header.jpg?t=1653580836\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}