{
    "AppID": 1372700,
    "Name": "Off The Chains Disc Golf",
    "Release date": "Nov 12, 2020",
    "About the game": "Off The Chains Disc Golf is a lighthearted disc golf simulation. Start your disc golfing adventure learning how to play with the friendly AI-controlled DiscBot! Multiplayer The best part of disc golf? Playing with your friends of course. Enjoy all playable courses with lobby-based private and public matchmaking. Disc Physics Both disc golf veterans and newcomers alike will appreciate our realistic disc physics. Each disc has its own rating using a 4-number rating system that will be familiar to disc golf enthusiasts, but easy for newcomers to learn. Be Competitive Join our discord to compete in the weekend tournaments! It’s tons of fun with a great community behind it. We rotate through all of the available courses on a weekly basis. Unlock New Items Throughout the course of the game you will earn Chain Link points to unlock new discs. Customize the collection that you want to take with you on your next round. Take In The Scenery With multiple beautiful courses with varying biomes you may find yourself stopping to just enjoy the scenery, and there's certainly nothing wrong with that! This simulation is designed to be relaxing and enjoyable. Take all the time you need. Breathe. Throw discs. Repeat. Features Play 117 baskets across 7 courses each offering unique environments and difficulties Easy to learn (even if you have never played real-life disc golf) but challenging to master Discs use a 4 number rating system that will be familiar to disc golf enthusiasts (speed, glide, turn, and fade) Realistic disc flight physics Multiplayer support to connect with your friends across the world casually, competitively, or just to practice Earn Chain Link points to unlock and discover new discs as you progress through the game Discord We're real live humans that you can come and actually talk to. Join the community on discord to talk to the developers, meet new friends, give feedback, and coordinate with people to join in multiplayer games.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1372700/header.jpg?t=1643398098",
    "Price": 11.24,
    "Developers": "Dream Nerdy",
    "Publishers": "Dream Nerdy",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1372700/ss_cff654f608a09286caf04732f567ff96353b6d95.1920x1080.jpg?t=1643398098,https://cdn.akamai.steamstatic.com/steam/apps/1372700/ss_c5903652256d028b5762ab415a6d5c1dd5dcbd4b.1920x1080.jpg?t=1643398098,https://cdn.akamai.steamstatic.com/steam/apps/1372700/ss_c756f7af50b5600e898867092faf009cdf0b40bc.1920x1080.jpg?t=1643398098,https://cdn.akamai.steamstatic.com/steam/apps/1372700/ss_f82837a06e5b9bfcdbc09f2a2d1d5705db801695.1920x1080.jpg?t=1643398098,https://cdn.akamai.steamstatic.com/steam/apps/1372700/ss_ea803fab1071660b8e03353a0a8ab1b997cdbe47.1920x1080.jpg?t=1643398098",
    "Slug": "off-the-chains-disc-golf",
    "Meta Title": "Off The Chains Disc Golf: Nov 12, 2020, Dream Nerdy and F...",
    "Meta Description": "Looking for information on Off The Chains Disc Golf? Check out the release date (Nov 12, 2020), developer insights from Dream Nerdy, and a complete game...",
    "Alt Text Image": "Official header image for Off The Chains Disc Golf game - Steam 1372700",
    "Canonical URL": "https://gusku.site/game/off-the-chains-disc-golf",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Off The Chains Disc Golf\", \"description\": \"Looking for information on Off The Chains Disc Golf? Check out the release date (Nov 12, 2020), developer insights from Dream Nerdy, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 12, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dream Nerdy\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dream Nerdy\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1372700/header.jpg?t=1643398098\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.24, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}