{
    "AppID": 551170,
    "Name": "Onmyoji",
    "Release date": "Apr 18, 2018",
    "About the game": "A Tale of Demons Begin your legendary journey through a Japanese-style fantasy RPG. Your epic adventure starts in the Heian period of Japanese history, a time when humans and demons co-exist… It was a hellish time when spirits and demons lurked in the shadows, striking fear into the hearts of men. The only ones standing against the oncoming darkness and terror were the onmyoji – masters of mystery. Divining the future, observing the stars, traveling between worlds, and ultimately bending spirits to their will, the onmyoji sustained the balance between the humans and the demons. Enter the incredible, vibrant world of spirits and demons, and watch mysteries unfold before your very eyes. Play as a Legendary Onmyoji from Japanese Folklore Be reincarnated as Abe no Seimei, a legendary onmyoji from Japanese folklore. Help Seimei on his journey to recover his lost memories while encountering demons of all shapes and forms. Unravel the supernatural tales of the shikigami, spirits, and demons, and listen to their inner voices. Collect and Evolve Hundreds of Shikigami Collect nearly a hundred different magical spirits called shikigami, each with their own unique stories and abilities. Strengthen your shikigami or change their appearances by evolving them. Multi-dimensional Gameplay and Strategic Battling Unleash your shikigami in semi-real time battles with other onmyoji in your area or from around the world. Build your dream tactical team by choosing shikigami based on their abilities and strengths, then send them into battles against other teams. Challenge yourself with various and exciting game modes including Duels, Realm Raids, Boss Challenges, Demon Parade, and much more. Exquisite Reproduction of Ancient Kyoto Immaculate 3D modeling takes you into the vibrant, immersive world of Kyoto during the Heian period. Relax in peaceful courtyards and pass through otherworldly Torii gates, watch the spring cherry blossoms drift, and wrap yourself in the solemnity of palaces and shrines. Detailed rendering and painstaking worldbuilding will immerse you in the mesmerizing, fantasy world of Onmyoji. An Auditory and Visual Feast Onmyoji features many of Japan's top voice actors, including Rie Kugimiya (Fullmetal Alchemist), Noriaki Sugiyama (Naruto), Miyuki Sawashiro (Di Gi Charat), Tatsuhisa Suzuki (Final Fantasy XV), Jun Fukuyama (Super Smash Bros), Nana Mizuki (Naruto), Akira Ishida (Neon Genesis Evangelion) and more. This talented group brings all the characters of the game to life and helps paint their mysterious yet poignant tales. An original soundtrack by world renowned composer Shigeru Umebayashi (Mood for Love, 2046, House of Flying Daggers) provides a lush soundscape to transport players deep into the mysteries of the ancient Japan. Social System You can create virtual realms and interact with other players in Onmyoji. Invite your friends to battle alongside you against boss demons, or challenge them to a duel! Travel through the zones of the living and the dead with your new friends, or even break through dimensions by connecting with them in the real world.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/551170/header.jpg?t=1589523174",
    "Price": 0.0,
    "Developers": "NetEase Games",
    "Publishers": "NetEase Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/551170/ss_1da8ce7a66ca253d43c9a50e7b2a419795e22cfd.1920x1080.jpg?t=1589523174,https://cdn.akamai.steamstatic.com/steam/apps/551170/ss_5192cda30dd67e65c7669786b8b6075cf52d7352.1920x1080.jpg?t=1589523174,https://cdn.akamai.steamstatic.com/steam/apps/551170/ss_32d07a6650a2eab8b2f40f6da247a19641551c15.1920x1080.jpg?t=1589523174,https://cdn.akamai.steamstatic.com/steam/apps/551170/ss_51a2cab4b29c35bc1195387f17644d49ccc99835.1920x1080.jpg?t=1589523174,https://cdn.akamai.steamstatic.com/steam/apps/551170/ss_00fd580340990b43ade01ca2ce06891b5ab6f388.1920x1080.jpg?t=1589523174",
    "Slug": "onmyoji",
    "Meta Title": "Onmyoji: Apr 18, 2018, NetEase Games and Full Overview",
    "Meta Description": "Looking for information on Onmyoji? Check out the release date (Apr 18, 2018), developer insights from NetEase Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Onmyoji game - Steam 551170",
    "Canonical URL": "https://gusku.site/game/onmyoji",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Onmyoji\", \"description\": \"Looking for information on Onmyoji? Check out the release date (Apr 18, 2018), developer insights from NetEase Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 18, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"NetEase Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NetEase Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/551170/header.jpg?t=1589523174\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}