{
    "AppID": 1588620,
    "Name": "ORIMON.1 - Bilfy & Krotroklon",
    "Release date": "May 17, 2021",
    "About the game": "Hi! My name is Sumy Pac-Shell and I belong to the Sumy Shell family. This is the franchise first game in which I participate. For that reason, it is obvious that you don’t know me, you are also unaware of all my other 'MEs', a statement that will inevitably make you wonder: other 'MEs'? How come? How can you, Sumy Pac-Shell, have other 'MEs'? Dear, so that you can understand this “MEs” thing, let me explain a little something: my creator, Roberto Shell, when he decided to become a developer, decided that all the games he created would be starring Sumy Shells. He gave us the following gift: every Sumy Shell can interact with other sums Shells of the present, past, future, parallel worlds, multiverses, as well as spiritual worlds. For that reason, I am unique, not being multiple, now returning to the ORIMON franchise... The word ORIMON is the fusion of two terms, ORIGIN + MONSTERS. In the game ORIMON.1 - BILFY &amp; KROTROKLON, the player's mission is to collect energy cores to awaken the Trymon Powergy that energized Dilbigly, a living weapon called Gunsoul, which once charged, fires Bulltrients that have the power to hatch Eggmons as well as to allow born Trymons to evolve. In the game ORIMON.1 - BILFY &amp; KROTROKLON, there will be two born Trymons: Bilfy &amp; Krotroklon. After birth, I, Sumy Pac-Shell, will be able to talk to both and, in the following dialogues, I will discover that a terrible murder has occurred and, to unravel this crime, I will have to help Bilfy &amp; Krotroklon evolve three times; where finally, I will come across a surprising ending. Now, here is the question: why should you play this game? I'll give you 4 answers. 1 - ORIMON.1 - BILFY &amp; KROTROKLON has a new kind of monster, the TRYMON, which has original features never seen in a game. 2 - ORIMON.1 - BILFY &amp; KROTROKLON has an amazing narrative that not only breaks the fourth wall but also makes the ceiling blow away and finally brings the whole house down. 3 - ORIMON.1 - BILFY &amp; KROTROKLON has an engaging story with an ending that will blow your mind. 4 - ORIMON.1 - BILFY &amp; KROTROKLON provides its players with intellectual tools to allow their own self-analysis, if they want to answer the three fateful life questions: Who am I? Where did I come from? Where am I going? With all the explanations given, I just want you to have a lot of fun, achieve all that you can, and be smart, the world is full of traps, and only knowledge will allow you to avoid them. Good luck and be in peace! Goodbye! FEATURING ● In the energy core collection screen, the player moves the Dilbigly to the right, left, up, and down using the W, A, S, and D keys, as well as the arrow keys. ● In the dialog screens, the player advances the texts using any key or with the aid of the mouse, as desired. ● Soundtrack provided by Sir Cubworth. ● The ORIMON.1 - BILFY &amp; KROTROKLON game has six phases to collect energy cores, each of which consists of three subphases. ● To obtain platinum on The ORIMON.1 - BILFY &amp; KROTROKLON game the player has to obtain 20 awards.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1588620/header.jpg?t=1621260673",
    "Price": 1.99,
    "Developers": "Star Shell",
    "Publishers": "Star Shell",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1588620/ss_3c592d878a5706317aaad16dffbd2c167f846142.1920x1080.jpg?t=1621260673,https://cdn.akamai.steamstatic.com/steam/apps/1588620/ss_3d36cd570e3b3489594bbf2893f567c2b84375e5.1920x1080.jpg?t=1621260673,https://cdn.akamai.steamstatic.com/steam/apps/1588620/ss_bed4960fbc1502aa48ece1be6f10f88975ae7a15.1920x1080.jpg?t=1621260673,https://cdn.akamai.steamstatic.com/steam/apps/1588620/ss_5328c3ef35c477f7ff70d36152f9c5b5a81918da.1920x1080.jpg?t=1621260673,https://cdn.akamai.steamstatic.com/steam/apps/1588620/ss_47097d71feb2f80f50e80cf6d2aa50d4984f53c1.1920x1080.jpg?t=1621260673",
    "Slug": "orimon-1-bilfy-krotroklon",
    "Meta Title": "ORIMON.1 - Bilfy & Krotroklon: May 17, 2021, Star Shell a...",
    "Meta Description": "Looking for information on ORIMON.1 - Bilfy & Krotroklon? Check out the release date (May 17, 2021), developer insights from Star Shell, and a complete ...",
    "Alt Text Image": "Official header image for ORIMON.1 - Bilfy & Krotroklon game - Steam 1588620",
    "Canonical URL": "https://gusku.site/game/orimon-1-bilfy-krotroklon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ORIMON.1 - Bilfy & Krotroklon\", \"description\": \"Looking for information on ORIMON.1 - Bilfy & Krotroklon? Check out the release date (May 17, 2021), developer insights from Star Shell, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 17, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Star Shell\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Star Shell\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1588620/header.jpg?t=1621260673\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}