{
    "AppID": 577970,
    "Name": "Punch Planet - Early Access",
    "Release date": "Nov 8, 2017",
    "About the game": "Punch Planet is a Competitive Sci-Fi 2D fighter with a rich and immersive universe, spanning exotic planets, advanced cities, and alien races. SECTOR-K Punch Planet is developed by 3 longtime competitors. Our focus is to create a fighting game with a solid foundation of competitive mechanics while also introducing a new depth of story, humor, and design. STORY Roy, an undercover Detective for the Luna PD is caught up in a galactic conspiracy. Framed for a high profile murder, he must follow his only lead to Planet K-0. Known to many as Punch Planet, it is the central hub for the evil scum of the Universe. There, he will have to track down the real murderer and bring them back to his home world in an attempt to clear his name. GAMEPLAY Punch Planet features classic 1v1 competitive multiplayer and online gameplay featuring GGPO. Local Versus Mode (AVAILABLE NOW!) Punch Planet features classic 1v1 competitive multiplayer. Versus CPU Mode (AVAILABLE NOW!) Battle against the CPU with multiple difficulty and behavior settings. Online Versus Mode (AVAILABLE NOW!) Play online featuring official GGPO rollback netcode. Join the official Punch Planet Discord for community matchmaking. 8 Player Lobbies Spectating Ranked and Casual Matchmaking (TBD) Online Training Mode (TBD) Training Mode (AVAILABLE NOW!) Punch planet features a robust training mode. Hit Box Viewers Frame Data Overlay Dummy Recording Reversal Options State Saving CPU Story Mode (RELEASE TBD) Story mode will include Animated Cutscenes, Arcade, Bonus, and Survival Style challenges as you play as Roy through the main story arc. Arcade Modes (RELEASE TBD) Punch planet will feature a variety of single player modes including Arcade and Trials. MECHANICS Time Canceling (T-METER) Galactic Civilization has reached new heights. With the introduction of Time Canceling Devices, users are able to travel through time! The technology is fairly new and limited, currently allowing travel up to 1 second into the past for small corrections to everyday problems. The devices come equipped with an auto fail safe which will disintegrate your former self preventing any possible time paradox. Use these devices to perform special mechanics such as Double Time Canceling (DTC), Jump Time Canceling (JTC), and Absorb Time Canceling (ATC). Be careful, energy is limited and is directly connected to your TC Meter. Energy Attacks (E-METER) Perform enhanced versions of your characters unique attacks by spending 1 E-Meter. Combine 2 or more E-Meter stocks to execute a powerful Advanced Attack. FEATURES AVAILABLE NOW 8 Playable Characters 5 Stages Online Multiplayer (GGPO) Local, and CPU Versus Training Mode Competitive Play COMING SOON Arcade Mode Trials &amp; Challenges Story Mode",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/577970/header.jpg?t=1657310177",
    "Price": 19.99,
    "Developers": "Sector-K Games",
    "Publishers": "Sector-K Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/577970/ss_b43012ec75fd023eb9b63876357e13dc47896ec2.1920x1080.jpg?t=1657310177,https://cdn.akamai.steamstatic.com/steam/apps/577970/ss_46c590435af86ff9aa22acb0c395979b41933b67.1920x1080.jpg?t=1657310177,https://cdn.akamai.steamstatic.com/steam/apps/577970/ss_f0633265db78fa491b2f142ee5295d25cd3e94bd.1920x1080.jpg?t=1657310177,https://cdn.akamai.steamstatic.com/steam/apps/577970/ss_cf041b55260ce88005019ddc0e380828c7af1196.1920x1080.jpg?t=1657310177,https://cdn.akamai.steamstatic.com/steam/apps/577970/ss_3fa3eb34dedb9ff74e503e13d271c1f9618efaa5.1920x1080.jpg?t=1657310177,https://cdn.akamai.steamstatic.com/steam/apps/577970/ss_0c466b6ce24eed410865a89e541b776b76c22311.1920x1080.jpg?t=1657310177,https://cdn.akamai.steamstatic.com/steam/apps/577970/ss_49e3d2bc7fd276992124b072dcce4d9e35d8de93.1920x1080.jpg?t=1657310177,https://cdn.akamai.steamstatic.com/steam/apps/577970/ss_2b7f38b9465db59cd29a19fd8b1f77c921f7de4c.1920x1080.jpg?t=1657310177",
    "Slug": "punch-planet-early-access",
    "Meta Title": "Punch Planet - Early Access: Nov 8, 2017, Sector-K Games ...",
    "Meta Description": "Looking for information on Punch Planet - Early Access? Check out the release date (Nov 8, 2017), developer insights from Sector-K Games, and a complete...",
    "Alt Text Image": "Official header image for Punch Planet - Early Access game - Steam 577970",
    "Canonical URL": "https://gusku.site/game/punch-planet-early-access",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Punch Planet - Early Access\", \"description\": \"Looking for information on Punch Planet - Early Access? Check out the release date (Nov 8, 2017), developer insights from Sector-K Games, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 8, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sector-K Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sector-K Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/577970/header.jpg?t=1657310177\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}