{
    "AppID": 1777760,
    "Name": "Soccer Manager 2022",
    "Release date": "Nov 26, 2021",
    "About the game": "Build your football dream team from over 25,000 official FIFPRO ™ licensed players and compete to be the ultimate football manager. Choose from over 900 clubs from 35 of the top footballing countries around the world and lead your favourite club to glory. As a Soccer Manager, you control all aspects of your club. Every transfer, every tactic, every football match counts. Immerse yourself in the action as a football manager both on and off the pitch from planning training sessions, selecting your starting top eleven, outsmarting the opposition with winning tactics, to building a world class stadium, controlling your club finances and discovering future superstars through an extensive scouting network and the dynamic transfer market. This new 2022 edition of the hugely popular Soccer Manager series comes with a stadium full of new features. As well as official FIFPro™ players and league and club partnerships, Soccer Manager has built on 15 years of development experience to add new match day statistics, improved player AI on the pitch, Assistant Managers, new manager stats and reputations, an updated transfer market and enhanced graphics and animations throughout. Assistant Manager - our brand Ambassador Mikel Arteta knows the importance of having the very best back-room staff to support him, so we've created the Assistant Manager. As a result, match day becomes more immersive with incoming analysis of stats and tactical feedback from right alongside you in the dug-out, helping you get the best out of your team. Transfer Market - a highly dynamic transfer market is a significant factor in the world of football. Soccer Manager 2022 now has a loan to buy option, pre-contracts and of course, Transfer Deadline Day! Improved match engine - a new and improved system for players making decisions on the pitch makes the match engine feel more realistic and responsive than ever before. Players dribble with more confidence, control one-touch passes with finesse and defend with new purpose. Dynamic set pieces and new goalkeeper AI take the match engine to new levels at some of the most critical phases of play. Real Football - Soccer Manager has partnered up with FIFPro™, Wolverhampton Wanderers, the SPFL, Bayer Leverkusen, and Inter Milan to ensure the most realistic football management experience. Soccer Manager 2022 features: ★ Choose from over 900 clubs from 35 of the top footballing countries. ★ Build your dream team from over 25,000 official FIFPro™ players. ★ Watch your strategy play out on the pitch in realistic and reactive 3D simulation. ★ Tactically manage your players from training ground coaching to live pitch-side instructions. ★ Analyse your football team's performance as Soccer Manager with in-depth statistics. ★ Sign experienced world beaters for instant success or nurture the next generation of superstars. ★ Utilise the dynamic transfer market and take to the pitch with your best starting eleven. ★ Build football stadiums and club facilities to world class standards in stunning 3D animations. ★ Your football manager decisions affect the attitude of the board, players and even the fans. ★ Your success is rewarded with more prestigious job offers to further your managerial career. Be the football manager that leads your club to greatness in Soccer Manager 2022! Start your journey today to become the next football legend!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1777760/header.jpg?t=1649846191",
    "Price": 0.0,
    "Developers": "Invincibles Studio Ltd",
    "Publishers": NaN,
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1777760/ss_db1038aa4edb480fb64fd737b9d476950065958b.1920x1080.jpg?t=1649846191,https://cdn.akamai.steamstatic.com/steam/apps/1777760/ss_384b962b4d36bb6d269bc14778f2ca77fd64c9c6.1920x1080.jpg?t=1649846191,https://cdn.akamai.steamstatic.com/steam/apps/1777760/ss_ee92e61aa337cc33306408340a0e81f62b71b759.1920x1080.jpg?t=1649846191,https://cdn.akamai.steamstatic.com/steam/apps/1777760/ss_c8775be703be218528908e419735aaf57d539318.1920x1080.jpg?t=1649846191,https://cdn.akamai.steamstatic.com/steam/apps/1777760/ss_679b8bdd6a38865fb043bb0387297ae1eeaf2fb2.1920x1080.jpg?t=1649846191,https://cdn.akamai.steamstatic.com/steam/apps/1777760/ss_c051ca3cb6e2b2f7b9ff80f181a2ef96496adceb.1920x1080.jpg?t=1649846191,https://cdn.akamai.steamstatic.com/steam/apps/1777760/ss_a7214d519b5db4fe5ddb29e317f6efe67bbc46eb.1920x1080.jpg?t=1649846191",
    "Slug": "soccer-manager-2022",
    "Meta Title": "Soccer Manager 2022: Nov 26, 2021, Invincibles Studio Ltd...",
    "Meta Description": "Looking for information on Soccer Manager 2022? Check out the release date (Nov 26, 2021), developer insights from Invincibles Studio Ltd, and a complet...",
    "Alt Text Image": "Official header image for Soccer Manager 2022 game - Steam 1777760",
    "Canonical URL": "https://gusku.site/game/soccer-manager-2022",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Soccer Manager 2022\", \"description\": \"Looking for information on Soccer Manager 2022? Check out the release date (Nov 26, 2021), developer insights from Invincibles Studio Ltd, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 26, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Invincibles Studio Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": NaN}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1777760/header.jpg?t=1649846191\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}