{
    "AppID": 736400,
    "Name": "Soundscape Classic",
    "Release date": "Nov 1, 2017",
    "About the game": "Soundscape VR is your own private music venue, a mind-blowing audiovisual experience, an interactive piece of art to explore, and the next evolution of music visualizers. Play your favorite music inside Soundscape - any song from any music service - to immerse yourself in a brand-new 360-degree world of breathtaking visuals beyond that of any live show or music festival you have ever experienced. Use your motion controllers to effortlessly create and modify the visuals with a new seamless control scheme that allows your eyes to stay focused on the action without having to dig through menus. Lights, lasers, particles, and many other effects will come to life at your touch as you teleport through space and create endless combinations of visuals in this interactive sandbox world. You haven’t heard your favorite songs until you've experienced them in Soundscape. Although being created with electronic music in mind, it works well with many genres from Jam to Hip hop. You can adjust the BPM easily in-game at any time by glancing at your wrist to customize the visuals from the grooviest slow jams, to the fastest drum &amp; bass beats. Soundscape allows you to curate the visuals and easily control the pattern, color, strobe, rotation, speed, and scale of lights along with other special bonus effects. You'll also control various fireworks, glowsticks, trails of neon light, showers of sparks, and massive columns of flame. Watch the particles ricochet around the environment as gravity warps to different levels and your cosmic environment shifts from one galaxy to the next. The launch of Soundscape is only the beginning of what's to come. Soundscape is being designed as a new platform for music experiences across the globe and as the intergalactic VR music festival of tomorrow. Ever had a new song you were addicted to and couldn't wait to share with friends? Coming soon you can connect with them directly and listen to any song simultaneously - together, all while dancing in VR, chatting, and creating incredible visuals for one another. Or just create and DJ your own virtual party to find strangers who love the same artists as you do. Soundscape can be enjoyed sitting, standing, or even lying on your back. Teleportation movement allows you to pick your ideal vantage point anywhere in-game. You can swap between different modes of play easily. Choose to chill out and let the program do all the work creating the visuals automatically, then take complete control again at any time whenever you're ready! Soundscape strips away all the inconveniences of the modern music experience - waiting in line, aggressive security, expensive drinks, poor visibility and audio equipment - and puts the power in your hands instead. Soundscape is a cutting-edge virtual reality visual experience, choose your graphics options wisely in-game. Similar to Crysis when it was released in 2007, GPU hardware does simply not yet exist to drive Soundscape to its maximum potential. Even a 1080ti will not be able to supersample significantly due to the extreme nature of the layers of visuals and the variability of how each person chooses to play the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/736400/header.jpg?t=1538513060",
    "Price": 0.0,
    "Developers": "Groove Science",
    "Publishers": "Groove Science Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/736400/ss_6dd369631586334a632186436169b7413b5666f4.1920x1080.jpg?t=1538513060,https://cdn.akamai.steamstatic.com/steam/apps/736400/ss_f5de46e4ccb64b3dd2a92942c6f21d2b960b479a.1920x1080.jpg?t=1538513060,https://cdn.akamai.steamstatic.com/steam/apps/736400/ss_dc9a1b451224c81c4648d87d9b400a1fc9c21ad5.1920x1080.jpg?t=1538513060,https://cdn.akamai.steamstatic.com/steam/apps/736400/ss_506f45a1b8d8e501700aa0aa9f0276e91461827b.1920x1080.jpg?t=1538513060,https://cdn.akamai.steamstatic.com/steam/apps/736400/ss_940c524be321369ca1b558bdaab86731cf95e50b.1920x1080.jpg?t=1538513060,https://cdn.akamai.steamstatic.com/steam/apps/736400/ss_a6f8e8d87fa091d5135709ac072507feecdd20a9.1920x1080.jpg?t=1538513060,https://cdn.akamai.steamstatic.com/steam/apps/736400/ss_4dde819c8c1f88dededb4a6991ba05c4a5d6e91b.1920x1080.jpg?t=1538513060",
    "Slug": "soundscape-classic",
    "Meta Title": "Soundscape Classic: Nov 1, 2017, Groove Science and Full ...",
    "Meta Description": "Looking for information on Soundscape Classic? Check out the release date (Nov 1, 2017), developer insights from Groove Science, and a complete game sum...",
    "Alt Text Image": "Official header image for Soundscape Classic game - Steam 736400",
    "Canonical URL": "https://gusku.site/game/soundscape-classic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Soundscape Classic\", \"description\": \"Looking for information on Soundscape Classic? Check out the release date (Nov 1, 2017), developer insights from Groove Science, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Groove Science\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Groove Science Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/736400/header.jpg?t=1538513060\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}