{
    "AppID": 686010,
    "Name": "The Hunt - Rebuilt",
    "Release date": "Sep 12, 2017",
    "About the game": "(EDIT: 4/5/2021) Just a quick message to you looking to play this, this game is frustratingly hard, has a lot of ridiculously 'blink-and-you'll-miss-it' secrets, and a lot, A LOT of unfair death mechanics. As I was still learning a way to properly implement puzzle techniques with the story I wanted to tell, I had a poor perception of how hard this game was to play because I could only see the game-play as the developer. At the time (to me) all the puzzles seemed painfully easy, but of course that's because I was the one who built it (pretty dumb, right?). I was more focused on creating a strong atmosphere and REALLY overhauling the visual aesthetic which was pretty lackluster in the very first version (I still love how this game turned out visually :D), and I still feel the story itself is a strong one. As for the puzzle logic, the narrative flow, and how well the game-play and story are meshed together, it's a mess. I do think there are several mechanics that worked really well, but there's just too many that are so clunky and unpolished it hurts to think about. I'm shocked to find people are STILL giving this game a chance and it hurts watching them struggle through puzzle mechanics I know now could've been implemented far better. If you want to play this game regardless, go ahead it's free, but just know you'll be in for a rough time. I want to redo this game so much, but life is getting in the way ATM. If I do finally sit down and redo this, I'll be sure to post an update here, but for now I won't be making any promises. I'd like to thank everyone who played The Hunt-Rebuilt already. You've all given great constructive criticism and were super polite about it. Thank you sincerely, giving honest feedback with a kind attitude is the most important thing you can give any developer :). Adieu for now. (Everything below this line is part of the original game description. Including my poor attempts to 'dismiss' the difficulty.) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ 'As you blink the grogginess from your eyes, you remember what's happened and why you are here...' It seems you didn't think your escape plan through when your ran into the forest of Diana. Too bad. Now everything, including your pursuer, is out for your blood. Can you find the way out, or will you fall prey to the forest? 'The White Stag'. The most exalted prize of the forest. Only the greatest of hunters can hope to claim its head. It's rather unfortunate to know that such a man is the one pursuing you. But what is this? As you traverse the forest, a darker reality will be unveiled. Blood-soaked liaisons, sorrow, hatred and lust all melded together in the life of your pursuer. Could it be? Is it even possible to think that the hunter may have deeper reasons for pursuing you aside from pride? The Hunt was made in the RPG Maker VX Ace engine. It contains puzzles, chases, and multiple endings. Your choices throughout the game will not only determine what ending you'll get but will also change some of the dialogue and gameplay along the way. {I wanted to include a hand-painted animation at one of the endings and promised to have it in the release. While I have kept true to my word, I could only include a small snippet of what I'd been planning and (as much as it shames me to admit), touched it up digitally. I sincerely want to show the full animation I'd been working on and will try to finish it in the future.} Made in a similar vein to classic pixel games, The Hunt will not hold your hand. Your brain and eyes will be tested throughout the game so keep both sharp. The game is designed to allow the player to skip over large amounts of exploration and puzzles if they want to simply escape the forest. However, if you want to know what's going on, you will have to look carefully. It's easy to miss or simply gloss over important items, information, clues, and hints. At the start of the game, you will be provided with the choice of displaying NOTES. NOTES in the game provide information that will make your progression easier. If you don't enable NOTES, you may encounter surprises, but it will allow you to have a more challenging and potentially more fun experience. Ultimately it depends on what you as the gamer would prefer, easy progression or immersive gameplay. Keep in mind that the NOTES for the most part will only provide information on how to escape. They will not provide a lot of information towards finding secret endings or information. There are seven different endings. A spoiler free walkthrough is provided in the READ ME but...come on, that's no fun. WARNING - SOME MATERIAL MAY BE INAPPROPRIATE FOR CHILDREN While pixelated, this game does contain: Gruesome depictions of death and dismemberment Various mentions of sex, rape, torture, and murder Dark/depressing themes May display images containing non-sexualized nudity The Hunt was originally a 2015 free indie game. It's been rebuilt and published on Steam to support the developer. Game will be released in English. ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/686010/header.jpg?t=1617624455",
    "Price": 0.0,
    "Developers": "Peddler Games",
    "Publishers": "Peddler Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/686010/ss_f2b98efb13d7208ec697586103cfcd10a6650754.1920x1080.jpg?t=1617624455,https://cdn.akamai.steamstatic.com/steam/apps/686010/ss_64d2953160bd7ade2e65af77dd0973943de7494b.1920x1080.jpg?t=1617624455,https://cdn.akamai.steamstatic.com/steam/apps/686010/ss_dde623cc4aa92efff086d6f176642cf6bfd662ec.1920x1080.jpg?t=1617624455,https://cdn.akamai.steamstatic.com/steam/apps/686010/ss_92c229f1e1f3ea3e7cabbd3edef78c58ea9a5cf4.1920x1080.jpg?t=1617624455,https://cdn.akamai.steamstatic.com/steam/apps/686010/ss_8703a69b81b39e21a89711a56d7b2b1fed666483.1920x1080.jpg?t=1617624455,https://cdn.akamai.steamstatic.com/steam/apps/686010/ss_6c9816bffaa90e077e020fd463ec1c2a4683bb4d.1920x1080.jpg?t=1617624455,https://cdn.akamai.steamstatic.com/steam/apps/686010/ss_eeef183a7e01e0e14e3134369e18ebdd803221f9.1920x1080.jpg?t=1617624455,https://cdn.akamai.steamstatic.com/steam/apps/686010/ss_c50dadce76b0e4e4fdcb89309fad740cd0fb4d50.1920x1080.jpg?t=1617624455",
    "Slug": "the-hunt-rebuilt",
    "Meta Title": "The Hunt - Rebuilt: Sep 12, 2017, Peddler Games and Full ...",
    "Meta Description": "Looking for information on The Hunt - Rebuilt? Check out the release date (Sep 12, 2017), developer insights from Peddler Games, and a complete game sum...",
    "Alt Text Image": "Official header image for The Hunt - Rebuilt game - Steam 686010",
    "Canonical URL": "https://gusku.site/game/the-hunt-rebuilt",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Hunt - Rebuilt\", \"description\": \"Looking for information on The Hunt - Rebuilt? Check out the release date (Sep 12, 2017), developer insights from Peddler Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 12, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Peddler Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Peddler Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/686010/header.jpg?t=1617624455\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}