{
    "AppID": 67370,
    "Name": "The Darkness II",
    "Release date": "Feb 9, 2012",
    "About the game": "Inspired by the popular comic book series produced by Top Cow Productions, Inc., The Darkness II is an intense first person shooter that delivers a twisted and gripping narrative of tragedy, modern crime drama, and supernatural horror. Players will be taken down the brutal and personal path of Jackie Estacado, head of a New York crime family and wielder of an ancient and ruthless force of chaos and destruction known as The Darkness. It’s been two years since Jackie Estacado used The Darkness to kill the men responsible for his girlfriend’s murder. He’s been unable to shake the memory of Jenny’s death since bottling up his supernatural power and now The Darkness wants out. A sudden, unprovoked attack by a mysterious organization known as the Brotherhood heralds the start of a full-scale war and opens the door for The Darkness to reemerge, setting Jackie on a journey to hell and worse. Key Features 4-Player Co-op Campaign - Play as one of four unique characters each capable of wielding weapons infused with Darkness powers. Quad-Wielding Chaos - Slash, grab, and throw objects and enemies with the Demon Arms while simultaneously firing two weapons, adding a new dimension to the FPS category. Harness an Unstoppable Power - Master the Demon Arms and summon the powers of The Darkness for even more explosive gameplay. Kill the Lights - The vicious powers of The Darkness manifest only in the shadows so use the environment to your advantage and watch out for enemies who will use light as a weapon. Intense and Personal Journey - Experience a dark, twisted and gripping story written exclusively for the game by acclaimed comic book author Paul Jenkins whose credits also include The Incredible Hulk, Wolverine, and the original The Darkness game. Distinctive Graphic-Noir Style - Graphic novel shading and color combined with the dramatic lighting of film noir pays tribute to the source material and brings the pages of the comic series to life. Inspired by the popular comic book series created by Top Cow. Limited Edition Content If you pre-purchased The Darkness II you are exclusively entitled to the Limited Edition, which includes free digital editions of The Darkness: Origins Volumes 1 and 2, collecting the origin of Jackie Estacado and the Darkness by Garth Ennis and Marc Silvestri! Please visit and enter your code. You must login to your comiXology account, or create one, in order to redeem. Once redeemed, you can download your comics on your smartphone or tablet device, as well as read on the web!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/67370/header.jpg?t=1568914450",
    "Price": 4.49,
    "Developers": "Digital Extremes",
    "Publishers": "2K",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/67370/ss_5d39af28725c759d6c2feb3f2da01968806e68d9.1920x1080.jpg?t=1568914450,https://cdn.akamai.steamstatic.com/steam/apps/67370/ss_282ccfcd2bb1fd2f7d5b26cb504404fed7266805.1920x1080.jpg?t=1568914450,https://cdn.akamai.steamstatic.com/steam/apps/67370/ss_93fcd5f8c5bcb14cfa384071a7488b100c8f13ac.1920x1080.jpg?t=1568914450,https://cdn.akamai.steamstatic.com/steam/apps/67370/ss_f1564262919740f0b42a830aae5bd81f652ef3bd.1920x1080.jpg?t=1568914450,https://cdn.akamai.steamstatic.com/steam/apps/67370/ss_ae8f4c100922cd76eed4798aa706d944a9a78f87.1920x1080.jpg?t=1568914450,https://cdn.akamai.steamstatic.com/steam/apps/67370/ss_4bbd95b4154c945caf287bb7d48a8bb79e872b2b.1920x1080.jpg?t=1568914450,https://cdn.akamai.steamstatic.com/steam/apps/67370/ss_8091aa96dc0cf888afbaa7a30a018d9a398fdbb7.1920x1080.jpg?t=1568914450,https://cdn.akamai.steamstatic.com/steam/apps/67370/ss_541f2611cc2a1072a3aff5635a765fe78147e186.1920x1080.jpg?t=1568914450,https://cdn.akamai.steamstatic.com/steam/apps/67370/ss_dfaf1ac092021fc7968da87f5a91d17c0fc0c4c6.1920x1080.jpg?t=1568914450,https://cdn.akamai.steamstatic.com/steam/apps/67370/ss_c116b201c3364bfc3c013a3a65706e365cdd7a14.1920x1080.jpg?t=1568914450",
    "Slug": "the-darkness-ii",
    "Meta Title": "The Darkness II: Feb 9, 2012, Digital Extremes and Full O...",
    "Meta Description": "Looking for information on The Darkness II? Check out the release date (Feb 9, 2012), developer insights from Digital Extremes, and a complete game summ...",
    "Alt Text Image": "Official header image for The Darkness II game - Steam 67370",
    "Canonical URL": "https://gusku.site/game/the-darkness-ii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Darkness II\", \"description\": \"Looking for information on The Darkness II? Check out the release date (Feb 9, 2012), developer insights from Digital Extremes, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 9, 2012\", \"author\": {\"@type\": \"Organization\", \"name\": \"Digital Extremes\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"2K\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/67370/header.jpg?t=1568914450\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}