{
    "AppID": 730430,
    "Name": "This Is the President",
    "Release date": "Dec 6, 2021",
    "About the game": "This Is the President is a story driven management game. In the year 2020 you are elected to be the President of the United States of America. To escape justice for your past crimes as a shady multi-millionaire businessman, you need to ratify Amendment 28 which would grant lifetime immunity to any President. Manage your official and unofficial staff like a real mafioso in order to deal with all the old problems you’ve had in the past, as well as the shiny new problems that come with the office. You’ll battle with your competitors, the establishment, the media and even foreign leaders. In this political thriller-satire mix, the player's actions will inescapably lead to situations that escalate into absurd, terrifying, tragic and even ridiculous situations. But the road to lifelong immunity is full of pitfalls, and you’ll need to remember to clean up the daily messes that arise. Some might even call these distractions “presidential duties”. Score some easy points by price capping video games and banning online advertising. But why limit yourself to ads alone? Regulate the whole Internet -- your friends in China could use some help with censorship anyway. Or how about rescuing Russia’s president who’s been overthrown by his opponent? Sending a hamster into space is one of the more “reasonable” choices, right next to helping a serial killer escape prison. Of course your team members may dislike some of your decisions, but it doesn't always hurt to remind them who’s helping cover up their dirty little secrets. Things like gambling, alcohol and domestic violence, just to name a few. Thugs, hackers, journalists, lawyers: You’ll need a variety of talents, and no matter how differently they may feel about the nature of their work, there is no moral dilemma that cannot be solved with a juicy Christmas bonus from our charity fund. Americans can put their faith in their cute little 'separation of powers' all they want, but no-one can resist your methods of persuasion. Deep down they already know: Nothing can separate power from you. There’s only one way out. Change the fabric of the Constitution of the United States by persuading, blackmailing, bribing, and bullying a large part of the political system into granting you lifelong immunity. Manage your approval rating, cash and crew unlike any US President before – stay on top of your presidency by any means necessary Hold speeches, draft executive orders, manage daily crises, hold press conferences, and tweet better than any President before Hire a team of assassins, hackers, lobbyists, and other specialists. Send them on dangerous missions that can be solved by legal means. If that doesn’t work, send them on dangerous missions that can be solved by illegal means Experience a compelling interactive narrative with a wide variety of choices and story branches. Will you end your term on your terms, or are you just a pawn in a bigger game? Rule the country as a true mobster would with a shadow cabinet that is feared and respected on a global scale",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/730430/header.jpg?t=1640249252",
    "Price": 14.99,
    "Developers": "SuperPAC",
    "Publishers": "THQ Nordic",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/730430/ss_a26213bd562cf863455eb4c34f8a2957ed7d679f.1920x1080.jpg?t=1640249252,https://cdn.akamai.steamstatic.com/steam/apps/730430/ss_844ee426cebdeb545424bc1981179f674abf3858.1920x1080.jpg?t=1640249252,https://cdn.akamai.steamstatic.com/steam/apps/730430/ss_3c9ddb745cf77ebbcc8a93a6ccea056647bb2876.1920x1080.jpg?t=1640249252,https://cdn.akamai.steamstatic.com/steam/apps/730430/ss_109ed9f593dfd1f9d6d852fc783c65614e1ec4ad.1920x1080.jpg?t=1640249252,https://cdn.akamai.steamstatic.com/steam/apps/730430/ss_25584a761f15cddf30a32f5d916ddb2176e88319.1920x1080.jpg?t=1640249252,https://cdn.akamai.steamstatic.com/steam/apps/730430/ss_656053126f272c2e1431c13bdb7e2b47c95fad31.1920x1080.jpg?t=1640249252,https://cdn.akamai.steamstatic.com/steam/apps/730430/ss_8a35a0a0db0a66fcd3fd21ad890f5a4771382eae.1920x1080.jpg?t=1640249252",
    "Slug": "this-is-the-president",
    "Meta Title": "This Is the President: Dec 6, 2021, SuperPAC and Full Ove...",
    "Meta Description": "Looking for information on This Is the President? Check out the release date (Dec 6, 2021), developer insights from SuperPAC, and a complete game summary.",
    "Alt Text Image": "Official header image for This Is the President game - Steam 730430",
    "Canonical URL": "https://gusku.site/game/this-is-the-president",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"This Is the President\", \"description\": \"Looking for information on This Is the President? Check out the release date (Dec 6, 2021), developer insights from SuperPAC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 6, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"SuperPAC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"THQ Nordic\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/730430/header.jpg?t=1640249252\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}