{
    "AppID": 24010,
    "Name": "Train Simulator Classic",
    "Release date": "Apr 21, 2022",
    "About the game": "YOUR CLASSIC RAIL HOBBY Welcome to the ultimate railway hobby! Take to the tracks and control powerful iconic locomotives from around the world. Master complex operations on the DB BR 411 ICE T, BR Class 390 Pendolino, Union Pacific AC4400CW, and more as you explore authentic routes. Whatever you love about trains, Train Simulator Classic lets you take your hobby to the next level. Bahnstrecke Leipzig - Dresden The new Leipzig - Riesa route extension adds an additional 65 km to the popular Riesa - Dresden route, making it a whole new experience as you drive the full 120km Bahnstrecke Leipzig - Dresden, as well as through the modern Leipzig City Tunnel! Lean your way into Dresden with the DB BR 411 ICE T, sporting the latest climate-positive branding, or serve the locals of Leipzig with the striking silver S-Bahn Mitteldeutschland DB BR 442. WCML South: London - Birmingham New Street Experience the pinnacle of high-speed travel in the UK and bustling commuter services with WCML South: London Euston - Birmingham. Go the distance in striking Avanti units, the sleek electric BR Class 390 Pendolino and versatile diesel BR Class 221 Super Voyager, tackle the rush hour aboard the reliable BR Class 350 Desiro, dressed for London Midland duty, or get a taste of orange with London Overground’s BR Class 378 Capitalstar. Tehachapi Pass: Mojave - Bakersfield Legendary and rugged, the 68-mile Tehachapi Pass does battle with the challenging mountains of California, offering a vital freight path between the Arid Mojave and the fertile San Joaquin Valley. A heavy tonnage artery for both Union Pacific and BNSF, Tehachapi Pass sees a steady flow of intermodal, unit train, and manifest freight traffic, tackling twisting grades of 2.2 percent with the use of potent diesels such as the AC4400CW and ES44DC. DRIVE The unparalleled authenticity of the locomotives in Train Simulator Classic means you are truly in control. Manage your engine, passengers, safety systems, signalling and much more from the comfort of the cab, with control boards that perfectly re-create the operations of real trains. LEARN Enter the TS Academy and begin your career as a virtual train driver or engineer. Whether it’s Electric, Diesel or Steam you will learn to operate some of the world’s most amazing rail-bound machines. CREATE Use the Train Simulator Editor to build living worlds with easy-to-use comprehensive tools. Create your own railway and share with other players with the Steam Workshop or check out the thousands of community creations already available with comprehensive in-game search functions. COLLECT Build a dream set of routes, locomotives, trains, route extensions, and rolling stock with a vast array of content on the Steam store. With hundreds of add-ons available, whatever your interest, you’ll find something new to expand your collection at your own pace.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/24010/header.jpg?t=1658409119",
    "Price": 24.99,
    "Developers": "Dovetail Games",
    "Publishers": "Dovetail Games - Trains",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/24010/ss_c9a8c7f5f6218ac0b7b77ab04aa6c703f50da919.1920x1080.jpg?t=1658409119,https://cdn.akamai.steamstatic.com/steam/apps/24010/ss_824277936a9e26ccbf9538575660ec3ce0215923.1920x1080.jpg?t=1658409119,https://cdn.akamai.steamstatic.com/steam/apps/24010/ss_99d418c4e5712edb2caa7218f26198dab84c650e.1920x1080.jpg?t=1658409119,https://cdn.akamai.steamstatic.com/steam/apps/24010/ss_14e28101a557678b234410f1a8671a84652e3c6b.1920x1080.jpg?t=1658409119,https://cdn.akamai.steamstatic.com/steam/apps/24010/ss_66351752175c38a3d34113aa5c585da65738532d.1920x1080.jpg?t=1658409119,https://cdn.akamai.steamstatic.com/steam/apps/24010/ss_5bb05d4aee7739609c1cd34b099848bc2b71661b.1920x1080.jpg?t=1658409119,https://cdn.akamai.steamstatic.com/steam/apps/24010/ss_0019f8c7f73ba5a4d7a50616131e921c891a80b5.1920x1080.jpg?t=1658409119,https://cdn.akamai.steamstatic.com/steam/apps/24010/ss_75af0827597e9c6a73e55beab24d7024a48eef92.1920x1080.jpg?t=1658409119,https://cdn.akamai.steamstatic.com/steam/apps/24010/ss_523d4f411b67920f8c7f2c824d59a17626e42fff.1920x1080.jpg?t=1658409119",
    "Slug": "train-simulator-classic",
    "Meta Title": "Train Simulator Classic: Apr 21, 2022, Dovetail Games and...",
    "Meta Description": "Looking for information on Train Simulator Classic? Check out the release date (Apr 21, 2022), developer insights from Dovetail Games, and a complete ga...",
    "Alt Text Image": "Official header image for Train Simulator Classic game - Steam 24010",
    "Canonical URL": "https://gusku.site/game/train-simulator-classic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Train Simulator Classic\", \"description\": \"Looking for information on Train Simulator Classic? Check out the release date (Apr 21, 2022), developer insights from Dovetail Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games - Trains\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/24010/header.jpg?t=1658409119\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}