{
    "AppID": 784150,
    "Name": "Workers & Resources: Soviet Republic",
    "Release date": "Mar 15, 2019",
    "About the game": "Manage all aspects of your own republic with planned economy, including mining resources, manufacturing goods, construction, investments, and citizens too. Create your own industrial complexes with loading and unloading stations, storage, warehouses, and factories. Build the infrastructure and manage its traffic , including roads, railways, sidewalks, conveyors, wiring, and pipelines. Wisely place and connect factories, houses and warehouses, and make the most efficient connections. Plan and build the living areas with everything your citizens may need to live their happy life, such as playgrounds, cinema s, taverns, and shops. Send your citizens to the mine to get coal, iron and other natural resources; or send them to the fields to pick up the crops; or take them to factories to produce manufactured goods. Sell and purchase resources and goods from western countries or other soviet countries to get dollars or rubles and buy the products or resources you need ... or invest in new infrastructure or buildings. Enjoy authentic soviet buildings and vehicles , as well as realistic landscapes of the 60's to the 90's. Play the way you want! You can focus on getting natural resources or products and trade them for money; or you can build a self-sufficient republic; or you can just use the easy sandbox mode with unlimited money/resources and just enjoy building something live. Economic simulation. Prices of resources on the global market are changing over time as you play –one day you can sell or purchase steel for a $100 per ton, but in a few months the cost can rise to $200 or decrease to $50. The price of everything is connected to the cost of work and resources. Increasing difficulty. As prices change, the demands of the citizens also change, and you will need more resources to keep them happy and force them to work. TRANSPORTATION You have many options for how you will manage resources and goods transportation. If you get raw iron ore from a mine, you need to process it. Then you need to transport it somehow into a steel mill to produce steel. You can build the processing plant and steel mill near to the mine and transport it all by conveyors, or you can transport iron ore into a steel mill by train fora longer distance. It is up to you to decide from where the workers will go into the factories. You can create residential zones and transport workers by buses or trains to industrial areas. You can also build residential buildings near the factories so that workers will able to walk to the factory. But don't forget that a worker will need to purchase food and enjoy their free time, so again it is up to you to decide whether to build those facilities near their home or whether you will transport them somehow to shops or places to spend their free time. RESOURCES &amp; INDUSTRY There are, right now, over 30 commodities you can mine, transport and manufacture. If you want to get clothes you will first need to get resources to create a fabric, then you will need a clothing factory where the clothes will be manufactured from this fabric. You can then transport the finished clothes into shops where your citizens can buy them. Every commodity has a specific requirement,so if you would like to load oil into the tank train-car you will need a special pumping loading station. If you need to load gravel into a dumper truck you need a special loading station where the gravel comes from conveyors into the truck. Liquid resources like oil or fuel can be stored only in tanks, while resources like wood, steel, or prefabricated concrete panels can be stored outside in the open space. Using a crane for these will increase loading/unloading speed. Goods like clothes, food, etc. can be stored in warehouses. WORKERS AND THEIRS DEMANDS Every worker/citizen goes to work each day. If they work for you, they have demands. At the start of the game they are satisfied just with food, but as a time goes on they may have more demands like meat, clothes, alcohol or electronics. Also, to have happy workers you need places where they can spend their leisure time – cinema, playgrounds, taverns, etc. Every worker has an education level. They can go to school or college to improve this level. If their education is too low they cannot work; if their education is high enough they can be a teacher, or researcher, or work in factories with special requirements. ECONOMY SIMULATION The game simulates the economy system. There are no fixed prices! Costs of everything are defined by the economic situation. For example, the cost of steel is calculated from the price of iron, coal and work, and also partially from the cost of steel mill construction. You purchase or sell commodities for money (dollars or rubles). But be careful, as it is possible that if you buy or sell for high values you will affect the price of the commodity on the market. You may be able to purchase for a higher price or sell it cheaper. As time increases, so does complexity. Some resources or products may become more expensive (as, for example, less human work is needed with advanced technologies), so later with more complexity, it may be necessary to be as self-sufficient as possible.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/784150/header.jpg?t=1652709822",
    "Price": 34.99,
    "Developers": "3Division",
    "Publishers": "3Division",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_7fc8a4df1d020c2245f510cdd05897ee08565980.1920x1080.jpg?t=1652709822,https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_b0956768592b79f3b5375124aa7e7b19a3edb2dd.1920x1080.jpg?t=1652709822,https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_2f686d5b9f566a4253542bfe8321fc856997bd75.1920x1080.jpg?t=1652709822,https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_83ce2c1679b03523b8b3f123d143e8ed5f803291.1920x1080.jpg?t=1652709822,https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_c5dc8d2a62c930278f630c28fe65c225a075ac23.1920x1080.jpg?t=1652709822,https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_8f0df2ee89be6332621c1eaa195f781cadee187f.1920x1080.jpg?t=1652709822,https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_141303487178b4628804180716f17ef79b01b8ae.1920x1080.jpg?t=1652709822,https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_b24600f473c7645cee7871408a1fa4173c0381e8.1920x1080.jpg?t=1652709822,https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_24754c56920d4476f660a28e8b92cf381a5fa7da.1920x1080.jpg?t=1652709822,https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_a89cdc4300f30d248eeaf299cc87f2dcdb0c91a5.1920x1080.jpg?t=1652709822,https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_64d3b82ce49ec46c1466b944ee9f5e1f5bfb60f7.1920x1080.jpg?t=1652709822,https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_d11b916e0b476dd98dde8c40bd8ac0b47f4f0fec.1920x1080.jpg?t=1652709822,https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_f4e562754f330a8fa0bf759534df4cbdc5ddbaac.1920x1080.jpg?t=1652709822,https://cdn.akamai.steamstatic.com/steam/apps/784150/ss_4f310c5d5ed5b5a1f8fbcb9be53d0f7874ec006b.1920x1080.jpg?t=1652709822",
    "Slug": "workers-resources-soviet-republic",
    "Meta Title": "Workers & Resources: Soviet Republic: Mar 15, 2019, 3Divi...",
    "Meta Description": "Looking for information on Workers & Resources: Soviet Republic? Check out the release date (Mar 15, 2019), developer insights from 3Division, and a com...",
    "Alt Text Image": "Official header image for Workers & Resources: Soviet Republic game - Steam 784150",
    "Canonical URL": "https://gusku.site/game/workers-resources-soviet-republic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Workers & Resources: Soviet Republic\", \"description\": \"Looking for information on Workers & Resources: Soviet Republic? Check out the release date (Mar 15, 2019), developer insights from 3Division, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 15, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"3Division\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"3Division\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/784150/header.jpg?t=1652709822\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}