{
    "AppID": 422140,
    "Name": "Wrestling Spirit 3",
    "Release date": "Dec 9, 2015",
    "About the game": "Wrestling Spirit, created by Total Extreme Wrestling developer Adam Ryland, allows you to take control of the career of a professional wrestler, guiding him through the world title wins, the tough matches, and the rivalries. You control each match, negotiate contracts, manage personal finances, deal with injuries, and navigate all the backstage politics in this text-based professional wrestling role-playing simulation. The accurate simulation engine and realistic AI offers up an extremely unique and immersive wrestling experience. Match Features Realistic opponent AI: Wrestlers fight in a natural manner. Lightweights come off the top rope at regular intervals. Technical workers will tie you up in knots on the mat and try to squeeze you into submission. 500 pound giants will simply batter you with strikes and slams. Varied move sets for workers: Each worker has a huge amount of moves of various styes: strikes, grapples, corner, ground, air, rebound off the ropes, and rope moves (planchas and springboards). This gives wrestlers very unique offensive choices no matter where they are in the ring (or outside). Realistic simulation of physical condition: Working body parts has a very real effect on the match. Working a wrestler's legs will not only soften him up for submissions, but will also make him unable to utilize any of his own moves that rely on leg strength. Realistic simulation of time: As the match progresses, wrestlers get tired and they start to make mistakes. The speed of their weakening is based on their stamina levels, meaning highly conditioned professionals will have major advantages over fat out-of-shape brawlers as the match goes on. Match statistics: At any point in the match you can view an amazing array of stats, from the percentage of time you've been on the attack, to how many of each type of move you've attempted, to the amount of counters you've executed. You can also view a log of every move, counter, and action performed so far, so you can see where your weaknesses are. Outside forces: External factors can play a big part in matches. Ref bumps? Chairs? Tables? Blood? Run-ins? Pre-match attacks? All included. Career Features Training: Define exactly how you want to train so you can customize exactly where you want your character to focus his efforts, perfecting the areas you want to perfect. Morale: Your character has wants and needs that you must satisfy. If he becomes too unhappy, he'll leave wrestling, ending your career. These include things like financial needs, meaning that you may need to make tough choices about where you work in order to pay the bills! Backstage: Talk to other wrestlers before the show; form friendships, make enemies, get into fights, or keep to yourself. Politics: The relationships that you form can affect how your career is shaped. Strong allies can get you opportunities you'd never get otherwise, while enemies can be out to screw you over. Tryout matches: Promotions may give you a match to prove yourself worthy. Feel the pressure as you engage in a make-or-break match with a superior opponent! Look for work: You can approach promotions to look for work, or they can come to you if you're in demand. Creative meetings: Call a meeting with the company to discuss your creative direction, such as requesting managers, feuds, or new tag team partners. Game Features Exhibition match feature: Play against a friend or the computer with any worker in any style of match. Fully active game world: Every promotion in the world continues doing business, regardless of whether you work for them or not. Wrestlers will move around, have matches, and win titles, making a constantly evolving game world for you to explore. Full in-game, easy-to-use editor, which can be used to edit just about everything in the game! Full match history for every wrestler in the game. Full title history for every belt and wrestler in the game. Full results history for every promotion in the game. Seven different game areas: USA, Canada, Mexico, Japan, UK, Australia and Europe.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/422140/header.jpg?t=1449695108",
    "Price": 19.99,
    "Developers": "Grey Dog Software",
    "Publishers": "Viva Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/422140/ss_d922a14d220482577e5df95fed10315be22585f6.1920x1080.jpg?t=1449695108,https://cdn.akamai.steamstatic.com/steam/apps/422140/ss_fd45fa53800e01cf9761b44b658537e55196a789.1920x1080.jpg?t=1449695108,https://cdn.akamai.steamstatic.com/steam/apps/422140/ss_44ba402130a6b823f46879b2e8aeb49c398e8b66.1920x1080.jpg?t=1449695108,https://cdn.akamai.steamstatic.com/steam/apps/422140/ss_209dfe344885aed3e064bf9a007144c2d37523e1.1920x1080.jpg?t=1449695108,https://cdn.akamai.steamstatic.com/steam/apps/422140/ss_cb3abe661fcdcef132d6753e175f9bdc8d27d5fd.1920x1080.jpg?t=1449695108,https://cdn.akamai.steamstatic.com/steam/apps/422140/ss_d922a14d220482577e5df95fed10315be22585f6.1920x1080.jpg?t=1449695108,https://cdn.akamai.steamstatic.com/steam/apps/422140/ss_fd45fa53800e01cf9761b44b658537e55196a789.1920x1080.jpg?t=1449695108,https://cdn.akamai.steamstatic.com/steam/apps/422140/ss_44ba402130a6b823f46879b2e8aeb49c398e8b66.1920x1080.jpg?t=1449695108,https://cdn.akamai.steamstatic.com/steam/apps/422140/ss_209dfe344885aed3e064bf9a007144c2d37523e1.1920x1080.jpg?t=1449695108,https://cdn.akamai.steamstatic.com/steam/apps/422140/ss_cb3abe661fcdcef132d6753e175f9bdc8d27d5fd.1920x1080.jpg?t=1449695108",
    "Slug": "wrestling-spirit-3",
    "Meta Title": "Wrestling Spirit 3: Dec 9, 2015, Grey Dog Software and Fu...",
    "Meta Description": "Looking for information on Wrestling Spirit 3? Check out the release date (Dec 9, 2015), developer insights from Grey Dog Software, and a complete game ...",
    "Alt Text Image": "Official header image for Wrestling Spirit 3 game - Steam 422140",
    "Canonical URL": "https://gusku.site/game/wrestling-spirit-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wrestling Spirit 3\", \"description\": \"Looking for information on Wrestling Spirit 3? Check out the release date (Dec 9, 2015), developer insights from Grey Dog Software, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 9, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Grey Dog Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Viva Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/422140/header.jpg?t=1449695108\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}