{
    "AppID": 1402120,
    "Name": "9 Years of Shadows",
    "Release date": "Mar 27, 2023",
    "About the game": "9 Years of Shadows is a side-scrolling Metroidvania by Halberd Studios. Travel alongside Europa, a brave warrior determined to enter the mechanical giant Talos and stop the corruption within before it swallows the world in darkness. Battle through tainted creatures, meet charismatic musicians and uncover the truth behind the curse that robbed the land of all color. Many have tried to venture inside the twisted depths of Talos, a dormant fortress where several civilizations have settle over centuries. And, after losing everything she held dear, Europa has nothing holding her back from attempting what others could not achieve. As a noble fighter who refuses to be bound by the curse, she must enter the castle, find the source of corruption, and return the color once and for all. This adventure is not for Europa to face alone. Inside the giant, she befriends Apino, a cute floating bear who seems to possess magical abilities that can restore color and replenish the health of his allies. He is also able to shield his companions from the multiple dangers that roam Talos’ hallways. While exploring the castle, Apino can cleanse the corruption around Talos and shoot a variety of projectiles that can destroy dark crystals and inflict damage: A fist that punches upwards when conjured. A blast that travels along a surface until colission A cyclone that returns to Apino like a boomerang. Use the elements to your advantage to travel the map dynamically. Acquire the elemental armors that were once treasures to ancient civilizations and change on the fly and unlock special abilities to traverse your way: from swimming against waterfalls to traveling underground tunnels or gliding through warm air currents. Harness the power of lightning, water, earth, and fire. Surprise bosses while you switch armors, perform strong halberd combos, and exploit your foes’ weaknesses to pave your way through the heart of the shadows. Music is all but the soul of the game. Revitalize the world while you listen to a moving soundtrack composed by Miguel Hasson, as well as soothing pieces scored in 432hz by celebrated composers Michiru Yamane (Castlevania series) and Norihiko Hibino (Metal Gear Solid series). Meet these guest composers as in-game NPCs who aid in Europa’s quest throughout the game. Music is the binding thread that combines gameplay and storytelling: collect musical notes and perform a healing lullaby to restore your health.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1402120/header.jpg?t=1680118481",
    "Price": 19.99,
    "Developers": "Halberd Studios",
    "Publishers": "Freedom Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1402120/ss_b0a1f66a2484184dda7ad0cc131b79f149b05872.1920x1080.jpg?t=1680118481,https://cdn.akamai.steamstatic.com/steam/apps/1402120/ss_5917dcfcc016b9d0372a7f76b234428c63ff08b0.1920x1080.jpg?t=1680118481,https://cdn.akamai.steamstatic.com/steam/apps/1402120/ss_d8681a8c857a775b6a27a608f569e52a008da23b.1920x1080.jpg?t=1680118481,https://cdn.akamai.steamstatic.com/steam/apps/1402120/ss_1ae2c94096e7e78f080afe116dfc4f50f98503f9.1920x1080.jpg?t=1680118481,https://cdn.akamai.steamstatic.com/steam/apps/1402120/ss_d9d52813f7eab230ff407d235480591e6be33c9b.1920x1080.jpg?t=1680118481,https://cdn.akamai.steamstatic.com/steam/apps/1402120/ss_c4e7388bac00336e76ff6318a3a0373f5b467691.1920x1080.jpg?t=1680118481,https://cdn.akamai.steamstatic.com/steam/apps/1402120/ss_13d741931259c0279fc4f0a7e7472d76517e6403.1920x1080.jpg?t=1680118481",
    "Slug": "9-years-of-shadows",
    "Meta Title": "9 Years of Shadows: Mar 27, 2023, Halberd Studios and Ful...",
    "Meta Description": "Looking for information on 9 Years of Shadows? Check out the release date (Mar 27, 2023), developer insights from Halberd Studios, and a complete game s...",
    "Alt Text Image": "Official header image for 9 Years of Shadows game - Steam 1402120",
    "Canonical URL": "https://gusku.site/game/9-years-of-shadows",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"9 Years of Shadows\", \"description\": \"Looking for information on 9 Years of Shadows? Check out the release date (Mar 27, 2023), developer insights from Halberd Studios, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 27, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Halberd Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Freedom Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1402120/header.jpg?t=1680118481\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}