{
    "AppID": 2103620,
    "Name": "Age of Gladiators Reforged",
    "Release date": "Mar 27, 2023",
    "About the game": "Age of Gladiators Reforged is a remaster of the original Age of Gladiators released in 2016. A Potential Scenario You’re almost out of money. Two more days and you will no longer be able to pay your staff or gladiators. The fight scheduled today will draw exceptionally massive crowds, meaning the fight purse will be bountiful and the opportunity to place a large volume of bets will be high. One problem though: your top fighter is fatigued from his last fight and has a nagging shoulder strain. Plus he has a history of concussions, so it’s fair to say he will not be at full strength if you put him in the arena. But he’s the best you’ve got. The rest of your gladiators are rookies yet; still working with your trainers and far too inexperienced to send into the crucible just yet. The next fight is a week away and poorly hyped. You cannot wait that long. If you were of an evil disposition, you could execute your top fighter instead and seize his life savings; with the fight purses you have shared with him through his career, he has amassed a lot of gold. It could keep you going for a month or two - maybe more. Something to consider. Or if you find that distasteful, you could go to the money lenders instead. But their interest rates have been high these last few days: 30% or more. You could finance present operations with that – but you would suffer in the longer term. So maybe you should send your top fighter into the arena. He is bruised up and fatigued – but he also is ranked 3rd overall by the so-called experts and pundits of Leptis Magnus, the current city you reside in. You know he is one of the best and might still have a good chance at pulling out a win. Or he could lose his life. What do you do? What Is It? Age of Gladiators Reforged is a single-player strategy/business management sim set at the height of the bloody gladiatorial games in ancient Rome. Hire scouts to scour the provinces for potential prospects – once you have recruited your gladiators, you will need to manage their morale and personality while equipping them for battle in the arenas. Recruit support staff, upgrade your stables, partake in side missions, and manage the wealth and reputation of your business as it grows each day. As your fighters win battles and increase in level, it will be up to you to decide how to focus their abilities by spending attribute and expertise points. Compete, trade, and interact with other in-game bosses as you work your way up from the starting provinces in Africa to the grand coliseum of Rome herself! Features: Gladiators are born with their own dynamically generated attributes (strength, agility, stamina, dexterity, reflexes, intelligence, and health), weapon specialties, and personalities. It is up to you to hire scouts to locate the best prospects available for recruitment. Manage your stable of gladiators carefully – their morale, greed, injuries, fatigue, and more must be taken into account before sending them to battle. The physicality of your gladiators will increase or decrease with age, depending on if they are in their prime or declining. Fame system: as your gladiators gain glory from battle, they will become more widely recognized and adored by the crowds. Win enough battles and they may even get voted into the gladiatorial hall of fame after they retire (or die). Watch as your fighters climb the all-time records list for wins, kills, and fame - all held by retired and still-active legends in the arena. As your gladiators level up, they gain points to spend on their attributes and expertise. Expertise allows you to build and customize your fighter according to their appropriate strengths. Purchase, sell, or trade fighters with opposing bosses. Rob treasuries, kidnap enemy fighters, assassinate your debt holders and more with the quest system. Increase the odds of success by sending gladiators on the mission as well. Search for deals on weapons, armor, and money loans on the marketplace. Hire staff such as scouts, doctors, trainers and blacksmiths to help your gladiators achieve victory. Your staff will gain experience each day they are employed. Upgrade your stable by improving its food, bedding, shelter, and more. Strive to become the wealthiest individual in the entire Roman republic. There are quick and underhanded ways to make money, but your reputation and fighter’s morale may suffer as a result. Receive taunting letters from opposing bosses as well as various other messages from your fighters, staff members, and different characters as you progress through the game. Rename your gladiators in order to increase your attachment toward them. Bet for or against your gladiator based on the odds generated by bookmakers in-game. Fight purses and betting is based on the hype associated with each match. The greater the hype, the more lucrative the fight purse and betting market will be - but the opposition will also be tougher. Each game is dynamically generated and different each time. Other Age of Gladiators Reforged is a twist on sports front office games like Out Of The Park Baseball or the Football Manager series. To continue the analogy, it was designed for people more interested in the strategy behind building up teams and players as a general manager rather than running the games tactically as coach. As well, the strategy element should appeal to fans of Paradox and other franchises in that genre.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2103620/header.jpg?t=1679930107",
    "Price": 6.79,
    "Developers": "Creative Storm Entertainment",
    "Publishers": "Creative Storm Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_61229aaae254403f4cd7fedc87ff3606e2c4a279.1920x1080.jpg?t=1679930107,https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_4514e4b0f7ee40180a033ea59de76ad06944c7b6.1920x1080.jpg?t=1679930107,https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_6bacc338999a1b792b9ce5ad730d8d2ce7cfd73b.1920x1080.jpg?t=1679930107,https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_b1f4e2896ae12a302f5f85ffadf3f6ccaf867a18.1920x1080.jpg?t=1679930107,https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_8e3eb6991244c73eb5902b58c8a150d8f0767254.1920x1080.jpg?t=1679930107,https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_5f8ae4919a6cad4851afa542886b5051c98edc0a.1920x1080.jpg?t=1679930107,https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_b323ad4190cda073b4bae48cb28d1f5f296a3ba8.1920x1080.jpg?t=1679930107,https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_1dd87ed5536069fd946ca63da2cdf57259c39fb7.1920x1080.jpg?t=1679930107,https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_acdd755ff9781cff3afc97c9cb7c532664336144.1920x1080.jpg?t=1679930107,https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_c33bea195e6f26fce3d163ea9d7ebf1a1de99d82.1920x1080.jpg?t=1679930107,https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_d3c4f1131b38448ea2957b5575bb652833cd7cc8.1920x1080.jpg?t=1679930107,https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_d3aa2bb4dd8e8dcef9654b1595ece7b2c4f0d40e.1920x1080.jpg?t=1679930107,https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_94a95a986671423b5787f9f1fb09a6d705e77fa4.1920x1080.jpg?t=1679930107,https://cdn.akamai.steamstatic.com/steam/apps/2103620/ss_6b184732b61e8dbcda780935ce9b8a27a28805e2.1920x1080.jpg?t=1679930107",
    "Slug": "age-of-gladiators-reforged",
    "Meta Title": "Age of Gladiators Reforged: Mar 27, 2023, Creative Storm ...",
    "Meta Description": "Looking for information on Age of Gladiators Reforged? Check out the release date (Mar 27, 2023), developer insights from Creative Storm Entertainment, ...",
    "Alt Text Image": "Official header image for Age of Gladiators Reforged game - Steam 2103620",
    "Canonical URL": "https://gusku.site/game/age-of-gladiators-reforged",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Age of Gladiators Reforged\", \"description\": \"Looking for information on Age of Gladiators Reforged? Check out the release date (Mar 27, 2023), developer insights from Creative Storm Entertainment, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 27, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Creative Storm Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Creative Storm Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2103620/header.jpg?t=1679930107\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}