{
    "AppID": 2336600,
    "Name": "ALPEN GHOUL: Prologue",
    "Release date": "Mar 20, 2023",
    "About the game": "Run. Hide. Slide. You’re going to need to play smart and tread lightly if you plan on making it to the top of this mountain. An untold horror haunts these lonely trails, stalking your every move. Each ascending step brings you closer to your goal and even closer to death. And die you shall, more than once, in your quest to explore further, hide more effectively and slide to safety only when necessary. ALPEN GHOUL is an exploration/stealth game. Your goal is to reach the summit alive, but you are not alone. You are being hunted by a creature freely roaming the map using non-linear paths. Moving too quickly and making too much noise assures a quick and brutal end to your journey at the hands of your pursuer, so play smart and move with purpose. A flashlight will help light your way, but will also light the way to you, so use it with caution. When the creature finds you, and it will find you, escape may still be possible by way of sliding down the treacherous mountainside: the only way to move faster than the creature in the game. The price of a speedy descent is high, however, since you won’t just leave behind the creature… but some of your progress as well. Choose wisely. Multiple routes through varying terrain present different difficulty levels, with trees serving as a general guide toward a less dangerous path. All roads eventually lead to the top, but an appetite for danger does come with rewards. More difficult areas may hide Secret Tapes that can be played in Safe Rooms scattered throughout the map. The creature is fast, intelligent and grows evermore agitated by your continued survival. It’s up to you to learn from your mistakes and reach the summit in one piece. What horror lurks within the mountain? Can you even survive long enough to find it? ALPEN GHOUL: Prologue is hard by design. Player experimentation, frustration, discovery and hopefully mastery are all part of the experience. If you do find yourself struggling and want a bit of help, check out the DEV TIPs video at the top of the page. Good luck! It's going to be difficult, but I believe in you! You can contact us at brocboisgames@gmail.com",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2336600/header.jpg?t=1679495506",
    "Price": 0.0,
    "Developers": "BrocBois",
    "Publishers": "BrocBois",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2336600/ss_54eb8f7d2ac963743315ff4bd223ce47fe611b24.1920x1080.jpg?t=1679495506,https://cdn.akamai.steamstatic.com/steam/apps/2336600/ss_b5690a2e1d4ade57287256fd7962a82b7d5d7274.1920x1080.jpg?t=1679495506,https://cdn.akamai.steamstatic.com/steam/apps/2336600/ss_1ae129076aa919e6ca124ebb5fb8bfeacf29fe16.1920x1080.jpg?t=1679495506,https://cdn.akamai.steamstatic.com/steam/apps/2336600/ss_99e41fa9e8d279acc543f65651bdc08b1f614c25.1920x1080.jpg?t=1679495506,https://cdn.akamai.steamstatic.com/steam/apps/2336600/ss_1a89043228f0e285b77746977a8c8f15d1d61baa.1920x1080.jpg?t=1679495506,https://cdn.akamai.steamstatic.com/steam/apps/2336600/ss_8eff868e126c4aa68df1a0125c12ee2087fe53d6.1920x1080.jpg?t=1679495506",
    "Slug": "alpen-ghoul-prologue",
    "Meta Title": "ALPEN GHOUL: Prologue: Mar 20, 2023, BrocBois and Full Ov...",
    "Meta Description": "Looking for information on ALPEN GHOUL: Prologue? Check out the release date (Mar 20, 2023), developer insights from BrocBois, and a complete game summary.",
    "Alt Text Image": "Official header image for ALPEN GHOUL: Prologue game - Steam 2336600",
    "Canonical URL": "https://gusku.site/game/alpen-ghoul-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ALPEN GHOUL: Prologue\", \"description\": \"Looking for information on ALPEN GHOUL: Prologue? Check out the release date (Mar 20, 2023), developer insights from BrocBois, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 20, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"BrocBois\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BrocBois\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2336600/header.jpg?t=1679495506\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}