{
    "AppID": 2257840,
    "Name": "Arena Story～Rouge And Princess Knight～",
    "Release date": "Mar 16, 2023",
    "About the game": "In this gladiatorial arena filled with demons, help them escape! For various reasons, they come to the gladiatorial arena where they can get their wishes, and they keep fighting! The gladiatorial arena is filled with people of different races, demons, or anything else. If you lose, you lose everything, and if you win at the end, you can get everything. Can you get the ultimate victory? Rougelite x Tower Climbing x Dice Battles ・Gladiatorial Tales is a light meat pigeon game that uses dice for combat. ・The game requires you to collect different dice face skills as well as oddities to defeat increasingly powerful enemies, with the goal of winning the ultimate victory to leave the gladiatorial arena. Thieves cat girl, or Princess Knight? ・Two protagonists have completely different skills, strange object system, choose a different protagonist will bring a very different game experience. ● Alice Growing up under fire, wandering the shady streets, doing bad things by the bucketful, naughty little wildcat. The little wildcat that pissed off the big man and shed bright red blood, cowering by the garbage cans in the alleys, drenched by the rain. Willing to do whatever it takes if it can live, the savage fire of survival burns the pants of passersby. 'Is it ......' the storyteller stopped in his tracks, 'It would be a shame to die like that. The prize for winning is life, money, endless food, a big luxurious house, and failure ...... Alis has no room to think about failure. So she put on the not-so-worn equipment for the first time and began to struggle in the cruel cage. ● OLivia The kingdom was overthrown and the princess did not die in battle, ah ah, what a misfortune. The smell of the dampness of the dungeon followed her, and the drama of torture was played out daily. But insults and pain did not break her arrogance, and the princess knight still held on to her useless pride. Finally, in the day after day of torture, she gradually became weak, healing magic can not be repaired, the flower of the knight is about to die in the darkness. 'Is it ......' the storyteller stopped talking, 'such an ending is not too boring. The prize for winning is life, freedom, the chance of revenge, the flame of hope for the revival of the kingdom, and failure is nothing more than a return to hell. So she put on her ridiculous armor and began to struggle in the cruel cage. Repeatable play! Variety of dice surface skills and collectibles combinations ・Light meat pigeon elements allow you to encounter a variety of skills and collectibles as you play, each game is different, make your choices and challenge the levels with your unique combinations. ・Use the unique dice surface construction system to create invincible dice to your heart's content! RougeLike beginners are also OK! ・You can always save before the battle starts Note that if you lose a battle in the middle of the course, you can't re-challenge by auto-archiving, except for the boss level. ・All in all, be diligent about saving.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2257840/header.jpg?t=1679015957",
    "Price": 8.09,
    "Developers": "Kokutou Umeboshi",
    "Publishers": "Kokutou Umeboshi",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2257840/ss_fda03504ba40819c16ce687274e36f8ad523c2b1.1920x1080.jpg?t=1679015957,https://cdn.akamai.steamstatic.com/steam/apps/2257840/ss_f0a1d80d88673809a80e4e965a004965a9718eec.1920x1080.jpg?t=1679015957,https://cdn.akamai.steamstatic.com/steam/apps/2257840/ss_e5e229ca5c19c9256eabd86bcb1dfbb691c594cb.1920x1080.jpg?t=1679015957,https://cdn.akamai.steamstatic.com/steam/apps/2257840/ss_ec3119966bb52362a825655df3562293b7a602d3.1920x1080.jpg?t=1679015957,https://cdn.akamai.steamstatic.com/steam/apps/2257840/ss_4862f5dcd9be3acb9db3e5610db20c35c113f6b9.1920x1080.jpg?t=1679015957,https://cdn.akamai.steamstatic.com/steam/apps/2257840/ss_706274f196e5abf996fe1a12ae1b4fab9c34064a.1920x1080.jpg?t=1679015957,https://cdn.akamai.steamstatic.com/steam/apps/2257840/ss_19b16f4eeea304d33e6ec27701a599fd26c08939.1920x1080.jpg?t=1679015957",
    "Slug": "arena-storyrouge-and-princess-knight",
    "Meta Title": "Arena Story～Rouge And Princess Knight～: Mar 16, 2023, Kok...",
    "Meta Description": "Looking for information on Arena Story～Rouge And Princess Knight～? Check out the release date (Mar 16, 2023), developer insights from Kokutou Umeboshi, ...",
    "Alt Text Image": "Official header image for Arena Story～Rouge And Princess Knight～ game - Steam 2257840",
    "Canonical URL": "https://gusku.site/game/arena-storyrouge-and-princess-knight",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Arena Story\\uff5eRouge And Princess Knight\\uff5e\", \"description\": \"Looking for information on Arena Story\\uff5eRouge And Princess Knight\\uff5e? Check out the release date (Mar 16, 2023), developer insights from Kokutou Umeboshi, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 16, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kokutou Umeboshi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kokutou Umeboshi\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2257840/header.jpg?t=1679015957\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.09, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}