{
    "AppID": 2202710,
    "Name": "Athenian Rhapsody: Thunder Goober's Personality Dungeon",
    "Release date": "Mar 23, 2023",
    "About the game": "Athenian Rhapsody: Thunder Goober's Personality Dungeon is a FREE standalone experience from the world of Athenian Rhapsody which is to serve as a demo for the full game. Athenian Rhapsody is a fresh comedic RPG game in which you'll explore the World of Athens! Your goal is to build your very own Rhapsody, the story of you (the player) and your epic tale in this world. Your story will unfold based on your decisions , to the degree of which cannot be replicated by any other player. As you may have taken note, this is NOT Athenian Rhapsody ... This is Thunder Goober's Personality Dungeon ! Start off your adventure with a personality quiz and be paired up with a mandatory friendship to complete the dungeon crawl with! Your mission is to maneuver your way through Thunder Goober's Personality Dungeon in whatever way you deem fit . You could choose to defeat a massive amount of enemies and collect heaps of EXP, or make friends and complete puzzles that include cute little farm animals! You'll be pursuing a Token in this game as opposed to a Rhapsody, a smaller and more simple version of what your Rhapsody may look like one day. ARhap:TGPD is a turn based RPG which includes intense and fast paced real-time-dodging . You'll be faced with many challenges , and you'll have to brawl your way through the dungeon by either fighting, or finding a way to make friends with your opponents through real estate sales, sharing cream cheese, hiring a plumber, and other strange and wacky interactions. Adventure with one of 12 different companions! - Your time in the dungeon will be drastically affected by the follower you're assigned during your personality test! This partner of yours may be super useful in battle, funny and charming, or maybe just a bit weird ! There's a lot to discover in each potential party member, and a deep friendship to be found within each one. Tons of enemies for you to FIGHT or BEFRIEND! - Thunder Goober has compiled a group of suspicious fellows with which you'll have the choice of engaging in intense battles with! Choose your path carefully , you may end up coming face to face with quite the challenge. Varying battle mechanics to always keep the action fresh! - Many characters will switch up the tactics of battle, you'll be faced with various minigames based on the scenario you find yourself in. Absolutely hilarious. - This game is fast paced, action packed, and full of zany and ironic humor that anyone can have a nice laugh at. Choose your own adventure! - Nothing substantial in this game is up to RNG. You choose your pathway from start to finish, creating an extremely specific pathway which will then be recorded into your playthrough's Rhapsody! Vigorous mental challenges, and intense puzzles! - You may face mind-bendingly difficult challenges such as a 3x3 Slide Puzzle (trust me this is near impossible) and 'Farm Animal Sound Matching' throughout your Token's adventure. Lots of different Tokens to collect! - Based on your actions in TGPD, the Token you receive to commemorate your playthrough will appear differently . You'll also be able to crack it open and see a massive amount of stats and details about your adventure! It's basically a warm-up to your Rhapsody. I wonder if certain hidden challenges will unlock secret types of Tokens , too... Your Token will be redeemable in Athenian Rhapsody's full game! - In the future, you'll be able to redeem your Tokens for rewards in ARhap's full game. This may come in the form of exclusive armors or other in-game items , or maybe even special marks on your Rhapsodies ! Only time will tell... Thunder Freaking Goober, baby! - This game is all about Thunder Goober... You'll see many different sides of this wacky wizard throughout your experience, and maybe you clever players will discover a bit of wizard lore ! Regardless, you'll have to piece everything together in Athenian Rhapsody later on. The common goal of Athenian Rhapsody and Thunder Goober's Personality Dungeon is to provide a real, impactful experience for everyone who plays it. There's something for everyone and I hope that every player can relate to their story somehow, and maybe even reflect on their own lives. Remember to have fun, it's a game! Similar to a Rhapsody, every decision, action, and event that takes place during a playthrough is recorded into your Token ! Thunder Goober's Personality Dungeon may be small, (wizard budget cuts) but there's absolutely no shortage of individuality between two player's tokens. The information contained in a Token ranges from your battle stats as well as the status on any stomach issues your character has . As much as we may pray and hope, Thunder Goober is NOT real and DOES NOT exist in real life. He is definitely not filling out the description for this game, either! Regardless, you most likely should still be afraid of him to a reasonable degree . While your real name might truly be (Insert Name) , and your character in Thunder Goober's Personality Dungeon is also named (Insert Name) , often Thunder Goober will refer to you as Cornball . This is simply due to the fact that Thunder Goober's wizard brain is completely fried and he sees reality in a different way than you or I might. This is nothing to be concerned about! I believe somewhere, sometime long ago a human named Cornball may have made an impact on Athens, or... Maybe you're Cornball? Who knows! Just keep in mind that he means well.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2202710/header.jpg?t=1679668948",
    "Price": 0.0,
    "Developers": "Nico Papalia",
    "Publishers": "Top Hat Studios, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_bf177e69f33781f4ec5ebab6d7e918d2c3b4f7cd.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_43b126b90b4bdfc82a86ba4572e8889c48786605.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_00ce0195b201aedc3e5a859e5794fe0654d196dd.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_d6a797bd01e60b78f3eaad9fecb68a76a639f037.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_2f135789470acf07bbaec0789f0dba4b88b5d838.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_f7ecd16eda7afca07f7d78f2cd4c0ff38b0650af.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_8d6ee87373606e0711769d33533973d594c4fe6a.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_2c908f81a5332837deed7f0d21505133bc504baf.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_8e21ea535ba86c2d073830af683b6d6a1f867eef.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_aa453f53a842f777a6b446f45f8dd92637607584.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_119c6331e2e8c72f212bfb337f43cc9696570dea.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_019ac800db928dbf4794bf824173351aec8b2c90.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_46c6b92447d0399492079ef3c773782a94aad498.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_01b6db3d19e42cfc1e33be2422a30e28193a0aff.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_6c9e41e9f54306e335ea1d4a7e6c5e3948400062.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_94700dff85393d2068c756b327700fa654cf8dbb.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_e00c7291146a33474ad35e691da01ac309854bbd.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_a0326ed00ba391d2f9198704ddd8c94569cc8bcb.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_47f6531a9eb65ef9a02e91b727f0a44d4874f90a.1920x1080.jpg?t=1679668948,https://cdn.akamai.steamstatic.com/steam/apps/2202710/ss_1211932734b13ed431bcd0605ff2e5def291c986.1920x1080.jpg?t=1679668948",
    "Slug": "athenian-rhapsody-thunder-goober-s-personality-dungeon",
    "Meta Title": "Athenian Rhapsody: Thunder Goober's Personality Dungeon: ...",
    "Meta Description": "Looking for information on Athenian Rhapsody: Thunder Goober's Personality Dungeon? Check out the release date (Mar 23, 2023), developer insights from N...",
    "Alt Text Image": "Official header image for Athenian Rhapsody: Thunder Goober's Personality Dungeon game - Steam 2202710",
    "Canonical URL": "https://gusku.site/game/athenian-rhapsody-thunder-goober-s-personality-dungeon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Athenian Rhapsody: Thunder Goober's Personality Dungeon\", \"description\": \"Looking for information on Athenian Rhapsody: Thunder Goober's Personality Dungeon? Check out the release date (Mar 23, 2023), developer insights from N...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 23, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nico Papalia\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Top Hat Studios, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2202710/header.jpg?t=1679668948\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}