{
    "AppID": 1932500,
    "Name": "Battle Tracks",
    "Release date": "Mar 29, 2023",
    "About the game": "About The Game Step into the heat of the battle with Battle Tracks, an engaging top-down action-adventure shooter. Explore diverse terrains while fighting off waves of enemies in an unknown battlefield. With Battle Tracks, experience the rush of intense combat and overcoming the odds. In Battle Tracks, expect to battle enemy tanks in tight arenas designed for strategic gameplay. A variety of unique tanks, each with different sets of abilities and skills make up over 200 levels, all with different handmade layouts. Shoot your way through these enemies, completing different objectives to progress through a massive overworld composed of six unique worlds. As you progress, you'll find new types of tanks, environments, and bosses that stand in your way, to battle your way through. Striking Visuals Discover visually stunning battles in Battle Tracks, with six intricately designed and hand-crafted terrains to explore. From the scorching deserts to the snowy mountains, every terrain offers a unique and explosive visual experience. Bright explosions, flaming bullets, and immersive enemy bosses will captivate you for hours of visually compelling gameplay. Get ready to be mesmerized by the sights and sounds of Battle Tracks. Exhilarating Gameplay Survive and thrive in the midst of relentless and intense enemy fire with Battle Tracks. Feel the rush as you navigate through a relentless hail of bullets and missiles from all sides. Stay alert and keep your reflexes sharp to dodge the enemy's attacks and emerge victorious. Build Your Own Map Unleash your creativity and take control of the battlefield with Battle Tracks' in-game map builder. With an extensive collection of map elements at your disposal, you can craft your own, one-of-a-kind maps to challenge your friends and test their skills. From designing the terrain to placing obstacles and enemies, the possibilities are endless. Create the ultimate battleground and watch as your friends fight to conquer it. Upload to the Steam Workshop to share your creations with the world, or download other maps to test your skill. Local Cooperative Play Join forces with a friend in cooperative play. A second player can jump into the game where you can tackle levels together. Battle Tracks fully supports Steam Remote Play, allowing you and your friends to team up and face challenges, no matter the odds. Local Multiplayer Deathmatch Gear up for intense, competitive battles with your friends in Battle Tracks. Take on all the amazing features of single-player mode and put your skills to the test against your friends in fast-paced, action-packed multiplayer battles. Play in up to 12 different PVP maps with up to 4 different players to try to fight and be the last tank standing.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1932500/header.jpg?t=1680113464",
    "Price": 14.99,
    "Developers": "Dreamfire Studios,7ark Games",
    "Publishers": "Dreamfire Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1932500/ss_172abd45a43ab71d51efe20361b2341976a7e8bf.1920x1080.jpg?t=1680113464,https://cdn.akamai.steamstatic.com/steam/apps/1932500/ss_f57275db8df5af8d80b423efd1d11ef50d92dbbc.1920x1080.jpg?t=1680113464,https://cdn.akamai.steamstatic.com/steam/apps/1932500/ss_2844ce82c2f9810d10ec96f5034469b29ebcc3f6.1920x1080.jpg?t=1680113464,https://cdn.akamai.steamstatic.com/steam/apps/1932500/ss_139a829616a9d3f7044b46129bf62536cdcfdbaf.1920x1080.jpg?t=1680113464,https://cdn.akamai.steamstatic.com/steam/apps/1932500/ss_1c6f3e6fba63b8d5fb458ee01c08c2b86ba43102.1920x1080.jpg?t=1680113464,https://cdn.akamai.steamstatic.com/steam/apps/1932500/ss_dc6f87eff163c26d1674742db64011f074475018.1920x1080.jpg?t=1680113464,https://cdn.akamai.steamstatic.com/steam/apps/1932500/ss_3a56b338a71ad2ffc602b088ee1bb9574112fcab.1920x1080.jpg?t=1680113464,https://cdn.akamai.steamstatic.com/steam/apps/1932500/ss_1fe9c271580e25fc27fa0d0c375b490972a5a12d.1920x1080.jpg?t=1680113464,https://cdn.akamai.steamstatic.com/steam/apps/1932500/ss_cf14af0024b0cad75ea8ff133b477dd9f6fa6513.1920x1080.jpg?t=1680113464,https://cdn.akamai.steamstatic.com/steam/apps/1932500/ss_fe54134d907d31035f6bba9242251395f29499d0.1920x1080.jpg?t=1680113464",
    "Slug": "battle-tracks",
    "Meta Title": "Battle Tracks: Mar 29, 2023, Dreamfire Studios,7ark Games...",
    "Meta Description": "Looking for information on Battle Tracks? Check out the release date (Mar 29, 2023), developer insights from Dreamfire Studios,7ark Games, and a complet...",
    "Alt Text Image": "Official header image for Battle Tracks game - Steam 1932500",
    "Canonical URL": "https://gusku.site/game/battle-tracks",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Battle Tracks\", \"description\": \"Looking for information on Battle Tracks? Check out the release date (Mar 29, 2023), developer insights from Dreamfire Studios,7ark Games, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 29, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dreamfire Studios,7ark Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dreamfire Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1932500/header.jpg?t=1680113464\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}