{
    "AppID": 2335620,
    "Name": "Delve Into Pawssion",
    "Release date": "Mar 30, 2023",
    "About the game": "Set out on a role playing adventure in this NSFW Furry Turn based RPG with visual novel touches! This game is heavily focused on rewarding the player with NSFW Art on a wide variety of furry (and not so furry) characters! Accomplish this by progressing on Main Quests and Side-quests, interacting with specific places or buying a potion for youself to Gender-Swap back and forth! Depending on the quests, you may receive Pictures or Animations which can be revisited at the Gallery menu. Some are very easy to unlock while others are quite a challenge! And easy going Story with visual novel touches awaits you. You find yourself visiting an Adult themed Amusement Park and a virtual role playing game catches your attention. Inside you will dive into a world based on the stories constructed by all the characters who joined while unaware of a mysterious entity that lurks in the shadows. Your adventure is based on a virtual world where a lot of other people joined to have fun! Each character will share a story with you to enjoy. The Main Quests has larger stories, while the Side-Quests are shorter. Single Party Combat: You will travel alone for most of your adventure, with the occasional companion joining you temporarily. This allows the combat to be designed for you to take on any challenge on your own. The combat is a traditional frontal Turn-based system with additional mechanics added, like Quick Cas, Cooldowns and Skill combo synergies. Use these and more to strategically conquer your enemies with all at your disposal. Customizable builds: Your character has a variety of ways to get stronger! Leveling up through exp, purchasing stat boosts to match your playstyle, secure Badges, Skills and Items from the Shop, and even collecting monsters can all increase your strength. Each class has it's own unique way of strengthening itself, like the Assimilative Feline, that gains new skills and strength based on the personality you develop through the responses you give to other characters. Monster Backyard: Find friendly monsters along your journey! These collectible monsters don't fight and will stay in the backyard at town. They will even grant you permanent bonuses and other traits! Costumes: As you play through the game, you'll be able to change your appearance. These changes don't affect the NSFW content. Gender_Swap: Drink a potion to swap to a Female body, which will unlock some new interactions and Art! (Gender Swap only affects a portion of the Art dedicated to the Female form). A variety of locations, secrets and more!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2335620/header.jpg?t=1680208372",
    "Price": 9.99,
    "Developers": "DMQuetzalli",
    "Publishers": "DMQuetzalli",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2335620/ss_97aef7a869a7d4b63e7242cfad395eb052b8ec61.1920x1080.jpg?t=1680208372,https://cdn.akamai.steamstatic.com/steam/apps/2335620/ss_d4caf34308d4ea5ecedfb13941b9f102c450dcb5.1920x1080.jpg?t=1680208372,https://cdn.akamai.steamstatic.com/steam/apps/2335620/ss_9096fd9730b317db180a6c13a9ea6abcc253f034.1920x1080.jpg?t=1680208372,https://cdn.akamai.steamstatic.com/steam/apps/2335620/ss_8f899bc001ae5b307c0640e5eb97e16e7ab927f2.1920x1080.jpg?t=1680208372,https://cdn.akamai.steamstatic.com/steam/apps/2335620/ss_f5f20e19b9194935c8fed772414f3436a91d3ed7.1920x1080.jpg?t=1680208372,https://cdn.akamai.steamstatic.com/steam/apps/2335620/ss_dd032aaa23a6e3cf0e038a46d074294ada1dee03.1920x1080.jpg?t=1680208372,https://cdn.akamai.steamstatic.com/steam/apps/2335620/ss_bd4fb744f94972f15791c7ad55690eedb7149d9c.1920x1080.jpg?t=1680208372,https://cdn.akamai.steamstatic.com/steam/apps/2335620/ss_c72d5e507c4c806e8df795369ea2836533c2e77e.1920x1080.jpg?t=1680208372",
    "Slug": "delve-into-pawssion",
    "Meta Title": "Delve Into Pawssion: Mar 30, 2023, DMQuetzalli and Full O...",
    "Meta Description": "Looking for information on Delve Into Pawssion? Check out the release date (Mar 30, 2023), developer insights from DMQuetzalli, and a complete game summ...",
    "Alt Text Image": "Official header image for Delve Into Pawssion game - Steam 2335620",
    "Canonical URL": "https://gusku.site/game/delve-into-pawssion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Delve Into Pawssion\", \"description\": \"Looking for information on Delve Into Pawssion? Check out the release date (Mar 30, 2023), developer insights from DMQuetzalli, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 30, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"DMQuetzalli\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DMQuetzalli\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2335620/header.jpg?t=1680208372\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}