{
    "AppID": 2110690,
    "Name": "EXIT The Game – Trial of the Griffin",
    "Release date": "Mar 22, 2023",
    "About the game": "The second Escape Room experience from the exciting game series EXIT - The Game takes you back to the year 1837 to the legendary Greifenstein Castle. The Countess herself has invited you to assist her as an expert. Neither the bumpy carriage ride through the misty woods nor the warnings of the locals can deter you. However, what is the truth behind the rumors that the Countess has not been seen for decades and that ghosts haunt the stone halls of Greifenstein? Once you arrive at the castle, the old walls will not let you go. Only if you pass the tests of the Countess and prove yourself worthy, you can free her—and yourself—from the castle and defeat the curse. Go in search of the castle's mistress, examine her chambers for artifacts from your predecessors, rummage through the library for clues about the von Greifenstein family, discover mysterious relics in the castle courtyard, solve tricky puzzles in the family crypt, and even think outside the castle—and the game! The ghosts will help you decipher witchcraft recipes, open folios, medallions and caskets, or decipher the strange hourglass. Are you up to the task and can you free the Countess from her seemingly hopeless situation? Prove yourself digitally as well: with the second app of the award-winning game series 'EXIT® - The Game'. Save the Countess—and yourself: exciting Escape Room game with a completely new storyline Master the challenge alone: for one player The adventure awaits you: exciting mystery-puzzle adventure with twenty multi-layered, creative puzzles Think outside the app: anything can be part of the game! Immerse yourself in the mysterious setting: an atmospheric soundtrack, hand-drawn graphics, and narrator audio set to music will transport you directly into the historical atmosphere of Greifenstein Castle. Are you ready? Age recommendation 12 + An exciting adventure also awaits you in the mysterious Hotel Ophir in the Wichita Mountains: 'EXIT - The Curse of Ophir' can also be found here on Steam.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2110690/header.jpg?t=1679498488",
    "Price": 7.99,
    "Developers": "Nementic Games",
    "Publishers": "USM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2110690/ss_44b7b8c6d93fb040d7242422976d0141e73f102c.1920x1080.jpg?t=1679498488,https://cdn.akamai.steamstatic.com/steam/apps/2110690/ss_75feced9d094bab147b76c5e63298faaeaf9b222.1920x1080.jpg?t=1679498488,https://cdn.akamai.steamstatic.com/steam/apps/2110690/ss_bdc21fae0cc790b283dd60ea266b16474fe1cf29.1920x1080.jpg?t=1679498488,https://cdn.akamai.steamstatic.com/steam/apps/2110690/ss_ce261d53547779d521f95b5138ccd864f4f7f43c.1920x1080.jpg?t=1679498488,https://cdn.akamai.steamstatic.com/steam/apps/2110690/ss_a8e3e09a1badd381145e25a795045083df7e11a4.1920x1080.jpg?t=1679498488",
    "Slug": "exit-the-game-trial-of-the-griffin",
    "Meta Title": "EXIT The Game – Trial of the Griffin: Mar 22, 2023, Nemen...",
    "Meta Description": "Looking for information on EXIT The Game – Trial of the Griffin? Check out the release date (Mar 22, 2023), developer insights from Nementic Games, and ...",
    "Alt Text Image": "Official header image for EXIT The Game – Trial of the Griffin game - Steam 2110690",
    "Canonical URL": "https://gusku.site/game/exit-the-game-trial-of-the-griffin",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"EXIT The Game \\u2013 Trial of the Griffin\", \"description\": \"Looking for information on EXIT The Game \\u2013 Trial of the Griffin? Check out the release date (Mar 22, 2023), developer insights from Nementic Games, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 22, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nementic Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"USM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2110690/header.jpg?t=1679498488\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}