{
    "AppID": 2303060,
    "Name": "Film Studio Manager",
    "Release date": "Mar 17, 2023",
    "About the game": "Film Studio Manager - a strategy game and management simulation that simulates the business of the film industry. Are you ready to take on the challenge of managing a film studio? Take on the challenge of starting and running your own film studio from scrath. Finance and produce movies, hire actors and staff, market and distribute movies, and navigate the ever-changing film industry. Make your own films by selecting from a range of genres and sub-genres. Utilise the straightforward user interface to craft unique storylines and characters. Take charge of every stage of the filmmaking process - budgeting, recruiting the ideal director, writer and cast are all in your control. Start your own streaming service to increase revenue for your studio. Monitor your network's efficiency and expand your reach by licensing content from other studios. Compete with other studios to release the best movies and stay ahead of the competion. With an ever-evolving market and the opportunity to take risks and make mistakes, the game offers an exciting and rewarding experience for all types of players. Awards are an important part of the film industry and winning them can be a major boost for the film industry, as it increases a film's marketability and popularity. To gain awards for your movies, you must create high-quality, well-received productions that are both praised by critics and loved by audiences. Film Studio Manager utilises databases as a key component. Our expansive, fictitious database stores information related to the game, including actors, directors, writers, studios, and awards. Our database editor allows you to customize and manage your own databases. Unfortunately, we need to delay the release of Film Studio Manager on macOS due to technical difficulties. However, we want to reassure our Windows users that the Windows version will be released as expected, without any delays. We apologize for any inconvenience this may cause and we appreciate your understanding. We are working hard to resolve the issues and ensure that the macOS version is released as soon as possible. Thank you for your patience and support.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2303060/header.jpg?t=1679047130",
    "Price": 0.0,
    "Developers": "Illumion Games",
    "Publishers": "Illumion Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2303060/ss_606d5b45dce8d60c28b7f4d2027a1a2daf6338d9.1920x1080.jpg?t=1679047130,https://cdn.akamai.steamstatic.com/steam/apps/2303060/ss_bc194a4dac73b650a5454d419a23eb51462b2635.1920x1080.jpg?t=1679047130,https://cdn.akamai.steamstatic.com/steam/apps/2303060/ss_3a6f19d0b21c349cdf933a9dea133abacdc7ca95.1920x1080.jpg?t=1679047130,https://cdn.akamai.steamstatic.com/steam/apps/2303060/ss_7fe69345457b740af16560043008b61be5b44507.1920x1080.jpg?t=1679047130,https://cdn.akamai.steamstatic.com/steam/apps/2303060/ss_8ee370191a7cf8d61114e42206f3580777e4687c.1920x1080.jpg?t=1679047130,https://cdn.akamai.steamstatic.com/steam/apps/2303060/ss_e2abe83f7c45f9f1be179fdd83c2360caeb6f464.1920x1080.jpg?t=1679047130",
    "Slug": "film-studio-manager",
    "Meta Title": "Film Studio Manager: Mar 17, 2023, Illumion Games and Ful...",
    "Meta Description": "Looking for information on Film Studio Manager? Check out the release date (Mar 17, 2023), developer insights from Illumion Games, and a complete game s...",
    "Alt Text Image": "Official header image for Film Studio Manager game - Steam 2303060",
    "Canonical URL": "https://gusku.site/game/film-studio-manager",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Film Studio Manager\", \"description\": \"Looking for information on Film Studio Manager? Check out the release date (Mar 17, 2023), developer insights from Illumion Games, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 17, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Illumion Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Illumion Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2303060/header.jpg?t=1679047130\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}