{
    "AppID": 1954840,
    "Name": "Fractured Sanity",
    "Release date": "Mar 27, 2023",
    "About the game": "Fractured Sanity is a single-player game developed exclusively for VR; a heart-wrenching experience mixing puzzle elements with survival horror, inspired by classics like Silent Hill and Resident Evil. Every interaction was designed to create an immersive VR world... and make you run for your life. You wake up in a cell in the Triton Institute, an experimental asylum headed by the decorated psychologist, Dr. Matthew Simmons. Recently, there have been rumors of abuse and inhuman working conditions within the clinic; furthermore, it seems most of the staff has gone missing. Nobody knows any details, except this: Dr. Simmons has been conducting research into the tripartite psyche, as proposed by Freud, and how to break someone's id, ego and superego apart. How far has he gone? In this short but intense VR experience, interactive physics-based puzzles mixed with survival horror elements bring an immersive atmosphere of tension and relief. Are you ready to survive in this strange place? Explore Locked up in this facility, you need to find your way out Collect Items, solve puzzles, interact with everything in a physics-based VR simulation Keep a sharp eye for details, the answer might be closer than you think Interact Many secrets are hidden in this facility – you need to find out what's going on... and how to escape Realistic interactions make every action immersive. Opening doors, using your flashlight, levers, and more. Every item you find might be useful; read carefully and interact with the environment to solve puzzles Survive Realistic gun interactions. From reloading to shooting Mind your ammo – this is not an arcade shooter and ammunition is rare Survive and fight any threats you might face during your adventure **** ATTENTION **** Fractured Sanity was developed by 3 people. 2 developers and one writer. We are doing our best to fix any bugs or VR headset incompatibilities our players may find (we tested on Quest 2, which is what we have). If you find an issue, please reach out to us on discord or any social media and we'll do our best to help you out.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1954840/header.jpg?t=1680021380",
    "Price": 7.19,
    "Developers": "United Games",
    "Publishers": "United Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1954840/ss_067c2b77224b281f42b41c35e678e0e82229be29.1920x1080.jpg?t=1680021380,https://cdn.akamai.steamstatic.com/steam/apps/1954840/ss_64c175e696f022dd360fe4e8d8fedcddc180bb74.1920x1080.jpg?t=1680021380,https://cdn.akamai.steamstatic.com/steam/apps/1954840/ss_f481a0a1b0524b6f50b50211a489d5db1a330e88.1920x1080.jpg?t=1680021380,https://cdn.akamai.steamstatic.com/steam/apps/1954840/ss_3757db13f368624b9d974379dbee2b71810dd548.1920x1080.jpg?t=1680021380,https://cdn.akamai.steamstatic.com/steam/apps/1954840/ss_167311f03ab89b0e697584c156300e3cb06c177d.1920x1080.jpg?t=1680021380",
    "Slug": "fractured-sanity",
    "Meta Title": "Fractured Sanity: Mar 27, 2023, United Games and Full Ove...",
    "Meta Description": "Looking for information on Fractured Sanity? Check out the release date (Mar 27, 2023), developer insights from United Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Fractured Sanity game - Steam 1954840",
    "Canonical URL": "https://gusku.site/game/fractured-sanity",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fractured Sanity\", \"description\": \"Looking for information on Fractured Sanity? Check out the release date (Mar 27, 2023), developer insights from United Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 27, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"United Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"United Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1954840/header.jpg?t=1680021380\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}