{
    "AppID": 2281410,
    "Name": "江城创业记",
    "Release date": "Mar 31, 2023",
    "About the game": "You traveled back to the Jiangcheng thousands of years ago and became a workshop owner...Why did you travel through? School disputes, workshop secret fights, alien conflicts, the restoration of the prince, the calm surface of Jiangcheng is undercurrents... Create automated production lines, from wood boards to circuit boards, design each of your production lines. Gradually unlock future technologies, from silicon purification to photovoltaic power generation, and build your super-era workshop. Use cross-regional transfer stations to receive products at all levels and expand your branch factory territory to the whole continent. Brew wine and press oil, make ovens, even watches and antibiotics, and amaze the ancients with your futuristic wares! Reinforced concrete, rubber, mainframe computers, these will all be mass-built by you in ancient times a thousand years ago! ! ! At present, 8 characters are available to attack, royal family, rivers and lakes, merchants... Unlock the secrets of each person, and chase the friendship and love you want. Talk about marriage with the partner you choose, and live in the workshop together, and he/she will also give you great help. Make friends with nearly 30 ancient people, each with their own schedule of changing seasons, participate in their lives, and solve their problems with modern knowledge. In Jiangcheng, everything is natural, and when you want to work, explore, and fall in love, it's up to you to decide. Get started with an extremely fast combat system, dodge and attack, and defeat your enemies in reasonable operations. Orthodox study or Jianghu adventure, external skills, internal skills, light skills, hard skills, more than 40 kinds of martial arts allow you to dominate the world. Explore the four major villages on the map, complete village tasks, and explore their secrets. Explore the mysterious secrets left for you by the mysterious predecessors, go deep into them, and defeat strange monsters. Explore the entire continent, discover treasures, bravely explore bat caves, and punish bandits for the people. Sign contracts with mine owners all over the map and let the ancients work for you. Are you a skilled craftsman or a good communicator? The first person in martial arts or a small expert in life? It's all up to you. Create elixir, weapons, and clothing, and be an ancient craftsman. More than 20 kinds of dishes with different buffs, stewed with five treasures, Xuexia soup... Let's make it in your kitchen! Fill the Tiangong Pavilion with the products you made, and let the ancients also visit modern technology. With the power of future technology, repair the time machine and complete the mission that only you can complete.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2281410/header.jpg?t=1680504577",
    "Price": 10.79,
    "Developers": "iFAction Studio",
    "Publishers": "BD Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2281410/ss_314a9cc9a86e81f21a546933e4cb757fee1072d7.1920x1080.jpg?t=1680504577,https://cdn.akamai.steamstatic.com/steam/apps/2281410/ss_9d10a98a31c1f52b97f46a39fa4f920b6743a00e.1920x1080.jpg?t=1680504577,https://cdn.akamai.steamstatic.com/steam/apps/2281410/ss_5109eb4ba37ed408693acb8227bdf7ae4da78902.1920x1080.jpg?t=1680504577,https://cdn.akamai.steamstatic.com/steam/apps/2281410/ss_ea6b979b1b36159d258846619d6e895e30cacb2e.1920x1080.jpg?t=1680504577,https://cdn.akamai.steamstatic.com/steam/apps/2281410/ss_58b771dcd3be8c564af321ed14dfbb3c6611bb18.1920x1080.jpg?t=1680504577,https://cdn.akamai.steamstatic.com/steam/apps/2281410/ss_dc16d338c2fdc6a1763bca7dcedcd1da3418aa26.1920x1080.jpg?t=1680504577,https://cdn.akamai.steamstatic.com/steam/apps/2281410/ss_4d18f1efb466789eda522a9485f3231e4350a3c2.1920x1080.jpg?t=1680504577,https://cdn.akamai.steamstatic.com/steam/apps/2281410/ss_46a8e317adad53ef360a16af549251a60ee2439b.1920x1080.jpg?t=1680504577,https://cdn.akamai.steamstatic.com/steam/apps/2281410/ss_a8009c74045b98b3063e8fc5c1d687587a4e12e2.1920x1080.jpg?t=1680504577,https://cdn.akamai.steamstatic.com/steam/apps/2281410/ss_ffe31465451d758869b4b56eadc0880f1e797de6.1920x1080.jpg?t=1680504577,https://cdn.akamai.steamstatic.com/steam/apps/2281410/ss_a3a49df70c27c549b5eab245012aff7049ee36f5.1920x1080.jpg?t=1680504577,https://cdn.akamai.steamstatic.com/steam/apps/2281410/ss_ae85952f02f8decb20ac5632561d3a52bb46957d.1920x1080.jpg?t=1680504577",
    "Slug": "",
    "Meta Title": "江城创业记: Mar 31, 2023, iFAction Studio and Full Overview",
    "Meta Description": "Looking for information on 江城创业记? Check out the release date (Mar 31, 2023), developer insights from iFAction Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for 江城创业记 game - Steam 2281410",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6c5f\\u57ce\\u521b\\u4e1a\\u8bb0\", \"description\": \"Looking for information on \\u6c5f\\u57ce\\u521b\\u4e1a\\u8bb0? Check out the release date (Mar 31, 2023), developer insights from iFAction Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"iFAction Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BD Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2281410/header.jpg?t=1680504577\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}