{
    "AppID": 2144280,
    "Name": "龙栖",
    "Release date": "Mar 23, 2023",
    "About the game": "About This is a fantasy daily visual novel. The game takes about 10 hours. Players will play text and voice acting from the perspective of the main character 'Hijinaga' by clicking on the screen and selecting options at key plot points to trigger events and affect the final outcome Story 'There's a research project this summer that will help you in the future...' 'But to go into the mountains...' The cicadas outside the window are weak in the hot sun. In 1995, in order to investigate the 'Mother Dragon culture', my sister took you to Longqi Village. This is a small village in the mountains, the rolling mountains and beautiful water raised a group of simple people, they believe in the legend of the 'mother of dragons', worship the ancient temple incense. The village seems to be very supportive of your research. You also accidentally discover that there are many ancient books in the temple of the Mother of Dragons, which tell the ancient stories of South Vietnam, so that your work progress is very smooth. The temple and the ancient books are managed by a lively and lovely girl, who brings a unique light to your dull research life. About halfway through the project, everything seemed to be going well until -- You hold your breath and watch someone turn their eyes in the dark. 'What's the matter with you...' No, that's not an accurate question. 'No -- who are you? ! What are you going to do? !' Is it an accident that a person has two faces? Or is everyone like that? Perhaps these have something to do with your research content Who's to say? The harbor city entrepreneur that invests village orchard, the triad gang that does no evil... On the balance of soul and money, faith and interests, the true face of 'Mother of Dragons' will emerge in front of people together with the long dusty past of the country of NanYue... game Features Unique game theme, It is based on the traditional folk customs of Lingnan region and the dragon mother culture. The novel content of the game, players will play a 1995 college student, to the rural research. With profound ideological connotation, the work may trigger thinking about attitudes and beliefs about life. The work contains five theme songs and more than 50 BGMS, and the total length of the original set is more than three hours. Realistic thick paint painting, significantly different from the traditional two-dimensional style, bringing more realistic concerns of the game experience. Rich interactive experience, setting various options and branch lines, adding reasoning elements and limited time options to enhance immersion. Official QQ group: 801579861",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2144280/header.jpg?t=1679630416",
    "Price": 5.94,
    "Developers": "鲛人文化工作室",
    "Publishers": "鲛人文化工作室",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2144280/ss_b2285f3faba069c00a067eb9a81df22650e050ab.1920x1080.jpg?t=1679630416,https://cdn.akamai.steamstatic.com/steam/apps/2144280/ss_8c63efcf6e24f8afe35e5995dfd6877175473240.1920x1080.jpg?t=1679630416,https://cdn.akamai.steamstatic.com/steam/apps/2144280/ss_d4464db667bbd9e613314bc8cfce5e63cb2fe1de.1920x1080.jpg?t=1679630416,https://cdn.akamai.steamstatic.com/steam/apps/2144280/ss_6b62b220e398d5cb42478cc65a61ca25cef6c374.1920x1080.jpg?t=1679630416,https://cdn.akamai.steamstatic.com/steam/apps/2144280/ss_2905809573fd29046bcc98a550fc3cb092efb113.1920x1080.jpg?t=1679630416",
    "Slug": "",
    "Meta Title": "龙栖: Mar 23, 2023, 鲛人文化工作室 and Full Overview",
    "Meta Description": "Looking for information on 龙栖? Check out the release date (Mar 23, 2023), developer insights from 鲛人文化工作室, and a complete game summary.",
    "Alt Text Image": "Official header image for 龙栖 game - Steam 2144280",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u9f99\\u6816\", \"description\": \"Looking for information on \\u9f99\\u6816? Check out the release date (Mar 23, 2023), developer insights from \\u9c9b\\u4eba\\u6587\\u5316\\u5de5\\u4f5c\\u5ba4, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 23, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u9c9b\\u4eba\\u6587\\u5316\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u9c9b\\u4eba\\u6587\\u5316\\u5de5\\u4f5c\\u5ba4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2144280/header.jpg?t=1679630416\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.94, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}