{
    "AppID": 2070280,
    "Name": "Ghosts over the Water: Changing the Tides of Japan's Future",
    "Release date": "Mar 31, 2023",
    "About the game": "Studio Unagi's Ghosts over the Water: Changing the Tides of Japan's Future is a historical, immersive strategy game made by four undergraduate students from Yale University and University of Texas, Austin in association with UT Austin's JapanLab. Built upon a familiar and accessible visual novel framework, Ghosts over the Water takes you into a fast-paced world filled with difficult decisions. Featuring: - Three different, character-specific routes - Seven total different endings, based on choice - A rich cast of over 15 historically based characters - Engaging and expansive story with powerful dialogue (130,000 words!) - Hand-drawn art and assets - Collectible, full-screen CGs - Soundtrack of over 35 songs ~ It is the summer of 1853. Earlier in the year, the most unexpected visitors arrived on Japanese shores: Americans. A small fleet of ships commanded by Commodore Matthew C. Perry stormed into Edo Bay, engaging in no violence but causing immense panic. Over two hundred years had passed with Japanese borders closed to outsiders—and suddenly, these foreigners were at the country’s shores demanding open trade. You play as Tsumaki Naoharu: an ambitious, curious young samurai working under Abe Masahiro, the chief senior councillor of Tokugawa Japan. In his lofty position, Masahiro has the imperative duty of formally deciding how Japan will respond to this newfound threat. However, the answer to this deceptively simple question of, “How do we answer to the demands of the foreigners?” is far from clear. You will discover that the citizens are on edge, the opinions of the local lords are at odds with each other, and the current systems are at risk of being upended. But above all else, you will learn that nobody can decide whether to open up to Western trade or keep Japan closed entirely—and Masahiro is no exception. Out of desperation for information and assistance, Abe tasks Naoharu with collecting the opinions of people around Edo in order to gain insight on what to do about Japan’s future. Naoharu’s ability to talk to people and understand their opinions are key reasons as to why he has been chosen to collect this intel—and as the second son of his own family, he does not have the right to inherit the family estate. He must perform well in order to keep his job and establish productive political connections for a secure, debt-free future. There is no traditional sense of “winning” in Ghosts over the Water; the primary goal of the game is to explore and navigate the nuances of Tokugawa Japan's response to the Americans. You will discover what Japan feared, what Japan dreamed of, and what fate Japan pursued in the end. This simple task of gathering the opinions of the daimyo might open Naoharu up not just to the Western world but also to concepts and experiences he has never heard of or experienced before in his life as a samurai. He will meet several factions whose ideologies may intrigue or puzzle him... and it is up to you, the player, to decide whose beliefs hold the most weight—whose beliefs Naoharu will follow, and what end he will meet. If you so desire, you can even sit back and let Naoharu watch history play out as it was fated to. Beware, however, of the consequences. In Ghosts Over the Water, the fate of Japan lies with you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2070280/header.jpg?t=1680291862",
    "Price": 0.0,
    "Developers": "Studio Unagi",
    "Publishers": "Studio Unagi",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2070280/ss_81465983001f5529901588a215923e55eb9d6ea8.1920x1080.jpg?t=1680291862,https://cdn.akamai.steamstatic.com/steam/apps/2070280/ss_4872d5053eac7fab6e207ae72ea028069c08d637.1920x1080.jpg?t=1680291862,https://cdn.akamai.steamstatic.com/steam/apps/2070280/ss_b3a830f106a040c8bc2aa12c6940c063b358ceb5.1920x1080.jpg?t=1680291862,https://cdn.akamai.steamstatic.com/steam/apps/2070280/ss_68428464bf6621cab12032f2d0866b682e581cf5.1920x1080.jpg?t=1680291862,https://cdn.akamai.steamstatic.com/steam/apps/2070280/ss_d06874c51a5109136c832b77d6bd6286849b6521.1920x1080.jpg?t=1680291862,https://cdn.akamai.steamstatic.com/steam/apps/2070280/ss_a92eed42af576b903249f7caa04d948fbd1f5ace.1920x1080.jpg?t=1680291862,https://cdn.akamai.steamstatic.com/steam/apps/2070280/ss_9e333cc403a3ec06f52a22ce55043fa1a70f4026.1920x1080.jpg?t=1680291862",
    "Slug": "ghosts-over-the-water-changing-the-tides-of-japan-s-future",
    "Meta Title": "Ghosts over the Water: Changing the Tides of Japan's Futu...",
    "Meta Description": "Looking for information on Ghosts over the Water: Changing the Tides of Japan's Future? Check out the release date (Mar 31, 2023), developer insights fr...",
    "Alt Text Image": "Official header image for Ghosts over the Water: Changing the Tides of Japan's Future game - Steam 2070280",
    "Canonical URL": "https://gusku.site/game/ghosts-over-the-water-changing-the-tides-of-japan-s-future",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ghosts over the Water: Changing the Tides of Japan's Future\", \"description\": \"Looking for information on Ghosts over the Water: Changing the Tides of Japan's Future? Check out the release date (Mar 31, 2023), developer insights fr...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Unagi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Studio Unagi\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2070280/header.jpg?t=1680291862\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}