{
    "AppID": 2328770,
    "Name": "House Sitter Escape Game",
    "Release date": "Mar 15, 2023",
    "About the game": "'House Sitter Escape Game' is an Escape Game for Virtual Reality (VR) and PC (non-VR). Solve puzzles, search the rooms, investigate the places and, if you wish, fully experience the story and its implications. [Story in short] Following your application for the House Sitter job, you have received an invitation to move into the family 02500L3's house, while they are on their holidays. The family prefers to know the house is inhabited to avoid burglaries. [Features] A full flat of 7 rooms with puzzles to solve. Fun mechanics and interactions. An immersive story. Save system to take breaks during the game. Hint system to get help if needed. [Story in detail] The Earth has become unlivable, there was no other choice than to settle on another planet. For that purpose, high-performance Artificial Intelligences were developed. Once the constructions on the planet 'Minaro', galaxy 'Harvona' finished, life finally resumed to a peaceful rhythm, but a majority of the robots found themselves aimless. It was then proven that even robots could suffer from boredom and that the consequences were much more destructive than for humans. Indeed, men and women are creative, they can find occupations, imagine worlds and tell stories to themselves. But Artificial Intelligences are incapable of inventing tasks. They need humans to renew their goals. Since this discovery, each robot has an assigned human. Quickly, humans started to enjoy spending time with robots more than with their peers. It is much easier to be happy with emotionless beings, programmed to serve them. They can ask, say and do whatever they want without ever being rejected. Because there are fewer humans than robots, households have accommodated several robots for one human. Since then, all family conflicts and disputes between couples have ceased. Peace has finally settled. Everyone seems to benefit from this agreement and get something out of it. The family 02500L3 is no exception to this dynamic. It contains two robot children, Lili and Titi, a robot mother and a human father. They are very well known in the community, mainly thanks to the contests they regularly win: 'Best idea to improve harmony between humans and robots', 'Family with the most followers', 'Best family of the year', etc. The galaxy is a huge place to discover and the technologies are well advanced, so the family has decided to go on a vacation. The father loves collecting rare stones. He tries to bring one back from each excursion, as a souvenir. To make sure the thieves don’t notice their absence, the family 02500L3 has hired a house sitter, to live in the house, turn the lights on and off, use the network and, above all, notify the authorities in case of an intrusion. [VR et non-VR] For the game in VR, the game supports full room-scale/standing tracking on both the HTC Vive and Oculus Rift with SteamVR. For the game in non-VR, the gameplay has been designed so the players on PC get a similar experience to players in Virtual Reality.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2328770/header.jpg?t=1679326384",
    "Price": 8.49,
    "Developers": "Émiguéma Studio",
    "Publishers": "Émiguéma Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2328770/ss_87a518b5fce7bf013d77b8d766e9ecc3bd1c0e8f.1920x1080.jpg?t=1679326384,https://cdn.akamai.steamstatic.com/steam/apps/2328770/ss_0fcb06c575eeab55ef50eb641204b9c58654f268.1920x1080.jpg?t=1679326384,https://cdn.akamai.steamstatic.com/steam/apps/2328770/ss_2fb618edd9821a22b42c94c899dcd77f0f9f4524.1920x1080.jpg?t=1679326384,https://cdn.akamai.steamstatic.com/steam/apps/2328770/ss_a4405389c6be46fb1f1ac7b8852fe727cb7f79cf.1920x1080.jpg?t=1679326384,https://cdn.akamai.steamstatic.com/steam/apps/2328770/ss_61c8ce5f5a63ffee1e1a9a31e13b9f58a94816d6.1920x1080.jpg?t=1679326384,https://cdn.akamai.steamstatic.com/steam/apps/2328770/ss_4af2787ef1c797c643829447c41c589e37685679.1920x1080.jpg?t=1679326384",
    "Slug": "house-sitter-escape-game",
    "Meta Title": "House Sitter Escape Game: Mar 15, 2023, Émiguéma Studio a...",
    "Meta Description": "Looking for information on House Sitter Escape Game? Check out the release date (Mar 15, 2023), developer insights from Émiguéma Studio, and a complete ...",
    "Alt Text Image": "Official header image for House Sitter Escape Game game - Steam 2328770",
    "Canonical URL": "https://gusku.site/game/house-sitter-escape-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"House Sitter Escape Game\", \"description\": \"Looking for information on House Sitter Escape Game? Check out the release date (Mar 15, 2023), developer insights from \\u00c9migu\\u00e9ma Studio, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 15, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u00c9migu\\u00e9ma Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u00c9migu\\u00e9ma Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2328770/header.jpg?t=1679326384\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}