{
    "AppID": 1369720,
    "Name": "Innchanted",
    "Release date": "Mar 28, 2023",
    "About the game": "Run a Magical Inn with friends! Yarrul’s family Inn has been stolen by an evil wizard landlord! To reclaim your family's legacy, you must team up with friends, manage your inn, brew potions, fish, cook, and fight in a magical solo &amp; co-op inn adventure for 1-4 players. There's something for everyone in this heartfelt &amp; hectic adventure, set in a fantasy universe inspired by Indigenous Australian tales. To stop the Wizard from causing more chaos and claiming the Inn for himself, you and your friends must pass the Wizard's challenge: Prove that you are a better Innkeeper than him! But to make the Inn a roaring success you will have to navigate the Inn’s constant magical changes, the wizard’s schemes, monsters, magpies, and satisfy the infamous Food Critic! Cooperate with your team or with your companion AI to run your inn in this thrilling adventure for everyone! Your magic Inn changes its formation every day, creating fresh new adventures and mechanics for your team with over 50 levels to play. You will face many challenges; serve food and potions to customers, protect your inn from dangerous creatures, collect shells to upgrade your establishment, and care for the native animals. To succeed, you will need to win over magical spirits, respect the local customs, and watch out for the monsters and CatBurglars the wizard sends your way! Purchase upgrades from your local WaresWolf to unlock new items, increase your team’s efficiency, and make your inn more powerful. The inside of the inn is also yours to customize with more than 60 decorative items to choose from, ranging from tables to wall prints so you can give that personal touch to your lounge and make it your own. Running a magical inn keeps your party busy, so it’s important to unwind at night. Evenings present a relaxed playspace for you to chat to customers, practice new mechanics you have learned, uncover the next piece of the story, and choose a night activity that will impact the next day. At night, choose from 5 different activities and try your luck at getting helpful bonuses for the next day. What activity will best serve your team tonight? Will you make business decisions, practice alchemy, explore the world, maintain the inn or rest for a bit? The choice is yours, but be careful, your decisions will impact your next day! And if you didn’t get the rest you needed, maybe you can craft a potion to get some extra speed and bonuses to help you better satisfy your customers. Dive into a beautiful Australian-inspired fantasy world, full of amazing creatures, magical spirits, and lively locals. Work together with your friends in this pun and fun filled quest to overcome the evil Wizard – your landlord!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1369720/header.jpg?t=1680018330",
    "Price": 16.99,
    "Developers": "DragonBear Studios",
    "Publishers": "Twin Sails Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1369720/ss_42b1d32c8dfb5ae42c713d2f290045525e9aa54b.1920x1080.jpg?t=1680018330,https://cdn.akamai.steamstatic.com/steam/apps/1369720/ss_5f54a7be824069b730dccd9bb018a89ce2fdd1d4.1920x1080.jpg?t=1680018330,https://cdn.akamai.steamstatic.com/steam/apps/1369720/ss_57f7f006b640fec6fb1ea38a81dd9430b85ad3ed.1920x1080.jpg?t=1680018330,https://cdn.akamai.steamstatic.com/steam/apps/1369720/ss_77c379f7f80ff939d4f9efdd85afac6f660501a9.1920x1080.jpg?t=1680018330,https://cdn.akamai.steamstatic.com/steam/apps/1369720/ss_5ce273341dac66d9dd52dc9d32885aa40ef439fe.1920x1080.jpg?t=1680018330,https://cdn.akamai.steamstatic.com/steam/apps/1369720/ss_03df30bc3d39df27e2bd851b0acd853800fc8328.1920x1080.jpg?t=1680018330,https://cdn.akamai.steamstatic.com/steam/apps/1369720/ss_62ce7c15a15fee8b88c1b6adaf346079e52a8c30.1920x1080.jpg?t=1680018330,https://cdn.akamai.steamstatic.com/steam/apps/1369720/ss_b799f2827de590578b9de9c07237a2d2c94130d3.1920x1080.jpg?t=1680018330,https://cdn.akamai.steamstatic.com/steam/apps/1369720/ss_6b0487ef3b820ab048a955e103e144ac5ce68401.1920x1080.jpg?t=1680018330",
    "Slug": "innchanted",
    "Meta Title": "Innchanted: Mar 28, 2023, DragonBear Studios and Full Ove...",
    "Meta Description": "Looking for information on Innchanted? Check out the release date (Mar 28, 2023), developer insights from DragonBear Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Innchanted game - Steam 1369720",
    "Canonical URL": "https://gusku.site/game/innchanted",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Innchanted\", \"description\": \"Looking for information on Innchanted? Check out the release date (Mar 28, 2023), developer insights from DragonBear Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 28, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"DragonBear Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Twin Sails Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1369720/header.jpg?t=1680018330\", \"offers\": {\"@type\": \"Offer\", \"price\": 16.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}