{
    "AppID": 2353760,
    "Name": "Landfall Archives",
    "Release date": "Mar 31, 2023",
    "About the game": "Break into the Landfall Archives and steal previously unreleased games, demos, interactive slide shows, and even an old version of TABS! Landfall Archives is a collection of every project Landfall and friends have worked on since 2016 that didn't make it to the shelves but which all deserve to see the light of day. This collection of 23 projects includes: Anything for my pals (2021) Control a herd of Pals to help you navigate through a short level with obstacles. Robots Forever (2018) Find weapons to fight modular robots! Every robot part has its own health and can be destroyed separately so you better watch out… Robots Forever 2 (2019) This game builds on the concept of modular robots from the first Robots Forever. Included are more robots with varying sizes and parts, as well as randomly spawning weapons with upgrades. Post Game (2019) Small building game where you build conveyor belts and other parts to move packages around a facility. The more packages you get into the containers, the more credits you collect! Physics Survival (2019) A physics animated top-down game where you explore and interact with the environment and animals to gather resources that you can use to get more equipment and units. TABS 2017 (2017) TABS 2017 is an early version of Totally Accurate Battle Simulator using the 2.0 physics system that was scrapped in 2017 in favor of the current 3.0 version. In the game you use a variety of different units to beat a level or you can play around in the sandbox mode. Airships 1 (2018) An exploration of airship building, using a system with different modular parts you can use to build your ship. Fly the ship around the landscape to explore! We imagined this to be a way to travel around in some of the other prototypes. Airships 2 (2018) Another version of airship building with different modular parts and improved stabilization for the airships, aiding in flying and construction. Wrecktangels (2019) Local PVP Simple side-view battle game where you jump and shoot each other while using a time-slow mechanic. The world is built out of objects that collapse and break apart as they are hit, to keep you on your toes! RTS card game (2021) Play cards to spawn units, and cast spells during real-time strategy gameplay. Build your own deck and combine cards to change which units and abilities are part of your deck. We made this to explore real-time card mechanics with some light RTS gameplay. Physics Fighter (2021) Brawl with enemies in small rooms, using your fist, legs, and a knife. The enemies have different attacks and patterns that they follow during fights to keep you on your toes. Medieval America (2020) Online PVP Physics shooter where you battle your enemy on a destructible level that collapses as the battle goes on, be careful not to fall! Plant Plane (2019) Go on a peaceful journey along the level in a plane, creating bushes and leaving nature around you as you fly past. Ocean Plane (2023) Fly around and fire small missiles at airships and towers, in and around an ocean. Playful (2021) Online PVP A 1v1 game where you can battle and play in different scenarios with your own rules and goals. It was made to be a sandbox to create your own small games in. Blob Game (2018) A small experience of being locked in a room with an unknown creature while a voice speaks to you. There are a few different endings to this game, can you find them all? Walking House Game (2021) Prototype for a building game where you control and build a walking castle. Travel to explore and gather resources around you to build and upgrade your base. Beware of the enemies lurking nearby! Missile Game (2021) Control missiles and fly them through different levels with varying obstacles to bring down physics towers, with the goal of destroying the small objects you find in the structures. Creepy Robots (2017) Run and climb around a small town scene while being chased by humanoid robots! ROUNDS 3D (2022) Online PVP Prototype for a 3-dimensional version of the game ROUNDS. It’s mainly explored with the shooting mechanics and a handful of upgrades. Counts and Stakes (2020) Online PVP A vampires vs vampire hunters-themed top-down-shooter focusing on precise aiming. Play against other players in small arenas with physics obstacles that you can interact with. Physics Presentation (2018) Not exactly a game, but more of an interactive slideshow made to be used as a presentation explaining the principles of the physics used in Landfalls games. Auction Brawl (2017) 2-4 Local Splitscreen Split screen fighting game where you bid on items that you then use to brawl against the other bidders. You can also grab and use most other items in the auction room to fight your fellow players!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2353760/header.jpg?t=1680268852",
    "Price": 0.0,
    "Developers": "Landfall",
    "Publishers": "Landfall",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_88046e11198951f0df3581db60067ed082a75da5.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_f3463da73a3f6f05480358d2a331aa34801f4b54.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_3e95eaef96eecaddee3a8169612f257e3f4d3cc9.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_f855066c5e0257f2978bc4690936c15e539c57fa.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_8f49b7c7beadd62d67ce7a5d487c2a29f9aae723.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_7fe2ccae12173ed1e89cef516079f728d54f69fd.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_6c32f5f373dcaff067cd4bc0312c8666527cd0e6.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_fe4d2debd123909a282d802cc4d67ceab793656f.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_b94eed187726906f8c493ec0be86dd395ed40542.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_515cb36530fed6066320b306de938554f43d4f4f.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_998ed70147cca9b9ccbbfa0259f8503a02e00eb6.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_14bfd70df46f1646372a5b613804846334d96650.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_f88be467b4b3c21f1352de6a1c9742da50afe716.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_9d207ccd62eab032d89cdd0c50f3626d349c668c.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_74e12a2ac74e7a595cdc463ba76bae734b81db9f.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_39d18e2f28ae237b3865f4e26c45ddac890688e8.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_e89b090205171d19e8e6b14117d5af3b2799d2c8.1920x1080.jpg?t=1680268852,https://cdn.akamai.steamstatic.com/steam/apps/2353760/ss_c7cfdf25f5de09e0a7632094ac38bf56e4f9622e.1920x1080.jpg?t=1680268852",
    "Slug": "landfall-archives",
    "Meta Title": "Landfall Archives: Mar 31, 2023, Landfall and Full Overview",
    "Meta Description": "Looking for information on Landfall Archives? Check out the release date (Mar 31, 2023), developer insights from Landfall, and a complete game summary.",
    "Alt Text Image": "Official header image for Landfall Archives game - Steam 2353760",
    "Canonical URL": "https://gusku.site/game/landfall-archives",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Landfall Archives\", \"description\": \"Looking for information on Landfall Archives? Check out the release date (Mar 31, 2023), developer insights from Landfall, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Landfall\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Landfall\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2353760/header.jpg?t=1680268852\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}