{
    "AppID": 2210800,
    "Name": "Monster Racing League",
    "Release date": "Mar 23, 2023",
    "About the game": "Multiplayer combat racing, with no driving! Monster Racing League is a fast-paced multiplayer combat racing game that has been crafted for maximum fun. The monsters drive themselves, freeing up players to time the use of offensive and defensive abilities to disrupt their opponents. Races are short, hectic, sometimes reckless, but always fun! Gameplay Select a monster and equip your abilities before each race. Manually control nitro speed and play offensive/defensive abilities while your monster drives. Get in on the action with standard races contested over short, multi rounds of mayhem with six or more players. The monster with the most points at the end takes home the glory! Rack up Knucklebones as you compete, unlocking new monsters and upgrades along the way. Experience the thrill of Monster Racing League with friends! Compete in online multiplayer lobbies or host your own games and invite your pals. With practice mode available, train against a variety of in-house monsters and hone your skills. Get ready to unleash your competitive spirit! Monsters Monsters are your drivers. Each monster comes with its own set of unlockable abilities and upgrades. Collect more monsters to access a wider range of awesome abilities and boosters. Unleash your inner collector with Monster Racing League's highly customizable monsters! Drawing inspiration from designer vinyl toys, each monster is a desirable item that you'll want to add to your collection. While the Early Access release offers randomized looks, for the full release we're planning for even more extensive customization options. Get ready to create your ultimate monster driving team! Monsters each have their own history and abilities. Fire, River, Mountain, and Sky, are the foundation tribes of the league, each with unique color palettes and features, but all new tribes are on the horizon. And for the ultimate collectors out there, don't miss out on our Premium Monsters, featuring exclusive materials that will have your heart racing. Available soon as a DLC pack. Tracks Monster Racing League is also about the tracks. With unique features and themes, each one is a wild ride of its own. Different tracks can match different monsters' skills and strategies. So if you want to come out on top, you’ll need to learn the twists and turns of each one. Right now, there are two kinds of tracks in our Early Access game: multi-lap loop tracks and point-to-point sprints. Ready, set, go! Streaming Get revved up for Monster Racing League! It's the perfect game for both spectators and streamers. The races are short and sweet, packed with non-stop action. Plus, there's no need to stick to a boring old racing game camera angle. You can use custom cameras to capture all the epic moments and share them with your audience. And don't forget about the taunts and messages! They're perfect for fueling player rivalries. Grab some friends and start your engines, because with multiplayer mode, you can host your own races and stream to your heart's content!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2210800/header.jpg?t=1679613333",
    "Price": 7.99,
    "Developers": "Flightless",
    "Publishers": "Flightless",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2210800/ss_cee101de0cd7121982692dd5889cf791efbceb8c.1920x1080.jpg?t=1679613333,https://cdn.akamai.steamstatic.com/steam/apps/2210800/ss_2b7491fd7ea7e5593589b787cb619c83f20eaac5.1920x1080.jpg?t=1679613333,https://cdn.akamai.steamstatic.com/steam/apps/2210800/ss_04b51737163445ab348c321aefb990ef62c48b43.1920x1080.jpg?t=1679613333,https://cdn.akamai.steamstatic.com/steam/apps/2210800/ss_0bdf508ea91591d85d26a1b91ec4bef4e0490844.1920x1080.jpg?t=1679613333,https://cdn.akamai.steamstatic.com/steam/apps/2210800/ss_8c01fd56ed889b9696fd7f2e766de1f1070f381c.1920x1080.jpg?t=1679613333,https://cdn.akamai.steamstatic.com/steam/apps/2210800/ss_9869ba6b4e7543b9627bb87b9af925ed056c7da7.1920x1080.jpg?t=1679613333,https://cdn.akamai.steamstatic.com/steam/apps/2210800/ss_00513e34171c3dfc9c137dc1148251e209481702.1920x1080.jpg?t=1679613333,https://cdn.akamai.steamstatic.com/steam/apps/2210800/ss_e9a19adab54340541cc8780b371f4e0091e8663f.1920x1080.jpg?t=1679613333,https://cdn.akamai.steamstatic.com/steam/apps/2210800/ss_18fdda324ed20fec46ca3ef85461f1c7974c2f28.1920x1080.jpg?t=1679613333,https://cdn.akamai.steamstatic.com/steam/apps/2210800/ss_6120dc30bc5098515fec9c65f904a461a481da74.1920x1080.jpg?t=1679613333,https://cdn.akamai.steamstatic.com/steam/apps/2210800/ss_f696dbf0e9a9530ee6af7dca2928bfcbc676d44f.1920x1080.jpg?t=1679613333,https://cdn.akamai.steamstatic.com/steam/apps/2210800/ss_5a30144859c58269d397e658b07261614f9d2aba.1920x1080.jpg?t=1679613333",
    "Slug": "monster-racing-league",
    "Meta Title": "Monster Racing League: Mar 23, 2023, Flightless and Full ...",
    "Meta Description": "Looking for information on Monster Racing League? Check out the release date (Mar 23, 2023), developer insights from Flightless, and a complete game sum...",
    "Alt Text Image": "Official header image for Monster Racing League game - Steam 2210800",
    "Canonical URL": "https://gusku.site/game/monster-racing-league",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Monster Racing League\", \"description\": \"Looking for information on Monster Racing League? Check out the release date (Mar 23, 2023), developer insights from Flightless, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 23, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Flightless\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Flightless\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2210800/header.jpg?t=1679613333\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}