{
    "AppID": 2331750,
    "Name": "Neon Music Drums",
    "Release date": "Mar 22, 2023",
    "About the game": "Neon Music Drums is a music rhythm game for virtual reality. Hit the light-up neon drum at the right moment in rhythm to the music. Play with over 50 built-in songs or with your own personal songs. Collect stars to unlock more songs and beat your personal high score. Thanks to different difficulty settings, Neon Music Drums is the perfect VR game for cozy drum sessions as well as for exciting workouts in a colorful space environment! Game mechanics The gameplay of Neon Music Drums is totally simple! Hold the red drumstick in your left hand and the blue drumstick in your right hand. Wait for a drum to light up with an indicator and hit it with the appropriate drumstick at the right moment to match the music. This is the moment when the inner colored circle touches the outer purple circle. The menu also consists of individual drums and can be operated with the drumsticks. No controller buttons are needed. Over 50 songs included The game already includes over 50 royalty-free songs. These come from a wide variety of music genres: dance, pop, rock, hip hop, country, house, soul, wave, 80s, dubstep, Christmas songs, drum solo and many more. There is something for everyone! Collect stars with each game to unlock more songs. Play with your own songs You can also play Neon Music Drums with your own songs. To do this, copy your own songs as mp3 files to the music folder on your computer (Windows only) and load the songs from the menu. Up to 128 songs can be loaded simultaneously. Five different drum sets The game contains five different drum sets. From a small six-piece drum set that can be played standing up, to a circular drum set that requires you to turn your head, to a large 15-piece drum set that requires constant movement. High score and different levels of difficulty Play the perfect game and beat your high score. The game contains three different difficulty levels ('easy', 'medium', 'hard'). In addition, you can also play in crazy 'wild' mode or without sound. Share your performance Share your performance videos using the hashtag #NeonMusicDrums . We look forward to your videos! Photosensitive Warning This game contains flashes of light that could trigger seizures for people with visual sensitivities! Take a break if you feel uncomfortable or recognize any symptoms of motion sickness, simulator sickness or eye strain! About the developers We are zefwih , a small development studio from Germany. Even if we can't keep up with the providers, we develop all our games with attention to detail and great care. If you have any suggestions, problems, praise or feedback, please contact us!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2331750/header.jpg?t=1679592940",
    "Price": 8.09,
    "Developers": "zefwih",
    "Publishers": "zefwih",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2331750/ss_603fc17cfd8f7a1438060fec60620a4d2b47bd90.1920x1080.jpg?t=1679592940,https://cdn.akamai.steamstatic.com/steam/apps/2331750/ss_13d6c199f65aa70192d65d360af8c504b680b460.1920x1080.jpg?t=1679592940,https://cdn.akamai.steamstatic.com/steam/apps/2331750/ss_e285cc63f318a2255532833eff38e40469cbbed9.1920x1080.jpg?t=1679592940,https://cdn.akamai.steamstatic.com/steam/apps/2331750/ss_71a377fc32f5f9dfc8708599ef41b97ed22dc6d3.1920x1080.jpg?t=1679592940,https://cdn.akamai.steamstatic.com/steam/apps/2331750/ss_5fc13592a9fd02987f2d1f20ff8ffd9abe668219.1920x1080.jpg?t=1679592940,https://cdn.akamai.steamstatic.com/steam/apps/2331750/ss_305f9b4d749ea7b4775a2f918b01be6026710770.1920x1080.jpg?t=1679592940,https://cdn.akamai.steamstatic.com/steam/apps/2331750/ss_27ec279f63059c955caa19b7c20cbdc5959337ff.1920x1080.jpg?t=1679592940,https://cdn.akamai.steamstatic.com/steam/apps/2331750/ss_b2278f6dbbecd0f7f41c993f80803d85dddc11f5.1920x1080.jpg?t=1679592940",
    "Slug": "neon-music-drums",
    "Meta Title": "Neon Music Drums: Mar 22, 2023, zefwih and Full Overview",
    "Meta Description": "Looking for information on Neon Music Drums? Check out the release date (Mar 22, 2023), developer insights from zefwih, and a complete game summary.",
    "Alt Text Image": "Official header image for Neon Music Drums game - Steam 2331750",
    "Canonical URL": "https://gusku.site/game/neon-music-drums",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Neon Music Drums\", \"description\": \"Looking for information on Neon Music Drums? Check out the release date (Mar 22, 2023), developer insights from zefwih, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 22, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"zefwih\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"zefwih\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2331750/header.jpg?t=1679592940\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.09, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}