{
    "AppID": 1464220,
    "Name": "Netherguild",
    "Release date": "Mar 27, 2023",
    "About the game": "Netherguild is a turn-based tactical roguelite dungeon-crawler, where you command expeditions below the earth in a desperate attempt to cure a strange plague. Explore, camp, and fight as far as you can before heading back to resupply. What will you discover underground? Key Features: Bonfires: Construct campfires underground, rest and eat next to them. The food items you consume affect your guild members and the rest of your expedition, with passive effects, permanent changes and more! ────────────────────────────────────────── Combat: Learn how to defeat different enemies (and when to flee) in combat. Hitting enemies requires no RNG - so you can depend on your abilities, but watch out for tricky enemies that are immune to your strategy, unfortunate circumstances and surprises! In Netherguild, combat is another form of resource management - how can you prevent your characters from getting hurt, or receiving harmful debuffs? When is it the right time to use a powerful ability, when should you save it for later? ────────────────────────────────────────────────── Oddities: Different oddities you find underground will present you with various choices that may affect your expedition and the game world at large. ──────────────────────────────────────────────── The World Above: While you explore below, different events may happen above-ground, presenting opportunity and choice when you return from expeditions. ──────────────────────────────────── Replay Value: Random equipment , random character backgrounds with different skills each playthrough and procedurally generated levels every time you descend underground mean that playthroughs feel different every time. ──────────────────────────────────── Additional Features: Roguelite with Persistence and Story: Keep your characters at the end of each expedition (if they survive), equip them with powerful items and level them up over time. Netherguild's story progresses the more you explore and find out about the secrets of its world. Dungeon Crawling Resource Management: Powerful abilities have a limited amount of uses. Your characters have limited inventory space. What is more important? The priceless loot you bring up back to the surface, or the firewood logs that let you descend even deeper? Original Game World: Netherguild may be fantasy, but don't expect it to play by genre conventions at all; No Orcs, no Elves, and no wizards casting fireballs. Expect to find strange biospheres and denizens far underground. Cute Voxel Aesthetics: Contrasted by a story with serious themes, as you face against plague and conspiracy! Solo Developed: I'm always happy to get feedback, suggestions and inspiration from players. You can reach me through various channels such as my twitter, the Netherguild discord and Netherguild Steam forum. If you love Netherguild, dislike something about it, or you have a fantastic idea you think should be added to the game, please let me know! :D / Early Access: Risks, Plans and Expectations: Risks: It's possible that during development, I would run out of money and wouldn't be able to continue full time development. If that were to happen, I'll take up part time or full time work and develop Netherguild in my spare time. This game will be finished as long as I'm physically able to work on it. I'm doing everything in my power to combat this risk - for example, marketing and getting to a certain number of wishlists before release should prevent it from ever occurring - but I think it's still important to be honest about risks like this before release. If you want Netherguild to reach its full potential, you can help by letting your friends, favorite streamer or gaming news site know about it! (: Plans: Updates will happen in regular intervals; With a new update every week to three weeks. Bigger updates will happen every few months too - taking longer to update, but containing more content and additions. Expectations: Expect progress to be slow and steady- being a solo dev means I can't finish the game in a year, and big updates will take time. Also, expect me to always be active on the Netherguild discord during Early Access, listening to your feedback.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1464220/header.jpg?t=1679911180",
    "Price": 8.99,
    "Developers": "David Vinokurov",
    "Publishers": "David Vinokurov",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_38c6470742890717a45c809c05fd3c526b8ca72f.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_3576511d573e8c835c9bc0cc353d211199303fbe.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_94a748ce86ef6ecd8e9b3e4164bd332a31aa219e.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_8f3cd542a1729ff2fed19607419c9501ad2a3f97.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_5beb8b873fca27ff17321fd50129b6bb94be6cda.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_dc2beeb66d86afb9b6f29231696890af71e03462.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_364a4913a7a04928a4b41d173a660d27c1ed12d6.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_72217287827c741faeab6ba1cb448a8a41cb96f9.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_8401b11eda744f66c1f31971d3c50977788a3f5b.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_6d3a143ec04516962b42039470a24176453e060e.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_e0a3f9e7f4760a1770b1bd55b25324c9a477a1a9.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_9f64d8e1c356c98835a526fec3a756ee0beb996a.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_3dcea20cc1968beac767fe12a4d8e54c2bee0a49.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_61e4a49ee03acfbdeac80dada8e64cdd548069b9.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_fb5a6a32c7bb9e9ab4481b4d12987b349803e16f.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_35d5d339f768dbaed487f3dbe54f0269a5e0d2c1.1920x1080.jpg?t=1679911180,https://cdn.akamai.steamstatic.com/steam/apps/1464220/ss_4be81d28036a2915cdeba767ba191d021475e193.1920x1080.jpg?t=1679911180",
    "Slug": "netherguild",
    "Meta Title": "Netherguild: Mar 27, 2023, David Vinokurov and Full Overview",
    "Meta Description": "Looking for information on Netherguild? Check out the release date (Mar 27, 2023), developer insights from David Vinokurov, and a complete game summary.",
    "Alt Text Image": "Official header image for Netherguild game - Steam 1464220",
    "Canonical URL": "https://gusku.site/game/netherguild",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Netherguild\", \"description\": \"Looking for information on Netherguild? Check out the release date (Mar 27, 2023), developer insights from David Vinokurov, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 27, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"David Vinokurov\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"David Vinokurov\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1464220/header.jpg?t=1679911180\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}