{
    "AppID": 2344170,
    "Name": "ORP Eagle",
    "Release date": "Mar 23, 2023",
    "About the game": "The education game 'ORP Eagle' is a unique and immersive experience that takes players on a learing journey through the history and culture of Lower Silesia, all while solving intriguing puzzles straight out of classic detective novels. Using 3D materials which show the region's historical, tourist, and landscape attractions, players can explore and interact with incredible locations like never before. All thanks to virtual reality and PC version . The enigmas are challenging and require a lot of creativity and problem-solving skills. In addition to the mystery-solving aspect of the game, there is also an educational component . Players learn about the history and culture of Lower Silesia as they progress through the game, gaining a deeper understanding and appreciation of the region's rich heritage. Players are tasked with solving a series of mysterious riddles, similar to those of an escape room but with the added twist of friendly ghosts that guide players along the way. These ghosts, far from frightening, are friendly and pleasant, providing hints and clues to help solve the mysteries. The game is a first-person introduction to the history and culture of Lower Silesia, giving players the education context and background they need to appreciate the journey ahead fully. During the whole gameplay, players are transported to various locations around the region and learn about the history of Lower Silesia, which is rich in culture and traditions. In 'ORP Eagle' we can explore historical buildings, mines, castles, and other attractions, each with a unique story and significance. For example, the Gold Mine in Złoty Stok is a fascinating attraction that tells the story of the gold rush in Poland in the 18th century. Książ Castle is another attraction that has a rich and fascinating history. The castle was built in the 13th century and was once owned by the royal family of Germany. It was also used as a headquarters for the Nazis during World War II. Besides that, The Meteorological Observatory on Śnieżka offers a fascinating insight into the world of science and weather forecasting. The game begins when the player enters the Temple of Wang , where a key lies on the table to open the first door. In this way, the passage through a sequence of rooms that faithfully reflect the most famous attractions of Lower Silesia begins. The goal is to solve puzzles and collect fragments of spiritual keys, which open a trunk given as a reward to the player by the ghosts. The game is designed for players of all ages and skill levels , offering a fun and engaging way to explore the history and culture of Lower Silesia while also challenging their problem-solving abilities. Virtual reality makes the experience even more immersive, allowing players to feel like they are truly a part of the game world. Overall, 'ORP Eagle' is an innovative and exciting game that offers a unique blend of history, culture, and puzzle-solving. With its immersive visuals and friendly ghosts, it is a game that will captivate players and leave them wanting more. Whether you are detective novels and history fan or just looking for a challenging game, this experience is perfect for you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2344170/header.jpg?t=1679559660",
    "Price": 199.99,
    "Developers": "Giant Lazer",
    "Publishers": "Giant Lazer",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2344170/ss_c7a3328282cd6c0bd4db666d42085dfe10ee4977.1920x1080.jpg?t=1679559660,https://cdn.akamai.steamstatic.com/steam/apps/2344170/ss_1d870c45f115b913befbde67725afa95778870f3.1920x1080.jpg?t=1679559660,https://cdn.akamai.steamstatic.com/steam/apps/2344170/ss_ed41f2baa6053ad4e5526752e8f5a7fe87eb1f4b.1920x1080.jpg?t=1679559660,https://cdn.akamai.steamstatic.com/steam/apps/2344170/ss_4fcccc4109db427a7da1071e1efed38fdee7bfa6.1920x1080.jpg?t=1679559660,https://cdn.akamai.steamstatic.com/steam/apps/2344170/ss_6c07d9ecef15497bca02610a4ebe314e9c002689.1920x1080.jpg?t=1679559660,https://cdn.akamai.steamstatic.com/steam/apps/2344170/ss_5e0cc21ef7b20ddc1732591bad3c3a59ca29c7b2.1920x1080.jpg?t=1679559660,https://cdn.akamai.steamstatic.com/steam/apps/2344170/ss_7c935eb7af484e94f060084b9679120755ef7d3b.1920x1080.jpg?t=1679559660,https://cdn.akamai.steamstatic.com/steam/apps/2344170/ss_0bef9b28a453bc9ee7dd6095da401bf3c5d50c05.1920x1080.jpg?t=1679559660,https://cdn.akamai.steamstatic.com/steam/apps/2344170/ss_e6a8e67f6e3ed2c9ea377970ccc23d2138e77ba9.1920x1080.jpg?t=1679559660,https://cdn.akamai.steamstatic.com/steam/apps/2344170/ss_cb4106e2b265d6adaf39bb0212d9636ca1851b90.1920x1080.jpg?t=1679559660,https://cdn.akamai.steamstatic.com/steam/apps/2344170/ss_5c0579083c9a8994658105aa8fa5e06a8cfb667d.1920x1080.jpg?t=1679559660,https://cdn.akamai.steamstatic.com/steam/apps/2344170/ss_7eb322bb9827a1944e89e63fb5abfafc889509d5.1920x1080.jpg?t=1679559660",
    "Slug": "orp-eagle",
    "Meta Title": "ORP Eagle: Mar 23, 2023, Giant Lazer and Full Overview",
    "Meta Description": "Looking for information on ORP Eagle? Check out the release date (Mar 23, 2023), developer insights from Giant Lazer, and a complete game summary.",
    "Alt Text Image": "Official header image for ORP Eagle game - Steam 2344170",
    "Canonical URL": "https://gusku.site/game/orp-eagle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ORP Eagle\", \"description\": \"Looking for information on ORP Eagle? Check out the release date (Mar 23, 2023), developer insights from Giant Lazer, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 23, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Giant Lazer\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Giant Lazer\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2344170/header.jpg?t=1679559660\", \"offers\": {\"@type\": \"Offer\", \"price\": 199.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}