{
    "AppID": 2312170,
    "Name": "pWordle",
    "Release date": "Mar 21, 2023",
    "About the game": "pWordle is a highly addictive and challenging word puzzle game, available in multiple languages. Inspired by the hit game WORDLE, with its innovative new features, pWordle offers endless hours of fun and excitement for players of all ages. Language Support: pWordle supports multiple languages, including English, Spanish, French, German, Italian, Portuguese, and more. This means that players can experience the game in their native language and improve their vocabulary skills at the same time. Virtual Keyboard: To make it easier for players to enter words, pWordle includes a virtual keyboard for each supported language. This makes it quick and simple to enter words, and eliminates the need for a physical keyboard. Word of the Day: The Word of the Day feature offers daily challenges for players to solve. With this feature, players can improve their vocabulary skills and learn new words every day. Freeplay Mode: Once the Word of the Day has been played, players can enjoy unlimited play in the freeplay mode. This mode offers endless opportunities for players to hone their vocabulary skills and improve their scores. Image Gallery: pWordle features a browsable image gallery where players can view the images they have unlocked. With fullscreen, zooming, panning, and slideshow controls, players can enjoy their images in detail and relive their achievements. Steam Achievements: pWordle includes Steam achievements for players to unlock as they progress through the game. These achievements offer a sense of accomplishment and provide a reason for players to keep coming back to the game. Player Stats: pWordle tracks player stats for both the Word of the Day and Freeplay modes. Players can view their stats to see how they are improving over time and compare their scores with others. Jukebox: pWordle allows players to customize their gaming experience with the Jukebox feature. Players can choose which songs are played by toggling them on or off in the options. With the ability to create a personalized playlist, players can enjoy their favorite tunes while they play. Summary: pWordle is a fun family friendly word puzzle game with beautiful pictures to unlock. Improving on the original hit game WORDLE with many new innovative features, including language support, virtual keyboard, Word of the Day, freeplay mode, image gallery, Steam achievements, player stats, and jukebox, pWordle offers endless hours of entertainment and the opportunity to improve vocabulary skills. Get ready to put your vocabulary to the test with pWordle!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2312170/header.jpg?t=1679603678",
    "Price": 2.99,
    "Developers": "HawkX Games",
    "Publishers": "HawkX Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2312170/ss_8f1a1516260ca38ccf47e03eed30bc8c25f48d31.1920x1080.jpg?t=1679603678,https://cdn.akamai.steamstatic.com/steam/apps/2312170/ss_b566d7a57e97c566f3a120ac2134c36ed6eed75a.1920x1080.jpg?t=1679603678,https://cdn.akamai.steamstatic.com/steam/apps/2312170/ss_43a410c4a322bacfdc9c01c9a13fe2b196a86414.1920x1080.jpg?t=1679603678,https://cdn.akamai.steamstatic.com/steam/apps/2312170/ss_52bf338aeeac5994a64a69ca001b461da5814526.1920x1080.jpg?t=1679603678,https://cdn.akamai.steamstatic.com/steam/apps/2312170/ss_7abd0a2f7c8c457ee740e06bfcb7af6036bc88b4.1920x1080.jpg?t=1679603678,https://cdn.akamai.steamstatic.com/steam/apps/2312170/ss_e69b835e27584381c6b6be7b3f4bdf52440b6abc.1920x1080.jpg?t=1679603678,https://cdn.akamai.steamstatic.com/steam/apps/2312170/ss_175f5b91b37dc0bacdd3478e2c8c5a4653e2d0f5.1920x1080.jpg?t=1679603678,https://cdn.akamai.steamstatic.com/steam/apps/2312170/ss_dfc4381e0479aaec94bdc4c28ac62ed78f80a8e0.1920x1080.jpg?t=1679603678,https://cdn.akamai.steamstatic.com/steam/apps/2312170/ss_de8cb65d72ad290bf5657c476e672bd08db2845c.1920x1080.jpg?t=1679603678",
    "Slug": "pwordle",
    "Meta Title": "pWordle: Mar 21, 2023, HawkX Games and Full Overview",
    "Meta Description": "Looking for information on pWordle? Check out the release date (Mar 21, 2023), developer insights from HawkX Games, and a complete game summary.",
    "Alt Text Image": "Official header image for pWordle game - Steam 2312170",
    "Canonical URL": "https://gusku.site/game/pwordle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"pWordle\", \"description\": \"Looking for information on pWordle? Check out the release date (Mar 21, 2023), developer insights from HawkX Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 21, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"HawkX Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HawkX Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2312170/header.jpg?t=1679603678\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}