{
    "AppID": 2303180,
    "Name": "Resoraki: The racing",
    "Release date": "Mar 23, 2023",
    "About the game": "Forget about boredom with Resoraki - experience unforgettable emotions Resoraki is an extraordinary racing game that will make you feel like a professional driver. Play alone or with a friend on one computer or online using remote play (your friend doesn't need the game or a Steam account) and race on beautiful tracks in Poland, Finland, Australia, or Greece. With various game modes, such as championships, arcade, and time trial, there is no time for boredom. The graphics combine anime, cartoon, and comic styles, making the game visually stunning. In Resoraki, you will find many unique features, such as Steam leaderboards (global and among friends), availability in all resolutions (16:9, 21:9, etc.), 3 difficulty levels (easy, medium, and expert), and the ability to unlock championships and tracks. In time trial mode, you can test your skills with a hologram that helps you improve your lap time. The vocal music inspired by old-school PSX (PlayStation 1) games adds a unique atmosphere to the game. Choose from 50 cool racing cars inspired by WRC and Group B cars. The arcade racing style, simple controls, and physics make the game suitable for everyone - from kids to adults. Visit Poland, Australia, Greece, and Finland and feel like a real driver. Resoraki also features full controller support, online and offline modes, Steam achievements, Steam Cloud, and options such as sound volume, inputs, etc. The game is available in 91 languages, including PL and EN voices/dubbing, as well as alternative tracks. The game is suitable for kids, teenagers, parents, and you (whoever you are). Don't wait - join the Resoraki races today and experience unforgettable emotions! Selected features Steam Leaderboards (global and among friends) All resolutions supported (16:9, 21:9, etc.) In-game graphics combine retro, comic, and anime styles (unprecedented on a global scale) 3 modes: easy, medium, and expert Unlock various championships, e.g. classic, mini 1/4 mile, mini downhill, etc. Hologram in time trial mode Music with vocals inspired by old, good games on PSX (Playstation 1) Unlock different tracks At least 50 cool racing cars inspired by WRC and Group B cars Casual racing style (simple controls and physics) At least 15 tracks (themes: summer, winter, desert, city) Visit Poland, Australia, Greece, and Finland Some cars have flags on their roof, e.g. USA, Great Britain etc. Options for sound volume, input, etc. Play in championships (league/ranking), time trial, or casual mode Steam Achievements Steam Cloud Auto save progress Full controller support Play with a friend on one computer or online through Play remote (your friend doesn't need the game or a Steam account) 90 languages, including Polish and English voiceovers Alternate routes, shortcuts The game is suitable for children, youth, parents, and you (whoever you are) Loosely inspired by Micro Machines",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2303180/header.jpg?t=1679675990",
    "Price": 0.89,
    "Developers": "Airem",
    "Publishers": "Airem",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2303180/ss_3dac20dea3090512ea6ea5b12a550172077c69d9.1920x1080.jpg?t=1679675990,https://cdn.akamai.steamstatic.com/steam/apps/2303180/ss_bfa29a2cfe98e6c820717e13eb641dfd23647560.1920x1080.jpg?t=1679675990,https://cdn.akamai.steamstatic.com/steam/apps/2303180/ss_0dc93e3f1236d8f7645e4498b89a9732ce3fe22e.1920x1080.jpg?t=1679675990,https://cdn.akamai.steamstatic.com/steam/apps/2303180/ss_0182c1907f9dee630eb14b0cf09b4da5a45ae709.1920x1080.jpg?t=1679675990,https://cdn.akamai.steamstatic.com/steam/apps/2303180/ss_731b6794b316bbcf58a17d292659a30db582b874.1920x1080.jpg?t=1679675990,https://cdn.akamai.steamstatic.com/steam/apps/2303180/ss_bcc0231b1c72bfdfa55c1cc5b3016ecebb1da0f6.1920x1080.jpg?t=1679675990,https://cdn.akamai.steamstatic.com/steam/apps/2303180/ss_6c619e36ef0dc9370d5548379d16fca980981f2e.1920x1080.jpg?t=1679675990,https://cdn.akamai.steamstatic.com/steam/apps/2303180/ss_517b240e99d6edc1709e5234a2fdcca648283530.1920x1080.jpg?t=1679675990,https://cdn.akamai.steamstatic.com/steam/apps/2303180/ss_98d81097c79d327cb8382414187e9f291b98f6a2.1920x1080.jpg?t=1679675990,https://cdn.akamai.steamstatic.com/steam/apps/2303180/ss_7fe73abff23f622d97b92d6492d2a13a0799cf86.1920x1080.jpg?t=1679675990,https://cdn.akamai.steamstatic.com/steam/apps/2303180/ss_efb2e3143f613dcbef0a76372653c11767adb265.1920x1080.jpg?t=1679675990",
    "Slug": "resoraki-the-racing",
    "Meta Title": "Resoraki: The racing: Mar 23, 2023, Airem and Full Overview",
    "Meta Description": "Looking for information on Resoraki: The racing? Check out the release date (Mar 23, 2023), developer insights from Airem, and a complete game summary.",
    "Alt Text Image": "Official header image for Resoraki: The racing game - Steam 2303180",
    "Canonical URL": "https://gusku.site/game/resoraki-the-racing",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Resoraki: The racing\", \"description\": \"Looking for information on Resoraki: The racing? Check out the release date (Mar 23, 2023), developer insights from Airem, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 23, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Airem\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Airem\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2303180/header.jpg?t=1679675990\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.89, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}