{
    "AppID": 1744070,
    "Name": "Solomon Snow: First Contact",
    "Release date": "Mar 31, 2023",
    "About the game": "Save your colleagues, planet and workplace! You are the first line of defense. If you try your best, you might not be the last. Rescue the survivors, fight your way to the roof and EXTERMINATE ALIEN SCUM! No one said it's going to be easy—and it won't. Be smart, be quick, and be on your guard. Oh, and we hope you brought your puzzle-solving skills with you—you just might need them. Therefore, Mr Snow, we sincerely hope you're up for some alien murdering, maze exploring, team building and enemy portal closing-related activities today. Take on the role of an ordinary office guard However, Solomon Snow was born a long time ago, this is where his life really starts to count: this very morning, at the gates of the Futuresalt Corp building. 160 Renaissance Drive. The world could really use a hero right now, but apparently he's all that we've got. We guess you'll just have to do. Shoot, rescue, lead the way! The people you are about to meet on your way come equipped with some exclusive skills and tools: scientists open locked doors, engineers help put with environmental hazards, security officers bring firepower, office workers… well, we're sure they're very warm and interesting people anyway. Who knows: if you manage to use their talents wisely, you might even live a little bit longer. An arsenal of weapons is waiting to be used Shovels, fire extinguishers, crowbars, assault rifles - some of this stuff might come really handy during an alien invasion. On the other hand, doesn't equipping an alien blaster sound like fun? Explore 38 floors of the building The corridors are narrow, the rooms are dark. Danger might be lurking everywhere: in the hallways, deserted open office spaces and server rooms. Fortunately, you're not alone. If you help the survivors, they help you. Now, go scrape some skies, Solomon Snow. Develop your character 15 varied skills divided into 5 skill trees: Soldier, Specialist, Commander, Agility and Vitality. Defeat the bosses There's no defeating a beast without decapitating it. Locate the ranking enemy officers, have a chat with them, and deliver the ultimate message of peace: a bullet to the head. Once war has started, there's no stopping it—only winning This is it. We are NOT alone—however, God only knows we'd prefer to. Solomon Snow: First Contact Retro-flavored shooter featuring puzzle-solving and team-building mechanics, inspired by such classics as: Alien Breed, Half-Life, Duke Nukem and Doom. The game is designed to run smoothly on all kinds of platforms: PC, consoles, smartphones and iiRcade devices, and deliver gallons of intense fun. Saddle up, reload and go save the world.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1744070/header.jpg?t=1680329451",
    "Price": 7.79,
    "Developers": "Futuresalt Entertainment Ltd",
    "Publishers": "Futuresalt Entertainment Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1744070/ss_df836a28a6a1ffbf9e90f9a2576ff6695502a3b1.1920x1080.jpg?t=1680329451,https://cdn.akamai.steamstatic.com/steam/apps/1744070/ss_e544cf2c78b6a663a1e882acbe093b33d473a828.1920x1080.jpg?t=1680329451,https://cdn.akamai.steamstatic.com/steam/apps/1744070/ss_cb24b4d0e4e6be9372601348d059a75819f35174.1920x1080.jpg?t=1680329451,https://cdn.akamai.steamstatic.com/steam/apps/1744070/ss_9643f24ab05219cf72c3ded56ceef4cabcd6578c.1920x1080.jpg?t=1680329451,https://cdn.akamai.steamstatic.com/steam/apps/1744070/ss_f0d64a890596d2a44c4aed1d2dc63187eb02b3f9.1920x1080.jpg?t=1680329451,https://cdn.akamai.steamstatic.com/steam/apps/1744070/ss_d0d2052ed32e907eb30a237135f4529038ad723c.1920x1080.jpg?t=1680329451,https://cdn.akamai.steamstatic.com/steam/apps/1744070/ss_67489a6bc24d4265cfbc01035956fb3c66f62e5d.1920x1080.jpg?t=1680329451,https://cdn.akamai.steamstatic.com/steam/apps/1744070/ss_2d854dc0b553f6581bc09c9b3e6e1fb6a7fd2b2f.1920x1080.jpg?t=1680329451,https://cdn.akamai.steamstatic.com/steam/apps/1744070/ss_d9883b79be6498b82a40a8baa47b5533b972aa24.1920x1080.jpg?t=1680329451",
    "Slug": "solomon-snow-first-contact",
    "Meta Title": "Solomon Snow: First Contact: Mar 31, 2023, Futuresalt Ent...",
    "Meta Description": "Looking for information on Solomon Snow: First Contact? Check out the release date (Mar 31, 2023), developer insights from Futuresalt Entertainment Ltd,...",
    "Alt Text Image": "Official header image for Solomon Snow: First Contact game - Steam 1744070",
    "Canonical URL": "https://gusku.site/game/solomon-snow-first-contact",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Solomon Snow: First Contact\", \"description\": \"Looking for information on Solomon Snow: First Contact? Check out the release date (Mar 31, 2023), developer insights from Futuresalt Entertainment Ltd,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Futuresalt Entertainment Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Futuresalt Entertainment Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1744070/header.jpg?t=1680329451\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}