{
    "AppID": 2328240,
    "Name": "The Alchemist of Ars Magna",
    "Release date": "Mar 31, 2023",
    "About the game": "◆Story Synopsis Once upon a time, the founder of alchemy led people from a dying world to a new land. In this fertile and harmonious land where man-made 'Gods of Creation' act as guardians, humans lead a peaceful existence. However, a long time has since passed, and the 'Dust' of death began to engulf Arcaus. Gods gone mad become heinous 'Gods of Misfortune' and begin to devour the world, and ash demons born of dust bare its fangs at the living. Like burnt pieces of paper and worm-eaten clothes, the world finds itself in an era where the earth was being eroded by the ashes. The people were not entirely unprepared, however. Alchemists who wished to carry on the miracles brought upon by its founder gather at the Cagliostro Academy, a school boasting the highest levels of wisdom. Among them is another—a young alchemist who knocks on the doors of the academy with aspirations in mind. ◆Game Features An RPG set in an academy for alchemists Oblivion is a natural disaster which is set to destroy the world. The protagonist enters the Cagliostro Academy to learn and master the art of combat. And in a school where many alchemists gather, the protagonist of the story accumulates experience through research, study, and love. This is a story of an alchemist who carves out his own path, growing through his encounters and experiences. The world's guardians, 'Gods', and the 'Dust' that threaten them. The world is controlled by a number of man-made gods. However, the 'Dust,' an entity that calls for destruction, not only turns everything in its path into dust, but also contaminates the gods, turning them heinous. With this, alchemists are forced to deal with former gods that have now been turned into guiding forces of misfortune. Make a pact with the great Origin and save the world! The Origin are five gods of varying attributes who serve as the pinnacle of all gods. Equip this and become stronger. Crests are a testament of your contract with the gods You can obtain a crest, or crystals that contain the power of the gods by making a contract with them. Crests can be equipped to personal weapons known as ether gear. This gives the alchemists additional blessings of various skills. As you explore Arcaus, you can build trusting relationships with various gods to help your allies get stronger. The Philosopher's Stone and corruption from the dust will determine your fate. With the Pholosopher's Stone in his body, the protagonist is able to convert dust and ash into energy. However, the more he uses his powers, the more contamination accumulates his body. And if left unchecked, the contamination will eventually become a disaster that could change the fate of the protagonist. ◆Flow of the Game 【Band together against the Dust】 Fend off demons of evil that are trying to turn the world into one of nothing but emptiness and dust! 　＜Ash Demon＞ 　A demon that was reborn as a monster after having been decomposed by the Dust. 　＜Heinous God＞ 　A being that was a guardian of the world, but has been contaminated by the Dust. 　＜Skill-based turn battles＞ 　Battles are turn-based, with a maximum of a party of five battling another party of five. 　You must use individual skills of each character wisely to win the battles. ------------------------- 【Contract with the Gods】 Proceed through the story and overcome the trials to obtain the crests, a proof that you have made your contract with the gods! 　＜Crest＞ 　A proof of the contract between you and the gods, the world's guardians. Their powers reside in crystals known as crests. 　＜Gods with unique characteristics and personalities＞ 　The gods you make contract with will vary in appearance and ability. 　You will be able to make contracts with many different gods as you travel around the continent. 　＜Quest Field＞ 　Quests take you to a field comprised of a turn-based movement system. 　Depending on the points, you may run into monsters and/or be able to obtain items. ------------------------- 【Equipping Crests】 Make sure to arm your character with crests to draw upon the blessings of the gods! 　＜Blessings of the Gods＞ 　Armor unique to alchemists, known as ether gear, can be equipped with crests from the gods. 　Status increases to the character and inherited unique abilities will depend on the characteristics of each god. 　Blessings from the gods will also change value attributes that have an effect in combat. 　＜Ability＞ 　Something that is granted by a crest, or a part of a character's individual features. 　This is what is automatically activated at the start of a battle. ------------------------- 【Synthesizing】 Work together with your heroine to create items from alchemy! 　＜Synthesis System＞ 　Alchemy items that can support you in battle and while you are exploring. 　Alchemy items can be used to create quest items required to progress in the storyline. 　＜Equipment Enhancement＞ 　Ether gears are personal equipment that can be enhanced in different stages. 　The more you strengthen your gear, the more the powerful skills will be unlocked. 　＜Skills＞ 　The skills that you choose to perform during battle is unique to your character. 　These skills, including skills for attack, support, recovery, and more, are essential for achieving victory. ------------------------- 【School Life】 Get to know fellow heroine who will walk beside you in the alchemy academy. There will even be times where you get to compete with rival schools! 　＜Harmonia School＞ 　A school of alchemists who advocate harmony between the world and its gods. The protagonist also belongs to this school. 　This school values the ancient principles of the founding alchemist. 　＜Mardock School＞ 　A radical school that actively seeks to destroy heinous gods and try to use them in their research. 　This school tends to clash with Harmonia School because of the way it treats gods and heinous gods. -------------------------",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2328240/header.jpg?t=1680487150",
    "Price": 31.99,
    "Developers": "Ninetail",
    "Publishers": "PGN Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2328240/ss_7e3f8e14c5cd3e2270b614fa678f3fbc4d924038.1920x1080.jpg?t=1680487150,https://cdn.akamai.steamstatic.com/steam/apps/2328240/ss_36fdf1d0ebba891252f3edf6d73d7d38b0f5527d.1920x1080.jpg?t=1680487150,https://cdn.akamai.steamstatic.com/steam/apps/2328240/ss_5f4b12632e3bd3dc287c96a9a3332cd81129aa9e.1920x1080.jpg?t=1680487150,https://cdn.akamai.steamstatic.com/steam/apps/2328240/ss_7ec59ea7f48995e42c39253804b872fbf62b61aa.1920x1080.jpg?t=1680487150,https://cdn.akamai.steamstatic.com/steam/apps/2328240/ss_f7a816ee092f9bc242e97f599b25fa2b9ab63c71.1920x1080.jpg?t=1680487150,https://cdn.akamai.steamstatic.com/steam/apps/2328240/ss_8d5338d365868ae3e90efcfbb39d1aafb4e58fc4.1920x1080.jpg?t=1680487150,https://cdn.akamai.steamstatic.com/steam/apps/2328240/ss_44c4f4dca7f78979273d8a4fa6b6f8a53f9e3966.1920x1080.jpg?t=1680487150,https://cdn.akamai.steamstatic.com/steam/apps/2328240/ss_e87839ebadde3b14fa2246a8dfee6a61963f101a.1920x1080.jpg?t=1680487150,https://cdn.akamai.steamstatic.com/steam/apps/2328240/ss_dfdceb48321eac90f18e95df8cb05d65ab6c3c47.1920x1080.jpg?t=1680487150,https://cdn.akamai.steamstatic.com/steam/apps/2328240/ss_f0c66e5afbec7786bff3f37b65c3d4909fb0929c.1920x1080.jpg?t=1680487150,https://cdn.akamai.steamstatic.com/steam/apps/2328240/ss_962572b60bef5512366bfdc2e95440eac89e6208.1920x1080.jpg?t=1680487150,https://cdn.akamai.steamstatic.com/steam/apps/2328240/ss_a1f7f3a2b3fa4633e88323adf29ad08ebf2fd3a3.1920x1080.jpg?t=1680487150,https://cdn.akamai.steamstatic.com/steam/apps/2328240/ss_199d54b7cfd0212b20f78fc9a2c45073d8105b26.1920x1080.jpg?t=1680487150",
    "Slug": "the-alchemist-of-ars-magna",
    "Meta Title": "The Alchemist of Ars Magna: Mar 31, 2023, Ninetail and Fu...",
    "Meta Description": "Looking for information on The Alchemist of Ars Magna? Check out the release date (Mar 31, 2023), developer insights from Ninetail, and a complete game ...",
    "Alt Text Image": "Official header image for The Alchemist of Ars Magna game - Steam 2328240",
    "Canonical URL": "https://gusku.site/game/the-alchemist-of-ars-magna",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Alchemist of Ars Magna\", \"description\": \"Looking for information on The Alchemist of Ars Magna? Check out the release date (Mar 31, 2023), developer insights from Ninetail, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ninetail\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PGN Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2328240/header.jpg?t=1680487150\", \"offers\": {\"@type\": \"Offer\", \"price\": 31.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}