{
    "AppID": 2109370,
    "Name": "The Great War: Western Front™",
    "Release date": "Mar 30, 2023",
    "About the game": "The Great War: Western Front is the definitive World War 1 strategy game from Petroglyph, the makers of Command &amp; Conquer™ Remastered &amp; Star Wars™: Empire at War. Play a deciding role in history with this real-time tactical experience as you take charge in the pivotal Western Front from 1914 to 1919. Pick your faction and lead your forces to victory, by directing your armies in gritty real-time battles and by guiding high-level decisions in turn-based strategic gameplay. Dig detailed trenches, research new technologies such as poison gas and tanks, and make decisions that will have a profound and lasting effect on your success. Think like a Commander to either relive history - or redefine it. Discover unparalleled levels of strategic choice as you step into the role of both Theatre Commander and Field Commander. As Theatre Commander, experience enthralling turn-based grand-strategy as you direct the deployment of forces, perform research and carefully consider how you disseminate your resources across the Western Front in a war won by inches. Alongside this, take up the mantle of Field Commander in dynamic real-time battles as you direct units to defeat your opponent, build trenches and perform direct assaults by sending your infantry over the top. Pick your battles and fight them your way to shape the course of history. No play through is the same as you make decisions great and small to change the outcome of the war. Introduce new military technologies earlier in the conflict depending on your advancement of the tech tree, or change pivotal moments in history to alter the outcome of the war. Play your way with four deep and compelling modes. Experience the unfolding saga of World War I in the Campaign, relive iconic moments with Historical Battles, create your own battles in Skirmish or test your strategies against others in memorable Multiplayer action - your journey through this enthralling conflict is unique to you. Battlefields are persistent, and as you continue your push across the Western Front, you will revisit previous battlefields which will still bear the scars and destruction of earlier encounters. Artillery bombardments leave behind craters, tanks, gunfire, and trenches desolate the once lush French countryside, and any trenches (or fortifications) you build remaining in play should you return. Shifting weather also plays a role; as the months draw on in the conflict, you’ll encounter weather changes such as snow and rain which will affect things like artillery performance and unit movement. To secure victory, you’ll need to carefully consider your strategy depending on the conditions. Revel in an authentic historical strategy game that captures the gravity and intensity of The Great War. Partnering with the Imperial War Museums, their expertise enables us to accurately portray these pivotal moments in history. Choose true-to-life infantry, weaponry, artillery and tanks of the time and get into the mind-set of a WW1 Commander as you employ considered tactics and deploy your army across the Western Front. Play as either the Allied Nations or the Central Powers as you make tactical and strategic decisions to earn victory both on the battlefield and in the overarching theatre of war. Both factions have unique abilities and gameplay styles for you to discover and wield.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2109370/header.jpg?t=1680202526",
    "Price": 34.99,
    "Developers": "Petroglyph",
    "Publishers": "Frontier Foundry",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2109370/ss_a1a0921da3664ca84af82905b7639855c38c0d65.1920x1080.jpg?t=1680202526,https://cdn.akamai.steamstatic.com/steam/apps/2109370/ss_7733cd0ec0b66cac7f78bcf2c208be05f4c248a1.1920x1080.jpg?t=1680202526,https://cdn.akamai.steamstatic.com/steam/apps/2109370/ss_65b8692987001e8d08005fdbd429736dd343a346.1920x1080.jpg?t=1680202526,https://cdn.akamai.steamstatic.com/steam/apps/2109370/ss_5ad94818e13cb8354cc5b6e077d5088aae894f1c.1920x1080.jpg?t=1680202526,https://cdn.akamai.steamstatic.com/steam/apps/2109370/ss_e744d689ee4f2d371b37844b9c5d0989515cc145.1920x1080.jpg?t=1680202526,https://cdn.akamai.steamstatic.com/steam/apps/2109370/ss_dbba5026152b70698bda28117566771d7cb3e242.1920x1080.jpg?t=1680202526,https://cdn.akamai.steamstatic.com/steam/apps/2109370/ss_fd324534ca1797f0dc10a6087924727dfad150a8.1920x1080.jpg?t=1680202526,https://cdn.akamai.steamstatic.com/steam/apps/2109370/ss_8ef89a64fba00de84aee1505700c186fc873b8b9.1920x1080.jpg?t=1680202526,https://cdn.akamai.steamstatic.com/steam/apps/2109370/ss_8d939590c6c1cfae863992ebd56977dce0394cd2.1920x1080.jpg?t=1680202526,https://cdn.akamai.steamstatic.com/steam/apps/2109370/ss_d6416913ec85c988299e8815c83af810fdd399ea.1920x1080.jpg?t=1680202526,https://cdn.akamai.steamstatic.com/steam/apps/2109370/ss_2f19eeb93732dfacdbf4279d01bf0582279d4fe1.1920x1080.jpg?t=1680202526,https://cdn.akamai.steamstatic.com/steam/apps/2109370/ss_833b438668216efaa4dcd85a6cf6fcd031ba284e.1920x1080.jpg?t=1680202526",
    "Slug": "the-great-war-western-front",
    "Meta Title": "The Great War: Western Front™: Mar 30, 2023, Petroglyph a...",
    "Meta Description": "Looking for information on The Great War: Western Front™? Check out the release date (Mar 30, 2023), developer insights from Petroglyph, and a complete ...",
    "Alt Text Image": "Official header image for The Great War: Western Front™ game - Steam 2109370",
    "Canonical URL": "https://gusku.site/game/the-great-war-western-front",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Great War: Western Front\\u2122\", \"description\": \"Looking for information on The Great War: Western Front\\u2122? Check out the release date (Mar 30, 2023), developer insights from Petroglyph, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 30, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Petroglyph\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Frontier Foundry\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2109370/header.jpg?t=1680202526\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}