{
    "AppID": 2327690,
    "Name": "The Orphan",
    "Release date": "Mar 29, 2023",
    "About the game": "In 'The Orphan,' players are invited to step into the shoes of Eric, a former orphan who has grown up to become a journalist. Eric's childhood was marked by tragedy and horror, as he lost his family in a horrific accident and was forced to endure the paranormal events that plagued the orphanage where he lived. Now, as an adult, Eric still finds himself haunted by the nightmares of his past. In the game, players must help Eric survive the horrors of the orphanage, which doubles as a school, by solving puzzles, hiding from danger, and finding a way to escape. One of the standout features of 'The Orphan' is its immersive and eerie atmosphere. As players explore the haunted halls of the orphanage, they will encounter unsettling sights and sounds that will keep them on the edge of their seat. The game's use of sound and lighting is particularly effective in creating a sense of dread and tension. 'The gameplay in 'The Orphan' is designed to challenge players and reward their problem-solving skills. From decoding complex puzzles to manipulating objects in the environment, players will need to think creatively and use their intuition to overcome the dangers that lurk in the shadows. The game's puzzles are both immersive and satisfying, offering players a sense of accomplishment as they progress through the game. Whether you're a fan of horror or puzzle-solving, 'The Orphan' is sure to test your wits and keep you engaged until the very end.' As for Eric, he is a complex and relatable character whose struggles will resonate with players. Despite his traumatic past, Eric is determined to survive and to uncover the truth behind the paranormal events that continue to haunt him. Through his journey, players will discover the strength and resilience that Eric possesses, and will be rooting for him to overcome the obstacles in his path. Overall, 'Fans of horror and puzzle-solving will find much to enjoy in 'The Orphan', an atmospheric indie game that delivers a haunting and immersive experience. From its spine-chilling sound effects to its challenging puzzles, the game offers players a thrilling journey through a world filled with danger and intrigue. Whether you're looking for a game that will keep you on the edge of your seat or one that will test your problem-solving skills, 'The Orphan' is an excellent choice that is sure to leave a lasting impression.'",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2327690/header.jpg?t=1680202459",
    "Price": 2.99,
    "Developers": "Yunus Sevin",
    "Publishers": "sevin.games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2327690/ss_eb9f1b08f1001b564d230421a658e4ffd0e5885c.1920x1080.jpg?t=1680202459,https://cdn.akamai.steamstatic.com/steam/apps/2327690/ss_990379b856b5400b42f4b2e64f873a45f8cb90ac.1920x1080.jpg?t=1680202459,https://cdn.akamai.steamstatic.com/steam/apps/2327690/ss_d15001abe7c369f171862343006ba50812fdc529.1920x1080.jpg?t=1680202459,https://cdn.akamai.steamstatic.com/steam/apps/2327690/ss_774ffbc5c1b0229ce7f83a5fd3ed4474017189d9.1920x1080.jpg?t=1680202459,https://cdn.akamai.steamstatic.com/steam/apps/2327690/ss_eedc95d73a22c84c7a39456936f705df72e42d33.1920x1080.jpg?t=1680202459",
    "Slug": "the-orphan",
    "Meta Title": "The Orphan: Mar 29, 2023, Yunus Sevin and Full Overview",
    "Meta Description": "Looking for information on The Orphan? Check out the release date (Mar 29, 2023), developer insights from Yunus Sevin, and a complete game summary.",
    "Alt Text Image": "Official header image for The Orphan game - Steam 2327690",
    "Canonical URL": "https://gusku.site/game/the-orphan",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Orphan\", \"description\": \"Looking for information on The Orphan? Check out the release date (Mar 29, 2023), developer insights from Yunus Sevin, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 29, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Yunus Sevin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"sevin.games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2327690/header.jpg?t=1680202459\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}