{
    "AppID": 2305650,
    "Name": "三国世界 - TKWORLD",
    "Release date": "Mar 31, 2023",
    "About the game": "There is an island in the South Pacific Ocean of the future world. There is a huge adult park with the theme of Cyberpunk Three Kingdoms. The park receives 'players' from all over the world, and realizes the dream of 'three heroes' of 'players' through cutting-edge technology! Here, the 'players' will control the hero clones through the spirit mirror device, explore with other player clones in the huge park, and explore the hidden secrets in the park together! Dear 'player', welcome to take the submarine subway to the 'Three Kingdoms World' theme park. This trip is two hours in total. Your destination is the clone adult park built by Mozi Technology Co., Ltd., where you will play a character of the Three Kingdoms. I wish you a pleasant trip, thank you! In order to create a theme park for players to linger on, the island has built a variety of parks with unique styles. Each park has a unique landscape and ecological environment, as well as unique cloned creatures. These cloned creatures are assigned to each park according to the level, for the entertainment of players of different levels. You can kill them at will, and for this purpose, you will also provide rich trophies to reward players The clones controlled by 'players' and AI clones in the park are essentially artificial intelligence products produced by Mozi Company, so the human legal system has no ethical and moral constraints on these products. 'players' can play heroes and demons here, either right or evil, and even you are allowed to kill clones of other players here, The park strives to let players establish rules here by themselves. You can join forces to form battle teams, or you can kill and loot goods alone. In addition to the innate background of heroes of the Three Kingdoms and some unique characteristics, each clone controlled by 'players' can be redefined by players, that is, his ability, skills, equipment and other elements are all optional for players. Zhao Yun with a spear is not necessarily a soldier, but also a mage. Zhuge Liang with a feather fan and a silk scarf is not necessarily a mage, but also a soldier! Cao Cao can be a shooter and Liu Bei can also be an assassin, Lv Bu can be the strongest shield, Diao Chan can also be the strongest output, and so on. After each hero is controlled by the player, he is just your avatar. How you want to build him is up to you! City siege competition, sword point Chang'an, write your name in the history of the Three Kingdoms When you can go to Cyberpunk's Chang'an City Park, you can participate in the all-weather Chang'an City siege war. If you are strong enough, you can take down the city alone in a thousand. If you feel that two fists are difficult to fight with four hands, you can also invite friends in the game to fight together and win Chang'an City. The world will know your name, and your flag will be planted everywhere, The huge wealth income of each park will belong to you! ——————————- Developer's Readme --------- This game is still an independent and original work. This is the fourth independent online game I have made. Rejecting Krypton Gold and returning the game to original playability is my direction. Thank you for your support —————————————————————————————-",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2305650/header.jpg?t=1680264021",
    "Price": 7.37,
    "Developers": "陈世杰",
    "Publishers": "陈世杰",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2305650/ss_e2a02a7bd626797fae684fd73661b40fde5fa1c7.1920x1080.jpg?t=1680264021,https://cdn.akamai.steamstatic.com/steam/apps/2305650/ss_44f5da165f9a3ba37895dd11e02442b2067484c3.1920x1080.jpg?t=1680264021,https://cdn.akamai.steamstatic.com/steam/apps/2305650/ss_f2ff0f96a40390fbc1349b30149259bd0cd2724c.1920x1080.jpg?t=1680264021,https://cdn.akamai.steamstatic.com/steam/apps/2305650/ss_7d8c978ef335d5f34b11e95656eeabf6bb5a60b7.1920x1080.jpg?t=1680264021,https://cdn.akamai.steamstatic.com/steam/apps/2305650/ss_8103f21eff469b835c97492263c2a0721be15329.1920x1080.jpg?t=1680264021,https://cdn.akamai.steamstatic.com/steam/apps/2305650/ss_58907622eb2eb0282454e0ef036b67940c448bf0.1920x1080.jpg?t=1680264021",
    "Slug": "tkworld",
    "Meta Title": "三国世界 - TKWORLD: Mar 31, 2023, 陈世杰 and Full Overview",
    "Meta Description": "Looking for information on 三国世界 - TKWORLD? Check out the release date (Mar 31, 2023), developer insights from 陈世杰, and a complete game summary.",
    "Alt Text Image": "Official header image for 三国世界 - TKWORLD game - Steam 2305650",
    "Canonical URL": "https://gusku.site/game/tkworld",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u4e09\\u56fd\\u4e16\\u754c - TKWORLD\", \"description\": \"Looking for information on \\u4e09\\u56fd\\u4e16\\u754c - TKWORLD? Check out the release date (Mar 31, 2023), developer insights from \\u9648\\u4e16\\u6770, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u9648\\u4e16\\u6770\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u9648\\u4e16\\u6770\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2305650/header.jpg?t=1680264021\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.37, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}