{
    "AppID": 2353870,
    "Name": "Unsolved Case: Murderous Script Collector's Edition",
    "Release date": "Mar 28, 2023",
    "About the game": "Thrilling detective series of near-hopeless cases full of personal and familial drama is waiting for you! You and your partner Scott have a lot of work ahead. There is the case of the famous city attorney, Richard Errikson, who turns out to have shady dealings. Another day, your buddy calls you to solve the disappearance of his sister’s boyfriend without official orders from the department. People in the media can also have dramatic lives, with all the abductions and a whole chandelier falling on a TV host’s brother. You are left with just a few clues if any. Do you have the courage, the curiosity to uncover the truth? Can you outsmart all worthy opponents? Challenge your investigator skills in this spectacular new Hidden-Object Puzzle Adventure! This Collector's Edition includes: ♟️ Your own choices! You have the opportunity to choose the character's phrases for a particular action and influence the plot of the mystery detective story. Don’t forget that only your choice defines the course of these complex investigations and could affect the characters' lives! ♟️ A variety of achievements! Conduct your own investigation solving intricate puzzles, challenging riddles and playing various mini-games. You need to uncover the truth about numerous murders by searching crime scenes, collecting evidence and interviewing suspects. Lead each investigation and unlock all achievements to highlight your success! ♟️ Bonus materials! Collect all the pieces of evidence and catch criminals, successfully close the cases to gain access to the bonus locations, where you will reveal some interesting details about characters. Some crime cases look impossible to solve, but you can do it, can you? ♟️ Collectible items! A new exciting set of the detective story is full of different clues and mysterious objects that the player needs to find in order to advance in the investigation! Search collector's items at each crime scene and find hidden objects. You will have to be very attentive to gather the entire collection!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2353870/header.jpg?t=1680004961",
    "Price": 13.99,
    "Developers": "Do Games Limited",
    "Publishers": "Do Games Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2353870/ss_9a280b5fe10839108e02fa0052e56ec17107c2be.1920x1080.jpg?t=1680004961,https://cdn.akamai.steamstatic.com/steam/apps/2353870/ss_3a8c19023fd317c1b50c5f53bf083fe9eca9b72d.1920x1080.jpg?t=1680004961,https://cdn.akamai.steamstatic.com/steam/apps/2353870/ss_71fdbe2783fe6db5e42f23288f919490fd3d2927.1920x1080.jpg?t=1680004961,https://cdn.akamai.steamstatic.com/steam/apps/2353870/ss_a6d5bab71d2e5ae8edfb12afdce1b3eb77e76819.1920x1080.jpg?t=1680004961,https://cdn.akamai.steamstatic.com/steam/apps/2353870/ss_e572ff6a89d8d92894abe97ca5f1ccbd259b8f1f.1920x1080.jpg?t=1680004961",
    "Slug": "unsolved-case-murderous-script-collector-s-edition",
    "Meta Title": "Unsolved Case: Murderous Script Collector's Edition: Mar ...",
    "Meta Description": "Looking for information on Unsolved Case: Murderous Script Collector's Edition? Check out the release date (Mar 28, 2023), developer insights from Do Ga...",
    "Alt Text Image": "Official header image for Unsolved Case: Murderous Script Collector's Edition game - Steam 2353870",
    "Canonical URL": "https://gusku.site/game/unsolved-case-murderous-script-collector-s-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Unsolved Case: Murderous Script Collector's Edition\", \"description\": \"Looking for information on Unsolved Case: Murderous Script Collector's Edition? Check out the release date (Mar 28, 2023), developer insights from Do Ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 28, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Do Games Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Do Games Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2353870/header.jpg?t=1680004961\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}