{
    "AppID": 2304090,
    "Name": "Wars of Cards: ROMA",
    "Release date": "Mar 24, 2023",
    "About the game": "Hello everyone. Wars of Cards: ROMA is a multiplayer strategy game created by our small team. Compared with the high-fidelity, brain-burning strategy game masterpieces produced by big companies, Wars of Cards adopts a minimalist gameplay of maps and cards, which can easily satisfy the desire of strategy lovers to color the map. The background of the game is the late period of the Roman republic. The sudden death of the former dictator plunged the city of Rome into a power vacuum and chaos. Governors with some ideas raised troops everywhere in the name of the Senate and the Roman people. The game is turn-based. Multiple players start the game from the base camps of their respective starting plots. Each player starts with 4 cards, and draws another 1 card each round. When it’s your turn to play cards, just choose which cards to play and where to attack and you’re done. After the defender also plays cards, the system will automatically calculate the outcome of the battle. Capturing another player’s stronghold can annex their entire territory. On the contrary, if the base camp is occupied by other players, they will be eliminated and can only watch the battle. According to our tests, it takes about thirty minutes for four players to complete a round. Yes, thirty minutes, make Rome great again! Cards are divided into troop cards, general cards, auxiliary cards, and special cards. Simply speaking, in a set of cards, the command value of a general card multiplied by the sum of the attack value or defense value of all troop cards is the combat power of this set of cards. Auxiliary cards will provide additional bonuses to the value of troop cards and general cards. Each special card has its own special way of playing. For example, when the defense fails, the Vestal Virgin can persuade the opponent to surrender a card; the Chief High Priest will prevent the battle; the Senate will encourage military expansion or force sanctions, etc. At the beginning of the game, there are many neutral plots on the map, which represent small groups of separatist forces. Some plots have clan logos on them. If you have such a land, after the cards belonging to the clan are played, as long as the battle is won, they can be returned to the hand. The maximum number of cards you can hold is 5. When each neutral plot is occupied for the first time, the occupant can draw an extra card. However, if the occupant’s hand is full at this time, no cards will be drawn. All territories must have access to the base camp. If the road between the two is severed, the resulting enclave becomes a neutral plot. The neutral plot is darker in color than a neutral plot that has never been occupied, and a player who recapturing that plot does not gain additional draws. If territory is found to be cut off or the base camp is at risk of falling, you can choose to move the base camp earlier. There is a saying that a tiger is hard against a pack of wolves. Diplomacy is also a big factor in winning the game. Players in the game can type and chat. How to avoid multi-line combat depends on your diplomatic communication skills. The above is a brief introduction to the gameplay of the strategy game Wars of Cards: ROMA. In addition to playing against humans, you can also choose AI as your opponent. If the game can get initial approval from all players, then we will make more maps, cards and upgraded gameplay, and even mods with new themes in the future. We welcome your suggestions for improving the game. We look forward to meeting and learning from each other in the multiplayer battle of Wars of Cards: Rome.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2304090/header.jpg?t=1679653054",
    "Price": 0.99,
    "Developers": "Commander Base",
    "Publishers": "Beijing tactics game Culture Co., Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2304090/ss_0d25d2deb07720f1f77098e7d179724f3c6a3afd.1920x1080.jpg?t=1679653054,https://cdn.akamai.steamstatic.com/steam/apps/2304090/ss_19e7ff5c36eb028f8df747617c61b9bcf2144431.1920x1080.jpg?t=1679653054,https://cdn.akamai.steamstatic.com/steam/apps/2304090/ss_e9d6a1e4da69f33978f9450862f77ac80db21ea4.1920x1080.jpg?t=1679653054,https://cdn.akamai.steamstatic.com/steam/apps/2304090/ss_aff0660321ea8a77429bc605c267e58ffddfee69.1920x1080.jpg?t=1679653054,https://cdn.akamai.steamstatic.com/steam/apps/2304090/ss_b7afd286d55d58523fecf51070bc76bbb593eab6.1920x1080.jpg?t=1679653054,https://cdn.akamai.steamstatic.com/steam/apps/2304090/ss_c7ffb4206c8ff3e37e9392ae3b60a03f7f8d041e.1920x1080.jpg?t=1679653054",
    "Slug": "wars-of-cards-roma",
    "Meta Title": "Wars of Cards: ROMA: Mar 24, 2023, Commander Base and Ful...",
    "Meta Description": "Looking for information on Wars of Cards: ROMA? Check out the release date (Mar 24, 2023), developer insights from Commander Base, and a complete game s...",
    "Alt Text Image": "Official header image for Wars of Cards: ROMA game - Steam 2304090",
    "Canonical URL": "https://gusku.site/game/wars-of-cards-roma",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wars of Cards: ROMA\", \"description\": \"Looking for information on Wars of Cards: ROMA? Check out the release date (Mar 24, 2023), developer insights from Commander Base, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 24, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Commander Base\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Beijing tactics game Culture Co., Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2304090/header.jpg?t=1679653054\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}