{
    "AppID": 486140,
    "Name": "9Grids VR",
    "Release date": "Sep 12, 2016",
    "About the game": "9 Grids VR is an arcade-style, fast-paced, short and easy fun game for the HTC Vive that is a combination of whack a mole and dodgeball in a apocalyptic world. *Please note that you MUST have a HTC vive in order to play the the game!* Slash or blast up your enemies and dodge their attacks by moving physically around the unique 9 Grids movement system! Features Currently 2 Worlds available with 5 levels each. Game-time is approximately 3 minutes for each level. Gameplay ▪ Achieve the highest kill score while taking as little damage as possible ▪ Waves of enemies with increasing difficulty ▪ Defeat a boss at the end of the level [To start round, use weapon to touch 'Start' button. Then use weapon to hit the level orbs that are orbiting around player. To change between worlds, press top left touchpad button] Watch Level Select Tutorial Video at Movement Mechanisms ▪ There are 9 locations (in the form of logs or rocks) and the player can hop to any of the location to dodge projectiles ▪ Layout of the 9 locations is similar to the numpad ▪ Enemies spawn in a separate set of 9 locations in front of the player To move, player has the current two options: Basic - Press trigger and move in real life to hop to the next location in game Auto - Trigger button not required before each hop [Press both triggers to toggle between Basic and Auto] Watch Movement Tutorial Video at Attack Mechanisms Sword: Slash from up to down (vertically or diagonally) or from right to left to unleash a sword arc Hammer (experimental): Hammer motion - Raise the hammer up high and strike downwards - to call lightning strikes Gauntlet (experimental): Punching motion - from back to forwards - to fire energy punches Each weapon has a different hit radius and damage. Possible to wield two different weapons at the same time. [Hold grip button and bring current weapon behind player - Imagine there is a sheath on your back] Watch Weapon Tutorial Video at ------ Developer's Comments The game may still contain several bugs at this point of time. We have priced the game with the consideration to increase prices in the future with more content updates, somewhat like an early access title / pre-order. All proceeds will go towards game content. Early buyers get free content updates although if there isn't much interest in this genre, there's the risk of little future content. We appreciate all feedback and support (in terms of comments or reviews)!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/486140/header.jpg?t=1487492627",
    "Price": 1.99,
    "Developers": "Klexian",
    "Publishers": "Ignite VR",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/486140/ss_527d37dfeb9abcd952af5b8830699c642cbaba77.1920x1080.jpg?t=1487492627,https://cdn.akamai.steamstatic.com/steam/apps/486140/ss_4bb9c4ef69f477c7312c9a8cc31c8945897d48c9.1920x1080.jpg?t=1487492627,https://cdn.akamai.steamstatic.com/steam/apps/486140/ss_3d82b975775cffef334ea95738f4ba33dd851652.1920x1080.jpg?t=1487492627,https://cdn.akamai.steamstatic.com/steam/apps/486140/ss_cc52e4315d35b344d6c15a185711a47f53f63eba.1920x1080.jpg?t=1487492627,https://cdn.akamai.steamstatic.com/steam/apps/486140/ss_82d511541deb0855790d74db5b9a2629149c5899.1920x1080.jpg?t=1487492627",
    "Slug": "9grids-vr",
    "Meta Title": "9Grids VR: Sep 12, 2016, Klexian and Full Overview",
    "Meta Description": "Looking for information on 9Grids VR? Check out the release date (Sep 12, 2016), developer insights from Klexian, and a complete game summary.",
    "Alt Text Image": "Official header image for 9Grids VR game - Steam 486140",
    "Canonical URL": "https://gusku.site/game/9grids-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"9Grids VR\", \"description\": \"Looking for information on 9Grids VR? Check out the release date (Sep 12, 2016), developer insights from Klexian, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 12, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Klexian\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ignite VR\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/486140/header.jpg?t=1487492627\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}