{
    "AppID": 763210,
    "Name": "Amelon",
    "Release date": "Dec 27, 2017",
    "About the game": "It's the year 2047. Bionic prostheses are extremely prevalent in the world. People blindly buy bionic organs. The fact that the protheses break down after a short time was not classified, but was mostly overlooked and neglected by the richest part of population. One of the largest factories in this industry, Pjural, stored industrial waste in a properly designated sector D. The waste was stored underground. Many talented people have been extracting, reworking and selling these parts. The first town of Landfill was founded and Sector D began to grow. There, we meet our hero who after many years spent in the sector had ceased to resemble a human. The main character, Amelon, leads the life of a hermit. Everything that he has achieved, he achieved by himself. His house consists of a small junkyard, a charging station, a film projector, a windmill, and a machine that extracts parts from the underground. His day consists of collecting and extracting parts. However, such a large number of bionic prostheses disturbs memory. Every day he remembers less and less. He distances himself from his past and forgets his relatives. Amelon is aware of the danger, so he records a message for himself about where and who he is. The day is coming when he doesn't remember anything. We wake up in a place that is unknown to us and listen to the news to find out what to do. We break the monotony of our life and make contact with others. We travel the sector D, performing various missions. There are many riddles, difficult choices and adventures on the way. We can collect new items, improve mining machines and the like. In the meantime, memories of the past come back to us for unknown reasons. the Game Lasts Up to Two Hours. there Are Thirteen Achievements to Collect. The game contains two different endings, depending on the choices throughout the game. game includes English dubbing a lot of puzzle arcade challenges humour the possibility of developing your own house trade system side missions Remember and understand your own past Enter the forgotten but unique world of the Sector D. Explore the small cities and discover one-of-a-kind world. Collect and extract materials from underground, and then sell what you gathered. For the earned money, buy mining machines and windmills producing necessary energy. Buy elements for your vehicle and much more. Solve problems and complete missions. Take sensible decisions that greatly impact the plot. If you want to see my next games with good graphics please support me on patreon",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/763210/header.jpg?t=1562935662",
    "Price": 0.99,
    "Developers": "Pjural",
    "Publishers": "Pjural",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/763210/ss_c7f20dcfacd28cfa8d2c4e1f3fa3000a9bcd2f16.1920x1080.jpg?t=1562935662,https://cdn.akamai.steamstatic.com/steam/apps/763210/ss_d269990453e8b5bc49e567a590a47b1a2747dbef.1920x1080.jpg?t=1562935662,https://cdn.akamai.steamstatic.com/steam/apps/763210/ss_ccdabe8d02f9bd11f7c1ad215dc3129d96005fd7.1920x1080.jpg?t=1562935662,https://cdn.akamai.steamstatic.com/steam/apps/763210/ss_a60d8a2b9a50a95d3656fc5d2b3417af6ead0053.1920x1080.jpg?t=1562935662,https://cdn.akamai.steamstatic.com/steam/apps/763210/ss_c5728d8cf3ec2b607192d62505b9e0781c522b97.1920x1080.jpg?t=1562935662,https://cdn.akamai.steamstatic.com/steam/apps/763210/ss_982d83ac8259c0e420e541e0a1701485b290da18.1920x1080.jpg?t=1562935662,https://cdn.akamai.steamstatic.com/steam/apps/763210/ss_b833a5fd0c9bc9e63d40b7280e0dc9c981028637.1920x1080.jpg?t=1562935662,https://cdn.akamai.steamstatic.com/steam/apps/763210/ss_d6cbfe314541fe6ed0891449a83835960b2afc3e.1920x1080.jpg?t=1562935662",
    "Slug": "amelon",
    "Meta Title": "Amelon: Dec 27, 2017, Pjural and Full Overview",
    "Meta Description": "Looking for information on Amelon? Check out the release date (Dec 27, 2017), developer insights from Pjural, and a complete game summary.",
    "Alt Text Image": "Official header image for Amelon game - Steam 763210",
    "Canonical URL": "https://gusku.site/game/amelon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Amelon\", \"description\": \"Looking for information on Amelon? Check out the release date (Dec 27, 2017), developer insights from Pjural, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 27, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pjural\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pjural\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/763210/header.jpg?t=1562935662\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}