{
    "AppID": 523070,
    "Name": "Black Forest",
    "Release date": "Sep 24, 2021",
    "About the game": "This survival/building game puts you in charge of a village in a fantasy version of the dark and dangerous Black Forest in medieval Germany. Hungry wolves have been plaguing the peasants, stealing their chickens at night, and things are about to get worse. Much worse. Assign peasants to tasks and balance gathering and building defenses with harvesting food and maintaining the village. Every decision is final, every loss is permanent. Every mistake brings you closer to be swallowed by the forest, your people's story forgotten and lost in the sands of time. Gameplay Similar to a real-time-strategy (RTS) or city-building game, you build and repair houses, fences, walls, watchtowers and others in your village, using resources and labour. The peasants of the village are your pool of labour, you can send them to gather resources, plant and harvest fields, construct buildings and so on. Come nightfall, everything changes. The inhabitants of the forest come out to play. Wolves and bears are terrifying enough, but there is worse, much worse out there. Help is many days away, and until the king's knights arrive, the villagers can only hope, pray, and count their losses once the sun rises again. Losing a peasant also means losing someone from your workforce. As the monsters take their toll, your options shrink. Mistakes snowball into shortages. Decisions that seemed so easy and unimportant early on now turn out to be vital - or deadly. You never have enough actions or resources to do everything you want to do, get used to it. It's essentially a resource-shortage management game. Unique Factors While Black Forest has city-building aspects, the gameplay is not about expansion and growth, but about defending what you have. This keeps the play small and manageable and makes decisions more meaningful. While there are strategy aspects, the game is about survival, not conquest. You cannot effectively fight back against the monsters. Hanging on, even by the skin of your teeth, can be a victory. It is a game about standing against impossible odds, and with clever planning and timely execution making it through hell. This also keeps individual games to a manageable length. You can complete a whole game in one session, no problem, it will take around one hour, depending on how much you slow down or speed up time. And while it has management aspects, you will find only the slighest hint of supply chains and 'need to build this before I can build that' logic. You need to manage your resources and your workforce. You do not need to explore a tech tree or dependencies. The game does not artificially limit what you can do. It is also decidedly not an expansion game. Your village population does not grow by building more houses. Defend your villagers well. While houses can be rebuilt, people are gone forever. Some Special Features Here is an incomplete list of things that make Black Forest an immersive experience. A full weather system simulates everything from temperature and clouds to rain- or snowfall. These things are not just cosmetic, but influence the game. If it is too dry, for example, fields will not yield as much food and you have to build a well to water them manually. The peasants of your village will leave their homes in the morning to go about their daily tasks, wander around your village, return home in the evening and more: Many monsters have unique, intelligent behaviour. They can move around obstacles within reason, exploiting holes in walls if they can spot them, target specific buildings - knowledge of creature behaviour can be exploited to your advantage as well, if you know how... Extensive end-of-game statistics allow you to review your game and understand where you succeeded and where you failed. Tons of details in villager behaviour, monster abilities and building effects are waiting for you to be discovered and used strategically, while the basics are laid out in an easy-to-understand in-game manual as well as on-screen help, so you can pick them up quickly. The game is made with love and attention to detail. There are hundreds of small things to discover just for the fun of it. For example, if you have chickens, the rooster will let you know when the sun rises. Every peasant has a personal diary. Smoke rising from house chimneys tells you if they are heating (i.e. nights are cold). An extensive weather system, sky system with stars at night and lots more small things. Early Access The game is fully playable, but still being polished, balanced and improved.. The current version has the free play mode, while the story/campaign gameplay with narrative and branching dialogs is still under development. Some buildings and other features are not yet available. However, updates are coming constantly. Follow the community channels to stay up to date on the development progress.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/523070/header.jpg?t=1653592890",
    "Price": 0.0,
    "Developers": "Lemuria",
    "Publishers": "Lemuria",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/523070/ss_c856b8f16a694bb8fcc7943250833f90adfa34ea.1920x1080.jpg?t=1653592890,https://cdn.akamai.steamstatic.com/steam/apps/523070/ss_0da559b1723dc89855ca3a20e40f5bc07ba4e581.1920x1080.jpg?t=1653592890,https://cdn.akamai.steamstatic.com/steam/apps/523070/ss_ab382907b49b6f8f7ec9fa19ecd27fd9ca22219b.1920x1080.jpg?t=1653592890,https://cdn.akamai.steamstatic.com/steam/apps/523070/ss_997393bfab4c35672d2532b84c66904d4e132b30.1920x1080.jpg?t=1653592890,https://cdn.akamai.steamstatic.com/steam/apps/523070/ss_d92c126f90598f3b77e86833bf5aa0ea0002267f.1920x1080.jpg?t=1653592890,https://cdn.akamai.steamstatic.com/steam/apps/523070/ss_0fbe21e26e04c06a049e975e7c2babf5f5fa6edc.1920x1080.jpg?t=1653592890",
    "Slug": "black-forest",
    "Meta Title": "Black Forest: Sep 24, 2021, Lemuria and Full Overview",
    "Meta Description": "Looking for information on Black Forest? Check out the release date (Sep 24, 2021), developer insights from Lemuria, and a complete game summary.",
    "Alt Text Image": "Official header image for Black Forest game - Steam 523070",
    "Canonical URL": "https://gusku.site/game/black-forest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Black Forest\", \"description\": \"Looking for information on Black Forest? Check out the release date (Sep 24, 2021), developer insights from Lemuria, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 24, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lemuria\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lemuria\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/523070/header.jpg?t=1653592890\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}