{
    "AppID": 1141750,
    "Name": "缸中之脑：谎言（Brain in a vat lies）",
    "Release date": "Sep 12, 2019",
    "About the game": "Synopsis: The protagonist made a strange dream at the beginning, and the dream met five years ago. The missing loved one, and told him something he could not understand, When I woke up, I found myself in the original room. He strangely disappeared five years ago. On that day, where did she go, in order to find her, go out to take risks, In the adventure, I encounter all sorts of strange things, and, I met a strange person, and on the adventure, those who used to Memory, one by one, and that place is getting closer and closer to what you want Know the truth, but is the truth really as good as I thought? How to defeat the enemy: When encountering an enemy, you need to be aligned with the enemy on a line. Press the D button to raise the gun and press the C button to shoot. Successful killing of enemies can gain experience points, and experience points can be used to strengthen your talents. About talent: You need to defeat your enemies to gain experience points, Each skill point requires some skill points. For example, the first talent, only one skill point, The second talent requires two skill points, and so on... About decryption: In fact, it is not difficult. If you really don't know how to decrypt it, please press the Z button. A white circle will appear on the screen. This is a hint, you just need to press the C button directly. About the map: You can collect some of the items you need on the map, such as lavender, batteries, synthetic drawings, lavender can be refined into purified material, and the battery can recharge your flashlight. Synthetic drawings are used to make reinforced parts, but these require you to find About the flashlight: Press the A button to turn on the flashlight. If the map is too dark, you can turn it on. However, it is necessary to consume the battery power, and the battery power is displayed in the status bar at the lower right corner. Try using talent skills to offset battery consumption or find batteries on the map About the button: Arrow key operation, Z prompt, X menu, C confirmation / firing, A flashlight, D gun / drop, S mission Easy Raiders: Press the Z button, a white circle will appear on the map, then follow the process, go out, see the mysterious person below, then enter the room next to read the book, then come out to get the envelope, then come to a meadow, enter the hut The password at the cabin is 506, the next cabinet is the password prompt. On May 6th, when you get the rifle, you can press the D button to lift it, then press the C button to fire, then press the D button to close it. After that, I followed the process and started the plot down at the sewer. Some monsters, all the way through, until the end, there will be light, and then come to another place, you can see the mysterious people through the graveyard. After the conversation, read the book on the table, go to another place, read the book below the hall, go to the middle to check the password, then enter the basement to get the key, leave and go to another place, you can get the fuse under the table, then Go back to the above repair switch, then turn it on, then go up, go to a place, follow the process and go straight, there are some monsters on the road, you can bypass, know to go 7 The room on the far left of the building triggers the plot, enters the room, goes to the right to find the videotape, and plays it on the TV next to it. After that, the story will prompt to leave the room. Some monsters along the road can also be bypassed. There is a local gate in the middle. It is necessary to trigger the dialogue above, then the door will open, come outside, trigger the final plot, the protagonist will be transmitted to somewhere, then go to the basement, talk to the mysterious person, and finish.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1141750/header.jpg?t=1569164402",
    "Price": 0.99,
    "Developers": "cv006_64",
    "Publishers": "cv006_64",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1141750/ss_20fea72ba5ac69d282bc98bb169d0bc46a315cb3.1920x1080.jpg?t=1569164402,https://cdn.akamai.steamstatic.com/steam/apps/1141750/ss_afd5f7b3065fdc431b28ff8e2daed64df53e5dae.1920x1080.jpg?t=1569164402,https://cdn.akamai.steamstatic.com/steam/apps/1141750/ss_e231c741c9c84a88db878655446ae330b61523f3.1920x1080.jpg?t=1569164402,https://cdn.akamai.steamstatic.com/steam/apps/1141750/ss_c205e8893d278ade1d97874a5ba07827f1935cf7.1920x1080.jpg?t=1569164402,https://cdn.akamai.steamstatic.com/steam/apps/1141750/ss_426e5bf95e08724f2e68add6499cbacad4c6a6b3.1920x1080.jpg?t=1569164402,https://cdn.akamai.steamstatic.com/steam/apps/1141750/ss_9b6b8c4235dcc6da01de8f475e3e2df0d9c387ab.1920x1080.jpg?t=1569164402,https://cdn.akamai.steamstatic.com/steam/apps/1141750/ss_5b2f93a9b8b4cf5db863a62d4f8a4fe709d61f44.1920x1080.jpg?t=1569164402,https://cdn.akamai.steamstatic.com/steam/apps/1141750/ss_7c9a7b306db1b71392cb4c499e36b77c69267bcd.1920x1080.jpg?t=1569164402",
    "Slug": "brain-in-a-vat-lies",
    "Meta Title": "缸中之脑：谎言（Brain in a vat lies）: Sep 12, 2019, cv006_64 and ...",
    "Meta Description": "Looking for information on 缸中之脑：谎言（Brain in a vat lies）? Check out the release date (Sep 12, 2019), developer insights from cv006_64, and a complete gam...",
    "Alt Text Image": "Official header image for 缸中之脑：谎言（Brain in a vat lies） game - Steam 1141750",
    "Canonical URL": "https://gusku.site/game/brain-in-a-vat-lies",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u7f38\\u4e2d\\u4e4b\\u8111\\uff1a\\u8c0e\\u8a00\\uff08Brain in a vat lies\\uff09\", \"description\": \"Looking for information on \\u7f38\\u4e2d\\u4e4b\\u8111\\uff1a\\u8c0e\\u8a00\\uff08Brain in a vat lies\\uff09? Check out the release date (Sep 12, 2019), developer insights from cv006_64, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"cv006_64\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"cv006_64\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1141750/header.jpg?t=1569164402\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}