{
    "AppID": 1597060,
    "Name": "Bubbaruka!",
    "Release date": "Jun 21, 2021",
    "About the game": "From: John Subject: Bubbaruka Hey, it's been a little bit! I know it's a bit strange for me to Email you out of the blue, but I thought you'd be interested in this. You remember that old toy? The one that was supposed to be like a pet in your keychain? The one that never got released? Well I found it. I was just cruising around eBay, and I found a super cheap laptop for sale. The owner acted real weird, refused to take phone calls, only let me talk to him via Email. But you know, cheap product cheap service. Turns out the laptop had something in it already, a folder called Bubbaruka. The name jogged so many memories, I remember begging my mom to get me one for Christmas. Never knew why they didn't release them. They would've made tons. But It's here! Seems fully functioning, just like the commercials! I didn't start much, I rushed to Email you first. I know you're into lost media, missing games, that sort of thing. This is right up your alley, right? Still, It's a bit buggy. It definitely seems unfinished, and some of the features straight up don't seem to work, but it's a fun nostalgia trip. Welp, I'm gonna go play the game for like, 30 minutes before I get bored and forget it exists. Talk to you later! Attached: Bubbaruka.zip The toy of the modern age! Endless fun for all ages! Pick an egg, and you now have your very own Bubby! Feed it, play with it, and watch it grow! The possibilities with your Bubby are endless! But be careful, sometimes, things might be lurking in the shadows. Don't stray too far from the path. Don't be an explorer. Don't be a hero. There's a reason the game was never released. A reason the world isn't ready for. Don't look into it. Don't follow the whispers. Don't peel back the curtain. Don't solve the puzzles. Don't go through the cracks in the surface. Don't touch them. Don't follow them. Don't let them catch you. Take heed of these warnings Or suffer the consequences. Bubbaruka is an atmospheric puzzle horror game where you explore an 'abandoned' game made for children, hiding dark secrets under the surface. Gameplay consists of solving puzzles, reading left-behind notes, and exploring the game; while avoiding getting caught by the adversaries that lurk in the dark. Top-down 2D puzzle exploration is interspersed with first person horror segments as well as portions involving caring for your pet. Features 5-7 hour playtime 2D Retro Graphics Cast of cute playable characters Two endings + Plenty of secrets to uncover Intense first person horror segments Ghoulish creatures stalking your every turn A hidden story that beckons you deeper into the game An extensive post-game storyline with combat and a secret boss for those who desire more, with 2-4 hours of additional playtime. Visit our merch store!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1597060/header.jpg?t=1650275512",
    "Price": 4.99,
    "Developers": "Benjamin Schade",
    "Publishers": "Benjamin Schade",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1597060/ss_bdad0a6e83aed8b1958a0768871cb5a962efe32d.1920x1080.jpg?t=1650275512,https://cdn.akamai.steamstatic.com/steam/apps/1597060/ss_f621d9e3b7ec6cb587d3352722c4b38aa6ae33ce.1920x1080.jpg?t=1650275512,https://cdn.akamai.steamstatic.com/steam/apps/1597060/ss_d6616bfbbac26b478ee2a61d5acf34961de77366.1920x1080.jpg?t=1650275512,https://cdn.akamai.steamstatic.com/steam/apps/1597060/ss_f7e3f9f7e85fc93fb4b39f046a5ab93a0bb5d815.1920x1080.jpg?t=1650275512,https://cdn.akamai.steamstatic.com/steam/apps/1597060/ss_bd2d442b0c95db06abe9633785c1bae9b44f72f9.1920x1080.jpg?t=1650275512,https://cdn.akamai.steamstatic.com/steam/apps/1597060/ss_04693cc217e858695fad039721ceae2a2c6ff8be.1920x1080.jpg?t=1650275512,https://cdn.akamai.steamstatic.com/steam/apps/1597060/ss_60b5e89821cc463e9b8674cfd9a225b0e477b27e.1920x1080.jpg?t=1650275512",
    "Slug": "bubbaruka",
    "Meta Title": "Bubbaruka!: Jun 21, 2021, Benjamin Schade and Full Overview",
    "Meta Description": "Looking for information on Bubbaruka!? Check out the release date (Jun 21, 2021), developer insights from Benjamin Schade, and a complete game summary.",
    "Alt Text Image": "Official header image for Bubbaruka! game - Steam 1597060",
    "Canonical URL": "https://gusku.site/game/bubbaruka",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bubbaruka!\", \"description\": \"Looking for information on Bubbaruka!? Check out the release date (Jun 21, 2021), developer insights from Benjamin Schade, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 21, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Benjamin Schade\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Benjamin Schade\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1597060/header.jpg?t=1650275512\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}