{
    "AppID": 493180,
    "Name": "Dynasty Feud",
    "Release date": "May 23, 2017",
    "About the game": "Dynasty Feud is a competitive, team-based, fast-paced platform brawler for 2-4 players. Play either local or online and show off your skills with 40 characters, one-hit kills, multiple fighting skills and a lot of style. OK, but... what does that mean? Well, Dynasty Feud is different from other brawlers out there, taking inspiration from several genres to offer an experience that is faster, leaner, and a lot of fun! Beat other dynasties in the ultimate battle between time periods in free-for-all and team matches. Customize your own dynasty in the ALL-STAR MODE. Challenge other players in quick ONLINE matches or rise to the top in RANKED MODE. Master all 40 CHARACTERS of the 8 DYNASTIES currently available! In Dynasty Feud you won’t pick a character to fight, you will pick a whole dynasty formed by 5 of them. The characters are your life bar, if you lose all of them, that’s it, you are done. What, really? No way! And they die fast, really fast, REALLY REALLY FAST; one hit and that character is gone. Yeah, gone. The next character will appear, but it will be a totally different one, with its own weaknesses and strengths. Value your characters and measure your movements carefully. Knowing their capacities and how to use them is as important as knowing your enemies. Plus there are 40 like this, so... have fun. A miscalculated jump, a surprise burst or missed attack can be the difference between death and glory. Uuuhh, that sounded serious. Each character is unique. Each character plays different. Each dynasty is special. From melee juggernauts to sneaky snipers, along with invisible ninjas and a TNT-loving cactus, a true Dynasty Master can adapt to any opponent by making the most of each of its family members. Let's see who they are shall we... The Cartwrongs are specialized in LONG and MEDIUM RANGE bullet attacks. Their key to victory is to keep enemies away by using their zoning abilities. The Yngling Clan is a well balanced dynasty that specializes in very strong MELEE and effective MEDIUM RANGE THROWS, as well as good defense and mobility. With a good mix of PROJECTILE, EXPLOSIVES and MELEE, the Fancier's Crew are a pretty balanced bunch. The Nekoyama-Shi is the most MOBILE dynasty in the game, with excellent MELEE aptitudes to boot. Take advantage of both. The Uurg Aaarg members are a mixed bunch with decent PROJECTILE and mid range capacity, as well as some powerful MELEE options. They are hard to control, but powerful once you master them. The House of Arthur is an exceptionally resilient dynasty, with many of its members having shield and armor. They do sacrifice mobility and reach. The People of the Sun's main strength is in their powerful SUPER FEUD attack, in which each character gains a special power, coupled with their ability to sacrifice themselves to automatically fill the SUPER FEUD meter. The Project X-22 subjects rely on their unique mind power mechanic. They spend mind energy to attack, which they then need to recharge. However, if they have enough mind energy saved up, they can withstand a hit. Probably the trickiest dynasty to master.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/493180/header.jpg?t=1590266978",
    "Price": 0.0,
    "Developers": "Kaia Studios",
    "Publishers": "Kaia Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/493180/ss_218b8a87e6128f4c67746862c8b74a2347e3ee48.1920x1080.jpg?t=1590266978,https://cdn.akamai.steamstatic.com/steam/apps/493180/ss_2a3d1b3f0e30092bedf1f9111a2ea953b4685132.1920x1080.jpg?t=1590266978,https://cdn.akamai.steamstatic.com/steam/apps/493180/ss_46cdc1e27f8533d4b593f455d667680c041984f6.1920x1080.jpg?t=1590266978,https://cdn.akamai.steamstatic.com/steam/apps/493180/ss_68ab4ed9136293947f54c46fc8acb97cb519fdf3.1920x1080.jpg?t=1590266978,https://cdn.akamai.steamstatic.com/steam/apps/493180/ss_91409511cc064917a05bf588387fee141971f3b3.1920x1080.jpg?t=1590266978,https://cdn.akamai.steamstatic.com/steam/apps/493180/ss_c4ec15442546244c329e6fa6c20763cf3b2b207a.1920x1080.jpg?t=1590266978,https://cdn.akamai.steamstatic.com/steam/apps/493180/ss_cb75913fb734c624d89d765d428b3e212cc4ffc3.1920x1080.jpg?t=1590266978,https://cdn.akamai.steamstatic.com/steam/apps/493180/ss_95ed93658faf0fc932e5a167eee179d1db360e65.1920x1080.jpg?t=1590266978",
    "Slug": "dynasty-feud",
    "Meta Title": "Dynasty Feud: May 23, 2017, Kaia Studios and Full Overview",
    "Meta Description": "Looking for information on Dynasty Feud? Check out the release date (May 23, 2017), developer insights from Kaia Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Dynasty Feud game - Steam 493180",
    "Canonical URL": "https://gusku.site/game/dynasty-feud",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dynasty Feud\", \"description\": \"Looking for information on Dynasty Feud? Check out the release date (May 23, 2017), developer insights from Kaia Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 23, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kaia Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kaia Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/493180/header.jpg?t=1590266978\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}