{
    "AppID": 718540,
    "Name": "Exorcism: Case Zero",
    "Release date": "Oct 12, 2017",
    "About the game": "You might have heard stories about it. You might have read articles about it. You might have watched movies about it. But have you ever wonder what it would be like, if you have the chance to perform an exorcism yourself? The year is 1998. Taking the role as Father Thomas Gates, you have been assigned to perform an exorcism ritual to a woman named Mary Kennedy, which was reported to have been possessed by evil spirit. Due to drastic deterioration of Mary's condition, you were contacted by her father to perform the exorcism a day in advance without any support from the church. Are you ready to face the horrible truth and the force of evil behind this possession? Can you maintain your faith? Can you maintain your vigilance? Can you endure this battle between the good and evil? Can you cast out the demon before Mary succumb to the excruciating pain and stress? There are multiple endings for you to discover. There are multiple approaches that you can take to worn down the evil spirit. There are multiple difficulties for you to conquer. Now, bear your cross and face your inner demon. Major Game Features: Voice acting and subtitles: Voice acting and subtitles are available for game actions, conversations and storytelling. Immersive gaming environment: Game environment will adapt accordingly when you advance further into the game. Increase of paranormal activities, evil apparitions, unholy signs and disturbances will keep you immersed. Test of your reflexes: There will be evil apparitions and creatures that manifest themselves during your exorcism ritual. You will need to stop them from disturbing your ritual. There are also interactive items to help you prevent evil apparitions from appearing. Make sure you keep your eyes on these items! They are essential to your victory! Multiple approaches: You are free to perform your exorcism using the 4 different actions: 'Present crucifix'; 'Blessing'; 'Sprinkle holy water' and 'Bible citing'. Each action has different effects on both the possessed subject and the evil spirit, and with their own advantages and disadvantages. Try to develop your own action combo to cast out the evil spirit before dawn, whilst preventing the subject from death. Simple, yet intricate resources system: As the player, you have two resources: 'Faith' and 'Stamina'. 'Faith' is important to keep yourself sane during the exorcism ritual. 'Stamina' is required to perform exorcism actions. 'Spirit Strength' of the evil spirit will need to be reduced, until the evil spirit could be cast out. 'Host's Health' of the possessed subject is another resource that you need to keep an eye on, as the subject will succumb to stress and pain caused by the ritual. Finally, there is one most important resource, 'Time'. Since you must cast out the evil spirit before dawn, as the subject will succumb to extended period of exorcism. Underlying story and secrets to reveal: During the exorcism ritual, you will discover the story behind the possession and secrets will be revealed by the provoked evil spirit.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/718540/header.jpg?t=1657818374",
    "Price": 4.99,
    "Developers": "Pippala Games",
    "Publishers": "Pippala Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/718540/ss_477d28db7e1ec9499ba499207baf6a9d580ce666.1920x1080.jpg?t=1657818374,https://cdn.akamai.steamstatic.com/steam/apps/718540/ss_09268f3e93cdc7a609f381599ea6e95d7251d91d.1920x1080.jpg?t=1657818374,https://cdn.akamai.steamstatic.com/steam/apps/718540/ss_2e0545aeb1d625de29ee11f8fee89385466d576e.1920x1080.jpg?t=1657818374,https://cdn.akamai.steamstatic.com/steam/apps/718540/ss_53fa837002c87a8493a5190b25f949509e1d47db.1920x1080.jpg?t=1657818374,https://cdn.akamai.steamstatic.com/steam/apps/718540/ss_387d583035a77d1361e4b1d2c5cd239f83ce1f1d.1920x1080.jpg?t=1657818374,https://cdn.akamai.steamstatic.com/steam/apps/718540/ss_dfcf2f60d654a1d4f070dc3d3ce8b3480f81af0c.1920x1080.jpg?t=1657818374,https://cdn.akamai.steamstatic.com/steam/apps/718540/ss_899c37347615e28f3f90042460c74cdd5fda1c4c.1920x1080.jpg?t=1657818374,https://cdn.akamai.steamstatic.com/steam/apps/718540/ss_4e88e58646ad4478e553479c1e0f066153c97a11.1920x1080.jpg?t=1657818374,https://cdn.akamai.steamstatic.com/steam/apps/718540/ss_209865eb965d4b79aebef5de38a05da95bb5926b.1920x1080.jpg?t=1657818374,https://cdn.akamai.steamstatic.com/steam/apps/718540/ss_411fc8de21cc48e29f8f6b142c14ea4b8522abde.1920x1080.jpg?t=1657818374,https://cdn.akamai.steamstatic.com/steam/apps/718540/ss_aceed848620a4c5c44dc31cc105f8100965c374c.1920x1080.jpg?t=1657818374",
    "Slug": "exorcism-case-zero",
    "Meta Title": "Exorcism: Case Zero: Oct 12, 2017, Pippala Games and Full...",
    "Meta Description": "Looking for information on Exorcism: Case Zero? Check out the release date (Oct 12, 2017), developer insights from Pippala Games, and a complete game su...",
    "Alt Text Image": "Official header image for Exorcism: Case Zero game - Steam 718540",
    "Canonical URL": "https://gusku.site/game/exorcism-case-zero",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Exorcism: Case Zero\", \"description\": \"Looking for information on Exorcism: Case Zero? Check out the release date (Oct 12, 2017), developer insights from Pippala Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 12, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pippala Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pippala Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/718540/header.jpg?t=1657818374\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}