{
    "AppID": 802400,
    "Name": "Fhtagn! - Tales of the Creeping Madness",
    "Release date": "May 22, 2018",
    "About the game": "Check out these fun Fhtagn! gameplay videos by Streamers ;t -EI&amp;t What the Fhtagn! is this all about? Dubbed the 'funniest take on mystic doomsday cults in years', Fhtagn! is a text based adventure game, where choices matter! Play as one of four cultists intent on destroying the world by summoning an Ancient Horror. Decide how you will be preparing for the final ritual by visiting various locations in the unsuspecting town of Arkham and navigating iconic Lovecraftian events. Battle investigators, gangs, corrupt cops and horrors from the Depths to bring about the end of the world! This text-based adventure game boasts: 93 000 words. Across 113 events with 370 potential story outcomes. Fulfil 1 of 24 roles with 56 role feedback stories. 142 different character endings. This boardgame-esque game shines in local co-op or screen-share with friends and it is a casual game that will provide loads of entertainment. With snazzy graphics, betrayal is best served with a jazzy/swing soundtrack and neo-noir visuals. Gameplay in a nutshell You are a cultist intent on destroying the universe by summoning the Ancient One. Why? Damned if we know… You can play on your own or with up to 3 friends in couch co-op. You have 6 rounds to build up the required stats needed to use the ritual items, but you will need to figure out which stats those are through some trial and error. You can visit 1 location per round and attempt the Lovecraftian stories at that location, to improve your stats. Finally, put your stats to the test as you try to summon the Ancient One. Will everyone pass or fail or will one of you betray the rest and grab all the glory? Features Short and silly events in a Lovecraftian universe. Randomized stories based on location. Useable items (with Dark Young expansion). Varied game modes (with Dark Young expansion). Community created content. Experience new stories from the community or create your own. Replayability and minimization of content fatigue by giving new or unseen stories a higher chance of appearing. Short gameplay, ideal for those downtime moments or while in a queue for another game. Non-linear gameplay. Multiple endings. Multiple Ancient Ones, items and opponents. (with Dark Young expansion). Steam Achievements. Steam Cloud Support, to track your progress. Play cooperatively or be a backstabbing traitor. Players can write their own stories for the game We are so passionate about the idea of stories that we created an application, the Fhtagn! Content Creator, for players to write their own stories for the game and enjoy it with their friends. All that is needed is a story idea and no programming is required. We provided players with a Quick start video guide, Content Creator Guide and even released all of Fhtagn!'s event stories to aid in this process. If you are interested in creating your own stories, you can check out more information on our Content Creator, on our forum page . Join the community We want to help community members create their own story packs (cooperative or solo endeavours) for the game and the Fhtagn! Discord server is a great space to test ideas, get feedback and to receive assistance and guidance from us. There is only one thing we like more than making games and that is to connect with the community. Feel free to drop us a comment on the forum and you can also find us on various social media platforms. Do you like... ✅ Interactive stories ✅ Fun community hangouts ✅ Imaginary bootleg liquor ✅ Cultist shenanigans Then you will love Fhtagn!'s discord server ! We want your experience with Fhtagn! to be as enjoyable as possible, so please do not hesitate to provide us with any feedback. If you want to just chat, report some bugs or if you find anything misleading on our store page, we'd like to hear from you on our social media or here on the forums. Language Unfortunately, Fhtagn! is only available in English. We currently don’t have the resources to produce the game in other languages, in a way that is authentic and will do the stories and humor in it justice. However, we encourage players to create content in any languages they want and spread the madness that is Fhtagn! We will happily support any UI language localization changes should there be sufficient need.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/802400/header.jpg?t=1610190395",
    "Price": 9.99,
    "Developers": "Design Imps",
    "Publishers": "Design Imps",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/802400/ss_9cf22b11e8cf251e389f8ab2560ff3b79996a0d2.1920x1080.jpg?t=1610190395,https://cdn.akamai.steamstatic.com/steam/apps/802400/ss_d4f86df6be90fdfc2571d91fd31d9fbe37d49060.1920x1080.jpg?t=1610190395,https://cdn.akamai.steamstatic.com/steam/apps/802400/ss_e163e8bf51b67dd75ca84a59ad657e31c2f86b92.1920x1080.jpg?t=1610190395,https://cdn.akamai.steamstatic.com/steam/apps/802400/ss_59820db34813be52646912dc3a5e53ddd545ef54.1920x1080.jpg?t=1610190395,https://cdn.akamai.steamstatic.com/steam/apps/802400/ss_429821271bc69380332e5e37c6aa7b71f4af37d2.1920x1080.jpg?t=1610190395,https://cdn.akamai.steamstatic.com/steam/apps/802400/ss_d085e2127bb3db691d854a8cb0ce937d34f179b0.1920x1080.jpg?t=1610190395,https://cdn.akamai.steamstatic.com/steam/apps/802400/ss_7c6656bd1d1f33c7781c26583a2740c80ae0eed5.1920x1080.jpg?t=1610190395,https://cdn.akamai.steamstatic.com/steam/apps/802400/ss_622908be9df9a4d820f04a9661a3caf5f907e5ee.1920x1080.jpg?t=1610190395,https://cdn.akamai.steamstatic.com/steam/apps/802400/ss_89e089451b9d8b58833c3a23988dc96649c4ad86.1920x1080.jpg?t=1610190395,https://cdn.akamai.steamstatic.com/steam/apps/802400/ss_08fc7fd862e211f7949699d9c42d159943436ee8.1920x1080.jpg?t=1610190395,https://cdn.akamai.steamstatic.com/steam/apps/802400/ss_f8850122329c77511b145f7e44345de29980149f.1920x1080.jpg?t=1610190395",
    "Slug": "fhtagn-tales-of-the-creeping-madness",
    "Meta Title": "Fhtagn! - Tales of the Creeping Madness: May 22, 2018, De...",
    "Meta Description": "Looking for information on Fhtagn! - Tales of the Creeping Madness? Check out the release date (May 22, 2018), developer insights from Design Imps, and ...",
    "Alt Text Image": "Official header image for Fhtagn! - Tales of the Creeping Madness game - Steam 802400",
    "Canonical URL": "https://gusku.site/game/fhtagn-tales-of-the-creeping-madness",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fhtagn! - Tales of the Creeping Madness\", \"description\": \"Looking for information on Fhtagn! - Tales of the Creeping Madness? Check out the release date (May 22, 2018), developer insights from Design Imps, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 22, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Design Imps\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Design Imps\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/802400/header.jpg?t=1610190395\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}