{
    "AppID": 1605600,
    "Name": "Final Stand: Ragnarök",
    "Release date": "Oct 28, 2021",
    "About the game": "AVAILABLE NOW IN EARLY ACCESS Final Stand: Ragnarök pits you and up to nine legendary allies against the forces of Hel, teaming up in an online co-op, action-based looter slasher against wave after wave of the goddess of death's devious minions. Training in Valhalla for centuries, Champions have awaited and feared the coming of Ragnarök. That day is now upon them and the Champions must work together to stop Hel's legions from destroying the Nine Worlds, and the universe along with them. Prepare for incoming waves of over 1,000 of all sorts of Draugr, bosses, and Hel herself. Build your kill count, protect important objectives in the face of hellishly overwhelming odds, gather loot, craft new items and fight or die, die, die trying! Death and Axes As if one world ending wasn't enough, Hel and her forces have the audacity to threaten existence itself. Luckily, Odin knows just the right, recently (and not so recently) deceased Champions for the job. Play as one of five Champions hand-picked by Odin (well, actually it was Hildr and the Valkyries - Odin is such a scene-stealer) from across the ages, valiant in life and legendary in death, each with abilities uniquely suited for annihilating Hel's pesky undead armies. Love is a Battlefield Thanks to some scheduling mix-ups with Valhalla's janitorial staff, helpful items can be found scattered all throughout the town of Odi, from explosive bombs and sturdy barricades to hardy battlefield rations. Heroes can also expect the occasional divine pick-me-up from the gods themselves, whose places of power throughout Odi will attack enemies and boost weary Champions. Watch out, though - drop the ball in protecting these gifts from the gods, and Hel's minions will swipe the power for themselves. And that’s not all - keep an eye out for so much more coming in before we leave Early Access! Hel of a Horde Hel may not have a scrappy team of underdogs to call her own, but she more than makes up for it in numbers, variety, and her really bad attitude. Defend and complete objectives from thousands of enemies at once as she floods the field with every undead misfit from the lowly Mindless Undead, to clingy Shadow Wraiths, to the colossally overbearing Fire Giant (and soon, some of his BFFs!). Featuring: Co-op online matches for teams of up to ten players. As the game progresses through Early Access we will be gradually adding larger match sizes as the Unchained Engine can support 1000s of players in a match Five playable Champions with unique abilities. We currently have outlines for more than 30 additional Champions who will be slowly added as we lock down the Fabulous Five for launch Dozens of items to help your heroes, harm your enemies, and survive the battlefield Large-scale, real-time battles powered by the Unchained Engine, pitting Champions against thousands of enemies at once In-game voice chat for tactical team play. It’s our first pass at using voice chat so we’re keeping our fingers crossed on this one! Match and Career scoreboards to track your personal bests among Champions Please keep in mind that this is an Online Only, very Early Access game. We encourage you to offer us feedback, suggestions, and your thoughts, but please keep in mind that we are an independent company that is not being backed by any publisher or giant, billion or even trillion-dollar tech company.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1605600/header.jpg?t=1635526990",
    "Price": 19.99,
    "Developers": "City State Entertainment",
    "Publishers": "City State Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1605600/ss_5a4ee890e756096777ec2c70b00bd21cc89f363f.1920x1080.jpg?t=1635526990,https://cdn.akamai.steamstatic.com/steam/apps/1605600/ss_7fbdabc6850bb9e074c20c311eca403a7363e635.1920x1080.jpg?t=1635526990,https://cdn.akamai.steamstatic.com/steam/apps/1605600/ss_241186c12e9be80f8d3667a45b4fd591cf0782b4.1920x1080.jpg?t=1635526990,https://cdn.akamai.steamstatic.com/steam/apps/1605600/ss_2fa12a1da2c3910a50afc32f75a26acdddae20db.1920x1080.jpg?t=1635526990,https://cdn.akamai.steamstatic.com/steam/apps/1605600/ss_a54f0c23be2ac5758399300f8650068e8d5cbd1c.1920x1080.jpg?t=1635526990,https://cdn.akamai.steamstatic.com/steam/apps/1605600/ss_f062b0d44120f0beb23b11148b6240f75525f2ee.1920x1080.jpg?t=1635526990,https://cdn.akamai.steamstatic.com/steam/apps/1605600/ss_917284230e6b59790a86543a03abe335ecebc718.1920x1080.jpg?t=1635526990,https://cdn.akamai.steamstatic.com/steam/apps/1605600/ss_36a462b96c90267170aed5f7b67dc3618128b843.1920x1080.jpg?t=1635526990,https://cdn.akamai.steamstatic.com/steam/apps/1605600/ss_b0d934223650e62d1fd7a54a9430d9d688a8a87e.1920x1080.jpg?t=1635526990",
    "Slug": "final-stand-ragnark",
    "Meta Title": "Final Stand: Ragnarök: Oct 28, 2021, City State Entertain...",
    "Meta Description": "Looking for information on Final Stand: Ragnarök? Check out the release date (Oct 28, 2021), developer insights from City State Entertainment, and a com...",
    "Alt Text Image": "Official header image for Final Stand: Ragnarök game - Steam 1605600",
    "Canonical URL": "https://gusku.site/game/final-stand-ragnark",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Final Stand: Ragnar\\u00f6k\", \"description\": \"Looking for information on Final Stand: Ragnar\\u00f6k? Check out the release date (Oct 28, 2021), developer insights from City State Entertainment, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"City State Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"City State Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1605600/header.jpg?t=1635526990\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}