{
    "AppID": 1747750,
    "Name": "Flyland Wars: 3 Model Trains",
    "Release date": "Oct 4, 2021",
    "About the game": "You can fly! Flying is fun, swooping and soaring, going as fast as you want over, under, around and through things. You point in any direction and your anti-gravity rings fly you that way. But flying is also very dangerous! Touch anything, at almost any speed, and you're dead-- splat! Be sure you've gone to episode 0, Ball Game, to learn to fly first! It's free! The time is the 26th Century. The place is a 'flyland,' an adjustable-gravity, half-kilometer-square surface high over an ocean, far from any land. This flyland, Model Trains, built by a kindly old trillionaire chemist and train enthusiast, holds a giant model railroad, playable by visitors (click the arrow dot-- a game within the game)! Like this one, most flylands were once the playthings of trillionaires, who were usually enriched by mining the wealth of the solar system using anti-gravity. The inventor of flylands, and a-grav technology itself, also made an immense low-gravity space colony, but it became diseased, forcing tens of thousands of gravity-weakened refugees to invade the only places they could survive-- adjustable-gravity flylands. That invasion was the First Flyland War, which the trillionaires lost in a day. The Second Flyland War soon followed but the trillionaires lost again because of their unmitigated greed. However, the refugees were left defenseless thereafter. Now the Third Flyland War, The Revenge of the Trillionaires, is beginning and the otherwise helpless refugees have only one single individual to defend them against the combined robotic might of a hundred impossibly greedy and angry trillionaires-- you. Your only weapons are hand-thrown, ultra-hot flares, great for wrecking robots if you can get close enough to hit them. Robots are mighty weapons. But you have creativity-- and... you can fly! This flyland is no fun anymore, it is very, very deadly. The trillionaire's greedy offspring have armed it to slaughter the refugees in a particularly horrible way. As they will slaughter you, if you are reckless. Be careful!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1747750/header.jpg?t=1633338135",
    "Price": 3.99,
    "Developers": "Loren Logic",
    "Publishers": "Loren Logic",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1747750/ss_38f518698096c49d85959cf8f7d7403660438eda.1920x1080.jpg?t=1633338135,https://cdn.akamai.steamstatic.com/steam/apps/1747750/ss_d13850313a82891bd68472c922eab4015083b6be.1920x1080.jpg?t=1633338135,https://cdn.akamai.steamstatic.com/steam/apps/1747750/ss_86d5b0918956e79f0062234ba2fea3dca3575427.1920x1080.jpg?t=1633338135,https://cdn.akamai.steamstatic.com/steam/apps/1747750/ss_4c10629aa6d5feb78161c62e0cea3717b333a357.1920x1080.jpg?t=1633338135,https://cdn.akamai.steamstatic.com/steam/apps/1747750/ss_f1bcb07a965908581ae59531cd55622694624d8d.1920x1080.jpg?t=1633338135",
    "Slug": "flyland-wars-3-model-trains",
    "Meta Title": "Flyland Wars: 3 Model Trains: Oct 4, 2021, Loren Logic an...",
    "Meta Description": "Looking for information on Flyland Wars: 3 Model Trains? Check out the release date (Oct 4, 2021), developer insights from Loren Logic, and a complete g...",
    "Alt Text Image": "Official header image for Flyland Wars: 3 Model Trains game - Steam 1747750",
    "Canonical URL": "https://gusku.site/game/flyland-wars-3-model-trains",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Flyland Wars: 3 Model Trains\", \"description\": \"Looking for information on Flyland Wars: 3 Model Trains? Check out the release date (Oct 4, 2021), developer insights from Loren Logic, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Loren Logic\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Loren Logic\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1747750/header.jpg?t=1633338135\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}