{
    "AppID": 1670460,
    "Name": "GameMaker",
    "Release date": "May 4, 2022",
    "About the game": "GameMaker has everything you need to take your idea from concept to finished game. With a fresh user interface and many new exciting features including; Real-Time Animation Editing, a new innovative workflow and seamless path from Drag and Drop to actual code, developing top quality games has never been easier! Featuring a powerful programming language for professionals, and a drag-and-drop no-code-required workflow for beginners, and a comprehensive toolset, top quality games can be developed quickly. With the most advanced exporter ever, rapid cross-platform deployment is achievable across all leading platforms including mobile, html5, console and desktop. Monetisation tools enable a range of functionality to be quickly and easily deployed including In-App Purchasing, Advertising, Analytics and User Engagement. With no barriers to entry and powerful functionality, GameMaker is the ultimate 2D development environment! Key Features and Benefits Affordable, top quality game development Easy to get started – novice to professional Powerful programming language for professionals Drag and Drop system for beginners – no coding required Comprehensive Toolset: Level, Image, Tile, Object, Script and Audio Editors Leading physics engine and advanced shaders Powerful animation support and networking Rapid Cross-Platform exporting – all leading platforms supported Monetisation Tools: IAP, Advertising, Analytics and User Engagement Actively developed – new features and upgrades released regularly Technical Features Layer Based Level Editor Level Inheritance – to easily create different level biomes New Sequences Animation Tool Re-Designed Layer Based Image Editor Tile System – with Auto Tiling, Tile Animation and Brushes Re-Envisaged Drag and Drop, Enhanced and Faster Extensive Library of Events and Actions Real-Time Animation Editing Multi-Column, tabbed code editor Improved Object Editor New Audio Mixer Backwards Compatibility with GameMaker: Studio projects Multiple Workspaces with intuitive design Laptop mode custom workspaces Rapid Search mechanism to open resources instantly Skinning – light or dark skin available Powerful debugger to save time and effort Git Integration",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1670460/header.jpg?t=1652084003",
    "Price": 0.0,
    "Developers": "YoYo Games Ltd.",
    "Publishers": "YoYo Games Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1670460/ss_e4d2f3fc094c58349ad9c4b2b062fc2b3804e29c.1920x1080.jpg?t=1652084003,https://cdn.akamai.steamstatic.com/steam/apps/1670460/ss_779b17c7795f96eb8ce329b8d68c38471774b8e0.1920x1080.jpg?t=1652084003,https://cdn.akamai.steamstatic.com/steam/apps/1670460/ss_ba29ca41b01d2615a24fae970ae04fa883e87748.1920x1080.jpg?t=1652084003,https://cdn.akamai.steamstatic.com/steam/apps/1670460/ss_e82404013aa0ad86ad6dbc188858eac1b7f95efc.1920x1080.jpg?t=1652084003,https://cdn.akamai.steamstatic.com/steam/apps/1670460/ss_a3a2e40078a6266fa4e47b38bac01912dc8adc90.1920x1080.jpg?t=1652084003,https://cdn.akamai.steamstatic.com/steam/apps/1670460/ss_e90b8a51d4837ca0335ed775c78933e4542fdff2.1920x1080.jpg?t=1652084003",
    "Slug": "gamemaker",
    "Meta Title": "GameMaker: May 4, 2022, YoYo Games Ltd. and Full Overview",
    "Meta Description": "Looking for information on GameMaker? Check out the release date (May 4, 2022), developer insights from YoYo Games Ltd., and a complete game summary.",
    "Alt Text Image": "Official header image for GameMaker game - Steam 1670460",
    "Canonical URL": "https://gusku.site/game/gamemaker",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"GameMaker\", \"description\": \"Looking for information on GameMaker? Check out the release date (May 4, 2022), developer insights from YoYo Games Ltd., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"YoYo Games Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"YoYo Games Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1670460/header.jpg?t=1652084003\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}