{
    "AppID": 782570,
    "Name": "无尽之路",
    "Release date": "Sep 10, 2018",
    "About the game": "A roguelike card game that’s simple yet incredibly complex: Use a variety of equipment and skill combos to defeat the vile creatures lurking along the endless road. Each fork in the road will test your decision-making abilities on this twisted, immersive journey. Game Features Four roles, each with different active skills. Use dozens of equipment, jewelry, and gemstones to improve your stats and cards. Randomly generated levels. Heaps of game events and unlockables. Immersive graphics and music complement a twisted storyline. One step at a time. All you know is what's at the next forking. Will you see it through to the end? 1. Four Classes Choose one of four character classes, each with their own fighting characteristics. Try out their unique talents and find special equipment that is tailored to each class. You may even switch between characters if you found a cool item that you’d like to see in action! 2.Tabletop Game Map There’s two styles and four layers of maps (with more to be added shortly), all in the style of tabletop role-playing games. Each time you enter a new map, the content, events, and combat objects are randomly generated. Exploring the map and fighting battles will drain your strength points. Don’t let them drop down to zero or you’ll soon experience negative effects, so always remember to eat and tend to your wounds. Restore your lost memory and let the sophisticated and twisted plot unfold by collecting the letters that were left behind. 3. Tons of Rewards You’ll come upon lots of hidden treasures along your journey, all with different powerful abilities. There’s some super-rare powerful legendary equipment, spells that restore your health, food, traps, camouflaging fragrances, hard cash, and so on. 4. Unforgiving Battle The core mechanism of the battle is simple to learn, yet hard to master: You’ll need to calculate and combine cards, spells, and talents to surpass the total points in your opponent’s hand. However, sometimes it’s wise to defend rather than attack, or set traps and develop a long-time strategy to out-smart the enemy. Your foes may have the power, but you have the brains! 5. Improve Your Skills Depending if you defeat a boss or be defeated, you will be taken to one of two types of interface: When you defeat a boss, you won’t be able to switch classes or modes, but you can buy equipment to replace the existing one. When you die after a battle, you can switch classes or modes but you will not be able to improve your skills. 6. Unlock Achievements There’s a lot of achievements to be unlocked and various game modes and difficulties that guarantee good late-stage challenges and a high replayability on top of it all. Future updates will further expand the gaming experience. Game Design Unlike most independent game studios, we do not want to express deep truths and profound thoughts through this game. Don’t get us wrong, it’s incredible that games can tell a story that can change your life. But when we design a game, the actual “playing” part is what comes first. We believe that the fun aspect of a game is the most important, so a fun and smooth game experience is our top priority. Everything else, from graphics and sounds to story line, will be subject to the core game mechanics. (P.S.: Actually, we’d still like to express some content: Maybe this game will teach you that there is no turning back on this endless road that we call life. Each turn you decide to take will make your journey a unique one. Sure, you’ll need some luck, but the key thing to success is to grasp it!)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/782570/header.jpg?t=1630331939",
    "Price": 9.99,
    "Developers": "掌烛文化",
    "Publishers": "掌烛文化",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/782570/ss_685f36eed0982330ce8cca32c7bc77e18450455d.1920x1080.jpg?t=1630331939,https://cdn.akamai.steamstatic.com/steam/apps/782570/ss_fb419964f1a3ea772188f316f7bcf6dc9455c945.1920x1080.jpg?t=1630331939,https://cdn.akamai.steamstatic.com/steam/apps/782570/ss_6bc23565429744040545809184baddb3f76861d1.1920x1080.jpg?t=1630331939,https://cdn.akamai.steamstatic.com/steam/apps/782570/ss_b57ece5c2cde03004834466ef143e10c1f9fe23f.1920x1080.jpg?t=1630331939,https://cdn.akamai.steamstatic.com/steam/apps/782570/ss_2c71915bf18726fe0a2534f5af958787e3957fdf.1920x1080.jpg?t=1630331939,https://cdn.akamai.steamstatic.com/steam/apps/782570/ss_b1c2947653c549ea4ac58a5614f9b3b1551b6ad4.1920x1080.jpg?t=1630331939,https://cdn.akamai.steamstatic.com/steam/apps/782570/ss_2cfcf01753129da4822fd62747a0224fe93bf04a.1920x1080.jpg?t=1630331939,https://cdn.akamai.steamstatic.com/steam/apps/782570/ss_0f31288ed6ba19b5837bdaf3724ec20618e6d741.1920x1080.jpg?t=1630331939,https://cdn.akamai.steamstatic.com/steam/apps/782570/ss_7fd43133d29333877bca1328c125fe6a06d6afb2.1920x1080.jpg?t=1630331939",
    "Slug": "",
    "Meta Title": "无尽之路: Sep 10, 2018, 掌烛文化 and Full Overview",
    "Meta Description": "Looking for information on 无尽之路? Check out the release date (Sep 10, 2018), developer insights from 掌烛文化, and a complete game summary.",
    "Alt Text Image": "Official header image for 无尽之路 game - Steam 782570",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u65e0\\u5c3d\\u4e4b\\u8def\", \"description\": \"Looking for information on \\u65e0\\u5c3d\\u4e4b\\u8def? Check out the release date (Sep 10, 2018), developer insights from \\u638c\\u70db\\u6587\\u5316, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 10, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u638c\\u70db\\u6587\\u5316\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u638c\\u70db\\u6587\\u5316\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/782570/header.jpg?t=1630331939\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}