{
    "AppID": 755800,
    "Name": "Hades' Star",
    "Release date": "Feb 27, 2019",
    "About the game": "In Hades' Star, you create and grow a space Empire over time, in a persistent galaxy that constantly evolves. These are the star types discovered so far: Yellow Stars As the most stable star type, the Yellow Star offers a perfect setting to establish your permanent presence and plan your Empire's long term economy. All new players start in their own Yellow Star system and over time expand to discover and colonize more planets, set mining patterns, establish trade routes and neutralize the mysterious alien ships found throughout the Hades galaxy. As the owner of a Yellow Star system, you have complete control over what other players have access to it. By establishing diplomatic relations, you can allow any other player to send ships to your system, and dictate your own terms for mining, trade or military cooperation. Red Stars Very early in the game, every player will build a Red Star Scanner, a station that allows them to jump ships to detected Red Stars. These stars have a small lifetime and will go supernova after 15 minutes. The goal in the Red Star is to co-operate with any other players that have ships in that star system, defeat the NPC ships, retrieve Artifacts from the Red Star planets, and jump back before the Supernova. Artifacts can be researched in the home star and will yield necessary resources for trade, mining and combat advancements. Higher level Red Stars offer more challenging enemies and better rewards. White Stars Players can organize in Corporations. Besides helping each other, Corporations can also scan for White Stars. A White Star sees up to 40 players from two Corporations battle in the same star system for Relics, a resource that can be retrieved to upgrade the Corporation and give each member additional benefits. Time passes by very slowly in White Stars: every match lasts for 5 days, giving Corporation members time to talk and coordinate their strategy. The Time Machine can be used to plan future moves, communicate them to other Corporation members, and see potential outcomes of future combat. Blue Stars These short lived stars only last for 5 minutes, during which the entire system is collapsing on itself. Each player can only send a single Battleship to the Blue Star. The 5 participating players combat each other, using their ship's modules and other NPC ships to destroy the other player ships and be the last one alive. Blue Stars offer the fastest PvP action in the game. Regular participants receive daily and monthly rewards to advance their Empire.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/755800/header.jpg?t=1612071962",
    "Price": 0.0,
    "Developers": "Parallel Space Inc",
    "Publishers": "Parallel Space Inc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/755800/ss_e3df09d2915eb38fab19cbd597710279abda8710.1920x1080.jpg?t=1612071962,https://cdn.akamai.steamstatic.com/steam/apps/755800/ss_c3744ba7e1aeb512ffa76dfbfe55655077a931ef.1920x1080.jpg?t=1612071962,https://cdn.akamai.steamstatic.com/steam/apps/755800/ss_2bb7e4e61fc36ecdc4423d6e196882fa527d46ec.1920x1080.jpg?t=1612071962,https://cdn.akamai.steamstatic.com/steam/apps/755800/ss_97738cb069438c715e23b9c1f462cd0a0b0b5696.1920x1080.jpg?t=1612071962,https://cdn.akamai.steamstatic.com/steam/apps/755800/ss_c04900fdda2a3609a35db0579d2235d9ddf94aa5.1920x1080.jpg?t=1612071962,https://cdn.akamai.steamstatic.com/steam/apps/755800/ss_9bf454600ec4f0d76b293dde52f1554f373cecb9.1920x1080.jpg?t=1612071962,https://cdn.akamai.steamstatic.com/steam/apps/755800/ss_8cb0bb432fe613bef7dd4c19deaefaa371503f77.1920x1080.jpg?t=1612071962,https://cdn.akamai.steamstatic.com/steam/apps/755800/ss_a871ecff048c2a658de39f57b6a5d831f14614bf.1920x1080.jpg?t=1612071962",
    "Slug": "hades-star",
    "Meta Title": "Hades' Star: Feb 27, 2019, Parallel Space Inc and Full Ov...",
    "Meta Description": "Looking for information on Hades' Star? Check out the release date (Feb 27, 2019), developer insights from Parallel Space Inc, and a complete game summary.",
    "Alt Text Image": "Official header image for Hades' Star game - Steam 755800",
    "Canonical URL": "https://gusku.site/game/hades-star",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hades' Star\", \"description\": \"Looking for information on Hades' Star? Check out the release date (Feb 27, 2019), developer insights from Parallel Space Inc, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 27, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Parallel Space Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Parallel Space Inc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/755800/header.jpg?t=1612071962\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}