{
    "AppID": 684200,
    "Name": "Icons: Legacy Edition",
    "Release date": "Jul 12, 2018",
    "About the game": "Icons: Legacy Edition is a Tribute Release to the Wavedash Team and the fans of the free-to-play game, Icons: Combat Arena Note: This game is considered final and should not be intended to have additional updates besides critical bug fixes. About Icons: Combat Arena: Icons: Combat Arena was a free-to-play platform fighting game designed by hardcore fans to be a love letter to the genre. The goal was to take the most beloved characters and competitive elements of franchise platform fighting games and distribute them for free on PC so anyone, anywhere could enjoy them online. Fans of platform fighting games will feel right at home with elements of Icons: Combat Arena's roster with a space animal, sword fighter, rushdown brawler and grappler. Mixing in a bit of their own flavor, Icons: Combat Arena adds new, unexplored character designs: A gunslinger with the ability to ricochet bullets off platforms and stages A gruesome guan dao-slinging warrior with the ability to withstand any attack A pair of statues that can switch places with one another to surprise opponents, and A girl witch who seals demons into her weapons and can freely fly around the stage on her broom Legacy Edition - Key Improvements: Once it was apparent that the studio would not be able to sustain operations, the Wavedash team spent their final weeks doing their best to resolve as many of the fan-requested changes as possible. The goal for Legacy Edition was to resolve clear issues with Icon's original monetization, input delay and region-locking as well as provide fun tweaks to character movesets and balance that they thought the community would enjoy. Now, more than a year after their shutdown, Icons: Legacy Edition will finally see the light of day. An Entire Free-to-Play Game's Worth of Content: Legacy Edition includes all eight characters, dozens of costumes for each character, customizable voice and taunts as well as a slew of holograms for emoting mid-match! Global, Peer-to-Peer, Online Connectivity: The netcode was refactored to peer-to-peer connections. As a result, the Legacy Edition can be played globally. Offline Mode &amp; Local Mode Without Extra Input Delay: Online play was refactored to be significantly more responsive. Why should you play Icons: Legacy Edition: Icons: Legacy Edition is first and foremost a tribute to the Wavedash Team and the supporters of Icons: Combat Arena. However, you may want to consider trying the game out for yourself for the following reasons: Community - The friendly, passionate and welcoming Icons Community is now global. Our Discord would love for you to join them: Fun - Experiment with a lighthearted twist on a familiar game design with a roster of fan-favorite archtypes and a handful of characters Support a new platform fighting game - Icons: Legacy Edition was made possible after a former teammember purchased the company out of its going-out-of-business sale. They plan to effectively continue development on Icons but under a new name and vision. You can read more about them below. About Vortex &amp; Their Target First Impression for the New Game Vortex, led by a former Wavedash co-founder, is effectively continuing development on Icons: Combat Area, but under a new name, Vortex Rising. We want Vortex Rising to look and feel like it offers something new to players: Collaborative and Competitive Core. Our online play will feature cooperative team-based gameplay. What does a 2v2 or 3v3 fighting game look like? Is it pure chaos or can it be tamed into something much more competitive? We hope to answer these questions with Vortex Rising. Unique Gameplay. Our default gameplay includes beloved elements from other fighting games for the first time into a platform fighting game. We are experimenting with several risky but original ideas to push these concepts even further. A Perception of Being Easier to Learn. Tutorials, controls and core gameplay will vary in new and unique game modes to help beginners and button mashers graduate to advanced levels of competitive play. You should feel comfortable inviting a friend to play this game with you and they should feel good about being able to play alongside you. Gives You Something Fun to Work Towards. Playing should push you to want to go further, dig deeper. Watching a match should inspire you to rise to a challenge. Consider signing up for private Alpha testing of Vortex Rising here: Thank you for your love and support.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/684200/header.jpg?t=1646693183",
    "Price": 0.0,
    "Developers": "Wavedash Games,Vortex Games",
    "Publishers": "Wavedash Games,Vortex Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/684200/ss_afdaca42b8c6af930ba292fa3ae21d14823d1c84.1920x1080.jpg?t=1646693183,https://cdn.akamai.steamstatic.com/steam/apps/684200/ss_41edab116471cc1ef507b7a8ef69194100e2e73c.1920x1080.jpg?t=1646693183,https://cdn.akamai.steamstatic.com/steam/apps/684200/ss_8811c0a996421d4a9b231b8c347b14c55d7e86b5.1920x1080.jpg?t=1646693183,https://cdn.akamai.steamstatic.com/steam/apps/684200/ss_2078454837d8651b91f311b749e2a0058dbc4d81.1920x1080.jpg?t=1646693183,https://cdn.akamai.steamstatic.com/steam/apps/684200/ss_30c079b99ecc07a328bf3ef34dc74700f3361fef.1920x1080.jpg?t=1646693183,https://cdn.akamai.steamstatic.com/steam/apps/684200/ss_406dbce41f452b769a709e1bf941970555e9f218.1920x1080.jpg?t=1646693183,https://cdn.akamai.steamstatic.com/steam/apps/684200/ss_f7352b12a30ec05e0e9f914f9103861a19666611.1920x1080.jpg?t=1646693183",
    "Slug": "icons-legacy-edition",
    "Meta Title": "Icons: Legacy Edition: Jul 12, 2018, Wavedash Games,Vorte...",
    "Meta Description": "Looking for information on Icons: Legacy Edition? Check out the release date (Jul 12, 2018), developer insights from Wavedash Games,Vortex Games, and a ...",
    "Alt Text Image": "Official header image for Icons: Legacy Edition game - Steam 684200",
    "Canonical URL": "https://gusku.site/game/icons-legacy-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Icons: Legacy Edition\", \"description\": \"Looking for information on Icons: Legacy Edition? Check out the release date (Jul 12, 2018), developer insights from Wavedash Games,Vortex Games, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 12, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wavedash Games,Vortex Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wavedash Games,Vortex Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/684200/header.jpg?t=1646693183\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}