{
    "AppID": 956200,
    "Name": "Leopoldo Manquiseil",
    "Release date": "Dec 20, 2018",
    "About the game": "The videogame industry is in danger! A dishonest organization (A.M.E.) has set out to monopolize the industry and thus control the minds of the players. Developers and distributors have two options: either they take their side or else the market will end up crushing them. The freedom of creation has disappeared and only small independent studios seem to offer a small resistance. Our hero? He is none other than the great David Sant... Sorry, we cannot reveal his identity for now. He calls himself 'Leopoldo Manquiseil'. After the exploitation and stress he is under during his daily work at Badland Games, Leopoldo suffers a strange accident when he arrives home. When he wakes up he feels different than usual, he feels stronger. He feels like... He has super powers! Destiny already seems to have its own 'chosen', so now you be the one to put yourself in Leopoldo's shoes: jump, climb, shoot... Do whatever it takes to get our hero to bring peace and we can be one step closer to the second Golden Age for the industry in the Spanish region! But don't worry, Leopoldo Manquiseil won't be alone in his adventure: he'll count on the support and help of big industry characters like 'Gonzo' Suarez, Luis Quintans, Sara Borondo, Bruno Sol, Ramón Nafria or Santi Valero, from Video games for food. ● ● ● “Leopoldo Manquiseil: A new super hero is coming” is a small tribute to one of the biggest names in the Spanish videogame industry: David Santos. Vanir Project, creators of Nightmare Boy, are behind the development of the title, a classic 2D platformer, with a remarkable retro aesthetics and a chiptune soundtrack created by Vic Hernand. Leopoldo Manquiseil is a game with a charity side: 75% of the income obtained will go to David Santos. Leopoldo Manquiseil is an action platformer split into 24 levels with a lot of gameplay mechanics: • Jump, double jump, dash, climb walls, shoot... • Special levels in Flappy Bird and Pang style. • Two challenge levels: one simpler is just to reach the end of the level. Another harder way to play will force you to do the above and ALSO get three unique items that will be spread among each level. • The 24 levels are structured in three groups of 8. The last level of each group is always a final boss.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/956200/header.jpg?t=1546019761",
    "Price": 0.99,
    "Developers": "The Vanir Project",
    "Publishers": "BadLand Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/956200/ss_196b456686e121f28db1a4f6a7e37e4cd38f0d19.1920x1080.jpg?t=1546019761,https://cdn.akamai.steamstatic.com/steam/apps/956200/ss_42daabb83866a20a3e22609337e44c6994af7493.1920x1080.jpg?t=1546019761,https://cdn.akamai.steamstatic.com/steam/apps/956200/ss_e1158cd2773053d0ac538cf471ea1bf2ab5d3e78.1920x1080.jpg?t=1546019761,https://cdn.akamai.steamstatic.com/steam/apps/956200/ss_2b2d1b2ea99abad717a565771efee756e01a1015.1920x1080.jpg?t=1546019761,https://cdn.akamai.steamstatic.com/steam/apps/956200/ss_e10ef27c9e1cf6a8b1544da29204de089369f59e.1920x1080.jpg?t=1546019761,https://cdn.akamai.steamstatic.com/steam/apps/956200/ss_a93bd47c7d6b494d4514dac310277146ddf59a51.1920x1080.jpg?t=1546019761,https://cdn.akamai.steamstatic.com/steam/apps/956200/ss_b8cb5d2cf952f7e6dffa6201a9f838ae8d7a145c.1920x1080.jpg?t=1546019761",
    "Slug": "leopoldo-manquiseil",
    "Meta Title": "Leopoldo Manquiseil: Dec 20, 2018, The Vanir Project and ...",
    "Meta Description": "Looking for information on Leopoldo Manquiseil? Check out the release date (Dec 20, 2018), developer insights from The Vanir Project, and a complete gam...",
    "Alt Text Image": "Official header image for Leopoldo Manquiseil game - Steam 956200",
    "Canonical URL": "https://gusku.site/game/leopoldo-manquiseil",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Leopoldo Manquiseil\", \"description\": \"Looking for information on Leopoldo Manquiseil? Check out the release date (Dec 20, 2018), developer insights from The Vanir Project, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 20, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Vanir Project\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BadLand Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/956200/header.jpg?t=1546019761\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}