{
    "AppID": 1918460,
    "Name": "Nagori Rokudo Striving to be her ideal self -The inexperienced love life of a hard-to-get psychology lecturer-",
    "Release date": "May 6, 2022",
    "About the game": "GAME OVERVIEW: Striving to be the perfect 'Nagori Rokudo'!!! She'll show you her superior female techniques. A virgin, Nagori Rokudo, strives to be the perfect woman! To most men, she looks unattainable, but is actually still a virgin. It is the story of a young adult virgin striving for perfection. This story is a visual novel. GENRE: An inexperienced woman's love adventure CONCEPT: This is the story of a virgin looking to become her ideal self! It is a romance in which she tries to seem experienced in love but actually isn't! 1) Nagori's true self - The heroine, Nagori Rokudo, is a gorgeous woman. She seems hard-to-get, driving many men crazy and making many women envious. However, she's actually still a virgin. She looks like an unattainable gorgeous lady, but actually is an inexperienced beginner. As the hero confesses his love to her, she gets together with him to learn about men's psychology, but nothing goes well. Enjoy seeing her complicated nature. 2) Having sex, the gorgeous woman's way - She's a virgin but takes the lead in bed. She isn't very experienced but dominates and has sex utilizing a technique she had practiced with a cucumber. Actually, she always tries her best. Relax and enjoy her story. 3) Nagori's progression - What will Nagori think after dating the hero? How will she change and can she still remain a highly-prized woman? Pride or pure love...what will she get in the end? See for yourself. This is the story of a woman's progress who has trouble in love. CHARACTER: Nagori Rokudo DATA: Sex: Female Age: 25 Blood Type: B Height: 5'5' Weight: 112 lbs. Measurements: 34(B) / 23(W) / 32(H) PROFILE: She's a young female lecturer at a University. Without intent, she attracts and plays mind games with many men. A young guy suddenly confesses his love for her and she mysteriously accepts it and gets together with him. On that same date, she demands they start living together. However, she plays hard-to-get and thoroughly controls his sexual satisfaction. Her field is psychology. She teaches it, utilizing real-life practice and anecdotes as well as theory.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1918460/header.jpg?t=1651887934",
    "Price": 24.99,
    "Developers": "INTERHEART glossy",
    "Publishers": "ARTLINK",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1918460/ss_3c157aa0c6df7c414f32ef7d20ecf74c3cbcff81.1920x1080.jpg?t=1651887934,https://cdn.akamai.steamstatic.com/steam/apps/1918460/ss_852f7b019fe0ea13cf3bc9700f551140058aee12.1920x1080.jpg?t=1651887934,https://cdn.akamai.steamstatic.com/steam/apps/1918460/ss_17d493383ab0a5a3548f35ae89aea05f22e04e54.1920x1080.jpg?t=1651887934,https://cdn.akamai.steamstatic.com/steam/apps/1918460/ss_f2c13873cdeb5a72e74ca8e344ba631115b856d0.1920x1080.jpg?t=1651887934,https://cdn.akamai.steamstatic.com/steam/apps/1918460/ss_5d70c3c7ba42339af943ee265adb9155c1b97287.1920x1080.jpg?t=1651887934,https://cdn.akamai.steamstatic.com/steam/apps/1918460/ss_a9c72c5f9074b9db5f527661f773b700b9588094.1920x1080.jpg?t=1651887934",
    "Slug": "nagori-rokudo-striving-to-be-her-ideal-self-the-inexperienced-love-life-of-a-hard-to-get-psychology-lecturer",
    "Meta Title": "Nagori Rokudo Striving to be her ideal self -The inexperi...",
    "Meta Description": "Looking for information on Nagori Rokudo Striving to be her ideal self -The inexperienced love life of a hard-to-get psychology lecturer-? Check out the...",
    "Alt Text Image": "Official header image for Nagori Rokudo Striving to be her ideal self -The inexperienced love life of a hard-to-get psychology lecturer- game - Steam 1918460",
    "Canonical URL": "https://gusku.site/game/nagori-rokudo-striving-to-be-her-ideal-self-the-inexperienced-love-life-of-a-hard-to-get-psychology-lecturer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nagori Rokudo Striving to be her ideal self -The inexperienced love life of a hard-to-get psychology lecturer-\", \"description\": \"Looking for information on Nagori Rokudo Striving to be her ideal self -The inexperienced love life of a hard-to-get psychology lecturer-? Check out the...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"INTERHEART glossy\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ARTLINK\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1918460/header.jpg?t=1651887934\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}