{
    "AppID": 824070,
    "Name": "Objects in Space",
    "Release date": "Mar 1, 2019",
    "About the game": "You've been detected… Your ship is exposed… An alarm blares… “Torpedo incoming!” Objects in Space is an open world 2D stealth-action space trading game set in Apollo – a huge cluster of star systems dozens of lightyears away from Earth. You are a ship’s captain, buying and selling wares in order to keep your bucket o' bolts afloat and stay one step ahead of pirates, organised criminals, corrupt governments and shady laws. A galaxy of characters await you in Objects in Space. The game focuses on a myriad of short stories rather than one main storyline with a hero’s journey, so it’s up to you how much or how little narrative you want in your game. Combat in Objects sees ships treated more like Cold War submarines than WWII dogfighters. You’ll be running silent, planning manoeuvres far ahead of time and engaging in deadly games of cat-and-mouse with nebulous enemies, but only for those players who seek it out. Combat-averse players can pay attention to the news and avoid pirate-heavy systems and choose not to explore the deadly uncharted areas of space where greater numbers of pirates lurk. It’ll be up to you to keep your ship’s systems running as quietly as possible, going fully ‘dark’ if you have to, just floating with your current trajectory and speed hoping to avoid showing up on anyone else’s scanners as you traverse some of the most dangerous shipping lanes in space.  To make your money, there are over fifty employers and your reputation with each one will dictate how many passenger, cargo or bounty-hunting contracts are available to you. But be warned - failure to complete a contract might see your rep plummet with that employer. So when you get an SOS signal from a nearby ship but have a deadline to keep, what will you do? Your ship is completely customisable down to the tiniest component of each module. If your battery dies, it’s your own fault. You decided to go with a cheap Ventarii battery in the first place, and it was out of your stubbornness that you bought a Connext Hap Node when the mechanic recommended a Xiao Sa brand model. Silly you. You can play it safe in the central systems or design your ship with the ability to outrun, outfight or out-hide your opponents and make your fortune in the outer rims. But be careful! You are just as easily prey as predator in deep space… Features List: Massive open world to explore full of NPCs to interact with Complex contract-based economic system with over 50 employers Time-based open world - opportunities, stories and events happen at certain times as well as certain places, so each play through will be different Tense submarine-influenced combat Fully customisable ships - design your vessel for combat, shipping, stealth and more Mostly avoidable combat for more pacifistic players A world of side quests - no single linear story players are required to follow Explore 12 hand-crafted populated star and 20 uncharted systems full of unknown threats and treasures Find derelict ships, wreckages, cargo pods and communication beacons adrift in space Be a trader, bounty hunter, explorer, pirate or all of them at the same time Sandbox mode - play the game without narrative content in an endless version of the game Scenarios - tense combat scenarios task the player with overcoming impossible odds and testing their skill Multi-player Scenarios - compete or cooperate in a variety of multiplayer modes and situations Build your own DIY controllers at home using Arduinos - anyone can construct their own ship bridge with physical switches and buttons with just a little bit of soldering know-how. Easy to learn and fun to do!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/824070/header.jpg?t=1641993645",
    "Price": 24.99,
    "Developers": "Flat Earth Games",
    "Publishers": "505 Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/824070/ss_493ad481176f67d8f88e3c0e4bf5c73028e793a2.1920x1080.jpg?t=1641993645,https://cdn.akamai.steamstatic.com/steam/apps/824070/ss_ecd3cd99785edb908c9caeaa5f77e7b4e4013be1.1920x1080.jpg?t=1641993645,https://cdn.akamai.steamstatic.com/steam/apps/824070/ss_e6990cbd349079a0eb858c118d9626d7bf30e74f.1920x1080.jpg?t=1641993645,https://cdn.akamai.steamstatic.com/steam/apps/824070/ss_d0f32c38ddf1777279a79380fc7fc695fc4efbcc.1920x1080.jpg?t=1641993645,https://cdn.akamai.steamstatic.com/steam/apps/824070/ss_e660fd39a28df614e7da27c8bbee1d0e19b1f080.1920x1080.jpg?t=1641993645,https://cdn.akamai.steamstatic.com/steam/apps/824070/ss_754cdc02dbf9578fbc8d670540ab58020c380db2.1920x1080.jpg?t=1641993645,https://cdn.akamai.steamstatic.com/steam/apps/824070/ss_b514adbd2563431405422f53048b1b2470543d92.1920x1080.jpg?t=1641993645,https://cdn.akamai.steamstatic.com/steam/apps/824070/ss_ace9118e554b298c12721c160c5ff848f5dfd9e7.1920x1080.jpg?t=1641993645,https://cdn.akamai.steamstatic.com/steam/apps/824070/ss_b95099d9afa9ba190e7a09003f03a38f511de01f.1920x1080.jpg?t=1641993645",
    "Slug": "objects-in-space",
    "Meta Title": "Objects in Space: Mar 1, 2019, Flat Earth Games and Full ...",
    "Meta Description": "Looking for information on Objects in Space? Check out the release date (Mar 1, 2019), developer insights from Flat Earth Games, and a complete game sum...",
    "Alt Text Image": "Official header image for Objects in Space game - Steam 824070",
    "Canonical URL": "https://gusku.site/game/objects-in-space",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Objects in Space\", \"description\": \"Looking for information on Objects in Space? Check out the release date (Mar 1, 2019), developer insights from Flat Earth Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 1, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Flat Earth Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"505 Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/824070/header.jpg?t=1641993645\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}