{
    "AppID": 1083310,
    "Name": "OUTBUDDIES DX",
    "Release date": "Oct 15, 2019",
    "About the game": "Enter Bahlam, a sunken city of the Old Gods, located deep in the South Atlantic Ocean. Following a shipwreck, adventurer and maritime archaeologist Nikolay Bernstein regains consciousness 36.000 feet under the sea. He's severely wounded and unwillingly connected to a supernatural Buddy-unit. Searching for answers about his displacement our main protagonist digs deep into the lost undercity, gradually realizing an ominous presence hollowing in its shadowed caverns. On your journey home you will share your fate with a friendly tribe of mining creatures, the Wozan, who fear the Old Gods and strive to get back to the surface since their ancestors had been enslaved 5000 years ago. Some of them were able to flee and founded secret colonies deep inside the sunken ruins, others are still exploited by the hostile creatures that have overtaken the city since the Old Gods suddenly disappeared. Experience real non-linear Metroidvania gameplay and uncover five distinct areas, all with remarkable puzzles, environmental hazards, epic boss encounters and captured Wozan to uncage. Your Buddy unit will procedurally map the area and function as a handy quality of life tool that can be controlled at will to manipulate your surroundings using various abilities like hacking, scanning, and telekinesis. Explore Bahlam with high freedom of movement like climbing, crawling and diving right from the start. As you progress your set of options will expand by discovering ancient weapon systems, suit upgrades and hacking protocols for your droid. All gear will be carefully balanced in terms of combat abilities and has to be used selectively to overcome specific hazards and puzzles. The local Co-Op option invites a second player to explore and experience this adventure together by taking control over the invincible Buddy unit. Support each other on your journey home, solve puzzles and overcome Bahlam's hostile maze. This will also provide an opportunity for team-speedrunning as a very unique take on the scene. Outbuddies DX is a humble budget project but that does not mean it will run poorly or lack the quality of life features. All pixel art will scale crisp and free of distortion artifacts to your native screen resolution. The game runs at 60 FPS. A hybrid physics engine ensures realistic accelerations and object movements while maintaining the pixel perfect control of the old classics. Enemy and boss AIs are carefully crafted and will kick your ass in a Souls-like manner! Outbuddies DX also supports various mappable devices like keyboard, mouse and multiple gamepads to ensure you´re able to play with your preferred setup. We listen to feedback, so shoot us a mail anytime! Explore an open vibrant fantasy world Real Metroidvania gameplay with lots of gear, puzzles and Easter eggs Unique dual-hero scheme with local Co-Op support Epic boss battles &amp; believable enemy AIs Intriguing narrative and memorable characters High freedom of movement @ 60 FPS Handcrafted pixel art with distortion-free scaling to your native display resolution Support for various input devices &amp; key rebinding Original soundtrack by OGRE music",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1083310/header.jpg?t=1594997233",
    "Price": 3.59,
    "Developers": "Julian Laufer",
    "Publishers": "Headup",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1083310/ss_acbef5e9da1d0ece67a0e493d5adbe0284e6ab77.1920x1080.jpg?t=1594997233,https://cdn.akamai.steamstatic.com/steam/apps/1083310/ss_6bb98d1c1f269f1bfbdbccf3e15e88715288897c.1920x1080.jpg?t=1594997233,https://cdn.akamai.steamstatic.com/steam/apps/1083310/ss_b6302993f983cf66e34e71bdf0b19d01a1063362.1920x1080.jpg?t=1594997233,https://cdn.akamai.steamstatic.com/steam/apps/1083310/ss_ea9a912b509f9e129ba4d2f46a77a7871e08d04b.1920x1080.jpg?t=1594997233,https://cdn.akamai.steamstatic.com/steam/apps/1083310/ss_fa48fbf7430e350f6832cd123ced7bb5a5ce3737.1920x1080.jpg?t=1594997233,https://cdn.akamai.steamstatic.com/steam/apps/1083310/ss_d8a7e8c2daaed769de94b4e9cb1e76c469ebc113.1920x1080.jpg?t=1594997233,https://cdn.akamai.steamstatic.com/steam/apps/1083310/ss_8d8804cc5012fb7b1315e45f606a0cc0b9224341.1920x1080.jpg?t=1594997233",
    "Slug": "outbuddies-dx",
    "Meta Title": "OUTBUDDIES DX: Oct 15, 2019, Julian Laufer and Full Overview",
    "Meta Description": "Looking for information on OUTBUDDIES DX? Check out the release date (Oct 15, 2019), developer insights from Julian Laufer, and a complete game summary.",
    "Alt Text Image": "Official header image for OUTBUDDIES DX game - Steam 1083310",
    "Canonical URL": "https://gusku.site/game/outbuddies-dx",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"OUTBUDDIES DX\", \"description\": \"Looking for information on OUTBUDDIES DX? Check out the release date (Oct 15, 2019), developer insights from Julian Laufer, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 15, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Julian Laufer\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Headup\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1083310/header.jpg?t=1594997233\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}