{
    "AppID": 1873720,
    "Name": "Return Ace",
    "Release date": "Mar 25, 2022",
    "About the game": "Game overview Your bullet is my bullet! It's up to you to avoid it, such as being hit. A unique rule-reversing Shmup ' Return Ace ' that hits the enemy's army and boss with a barrage from the front. By the time he woke up, the situation had already been decided. He was given neither more power nor a sturdy body. It is the ' power to return ' everything. The battle began, guided by someone's voice, without even determining his identity and desires. We have adopted a unique game system because we aimed for an unlikely Shmup for playing. The main character has the following abilities. 'Absorb' Basic ability to absorb, register and shoot back enemy energy bullets. Since it stores energy for shooting, it is essential to be hit and it is also the starting point of various attacks. Be aware that if you exceed the allowable amount, it will overheat and become defenseless. 'Hacking' Ability to hack enemy planes and turn them over. Effective only against enemies in the air and physically guided bullets, it consumes a lot of energy but can be an ally in an instant. Suitable for dealing with troublesome enemies and defending against physically guided bullets. 'Rolling' The ability to temporarily become invincible and bounce off physical contact, including physical ammunition. Energy bullets are offset by the kinetic energy of the aircraft, and shooting becomes a strengthening bullet during use. Be careful as it is easy to lose to high-powered energy bullets and energy bullets that come into continuous contact. There are four difficulty levels: Full Tune Up (Level1), Prototype (Level2), Wanted (Level3) and World Ruler (LevelMAX). Each has a different story, BGM arrangement, aircraft abilities, enemy strength and combat routines. You can change the difficulty level at any time except when the score for clearing the game is confirmed. The story is also equipped with auto and skip functions, so you can concentrate on the Shmup part. Level 1 displays the green gauge for aircraft acquisition. Level 2 displays a purple gauge that fires physical bullets at 100% energy consumption. Level 3 displays the red gauge of attack power that increases with the number of enemies and approaching the boss. Level MAX shows all gauges. The title obtained by playing when the game is cleared is displayed. Titles can be obtained by playing at any difficulty level except for one hidden. The title has useful abilities suitable for the content, and if you collect it, you can significantly strengthen your own machine. Highly scored and difficult titles come with powerful abilities to rethink the play itself. You can access the online ranking by pressing the Pause key (Esc) on the title screen. Three types of games, 'Story Mode', which you can play until the end, 'Random Stage', which is a one-stage game that requires luck, and 'Boss Rush', which is an endless endurance game, are displayed up to 50th place. -Register the bullets absorbed when the energy is 0%. If you want to use another bullet, avoid absorption and consume it by shooting, hacking, and rolling. -Energy bullets have various elements such as power, energy efficiency, range, and strength relationship. The effect of strengthening is different, so please try to find the one you like. -Key binding can be done in the config. This game uses shooting, absorption, hacking, rolling and 4 buttons, and there are many operations. It is recommended to play with comfortable settings. -You can also attack the boss by using rolling. When you hack into the boss ...? -Since the hidden title is difficult to obtain, it is designed so that it will not be reset by the reset function. -Here are some recommended titles with particularly excellent abilities. 'destroyer' You destroyed over 80% of the general enemy. Increases the power of weapons. 'eliminator' You destroyed all common enemies. You can use the return area and return bomb. Disables physical bullets and reflects passed energy bullets. Weapon level becomes bomb. 'commander' You fought switching weapons three more times. When absorbing while stopping, pressing rolling will convert energy to weapon level. 'resistance' Rebelled over 20 aircraft. Aftermath occurs in hacking. 'assault finish' You defeated the boss by rolling. When killing an enemy by rolling, damage the surrounding enemies. Energy consumption offsets the slowdown of energy bullet collisions. The retail version also unlocks other abilities. -There are 4 hidden bosses that appear under the sortie conditions on the random stage. If you defeat everything and meet certain conditions with a boss rush ...? Method of operation 1: Shoot (decision) Default key: Left Shift key Fixed key: Enter key 2: Absorb (decision) Default key: Z Fixed key: Right control key 3: Hacking (cancellation) Default key: X Fixed key: BackSpace key 4: Rolling (cancellation) Default key: C Fixed key: Right Shift key Red, yellow: Fixed function Blue: Changeable function If you use SteamInput, it will be displayed as Steam xxx. In this case, it works with the settings of the Steam client, so there is no need to set it in the game. Notice! 2022/03/29 I've omitted previous updates because the content is bulky. Future updates will be notified via the steam feature.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1873720/header.jpg?t=1648537546",
    "Price": 4.99,
    "Developers": "NEROTA",
    "Publishers": "NEROTA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1873720/ss_698ee3453b2cde49405acbffbed3d00f75abec3c.1920x1080.jpg?t=1648537546,https://cdn.akamai.steamstatic.com/steam/apps/1873720/ss_ce301bcec139c14e0b1bfa8947a499db817db98b.1920x1080.jpg?t=1648537546,https://cdn.akamai.steamstatic.com/steam/apps/1873720/ss_48bf2741a0cd8eb5dd1ec438a14becb89bcb1f25.1920x1080.jpg?t=1648537546,https://cdn.akamai.steamstatic.com/steam/apps/1873720/ss_ef9c4d5e279340c435da7bccf1004a9763748f01.1920x1080.jpg?t=1648537546,https://cdn.akamai.steamstatic.com/steam/apps/1873720/ss_952295cb4e90dc01974ed9c7215b5471dafa7325.1920x1080.jpg?t=1648537546,https://cdn.akamai.steamstatic.com/steam/apps/1873720/ss_34ebe144eac8dfcbd53d6bb8b044da4ad61aaf83.1920x1080.jpg?t=1648537546,https://cdn.akamai.steamstatic.com/steam/apps/1873720/ss_0d4498839e7d4c0a69381780fd5ffe314e4f87e0.1920x1080.jpg?t=1648537546",
    "Slug": "return-ace",
    "Meta Title": "Return Ace: Mar 25, 2022, NEROTA and Full Overview",
    "Meta Description": "Looking for information on Return Ace? Check out the release date (Mar 25, 2022), developer insights from NEROTA, and a complete game summary.",
    "Alt Text Image": "Official header image for Return Ace game - Steam 1873720",
    "Canonical URL": "https://gusku.site/game/return-ace",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Return Ace\", \"description\": \"Looking for information on Return Ace? Check out the release date (Mar 25, 2022), developer insights from NEROTA, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"NEROTA\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NEROTA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1873720/header.jpg?t=1648537546\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}