{
    "AppID": 302510,
    "Name": "Ryse: Son of Rome",
    "Release date": "Oct 10, 2014",
    "About the game": "Fight as a soldier. Lead as a general. Rise as a legend. “Ryse: Son of Rome” tells the story of Marius Titus, a young Roman soldier who witnesses the murder of his family at the hands of barbarian bandits, then travels with the Roman army to Britannia to seek revenge. Quickly rising through the ranks, Marius must become a leader of men and defender of the Empire on his quest to exact vengeance – a destiny he soon discovers can only be fulfilled much closer to home... About Ryse: Son of Rome Journey to the heart of the Roman Empire and experience the brutality of battle like never before as 'Ryse: Son of Rome' comes to PC with support for glorious 4K resolution. Continuing Crytek's legacy for groundbreaking games, Ryse pushes PC hardware to its limits whilst drawing players deep into the bloody drama of ancient Rome. “Ryse: Son of Rome” is an immersive action-adventure story of struggle, brutality and heroism. It follows a fearless Roman soldier named Marius Titus who joins the army to avenge the slaying of his family and emerges as a hero who must fight to save the Roman Empire. “Ryse: Son of Rome” presents a cinematic re-creation of the Roman Empire, its people, conflicts and landscapes in breathtaking detail and brings the brutality and intensity of Roman warfare to life in visceral detail. Features The complete Ryse experience The PC version of “Ryse: Son of Rome” offers the full experience, bundling the original Xbox One launch hit with all its DLC. Taking full advantage of the PC 4K gaming is another leap in graphics quality for PC gamers and Ryse is the perfect showcase for what’s now possible in high-end PC games. “Ryse: Son of Rome” leverages the power of Crytek’s CRYENGINE and the latest High-End PC gaming technology to present conflict in the Roman Empire like you’ve never seen it before. Next-generation cinematic immersion Marius’ tale of revenge comes to life through new advancements in performance capture, allowing players to interact with believably realistic characters Brutally intense combat “Ryse: Son of Rome” delivers a visceral, brutally realistic combat experience with epic-scale battles. Relive the ruthless history of ancient Rome as you engage in raw close-quarters combat against the barbarian hordes. Cooperative gladiatorial combat in the Colosseum Colosseum Mode, plunges you into the Arena to fight alongside a friend against an ever-changing array of enemies and challenges, to the roar of thousands of spectators. A dynamic battlefield Colosseum Mode includes 26 multiplayer maps, with tile sets ranging from British camps to Roman villas and Egyptian deserts. Forge your own Legend You decide your destiny, customizing your gladiator through gold and Valor (XP) with new armor, weapons, shields, and consumables to win the crowd and survive in the arena. Bonus Content 'Ryse: Son of Rome' for PC will come with all bonus material originally released as downloadable content for the Xbox One version, including: • The Colosseum Pack containing two character skins and two Arena maps. • The Mars’ Chosen Pack containing one new character skin, four Arena maps, and the new Survival mode. • The Duel of Fates Pack containing two character skins, two Arena maps, and one additional Survival map. • The Morituri Pack, with three new Arena maps, two Survival maps, and five solo Arena maps.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/302510/header.jpg?t=1588670554",
    "Price": 2.49,
    "Developers": "Crytek",
    "Publishers": "Crytek",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/302510/ss_bcbd3405df6d1332416994090544456e39d36188.1920x1080.jpg?t=1588670554,https://cdn.akamai.steamstatic.com/steam/apps/302510/ss_27fd86c85a7c99a532a3b01b28f9cc86dc2c7c7d.1920x1080.jpg?t=1588670554,https://cdn.akamai.steamstatic.com/steam/apps/302510/ss_94ea559e8814b0de31d969fce3e1da9b882534a6.1920x1080.jpg?t=1588670554,https://cdn.akamai.steamstatic.com/steam/apps/302510/ss_9c9e2791104ac58bfb1bf44719f8151f52dd95f6.1920x1080.jpg?t=1588670554,https://cdn.akamai.steamstatic.com/steam/apps/302510/ss_5080b6dbfd44d21a9f1deb57c59e5079a2689653.1920x1080.jpg?t=1588670554,https://cdn.akamai.steamstatic.com/steam/apps/302510/ss_07f76f063711c43e4599b81b0d0a0c682f4ce738.1920x1080.jpg?t=1588670554,https://cdn.akamai.steamstatic.com/steam/apps/302510/ss_b3e9d790ef391e750e31dd8cd2a3200460819b8e.1920x1080.jpg?t=1588670554",
    "Slug": "ryse-son-of-rome",
    "Meta Title": "Ryse: Son of Rome: Oct 10, 2014, Crytek and Full Overview",
    "Meta Description": "Looking for information on Ryse: Son of Rome? Check out the release date (Oct 10, 2014), developer insights from Crytek, and a complete game summary.",
    "Alt Text Image": "Official header image for Ryse: Son of Rome game - Steam 302510",
    "Canonical URL": "https://gusku.site/game/ryse-son-of-rome",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ryse: Son of Rome\", \"description\": \"Looking for information on Ryse: Son of Rome? Check out the release date (Oct 10, 2014), developer insights from Crytek, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 10, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crytek\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crytek\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/302510/header.jpg?t=1588670554\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}