{
    "AppID": 1788100,
    "Name": "Saimin Gakushū: Secret Desire",
    "Release date": "Nov 4, 2021",
    "About the game": "When the lovely Tsukino, student council president and the academy's star pupil, confronts serial slacker Soichi about his embarrassing grades, tempers flare and a very public argument ensues. In the heat of the moment, Tsukino slaps Soichi across the face, much to his humiliation. At first, Soichi resolves to study harder if only to prove Tsukino wrong, but reality soon kicks in when he realizes he is unwilling to give up his lazy lifestyle. Looking to lifehack his way out of any actual effort, he purchases a 'hypnology device' on a whim from an online shopping site. Although skeptical at first, Soichi is surprised to learn that the device has a much more potent hypnotic effect than he could ever have imagined. Naturally, our hero scraps his original plans at once, instead devising a new plan to use the machine—with campus queen Tsukino as his first target. FEATURES A visual novel Three branching heroine routes Full Japanese voice acting by seasoned professionals Tsukino Himemiya A second-year at the prestigious Mitsuki Academy, Tsukino Himemiya is a cool beauty who has complete confidence in her both her looks and her brains. As the daughter of the school's formidable chairwoman, she struggles to escape her mother's shadow, and avoid bringing shame to the family name. To this end, she works very hard to excel, and this leaves her with little feeling but spite for our slacker protagonist. Suzuka Himemiya Tsukino Himemiya's mother and the chairman of the academy that the protagonist attends. Very strict, and very prideful; as an authority in the field of education, she makes frequent appearances on television. She tears her enemies down with cold facts and hard logic. Natsuki Fujii Attending Mitsuki Academy as a first-year, Natsuki Fujii is a classmate of the protagonist. She greatly admires the student council president Tsukino Himemiya. The protagonist, on the other hand, she despises and mocks relentlessly for his habit of bringing down their whole class's averages. It's when Tsukino hears of this that our story begins... Ayako Sasakawa The head teacher of the protagonist's class, and one of the youngest female teachers at Mitsuki Academy, Ayako Sasaka is nonetheless as respected and feared as any of the more established educators. She has little sympathy for the protagonist, with whom her lectures tend to fall on deaf ears.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1788100/header.jpg?t=1639038120",
    "Price": 19.99,
    "Developers": "Dark One!",
    "Publishers": "Shiravune",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1788100/ss_42af1ec9002e97d3ec14d5aefa0ccb6fba58ce78.1920x1080.jpg?t=1639038120,https://cdn.akamai.steamstatic.com/steam/apps/1788100/ss_9735820220fea9136f957e319a00fec0c7c7f661.1920x1080.jpg?t=1639038120,https://cdn.akamai.steamstatic.com/steam/apps/1788100/ss_5d5976c228b60ff7e35d01002f94860e8d89bb0c.1920x1080.jpg?t=1639038120,https://cdn.akamai.steamstatic.com/steam/apps/1788100/ss_82d2afe9401123f1fb7a1f891e35e8d809aa4155.1920x1080.jpg?t=1639038120,https://cdn.akamai.steamstatic.com/steam/apps/1788100/ss_514c8563cb9c8e2850f2315afe683263a1a1a0bc.1920x1080.jpg?t=1639038120",
    "Slug": "saimin-gakush-secret-desire",
    "Meta Title": "Saimin Gakushū: Secret Desire: Nov 4, 2021, Dark One! and...",
    "Meta Description": "Looking for information on Saimin Gakushū: Secret Desire? Check out the release date (Nov 4, 2021), developer insights from Dark One!, and a complete ga...",
    "Alt Text Image": "Official header image for Saimin Gakushū: Secret Desire game - Steam 1788100",
    "Canonical URL": "https://gusku.site/game/saimin-gakush-secret-desire",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Saimin Gakush\\u016b: Secret Desire\", \"description\": \"Looking for information on Saimin Gakush\\u016b: Secret Desire? Check out the release date (Nov 4, 2021), developer insights from Dark One!, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dark One!\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shiravune\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1788100/header.jpg?t=1639038120\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}