{
    "AppID": 733740,
    "Name": "Sakura Cupid",
    "Release date": "Feb 12, 2018",
    "About the game": "Lilim is a lazy cupid who was exiled from Heaven for failing to do her duties. While most cupids would be ashamed at such a punishment, Lilim is overjoyed. She loves living in Tokyo! Finally, she has enough time to read all the comics and watch all the TV shows she wants – and she doesn’t need to spend all her time working! Lilim’s peaceful life is shattered, however, when she shoots a cute waitress with a ‘love bullet’ in an attempt to swindle a free cup of coffee. The cute waitress in question, Mitsuki, becomes infatuated Lilim, and claims she’ll die if Lilim doesn’t return her feelings. Now, Lilim’s stuck living with Mitsuki until the effects of the ‘love bullet’ wear off – and on top of that, she’s being hunted by her childhood friend, Serra, who’s determined to bring her back to Heaven no matter the cost. What’s a cute cupid to do?! Lilim: The main character. Lilim is a cupid who failed to do her duties in Heaven properly, and was banished to the human world. Lilim is incredibly lazy, and will go through to any lengths possible to avoid working. Brash and self-confident, Lilim loves flirting with cute girls – but commitment is way too much of a hassle. Will she learn to change her ways? Mitsuki: The human girl Lilim shoots with a ‘love bullet’. While initially rude and cold towards Lilim, the moment she’s hit by a ‘love bullet’, Mitsuki falls head over heels for her. When Mitsuki isn’t reeling under the effects of a cupid’s ‘love bullet’, she’s a determined college student who’s training to be a doctor. She’s also terrible at cooking. Serra: Lilim’s childhood friend. Serra is a cupid who lives in Heaven. She graduated from the Cupid Academy at the top of her class, and is incredibly gifted and able. Despite being so talented, she doesn’t have many friends, as she acts cold and aloof. Serra is very serious, but has a secret love for cute, cuddly toys, and magical girl shows. She’ll never admit to it, though – just like she’ll never admit how much she loves Lilim. Features: join Lilim on her adventure on Earth in this visual novel affect the story with your choices Enjoy small environmental animations in the background Available in Chinese",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/733740/header.jpg?t=1587984783",
    "Price": 9.99,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/733740/ss_43fe7f7cbe3150306169bec7e274f96309cd5f26.1920x1080.jpg?t=1587984783,https://cdn.akamai.steamstatic.com/steam/apps/733740/ss_0757c387c17a3f63f0c89e3de8d6c5d262ec610e.1920x1080.jpg?t=1587984783,https://cdn.akamai.steamstatic.com/steam/apps/733740/ss_f572104bad778c3f78519e4279e93fa972369523.1920x1080.jpg?t=1587984783,https://cdn.akamai.steamstatic.com/steam/apps/733740/ss_de5655c6d58fb0dc557d2fe56c8a4759f42f8a00.1920x1080.jpg?t=1587984783,https://cdn.akamai.steamstatic.com/steam/apps/733740/ss_54be1f29e2ee26a55f50922a4a899712673868bb.1920x1080.jpg?t=1587984783",
    "Slug": "sakura-cupid",
    "Meta Title": "Sakura Cupid: Feb 12, 2018, Winged Cloud and Full Overview",
    "Meta Description": "Looking for information on Sakura Cupid? Check out the release date (Feb 12, 2018), developer insights from Winged Cloud, and a complete game summary.",
    "Alt Text Image": "Official header image for Sakura Cupid game - Steam 733740",
    "Canonical URL": "https://gusku.site/game/sakura-cupid",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura Cupid\", \"description\": \"Looking for information on Sakura Cupid? Check out the release date (Feb 12, 2018), developer insights from Winged Cloud, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 12, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/733740/header.jpg?t=1587984783\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}