{
    "AppID": 1466690,
    "Name": "Sakura Succubus 4",
    "Release date": "Mar 1, 2021",
    "About the game": "Ogasawara Hiroki was once an ordinary man, but his life has now taken a distinctly unordinary turn. Quite unwittingly, he stumbled upon a well-kept secret which flipped his humdrum existence upside-down: namely, that several of Japan's most famous female celebrities are succubi. These succubi fall for Hiroki in droves, and soon he obtains quite the harem. His gaggle of adoring succubi include the two-faced idol, Ikue Ayu; the ditzy social media star, Cosmos; the sadistic businesswoman, Marina; the elegant actress, Hifumi; the cheerful tennis player, Hazel; and the aloof succubus princess, Yue. After narrowly escaping a lifetime of imprisonment in the succubus realm, Hiroki is ready to kick back and relax. Ayu invites him on a vacation to her private beach house in Okinawa, and Hiroki is happy to accept. The other succubi come along for the ride, and a week of summertime fun begins. Join Hiroki as he breaks up vicious pillow fights, teaches Cosmos how to swim, and (begrudgingly) goes jogging with Hazel, all the while deepening his bonds with his adoring harem. Ayu is a famous idol beloved by men and women alike across Japan. Her songs are peppy and adorable; her stage outfits pink and frilly; her attitude sweet and innocent. That's the image she wants to project... but, in actuality, the real Ayu is quite different. She's cold and calculating, and some of her more disdainful expressions could curdle milk. She is very fond of Hiroki despite herself, however, and she's slowly becoming more honest with her feelings towards him. Marina is a wealthy businesswoman who owns her own company. She is one of the oldest of Hiroki's harem, and tries to act like a mature big sister should. She is generally calm and level-headed, but she's highly sensitive about her age - a fact which Ayu mocks mercilessly. Marina might act commandeering, but she has a soft side she only shows to those she loves. Away from the office and on the beach, Marina is more willing than she otherwise would be to let her hair down, and show Hiroki how cute she can really be. Cosmos is a social media star with a highly successful RapidPound account, which boasts over three million followers. Cosmos makes a living taking spicy photos of herself for her ever-growing audience, in a variety of costumes and poses. Cosmos loves her fans dearly, but she loves Hiroki even more. She's eager to please, and willing to do anything to make Hiroki happy... But, since she's an airhead, she sometimes takes things a bit too far. Hifumi is a well-regarded actress who has been working in the movie industry for over a decade. She's so popular, even Hiroki's father is a big fan of hers. Hifumi is an elegant, demure woman, who typically wears luxurious kimonos. On the beach, however, she prefers to dress more casually, in a baggy shirt and shorts. This is a side of Hifumi that her fans have never seen before, and it's all for Hiroki's sake. She might have changed up her look, but Hifumi is just as doting as ever, and she dreams of one day being Hiroki's wife. Hazel is a tennis star with a Japanese mother and an American father. She's unfailingly cheerful and upbeat, and is rarely seen without a big smile. She loves exercising, and is determined to get Hiroki to join her on her early morning jogs, even if it kills him. Hazel has a penchant for both pretty women and handsome men. She's very fond of Lady Yue, but she's just as fond of Hiroki. Unable to choose between them, Hazel has, instead, opted to love them both equally. Yue is the princess of the succubus realm. She may appear cool and aloof, but she has thawed out somewhat following the events of Sakura Succubus #3. Yue has spent most of the life in the succubus realm, governing he people. As such, she has few opportunities to enjoy the human world. She's determined to have some fun during the summer - and of course, she wants Hiroki to compliment her on her swimsuit.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1466690/header.jpg?t=1625154381",
    "Price": 9.99,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1466690/ss_2475583085810e7005d34616657c4b320e3e3a18.1920x1080.jpg?t=1625154381,https://cdn.akamai.steamstatic.com/steam/apps/1466690/ss_aa6d7f7b27fe37dc32a4de20e5500480d3af62b0.1920x1080.jpg?t=1625154381,https://cdn.akamai.steamstatic.com/steam/apps/1466690/ss_293767aa57a9ad59f75b3dd838f05a0f9efda30f.1920x1080.jpg?t=1625154381,https://cdn.akamai.steamstatic.com/steam/apps/1466690/ss_71cb41727e9cf5f9baf20faa88af8955c9667e66.1920x1080.jpg?t=1625154381,https://cdn.akamai.steamstatic.com/steam/apps/1466690/ss_1f1819e666a53dd1cf62e41943cde929ce0070da.1920x1080.jpg?t=1625154381,https://cdn.akamai.steamstatic.com/steam/apps/1466690/ss_e8852384683af138a8611f19bb17c1b12848e647.1920x1080.jpg?t=1625154381,https://cdn.akamai.steamstatic.com/steam/apps/1466690/ss_0d9b710a0e6fa9bce745588fea04f49327f672cf.1920x1080.jpg?t=1625154381",
    "Slug": "sakura-succubus-4",
    "Meta Title": "Sakura Succubus 4: Mar 1, 2021, Winged Cloud and Full Ove...",
    "Meta Description": "Looking for information on Sakura Succubus 4? Check out the release date (Mar 1, 2021), developer insights from Winged Cloud, and a complete game summary.",
    "Alt Text Image": "Official header image for Sakura Succubus 4 game - Steam 1466690",
    "Canonical URL": "https://gusku.site/game/sakura-succubus-4",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura Succubus 4\", \"description\": \"Looking for information on Sakura Succubus 4? Check out the release date (Mar 1, 2021), developer insights from Winged Cloud, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1466690/header.jpg?t=1625154381\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}