{
    "AppID": 204340,
    "Name": "Serious Sam 2",
    "Release date": "Jan 31, 2012",
    "About the game": "The iconic Serious Sam brings his trademark relentless intensity to this bigger, bolder, more colorful sequel to the classic Serious Sam: First and Second Encounters! Tasked with rescuing the universe one bullet at a time against overwhelming hordes of time traveling enemies, Serious Sam must battle through thick jungles, murky swamps, frozen tundra, and futuristic cities to bring down Mental and his vile armies. Serious Sam 2 is a shot of adrenaline to the hearts of first-person shooter fans across the world. This is serious! Key Features: Frantic Arcade-Style Action - Hold down the trigger and lay waste to a never-ending onslaught of bizarre enemies pursuing Sam from every angle and around every corner. Fearsome Enemy Creatures - Take up arms against 45 outrageous enemies and 7 intimidating bosses from bomb-toting clowns and windup rhinos to zombie stockbrokers and the iconic beheaded kamikazes! Spectacular Environments - Battle across more than 40 beautiful, expansive levels spread out over 7 unique environments and gain the support of the quirky native tribes. Destructive Weapons - Unleash Sam’s classic arsenal with the shotgun, minigun, rocket launcher, and cannon or square off with new guns like the Klodovik. Also, for the first time ever, use the alternative fire button to lob a grenade into an oncoming crowd of monsters and what the bad guys go boom! Powerful Turrets and Crazy Vehicles - Use powerful turrets to wipe out the relentless hordes of enemies and engage in heart-thumping action atop wild, mountable animals and intense, death-dealing vehicles. Helpful Native NPCs - Meet different races inhabiting environments and even fight side by side against enemies, to experience an additional bit of cooperative play feeling within the single player campaign. Co-Op and Deathmatch Chaos - Go to war against Mental’s horde with up to 16 players online and annihilate everything that moves across 45 levels of mayhem or drop the gauntlet and face off in brutal Deathmatch. Key updates since official release: Steamworks for online play - It eliminates the need for Gamespy for online play since the service has been announced to be officially closed. Controller support - Xbox 360 gamepad is now supported! Improved wide screen support. Fixed enemy spawning issues.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/204340/header.jpg?t=1630929543",
    "Price": 9.99,
    "Developers": "Croteam",
    "Publishers": "Devolver Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/204340/ss_213ef5809fa80a219fb55b165408b793b524f901.1920x1080.jpg?t=1630929543,https://cdn.akamai.steamstatic.com/steam/apps/204340/ss_94be201a7d44ce2bf4350f6b53f743475eead394.1920x1080.jpg?t=1630929543,https://cdn.akamai.steamstatic.com/steam/apps/204340/ss_219e24dcdf315af811f36dc1d065351d8bef4996.1920x1080.jpg?t=1630929543,https://cdn.akamai.steamstatic.com/steam/apps/204340/ss_355f131b99b9dfb8acd868293ff96080779af652.1920x1080.jpg?t=1630929543,https://cdn.akamai.steamstatic.com/steam/apps/204340/ss_5ea6ecd8e399c40d6bdb9b769e968929c19667c2.1920x1080.jpg?t=1630929543,https://cdn.akamai.steamstatic.com/steam/apps/204340/ss_f2af4307209f9cf64d90acc13802ad7f115dfed7.1920x1080.jpg?t=1630929543",
    "Slug": "serious-sam-2",
    "Meta Title": "Serious Sam 2: Jan 31, 2012, Croteam and Full Overview",
    "Meta Description": "Looking for information on Serious Sam 2? Check out the release date (Jan 31, 2012), developer insights from Croteam, and a complete game summary.",
    "Alt Text Image": "Official header image for Serious Sam 2 game - Steam 204340",
    "Canonical URL": "https://gusku.site/game/serious-sam-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Serious Sam 2\", \"description\": \"Looking for information on Serious Sam 2? Check out the release date (Jan 31, 2012), developer insights from Croteam, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2012\", \"author\": {\"@type\": \"Organization\", \"name\": \"Croteam\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Devolver Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/204340/header.jpg?t=1630929543\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}