{
    "AppID": 274620,
    "Name": "Skara - The Blade Remains",
    "Release date": "Oct 27, 2014",
    "About the game": "Skara is a Free-to-Play competitive team-based melee combat game for up to 6 players set in a fantasy world. Skara is now available for PC on the Steam Store. Easy to learn, hard to master, only the best can be legendary, remembered forever in Skara lore. Will you be among the next Skara heroes? Fast-paced combat with timing and accuracy focus Each survivor has his own 3rd person combat style with a personalized set of close combat movements and skills to fight in frenetic skirmishes. Team fighting synergies between characters In order to master the game you will need to learn the specificities of each culture’s combat style to take advantage of your survivor’s and play as a cohesive group of warriors, powering each other’s strengths. Quick multiplayer matches You can choose different game modes ranging approximately from 3 to 10 minutes. You cannot hide in the arenas, so you must kill your enemies before they kill you. Game modes Right now we have 2 game modes: a 1v1 “Duel” and a 3v3 “Last Team Standing”. And 3 arenas: “Jaarvi” is the icy scenario for the Duels and “Khilma - Lava Coliseum” with “Gâo-di - Temple of the Zem” are the two scenarios where the Last Team Standing matches take place. A 5v5 “Domination” is planned to come in the future. We will soon start working on 5v5 “Siege Battles”. Nearly all of them contain interactive elements. Danger is everywhere. Lore-Rich We have been working for the last four years to create a cohesive and rich Skara World with a strong culture background. We will introduce it to you through: in-game specific entries, some lore-related events, quotes from each Skara’s Culture in our medias and a ready to be published novel. Cosmetic based monetization system You will be able to personalise your survivors with aesthetic elements such as skins, emotes, victory poses and dyes. Playing Skara automatically means you have a say in its continued development. From achievements to game modes, there are a whole host of details that we leave open to you, the players, to decide. We are really a small team that takes the community seriously. Just check the forums to see that in action! 'And then it happened. I know not how to describe it with intelligible language - surely the Authorities must have words to describe these cosmic occurrences…' -Saltés Borian, Governor of Valemteim Celem is no longer the only Light that governs the world of Skara. Lôm, the lesser Light, engaged Celem in a celestial combat, wreaking havoc upon all that depended upon Him for life. Now the Lands of the Long North freeze while the Long South burns. Empires have fallen. Many have perished. And many more will continue fighting as what is left of Skara is reclaimed by those with the will to dominate. Will you? Fear comes from the belly. So Khärn cut the belly to let it out. Born from the bowels of Skara, these mysterious and violent raiders of the land are by far the strongest of all. However, their brute strength makes them slow, offering brave opponents a brief opportunity for victory. ...Soon all will know, and fear, the Sons of Fire. The tireless Celea escaped their burning homes to settle in a new land. Little did they know how soft and unprepared that land would be. Unstoppable in groups, the Celea are masters of Atash. “Anger that sits burns its bearer, Anger that moves burns others” -Shinse proverb The Shinse lost their ancestral lands on Skara’s coast to the invading Celea. Now they seek revenge. Swift and agile, the Shinse have only two types of opponents: The quick and the dead. “Gaal spake, the sound summoning Tamvaasa to spring from the sea Gaal was so glad in His glory, He gave great gifts to Tamvaasa Food for feeding, fields to frolick in, and forests for wondering…” -Tamvaasa creation hymn The Tamvaasa descend from the Long North, a hardened race with a proud history and an age old rivalry with their southern neighbours, the Durno. Their piercing attacks, combined with powerful song-lore taken from the wild, makes them a force to reckon with. Part of the vision of Skara is to allow players to literally become the protagonists of an unfolding drama. For now, we will hold a series of events for you to have a chance to be immortalized in Skara Lore. The first of them being the one called “Cataclysm”. After the full version release, new in-game features will keep embracing this vision.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/274620/header.jpg?t=1565084641",
    "Price": 0.0,
    "Developers": "Atomic Kraken",
    "Publishers": "Atomic Kraken",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/274620/ss_8b8bea669fa71e74213bbb8286dc2bfb94a1ff4c.1920x1080.jpg?t=1565084641,https://cdn.akamai.steamstatic.com/steam/apps/274620/ss_72a158776ef42be16df4d7841f14395942afc52c.1920x1080.jpg?t=1565084641,https://cdn.akamai.steamstatic.com/steam/apps/274620/ss_7894eef7e959cc0ea01f37705528c568c9242921.1920x1080.jpg?t=1565084641,https://cdn.akamai.steamstatic.com/steam/apps/274620/ss_760364f3b8163c19b726afdc9d75aa030b4464be.1920x1080.jpg?t=1565084641",
    "Slug": "skara-the-blade-remains",
    "Meta Title": "Skara - The Blade Remains: Oct 27, 2014, Atomic Kraken an...",
    "Meta Description": "Looking for information on Skara - The Blade Remains? Check out the release date (Oct 27, 2014), developer insights from Atomic Kraken, and a complete g...",
    "Alt Text Image": "Official header image for Skara - The Blade Remains game - Steam 274620",
    "Canonical URL": "https://gusku.site/game/skara-the-blade-remains",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Skara - The Blade Remains\", \"description\": \"Looking for information on Skara - The Blade Remains? Check out the release date (Oct 27, 2014), developer insights from Atomic Kraken, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Atomic Kraken\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Atomic Kraken\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/274620/header.jpg?t=1565084641\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}