{
    "AppID": 1814850,
    "Name": "Strangest.io's My Megamix '21",
    "Release date": "Apr 5, 2022",
    "About the game": "My Megamix '21 is the product of - The Strangest.io Supersensory Megamix: a week-long challenge to creators of all kinds to make the gnarliest, flashiest, ballsiest game possible. Many participated, few survived, fewer still made the cut. Out of this long, brutal week, was forged the bundle of a lifetime. Seven awesome games. One free price. Enter the mix. This compilation steam release is jam packed with seven incredible underground indie titles that span a host of genres and features. Download the launcher to access all of these titles and additional behind the scenes content! For more information on each of these supersensory games, read below! A portal to hell threatening life as we know it on earth? Simple solution - nuke the hell out of hell. Nukeheck feels like a bullet hell with the added sin of chaos. Shoot the hell out of demons, upgrade the hell out of your player, and bring a friend. Language: English Game mode: Online co-op only Credits: Ash Kamenskii Max Loboda Awards: SSMM'21 Official Selection Award Parsec Multiplayer Game Award You're lost in the void and you're not playing nice. This neon run n' finger-gun drips with style and suffocatingly slick action. Language: English Game mode: Single player only Credits: LinkerBM Awards: SSMM'21 Honorable Mention Award The true inspiration for a recent Netflix sensation. Contestants compete in an aquatic-animal-themed game show. The winner brings honor to their family, the loser - death. Language: Japanese Game mode: Single player only Credits: Strangest.io Awards: SSMM'21 Honorable Mention Award Mr.RedCoffe, pulling from recent experience with AirBnB, presents Hallucination. Like a nightmare, this thing chases you through the house. Like a nightmare, you may not get physically hurt but you may not leave with your sanity intact. Listen closely, run, hide, and then get out if you can. 5 stars, would stay again. Language: English Game mode: Single player only Credits: Mr.RedCoffee Awards: SSMM'21 Honorable Mention Award Mr.RedCoffe, pulling from recent experience with AirBnB, presents Hallucination. Like a nightmare, this thing chases you through the house. Like a nightmare, you may not get physically hurt but you may not leave with your sanity intact. Listen closely, run, hide, and then get out if you can. 5 stars, would stay again. Language: English Game mode: Single player only Credits: KOTOB (King Of The Orange Ball) Awards: SSMM'21 Honorable Mention Award Utkucbn knows that in the age of crypto and NFTs that many of us are confused and frightened. Enter MoneyCal. This powerful tool will help any beginner dip their toes in the current digital financial frontier. Language: English Game mode: Single player only Credits: Utkucbn Awards: SSMM'21 Honorable Mention Award Appropriate for the Supersensory Megamix. This game will make you feel something, though you may need a professional to help you understand those feelings. In Purgatory, listen to everyone's story, then decide who stays and who goes. Language: English Game mode: Single player only Credits: Paul Lethargy Awards: SSMM'21 T. A. Davis Human Achievement Award Take a few moments to consider some of the wonderful folks who helped us pull this badass project off: Parsec: Parsec is a proprietary desktop capturing application primarily used for playing games through video streaming. Using Parsec, you can stream video game footage through an Internet connection, allowing one to run a game on one computer but play it remotely through another device. Its the future of playing games online with friends and foes! Slow Magic: With over 100 Million streams to his name, the iconically masked Slow Magic has built a career around otherworldly and unique sounds paired with a live show that mixes electronic music with drumming. Gabrielle Genevieve: Game developer and artist based in Austin, Texas! Ghetto Commentary: From his own channel - 'I be making some lil gaming videos or whateva...subscribe if you bout it. I started this journey on May 29, 2017...Let's see where this takes me.' An extremely entertaining and funny Youtuber! Strangest.io: An independent development collective creating multiplatform experimental interactions across the globe ❤. The extremely talented folks who participated in SSMM'21",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1814850/header.jpg?t=1649216452",
    "Price": 0.0,
    "Developers": "Strangest.io,Ash + Maks,Mr. RedCoffee,Kotob,Paul Lethargy,Utkucbn,Linker",
    "Publishers": "Strangest.io",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1814850/ss_32170abd9181dcc49fc9233b5f62ded16b82e65c.1920x1080.jpg?t=1649216452,https://cdn.akamai.steamstatic.com/steam/apps/1814850/ss_303321dffb8e10ad37ea12737ca439cc236b9676.1920x1080.jpg?t=1649216452,https://cdn.akamai.steamstatic.com/steam/apps/1814850/ss_8b15eaf6d1141b2aa93d7f121c6eef2822c58ac2.1920x1080.jpg?t=1649216452,https://cdn.akamai.steamstatic.com/steam/apps/1814850/ss_dcf90a480dc0fe173a98da08f931842fb00b4237.1920x1080.jpg?t=1649216452,https://cdn.akamai.steamstatic.com/steam/apps/1814850/ss_d89f0d0513c3e11a423070c4d1309b673cc2e939.1920x1080.jpg?t=1649216452,https://cdn.akamai.steamstatic.com/steam/apps/1814850/ss_b386fbc4c3d3205d2b56e0c560d613c689b4efc3.1920x1080.jpg?t=1649216452,https://cdn.akamai.steamstatic.com/steam/apps/1814850/ss_027de8c317fb9b0afd877d73604c4408b1d90d8a.1920x1080.jpg?t=1649216452",
    "Slug": "strangest-io-s-my-megamix-21",
    "Meta Title": "Strangest.io's My Megamix '21: Apr 5, 2022, Strangest.io,...",
    "Meta Description": "Looking for information on Strangest.io's My Megamix '21? Check out the release date (Apr 5, 2022), developer insights from Strangest.io,Ash + Maks,Mr. ...",
    "Alt Text Image": "Official header image for Strangest.io's My Megamix '21 game - Steam 1814850",
    "Canonical URL": "https://gusku.site/game/strangest-io-s-my-megamix-21",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Strangest.io's My Megamix '21\", \"description\": \"Looking for information on Strangest.io's My Megamix '21? Check out the release date (Apr 5, 2022), developer insights from Strangest.io,Ash + Maks,Mr. ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 5, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Strangest.io,Ash + Maks,Mr. RedCoffee,Kotob,Paul Lethargy,Utkucbn,Linker\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Strangest.io\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1814850/header.jpg?t=1649216452\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}