{
    "AppID": 1873400,
    "Name": "SugarKiss!",
    "Release date": "Feb 18, 2022",
    "About the game": "Game Outline Adult romance connected by cigarettes! A story about enjoying the spoony on of a cool older sister. The small space of the smoking area is an alien space where hierarchical relationships fade away, it is different from private life, and that is why it becomes so intimate. Genre An adult romantic adventure with a cool older sister. Concept A new story by hachimitsu Soft is a mature romance between working adults connected by cigarettes! The theme is 'A story about enjoying the spoony on of a cool older sister!' Point１　Adult dating connected by cigarettes! Two people who meet because they smoke. It was a small smoking space, a kind of closed room. It's a different kind of space where the relationship between the top and bottom of the company is diminished. Because it is different from private life The story depicts a relationship that grows closer. Point２　A love story that spreads from a small space! At first, they only met in the small space of the smoking area. Gradually, they begin to meet in other places as well. The heroine and the protagonist get closer to each other. The story is structured in such a way that you can see the changes. This work also focuses on the process of 'living together'. There are also situations unique to pre-cohabitation! Point３　Focus on adult-like sex! Our relationship with each other is somewhat unclear now that we know each other as adults! Leaning back a little, or just letting the atmosphere get the better of you...... But she can't hide her feelings and true intentions that come out when they get together. Please enjoy these sex scenes that focus on the cuteness and eroticism of the heroine! The older, cooler sister at work. yuki koshimizu Height: 162cm　Blood type: O type Favorite things: Cigarettes, games, alcohol Dislikes: bothersome task Hobbies: Not particularly Strengths: It's dependable. Weaknesses: Appropriate in both good and bad ways. She is the boss of another department that she met in the smoking room at work, and now she is one of the protagonist few smoking buddies. At first glance, she seems quiet and cool, but when you talk to her, she is easy to get to know and her mischievous nature comes out as you get to know her. She's not particularly serious, but she does everything well and is valued at the company, but her motivation stops at 'it's just work' because she believes in 'cutting corners and living moderately. In my private life, I go out drinking alone. I'm enjoying my current life to a certain extent.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1873400/header.jpg?t=1645176997",
    "Price": 24.99,
    "Developers": "はちみつそふと",
    "Publishers": "ARTLINK",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1873400/ss_64a08169030cca9d580ade227c540d5da01dae98.1920x1080.jpg?t=1645176997,https://cdn.akamai.steamstatic.com/steam/apps/1873400/ss_0d54cb8cb10efa36f9bd88e309f2228fb67c4251.1920x1080.jpg?t=1645176997,https://cdn.akamai.steamstatic.com/steam/apps/1873400/ss_72dc47be68d53a00eab72dd8424ac3fa55a6957f.1920x1080.jpg?t=1645176997,https://cdn.akamai.steamstatic.com/steam/apps/1873400/ss_2da513029304db4c9852406ebf75f3c03f2e6124.1920x1080.jpg?t=1645176997,https://cdn.akamai.steamstatic.com/steam/apps/1873400/ss_ac75a9d4b960ea761faed52b695cb696b7e3b976.1920x1080.jpg?t=1645176997",
    "Slug": "sugarkiss",
    "Meta Title": "SugarKiss!: Feb 18, 2022, はちみつそふと and Full Overview",
    "Meta Description": "Looking for information on SugarKiss!? Check out the release date (Feb 18, 2022), developer insights from はちみつそふと, and a complete game summary.",
    "Alt Text Image": "Official header image for SugarKiss! game - Steam 1873400",
    "Canonical URL": "https://gusku.site/game/sugarkiss",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SugarKiss!\", \"description\": \"Looking for information on SugarKiss!? Check out the release date (Feb 18, 2022), developer insights from \\u306f\\u3061\\u307f\\u3064\\u305d\\u3075\\u3068, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 18, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u306f\\u3061\\u307f\\u3064\\u305d\\u3075\\u3068\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ARTLINK\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1873400/header.jpg?t=1645176997\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}