{
    "AppID": 1249890,
    "Name": "Survival Denied",
    "Release date": "Apr 21, 2020",
    "About the game": "Survival Denied is a casual zombie shooter, designed primarily with VR in mind. Made by gamers, for gamers! Wide choice of weapons, perks and power-ups make the game cool and re-playable. Dive in and try to survive as long as you can! We are releasing in Early Access and will be adding new features that YOU want! Current Features: 15 Weapons which gradually unlock as you get on with the carnage! 9 Unique perks (all level and stack up), which allow you to develop your character as you play! 8 Smashing power-ups to help you with the crowd control! 5 Different environments for your enjoyment! Large variety of zombie types and zombie skins! Global and local high scores will tell you how you stack up against your friends and the world! Survival mode - stay alive as long as you can! - Everyone is infected with zombie disease, that includes you ! But worry not, military comes with a rescue, collect air-dropped antidote every time you start deteriorating and you will be fine! (that is, as long as you shoot the zombies trying to eat you ;) ) Explosive barrels - because... REASONS!!! Forward rendering with beautiful MSAA! Smooth Locomotion - NO TELEPORTATION - If you are sensitive to motion sickness, this game MAY NOT BE a good idea FOR YOU. Smooth or Snap Turn - It's your choice! VR support, with motion controllers. Seated, standing or room scale. Play as you please. Steam Stats and Achievements - Who wouldn't like a badge for killing 10000 Zombies?? What to Expect: We want to be as honest and transparent with you as possible, If shooting zombies does have an entertainment value to you, keep reading! Some call it an 'endless shooter', except everything ends at some point. Survival game? But, you are not going to survive, by design (or aren't you? New update lets your progress to the next level as soon as you reach 30k points!). Whether you are chasing a high score or relaxing after a long day, Survival Denied provides great fun even in its current state. It is not our first project, but first publicly released game. We are four friends and family members with experience in video games industry. While the game is playable, it is important to keep in mind, we are releasing 'Early Access' and there will be changes to the game-play and mechanics, there may be bugs and issues, which we will iron out over time. The core works and will provide several hours of entertainment but the real value lies in the future. We want to get your feedback which will influence the further development. We are committed to expanding the core (more weapons, more zombies, more locations, more power-ups, more perks, more cool mechanics, more everything!) as well as adding additional modes on top of the 'Survival'. In the coming months, we will be adding content as well as making balance changes based on your feedback. We want to hear from you! Talk to us on Steam forums and Discord. have now published our plans for the future of the game, on Steam forums! Join us on the mission to deliver coolest VR zombie shooter on Steam! How to Play: You start in 'Menu' area. We avoid using classic graphic user interface as we believe it doesn't work well in VR. Instead you will find objects which can be interacted with, within the scene: Guns - You will find weapon pick-ups scattered around the maps. Red weapon avatar means weapon is locked, blue means unlocked. Number under the avatar indicates the score needed to unlock the weapon. When you are within pickup range (you need to walk over it), you will see blue particles raising from the base of the pickup. Press the grip button on your controller to pick the weapon (you can have a gun in each hand) Settings tent - Five quality levels can be activated here, each represented by number of blue bars. Red 'nuke' item resets your level unlocks. Press grip button on your controller to activate desired option. Additional options allow you to adjust game controls to your liking (HMD/Controller walking direction, Snap/Smooth Turn setting, together with sensitivity adjustment). Easy mode has now been added if you prefer more casual experience. Level selection - A blue or red mark followed by a miniature of a map. Blue light means level is unlocked and playable, red means level is locked. To unlock level, you must achieve score of 30000 or more in previous level. To load the level, walk into the middle of the miniature and press the grip button on your controller. Level Up - Once you kill some zombies, you will be granted with a selection of perks, simply walk over the perk of your choice and you will be granted an ability/increase in stats. Power-Ups - Some zombies will drop temporary power-ups upon death. Walk over them to collect them. Those will help you in your struggle against the horde! Leaderboards - Those tombstones show how you stack up, on each level, against your friends and globally. To exit the game, simply walk close to the EXIT on the 'Menu' level and press grip button on your controller. You can find detailed game guide on our forums and by clicking 'view the manual' button on this page.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1249890/header.jpg?t=1589228252",
    "Price": 11.99,
    "Developers": "What Does This Button Do LLC",
    "Publishers": "What Does This Button Do LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_18af11d131fc3a2ad915694bf85601d0b0b7a0bc.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_f6449b3703deec82c1372d8f6aaf9be790464625.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_bf26ab06e49778aee92185dc81806398a33f1096.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_4feb7ddfbc6aba2b7a70fa6db7f25119d209f4e1.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_b46931f7729ed8d4484ef666b1a576e052fabe08.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_13caec3ff6a342eb1e3200eaa4354d7089e2abc9.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_41e037ebd0e7388a878ee78d7d287b6de8e48383.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_8547e89406974a8f62bb2e3f9cc090fc88191a5f.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_74ae8449bfbadb2cdfbe1d540ec9c75c5a99a942.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_446cfcb25a495ece0dc1fd53e867e9e413dd7db8.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_aed1a9613bb0c278100ae13ccaa518ce9f24c63a.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_3489f60e4e0f5c23f59967c7b26f6681b4e2606b.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_4eae491bb744ab944fb0dca83548b4636c67e9d3.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_3de2596f577bac39aee541075cbf4a6d33d3b34d.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_8b19fb434fefae1a83280c784b74f5bc0828b117.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_c069aff779c984c3e54ce3dacf87a7ecc772b45d.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_bc9a55ca92c68c91ad82f860d075f847b28dc740.1920x1080.jpg?t=1589228252,https://cdn.akamai.steamstatic.com/steam/apps/1249890/ss_a928bc0db30b2b0c894745059b29fe18dea897bb.1920x1080.jpg?t=1589228252",
    "Slug": "survival-denied",
    "Meta Title": "Survival Denied: Apr 21, 2020, What Does This Button Do L...",
    "Meta Description": "Looking for information on Survival Denied? Check out the release date (Apr 21, 2020), developer insights from What Does This Button Do LLC, and a compl...",
    "Alt Text Image": "Official header image for Survival Denied game - Steam 1249890",
    "Canonical URL": "https://gusku.site/game/survival-denied",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Survival Denied\", \"description\": \"Looking for information on Survival Denied? Check out the release date (Apr 21, 2020), developer insights from What Does This Button Do LLC, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"What Does This Button Do LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"What Does This Button Do LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1249890/header.jpg?t=1589228252\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}