{
    "AppID": 1534980,
    "Name": "Terminus: Zombie Survivors",
    "Release date": "Mar 1, 2021",
    "About the game": "Terminus: Zombie Survivors is a turn-based survival roguelike that is set against the backdrop of a zombie apocalypse. Weeks have passed since the zombie virus took hold of humanity, and most of the population has already been infected. As one of the few survivors, you are still safely holed up in your house. When the power and water cut out, you must finally venture out to join up with the other survivors at the Terminus. Battle hunger, frigid temperatures, and zombies to make it to the safe zone and perhaps have a chance of survival! KEY FEATURES Randomly Generated Map - At the beginning of every run, an entire city is randomly generated, consisting of about 150 different places. The supplies you scavenge for and their locations are also randomly generated. This ensures no two games are ever the same, and your journey to the Terminus is just as challenging every time. Turn-Based Play - Every action you take deducts from your action points (AP). Strategic management of your AP while you move, search, and attack will be critically important to your survival. AP is restored at the beginning of each turn, but think carefully before you end your turn and give the zombies a chance to attack! Status Management - Keep an eye on your condition to stay in peak fighting shape. You’ll need to eat, sleep, and stay warm to perform optimally, and keep up your morale to have the courage to keep going. All of these things deteriorate after every turn, and finding ways to manage them is one of the game’s biggest challenges. Various Survivors - You won’t be given some generic survivor character. Each game begins with a character creator where you can name your character as well as select their occupation and trait. Make careful selections and allocate extra points to create the ultimate survivor. Various Places and Items - You’ll visit all kinds of locations, including police stations, grocery stores, and abandoned houses. These locations can contain hundreds of different items that will be important for your survival, like food, clothing, medicine, weapons, tools, and more. Fight Zombies - As you get closer to the Terminus, more and more zombies will stand in your way to prevent you from reaching your goal. At your disposal are a variety of weapons, each with its own advantages and disadvantages depending on the parts you choose to attack. Day/Night and Weather - With each turn, one hour passes. You’ll need to manage your time efficiently because once the sun goes down and darkness sets in, danger lurks around every corner unseen. You’ll also need to contend with rain, snow, and temperature changes, all of which affect your character’s condition. NPCs - On your journey, you will sometimes come across other survivors in the form of NPCs. These characters might be willing to trade with you or accompany you to the Terminus but it’s up to the player to either cooperate with these NPCs or threaten them and steal their supplies. Permadeath - If you are bitten by a zombie or succumb to the elements, that’s it for that character. Don’t let this discourage you, because every death is a lesson. Use what you learn to get closer to the Terminus every time. Different Modes - Aside from the Default Mode, there are also additional game modes (Out of Stock, Crowd, Frozen Zombies) that alter gameplay parameters and add challenges. Follow Terminus’s development on Twitter and Youtube for updates!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1534980/header.jpg?t=1658587429",
    "Price": 15.99,
    "Developers": "신인건",
    "Publishers": "Ingeon Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1534980/ss_957585bda39bf45644f62068f6c1f5181feafe1d.1920x1080.jpg?t=1658587429,https://cdn.akamai.steamstatic.com/steam/apps/1534980/ss_57a9faeb28af520d059b933090bbbc98a98c10fe.1920x1080.jpg?t=1658587429,https://cdn.akamai.steamstatic.com/steam/apps/1534980/ss_94c96af2079865ae0caa712fbf340e7857cad756.1920x1080.jpg?t=1658587429,https://cdn.akamai.steamstatic.com/steam/apps/1534980/ss_620ce197324b79f852773752000cc120217e6f3a.1920x1080.jpg?t=1658587429,https://cdn.akamai.steamstatic.com/steam/apps/1534980/ss_f465b823b678986bb781f9b94ad441710fb26190.1920x1080.jpg?t=1658587429,https://cdn.akamai.steamstatic.com/steam/apps/1534980/ss_d2f59a7ce44d11a8642d72504c359c8cb2afc239.1920x1080.jpg?t=1658587429,https://cdn.akamai.steamstatic.com/steam/apps/1534980/ss_ea72e94714b1d2061ca58360c779ee027d270aed.1920x1080.jpg?t=1658587429,https://cdn.akamai.steamstatic.com/steam/apps/1534980/ss_786390b1c2fbb8c7c2f5e1db741e37f8184b3c09.1920x1080.jpg?t=1658587429,https://cdn.akamai.steamstatic.com/steam/apps/1534980/ss_7fd0564ad5c53a9e84bbb2e321982efe3e3646b3.1920x1080.jpg?t=1658587429,https://cdn.akamai.steamstatic.com/steam/apps/1534980/ss_0aead27ad99eabb5ddfa4f409b5329b44041e57c.1920x1080.jpg?t=1658587429",
    "Slug": "terminus-zombie-survivors",
    "Meta Title": "Terminus: Zombie Survivors: Mar 1, 2021, 신인건 and Full Ove...",
    "Meta Description": "Looking for information on Terminus: Zombie Survivors? Check out the release date (Mar 1, 2021), developer insights from 신인건, and a complete game summary.",
    "Alt Text Image": "Official header image for Terminus: Zombie Survivors game - Steam 1534980",
    "Canonical URL": "https://gusku.site/game/terminus-zombie-survivors",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Terminus: Zombie Survivors\", \"description\": \"Looking for information on Terminus: Zombie Survivors? Check out the release date (Mar 1, 2021), developer insights from \\uc2e0\\uc778\\uac74, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\uc2e0\\uc778\\uac74\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ingeon Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1534980/header.jpg?t=1658587429\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}