{
    "AppID": 1823320,
    "Name": "The Voluptuous DEMON QUEEN and our Shoebox Apartment Life",
    "Release date": "Dec 23, 2021",
    "About the game": "Haruhiko Shigiyama—You're a boring office worker who works for a bad company (in office supply retail). You live alone as an obese virgin in your tiny four-and-a-half mat shoebox of an apartment, which is itself a disused relic of a bygone era. Your libido is incredible, but with no cash and no credit, you can't afford to clean yourself up, let alone afford the services of the ladies of the night. Every night, you get home exhausted. You eat, if only for the nourishment, and then collapse to sleep like a pile of mud on the floor. Every morning you wake up, and do it again. Your room is a mess that you never clean up, a reflection of the desolation in your heart. Still, you never snap: You hold it together, in a twisted subversion of your gentle nature. One day, things change. “What cramped, filthy confines. Protists. This is why we call them primitive, I suppose.” You've just gotten back to your decrepit apartment and slunk your blubber into the futon... That's when an explosion of light and a flood of sound fill your apartment. There, like a thunderclap, stands a stranger. You stand stunned. She's beautiful. Some category past supermodel that you've never even heard of. It's well beyond the level of just a pretty face. She exudes natural confidence in an aura so strong you can see it. Her sculpted face screams sex with a kind of perfection that not even her disgruntled expression could ever hope to scratch. And then—then there's her chest. Stunning, voluminous mounds. To put it vulgarly, hot DAMN those are nice tits. You do a quick double-take. Those things would put any porn actress to shame. If the rest of her were any less breathtaking, you might not be able to get your eyes off them. Those breasts are enough of a feast for the eyes to satisfy you for a lifetime, on their own. On top of which, her clothes aren't doing much to hide them. More than half of their curvaceous expanse is right there, exposed, for you to worship. This absolute unit of a woman is standing there, radiating self-certainty, dressed in the kind of scandalous outfit you'd never expect to see outside of anime and games. Are those horns on her head⁠...? Are those part of the costume? They don't look natural, but... while you're busy gaping, she gets in your face. She smells good. Sweet, and sexy, and almost violently tempting, the scent seems to leap right into you. This mysterious woman⁠—the Demon Queen, to hear her tell it⁠—licks her lips with a bewitching smile as she pushes you down. She needs to stock up on magic⁠, and it seems you're a tanker. “You're a veritable fountainhead of energy... It's difficult to believe that you never realized what you had hanging between your legs.” Squeezing your throbbing hard-on, smiling like a cat, she goes on to explain. To go back to her original world⁠—to replenish her wasted magic reserves⁠—she's going to be drinking deep from your stores of semen. Now you're the voluptuous Demon Queen's personal magic cock, getting squeezed out on the daily in your old shoebox apartment⁠—and things won't be the same for you ever again. Features Fully voiced in Japanese A no-frills, all-thrills single-player adventure CAUTION This is a work of fiction. All settings in this story are fictional and have no connection to any real individuals or organizations. All characters appearing in this game are over 18 years of age. This game contains nude scenes. You must be 18 years of age to purchase this item.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1823320/header.jpg?t=1640762344",
    "Price": 15.99,
    "Developers": "ORCSOFT",
    "Publishers": "Shiravune",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1823320/ss_aa8ea54c2a46b7694fa8ccf83e927016e8abaa67.1920x1080.jpg?t=1640762344,https://cdn.akamai.steamstatic.com/steam/apps/1823320/ss_553c58ba53901410338479f24156f48c2268ea52.1920x1080.jpg?t=1640762344,https://cdn.akamai.steamstatic.com/steam/apps/1823320/ss_b1c187313c527779430267f896f6336d3e330826.1920x1080.jpg?t=1640762344,https://cdn.akamai.steamstatic.com/steam/apps/1823320/ss_bd625f2350400d25cba7613c221d69cb302235ad.1920x1080.jpg?t=1640762344,https://cdn.akamai.steamstatic.com/steam/apps/1823320/ss_4659c5d5266d72a6a38a043aa979506534d59c02.1920x1080.jpg?t=1640762344,https://cdn.akamai.steamstatic.com/steam/apps/1823320/ss_35ae0cbde4aa33da71c4dad72b69788cdca99656.1920x1080.jpg?t=1640762344,https://cdn.akamai.steamstatic.com/steam/apps/1823320/ss_8c0dd59496ca5d50c98fd3444d4cdfa3a3b921cb.1920x1080.jpg?t=1640762344,https://cdn.akamai.steamstatic.com/steam/apps/1823320/ss_dff667550a4e580ef84ef1963a72f554c25a8ce6.1920x1080.jpg?t=1640762344",
    "Slug": "the-voluptuous-demon-queen-and-our-shoebox-apartment-life",
    "Meta Title": "The Voluptuous DEMON QUEEN and our Shoebox Apartment Life...",
    "Meta Description": "Looking for information on The Voluptuous DEMON QUEEN and our Shoebox Apartment Life? Check out the release date (Dec 23, 2021), developer insights from...",
    "Alt Text Image": "Official header image for The Voluptuous DEMON QUEEN and our Shoebox Apartment Life game - Steam 1823320",
    "Canonical URL": "https://gusku.site/game/the-voluptuous-demon-queen-and-our-shoebox-apartment-life",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Voluptuous DEMON QUEEN and our Shoebox Apartment Life\", \"description\": \"Looking for information on The Voluptuous DEMON QUEEN and our Shoebox Apartment Life? Check out the release date (Dec 23, 2021), developer insights from...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 23, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"ORCSOFT\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shiravune\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1823320/header.jpg?t=1640762344\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}