{
    "AppID": 1107230,
    "Name": "The 13th Doll: A Fan Game of The 7th Guest",
    "Release date": "Oct 30, 2019",
    "About the game": "The 13th Doll is a game created by and for fans of The 7th Guest series! It began as an all volunteer, freeware passion project, but evolved into a fully licensed game. In the 7th Guest, evil toymaker Henry Stauf built a mansion, and invited 6 guests. A 7th Guest, Tad, snuck in and was trapped there, afflicted by mystifying spirits, dolls and the ghosts of the other guests - until he defeated Stauf. The 13th Doll ties in with the events of The 7th Guest. A decade after Tad managed to escape the mansion, he is still haunted by the souls, dolls, and Stauf's victims he left behind. So haunted, in fact, that the young man now resides in a mental institution - misunderstood, plagued by guilt and obsessed with one idea: to escape the dreary padded walls of his asylum cell, return to the mansion - the site of his innermost fears - to rescue those he left behind and defeat Stauf once and for all! Soon, a new doctor by the name of Richmond arrives in the asylum. Naïve to the legacy of Henry Stauf, and equally bewildered and intrigued by the fantastic legend, the staunch rationalist plans to take Tad on a cathartic trip back to the mansion. This unconventional therapy attempt rapidly turns into a fateful journey, unravelling Tad and Richmond's contrasting worldviews and leading the unlikely duo straight into a horrifying vortex of lies, illusions, lunacy and death. And soon a blood-curdling question arises: Have the two visitors really made their way to Stauf's harrowing home on their own accord or are they mere pawns in a much grander, inescapable scheme? While playing The 13th Doll, a lot of time will be spent navigating through gloomy sites, concealed rooms and maze areas from an immersive first person perspective. Thanks to the game being developed in Unity3d, this becomes an advanced and engaging experience, as the engine allows free movement and a fully accessible environment in detailed high-definition visuals. For the first time, players will be able to explore every inch of Stauf's residence and face all its eerie inhabitants up close and personal. A plethora of interactive, delightfully animated objects will bring even the most desolate locations to life. Logic puzzles were an integral part of The 7th Guest's gameplay, and The 13th Doll follows suit. We've designed 26 original brain-teasers, all varying in style and offering a wide array of intellectual challenges. These diabolical creations are found throughout the game - whether it be card tricks, pathfinding and chess challenges, or even artificial intelligence puzzles versus Henry Stauf himself!.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1107230/header.jpg?t=1586317163",
    "Price": 19.99,
    "Developers": "Attic Door Productions",
    "Publishers": "Attic Door Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1107230/ss_cf83f7ee292dd5db0cdbc2efcb123a5069066416.1920x1080.jpg?t=1586317163,https://cdn.akamai.steamstatic.com/steam/apps/1107230/ss_2d378294a5f5ec3768dbc6dd7fcdc63cd3c23ab6.1920x1080.jpg?t=1586317163,https://cdn.akamai.steamstatic.com/steam/apps/1107230/ss_df5cf5bd6bbfd56dc9994207f549ad230b805895.1920x1080.jpg?t=1586317163,https://cdn.akamai.steamstatic.com/steam/apps/1107230/ss_38f4900ab538b9f4eb28517f703c97369ac9493c.1920x1080.jpg?t=1586317163,https://cdn.akamai.steamstatic.com/steam/apps/1107230/ss_87892761d608dbddd8eb2e34a1d03fe9f8e2e8a8.1920x1080.jpg?t=1586317163",
    "Slug": "the-13th-doll-a-fan-game-of-the-7th-guest",
    "Meta Title": "The 13th Doll: A Fan Game of The 7th Guest: Oct 30, 2019,...",
    "Meta Description": "Looking for information on The 13th Doll: A Fan Game of The 7th Guest? Check out the release date (Oct 30, 2019), developer insights from Attic Door Pro...",
    "Alt Text Image": "Official header image for The 13th Doll: A Fan Game of The 7th Guest game - Steam 1107230",
    "Canonical URL": "https://gusku.site/game/the-13th-doll-a-fan-game-of-the-7th-guest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The 13th Doll: A Fan Game of The 7th Guest\", \"description\": \"Looking for information on The 13th Doll: A Fan Game of The 7th Guest? Check out the release date (Oct 30, 2019), developer insights from Attic Door Pro...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 30, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Attic Door Productions\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Attic Door Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1107230/header.jpg?t=1586317163\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}