{
    "AppID": 1275260,
    "Name": "This will not go well",
    "Release date": "Apr 29, 2020",
    "About the game": "DESCRIPTION You are there... alone in a black empty void known as space inside your spaceship... it feels so empty... it feels so calm... but what the heck? Suddenly a rather annoying alarm in your spaceship starts to emmit a blasting sound and red lights.You put on your fish bowl space helmet and gaze through the main cargo door and in a gasp of horror... oh no!... you are surrounded by missiles that are coming straight at you! You try to perform evasive actions to avoid all of them. It seems you are a very clumsy astronaut that activated the defence system of a nearby planet, they think you are their enemy! How long would you be able to survive? It seems to me that... this will not go well... THE GAME CONTROLS Use the mouse to move the mouse in the menus (duh) and use the left button to click a button (double duh). If you are using a gamepad, use the left joystick or the D-Pad to move to the desired button, then press 'A' to select it. Turn spaceship left: if using keyboard press 'A' or 'Left arrow'. If using gamepad push left the left joystick or click the left D-Pad button. Turn spacehsip right: if using keyboard press 'D' or 'Right arrow'. If using gamepad push right the left joystick or click the right D-Pad button. Use spaceship powerup: If using keyboard press space. If using gamepad, press 'A'. Pause the game (while in a level): If using keyboard press 'ESC'. If using gamepad, press 'START'. THE GOAL AND HOW TO PLAY The goal of this game is simple. You are the spaceship. You have to avoid missiles and make then collide against each other or the terrain to win points and money. The more points you make, the better. The more time you survive, the easier it will be to make more points, but more difficult to avoid missiles will appear. A white circle surrounds the spaceship. It indicates the 'Danger zone'. If a hazard is within the 'Danger zone', time is slowed down until there are no hazards inside it. The hazards are the missiles and the terrain. Use the shop to acquire improvements for your spaceship so it is easier to avoid the missiles. You can also equip a different powerup and improve them. In the shop you may also acquires different spaceship which add a small buff to your current improvements.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1275260/header.jpg?t=1588845906",
    "Price": 0.99,
    "Developers": "Gurila Ware Games",
    "Publishers": "Gurila Ware Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1275260/ss_7bbb166a02603ad075cff92099d9e7accc485e8f.1920x1080.jpg?t=1588845906,https://cdn.akamai.steamstatic.com/steam/apps/1275260/ss_a1297107134819e127b3efffef0922da19c9e263.1920x1080.jpg?t=1588845906,https://cdn.akamai.steamstatic.com/steam/apps/1275260/ss_432efa486417430b4f50076a6ab2061e4d461998.1920x1080.jpg?t=1588845906,https://cdn.akamai.steamstatic.com/steam/apps/1275260/ss_8d022c029a46aa199aae261d7d890cb165a38fcf.1920x1080.jpg?t=1588845906,https://cdn.akamai.steamstatic.com/steam/apps/1275260/ss_e0feab71cfb378b495f14f60f4ff40bbb12af1e3.1920x1080.jpg?t=1588845906",
    "Slug": "this-will-not-go-well",
    "Meta Title": "This will not go well: Apr 29, 2020, Gurila Ware Games an...",
    "Meta Description": "Looking for information on This will not go well? Check out the release date (Apr 29, 2020), developer insights from Gurila Ware Games, and a complete g...",
    "Alt Text Image": "Official header image for This will not go well game - Steam 1275260",
    "Canonical URL": "https://gusku.site/game/this-will-not-go-well",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"This will not go well\", \"description\": \"Looking for information on This will not go well? Check out the release date (Apr 29, 2020), developer insights from Gurila Ware Games, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gurila Ware Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gurila Ware Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1275260/header.jpg?t=1588845906\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}