{
    "AppID": 886120,
    "Name": "UpBreakers",
    "Release date": "Nov 15, 2018",
    "About the game": "When hearts break and two angry singles are all that’s left from one happy couple, chaos is inevitable. High time to flee the apartment and grab as much of the stuff as you can carry! Who better to help moving out than the UpBreakers: A moving company that has also completely fallen out with each other and is breaking up failed households. The two rival companies don't spare themselves anything. Because only the team with the most transported furniture takes home the payoff in the end! UpBreakers is an action-packed casual game for 2-4 players (up to 16 in yet unfinished online mode), who compete against each other in two teams to haul the most stuff out of the broken household during the heated move. Prepare for chaos: You’ll have to push, throw, fling and tear your way through the game. Walls? Windows? Away with it! Where the UpBreakers show up, no walls are left standing! As a completely twisted moving assistant, you clear out the bourgeois suburban house with your friends before the other team does. Don't let the enemies screw up your victory, because they will push you around, wreak havoc and throw moving boxes until Grandma's porcelain is smahed to smithers! Fair play, respect and kindness? Wrong playce, kiddo! In this game, the masks are taken off and the pants are dropped when the players show their true and evil faces. If you master the training course in the tutorial, you're ready for the moving chaos with your friends: UpBreakers is quickly gaining pace. In the two relocation teams, players must work together to outdo the opposing group! In front of the house of the two separated clients, everyone gets on their marks – time is ticking and the chaos is taking its course: Coordinate with your team to hand over all the moving boxes, furniture and household items as fast as possible to collect points. Leave no stone unturned in preventing the opposing team from doing the same – because when time runs out, the team with the most points wins!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/886120/header.jpg?t=1606980693",
    "Price": 4.99,
    "Developers": "Bootsmann Games",
    "Publishers": NaN,
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/886120/ss_0672feac2bef4bedbaea908fc99ee9a90422af7c.1920x1080.jpg?t=1606980693,https://cdn.akamai.steamstatic.com/steam/apps/886120/ss_bf14517d7132ed58331fa476dafb2de7d9e7cffc.1920x1080.jpg?t=1606980693,https://cdn.akamai.steamstatic.com/steam/apps/886120/ss_bc627c5f6517910597f3236cac0c01b2e689f851.1920x1080.jpg?t=1606980693,https://cdn.akamai.steamstatic.com/steam/apps/886120/ss_1e50e2971bc017c5ffe72ca3459430a0e2b03c3f.1920x1080.jpg?t=1606980693,https://cdn.akamai.steamstatic.com/steam/apps/886120/ss_7d503d716f41016d831c76bb1b9b0d511de2e960.1920x1080.jpg?t=1606980693,https://cdn.akamai.steamstatic.com/steam/apps/886120/ss_95d42b32df0ff296cd6bd1f8f7ab98d8eff52fa4.1920x1080.jpg?t=1606980693",
    "Slug": "upbreakers",
    "Meta Title": "UpBreakers: Nov 15, 2018, Bootsmann Games and Full Overview",
    "Meta Description": "Looking for information on UpBreakers? Check out the release date (Nov 15, 2018), developer insights from Bootsmann Games, and a complete game summary.",
    "Alt Text Image": "Official header image for UpBreakers game - Steam 886120",
    "Canonical URL": "https://gusku.site/game/upbreakers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"UpBreakers\", \"description\": \"Looking for information on UpBreakers? Check out the release date (Nov 15, 2018), developer insights from Bootsmann Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bootsmann Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": NaN}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/886120/header.jpg?t=1606980693\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}