{
    "AppID": 1662750,
    "Name": "Wraiths of SENTINEL",
    "Release date": "Sep 16, 2021",
    "About the game": "Harness the phenomenal abilities of an unliving wraith to preserve liberty—or to subvert it. Will you use your powers over quintessence to save your nation, or will you profit from its broken shell?You are a phantom being of supernatural energy, working as a covert intelligence operative for a secretive government agency. Your unrivalled powers of surveillance can safeguard the freedom of the country; your paranormal wraith abilities will make the difference between being hunter and prey. Wraiths of SENTINEL is a 250,000-word interactive novel by Paul Gresty where your choices control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination. You returned to existence as a near-amnesiac ghost, powerless to interact with the world around you, and burned by strange rains that threatened to end this new unlife. At last you encountered agents of the shadowy government intelligence agency SENTINEL, who could see and hear you; within this network you found others like yourself, a sense of community, safety—and a purpose. The No-State Separatists are a ruthless band of domestic terrorists—but are they truly funded by legitimate politicians? Your preternatural powers of surveillance are required. Your investigation will delve into the realm of political corruption, draw you into the spirit world, and bring you to the nexus of all reality itself! Who are the No-Staters' political and paranormal allies? And is the true threat to the nation much closer than you'd suspected Play as a wraith that is male, female, nonbinary, straight, gay, bi, or beyond notions of mortal sexuality. Attain mastery in a range of phantom abilities, allowing you to exert your immaterial influence on the physical world around you. Investigate enemies of the state with two other wraiths, Marly and Zhou, as well as a range of field operatives and high-tech equipment. Pursue romance with a fellow wraith, a sorcerer, or a medium—or with some combination of these three. Explore the cause of your own mortal death! What role did a company named MetaHuman Inc. play in your demise? Go rogue! Try to escape detection by the best ghost-hunters in the world.Strive to return to your mortal, human life—or revel in the abilities you possess as a wraith, forever. Prevent god-like power from falling into the wrong hands—or pursue that power for yourself! The fate of the nation—and of the universe—is in your ghostly hands!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1662750/header.jpg?t=1631797942",
    "Price": 5.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1662750/ss_d00c6d3adb209ea8d4b37e01a1c6b759c25adbd9.1920x1080.jpg?t=1631797942,https://cdn.akamai.steamstatic.com/steam/apps/1662750/ss_87a9ae4aefa5706d8ba0b4e37dd00b96ddaf8afe.1920x1080.jpg?t=1631797942,https://cdn.akamai.steamstatic.com/steam/apps/1662750/ss_dc77bef3e5b1ff74656c85a877c1c7be61fe271b.1920x1080.jpg?t=1631797942,https://cdn.akamai.steamstatic.com/steam/apps/1662750/ss_6f224d16193f292be6508639e6554d1999405f0f.1920x1080.jpg?t=1631797942,https://cdn.akamai.steamstatic.com/steam/apps/1662750/ss_f7ee758a0213f26cc9b94c57ae66e447a979f1f8.1920x1080.jpg?t=1631797942",
    "Slug": "wraiths-of-sentinel",
    "Meta Title": "Wraiths of SENTINEL: Sep 16, 2021, Choice of Games and Fu...",
    "Meta Description": "Looking for information on Wraiths of SENTINEL? Check out the release date (Sep 16, 2021), developer insights from Choice of Games, and a complete game ...",
    "Alt Text Image": "Official header image for Wraiths of SENTINEL game - Steam 1662750",
    "Canonical URL": "https://gusku.site/game/wraiths-of-sentinel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wraiths of SENTINEL\", \"description\": \"Looking for information on Wraiths of SENTINEL? Check out the release date (Sep 16, 2021), developer insights from Choice of Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1662750/header.jpg?t=1631797942\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}