{
    "AppID": 974140,
    "Name": "Xtractor Defender",
    "Release date": "Nov 20, 2018",
    "About the game": "Game Premise MinSys Corporation, the premiere Inter-Planetary mining company specializing in military grade extraction of T98 mineral. You were recruited to attend MinSys Corp. prestigious Academy to become a Team Leader in charge of their Xtractor mining platform deployment . On planetary assignments you will be tasked to deploy and protect the Xtractor mining platform against enemy drones at all costs. Are You Up For the Challenge Team Leader ? Xtractor Defender is a single player RTS Tower Defense with a unique spin on tower defense genre with its Mobile Tower Units. Mobile Tower Units are vulnerable in mobile configuration and invulnerable in tower configuration. Mobile Tower Units must escort the Xtractor mining platform to the T98 mineral mining point and protect the Xtractor from enemy drones, while it mines for the initial energy to build its protection shield. Once the Xtractor as build its shield it is invulnerable to Alien Drones and your mission is accomplished. As a Team Leader you will be responsible of deploying Xtractor mining platforms throughout the universe for MinSys Corporation. Using Mobile Tower Units(MTUs) to protect and escort the Xtractor mining platform(Xtractor), the player will be in charge of taking time critical decision as to how: to deploy and set his MTUs and when to move them to counter Alien drones pattern. If the Xtractor is destroyed you will fail your mission. Escorting the Xtractor to the T98 mineral mining point is your first milestone, once the Xtractor starts mining you will have to protect it from hordes of Alien Drones until it completes its shield, when its shield is completed the mission is successful and the Xtractor mining platform is now free to mine the T98 mineral. At the beginning of each level you will have a set number of MTUs and it's up to the player to use them in the most efficient ways possible to result in a successful mission. You will have to strategically move and position your allocated MTUs . MTUs each move at different speed, have different firing ranges, use different type of Ammo it is up to you to optimize the positioning and movement strategies. Remember when MTUs are in mobile configuration they can be destroyed so be careful while moving them, the ones you lose are not replace and your job just became more complicated. Each of the 20 levels has deferent environments and dynamic. The controls are intuitive and the gameplay is challenging. The game provides the player with a save game option at any point to allow to the player to comeback to the game level without restarting it. There are many hours of gameplay in the main storyline, and give players unique starting conditions in each level. Levels one and two are easy to follow tutorial to familiarize the player with the game controls. The player will be exposed to a wide variety of enemies Alien Drones over the course of the game; this will force the player to adapt its defense approach and strategy. The different enemy types will become increasingly stronger an will keep the game challenging. As the levels progress, the enemies hordes grows in size and are more difficult to defeat and predict. Some patterns are reactive to player behavior. Alien drones class vary from very small to Titanic with various speeds and toughness. There is no one way to solve a mission level, it up to player's ingenuity on how to reach success.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/974140/header.jpg?t=1542722982",
    "Price": 4.99,
    "Developers": "Giroka Game Studio",
    "Publishers": "Giroka Game Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/974140/ss_5f01c0ac8c83da0fe1b63380504a4632ae130fb1.1920x1080.jpg?t=1542722982,https://cdn.akamai.steamstatic.com/steam/apps/974140/ss_b1022c64fba71927e4a31f347db3a54466d75aa3.1920x1080.jpg?t=1542722982,https://cdn.akamai.steamstatic.com/steam/apps/974140/ss_bf2deb692ad63f47c700205f8bb9d582c7ecf31c.1920x1080.jpg?t=1542722982,https://cdn.akamai.steamstatic.com/steam/apps/974140/ss_6b1f265212d19a008996f0230f922b59fd949eba.1920x1080.jpg?t=1542722982,https://cdn.akamai.steamstatic.com/steam/apps/974140/ss_b22d840c3e87f0dcd63c202cb02c4960043b1fbc.1920x1080.jpg?t=1542722982,https://cdn.akamai.steamstatic.com/steam/apps/974140/ss_6f23280d548cda30c2253603ab0567d77e0c37e5.1920x1080.jpg?t=1542722982,https://cdn.akamai.steamstatic.com/steam/apps/974140/ss_fa6a245fefdebd9dd7c8d06ee486b913325076ca.1920x1080.jpg?t=1542722982,https://cdn.akamai.steamstatic.com/steam/apps/974140/ss_46649a2396e1f616c2486a06d63f247434bef163.1920x1080.jpg?t=1542722982,https://cdn.akamai.steamstatic.com/steam/apps/974140/ss_53fd2ca33baaa48cf27eb3964857ae9e8bc5c1f7.1920x1080.jpg?t=1542722982,https://cdn.akamai.steamstatic.com/steam/apps/974140/ss_d5bc4578e3b2d3803d521e0aa0fb620c9076cb9e.1920x1080.jpg?t=1542722982,https://cdn.akamai.steamstatic.com/steam/apps/974140/ss_8c3bdea5703b277fc8b9c6a9c37948d21c3a4468.1920x1080.jpg?t=1542722982",
    "Slug": "xtractor-defender",
    "Meta Title": "Xtractor Defender: Nov 20, 2018, Giroka Game Studio and F...",
    "Meta Description": "Looking for information on Xtractor Defender? Check out the release date (Nov 20, 2018), developer insights from Giroka Game Studio, and a complete game...",
    "Alt Text Image": "Official header image for Xtractor Defender game - Steam 974140",
    "Canonical URL": "https://gusku.site/game/xtractor-defender",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Xtractor Defender\", \"description\": \"Looking for information on Xtractor Defender? Check out the release date (Nov 20, 2018), developer insights from Giroka Game Studio, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 20, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Giroka Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Giroka Game Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/974140/header.jpg?t=1542722982\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}