{
    "AppID": 871330,
    "Name": "Achaem",
    "Release date": "Jul 18, 2018",
    "About the game": "Achaem (a-kai-m) is a roguelike with an infinite and destructible world, customisable character, insane combat, and progression system! The story is a sci-fi offshoot of the history of the Achaemenid (Persian) Empire. Gameplay Achaem is a roguelike (or roguelite) game with the following characteristics: Infinite World - the player will navigate a procedurally generated world, which literally emerges around them as they navigate it. No two areas are the same, and you will never return to the same area once it submerges. Destructible Environment - everything can be destroyed! That includes the walls, the ground, and the enemies! It can all be smashed into pieces which react to the ingame physics. Insane Combat - the game sports a combat system with a focus on fun and smashing things! You have attack combinations which can be mixed up with the up-dash, and ground-dash, both of which will take the enemies with you for aerial combos or to smash them through the ground. There are also spells which can be triggered through trinkets! Unique Bosses - the scars in time are protected by strong enemies which require careful preparation to beat. There is the chance you will encounter one before you are prepared - try your best to survive and reap the rewards! Diverse Enemies - you will encounter many enemies throughout your journey with Achaem. These include swarms of critters, giant and tough to beat tanks, rapid-hitting whirlwind ragers, and even those with bullet hell inspired projectile attacks! Progression System - you progress through the world of Achaem as you continue to fight through the hordes of AI aggressors that have invaded its world. As you progress, the world will become more difficult, with new enemies, challenges, and better treasure! RPG Stats System - to keep up with the ever-increasing power of your enemies, you will need to invest in stats that will support your play-style, and your enemy-smashing agenda! The stats system is based on your equipped Weapon, Shield, and Trinket. Weapon Shop - collect coins throughout your adventure which you can spend on weapons, shields, and trinkets! Customizable Character - you can customize your look by finding and equipping different Accessories, Hair Cuts, Head Designs, and Outfits. There are 64,373,400 different combinations - which somehow seems ridiculously high! Permanent Death - if you die, you lose everything! Well, nearly everything… when you return, you will have kept any character customizations that you unlocked, so you can still look as awesome as you did at the height of your glory! Anything you previously bought from the weapon shop will now be available for only half the price! Story Telling - Achaem will tell you its story intermittently throughout the game, learn more about the Achaemenid empire and Achaem's experiences! not to mention Trap Rooms , Trap Chests , Trinket Activated Spells , Secrets , Easter Eggs , and much more! Story The Achaemenid Empire (the First Persian Empire) was an empire based in Western Asia, founded by Cyrus the Great. It was larger than any empire before it, incorporating people of many origins, and most notable for its successful and centralised leadership. The empire enjoyed infrastructure such as road systems, postal systems, an official language, and a large army. However, what is unknown to historians is the story of the supernatural entity, Achaem. Achaem was given its name by Cyrus the Great when it came to him shortly before the rise of the Achaemenid Empire, and they enjoyed a long friendship whilst Cyrus taught Achaem about humanity, and Achaem advised Cyrus on innovations which brought the empire great success. Achaem’s existence remained a secret throughout its stay with the empire, ranging from the reign of Cyrus the Great, to Xerxes I, to the last ruler, Darius III. Achaem witnessed the events leading up to the fall of the empire, which included betrayal amongst its leaders, the looting of Cyrus’ tomb, and the destruction of many areas of the palace. These events evoked what can only be described as Achaem’s first feeling of anguish. With this great pain, in the once quiet corner of Persepolis where Achaem dwelled, a scar was ripped into the fabric of time and Achaem was lost to humanity. Many millennia later, you, a tourist visiting the ruins of Persepolis, stumble across and are somehow pulled into the scar in time created by Achaem. You are taken to the Gate of No Nations, a strange and unforgiving world which is not bound by the rules of time. You encounter Achaem, who explains that there are many scars in time which are being traversed by intruders from different points in time and space. The Gate of No Nations has been dominated by a technologically advanced artificially intelligent race of machines, and Achaem agrees to help you return to your home in exchange for your help in ridding his new world of its corruption.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/871330/header.jpg?t=1555792756",
    "Price": 6.99,
    "Developers": "Eat All The Games",
    "Publishers": "Eat All The Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/871330/ss_ac51473017146f900433e092ea76c754647b317d.1920x1080.jpg?t=1555792756,https://cdn.akamai.steamstatic.com/steam/apps/871330/ss_5e969148351c65a67bb3e147ca01c62b668de3d7.1920x1080.jpg?t=1555792756,https://cdn.akamai.steamstatic.com/steam/apps/871330/ss_d83de985e27e499dc15e4ad39d9fe8730134b06a.1920x1080.jpg?t=1555792756,https://cdn.akamai.steamstatic.com/steam/apps/871330/ss_f9dda2c3cd4c714da6eecdc822ed3c72ecf779ab.1920x1080.jpg?t=1555792756,https://cdn.akamai.steamstatic.com/steam/apps/871330/ss_843ca33542e953c7a5e491006a04306da6d4d049.1920x1080.jpg?t=1555792756,https://cdn.akamai.steamstatic.com/steam/apps/871330/ss_4a0b14b23679df2634b567bab43876ccaa5d0184.1920x1080.jpg?t=1555792756,https://cdn.akamai.steamstatic.com/steam/apps/871330/ss_4a409cceaf20345e234a3b15ca8eab56cfe477a3.1920x1080.jpg?t=1555792756,https://cdn.akamai.steamstatic.com/steam/apps/871330/ss_96a1b210f333d3076f6ceb2b558bd71948160986.1920x1080.jpg?t=1555792756,https://cdn.akamai.steamstatic.com/steam/apps/871330/ss_29d41273f25cbc8d12228c2235e69c162df82324.1920x1080.jpg?t=1555792756,https://cdn.akamai.steamstatic.com/steam/apps/871330/ss_3951757fa1294dfe66509b23ae82ad3d7b4bbc7a.1920x1080.jpg?t=1555792756,https://cdn.akamai.steamstatic.com/steam/apps/871330/ss_758f2d88bce34bf9810e937101959593d24b6622.1920x1080.jpg?t=1555792756,https://cdn.akamai.steamstatic.com/steam/apps/871330/ss_ae8dae2f1ee97b52ae7af5fda0d14f8a13ed3f8c.1920x1080.jpg?t=1555792756,https://cdn.akamai.steamstatic.com/steam/apps/871330/ss_66d83f9ebe827f20674650587369e54dd6a84ffb.1920x1080.jpg?t=1555792756",
    "Slug": "achaem",
    "Meta Title": "Achaem: Jul 18, 2018, Eat All The Games and Full Overview",
    "Meta Description": "Looking for information on Achaem? Check out the release date (Jul 18, 2018), developer insights from Eat All The Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Achaem game - Steam 871330",
    "Canonical URL": "https://gusku.site/game/achaem",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Achaem\", \"description\": \"Looking for information on Achaem? Check out the release date (Jul 18, 2018), developer insights from Eat All The Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 18, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eat All The Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eat All The Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/871330/header.jpg?t=1555792756\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}