{
    "AppID": 868460,
    "Name": "Adventure of a Digger",
    "Release date": "Jun 16, 2018",
    "About the game": "The player must collect all the gold in a level while avoiding guards who try to catch the player. After collecting all the gold, the player must touch the top of the screen to reach the next level. Levels feature a multi-story, brick platform motif, with ladders and suspended hand-to-hand bars that offer multiple ways to travel throughout. The player can dig holes into floors to temporarily trap guards and may safely walk atop trapped guards. Should a guard be carrying a bar of gold when he falls into a hole it will be left behind, and can be retrieved by the player. Over time, floors dug into will regenerate, filling in these holes. A trapped guard who cannot escape a hole before it fills is consumed, immediately respawning in a random location at the top of the level. Unlike guards, the player's character may not climb up out of a hole, and will be killed if it fills before he can escape by other means. Floors may also contain trapdoors, through which the player and guards will fall, and bedrock, through which the player cannot dig. The player can only dig a hole to the sides, and not directly underneath himself. This introduces an important strategy for when digging a hole x blocks deep, the player must first dig a gap at least x wide to be able to dig through it, as the number of spaces will shrink with each layer, and the player needs at least one free adjacent space to be able to dig. However, exceptions to this rule arise when the player digs from the position of standing on a ladder, or hanging from a hand-to-hand bar, which allows the player to repeatedly dig and descend one row. This kind of digging is involved in solving many of the levels. The player starts with five lives; each level completion awards an extra life. Should a guard catch the player, one life is subtracted, and the current level restarts. The player's character can fall from arbitrary heights without any injury but cannot jump, and players can trap themselves in pits from which the only escape is to abort the level, costing a life, and begin again. The player may come into contact with a guard directly from above, with the stick figure's feet touching the guard's head. This is what enables the player to walk over guards who are temporarily stuck in a hole that has been dug. It is also possible to make this contact while both the guard and the player are in free fall, since the player not only runs faster than the guards, but also falls faster; moreover, it is possible to survive the feet-to-head contact while a guard is standing on a platform and begins to move. Both forms of contact are necessary to solve some levels. Sometimes it is necessary to liberate a trapped guard by digging while standing on his head, but then moving rapidly in the opposite direction when the guard begins marching to freedom. In a few levels, it is necessary to use a falling guard as a bridge to reach an otherwise unreachable area. One subtlety is that if a down movement is initiated while standing on a guard's head, or briefly touching the guard's head during free fall, the consequences are fatal. In some levels, guards can be deliberately trapped in various ways. They can be lured into entering a part of the level from which there is no escape. In some situations, the player can liberate trapped guards by digging them out. In some levels, to collect some gold pieces, the player must exploit the guards into collecting gold pieces.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/868460/header.jpg?t=1529171060",
    "Price": 9.99,
    "Developers": "D1ONE",
    "Publishers": "D1ONE",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/868460/ss_9c54b531dd1ff69583f64730a2b89b183111d09f.1920x1080.jpg?t=1529171060,https://cdn.akamai.steamstatic.com/steam/apps/868460/ss_64b92b49d246bd478156c07009db88e6cd5e11f4.1920x1080.jpg?t=1529171060,https://cdn.akamai.steamstatic.com/steam/apps/868460/ss_621f675a42668054951acc272615a2398102927a.1920x1080.jpg?t=1529171060,https://cdn.akamai.steamstatic.com/steam/apps/868460/ss_5c8c52345b6e1c6fc07a64c20dd331c3366bbbd2.1920x1080.jpg?t=1529171060,https://cdn.akamai.steamstatic.com/steam/apps/868460/ss_3322e5352484d9ff383d26194c9d7b169a967f96.1920x1080.jpg?t=1529171060,https://cdn.akamai.steamstatic.com/steam/apps/868460/ss_ef99fad820bc3dc58b899b3cf32473e0d7289def.1920x1080.jpg?t=1529171060,https://cdn.akamai.steamstatic.com/steam/apps/868460/ss_42fb9afdea855f508327dd0b31f54fe84ed4f4bc.1920x1080.jpg?t=1529171060",
    "Slug": "adventure-of-a-digger",
    "Meta Title": "Adventure of a Digger: Jun 16, 2018, D1ONE and Full Overview",
    "Meta Description": "Looking for information on Adventure of a Digger? Check out the release date (Jun 16, 2018), developer insights from D1ONE, and a complete game summary.",
    "Alt Text Image": "Official header image for Adventure of a Digger game - Steam 868460",
    "Canonical URL": "https://gusku.site/game/adventure-of-a-digger",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Adventure of a Digger\", \"description\": \"Looking for information on Adventure of a Digger? Check out the release date (Jun 16, 2018), developer insights from D1ONE, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 16, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"D1ONE\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"D1ONE\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/868460/header.jpg?t=1529171060\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}