{
    "AppID": 1647700,
    "Name": "Animal Defense Versus",
    "Release date": "Nov 3, 2021",
    "About the game": "Animal Defense VS is a turn-based game. Each turn you get SPAR based on the enemies you defeated in the previous turn, and use SPAR to summon heroes who come on stage and watch as they defeat the invading enemies. win It's not hard to win In Animal Defense VS, you need to build your team of heroes, strengthen them by choosing cards each turn, and fight invading enemies. If an enemy is not defeated and misses, it will lose health and persist to the end to win. Hero play introduction Hero team Every time you enter the battle, you will randomly match more than one team from all the heroes for you to choose, choose a team to become the team used in this battle, the hero summoned by this place will be the hero of this team. Summon heroes Through the call button, you can consume crystal stone to summon a hero. The call will randomly select 1 hero from the hero team and randomly select the entry position. Summon cost is fixed at 10 points per use. To upgrade the hero If you summon two heroes of the same character, drag them to form a more powerful two-star hero. If you have two two-star heroes, drag them to create a more powerful three-star hero. One hero can spawn up to seven stars. Introduction to card play Random card After each turn of successfully defending an enemy invasion, the store randomly refreshes three cards that can be used to strengthen the current hero. Select the card you want to play, and the enhancement will be applied to the corresponding hero. Store the refresh Refresh to consume SPAR to randomly create 3 new cards for you to choose from. Each refresh will improve the experience value of the store. When the experience value condition is met, the level of the store will be improved, and the quality of randomly issued cards will change, with a probability of randomly issuing higher quality cards. Loot Introduction Fight for the spoils Defeat enemies will drop question mark loot with a probability, and pick up random usable loot items. Using items can activate item effects and influence the trend of the battle. The props Each player has a maximum of three unused items, each item used takes effect at the beginning of the next turn, and the item disappears when used. 1 v1 match smackdown In Showdown mode, two players are randomly matched against each other. When one player has zero health, the other player wins. The confrontation mirror Defeating a normal enemy in a match will give the opponent a mirror enemy with the same stats. Defeating a mirror enemy will not give you a star core. Eight-man game Eight people scuffle In a game of eight, eight players are required to participate in a game of confrontation, and the final settlement is based on the ranking. Melee mirror In a game of eight, every time you defeat a normal enemy, you will give the next player a mirror enemy with the same stats. Defeating a mirror enemy will not give you a core. Props against Loot is only available in eight-player games, where players can use items to disrupt other players or defend against other players' item attacks. hero In Animal Defense vs, players randomly select a team of heroes from a pool of shared heroes. In the current version, there are a total of 16 heroes to choose from in the hero pool. The card In Animal Defense vs, players choose from a common card pool to form a deck of cards.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1647700/header.jpg?t=1636163371",
    "Price": 0.0,
    "Developers": "电钮组",
    "Publishers": "电钮组,B1 GAME",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1647700/ss_b8a7dcb97f47d82863ba0ed3a0d9a0ffcdf08a6b.1920x1080.jpg?t=1636163371,https://cdn.akamai.steamstatic.com/steam/apps/1647700/ss_6543bc82e5c384c729bbabf86cd0c76130171332.1920x1080.jpg?t=1636163371,https://cdn.akamai.steamstatic.com/steam/apps/1647700/ss_e6a7bd3212e8c91cae7603bd821ad5bee57283cf.1920x1080.jpg?t=1636163371,https://cdn.akamai.steamstatic.com/steam/apps/1647700/ss_1de5ad6c81eb50d1080210a10798040a14562b46.1920x1080.jpg?t=1636163371,https://cdn.akamai.steamstatic.com/steam/apps/1647700/ss_6db8fe874dc52b1f203a00189c5c79207bf6c04d.1920x1080.jpg?t=1636163371",
    "Slug": "animal-defense-versus",
    "Meta Title": "Animal Defense Versus: Nov 3, 2021, 电钮组 and Full Overview",
    "Meta Description": "Looking for information on Animal Defense Versus? Check out the release date (Nov 3, 2021), developer insights from 电钮组, and a complete game summary.",
    "Alt Text Image": "Official header image for Animal Defense Versus game - Steam 1647700",
    "Canonical URL": "https://gusku.site/game/animal-defense-versus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Animal Defense Versus\", \"description\": \"Looking for information on Animal Defense Versus? Check out the release date (Nov 3, 2021), developer insights from \\u7535\\u94ae\\u7ec4, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 3, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u7535\\u94ae\\u7ec4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u7535\\u94ae\\u7ec4,B1 GAME\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1647700/header.jpg?t=1636163371\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}