{
    "AppID": 1563720,
    "Name": "Captain Coffer 2D",
    "Release date": "Apr 5, 2021",
    "About the game": "Captain Coffer 2D (Dangers &amp; Doubloons) is an arcade platformer starring a real, immortal treasure of a hero. Hop away on your peglegs and blast doubloons across 16 handcrafted, puzzle-oriented stages. Make your escape before time runs out, and save the universe whilst discovering distinct, fantasy-themed worlds! 60 seconds and 1 doubloon. Unlock doors, climb ladders, boost off of springs, slide through sand, and banish the goons wreaking havoc throughout the lost kingdoms. Captain Coffer is indestructible, but his time is limited as each portal fades away. Falling means that you will have to guide our hero from the last checkpoint, but he will only return with as many doubloons that he started with from that point. The hourglass is still counting down, so keep track of time and try to find the quickest path to the next stage of your journey! Remember, tokens can be collected from afar with a well-placed doubloon blast. However, power-ups such as the MAGIC KEY and CROWN OF RICHES must be collected to unlock unique abilities. Discover more on your own, or even start the game at any stage. This quest is yours alone, but Dim would really prefer if you didn't take all of the credit. Many years ago, it was said that a famous explorer discovered a magical essence from the stars that fell on forgotten shores. Fizzling comets, teal and turquoise, tumbling down from the heavenly realms. The explorer was excited about this discovery and knew that his crew would be revered if they brought the star dust back to their king. Unfortunately, the essence that was stowed away began to weigh down the explorer's ship. The tired motor would have to be repaired, and the captain knew of only one nearby inventor from old stories. Following a faint star, the crew met the armored inventor who called himself 'Dim.' Dim agreed to help, and 'enhanced' the ship's motor using a box of the star dust as fuel. The captain's crew was ecstatic, and they imagined infinite possibilities! Dim, with a proud grin, pulled the motor's lever... Then, the entire universe as they knew it - exploded. The famous explorer was now trapped inside one of the treasure chests, he was now... CAPTAIN COFFER. Dim became lonely, so he declared himself 'Duke Dim' and began to use the dust to breathe life into the objects scattered about. These new friends were grumpy and allergic to his golden trinkets, so the self-appointed Duke had to scatter them far away into the lost kingdoms of the old world. Eventually, Duke Dim and Captain Coffer were reunited and decided that they must go back in time! It was here that Captain Coffer's real quest began... Your foes will come in wide range of shapes and sizes in Captain Coffer 2D . Be wary and become acquainted with these goons in order of appearance. CLASSY COCO - A stubborn coconut sporting a bowtie, bound to kick you around if you get too close! BURST-O-FLAMES SMOKESTACK - A disguised chimney bursting with flames, have patience! SKETCHY STAKE - A tall pencil that can't help but poke those above him! FIRECRACKER CUBE - A slippery bar of explosive soap... run away! ELECTRIC ENEMY - A jealous conduit of energy that will shock our captain or zap his doubloon blasts! ROWDY ROCKET - A spiraling projectile that will block ships and hopping heroes!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1563720/header.jpg?t=1617716472",
    "Price": 0.99,
    "Developers": "Oobeye Masterminds",
    "Publishers": "Oobeye Masterminds",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1563720/ss_92e2ca30643d1d4683e332c8cb1a223c8a975b6c.1920x1080.jpg?t=1617716472,https://cdn.akamai.steamstatic.com/steam/apps/1563720/ss_b925935593d5faf0fc28a95be407e45c5da66be7.1920x1080.jpg?t=1617716472,https://cdn.akamai.steamstatic.com/steam/apps/1563720/ss_b53e28bc2b91c78c5b40c51f657e651832308215.1920x1080.jpg?t=1617716472,https://cdn.akamai.steamstatic.com/steam/apps/1563720/ss_a48dcd8ad9bccc2ed75a9bc7013a4e5eb7bf44b6.1920x1080.jpg?t=1617716472,https://cdn.akamai.steamstatic.com/steam/apps/1563720/ss_ffa24771d79c640abba7c4d6e411e3cf7f6a10fb.1920x1080.jpg?t=1617716472,https://cdn.akamai.steamstatic.com/steam/apps/1563720/ss_88a93e8d9ff8ed16578286796cbc6a0c73fee478.1920x1080.jpg?t=1617716472",
    "Slug": "captain-coffer-2d",
    "Meta Title": "Captain Coffer 2D: Apr 5, 2021, Oobeye Masterminds and Fu...",
    "Meta Description": "Looking for information on Captain Coffer 2D? Check out the release date (Apr 5, 2021), developer insights from Oobeye Masterminds, and a complete game ...",
    "Alt Text Image": "Official header image for Captain Coffer 2D game - Steam 1563720",
    "Canonical URL": "https://gusku.site/game/captain-coffer-2d",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Captain Coffer 2D\", \"description\": \"Looking for information on Captain Coffer 2D? Check out the release date (Apr 5, 2021), developer insights from Oobeye Masterminds, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Oobeye Masterminds\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Oobeye Masterminds\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1563720/header.jpg?t=1617716472\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}