{
    "AppID": 341030,
    "Name": "Colonial Conquest",
    "Release date": "Jul 28, 2015",
    "About the game": "Colonial Conquest is a conquest simulation set in the Victorian age of warfare and expansion of the late 1800's and early 1900's. The object of the game is to become the dominant major power throughout the world. Players can be one among six of the great powers of the time: Great Britain, Germany, France, USA, Japan or Russia. Features Return to the era of Golden Warfare and rule one of handful of powers which had been shaping the face of our present world. Sail, ride and march across the globe as your nation flexes its military and economic muscles. Supplement brawn with subterfuge and use cloak and dagger tactics such as subversion and espionage. Compete with the European hegemons in their final golden days before they engulfed the world in the flames of the first global war. Play as one of the then two raising behemoths: the United States of America or Imperial Japan; or as one of the main European power to roll them back within their boundaries. Play against the AI or other human claimants to the mastery of our planet. More about the game You win by either scoring the most Victory Points (VPs) or being the first to reach a certain preset VP threshold, depending on scenario and custom choices in the main menu. To do so, you must capture regions over the world, and defeat your enemies in battle. The world has about 130 regions open to conquest. The regions have variable income and VP values (set randomly in the Standard scenario) and unknown until conquered or spied upon. Each region not owned by a Major Power usually has an independent Minor country owning and defending it. Each Major country is controlled by a human player or the computer, or is designated neutral and then acts as a Minor country. Hotseat play is possible, with an option to limit to 4.00 minutes the playing time per player. Each game turn represents roughly one season. Game lasts till victory conditions are achieved. Scenarios: game offers 3 scenarios: one starting in the year 1880 with an historical setting, one in 1914 with historical positions, and an open ca-1870 standard where nation only own their starting home territories (free-for-all non-historical) The game has 3 main phases, each player entering them in sequence, i.e. Build Phase (Spring only, with: Army &amp; Navy Construction, Fortification, Economic Aid, Espionage, Subversion), Movement Phase (Army &amp; Navy), and Combat Phase. Gameplay of each phase is rather simple and straightforward, as follows: Army and Navy Build Phase (Spring): Create new armies and fleets in your Supply Centers Fortification Phase (Spring): Fortify army units (except in Supply Centers which are already fortified). Economic Aid Phase (Spring): Lend money to other Major countries; which is added to their Treasury. Or Lend money to neutral Minor countries; which they use immediately to build armies. Espionage Phase (Spring): Learn the approximate (not always accurate) army strength and the income of a Minor country or of an region controlled by a Major country. And the region’s VP value Subversion Phase (Spring): Spend money to bribe a Minor country's army, weakening the country's defense or causing a coup (giving you control of the said country in return). Movement Phase (All turns): Move armies to adjacent regions only. Move navies alone or with armies from one port to another (or carry regiments to amphibious landings on enemy holdings). Combat Phase (All turns): up to twenty rounds of battle; each consists of naval (if ships are present) then land battles",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/341030/header.jpg?t=1592991933",
    "Price": 9.99,
    "Developers": "Argonauts Interactive,Collectif Nemoïd",
    "Publishers": "Plug In Digital,Argonauts Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/341030/ss_3f69bbc1aeef384ad1e3f8d6405c95bfbe4e501b.1920x1080.jpg?t=1592991933,https://cdn.akamai.steamstatic.com/steam/apps/341030/ss_20169ea2bd0c51f4b6a5a9aba146360fbace99fb.1920x1080.jpg?t=1592991933,https://cdn.akamai.steamstatic.com/steam/apps/341030/ss_e4f1afb33046de763a6b534ffa0f21c765b7d786.1920x1080.jpg?t=1592991933,https://cdn.akamai.steamstatic.com/steam/apps/341030/ss_85e654b09d96d00a129dbad869a62151f19d665c.1920x1080.jpg?t=1592991933,https://cdn.akamai.steamstatic.com/steam/apps/341030/ss_e94f61ea65f12e6631a3fb04ae8dbbbc880919e7.1920x1080.jpg?t=1592991933,https://cdn.akamai.steamstatic.com/steam/apps/341030/ss_cdd27c720dcd6002d13b194246a1e4a15027e9d0.1920x1080.jpg?t=1592991933,https://cdn.akamai.steamstatic.com/steam/apps/341030/ss_6320e8889db97b1d75c7c3ccfd6d50bebf6d3bd1.1920x1080.jpg?t=1592991933,https://cdn.akamai.steamstatic.com/steam/apps/341030/ss_a9a7e50aa44eec4a0191e8924f052cb4e37960bb.1920x1080.jpg?t=1592991933,https://cdn.akamai.steamstatic.com/steam/apps/341030/ss_a3ad9efafe01551ced50bf929640528fe9ea58e5.1920x1080.jpg?t=1592991933,https://cdn.akamai.steamstatic.com/steam/apps/341030/ss_bf91ad63f15785845aac30a4b49fce3d4a7b349c.1920x1080.jpg?t=1592991933,https://cdn.akamai.steamstatic.com/steam/apps/341030/ss_d145cf3723acb64127105cf64fdad957e7615440.1920x1080.jpg?t=1592991933",
    "Slug": "colonial-conquest",
    "Meta Title": "Colonial Conquest: Jul 28, 2015, Argonauts Interactive,Co...",
    "Meta Description": "Looking for information on Colonial Conquest? Check out the release date (Jul 28, 2015), developer insights from Argonauts Interactive,Collectif Nemoïd,...",
    "Alt Text Image": "Official header image for Colonial Conquest game - Steam 341030",
    "Canonical URL": "https://gusku.site/game/colonial-conquest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Colonial Conquest\", \"description\": \"Looking for information on Colonial Conquest? Check out the release date (Jul 28, 2015), developer insights from Argonauts Interactive,Collectif Nemo\\u00efd,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 28, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Argonauts Interactive,Collectif Nemo\\u00efd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Plug In Digital,Argonauts Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/341030/header.jpg?t=1592991933\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}