{
    "AppID": 1147130,
    "Name": "Countryballs: Modern Ballfare",
    "Release date": "Jun 11, 2021",
    "About the game": "Blends big bullets, bigger balls, and the biggest bats, with absurd abilities, crude customisations, and mediocre memes into what is surely the most modern and accurate representation of warfare ever depicted. Absurd Abilities - Just a mix of weird and wonderful perks that are mostly helpful most of the time. Fart your way to safety, or build Trump's wall. Adjust Your Balls - With so many Countryballs to choose from, represent your corner of this flat earth in a style that suits you, or one that offends everyone else. Several Whole Maps - Battle over a bunker, wage war in the woodlands, get rowdy on the rooftops, and avoid the grave in the grotto! We've got four finshed maps so far with more to come in the future! Whacky Weapons - We've got your machine guns, your rocket launchers, the fan favourite noobtube, we talkin' raygun, a giant finger, a throwable trashcan, you name it and we will probably add it. Four Player Online Co-Op Zombie Mode - Die alone or with friends against unrelenting undead hordes whilst you explore, upgrade weapons and get stomped by unfair bosses! Award Winning Music - Somehow convinced an award-winning composer to make the theme track, still no idea how or why, but we are grateful all the same! Patent Pending 'Dumb Bot' PVP AI - This might not interest all the cool kids with friends out there, but if you are anything like me then you'll love always having bot enemies to slaughter and be slaughtered by! Or are they ball shots... Either way, our ground-breaking technology guarantees your precision. It might even be the only shooter out there that can promise you score headshots every time. You'll feel so talented! Go you! Does jetpacking across a map, throwing poop in someone’s face, and then attend a disco sound appealing to you? With batshit abilities like this you'll have a blast frustrating your enemies whilst being frustrated by them! Fair AND exciting! Need I say more? Probably not, but I will because it's my job. Smash the Piñata and unlock accessories for balls. Show your balls off to impress your friends and enemies alike. This game is still in development and there are plenty of weird and wonderful additions we would like to make! If you have any thoughts or ideas you'd like to see make it into the game, send us messages and maybe we won't ignore them. Because why not spam us with ball pics and feature requests directly day and night? We can't blame you, we did it to ourselves!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1147130/header.jpg?t=1647365630",
    "Price": 7.99,
    "Developers": "Mildly Professional",
    "Publishers": "Mildly Professional",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1147130/ss_52e2bd598d4af8bdc17669cf2bc953e422afd66a.1920x1080.jpg?t=1647365630,https://cdn.akamai.steamstatic.com/steam/apps/1147130/ss_9d123d33282ee449b544e518743c2578d635c8c4.1920x1080.jpg?t=1647365630,https://cdn.akamai.steamstatic.com/steam/apps/1147130/ss_27e94732d57cd6bc1afc3940045cd495672904c9.1920x1080.jpg?t=1647365630,https://cdn.akamai.steamstatic.com/steam/apps/1147130/ss_a9f9032f47d77f628240cee3e44ee22e77c0e5c2.1920x1080.jpg?t=1647365630,https://cdn.akamai.steamstatic.com/steam/apps/1147130/ss_75f40fa847727a08b905eba282c7727ffdc4acb3.1920x1080.jpg?t=1647365630,https://cdn.akamai.steamstatic.com/steam/apps/1147130/ss_cac23b3d98ab30b4a97b1b6b4b1a55d07864d412.1920x1080.jpg?t=1647365630,https://cdn.akamai.steamstatic.com/steam/apps/1147130/ss_aad024252919e721356eaf302a8607b3e9dded45.1920x1080.jpg?t=1647365630",
    "Slug": "countryballs-modern-ballfare",
    "Meta Title": "Countryballs: Modern Ballfare: Jun 11, 2021, Mildly Profe...",
    "Meta Description": "Looking for information on Countryballs: Modern Ballfare? Check out the release date (Jun 11, 2021), developer insights from Mildly Professional, and a ...",
    "Alt Text Image": "Official header image for Countryballs: Modern Ballfare game - Steam 1147130",
    "Canonical URL": "https://gusku.site/game/countryballs-modern-ballfare",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Countryballs: Modern Ballfare\", \"description\": \"Looking for information on Countryballs: Modern Ballfare? Check out the release date (Jun 11, 2021), developer insights from Mildly Professional, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 11, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mildly Professional\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mildly Professional\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1147130/header.jpg?t=1647365630\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}