{
    "AppID": 872560,
    "Name": "Cubeology",
    "Release date": "Sep 20, 2018",
    "About the game": "Cubeology is a 3D picture cube matching puzzle game in which you select pairs of cubes with matching designs. When you match cubes with the same design they are removed, and you continue matching two cubes at a time until all the cubes are gone, either for points or against the clock. It has 6 different game variations, which can be played in either a cube layout or a sphere layout, with either free or fixed rotation, making for 18 game variations in total, from relaxed 'play at your own pace' to nail biting against the clock game types. It has separate leaderboards, which reset monthly, for each of the 6 different game types, plus a leaderboard of the top artifact bonus scores and has a rolling display of the monthly best time or score for each of the different game types. artifact Collection System. Upon successful completion of games you have a chance to gain gold, artifact fragments or whole artifacts. Collected artifacts are stored in your artifact compendium and give a bonus to your score when you match cubes with the same design as the artifact. The more your collection grows the greater the potential score bonus. You can also collect gold and artifact fragments, which you can trade for any artifacts you are missing from your collection. Some artifacts give a greater bonus score than others (but have a greater gold and fragments cost), and collecting multiples of the same artifact will further increase the bonus it gives. standard Game Remove cubes by matching pairs of same coloured cubes until there are none left. Earn extra points by matching multiple pairs in quick succession. No time limit. Your score in this game can be increased by collecting artifacts. timed Game Select pairs of matching cubes until there are none left. Initially there is a 15 minute time limit in which to finish the cube. The time limit decreases by 5% every time you successfully complete a game, or it increases by 5% if you fail to complete the game in time. speed Cube A fast paced game with a smaller 3x3 cube block and a 30 second time limit. How quickly can you clear the cubes, quick thinking and fast reactions will be required to top the leaderboard. Holder of the weekly best score is displayed on main menu. cube Builder The idea of this game is different in that you start off with just a few cubes and more are added as time goes by. The rate that cubes are added increases as time passes and the game is over when the block is fully rebuilt. Your goal in this game is to keep the block from being completed as long as possible and in doing so earn as many points as you can. As in the standard game extra points are awarded for matching pairs in quick succession. Your score in this game can be increased by collecting artifacts. picture Search This is a memory version of the standard game, in which all the designs are hidden and are only revealed when you click on the cubes. If you select two cubes that match they are removed as usual, otherwise the pictures are hidden again. Your score in this game can be increased by collecting artifacts. matchit! With this version of the game you have to find and select two cubes that have the same design as shown at the left of the screen. You have a limited time to find them and if you run out of time you will lose 10% of your current score, and you will be presented with another design to find. You can use the PASS button at the top of the screen to skip any that you are struggling to find without losing any score, but you only have 5 passes.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/872560/header.jpg?t=1537481718",
    "Price": 3.99,
    "Developers": "Creative Digital Design,Doofah Software",
    "Publishers": "Creative Digital Design",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/872560/ss_f337493b3b284b7747a7c3dbb49437db0c3348ec.1920x1080.jpg?t=1537481718,https://cdn.akamai.steamstatic.com/steam/apps/872560/ss_5ce8b6ac67659f767b9eb6f63afe4fd9ba221765.1920x1080.jpg?t=1537481718,https://cdn.akamai.steamstatic.com/steam/apps/872560/ss_b9cdc29fb2daaeda139236d149abd6e38ed4d72e.1920x1080.jpg?t=1537481718,https://cdn.akamai.steamstatic.com/steam/apps/872560/ss_ef21a81b9edc182d9a4b68078da1b9d1c0f47330.1920x1080.jpg?t=1537481718,https://cdn.akamai.steamstatic.com/steam/apps/872560/ss_05cd53f04043ab962f26d1ee84b708b653655c41.1920x1080.jpg?t=1537481718,https://cdn.akamai.steamstatic.com/steam/apps/872560/ss_4619dfeae96c7f1987b76169830f69075072ab1c.1920x1080.jpg?t=1537481718,https://cdn.akamai.steamstatic.com/steam/apps/872560/ss_57aa6b98f560edbb891f1a313e09b9d68373ce5a.1920x1080.jpg?t=1537481718",
    "Slug": "cubeology",
    "Meta Title": "Cubeology: Sep 20, 2018, Creative Digital Design,Doofah S...",
    "Meta Description": "Looking for information on Cubeology? Check out the release date (Sep 20, 2018), developer insights from Creative Digital Design,Doofah Software, and a ...",
    "Alt Text Image": "Official header image for Cubeology game - Steam 872560",
    "Canonical URL": "https://gusku.site/game/cubeology",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cubeology\", \"description\": \"Looking for information on Cubeology? Check out the release date (Sep 20, 2018), developer insights from Creative Digital Design,Doofah Software, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 20, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Creative Digital Design,Doofah Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Creative Digital Design\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/872560/header.jpg?t=1537481718\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}