{
    "AppID": 1839180,
    "Name": "Curtain Call",
    "Release date": "Apr 26, 2022",
    "About the game": "A wholesome, lighthearted visual novel where you play as a college student that meets students and helps them become their true selves. Who you are and the kinds of people you vibe with are completely up to you in this cute, choice-heavy experience. We all have issues or insecurities that weigh us down. To fit in with the rest of the world, we hide them from others. But what if the best way to connect with people, while simultaneously overcoming these challenges, was to help each other through them? 'Curtain Call' is about discovering who we really are and sharing it with the world. Chill out with new friends in this low stakes, stress-free environment. At the same time, help them through their daily struggles so they can get the most out of life. It's an experience that's full of whimsical charm and emotional moments with a focus on engaging, relatable lived experiences. Combined with a unique day/night mechanic, trust meter, and locations system, the fun to be had in this college experience is completely up to you! 5 different endings across 4 characters (including 1 secret ending/character). Replay to discover tons of branching narratives and unlock new art in the gallery menu. 6 save slots are available to make replayability a breeze. 1 to 1.5 hours per playthrough. Be your genuine self: choose your name/major and imagine yourself to be whatever gender, orientation, or personality you want. The main character has been designed for you to fill in. 3 distinct characters, with personalities ranging from infectious positivity to quirky social awkwardness. Some of them might even be open to something more romantic... Featuring a cast with relatable struggles, from dealing with academic burnout to trust issues from past bullying experiences. Build relationships using layered choices (how often/where/when to hang out with who) and conversation skills to improve your trust meter with characters. The higher it is, the closer you are to cracking through their mask. Novel gameplay mechanics: trust meter, day/night cycle, locations system. LGBTQ+, BIPOC representation included! You have a gift: the ability to see the social masks people hide their real personalities behind. As you grow closer, they start to crack, eventually shattering to reveal the beautiful person underneath each one. You've just arrived to college as a transfer student. Since many people made friends during freshman year, you're having a hard time socializing with others. Barely making it to the end of your first class, you find a seat next to JODIE (she/her, 20) . She acknowledges your presence, but that's about it. It seems she has a tough shell, but you can tell that there's a softer person underneath it all. On the way out of class, you (literally) run into a frazzled ARJUN (he/him, 20) who is rushing to office hours. He seems sweet, though caught up in his own head. Finally, you make it back to your dorm, where you meet BILLIE (they/them, 21) . They excitedly knock on your door to meet the new neighbor, talking at about 1,000 words per second. Its a lot to handle, but you can tell that they mean well and would be a ton of fun to hang out with. The best part: on your first day, you've been invited to hang out by all three of them! What these interactions turn into depends on the choices you make. Any which way, you'll come out of this experience with meaningful relationships.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1839180/header.jpg?t=1650956508",
    "Price": 0.0,
    "Developers": "Dramatis Personae Games",
    "Publishers": "Juggernaut Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1839180/ss_b9ed081d9592bd04acc0e7e8a21f85c5e966e934.1920x1080.jpg?t=1650956508,https://cdn.akamai.steamstatic.com/steam/apps/1839180/ss_2d7fd1f87308c3ac2f61fdada733646b86f0b0ff.1920x1080.jpg?t=1650956508,https://cdn.akamai.steamstatic.com/steam/apps/1839180/ss_34b5329cbae2fa2175a9aef62fdfd126c82850a6.1920x1080.jpg?t=1650956508,https://cdn.akamai.steamstatic.com/steam/apps/1839180/ss_8fb531725c286f5840a010022f6d0f88b2ff7dbc.1920x1080.jpg?t=1650956508,https://cdn.akamai.steamstatic.com/steam/apps/1839180/ss_2e960e55d20db976617371fe46bd0da23d8c941f.1920x1080.jpg?t=1650956508,https://cdn.akamai.steamstatic.com/steam/apps/1839180/ss_4575e2d7315fdc91f409f358895985958aa449f7.1920x1080.jpg?t=1650956508",
    "Slug": "curtain-call",
    "Meta Title": "Curtain Call: Apr 26, 2022, Dramatis Personae Games and F...",
    "Meta Description": "Looking for information on Curtain Call? Check out the release date (Apr 26, 2022), developer insights from Dramatis Personae Games, and a complete game...",
    "Alt Text Image": "Official header image for Curtain Call game - Steam 1839180",
    "Canonical URL": "https://gusku.site/game/curtain-call",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Curtain Call\", \"description\": \"Looking for information on Curtain Call? Check out the release date (Apr 26, 2022), developer insights from Dramatis Personae Games, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dramatis Personae Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Juggernaut Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1839180/header.jpg?t=1650956508\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}