{
    "AppID": 1917450,
    "Name": "fault - StP - LIGHTKRAVTE",
    "Release date": "May 27, 2022",
    "About the game": "fault - StP - LIGHTKRAVTE is the latest entry in the fault series, which has shipped over 500,000 copies worldwide. The stories in fault are presented in the form of cinematic visual novels, which tell gripping tales of human drama in a world where science fiction has melded with fantasy. Experience the series’ unique ability to bend and blend genres, all the while preserving the pillars of good storytelling that keep readers engaged. Whether your tastes skew toward action and adventure or abstract abstrusity, you’ll surely find something to love in fault. *Completion of previous titles in the series, fault - milestone one and fault - milestone two side:above, is not required to enjoy fault - StP - LIGHTKRAVTE. There exist worlds that are forever beyond reach, and wishes that can never come true. In the Kingdom of Rughzenhaide, where the development and proliferation of a technology known as manakravte has greatly enriched the lives of its people, an ordinary and entirely unremarkable boy named Khaji leads an entirely unremarkable life as the son of a fruit farmer. Khaji’s dream is to become a painter, and he works diligently to improve his skills. Day after day, he practices, and day after day, he is forced to confront the superior talent and creativity of his peers. His confidence grows increasingly battered, but his days remain unchanged, ordinary and peaceful as ever... Until a shocking revelation shatters everything he thought he knew about himself and the world around him. Look, ma, they move! Marvel as characters both new and familiar bring scenes to life like never before with gorgeously expressive animations! Remember when they used to call them kinetic novels? We’re putting the “kinetic” back into the term! It sure is a novel! And a very visual one at that. Lovers of both text and art will find much to enjoy in this story boasting over 200,000 Japanese characters and over 50 unique event CG’s. What’s a manakravte? Those new to the series have nothing to fear, as a handy encyclopedia function will help keep readers in the loop regarding the more involved aspects of the lore. Series Timeline fault - StP - LIGHTKRAVTE is a prequel set in Rughzenhaide, the hometown of Ritona and Selphine, and takes place five years before the events of fault - milestone one. This game is a part of the fault - SILENCE THE PEDANT sequence. *fault - SILENCE THE PEDANT is currently playable in demo form",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1917450/header.jpg?t=1654745168",
    "Price": 17.99,
    "Developers": "ALICE IN DISSONANCE",
    "Publishers": "Phoenixx Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1917450/ss_d0994ac849cae727a72e3d7ec78ee19026b4723e.1920x1080.jpg?t=1654745168,https://cdn.akamai.steamstatic.com/steam/apps/1917450/ss_420138406c0a24c95bdcc8a146cebcef273ccccd.1920x1080.jpg?t=1654745168,https://cdn.akamai.steamstatic.com/steam/apps/1917450/ss_888c56df41623e492369161e46660d9549302fbd.1920x1080.jpg?t=1654745168,https://cdn.akamai.steamstatic.com/steam/apps/1917450/ss_e5a2e7aea91f8a4d486d54bd0a35c94978b9a2a0.1920x1080.jpg?t=1654745168,https://cdn.akamai.steamstatic.com/steam/apps/1917450/ss_1274435b0601bade1951acceed00206d90884588.1920x1080.jpg?t=1654745168,https://cdn.akamai.steamstatic.com/steam/apps/1917450/ss_3249f2f5c3aca7c54b25b0d51d606a6014280b12.1920x1080.jpg?t=1654745168,https://cdn.akamai.steamstatic.com/steam/apps/1917450/ss_5d7afa834e948a058353631cf554a62ec3bd9c31.1920x1080.jpg?t=1654745168",
    "Slug": "fault-stp-lightkravte",
    "Meta Title": "fault - StP - LIGHTKRAVTE: May 27, 2022, ALICE IN DISSONA...",
    "Meta Description": "Looking for information on fault - StP - LIGHTKRAVTE? Check out the release date (May 27, 2022), developer insights from ALICE IN DISSONANCE, and a comp...",
    "Alt Text Image": "Official header image for fault - StP - LIGHTKRAVTE game - Steam 1917450",
    "Canonical URL": "https://gusku.site/game/fault-stp-lightkravte",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"fault - StP - LIGHTKRAVTE\", \"description\": \"Looking for information on fault - StP - LIGHTKRAVTE? Check out the release date (May 27, 2022), developer insights from ALICE IN DISSONANCE, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"ALICE IN DISSONANCE\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Phoenixx Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1917450/header.jpg?t=1654745168\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}