{
    "AppID": 1418610,
    "Name": "FEVER: FIGHT THE FEVER",
    "Release date": "Feb 11, 2021",
    "About the game": "FEVER is a fast-paced game which puts you in control of the body's most powerful defenses. Learn to use the immune system to defeat minor germs on a regular basis, and before long you will be defending against viruses, diseases, and even unknown entities. Choose the enemies that most require your attention and learn what threats the immune system can handle on its own. This is the path to VICTORY! But beware, the immune system is a fragile ecosystem, the body responds to most threats by raising and lowering it's temperature. Allow it to be overwhelmed and your immune system will collapse, rendering you unable to defeat the incoming foreign creatures. If your body temperature gets too high, you will succumb to the FEVER and all will be lost. If your body temperature gets too low, hypothermia will set in and the body will be too weak to mount a defense against the incoming hordes. GAMEPLAY From your vantage point, inside the blood vessels, various germs, viruses, diseases and other ailments will try to overcome the body. Quickly sterilize them as they race towards you. Unlike many games, FEVER boasts a dynamic health system; your temperature gauge (thermometer) will raise or lower in response to the different microbial assaults and either extreme temperature (Hot or Cold) will collapse your immune system and spell destruction for the body. But you are NOT isolated! The immune/circulatory systems of the body have your back! Collect enough 'Cellular Residue' from your enemies and you can create White Blood Cells (WBCs) to help you attack the invading forces. Or you can even take direct control of the circulatory system to flush out the foreign entities; your Red Blood Cells (RBCs) will keep the blood flowing and help regulate your body temperature back to an optimum level of YOUR CHOOSING! RBCs can even sweep away certain contaminates giving you more time to take permanent action. NOT ENOUGH? Well how about spending your Cellular Residue to directly upgrade your Blood Cells? Increase the spawn frequency or amount of either Blood Cells and or upgrade each type's unique abilities! RBCs not regulating temperature well enough? Then boost their performance and each one can alter the body temperature by a much greater amount. As for your WBCs, build up these bad boys and they'll pack a bigger punch requiring far fewer numbers to take out a given enemy. OBJECTIVE SURVIVE! REPEL THE INVADERS! Take on multiple bosses as you rack up that Cellular Residue, your score also increases in a true old-school arcade-style which will leave you setting and breaking High-scores like never before. But body health is an ongoing struggle, so even after you defeat the big baddies of the body there will still be plenty of cleanup to do in the 'endless mode'. Reach never before scores with an ever increasing difficulty in the fight to stay healthy! VENTURE INSIDE AND BATTLE SWARMS OF ENEMIES Journey inside the body and battle the biological forces that threaten to overwhelm your immune system. Utilize the immune system's defenses including; Body Temperature Regulation Red Blood Cells White Blood Cells Immune System Upgrades and more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1418610/header.jpg?t=1613077815",
    "Price": 8.99,
    "Developers": "Zin Games LLC",
    "Publishers": "Zin Games LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1418610/ss_0dd187530ee930e2382307e17bb796947e756bf1.1920x1080.jpg?t=1613077815,https://cdn.akamai.steamstatic.com/steam/apps/1418610/ss_db1b825ed4bdfc063c3fc941e71cdab7ca23f751.1920x1080.jpg?t=1613077815,https://cdn.akamai.steamstatic.com/steam/apps/1418610/ss_7b92b313f200a3b54b16c63763e3e07b4eb2bd34.1920x1080.jpg?t=1613077815,https://cdn.akamai.steamstatic.com/steam/apps/1418610/ss_ea41c3cef435d20ff7929e54a08a231bac94b356.1920x1080.jpg?t=1613077815,https://cdn.akamai.steamstatic.com/steam/apps/1418610/ss_016dc5c2d8faee8415d82dd896568c09077c9c20.1920x1080.jpg?t=1613077815,https://cdn.akamai.steamstatic.com/steam/apps/1418610/ss_5dfea0924bf3a9a6ff5bbbc159242502ab382c17.1920x1080.jpg?t=1613077815,https://cdn.akamai.steamstatic.com/steam/apps/1418610/ss_b1c5567f95689655c600c30f5cd8a6d02c1851bd.1920x1080.jpg?t=1613077815,https://cdn.akamai.steamstatic.com/steam/apps/1418610/ss_9ce967ee4ee206e01104be17bb373da8b455ae8b.1920x1080.jpg?t=1613077815",
    "Slug": "fever-fight-the-fever",
    "Meta Title": "FEVER: FIGHT THE FEVER: Feb 11, 2021, Zin Games LLC and F...",
    "Meta Description": "Looking for information on FEVER: FIGHT THE FEVER? Check out the release date (Feb 11, 2021), developer insights from Zin Games LLC, and a complete game...",
    "Alt Text Image": "Official header image for FEVER: FIGHT THE FEVER game - Steam 1418610",
    "Canonical URL": "https://gusku.site/game/fever-fight-the-fever",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"FEVER: FIGHT THE FEVER\", \"description\": \"Looking for information on FEVER: FIGHT THE FEVER? Check out the release date (Feb 11, 2021), developer insights from Zin Games LLC, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 11, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zin Games LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zin Games LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1418610/header.jpg?t=1613077815\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}