{
    "AppID": 1412970,
    "Name": "楚漢女子",
    "Release date": "Feb 8, 2021",
    "About the game": "A new kind of historical novel adventure. Your choices will be the guideposts of this story. The story is a unique one. The story is unique to 'Chuhan Girls'! What if the two main characters leading the Chu-Han War were women? What if the two protagonists leading the Chu-Han War were women? In 'Chu-Han Girls', which depicts the Chu-Han War from a new perspective, you can enjoy the stories of the warrior warrior Han Yu and the wise warrior Liu Bang. You can also change the fate of the main character, whichever you choose in the early chapters of the story, by making choices. You can also change the fate of the main character by making choices that differ from the historical facts, and sometimes you will encounter unexpected developments! You can change the fate of the main character with your guidance! Your opponent's behavior patterns will change! The game features a thrilling 'Virtual Mode' that will keep you on the edge of your seat! If you turn on 'Virtual Mode', the protagonist you didn't choose in the beginning of the story will become an AI, and the choices will be chosen randomly. (When 'Virtual Mode' is turned off, the game will follow the historical facts. Even if you make a choice to grab the fate you want, you may be thwarted by the other AI-ized protagonist. ・・・・・・! In this game, you'll find a story that can only be found when coincidence and inevitability are mixed together. The first chapter of the story. This is a story about a man and his family. Qin Shi Huang, or Ying Zheng, the first emperor of the Qin Dynasty, was suspicious of Hu when he heard the ominous news. He suspected that the word 'hu' referred to the four barbarians who lived in the four corners of China. ---Where is this Ebisu? The most powerful of the four barbarians, the northern barbarians, had already been defeated by the Great Wall of China. If the barbarians to the east, the barbarians to the west, and the barbarians to the south threatened the Qin Dynasty, it would be necessary to prepare for them. However, the first emperor who asked was told none of these things. The Qin Dynasty destroyed the country of Chuxing. When the Qin Dynasty destroyed the country of Chuxia, there was a girl named Cui among the wanderers fleeing their pursuers. She had a large body with a heavy left eye, and her father did not love her because of an unfortunate incident in her birth, and her mother was persecuted as well. However, she had an uncle, Han Liang, whom she respected very much, and under his guidance, she was able to train herself to be a warrior, and people naturally followed her. Under the leadership of her uncle, Kuang Liang, who was trained in martial arts, people naturally followed her. She was praised as a black panther for her abilities. Will her bravery be enough to level the world or not? It's a great way to get to know the people in your life. Liu Bang's route. During the Qin Dynasty, in a deep-rooted farming village called Feng, there was a girl named Qi. She had blue eyes and red hair, and due to an unfortunate incident in her birth, her father did not love her, and her mother-in-law treated her as if she were a servant. However, her sincere character of serving her family well and not being desperate despite the bad circumstances naturally attracted people around her, and she steadily gained allies. Then, an old man, Mr. Lu, takes an interest in her and invites her to a banquet, where her fate begins to take a big turn. She was told that her personality was that of a speckled cow. She is later called Liu Bang, but is her horn really worthy? She had no way of knowing that the time would come when her true worth would be tested. This is the first book in the series that I've read where the reader is able to read the entire story. This is the first time I've ever seen such a thing. There are a number of features in 'Chuhan Girls' that will help you get rid of your worries! A flowchart that shows the timeline of the story You can leave notes with the text. A flowchart that shows the timeline of the story A 'dictionary' that allows you to quickly look up unfamiliar words A 'map' that shows the main character's current location and destination at a glance Animal motifs that make it easy to remember the many characters A dictionary of people's names to help you remember even if you forget. In addition, you can set the font size, vertical/horizontal writing, margins, text display speed, and more! Customize it to your liking, and immerse yourself in the world of 'Chuhan Girls' to your heart's content!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1412970/header.jpg?t=1613874990",
    "Price": 4.99,
    "Developers": "株式会社Viola",
    "Publishers": "株式会社Viola",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1412970/ss_2393adb61467cce9189dea737ae148dfbdcf9371.1920x1080.jpg?t=1613874990,https://cdn.akamai.steamstatic.com/steam/apps/1412970/ss_f1f5289a713e67b003c5869f8d9214133af1a486.1920x1080.jpg?t=1613874990,https://cdn.akamai.steamstatic.com/steam/apps/1412970/ss_1227e4ce63176e0c49edc6d37313b63eb41991a6.1920x1080.jpg?t=1613874990,https://cdn.akamai.steamstatic.com/steam/apps/1412970/ss_0451b8efd2c64ac3e439417f41e2a5e2d977d502.1920x1080.jpg?t=1613874990,https://cdn.akamai.steamstatic.com/steam/apps/1412970/ss_749ea475f93cdb9d79943c3848733f97446d38a0.1920x1080.jpg?t=1613874990",
    "Slug": "",
    "Meta Title": "楚漢女子: Feb 8, 2021, 株式会社Viola and Full Overview",
    "Meta Description": "Looking for information on 楚漢女子? Check out the release date (Feb 8, 2021), developer insights from 株式会社Viola, and a complete game summary.",
    "Alt Text Image": "Official header image for 楚漢女子 game - Steam 1412970",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u695a\\u6f22\\u5973\\u5b50\", \"description\": \"Looking for information on \\u695a\\u6f22\\u5973\\u5b50? Check out the release date (Feb 8, 2021), developer insights from \\u682a\\u5f0f\\u4f1a\\u793eViola, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 8, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u682a\\u5f0f\\u4f1a\\u793eViola\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u682a\\u5f0f\\u4f1a\\u793eViola\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1412970/header.jpg?t=1613874990\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}