{
    "AppID": 994860,
    "Name": "Gunpowder on The Teeth: Arcade",
    "Release date": "Feb 22, 2019",
    "About the game": "A platform game with simple intuitive controls, handy-dandy retro graphics and utterly egregious difficulty, ever increasing as you progress through the game. You command a group of soldiers, charged with diverse equipment to attack the superior numbers of enemies, with the assistance of armored vehicles and air forces. Your mission is to locate and to destroy different targets, ant to evacuate military personnel at the end of the mission. There are 15 missions on 5 locations around the world, some bonus levels and battles against bosses. And then some... There's no such thing as a platform game without secrets... Key Features Megahardcore! In this game you will receive damage first, and only then you will locate the enemy. The implementation of military operations in the classic mechanics of platformer. 5 soldiers with different weapons, to perform various tasks, and the ability to open the legendary secret soldier. 15 missions on 5 locations in different parts of the world. Battles with bosses, each one has its own specialty. Bonus levels with driving of vehicles. More than 20 Steam achievements. Monochrome pixel graphics, stylized for classic platform games. Gameplay The mission's main goal is to detect and destroy enemy radar systems. The path runs through a complex landscape with a large accumulation of natural and artificial obstacles. Also you will face on your way outposts with men and material, backed by airpower. After the destruction of targets you need to evacuate personnel. The path to the landing zone also contains various traps and obstacles. Soldiers Each soldier has a personal weapon - assault rifle, as well as an alternative one, which differs depending on the class of the soldier. There is a more suitable option for each task: use a grenade to destroy infantry forces, rocket launcher to annihilate tanks or trucks, and if there are too many enemies - request air action. Vehicles Some levels allow you to use military vehicles. Tank, strike helicopter, fighter plane - feel the superiority over your enemy. But it doesn't mean that it will be easy. Bonuses Pick up crates with medicines and ammunition to heal the soldier and to refill ammo. Try to collect all dog tags to unlock the legendary soldier and to find many different secrets and easter eggs. Bosses There is a boss at the end of each location. And for each battle you need to choose your way of fighting. The bosses are enemy vehicles, ranging from multiple launch rocket systems and tanks to air cushion landing ships. No one fights alone, be ready to face artillery protection, foot troops cover and who knows what else.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/994860/header.jpg?t=1580289225",
    "Price": 2.99,
    "Developers": "Gunpowder Team",
    "Publishers": "Gunpowder Team",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/994860/ss_bb9a3ee6f9576c7af18ffc1d00585e2fcbba2b0d.1920x1080.jpg?t=1580289225,https://cdn.akamai.steamstatic.com/steam/apps/994860/ss_d3f7b274b0cbabd5eaab16c20679ee9a43d2601a.1920x1080.jpg?t=1580289225,https://cdn.akamai.steamstatic.com/steam/apps/994860/ss_42af4fa0473b84ccf56f50e2328b1c32db60bf9d.1920x1080.jpg?t=1580289225,https://cdn.akamai.steamstatic.com/steam/apps/994860/ss_510f909e57fee073227dc3b4c2186930a3eb8385.1920x1080.jpg?t=1580289225,https://cdn.akamai.steamstatic.com/steam/apps/994860/ss_ed640d5b264b2d36463296c09dc693535f9eadfa.1920x1080.jpg?t=1580289225,https://cdn.akamai.steamstatic.com/steam/apps/994860/ss_36bb7cd58b750e7beee0abf01f8b5da871cdeb04.1920x1080.jpg?t=1580289225,https://cdn.akamai.steamstatic.com/steam/apps/994860/ss_4f852ad2211b48cb2ea5e18ec0b22da377409d92.1920x1080.jpg?t=1580289225",
    "Slug": "gunpowder-on-the-teeth-arcade",
    "Meta Title": "Gunpowder on The Teeth: Arcade: Feb 22, 2019, Gunpowder T...",
    "Meta Description": "Looking for information on Gunpowder on The Teeth: Arcade? Check out the release date (Feb 22, 2019), developer insights from Gunpowder Team, and a comp...",
    "Alt Text Image": "Official header image for Gunpowder on The Teeth: Arcade game - Steam 994860",
    "Canonical URL": "https://gusku.site/game/gunpowder-on-the-teeth-arcade",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gunpowder on The Teeth: Arcade\", \"description\": \"Looking for information on Gunpowder on The Teeth: Arcade? Check out the release date (Feb 22, 2019), developer insights from Gunpowder Team, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gunpowder Team\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gunpowder Team\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/994860/header.jpg?t=1580289225\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}