{
    "AppID": 1698910,
    "Name": "Hardcore Trivia",
    "Release date": "Jun 14, 2022",
    "About the game": "80 questions, 8 themes! PLAY ON SOLO MODE OR WITH FRIENDS Play solo mode or invite friends to play! You can also arrange event for your friends and you can compete together. Each question have 4 options, which only one is correct... Choose the correct one and you will be rewarded with a points! (Steam Achievement coming on later updates). Learn while playing! GAME GETTING BIGGER Current state of the game includes 70 questions and 7 themes. Each theme have 10 questions and 4 options. Game currently include these challenging quizzes: Caribbean countries and territories Flag Quiz (10 questions) All-Stars Ice-Hockey Quiz (10 questions) Solar System Trivia (10 questions) The Roman Empire Trivia (10 questions) European countries and territories Quiz (10 questions) Learn C++ Coding Trivia Part 1 (10 questions) The 50 U.S. state Flags Trivia (10 questions) General Knowledge Quiz (10 questions) EVERYONE CAN PLAY Game is perfect for all ages. EXCELLENT ALSO FOR SCHOOL, CLUBS, SOCIETIES AND BARS [Features below available in Commercial Licence only. Features are in preparation and release time will be 1-4 weeks. Note! Current version of Commercial Licence is same as customers licence with a points calculation system. Support our development and buy Commercial Licence now!] Are you running a hobby club, history club, bar, pub or a Steam Cafe? Hardcore trivia offers questions for many needs. With a Commercial licence, you can arrange a new event easily for example in your bar and provide entertainment to the customers. Hardcore Trivia includes ready to print questionnaire forms (yes, something is still keeping non-digital) which you can give to customers before the game stars, and your host can use easy interface to run the event. Read more about PC Café-program If you run a bar, you probably spend a lot of time thinking about how to get more people into it. But this can be tough to do every night of the week. That’s why you may want to look into hosting a Hardcore Trivia night. Trivia nights can be a great way to help you get more people into your bar so that you can boost your sales. And if you’re interested in hosting one, you’ve come to the right place. We are currently preparing marketing materials and another important stuff, what you need to run your trivia night. Hardcore Trivia easy access interface is fast to learn and easy to use. Why run a Hardcore Trivia night? With a trivia, you can turn a slow night into a busy one. Most bars are nowadays busier on the weekends and slower during the week. But if you host trivia on a weeknight, you could turn a weekday into one of your busiest times. Ongoing trivia events are also an excellent way to earn your customer’s loyalty. Host a good event and people will want to keep coming back to it. And soon enough, people will know your place as the great bar with the fun trivia night. Providing these types of experiences to your customers can help to make sure they keep coming back. Similarly, adding a trivia night to your bar’s weekly calendar can help you build a stronger community. These events tend to create a fun, lively atmosphere that gets people talking. And when that happens, your guests will invite their friends, creating a stronger community. Big investments to run Trivia night? No. Once you’ve decided to host a trivia night, the first thing to do is find pen and paper and print Hardcore Trivia ready-made questionnaires (coming soon). We are also preparing marketing material. Then you need to buy Hardcore Trivia Commercial Licence, which you can find (upcoming) from Steam with a reasonable price. Pen and paper -format is pretty ideal for clubs and bars, because customers tend to want to keep some break, and break will be offered when you collect papers from customers after 10 questions have been runned and calculate the points (and same time of course sell some refreshing drinks :D Hardcore Trivia Commercial Licence concept have been tested in real restaurant environments. Tips running the game in Schools, Clubs, Bars, Restaurants and other societies: 1. Buy the Commercial Licence (available soon, separate purchase button in Steam labelled Commercial Licence). Prepare everything ready for the audience: 1. Print questionnaire forms and give pencil and forms to customer/members 2. Introduce the game to the host. After your host has get familiar with the game easy interface, host is ready to start the game and pick audience desired category. 3. When game ends, you collect questionnaires from the customers and calculate the points (you can see the correct answers by downloading form named Correct answers. 4. We have a winner! Time for lottery? Note that non-commercial licence have automated points calculation system, which is not usually suitable for events arranged to large audience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1698910/header.jpg?t=1655463988",
    "Price": 1.07,
    "Developers": "F-Games",
    "Publishers": "JTS Development",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_851fed21c337943ad94b4ca61b9f8d677892631c.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_3b1d55e620ec005c4cbda862988c8c2ceb9898f5.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_28420f2b3fc312be55126ce94d6770d01e95c8bf.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_148f89e26b496563d8dbec75097f5a55c1bfac07.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_bcd6e41887ea8e04f27e77e20fd8e292ea1fab79.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_fbd568d69ad52b8f37641d726640728054563509.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_1256c7800299dcd8e70e1184096ba3131a72c295.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_eaf01b4366d06afc9e288ab05b5a380ad9f66675.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_47c4479770308bf61e25638358f1bb8f2158d526.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_5aaa15ca8c9c1cf339a7c938dbcb1a314c90a0cc.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_5edcb20450a1fe78647aa7c31fa77cb0b9d3c573.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_c22c2c7dd146e745d0b3b85b7118f0e097a405ca.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_735895f901b66e14ac6a9590b4db633283f55569.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_e421fe7c207e4016faec9b02851851cf576f41ae.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_a30bf82827ea59771def78f1ba70063e45f08a4c.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_d12678691819b9c5f96d152d923cb4f2e19f623b.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_cf85ed77043911b2b0b27fd361b286182d9e7d04.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_7f2e563d2a6e9277a51b71a5f65f2b9275f6fb87.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_1414edfa5a7c641ac71d7c5ea2a19803451f01cb.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_b930c396c391ea0125cda66f4cf9b46b7c76f4b6.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_74a08d043b547b23a83d97293aafda332dbedb24.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_eabb1a04d81cc2a6f3469d98937d065c3825a510.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_1b9c9d37d21e2e86f123a6be03df2ce79953ecbe.1920x1080.jpg?t=1655463988,https://cdn.akamai.steamstatic.com/steam/apps/1698910/ss_f628fa6e71a42fffd735109bb1a489aa71353de7.1920x1080.jpg?t=1655463988",
    "Slug": "hardcore-trivia",
    "Meta Title": "Hardcore Trivia: Jun 14, 2022, F-Games and Full Overview",
    "Meta Description": "Looking for information on Hardcore Trivia? Check out the release date (Jun 14, 2022), developer insights from F-Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Hardcore Trivia game - Steam 1698910",
    "Canonical URL": "https://gusku.site/game/hardcore-trivia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hardcore Trivia\", \"description\": \"Looking for information on Hardcore Trivia? Check out the release date (Jun 14, 2022), developer insights from F-Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"F-Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JTS Development\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1698910/header.jpg?t=1655463988\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.07, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}