{
    "AppID": 521090,
    "Name": "Industry Giant",
    "Release date": "Oct 2, 2018",
    "About the game": "When Industrial Giant was originally released in 1997 the world was in financial chaos and shocking events that would ripple down through history, the world of chess was shocked, and some would say this was the end of the game. Deep Blue chess-playing computer defeated chess champion Garry Kasparov, Stock markets around the world crashed because of a global economic crisis scare and Microsoft becomes the world’s most valuable company valued at $261 billion dollars. So, it would seem when this game was launched onto the gaming market the world was in a financial flux and the markets were in chaos, but could you do a better job? In Industrial Giant you have to find a route to profit to prove your management skills in this resource management business simulation. Experience the soaring heights and the shattering depths of being an industrial giant! A factory, a store and some lorries – a simple beginning can be the start of an illustrious career! Build all types of factories, buy your raw materials at a bargain and manufacture the products that will bring you fame and fortune. All you need now is the right advertising strategy – and watch the tills in your newly opened stores fill up. See what you can do in the toy and sports goods industry. Earn your money from jewelry and furniture. And be prepared for the challenges of the computer age. The automobile and electronics industries will make demands on your organizational skills. What is the competition up to? Are they starting to become a nuisance? Then by them out! If you have enough money, that’s it. Or make your companies running more successful than others! So no one will be able to stop you on your path to success… Industry Giant stands for simple and comfortable commands combined with a high degree of complexity – yet easy to understand. Features: Economic strategy simulation in real time Infinite number of game worlds All kinds of Industries and over 30 products Up to three intelligent computer opponents Lots of exciting careers and single missions",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/521090/header.jpg?t=1641983616",
    "Price": 2.99,
    "Developers": "QLOC",
    "Publishers": "Toplitz Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/521090/ss_cc5fa6562074fa54354d308ec28725a3799114aa.1920x1080.jpg?t=1641983616,https://cdn.akamai.steamstatic.com/steam/apps/521090/ss_434a9cc853b530f5d663a6f0a3a59a8d6e6aac7b.1920x1080.jpg?t=1641983616,https://cdn.akamai.steamstatic.com/steam/apps/521090/ss_cc0a5ce89c2cef2e4cdc09d2b063c9ab18645db2.1920x1080.jpg?t=1641983616,https://cdn.akamai.steamstatic.com/steam/apps/521090/ss_b83ff932487a9a73b0657a6083e9a42db6467494.1920x1080.jpg?t=1641983616,https://cdn.akamai.steamstatic.com/steam/apps/521090/ss_4c17303b8e5a4b8c402162832c4fbe107d53cbf5.1920x1080.jpg?t=1641983616",
    "Slug": "industry-giant",
    "Meta Title": "Industry Giant: Oct 2, 2018, QLOC and Full Overview",
    "Meta Description": "Looking for information on Industry Giant? Check out the release date (Oct 2, 2018), developer insights from QLOC, and a complete game summary.",
    "Alt Text Image": "Official header image for Industry Giant game - Steam 521090",
    "Canonical URL": "https://gusku.site/game/industry-giant",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Industry Giant\", \"description\": \"Looking for information on Industry Giant? Check out the release date (Oct 2, 2018), developer insights from QLOC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 2, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"QLOC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Toplitz Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/521090/header.jpg?t=1641983616\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}