{
    "AppID": 1676380,
    "Name": "Kingdom of Atham: Crown of the Champions",
    "Release date": "Jan 7, 2022",
    "About the game": "--- --- KoA CotC short for 'Kingdom of Atham: Crown of the Champions' is a RPG Fantasy Survival Game! In the 'KoA CotC' world you start your journey as a Champion; a divine mortal, sculpted by the great Elder, to quell the corruption that has enveloped the land and its inhabitants. Different champions, also sculpted by the elder, have the same goal. Be aware, some might be friendly, some might be foes, you all have the same goal but even the strongest Champions can succumb to the darkness. An array of combat options will be available to your champion from melee, ranged and magic. Choose your 'Faction' with care! Factions reside in specific villages around the CotC world and belong to different 'realms'. Be warned champion! Your actions in these realms will follow you and might effect your destiny. Your aspiration, since arriving in this world, was to cleanse the darkness and vanquish those responsible for it....the Fallen. These divine guardians, once beloved and cherished by all of Atham, unearthed the Crown of the Champion; an ancient divine artifact that balances the light and the darkness in all living things. --- --- The conflict between the guardians originated over control of the crown and lead to a split in their ranks. One that wanted to preserve Atham as is; the other that wanted to dominate it. As the battle between the adversaries raged it enveloped the known world. Giant shadows were observed on the horizon, the echoed sounds of shattered mountains reverberated through the realms and violent tremors reduced civilizations to rubble. The final engagement between the two factions lead to the shattering of the crown and the apocalyptic release of energy that reforged the Guardians into calous power mongers. Blinded to their original belief of maintaining balance amongst all things they transformed into tyrannical desbots. Their malice, brutality, and oppression altered the very nature of Atham. The moment the Crown shattered every creature experienced and was changed by it. This was followed by 5 mysterious objects that fell from the heavens and impacted the world with such force that it created fissures across the realms. Following the 'Sundering' despair invaded the hearts and minds of the people as an unnatural propagation of twisted creatures ravaged the lands searching for those remnants of the Crown. Inevitably this lead to a new conflict, the Divine War, and it has raged on for almost 400 years. Your goal, Champion is to find the remnants of the Crown and restore balance to Atham. Build your fortress, find allies and save the realms. Crafting and fighting your way to honor and glory. The Darkness is your worst enemy; the Light ... a lost friend. --- --- We plan to add these features in the full release many are already existing in game. -Building (make a small house, village or town). -Complex Crafting (farming and fishing included). -Towns with merchants and guards (Faction based). -Party &amp; Guild system. -Impressive enemies of all kinds. -Special companion to follow you around the world. -Combat: melee, ranged, magical and underwater combat scenarios. -Reputation aspect where your choice will impact your game play. -Dedicated servers for rent to make your own rules and world. -Three different races with bonuses to specific classes. --- ---",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1676380/header.jpg?t=1657729804",
    "Price": 19.99,
    "Developers": "Sofa Mauve Studio Inc.",
    "Publishers": "Sofa Mauve Studio Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1676380/ss_ab3e1b6fb852c9b373fe6ac28233e56b5faa4d32.1920x1080.jpg?t=1657729804,https://cdn.akamai.steamstatic.com/steam/apps/1676380/ss_581e65c320f8672dc4e079583883974ee3a2fa2b.1920x1080.jpg?t=1657729804,https://cdn.akamai.steamstatic.com/steam/apps/1676380/ss_92be0ca1a185a0842bfe911b37d793bd84928241.1920x1080.jpg?t=1657729804,https://cdn.akamai.steamstatic.com/steam/apps/1676380/ss_d4ec9e7967fb3023b104d99e61c4b322b5cdb5f8.1920x1080.jpg?t=1657729804,https://cdn.akamai.steamstatic.com/steam/apps/1676380/ss_e556ea5e4549fe3e2b8836c029cf9dbd169af3a7.1920x1080.jpg?t=1657729804,https://cdn.akamai.steamstatic.com/steam/apps/1676380/ss_01abd6e4b11690bafd40067f1fceb92e4c2dde11.1920x1080.jpg?t=1657729804,https://cdn.akamai.steamstatic.com/steam/apps/1676380/ss_e809558b310f1acd418529530612d4cd79785356.1920x1080.jpg?t=1657729804,https://cdn.akamai.steamstatic.com/steam/apps/1676380/ss_daa740d5754674b56c57e1fcdcd46d6bd808f309.1920x1080.jpg?t=1657729804,https://cdn.akamai.steamstatic.com/steam/apps/1676380/ss_8a07e86907fc0287b0421ea1098eb957b87f0051.1920x1080.jpg?t=1657729804,https://cdn.akamai.steamstatic.com/steam/apps/1676380/ss_6524d2535d888f02e6dd742e76384152b4df8d96.1920x1080.jpg?t=1657729804",
    "Slug": "kingdom-of-atham-crown-of-the-champions",
    "Meta Title": "Kingdom of Atham: Crown of the Champions: Jan 7, 2022, So...",
    "Meta Description": "Looking for information on Kingdom of Atham: Crown of the Champions? Check out the release date (Jan 7, 2022), developer insights from Sofa Mauve Studio...",
    "Alt Text Image": "Official header image for Kingdom of Atham: Crown of the Champions game - Steam 1676380",
    "Canonical URL": "https://gusku.site/game/kingdom-of-atham-crown-of-the-champions",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kingdom of Atham: Crown of the Champions\", \"description\": \"Looking for information on Kingdom of Atham: Crown of the Champions? Check out the release date (Jan 7, 2022), developer insights from Sofa Mauve Studio...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sofa Mauve Studio Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sofa Mauve Studio Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1676380/header.jpg?t=1657729804\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}