{
    "AppID": 534660,
    "Name": "Lux umbra",
    "Release date": "Sep 17, 2017",
    "About the game": "In 'Lux Umbra' they explore a confused world. They do not know why you here are what all that has to mean and how they come here out. They are able to do themselves only ventures they gain an accident had and now strongly have headaches. But so properly also do not know it. In 'Lux Umbra' it concerns a fuller simulator mixed with other subjects like horror, adventure and a lot more. dip, into a secret full world. What she expects! Explore an open play world. freely passably. And if they find confidential places and the documents them read everywhere can find. By they touch hand-made level. Anyone and incredibly. A confusing world. Without beginning without end. Is it real or just a dream? Find it out. Through LIVE, they explore the OPENWORLD of LUX and discover places and tapes. Do not trust anyone who does not trust you! Gameplay explore an open Freely passable play world. If they explore ruins amazing ones locates. However, they watch out for the monsters. If they find new ones it points out in the play world earth corners recordings and complete the history. Discover great worlds. With different biomes and creatures. Lux umbra mixed discovery with horrer elements. Story Do they find out what passed where you are like do they get away here again? If they collect the PADs and receive thus access to the recollections of your play figure. Every level contains new info to your past. Discover this or enjoy them only the world. No limits are set to you. Do you know that. You wake up and can not remember anything? Just in a car accident! And now are in a different world. Is that real or just a dream? Atmosphere A depressing dark atmosphere primes with music it does not let go any more. By they touch sombre woods, mysterious towns, ruins and marshes. If they discover the backgrounds of your play figure. Pressureous music playing in the background. Darkness mixed with red. Evil noise from afar? Lux UMbrea combines exploration gameplay with horror. Maps All the cards they will experience are completely hand made. No random maps. All maps were created by the developer and are different every time.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/534660/header.jpg?t=1571563046",
    "Price": 4.99,
    "Developers": "UndeadTurtle",
    "Publishers": "UndeadTurtle",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/534660/ss_16497a2befd13c3800015997d02727e1bfb264f6.1920x1080.jpg?t=1571563046,https://cdn.akamai.steamstatic.com/steam/apps/534660/ss_328661af4939fbc9170fc812c4e62a1518d445c1.1920x1080.jpg?t=1571563046,https://cdn.akamai.steamstatic.com/steam/apps/534660/ss_e5e4076696e5b3008a2e7e63ed3bb3bcbd5c9b19.1920x1080.jpg?t=1571563046,https://cdn.akamai.steamstatic.com/steam/apps/534660/ss_34a190109e2154c2601e6cbc5006d47b440918e4.1920x1080.jpg?t=1571563046,https://cdn.akamai.steamstatic.com/steam/apps/534660/ss_b39ccf33acf96bee10037aa7c5b2a78185a45fae.1920x1080.jpg?t=1571563046,https://cdn.akamai.steamstatic.com/steam/apps/534660/ss_63864ad04ea72cb76fad521ff341d38281906d3a.1920x1080.jpg?t=1571563046,https://cdn.akamai.steamstatic.com/steam/apps/534660/ss_53a2eb16a4f44b36c3f6e642d0c6abe6a20ed2d7.1920x1080.jpg?t=1571563046",
    "Slug": "lux-umbra",
    "Meta Title": "Lux umbra: Sep 17, 2017, UndeadTurtle and Full Overview",
    "Meta Description": "Looking for information on Lux umbra? Check out the release date (Sep 17, 2017), developer insights from UndeadTurtle, and a complete game summary.",
    "Alt Text Image": "Official header image for Lux umbra game - Steam 534660",
    "Canonical URL": "https://gusku.site/game/lux-umbra",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lux umbra\", \"description\": \"Looking for information on Lux umbra? Check out the release date (Sep 17, 2017), developer insights from UndeadTurtle, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 17, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"UndeadTurtle\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"UndeadTurtle\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/534660/header.jpg?t=1571563046\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}