{
    "AppID": 1729730,
    "Name": "MageRun",
    "Release date": "Nov 26, 2021",
    "About the game": "What is MageRun? MageRun is a fast paced action game. You have to stand still so that you can cast a spell but at the same time move to avoid enemy shots. Collect new spells and upgrades. Reskill your character for the respective situation and throw yourself back into battle. No story, just fun gameplay. Grwoing Project This project is subject to constant free content updates. With the updates come new modes, weapons, monsters, spells, equipment, levels and bosses. The community wishes are taken into account and i will do my best to implement them into the game What's next World 5 with some innovations. In addition to new spells, opponents and wands, elite opponents and the gem system are also being added. The gems will change the way you play MageRun. The mysterious gates open depending on which gem you currently have equipped. What happened until now In addition to Content Update 1, which is world 4 that is small but difficult, the challenge system also came into play. World 4 is the only world that only consists of these challenges. In future worlds, these challenges will always play a role within the worlds. The wand system lets you equip a wand that not only has a new auto attack, but also comes with 6 stats so players can customize their mage to their personal playstyle. After observing, I've found that support spells are rarely used. That's why patch 2.33 came with a new support system that now supports the player passively. At the start of a fight you have a certain chance that the selected support spell will ignite. With patch 2.66 the map was added, this should improve the navigation in a level. It shows what can be found where and how many things have already been found in total. You can also use the map to teleport back and forth in the respective level. Of course, BUGS were always fixed and if I find any or the players report them, I try to fix them as soon as possible. Features Fast arcade gameplay without a big grind Currently over 20 spells Currently over 10 different types of opponents Project is provided with free content updates No story, just fun gameplay The community wishes are taken into account and i will do my best to implement them into the game",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1729730/header.jpg?t=1647594333",
    "Price": 4.99,
    "Developers": "AroGames",
    "Publishers": "AroGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1729730/ss_b6ff34e2259e10eb7be7a9ef8690c5613d2ee658.1920x1080.jpg?t=1647594333,https://cdn.akamai.steamstatic.com/steam/apps/1729730/ss_d921544ba681dd9d44f3871f63d13b225589a357.1920x1080.jpg?t=1647594333,https://cdn.akamai.steamstatic.com/steam/apps/1729730/ss_b083be944a749e16cf865e88e5380cfbc6b8df65.1920x1080.jpg?t=1647594333,https://cdn.akamai.steamstatic.com/steam/apps/1729730/ss_43660f73fc03ed63c9de5a6393d82a6a27a1c274.1920x1080.jpg?t=1647594333,https://cdn.akamai.steamstatic.com/steam/apps/1729730/ss_639f2c34d01c36901d6f581b20e08e4ede098651.1920x1080.jpg?t=1647594333,https://cdn.akamai.steamstatic.com/steam/apps/1729730/ss_77606aa73911fb4222fb98cd2f0c66ff08032b61.1920x1080.jpg?t=1647594333,https://cdn.akamai.steamstatic.com/steam/apps/1729730/ss_e7fd51bc11e2255d4c45d1f37bedc3b9588d0a5a.1920x1080.jpg?t=1647594333",
    "Slug": "magerun",
    "Meta Title": "MageRun: Nov 26, 2021, AroGames and Full Overview",
    "Meta Description": "Looking for information on MageRun? Check out the release date (Nov 26, 2021), developer insights from AroGames, and a complete game summary.",
    "Alt Text Image": "Official header image for MageRun game - Steam 1729730",
    "Canonical URL": "https://gusku.site/game/magerun",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MageRun\", \"description\": \"Looking for information on MageRun? Check out the release date (Nov 26, 2021), developer insights from AroGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 26, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"AroGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AroGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1729730/header.jpg?t=1647594333\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}