{
    "AppID": 320400,
    "Name": "Magnifico",
    "Release date": "Dec 2, 2014",
    "About the game": "Magnifico is a popular region-based board game where the ultimate goal is to dominate 16th century Europe. Now you can play it on PC! Players are faced with tough economic and military decisions as they earn Victory Points and attempt to outbid opponents at the auction and get their hands on Leonardo Da Vinci's most powerful war machines. Play hard or play clever, Europe’s dominance is just one Victory Point away. Players are faced with tough economic and military decisions as they earn Victory Points and attempt to outbid opponents at the auction and get their hands on Leonardo Da Vinci’s most powerful war machines. Every Victory Point has to be earned by careful placement of your troops, construction of fortifications, and invasion of bordering regions. Each new turn brings a chance to acquire Da Vinci’s precious projects and get the upper hand over your opponents. The only strategy game with Da Vinci’s inventions and works of art! Build Castles, Tanks, Aircraft and much more! Bid at the auction for Da Vinci’s inventions. Upgrade your infantry, tanks and aircraft with new technologies to increase reliability and combat power. Earn Victory points for most castles, territories, technologies, being Magnifico and other special actions. Fight battles with wondrous technologies but be careful as tanks can explode! Cannons, flying machines, bombards, tanks and many more inventions will be available as options at the auction table, but only with a perfect balance of risk and caution will players make the most of them. Main Features: The only strategy game with Da Vinci’s inventions and works of art! Build Castles, Tanks, Aircraft and much more! Many special weapons including the Great Cannon, Submarines, Armoured Ships, Paratroopers and more! 16th century Europe on a region based map Single player mode against up to 3 AI players, selected from 10 AI characters with their own play styles In depth in-game tutorial and detailed manual Available in English, French, Spanish, Italian, German, Russian and Chinese! Based on the popular board game “Da Vinci’s Art of War - Magnifico” created by Spartaco Alberatrelli",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/320400/header.jpg?t=1575553471",
    "Price": 4.99,
    "Developers": "Mixel",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/320400/ss_ee3e5b9e97303f39343d47beaf40016924fdc41d.1920x1080.jpg?t=1575553471,https://cdn.akamai.steamstatic.com/steam/apps/320400/ss_791659019064278c6366a07dbe99f50c40b93242.1920x1080.jpg?t=1575553471,https://cdn.akamai.steamstatic.com/steam/apps/320400/ss_f13c40d563382130f148d65c1e2ea327a5049f40.1920x1080.jpg?t=1575553471,https://cdn.akamai.steamstatic.com/steam/apps/320400/ss_21d32a45ede99077203dcb5d33b2d27510619b78.1920x1080.jpg?t=1575553471,https://cdn.akamai.steamstatic.com/steam/apps/320400/ss_2aaa0179923ef75af57b4ace39dc9286abc2528f.1920x1080.jpg?t=1575553471,https://cdn.akamai.steamstatic.com/steam/apps/320400/ss_6252f56c577d535d67128362958c4cda3b8be575.1920x1080.jpg?t=1575553471",
    "Slug": "magnifico",
    "Meta Title": "Magnifico: Dec 2, 2014, Mixel and Full Overview",
    "Meta Description": "Looking for information on Magnifico? Check out the release date (Dec 2, 2014), developer insights from Mixel, and a complete game summary.",
    "Alt Text Image": "Official header image for Magnifico game - Steam 320400",
    "Canonical URL": "https://gusku.site/game/magnifico",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Magnifico\", \"description\": \"Looking for information on Magnifico? Check out the release date (Dec 2, 2014), developer insights from Mixel, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 2, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mixel\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/320400/header.jpg?t=1575553471\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}