{
    "AppID": 1070410,
    "Name": "Nevrosa: Primal Ritual",
    "Release date": "Nov 22, 2019",
    "About the game": "Gameplay World Exploration. Travel across vast lands covered with layers of mist, meet unbelievable plant-animal hybrids, that have been ruling this place for centuries, discover gorgeous ruins of vanished civilization and watch breathtaking scenes around you. Story full of Mysteries. Story driven adventure as fearless scientist William Conway who finds an unexpected ally in a face of mystic Cursed Cube which possesses great powers. Dangerous Adventure. Main resource to control everything — your own blood. Save precious drops for upgrades or load them as ammo into your faithful Vampire Gun. Realistic Graphics. Building Primal Ritual exclusively for VR, we worked carefully to improve unique Nevrosa style in all the things around you. Classic horror movies and books like The Mist, The Thing, Hellraiser and even Avatar inspired the design of creatures and atmosphere. Voice acting and Soundtrack. New unforgettable themes from talented composer and musician Zakhar Antonov will create a true cinematographic experience. Music reacts according to the game situation. Find out more good music tracks on the records in the Camp to get into the right mood. Features Story driven action adventure with RPG elements in unique location built exclusively for VR. Vast open world with different biomes: forests, swamps, planes and even… flying island! An Old Camp as a safe place where you can spend some time and have fun without killing monsters. Feed mysterious Cube artefact with blood and unlock its powers. Get stronger, learn more and progress through the world to find your way back home. Customizable locomotion (Free or Teleport) for better immersion. Great sound and music work done to immerse you deeper into the Misty World. Story Second half of XX century. After months of successful researches and expeditions, William Conway is ready to share with the scientific world not only the fascinating Teleportation technology he discovered, but also a completely new world this invention leads to. With his loyal companions, William prepared a safe area amid the vast alien lands. Now he needed to check everything one last time, and write a good speech. This place may not be perfect: everything creaks, sparkles, and there’s no hot water, but how could such a thing stop a true pioneer? This new world keeps its secrets under layers of different mist, full of unknown creatures and mysteries to solve. Giving a last look from observation deck, Conway could not expect what a journey lies ahead. Once shared his blood with this world, William starts an ancient ritual. Your blood has power here, but Blood Magic always attracts creatures even more dangerous than local monsters — you have to finish what you started until it is too late, there is no other way... Is it?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1070410/header.jpg?t=1628880628",
    "Price": 19.99,
    "Developers": "GexagonVR",
    "Publishers": "GexagonVR",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1070410/ss_267b1544f0787753857c7b04591057f36d56ec26.1920x1080.jpg?t=1628880628,https://cdn.akamai.steamstatic.com/steam/apps/1070410/ss_7ced8fc2529b8fa296866f110e2b69f9366d7648.1920x1080.jpg?t=1628880628,https://cdn.akamai.steamstatic.com/steam/apps/1070410/ss_ad3e32f343f3068fde3909daa9baaaecf9d0e417.1920x1080.jpg?t=1628880628,https://cdn.akamai.steamstatic.com/steam/apps/1070410/ss_fb7839a985058636e9fc51f0f66a3f96d6e4943f.1920x1080.jpg?t=1628880628,https://cdn.akamai.steamstatic.com/steam/apps/1070410/ss_64b48d2f10ef79176b386c1c600f9befa3961168.1920x1080.jpg?t=1628880628,https://cdn.akamai.steamstatic.com/steam/apps/1070410/ss_b840df0dcc781fc9e04d60f712e42eeb2d6545b8.1920x1080.jpg?t=1628880628,https://cdn.akamai.steamstatic.com/steam/apps/1070410/ss_a9b564499726dcfd0670e05711bed9811100d86e.1920x1080.jpg?t=1628880628,https://cdn.akamai.steamstatic.com/steam/apps/1070410/ss_0c73f408bc8e8cc70326ea7f624f3181d8fed09b.1920x1080.jpg?t=1628880628",
    "Slug": "nevrosa-primal-ritual",
    "Meta Title": "Nevrosa: Primal Ritual: Nov 22, 2019, GexagonVR and Full ...",
    "Meta Description": "Looking for information on Nevrosa: Primal Ritual? Check out the release date (Nov 22, 2019), developer insights from GexagonVR, and a complete game sum...",
    "Alt Text Image": "Official header image for Nevrosa: Primal Ritual game - Steam 1070410",
    "Canonical URL": "https://gusku.site/game/nevrosa-primal-ritual",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nevrosa: Primal Ritual\", \"description\": \"Looking for information on Nevrosa: Primal Ritual? Check out the release date (Nov 22, 2019), developer insights from GexagonVR, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 22, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"GexagonVR\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GexagonVR\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1070410/header.jpg?t=1628880628\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}