{
    "AppID": 773810,
    "Name": "NOSTOI",
    "Release date": "Sep 28, 2018",
    "About the game": "NOSTOI is a narrative 3D puzzle and platformer game with a gameplay mechanics based on the physics and time manipulation. The game is about a boy who tries to escape his psychological trauma. It is a calm, but challenging single player title which requires focusing and careful analysis of the environment in order to succeed. The story has quite a few analogies to cognitive and psychological phenomena, such as “false memory”. If you miss the old indie classics that charmed the player with a unique art style, gameplay and plot, than NOSTOI is the title you should be interested in. KEY FEATURES • Narrative, platformer-puzzle game • Cel-shading and chibi art style • Puzzles based on the physics and time manipulation • Plot with references to the psychology and pop culture • Calm, but challenging gameplay GAMEPLAY Every level in the game has a puzzle the player has to solve in order to proceed. The challenges are of various types – reconstruct destroyed stairs, sneak unnoticed, return blocks to their original place. And almost every land has one thing in common – Time Obelisks. Time Obelisks allow to revert some objects in time and return them to their default position. So, you have to get the access to Time Obelisks or activate them in a particular way. When all the obelisks in the level are activated and the puzzle is solved, the gate to another land is accessible. However, figuring out how to get to the Time Obelisks is not always a piece of cake. Every land has custom physics areas, so the player has to carefully look around the level and figure out which combination will succeed. To make your task a little bit easier, there are allies in every land which will tell you some story and hints. STORY An anonymous boy is stuck in a limbo - which was caused by his psychological problems – and tries to escape it. The limbo is full of curious lands with unusual physical phenomena, which have to be understood and defeated. However, the boy is not completely alone. In every land, his subconsciousness creates an ally, a tiny monster called Regrepsa. Regrepsa can tell him something about the current land, the overall situation and give a clue how to escape it – and everything will be told in a quite mysterious way. After all, it is up to our protagonist if he can solve the puzzle or not.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/773810/header.jpg?t=1572398614",
    "Price": 1.99,
    "Developers": "Aasura Project",
    "Publishers": "Aasura Project",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/773810/ss_416a522a5493126c7f123bfe938b7b223cca1b0c.1920x1080.jpg?t=1572398614,https://cdn.akamai.steamstatic.com/steam/apps/773810/ss_5ff9ee96b004f2d931bca2900d92c645f585dbb2.1920x1080.jpg?t=1572398614,https://cdn.akamai.steamstatic.com/steam/apps/773810/ss_d26006de0b4f37f646ec7ed04bcdab88c5ba6c69.1920x1080.jpg?t=1572398614,https://cdn.akamai.steamstatic.com/steam/apps/773810/ss_2da6dfee535ad941e25d709b2fb479df7e7aeeec.1920x1080.jpg?t=1572398614,https://cdn.akamai.steamstatic.com/steam/apps/773810/ss_353e7d632561cc533a5a0207ae73436f6b598f10.1920x1080.jpg?t=1572398614,https://cdn.akamai.steamstatic.com/steam/apps/773810/ss_cd5af867c92455ef74549741399d7b87daffb4d4.1920x1080.jpg?t=1572398614,https://cdn.akamai.steamstatic.com/steam/apps/773810/ss_03bbd8c407ea624211e5cf70a544f7469efcc8ba.1920x1080.jpg?t=1572398614",
    "Slug": "nostoi",
    "Meta Title": "NOSTOI: Sep 28, 2018, Aasura Project and Full Overview",
    "Meta Description": "Looking for information on NOSTOI? Check out the release date (Sep 28, 2018), developer insights from Aasura Project, and a complete game summary.",
    "Alt Text Image": "Official header image for NOSTOI game - Steam 773810",
    "Canonical URL": "https://gusku.site/game/nostoi",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NOSTOI\", \"description\": \"Looking for information on NOSTOI? Check out the release date (Sep 28, 2018), developer insights from Aasura Project, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 28, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aasura Project\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aasura Project\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/773810/header.jpg?t=1572398614\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}