{
    "AppID": 770100,
    "Name": "One Deck Dungeon",
    "Release date": "May 18, 2018",
    "About the game": "Adventure calls... but you don't always have time to spend hours optimizing your character sheet or managing your inventory! One Deck Dungeon lets you jump right in to bashing down doors, rolling dice, and squashing baddies with style. Get a full roguelike game experience, boiled down to its essence, and captured in a single deck of cards and a handful of dice! One Deck Dungeon is a dungeon crawling adventure game for one or two players. Each time you play, choose one or two of these 6 brave heroes: Mage - There's rarely a problem in the dungeon she can't solve with a spell. Warrior - Her favorite dungeon activity is squashing her opponents immediately. Rogue - Watch in awe as she dispatches monsters with style. Archer - Accurate, brilliant, catastrophically deadly. Paladin - She seeks out danger and shields her allies from deadly enemies. Mist - This breach mage has crossed over from the world of Aeon's End to help defend Mynerva. After every game, your heroes make progress toward unlocking up to 15 new talents, building up their power for future games. There are 5 dangerous challenges to face: Dragon’s Cave - The thick-skinned wyvern who occupies this dungeon prefers her heroes on the crispy side. Yeti’s Cavern - If you can survive the freezing winds and biting cold, an abominable snowman awaits. Hydra’s Reef - Chop off one head, and another appears! This regenerating venomous monstrosity is a slippery foe. Lich’s Tomb - Hordes of undead foes, evil curses, and magical wards. What could possibly go wrong? Minotaur’s Maze - Abandon all hope, ye who enter here! One Deck Dungeon is fully playable with gamepad controllers. We officially support Xbox, PlayStation, and Switch Pro gamepads, but most gamepads should work. The game switches seamlessly between gamepad and mouse depending on what you use. The Forest of Shadows expansion doubles the content in the game and is available as downloadable content via Steam. It features adventures in all-new lush yet deadly locales. A vast network of mossy underground tunnels and connected forest areas await your heroes! 5 new heroes - Alchemist, Druid, Hunter, Slayer, &amp; Warden 5 new dungeons - Lair of Indrax, The Mudlands, Realm of Venom, Smoldering Ruins, &amp; The Vile Roots A complete new 44-card encounter deck Additional progression focuses, basic skills, potions, &amp; more! The Abyssal Depths expansion adds a kind of threat: Fiends who hound you throughout your entire quest to reach the boss. It includes 6 different Fiends, each with two levels of difficulty. Plus, 2 new aquatic heroes join the fight in the murky waters! Individual expansion cards are available as downloadable content via Steam: Caliana - This faerie has decided that dungeoneering looks fun! Don't let her get bored... Fanatic - A righteous Sentinel is here to smite evil wherever it may lurk! Witch - Her chaotic magic hammer is ready to smash glooping oozes into glooping puddles! Cinder Plains - The Hellhound awaits those reckless enough to venture here... Phoenix's Den - Only the bravest heroes can handle the heat! Once you know your way around the dungeon, a game takes about 15 minutes. It might take a little longer if you're learning, or a lot shorter if you jump into a pit of spikes. Warning: do not jump into a pit of spikes. HELLO! Would it be impolite if I were to nom on your armor and weapons? That shiny metal looks oh so delicious. Oh --pardon me, how rude of me not to introduce myself! I am Glooping Ooze, one of the many extremely polite denizens of the dungeons in this area. I even have my own card: Like all cards in One Deck Dungeon , mine is full of colored boxes, and HEY! What's the idea with all those arrows. Ugh, adventurers. So rude. So very very rude. I suppose you're rolling all your dice, attempting to fill in as many boxes as possible. For every one you don't fill, I'm going to make you pay for this arrow nonsense, in hearts and time! Precious time! If you manage to get past me somehow, you'll be able to take Armor Crush as a skill, or add that magic icon on the left to your stats, or take the three experience lanterns in the upper-right. Despite your arrowful attitude, I welcome you to the world of One Deck Dungeon. Adventure awaits! One Deck Dungeon is an officially licensed product of “One Deck Dungeon” from Asmadi Games.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/770100/header.jpg?t=1622042458",
    "Price": 9.99,
    "Developers": "Handelabra Games Inc.",
    "Publishers": "Handelabra Games Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/770100/ss_946ff2d5698dd272114c827f0e48e8cfb275c733.1920x1080.jpg?t=1622042458,https://cdn.akamai.steamstatic.com/steam/apps/770100/ss_40b06e00061c0a1f3a2ca1356d450aea11ba7cf8.1920x1080.jpg?t=1622042458,https://cdn.akamai.steamstatic.com/steam/apps/770100/ss_4363178170c8b7b30afbd9f33a3868658dce0af0.1920x1080.jpg?t=1622042458,https://cdn.akamai.steamstatic.com/steam/apps/770100/ss_0875ad5c11fc9ff423f4486c3d92d1974aab8866.1920x1080.jpg?t=1622042458,https://cdn.akamai.steamstatic.com/steam/apps/770100/ss_e88ad91ee57e34f6b371f2ac9a736eb7a72474a2.1920x1080.jpg?t=1622042458,https://cdn.akamai.steamstatic.com/steam/apps/770100/ss_e1c49d309d544e1e5bb6ddb0bf99f4a49c226bb0.1920x1080.jpg?t=1622042458,https://cdn.akamai.steamstatic.com/steam/apps/770100/ss_0bb77df47f7f6092b750bb3f16106bfa9fb6136d.1920x1080.jpg?t=1622042458,https://cdn.akamai.steamstatic.com/steam/apps/770100/ss_29bb3294f47bf29a5d6359b9fb8c1fa23eb985d2.1920x1080.jpg?t=1622042458",
    "Slug": "one-deck-dungeon",
    "Meta Title": "One Deck Dungeon: May 18, 2018, Handelabra Games Inc. and...",
    "Meta Description": "Looking for information on One Deck Dungeon? Check out the release date (May 18, 2018), developer insights from Handelabra Games Inc., and a complete ga...",
    "Alt Text Image": "Official header image for One Deck Dungeon game - Steam 770100",
    "Canonical URL": "https://gusku.site/game/one-deck-dungeon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"One Deck Dungeon\", \"description\": \"Looking for information on One Deck Dungeon? Check out the release date (May 18, 2018), developer insights from Handelabra Games Inc., and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 18, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Handelabra Games Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Handelabra Games Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/770100/header.jpg?t=1622042458\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}