{
    "AppID": 1538570,
    "Name": "Patron",
    "Release date": "Aug 10, 2021",
    "About the game": "Patron builds upon the foundations laid out by the staples of the survival city builder genre and enhances the experience with a large research tree and by introducing intricate social dynamics into the game and the genre in general. Happiness, the standard simple feature of all such games, in the case of Patron is a complete gameplay system in its own right . Patron starts off similarly to other games in the genre, but then veers off exploring social intricacies and what it means to truly run a society and not just a city filled with automatons. Each individual citizen in the town has their needs, desires and issues troubling them or making them happy. Some citizens are more concerned with immigration, while others are more aggravated by tax-related issues. If the citizen’s view on the subject is in line with what the town government (YOU, the player) is doing, they will be happy. Works the other way around as well. CONSTRUCT AND UPGRADE To make the best of the opportunities in this new land, you will need to construct residential houses, farms, production plants, manufacturing buildings and dozens of other buildings needed to harvest the riches of the land. BALANCE SENSITIVE SOCIAL ISSUES Every decision you make as Patron will be met with different reactions from different social groups. You'll need real political talent to balance sensitive matters as religion, immigration, loyalty, poverty... Whatever you choose to do can lead to unforeseen consequences years later. ADAPT TO WEATHER AND SEASONS Managing your tasks and citizens in a timely and efficient manner allows you to prepare and adapt to external variables like harsh weather or different seasons. RESEARCH AND DEVELOP FOR THE FUTURE The world is changing and you must make sure you're advancing at the proper pace. Only by constant advancing and research will your society be able to stand the test of time. TRAGEDY ALWAYS LURKS No matter what you do, unexpected tragedies can always strike your people. They will look to you for protection and help. ENJOY THE GOOD SIDE OF LIFE People also need external signs of their success. Build and arrange numerous beautification elements of your city, and make sure everyone is rewarded for their hard work. KEY FEATURES A survival city builder with a unique social dynamics system Gather and produce resources Establish sustainable production chains Build your fledgling village into a prosperous city as you construct and upgrade buildings Manage your people and steer your citizens towards needed professions Balance social issues: Class strife, Immigration, Religion, Health, Safety, Loyalty... Plan growth through an extensive Research Tree and unlock technology, policies and upgrades Plan production and overseas trade to support your economy through difficult times",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1538570/header.jpg?t=1651230067",
    "Price": 19.99,
    "Developers": "Overseer Games",
    "Publishers": "Overseer Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1538570/ss_fa436307347fc884b40d894127ddd4917851d526.1920x1080.jpg?t=1651230067,https://cdn.akamai.steamstatic.com/steam/apps/1538570/ss_6ec42fe5360b09a21b654619d6d2fa23c3e2e3ce.1920x1080.jpg?t=1651230067,https://cdn.akamai.steamstatic.com/steam/apps/1538570/ss_ffa08e7481e73426b04b9cd14271cbe093ae0e50.1920x1080.jpg?t=1651230067,https://cdn.akamai.steamstatic.com/steam/apps/1538570/ss_5e296a9df7f45348a4f405eaf7fe359b9938b6f7.1920x1080.jpg?t=1651230067,https://cdn.akamai.steamstatic.com/steam/apps/1538570/ss_54d9ca0c8cb9c31726f7a24f66872f8f4bb252fc.1920x1080.jpg?t=1651230067,https://cdn.akamai.steamstatic.com/steam/apps/1538570/ss_6453ebf9aed15651409b487d9d5a805a4aad237c.1920x1080.jpg?t=1651230067,https://cdn.akamai.steamstatic.com/steam/apps/1538570/ss_77bddea4a2176d3744a08a0dd1d1992ad1960090.1920x1080.jpg?t=1651230067,https://cdn.akamai.steamstatic.com/steam/apps/1538570/ss_cc352d2a3abddf284385490b80d5d928e38def55.1920x1080.jpg?t=1651230067,https://cdn.akamai.steamstatic.com/steam/apps/1538570/ss_0e213238705ab01c4ecda954b08f2378c56c107e.1920x1080.jpg?t=1651230067",
    "Slug": "patron",
    "Meta Title": "Patron: Aug 10, 2021, Overseer Games and Full Overview",
    "Meta Description": "Looking for information on Patron? Check out the release date (Aug 10, 2021), developer insights from Overseer Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Patron game - Steam 1538570",
    "Canonical URL": "https://gusku.site/game/patron",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Patron\", \"description\": \"Looking for information on Patron? Check out the release date (Aug 10, 2021), developer insights from Overseer Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Overseer Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Overseer Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1538570/header.jpg?t=1651230067\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}