{
    "AppID": 1216550,
    "Name": "Player's Eleven",
    "Release date": "Feb 12, 2020",
    "About the game": "Only a few more seconds, then it starts. The players are standing in the players' tunnel, very close to the field, but they hardly notice the deafening noise of the fans. It is the most important game in the club's history and the pressure is enormous. Will they fail? Or will they make history today? It's in your hands! In Player's Eleven you take over a football club of your choice or start a whole new career as an aspiring football manager. In the process, you put together the team, fine-tune the tactics and ensure optimal training. New talents join your squad through scouting and youth players. You constantly develop the stadium and the club grounds. But watch out: The president keeps a close eye on your sporting and financial development. Don't disappoint his expectations! FIND THE RIGHT TACTIC Strengthen your squad with players who fit your tactics. Do you prefer to play with man-to-man defence or without? Short passing or long balls forward? With the right players and the right tactics, you can lead your club to success. DEVELOP THE CLUB Youth academy, scouting department, training grounds or the medical department: expand your club grounds to get the best out of your club. But be careful! Don't neglect the maintenance costs! NATIONAL AND INTERNATIONAL CLUB RENAME Club reputation is very slow to adapt to the club's successes and results. Players, staff and sponsors take their cue from it. This prevents the club from rising to the top too quickly. Long-term successes have to be worked hard for. HUGE EDITOR WITH DATABASE SYSTEM All club and player names as well as national and international club competitions can be easily edited. It is also easy to add new European countries and leagues. External databases can easily be copied into the game. COMPREHENSIVE DEMO Play a complete season with all features of Player's Eleven in the demo version. Save your score and then continue playing with the full version. FEATURES Extensive tactical possibilities Various training options that directly influence the strength of your players and change the effectiveness of the tactics. Individual players who pursue their own goals Regional, national and worldwide scouting Own youth section with U19 championships Expansion of the stadium and club grounds; negotiations with sponsors Games in top European leagues; extensive editing facilities for all European countries available Main cup for the professionals and amateur cups for the lower leagues; European club competitions Career mode; powerful president whose demands must be met Possibility of relinquishing powers in the sporting, contractual, economic and infrastructural fields. Co-coach, youth and scouting director Club fans in three categories: Loyal Fans, Normal Fans and Success Fans. Dozens of statistics and in-game editor",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1216550/header.jpg?t=1643370699",
    "Price": 17.99,
    "Developers": "Green Pitch Gaming",
    "Publishers": "Green Pitch Gaming",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1216550/ss_1b37c1ed71a31e59cd5d3526cc02eb0b236defac.1920x1080.jpg?t=1643370699,https://cdn.akamai.steamstatic.com/steam/apps/1216550/ss_cde4b1c6310844e3aaa7788cde4cd5f07df9cc94.1920x1080.jpg?t=1643370699,https://cdn.akamai.steamstatic.com/steam/apps/1216550/ss_1326dc3e039bca68dd1781fddc8251871b7bfee5.1920x1080.jpg?t=1643370699,https://cdn.akamai.steamstatic.com/steam/apps/1216550/ss_9b3e70cb869121a6835429b965f9a9ea6c35c376.1920x1080.jpg?t=1643370699,https://cdn.akamai.steamstatic.com/steam/apps/1216550/ss_52f2dcdd0095b752125aa76a8a97171821554e60.1920x1080.jpg?t=1643370699,https://cdn.akamai.steamstatic.com/steam/apps/1216550/ss_55a7ea99ad893ed41cbfbc8d3c32a4f5b5cefbc1.1920x1080.jpg?t=1643370699,https://cdn.akamai.steamstatic.com/steam/apps/1216550/ss_f028876b65927542ea636b3116e8570926628f1e.1920x1080.jpg?t=1643370699,https://cdn.akamai.steamstatic.com/steam/apps/1216550/ss_699e1adcc50cd6ed042be1b9361df41c8654d5c1.1920x1080.jpg?t=1643370699,https://cdn.akamai.steamstatic.com/steam/apps/1216550/ss_a0e14282c71db1a14c000039c943c9b680183a45.1920x1080.jpg?t=1643370699,https://cdn.akamai.steamstatic.com/steam/apps/1216550/ss_ae9173b7982a6c24ac4d399ab70408e86a9c00d6.1920x1080.jpg?t=1643370699",
    "Slug": "player-s-eleven",
    "Meta Title": "Player's Eleven: Feb 12, 2020, Green Pitch Gaming and Ful...",
    "Meta Description": "Looking for information on Player's Eleven? Check out the release date (Feb 12, 2020), developer insights from Green Pitch Gaming, and a complete game s...",
    "Alt Text Image": "Official header image for Player's Eleven game - Steam 1216550",
    "Canonical URL": "https://gusku.site/game/player-s-eleven",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Player's Eleven\", \"description\": \"Looking for information on Player's Eleven? Check out the release date (Feb 12, 2020), developer insights from Green Pitch Gaming, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 12, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Green Pitch Gaming\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Green Pitch Gaming\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1216550/header.jpg?t=1643370699\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}