{
    "AppID": 583870,
    "Name": "Punch! Landscape Design for Mac v19",
    "Release date": "Jul 20, 2017",
    "About the game": "Create Amazing Landscaping and Outdoor Living Plans! Spruce up your yard or create a whole new landscape concept! Bring your home's exterior features to their full potential with the all-new Landscape Design for Mac Version 19 . Maybe you are starting with a clear lot and planning an entire landscape from scratch, or perhaps you want to put some new life into your old yard? Either way, you'll get professional results from Punch! Landscape Design. The updated, enhanced and customizable features in version 19 make the design process a pleasure from start to finish. New and enhanced tools: Customizable 2D plant symbols, SketchUp™ import, dormer, column, roofing system, plant inventory system, and Library Management System – plus customizable tool organization. New interface: 64-bit technology with an updated Mac-friendly user interface and retina compatibility for the sharpest imagery! New templates and plans: Dozens of new professional designer quality home plans – plus landscape and outdoor templates. New resources: Helpful online video tutorials, updated user guide and user forum. The Best Curb Appeal Starts Here! Your landscape makes a lasting first impression. Create the perfect patio, home deck, gazebo or outdoor room design with customized paint, stains and other outdoor finishing touches. Plan every piece to complement your overall landscaping plan. You'll be amazed at what you can do with Landscape Design for Mac. With version 19, it's simple to get started. Just upload a photo of your yard or design from scratch. Easily add pre-made outdoor kitchens, water features, lighting, custom fences, paths, patios and so much more. Plan your landscaping with drop-in gardens or cultivate your own design using the expanded plant library. Better Landscaping Options Get creative with hundreds of 3D objects, materials and paint colors. Breath-taking yet practical landscaping can flourish in your planting zone. Design a work-ready plan that accounts for your climate, seasonal changes and topography conditions. Avoid bare or over planted sections. Automatic Growth Tool shows how your landscape will look now and in the future as plants grow and mature. In a single mouse click, you can examine plant height and spacing. Proper planning will ensure you buy only the plants you really need to complete your design. Don't just have a yard, have the landscape of your dreams. Maximize the appearance of outdoor spaces – No design experience required. Anyone can put together professional style designs using intuitive landscape design software from Punch! Drag-and-drop options and realistic lighting design tools make planning your dream yard, home deck design and outdoor rooms a breeze. The new interface, assistant features and one mouse click design capabilities are better than ever! Have The Best Landscape Success comes easy for any landscaping, garden, patio or outdoor room project. The perfect plan emerges when you visualize your all of your plans before you start. Save money buying only the home and garden materials you really need. Best of all, you will impress your family, friends and neighbors with the final design. A yard that's built to fit your lifestyle will be the centerpiece of your home for years to come. You'll love what you can do with Landscape Design!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/583870/header.jpg?t=1500994456",
    "Price": 49.99,
    "Developers": "Punch! Software",
    "Publishers": "Punch! Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/583870/ss_0c2d9b69c7ec6cb57a5745c03ecbabf1914e87cf.1920x1080.jpg?t=1500994456,https://cdn.akamai.steamstatic.com/steam/apps/583870/ss_a6ff425bbd4384d0765aa6a8576adc07f10c9852.1920x1080.jpg?t=1500994456,https://cdn.akamai.steamstatic.com/steam/apps/583870/ss_a38b141dfcd1494d90f68351ed3806b9e26fef5e.1920x1080.jpg?t=1500994456,https://cdn.akamai.steamstatic.com/steam/apps/583870/ss_fc7229c144bd256ca07a476f2b448015239ff917.1920x1080.jpg?t=1500994456,https://cdn.akamai.steamstatic.com/steam/apps/583870/ss_b49c9fe0fcfbb754fb7a5a5be3c263b7523cb678.1920x1080.jpg?t=1500994456,https://cdn.akamai.steamstatic.com/steam/apps/583870/ss_08004ec2bc6b1ebe1b269c66b81fa65c0db0f655.1920x1080.jpg?t=1500994456",
    "Slug": "punch-landscape-design-for-mac-v19",
    "Meta Title": "Punch! Landscape Design for Mac v19: Jul 20, 2017, Punch!...",
    "Meta Description": "Looking for information on Punch! Landscape Design for Mac v19? Check out the release date (Jul 20, 2017), developer insights from Punch! Software, and ...",
    "Alt Text Image": "Official header image for Punch! Landscape Design for Mac v19 game - Steam 583870",
    "Canonical URL": "https://gusku.site/game/punch-landscape-design-for-mac-v19",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Punch! Landscape Design for Mac v19\", \"description\": \"Looking for information on Punch! Landscape Design for Mac v19? Check out the release date (Jul 20, 2017), developer insights from Punch! Software, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Punch! Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Punch! Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/583870/header.jpg?t=1500994456\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}