{
    "AppID": 849600,
    "Name": "Sandbox Showdown",
    "Release date": "Jun 8, 2018",
    "About the game": "Sandbox Showdown is a third-person physics based brawler, allowing you to match up Heroes with different play styles to enemies from different genres. Want to match sword-and-shield knights with a gun wielding soldier? A shuriken throwing Ninja against prehistoric Raptors? Or perhaps a spell-flinging wizard against intergalactic Space Marines? You can! Sandbox Showdown is a third-person physics based brawler, allowing you to match up Heroes with different play styles to enemies from different genres. Want to match sword-and-shield knights with a gun wielding soldier? A shuriken throwing Ninja against prehistoric Raptors? Or perhaps a spell-flinging wizard against intergalactic Space Marines? You can! - Pick one of 9 Heroes from different genres. - Match them against several different Enemy Types , including Knights, Space Marines, Zombies, Raptors, Wizards and More. -Drivable vehicles from different eras, including Motorcycles, 4 Wheelers, Cars, Hover-Bikes, and more! - As you level your Hero, greater traits are earned by your battle using the In-game store. For more Clips Subscribe to my YouTube Channel: The Heroes Each Hero has a different mix of abilities to match their genre, such as bashes, dodges, and defensive blocks. Play as … The Soldier: A classic take-no-prisoners, trigger-happy Hero from your standard shooter games, has good range and is all out of bubble-gum. The Knight: For Honor, for Victory! Or For Fun! The medieval warrior brandishes a big two-handed sword, and a swift arming shortsword. The Pirate: Just searching for some splendid booty now and again, Argo the Pirate has a deadly sabre, and if things get too out of hand, he can use an off-Hand Pirate Flintlock. The Wizard: With a deadly mix of Flame and Lighning attacks, the Wizard is explosive but a bit on the squishy side. The Dwarf: Hailing from the Mines of Shortan'Wide, Gimply the Dwarf pummels people with his giant blessed hammer. The Ninja: Fast, agile, attacks with quick devasting lunge-kicks and roundhouses. If your enemy strays too far, pick them off with a few well aimed shurikens! The Bulk: A giant mass of a failed science experiment, the Bulk is nearly unstoppable and clobbers most foes with ease, and can fling them around the battleground with ease. and MORE TO COME! More updates will be released as I come closer to Launch. More Enemies, Vehicles, and definitely new Heroes ....",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/849600/header.jpg?t=1578010595",
    "Price": 1.99,
    "Developers": "Fistfang",
    "Publishers": "Fistfang",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/849600/ss_c244111aa34c1a2e0e7e5c6dbdde08aeda5450eb.1920x1080.jpg?t=1578010595,https://cdn.akamai.steamstatic.com/steam/apps/849600/ss_3db637e59cba9ca949ea6bc93af5b6c5cc25c909.1920x1080.jpg?t=1578010595,https://cdn.akamai.steamstatic.com/steam/apps/849600/ss_9a09f85b41c6db5525465357c94ba090128d61b2.1920x1080.jpg?t=1578010595,https://cdn.akamai.steamstatic.com/steam/apps/849600/ss_2de5b22b77d9e54ac5e915b4aae760b8393a2725.1920x1080.jpg?t=1578010595,https://cdn.akamai.steamstatic.com/steam/apps/849600/ss_530391c4bc02972dc348deb3c79624cd44466a32.1920x1080.jpg?t=1578010595,https://cdn.akamai.steamstatic.com/steam/apps/849600/ss_3fcbe80109c0aaec969daa4982d202b2f36171e6.1920x1080.jpg?t=1578010595,https://cdn.akamai.steamstatic.com/steam/apps/849600/ss_13a79c7c82472bb532f997ba2b9de51fba7aa761.1920x1080.jpg?t=1578010595,https://cdn.akamai.steamstatic.com/steam/apps/849600/ss_b9275b81dd0c4d70ad79f1a1a203b0f83a440353.1920x1080.jpg?t=1578010595",
    "Slug": "sandbox-showdown",
    "Meta Title": "Sandbox Showdown: Jun 8, 2018, Fistfang and Full Overview",
    "Meta Description": "Looking for information on Sandbox Showdown? Check out the release date (Jun 8, 2018), developer insights from Fistfang, and a complete game summary.",
    "Alt Text Image": "Official header image for Sandbox Showdown game - Steam 849600",
    "Canonical URL": "https://gusku.site/game/sandbox-showdown",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sandbox Showdown\", \"description\": \"Looking for information on Sandbox Showdown? Check out the release date (Jun 8, 2018), developer insights from Fistfang, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fistfang\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fistfang\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/849600/header.jpg?t=1578010595\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}