{
    "AppID": 1910230,
    "Name": "Spirit of Shotgun",
    "Release date": "Mar 11, 2022",
    "About the game": "„ Spirit of Shotgun: Platforming Escapade, Never in Silence “ is a 2D platformer adventure with a twist! With no other way to move around, your quest is to blast yourself upwards with the kickback of a shotgun, and find your way to the surface of the world! Story „The prophecy spoke of a light in the darkness... The Sun’s final spark would descend into the deepest abyss, and await the coming of the Saviour…“ You find yourself in a strange predicament – being stuck up to your waist inside a talking wooden barrel, who has – along with you – lost it’s memories to the darkness of the Abyss. You can’t recall why you ventured into the deepest place on Earth, yet know that the lantern you carry is of great importance to your quest. Can you rediscover the past and uncover the fate of the world – and the point of your journey – as you climb upwards? Guided by nothing but the Holy Spirit of an almost extinct religion called „The Way of the Shotgun“ , you need to light holy shrines, replenish ammo, uncover Ancient Shotguns and use them to reach places no ordinary shotgun-less human could. Gameplay Your shotgun can fire twice before reloading! Shoot once, then again in mid-air to alter the direction of your flight, or blast both barrels at once for a much stronger jump! Mastery is key! Learning from your mistakes is a must - every stage of the climb presents an increased level of challenge, with no checkpoints to guard your progress... Should you make a grave mistake – climb once more from the depth you fell to! - Multiplayer! Join your friends on the journey to the surface! Other players shall appear in your game as “phantoms” - ghosts from different worlds and timelines. Watch them closely as they advance alongside you, and learn from their mistakes! - Light Shrines as you climb upwards! The ancient Sprit of Shotgun was forgotten and only you can bring back it’s former glory! Shine your lantern on abandoned shrines to restore them, and have them provide you with ammunition! - The ammo you carry is limited! Should you make too many mistakes and end up with no shells left, you‘ll be forced to return to the last Shrine you lit! Keep an eye on your ammo count at all times, as shrines are not always guaranteed to be near... - No checkpoints! But... You can find an item called „Martyr’s Bone“ scattered around in the Underdark. These sacred objects can be used to transport you upwards to the last shrine you lit, in order to recover your progress! However, once spent – they’re gone for good. Save them for a rainy day. - Bullettime! Your talking barrel companion has the magical ability to slow down time, which works in tandem with your double-barrel shotgun. Fire once on the ground to blast off, enter Bullettime, then shoot once again in mid-air to alter the direction of your flight! If executed with precision, this technique will allow you to traverse any region of the Underdark in seconds. - Achievements! There’s a bunch of achievements. Nice! Environment - Many realms of the Underdark await your arrival... Be it places from ancient mythology, such as The Pits of Tartarus, or the resting place of the Ice-Father Ymir, or realms long forgotten – like the great Nether Frontier and the Desolation... All of them bring something new to the table, both lore and gameplay-wise. - Atmosphere! Every stage was meticulously conceptualized, drawn and assembled to form a cohesive whole that gives off it’s own unique sense of atmosphere – each with it’s very own soundtrack, high-definition ambiences, lore and secrets! - Collectibles! In places that are often challenging to reach, you can uncover a blast from the past... – the Ancient Shotguns. Each was designed to stand out with it’s unique environment-themed appearance, as well as it’s own sound, lore and special effects. Uncover them all to become the owner of the Great Collection! The Way of the Shotgun is our only salvation! Will your faith be strong enough to reach the end?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1910230/header.jpg?t=1651687934",
    "Price": 7.99,
    "Developers": "Vever Studios",
    "Publishers": "Vever Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1910230/ss_0bf94105e37667540bd795baf7edcf291b70ba73.1920x1080.jpg?t=1651687934,https://cdn.akamai.steamstatic.com/steam/apps/1910230/ss_01bebcb9de2c63ff43db1a864c2d3fd0210a3b53.1920x1080.jpg?t=1651687934,https://cdn.akamai.steamstatic.com/steam/apps/1910230/ss_11b1737400d1e6527bd69bf25849666c0e275b8a.1920x1080.jpg?t=1651687934,https://cdn.akamai.steamstatic.com/steam/apps/1910230/ss_4acfebbb58eb4bf38727b0e13f324d56e3b557e1.1920x1080.jpg?t=1651687934,https://cdn.akamai.steamstatic.com/steam/apps/1910230/ss_5e5ce197913a5f57b1984576c802d435f242305b.1920x1080.jpg?t=1651687934,https://cdn.akamai.steamstatic.com/steam/apps/1910230/ss_7a9b5b298dd2cf0e7a5338c2e63816b3d082234d.1920x1080.jpg?t=1651687934",
    "Slug": "spirit-of-shotgun",
    "Meta Title": "Spirit of Shotgun: Mar 11, 2022, Vever Studios and Full O...",
    "Meta Description": "Looking for information on Spirit of Shotgun? Check out the release date (Mar 11, 2022), developer insights from Vever Studios, and a complete game summ...",
    "Alt Text Image": "Official header image for Spirit of Shotgun game - Steam 1910230",
    "Canonical URL": "https://gusku.site/game/spirit-of-shotgun",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spirit of Shotgun\", \"description\": \"Looking for information on Spirit of Shotgun? Check out the release date (Mar 11, 2022), developer insights from Vever Studios, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Vever Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vever Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1910230/header.jpg?t=1651687934\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}