{
    "AppID": 1432860,
    "Name": "Sun Haven",
    "Release date": "Jun 25, 2021",
    "About the game": "Sun Haven is a multiplayer fantasy farming sim with dragons, magic, a main questline, RPG-style skill progression, and even a final boss. Greetings, Adventurer! You’ve just arrived in Sun Haven, a medieval town full of people from all walks of life doing their best to make their beloved town thrive as it once did. As a farmer, miner, fisher, warrior, craftsman, and even a mage, you’ll find that adventure awaits you here. Your hard work will let you upgrade your farm, restore shops in Sun Haven, and even bring in new neighbors! As you bring the hustle and bustle back to town, the EXP you earn from each quest will help you level up to advance through a main questline journey. The main quest itself takes you through two captivating towns outside of Sun Haven. The mythical Elven town of Nel’Vari rests deep in the forest where the Elves live in balance with nature. The rumored monster city of Withergate features a bustling nightlife that never ends - literally - since the city is covered in neverending darkness. Your experience in these places will grow your skills dramatically, but how you focus that growth is entirely up to you. If you prefer a sword in hand, then slash away by all means. But if a watering can is more your style, then there are nonviolent alternatives to overcome dangerous encounters - even with the final boss! Either way, it’s up to you to wield your abilities and become the hero of your own story. Features: Farm, Fish, Fight, Mine, Smith, Cook, and Craft to revitalize Sun Haven THREE Worlds to Explore: The Cozy Human Town of Sun Haven, The Beautiful Elven Village of Nel’ Vari, and Urban Monster City Withergate SEVEN different player races : Human, Demon, Elf, Angel, Elemental, Naga, and Amari (animal race, including cats, dogs, fish, birds, and reptiles) Tons of Player Customization: 200+ different race and clothing options 8 Player Multiplayer: Play with up to EIGHT total people in one game, make your own farm and story in online multiplayer FIFTEEN romance-able characters : (humans, elves, demons, and multiple animal races) or woo your own partner in multiplayer! Romance your character of choice regardless of gender or race and get married Unique Monsters throughout the world to fight past on your way to becoming the hero of Sun Haven Home Decorating with more than 100 pieces of furniture. From your living room to your farm, design and decorate to your heart’s content! Dozens of RPG-styled Quests to keep you engaged while you relax and farm A Skill Tree with over 100 options. Make your own play style and unlock a plethora of spells to help you along your journey, Farming Spells, Combat Spells, even Mining Spells! Pets and Mounts to collect and keep on your farm or to join you as you discover what lies beyond the forests of Sun Haven",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1432860/header.jpg?t=1629495088",
    "Price": 24.99,
    "Developers": "Pixel Sprout Studios",
    "Publishers": "Pixel Sprout Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1432860/ss_4a133127eb753aa0a97bdd06f5b4189a65fbc532.1920x1080.jpg?t=1629495088,https://cdn.akamai.steamstatic.com/steam/apps/1432860/ss_6139a4fe6b789463b751a6a5cec14d2041a4eb68.1920x1080.jpg?t=1629495088,https://cdn.akamai.steamstatic.com/steam/apps/1432860/ss_3dc21d649d4b7be284416dfcf66e5bed99e64a25.1920x1080.jpg?t=1629495088,https://cdn.akamai.steamstatic.com/steam/apps/1432860/ss_ae537e402ef6cfc4e33949e7fbec26e75fc78dfc.1920x1080.jpg?t=1629495088,https://cdn.akamai.steamstatic.com/steam/apps/1432860/ss_430f5425b38535117537fd49a2c7dbfc5ba39b74.1920x1080.jpg?t=1629495088,https://cdn.akamai.steamstatic.com/steam/apps/1432860/ss_c60b924b1ec3c7f4b3d32bdf17d953a74b62369f.1920x1080.jpg?t=1629495088,https://cdn.akamai.steamstatic.com/steam/apps/1432860/ss_6fc7bef220313b1abcb37c4ed7edfbc85d4d94a2.1920x1080.jpg?t=1629495088,https://cdn.akamai.steamstatic.com/steam/apps/1432860/ss_c4af90959c9f78ee97b93b4f084d00198b03e30e.1920x1080.jpg?t=1629495088,https://cdn.akamai.steamstatic.com/steam/apps/1432860/ss_e4e7a3e69f075054b41b4f4c60a9d07f45a37454.1920x1080.jpg?t=1629495088,https://cdn.akamai.steamstatic.com/steam/apps/1432860/ss_a28c0acea1423a4f8886f75d3d358a7fc67c4f9f.1920x1080.jpg?t=1629495088,https://cdn.akamai.steamstatic.com/steam/apps/1432860/ss_8f28b6708ad33d5feb52045ed20d7cea00ebf6ff.1920x1080.jpg?t=1629495088,https://cdn.akamai.steamstatic.com/steam/apps/1432860/ss_7f6dc4b9e729b997ebc4c803640be1fec64e1927.1920x1080.jpg?t=1629495088",
    "Slug": "sun-haven",
    "Meta Title": "Sun Haven: Jun 25, 2021, Pixel Sprout Studios and Full Ov...",
    "Meta Description": "Looking for information on Sun Haven? Check out the release date (Jun 25, 2021), developer insights from Pixel Sprout Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Sun Haven game - Steam 1432860",
    "Canonical URL": "https://gusku.site/game/sun-haven",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sun Haven\", \"description\": \"Looking for information on Sun Haven? Check out the release date (Jun 25, 2021), developer insights from Pixel Sprout Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pixel Sprout Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pixel Sprout Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1432860/header.jpg?t=1629495088\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}