{
    "AppID": 619380,
    "Name": "The little vampir",
    "Release date": "Jun 30, 2017",
    "About the game": "Enjoy 'Hard timing play' Make a advantageous situation for yourself by utilizeing surrounding environments and characters. Reveal a secretary story of the kingdom About Story: What? I became a little? One day, a hungry vampire saw a beautiful princess by chance. He wanted to drink her delicious blood. So he flew to the tower where she was. But while going to the tower, he bumped into a suspicious shield. As a result, he lost all his dark power and even became a little vamipre boy. He still wanted to drink the princess's blood. Eventually, he decided to secretly sneak into the kingdom with his weakened state. Features 1.Hard timing play : “Hide, Wait...........and Do quickly!” Now, The vampire is very weak. If he becomes caught in the visual range of soldiers, he will be captured and killed. Therefore, you should move as fast and secretly as possible. 2.A strategic play that utilizes the surrounding environment : 'Make a advantageous situation for yourself.' 1). Residents with unique characteristics Many residents live in this castle. Each of them has unique characteristics and has a special relationship among them. If a coward servant finds a vampire, he will scream and run away. And then, the soldier will run to the place. You can figure out their characteristics and create a advantageous situation. 2). The lost Vampire's skills that you can bring back one by one. The kingdom has four buildings. At the top of each building, there is something that got rid of the skills of the vampire. Whenever vampire destroys it, he regains his power. Vampire has seven skills. Each of these has its own characteristics and limits. What happens if you use Seduction skills for a maid? How can we use these skills to clear the stage faster? 3). Objects that may help you or interrupt you There are some various objects that you can utilize. But others can't be used easily. For example, there are somethings that can hide your body, a cross and a sunny window that vampire hates. Use these things wisely and proceed to the next stage. 3.A secretary story of the kingdom : 'Did you hear the rumor?' When you walk around a stage, you can find suspicious pieces of pictures and papers with rumors. Gather these things together and reveal the secret of the mysterious kingdom and veiled princess. Of course, it won't be easy.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/619380/header.jpg?t=1498825352",
    "Price": 5.99,
    "Developers": "BRAINEART",
    "Publishers": "BRAINEART",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/619380/ss_99b21667bc64328acaec0b5025f6c7870a1a91fc.1920x1080.jpg?t=1498825352,https://cdn.akamai.steamstatic.com/steam/apps/619380/ss_79b283f1dc7ce61f248089472b28952e5ecd8006.1920x1080.jpg?t=1498825352,https://cdn.akamai.steamstatic.com/steam/apps/619380/ss_f837f479399115232195fd6148311cfb6d14a048.1920x1080.jpg?t=1498825352,https://cdn.akamai.steamstatic.com/steam/apps/619380/ss_f1fdb5c5f72559dc4721001b5eb10980e1c46564.1920x1080.jpg?t=1498825352,https://cdn.akamai.steamstatic.com/steam/apps/619380/ss_5f52bee1e739bfe4b7e9f9d4be3ea508d9da0b89.1920x1080.jpg?t=1498825352",
    "Slug": "the-little-vampir",
    "Meta Title": "The little vampir: Jun 30, 2017, BRAINEART and Full Overview",
    "Meta Description": "Looking for information on The little vampir? Check out the release date (Jun 30, 2017), developer insights from BRAINEART, and a complete game summary.",
    "Alt Text Image": "Official header image for The little vampir game - Steam 619380",
    "Canonical URL": "https://gusku.site/game/the-little-vampir",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The little vampir\", \"description\": \"Looking for information on The little vampir? Check out the release date (Jun 30, 2017), developer insights from BRAINEART, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 30, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"BRAINEART\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BRAINEART\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/619380/header.jpg?t=1498825352\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}