{
    "AppID": 663100,
    "Name": "Thrust & Shoot : Flight School",
    "Release date": "Feb 14, 2018",
    "About the game": "Feel the freedom and speed of realistic space combat! Key Features: a single-player, 3D space fighter simulator where everything moves according to real physics fly what is essentially a rocket with guns strapped to it learn to control inertia and plan your maneuvers the mouse is enough to fly and fight; full joystick and gamepad support; fully customizable controls earn mission medals depending on your ability: how many missions can you Ace ? Why another game about space fighters: The core idea of Thrust&amp;Shoot is that physics doesn't need to be dumbed down to make a fun game. Things move differently in space and this difference shouldn't be camouflaged or erased. This is a space game for people who can understand and use inertia, and do not expect a spaceship to behave like a boat or an airplane. Braking and strafing are luxuries for fighter pilots: nice, but far from vital. Capital ships have maneuver thrusters that can push them along all axes; for fighters, it's easiest to just turn and use the main thrusters for all their maneuvers. Guns only fire straight forward, but since you're flying in hard vacuum, you can turn the ship to fire in any direction at any time. It all works with simple controls. You turn with the mouse, left-click to fire guns, right-click to accelerate forward. By default, you roll using the scroll wheel. Reloading and target selection are keyboard keys by default, but you can bind them to other mouse buttons or anything you want. The game has full joystick and gamepad support and you can configure controls to whatever you feel works best. In this game, you're a cadet trying to pass the Academy's flight trials and become a certified combat pilot. Each mission teaches and tests your ability in a certain kind of combat scenario. The bronze medal signifies basic ability and is not too hard to earn, as long as you can perform the required task. Silver and gold are progressively harder and require you to polish your tactics and precision. Finally, the Ace medal is the mark of the expert and requires skill, patience, cunning and considerable luck. The missions: Basic Flight The game's tutorial lets you familiarize yourself with the controls and shoot down some unarmed targets. Obstacle Course Race through an obstacle course. Improve your time to earn higher medals. You'll learn the basics of flight and maneuvering and blow up some practice targets along the way. Point Defense Defend your mothership against inbound missile salvos. Master interception and shooting down moving targets. Let none through ! Assault Take out enemy fixed defenses. Dodge enemy fire, use precision flying to attack the enemy's weak points and level the opposition. Dogfight Fly a combat patrol and eliminate enemy fighters. A word from the dev: This is a passion project by a solo developer. I only have your feedback to guide me in my efforts. Suggestions and criticism, as well as bug reports, are extremely valuable. I will do my best to continue supporting and expanding Thrust&amp;Shoot: Flight School and I hope you'll help me make the right decisions. Thanks and Good Hunting !",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/663100/header.jpg?t=1623243901",
    "Price": 9.99,
    "Developers": "Hellride Games",
    "Publishers": "Hellride Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/663100/ss_1a115d2fa81d01425f810b3ba71800c068bffc8a.1920x1080.jpg?t=1623243901,https://cdn.akamai.steamstatic.com/steam/apps/663100/ss_f220687af7a8051b93116fa88a2b26e5b9b22747.1920x1080.jpg?t=1623243901,https://cdn.akamai.steamstatic.com/steam/apps/663100/ss_7464f5264bef50537a5f0e036d49620540e62f7d.1920x1080.jpg?t=1623243901,https://cdn.akamai.steamstatic.com/steam/apps/663100/ss_40580424c1debd94aabf0eb524024d20b319c2a2.1920x1080.jpg?t=1623243901,https://cdn.akamai.steamstatic.com/steam/apps/663100/ss_16277df9594df08e2970604f1f78b92899e147b6.1920x1080.jpg?t=1623243901,https://cdn.akamai.steamstatic.com/steam/apps/663100/ss_40cfc78a65e0f731fca3547e49523c04f4873e6e.1920x1080.jpg?t=1623243901,https://cdn.akamai.steamstatic.com/steam/apps/663100/ss_a388fbd7af3fe07916d18e8c909621973456d23c.1920x1080.jpg?t=1623243901,https://cdn.akamai.steamstatic.com/steam/apps/663100/ss_d94b284e33e6a3945ffca7f37895d15adc1959bb.1920x1080.jpg?t=1623243901,https://cdn.akamai.steamstatic.com/steam/apps/663100/ss_cb6c6a6d5d1416138cc67886944ccdca1940077f.1920x1080.jpg?t=1623243901,https://cdn.akamai.steamstatic.com/steam/apps/663100/ss_c7cbf8627ff6850dfdcaa127ad217e5006d4be4b.1920x1080.jpg?t=1623243901,https://cdn.akamai.steamstatic.com/steam/apps/663100/ss_821fe7552ec78dc138c488fb7866e3386e28fc8f.1920x1080.jpg?t=1623243901,https://cdn.akamai.steamstatic.com/steam/apps/663100/ss_58705844e1dfde35bd1dcb315813b12d2b3174c6.1920x1080.jpg?t=1623243901",
    "Slug": "thrust-shoot-flight-school",
    "Meta Title": "Thrust & Shoot : Flight School: Feb 14, 2018, Hellride Ga...",
    "Meta Description": "Looking for information on Thrust & Shoot : Flight School? Check out the release date (Feb 14, 2018), developer insights from Hellride Games, and a comp...",
    "Alt Text Image": "Official header image for Thrust & Shoot : Flight School game - Steam 663100",
    "Canonical URL": "https://gusku.site/game/thrust-shoot-flight-school",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Thrust & Shoot : Flight School\", \"description\": \"Looking for information on Thrust & Shoot : Flight School? Check out the release date (Feb 14, 2018), developer insights from Hellride Games, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 14, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hellride Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hellride Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/663100/header.jpg?t=1623243901\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}