{
    "AppID": 1066780,
    "Name": "Transport Fever 2",
    "Release date": "Dec 11, 2019",
    "About the game": "The classic transport simulation genre has a new gold standard with Transport Fever 2. Discover a whole new world by navigating transport routes through land, water and air. May progress and prosperity find their way! Provide the world with the transport infrastructure it needs and make a fortune with custom-made transport services. Watch your trains run on rails, your buses and trucks thunder along roads, your ships power through the water, and your planes soar through the skies. Carry people on their way to work or play, and be the reason cities grow and thrive. Deliver raw materials and goods to drive the economy. Experience the greatest logistical challenges from 1850 to the present day, and build a transport empire unrivaled anywhere else on the globe! Free play offers a huge range of creative possibilities, while campaign mode re-writes transport history across three continents. Transport Fever 2 offers a choice of over 200 vehicles from Europe, America and Asia, modelled in extreme detail; and with the in-game map editor, you can re-create landscapes from three different climate zones. Finally, the realistic transport and economy simulator, along with comprehensive modding support, round off the gameplay experience. Open Up the World A huge game world is waiting for your railroads, road vehicles, aircraft and ships. Intuitive interactive rail construction tools and a modular construction system for stations make it easy to build and expand your transport empire; and thanks to a wide range of configuration options, every free play game provides a new challenge, where completely different strategies can lead to success. Write Transport History Three historic campaigns set in different time periods and located on three separate continents will challenge you with different objectives …only transport magnates will manage to complete all the missions! Voiceovers and cutscenes enrich the story and contribute to a thrilling gameplay experience, and even the free play mode will challenge you with different achievements to unlock. Optimize the Infrastructure It is vital to adapt your company to the needs of the economy and cities: bridges, tunnels, switches, rail signals, one-way streets, light signals, and bus lanes are just some of the possibilities you can use to optimize the transport infrastructure. Even train stations and airports can be expanded with modules in order to meet different requirements; and various data layers help you visualize traffic volumes and emissions, and provide information for further improvements. Free your Creativity Thanks to the detailed game world, you can develop your very own virtual railroad landscape: the map editor provides the possibility to create countless different worlds; the terrain in the game can be adjusted and painted; and thanks to the extensive modding support, new creations are being developed constantly, which are available for free via the Steam Workshop and which can be easily integrated into the game. Game Features Free play with countless configuration possibilities Three campaigns across three continents with over 20 hours of playing time Editors for creating maps and editing saved games Three landscape types: moderate, dry, and tropical Realistically modelled vehicles from Europe, America and Asia A total of over 200 vehicles: trains, buses, streetcars, trucks, aircraft and ships Modular train stations, bus and truck stations, airports and harbors Realistic transport simulation including one-way streets and light signals Editable and paintable terrain with realistic effects Intuitive construction tools for building railroads and more Display important data such as traffic and emissions, on separate layers Dynamic economy and city simulation More than ten economic chains with associated factories and goods Cities with countless residential, commercial and industrial buildings Detailed game world with physics-based lighting Individually simulated land animals, birds and fish Over 50 challenging achievements in free play mode Extensive modding support via the Steam Workshop",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1066780/header.jpg?t=1648670217",
    "Price": 39.99,
    "Developers": "Urban Games",
    "Publishers": "Good Shepherd Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_a6bb849ecc478467f2db7cf635c298dbc4fc686e.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_df1b847fe1ad0282cc78caae5694cfa4d6581868.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_b9c0034f6aa0cd88d0e0d6d4279f45e4c08456a8.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_f8d29baccb70a9118a09897a0159dfcf864d6033.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_b1fd04a855f5cb2a35d7d816b54ea81635a9ee9f.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_4d989afce867ca774adca249e783195109f62efc.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_16addbc44d2cc1ffd18159bd751fd89717481aa6.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_17eb178bd0d02a49ffe9c0a79bee1cb941a3f04d.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_f9bce48456f3466e0f00d11d26cff248c2456694.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_2daa5380ff04a3eaa7c835260e295b2ade6b50b0.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_529b088c415178dc9fde849227e2305e198faefe.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_241312417c4d9bdba5e5aa304d0aea0156149bac.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_a10a34c4af4b6f9fe7b3a901b72b8fba85e3868b.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_075b6206c41493fbb69b8c55d8ac0b830c45657d.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_931ee3a5c366bd6c3b330f16a6aa3d1a2ee88582.1920x1080.jpg?t=1648670217,https://cdn.akamai.steamstatic.com/steam/apps/1066780/ss_a42b000a4fe9925263b65fade7b3cf9fe96ccf11.1920x1080.jpg?t=1648670217",
    "Slug": "transport-fever-2",
    "Meta Title": "Transport Fever 2: Dec 11, 2019, Urban Games and Full Ove...",
    "Meta Description": "Looking for information on Transport Fever 2? Check out the release date (Dec 11, 2019), developer insights from Urban Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Transport Fever 2 game - Steam 1066780",
    "Canonical URL": "https://gusku.site/game/transport-fever-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Transport Fever 2\", \"description\": \"Looking for information on Transport Fever 2? Check out the release date (Dec 11, 2019), developer insights from Urban Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 11, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Urban Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Good Shepherd Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1066780/header.jpg?t=1648670217\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}