{
    "AppID": 427030,
    "Name": "Xuan-Yuan Sword: The Gate of Firmament",
    "Release date": "Feb 25, 2016",
    "About the game": "Synopsis: In ancient times long ago, in order to find his beloved missing daughter, the divine Jade Emperor opened the gates of heaven, allowing a direct connection between heaven and earth. This was done, so that worthy mortals could appeal to the Jade Emperor and obtain divine powers, to aid in the search of his missing daughter. However, this gift was exploited and taken advantage of, causing chaos in the mortal realm. The Nine Li Tribe became a cult that worshipped demons and practiced in the occult, divorcing themselves from the businesses of the mortal realm. Forces of evil suddenly arose, inciting wars across the continent, condemning people into a life of fears and sufferings. Emperor Zhuanxu feared the demon Chiyou would once again ravage the mortal realm. Limited by his own capabilities, he sought the help of the Queen of Huaxu, who once assisted Xuanyuan the Yellow Emperor in warding off the Otherworld with the Bell of Donghuang. Both Fuxi and Nuwa—the children of the Queen of Huaxu—also supported Emperor Zhuanxu in convincing the Queen, for they too could not bear to watch people suffer any longer. In the end, the gates to heaven were finally sealed with the powers of the Divine Artifacts combined. Since then, no mortals were able to ascend, nor were gods able to descend at will. This incident was later recorded down in history as “Juedi Tiantong.” Features: This latest entry broke new grounds in comparison with previous titles in the series, including: the new lighting system that better establishes moods, creating various atmospheric scenes; as well as facial animation and lip-sync systems, MVN motion capture system to elevate the quality standard of all characters in every aspect. These new technologies not only improve visuals but also game immersion, enabling the players to fully comprehend the behaviors and feelings of the protagonists. The battle system has been replaced with a real-time, encounter-based gameplay mechanism, making the battles more intense than ever. Improved returning features exclusive to the Xuan-Yuan Sword series include: the Urn of Spirit Infusion that enables demon-synthesis and equipment refinement; the Guardian System that allows your captured demons to fight on your side; and the Miracle System that grants additional attack buffs. A new “Battle Formation” system is also introduced in this latest entry, allowing for a richer and better gaming experience for the players.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/427030/header.jpg?t=1627366805",
    "Price": 14.99,
    "Developers": "DOMO Studio,SOFTSTAR ENTERTAINMENT",
    "Publishers": "SOFTSTAR ENTERTAINMENT",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/427030/ss_0ea3137ee4cc4a569d1dc61ac8776009bc5a0009.1920x1080.jpg?t=1627366805,https://cdn.akamai.steamstatic.com/steam/apps/427030/ss_ffa8dce76fcc83f9cc691a19f1fc53e82f696766.1920x1080.jpg?t=1627366805,https://cdn.akamai.steamstatic.com/steam/apps/427030/ss_e7bcd973f3e6f2cd9b6b47dba8c4f60602abdebd.1920x1080.jpg?t=1627366805,https://cdn.akamai.steamstatic.com/steam/apps/427030/ss_27a77b80d5d09bdf421a63ace0fb010882116831.1920x1080.jpg?t=1627366805,https://cdn.akamai.steamstatic.com/steam/apps/427030/ss_a3478cd3496756c7326a987e5a8578cbf8d539f4.1920x1080.jpg?t=1627366805,https://cdn.akamai.steamstatic.com/steam/apps/427030/ss_57db0735a6af109ae2e9e290b630d71e28f56ed9.1920x1080.jpg?t=1627366805,https://cdn.akamai.steamstatic.com/steam/apps/427030/ss_fc1ef5986482e73f7b88126158223b67cd5d7221.1920x1080.jpg?t=1627366805",
    "Slug": "xuan-yuan-sword-the-gate-of-firmament",
    "Meta Title": "Xuan-Yuan Sword: The Gate of Firmament: Feb 25, 2016, DOM...",
    "Meta Description": "Looking for information on Xuan-Yuan Sword: The Gate of Firmament? Check out the release date (Feb 25, 2016), developer insights from DOMO Studio,SOFTST...",
    "Alt Text Image": "Official header image for Xuan-Yuan Sword: The Gate of Firmament game - Steam 427030",
    "Canonical URL": "https://gusku.site/game/xuan-yuan-sword-the-gate-of-firmament",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Xuan-Yuan Sword: The Gate of Firmament\", \"description\": \"Looking for information on Xuan-Yuan Sword: The Gate of Firmament? Check out the release date (Feb 25, 2016), developer insights from DOMO Studio,SOFTST...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"DOMO Studio,SOFTSTAR ENTERTAINMENT\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SOFTSTAR ENTERTAINMENT\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/427030/header.jpg?t=1627366805\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}