{
    "AppID": 536690,
    "Name": "AENTITY",
    "Release date": "Apr 14, 2018",
    "About the game": "Can death be sleep, when life is but a dream, And scenes of bliss pass as a phantom by? To win this game, you must awake the artist in you. AENTITY is a visual playscape set in a calm unknown, where the primary aim is to have no aim... You are yourself, crafting imagery by exploring Plato’s cave. Be part of the infinite process of creation. The deeper you descend into a far, dreamlike state, more cryptic entities emerge. What is a good state of consciousness? Why are we truly doing what we are doing? Legend says the other side is made of blinding light. Fathom a way through the Elysian noise. You need to destroy a great many screens slowly filling the retina. Be the path, make a choice. On any true journey you grow a little. Ultimately, the game is about skilling visual composition, something one may use in the real world once in a while. Intuition is key. You have to move playfully to create appealing and mesmerizing pictures and moods. At its core, wanting is suffering. Be free for a while, just behold, see all the passing by. Out of confusion, as the way is, and the wonder, out of the chaos would come bliss. Someone in wonder watching its art, is the aim and the end. Experimental – In playing AENTITY you can put yourself in a higher state of consciousness often overlooked in our times. Free yourself from all extrinsic sense givers. Shift the frequency. Plethora – Simultaneously create your own pictures. You might stick them on the wall or send your friends a card. Surprise yourself. There is a myriad of creative possibility. As everything is constantly changing slightly, no two players or sessions will ever be able to craft exactly the same picture. Simple but hard – You create the colors by changing your position, the angle and the hue. But to compose something scintillating, it takes awareness, patience, and a sense of wonder. Any best way to succeed depends solely on the eye of the beholder. Peaceful – There is no time limit and it is impossible to get hurt or die. Non-linear – A synaptic, semi-linear groundwork to play with. Some humble fame – An interactive companion website, where you can view the 36 most upvoted player‘s shots, and further randomly, with their respective author's name.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/536690/header.jpg?t=1572808129",
    "Price": 9.99,
    "Developers": "ARQUOIA",
    "Publishers": "ARQUOIA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/536690/ss_059e1a6ae9ab6b74c813eb9ac77dfa5cde8d9d0e.1920x1080.jpg?t=1572808129,https://cdn.akamai.steamstatic.com/steam/apps/536690/ss_7ac4de5565fcf2dd7a269252bad00ea8ac6a0a41.1920x1080.jpg?t=1572808129,https://cdn.akamai.steamstatic.com/steam/apps/536690/ss_48f149a0e25da54dd0178604c942b0533bf60b9c.1920x1080.jpg?t=1572808129,https://cdn.akamai.steamstatic.com/steam/apps/536690/ss_3a9a16f1304b8762d35f2b1da145b1e0f43a3e4c.1920x1080.jpg?t=1572808129,https://cdn.akamai.steamstatic.com/steam/apps/536690/ss_60fad278b3cdb026b9f91a52359e1f306ead01de.1920x1080.jpg?t=1572808129,https://cdn.akamai.steamstatic.com/steam/apps/536690/ss_79f413ea8acdcfc3454b9f068620a71c49a1e0cd.1920x1080.jpg?t=1572808129,https://cdn.akamai.steamstatic.com/steam/apps/536690/ss_cd6204019696fe096953c703646c9149c899eef9.1920x1080.jpg?t=1572808129,https://cdn.akamai.steamstatic.com/steam/apps/536690/ss_d0d4087dea3c1d559289d9454239917dee1fdf70.1920x1080.jpg?t=1572808129",
    "Slug": "aentity",
    "Meta Title": "AENTITY: Apr 14, 2018, ARQUOIA and Full Overview",
    "Meta Description": "Looking for information on AENTITY? Check out the release date (Apr 14, 2018), developer insights from ARQUOIA, and a complete game summary.",
    "Alt Text Image": "Official header image for AENTITY game - Steam 536690",
    "Canonical URL": "https://gusku.site/game/aentity",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"AENTITY\", \"description\": \"Looking for information on AENTITY? Check out the release date (Apr 14, 2018), developer insights from ARQUOIA, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 14, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"ARQUOIA\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ARQUOIA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/536690/header.jpg?t=1572808129\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}