{
    "AppID": 1090590,
    "Name": "AlCHeMoS",
    "Release date": "Feb 15, 2022",
    "About the game": "AlCHeMoS is a single-player atomic Action/Exploration game set on molecular worlds based on real scientific data. In AlCHeMoS, you'll pilot a Proto-Atomic Shell - an atomic-sized device capable of collecting and combining subatomic particles - to discover the elements. KNOWLEGDE IS POWER Science is under threat from mysterious Dark Forces which have attacked our Elemental Archives, and only you can help! As a Proto-Atomic Shell Operator, your task will be to explore experimental environments to collect and combine protons, neutrons and electrons in order to rebuild the Elemental Archives. ENTER THE ATOMIC WORLD From your laboratory bench overlooking the Experimental Hutch, you'll remotely control the Proto-Atomic Shell after it is safely transported (via sample-changing robot) to the selected level. The action in AlCHeMoS takes place on molecular worlds: each level environment is created from real-world protein structure data. You will start at one end of the protein chain, and after gathering the required particles for the level, you must make your way to the other end of the protein chain for safe extraction of your Proto-Atomic Shell. DARK MATTER You'll need to keep your wits about you as you progress through each level. The forces of Dark Matter which attacked the Elemental Archives will evolve as you proceed, providing you with ever-increasing challenges. Beware undergoing Fusion with Dark Atoms as they develop more and more sophisticated methods of interrupting your progress! POWERFUL ABILITIES As you discover the elements, you'll unlock a variety of powerful atomic abilities for your Proto-Atomic Shell. Boost your movement abilities with jump, dash and quantum tunnel modules; take control of particles with a Beta unit to let you interchange between protons and neutrons; take the fight back to Dark Matter with an enemy-freezing gamma-ray emitter and the all-powerful Annihilator. FELXIBLE UPGRADES Pick the right tool for the job with fully-reconfigurable upgrades. Gain Quarks by completing side-objectives and use these Quarks to purchase upgrades for your Proto-Atomic Shell. Boost your speed and movement abilities; improve your energy regeneration and efficiency; gain resistance to radioactivity and much more. Upgrades can be freely reconfigured at any time from the main menu. CHALLENGE YOUR FRIENDS After beating your best time for a fully-complete level, why not challenge your steam friends to beat it? Steam-friends leaderboards are available for each level in the main menu! RAYMARCHED ENVIRONMENTS The atoms in AlCHeMoS are all rendered by completely custom raymarching: smoothly joined surfaces with no edges or vertices; reflections; volumetric fog; soft shadows; dynamic lighting; all this and more awaits you! Raytracing hardware is not required, though 4GB or more of video RAM is strongly recommended. IMMERSIVE DYNAMIC MUSIC AND SOUNDS AlCHeMoS features a dynamic sound track, with music that seamlessly reacts to the game state, and sound effects that stay in tune with the music! CUSTOMIZE YOUR LABORATORY WORKBENCH No Lab bench should be without an interactive ornament to keep you entertained while your experiment is running! Unlock a variety of pieces to take pride of place on your lab bench shelf, such as a 3-mode Lab Timer, a dynamically music-tuned service bell, an Albert Einstein Bobblehead, and more! GET INVOLVED Hooting Banana Studios is a solo-developer and AlCHeMoS is my first project. I'd love to hear from you! Links to the official AlCHeMoS Discord server and the Hooting Banana Studios Newsletter are in the main menu of both the free demo and the full game. WARNING This game may be unsuitable for people with photosensitive epilepsy or other photosensitive conditions. The game may induce simulator sickness in some people. Player discretion is advised.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1090590/header.jpg?t=1648896706",
    "Price": 11.99,
    "Developers": "Hooting Banana Studios",
    "Publishers": "Hooting Banana Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1090590/ss_31ecf3c961f78655c55077edbb3e20b47b6b9b62.1920x1080.jpg?t=1648896706,https://cdn.akamai.steamstatic.com/steam/apps/1090590/ss_9fa2237379f2bd768ce8f4010040d2b359bca784.1920x1080.jpg?t=1648896706,https://cdn.akamai.steamstatic.com/steam/apps/1090590/ss_51b209ded5777c2d4c16551bc5fb263764d07f98.1920x1080.jpg?t=1648896706,https://cdn.akamai.steamstatic.com/steam/apps/1090590/ss_bba55911820fa387fd3616fcbe82d003589e7f86.1920x1080.jpg?t=1648896706,https://cdn.akamai.steamstatic.com/steam/apps/1090590/ss_e7e730225602b04f3c8802e38cdff6c913636de9.1920x1080.jpg?t=1648896706,https://cdn.akamai.steamstatic.com/steam/apps/1090590/ss_901ec331f7c4611fa43f1955d9ff140463cb91e4.1920x1080.jpg?t=1648896706,https://cdn.akamai.steamstatic.com/steam/apps/1090590/ss_12d584380b687d145147a2f6101e00bdbcc7e10a.1920x1080.jpg?t=1648896706,https://cdn.akamai.steamstatic.com/steam/apps/1090590/ss_410d7a36c8660edca51004d45f8f05229d3e274e.1920x1080.jpg?t=1648896706,https://cdn.akamai.steamstatic.com/steam/apps/1090590/ss_04622615345a33b76a94befceb9b7cf6e8a8fa70.1920x1080.jpg?t=1648896706,https://cdn.akamai.steamstatic.com/steam/apps/1090590/ss_59935bdc3bf39cc80e6873da16a93c85a426229a.1920x1080.jpg?t=1648896706",
    "Slug": "alchemos",
    "Meta Title": "AlCHeMoS: Feb 15, 2022, Hooting Banana Studios and Full O...",
    "Meta Description": "Looking for information on AlCHeMoS? Check out the release date (Feb 15, 2022), developer insights from Hooting Banana Studios, and a complete game summ...",
    "Alt Text Image": "Official header image for AlCHeMoS game - Steam 1090590",
    "Canonical URL": "https://gusku.site/game/alchemos",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"AlCHeMoS\", \"description\": \"Looking for information on AlCHeMoS? Check out the release date (Feb 15, 2022), developer insights from Hooting Banana Studios, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hooting Banana Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hooting Banana Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1090590/header.jpg?t=1648896706\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}