{
    "AppID": 877810,
    "Name": "Anodyne 2: Return to Dust",
    "Release date": "Aug 12, 2019",
    "About the game": "Rescue A Mysterious Island From A Mind-Warping Plague Nano Dust infects the islanders of New Theland, distorting their emotions and desires. You play as Nova, a Nano Cleaner who must explore the island, seeking out the sick and shrinking inside their bodies to suction up the Dust. Anodyne 2: Return to Dust combines the thrilling scale and cinematic storytelling of 3D games with the tight design and easy-to-pick-up satisfaction of 2D Zelda-like adventures. With art that re-imagines the PS1 and N64 era, explore 3D cities, valleys, and wastelands then shrink into the varied 2D mindscapes of characters, from snowy, aurora-lit valleys to perilous volcanic construction sites! Features Jump, drive, and walk across gorgeous and haunting locales in 3D, speaking with strange and memorable characters. Vacuum up Nano Dust in 2D, suck up and fight enemies, all while overcoming mind-bending challenges related to the characters’ inner lives. Experience the thrilling and emotional story of Nova. Her destiny is clear: she is the Nano Cleaner who will save New Theland. But strange characters &amp; painful experiences will put her loyalty to the test... Choose where you want to go! The sweeping vistas of New Theland quickly open up to exploration. Access the outer reaches of New Theland by using magical Cards you will find on your journey. Transform into a car at will and quickly drive around the world. No need to call a horse! Fire your Spark to shrink into the bodies of the infected, explore the 2D Zelda-like dungeons within, and heal them. Enjoy the lush, dreamy and breathtaking 3D and 2D landscapes painted and pixeled by artist Marina Kittaka. Listen to over 50 new songs influenced by countless genres by Melos Han-Tani, perfectly fitting the varied landscapes of Anodyne 2. Play the newest game from the dream duo behind Anodyne 1, All Our Asias, and Even the Ocean. ESRB Rating E 10+. Content Warnings below. A Lush, Surreal Lo-fi 3D and 2D World Anodyne 2: Return to Dust uses modern technology to reimagine old 3D art of the PS1, PS2, and N64 era, as well as the 2D art of the GBA and SNES. Each area captures a strong visual mood, with new characters to meet and sights to see. If you like exploring beautiful places and experiencing dramatic stories - Anodyne 2's world is ready for you to explore! Do I need to play Anodyne 1? Nope! Similar to the Final Fantasy franchise, there's no need to play the original Anodyne to understand the story in Anodyne 2: Return to Dust, but longtime fans will find connections between the two! If you'd like to check out both, you may want to purchase the Franchise Bundle! / Russian Localization: Artyom Solomatin / Артём Соломатин (artsolomatin@gmail.com) Simplified Chinese Localization: Ada Wu / 一只小雨 ada.wuyu@gmail.com Japanese Localization: Yuki Hiraguchi, On Takahashi (takahashi@warlocs.com) French Localization: Kévin Malchere (kmalchere@warlocs.com) Brazilian Portuguese: deviantart.com/anemptysoul German Localization: Marcel Weyers, Steven Korkowsky (Tolma4 Team) -- Content Warnings (No Spoilers) Mild Horror, dead bodies, mild body horror, rare occasional language Content Warnings (Spoilers) Body horror: In the 'good ending' of the game, the character C Visionary opens its body up into a spiky dragon mouth. It's not bloody but it might be upsetting to some. Mild Horror, Dead Bodies: In a late-game area in the desert, talking to an upside-down creature takes you to an area where the art style is much different. If you play here long enough there's a short 'chase' sequence that's akin to horror games, also the atmosphere is a little spooky. There's also something looking like a dead body later with a gargoyle beast implied to be eating it. This entire sequence is skippable if you don't want 100%. If you do want 100%, you have to play everything in the sequence up to the chase (which can be skipped without seeing the dead body)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/877810/header.jpg?t=1630303429",
    "Price": 19.99,
    "Developers": "Melos Han-Tani,Marina Kittaka",
    "Publishers": "Analgesic Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/877810/ss_63df8e8ca11bb54e4791f5b253ccf888b8085a9b.1920x1080.jpg?t=1630303429,https://cdn.akamai.steamstatic.com/steam/apps/877810/ss_cd4d2aa116e07df529c8d50417503c9c77d006ec.1920x1080.jpg?t=1630303429,https://cdn.akamai.steamstatic.com/steam/apps/877810/ss_fa6dc72f7ad15c7920531f7cf33388d79ab97d7e.1920x1080.jpg?t=1630303429,https://cdn.akamai.steamstatic.com/steam/apps/877810/ss_dfff2aa61d5a4ee9d152f40e6168bf732a6227e0.1920x1080.jpg?t=1630303429,https://cdn.akamai.steamstatic.com/steam/apps/877810/ss_90336fd5be3d2e8dfe8c103ab9086ddfa1aa3b2e.1920x1080.jpg?t=1630303429,https://cdn.akamai.steamstatic.com/steam/apps/877810/ss_48f7a0f1a220bcbaa3129c9399b6b19e40ece785.1920x1080.jpg?t=1630303429,https://cdn.akamai.steamstatic.com/steam/apps/877810/ss_31979d9c961ffc21b2a4a13de1918801441fe637.1920x1080.jpg?t=1630303429,https://cdn.akamai.steamstatic.com/steam/apps/877810/ss_a61a2de502499b7894dc3f638bb2e0d83fe9c2a2.1920x1080.jpg?t=1630303429,https://cdn.akamai.steamstatic.com/steam/apps/877810/ss_00edca1f251f1fbf4f1f3bcc704eab03db762e73.1920x1080.jpg?t=1630303429,https://cdn.akamai.steamstatic.com/steam/apps/877810/ss_03e86737f18b28940fc5a8c042d18055047babb6.1920x1080.jpg?t=1630303429,https://cdn.akamai.steamstatic.com/steam/apps/877810/ss_5e307cd38d2cbb8c2105d7b5aa18ecc126c72c10.1920x1080.jpg?t=1630303429",
    "Slug": "anodyne-2-return-to-dust",
    "Meta Title": "Anodyne 2: Return to Dust: Aug 12, 2019, Melos Han-Tani,M...",
    "Meta Description": "Looking for information on Anodyne 2: Return to Dust? Check out the release date (Aug 12, 2019), developer insights from Melos Han-Tani,Marina Kittaka, ...",
    "Alt Text Image": "Official header image for Anodyne 2: Return to Dust game - Steam 877810",
    "Canonical URL": "https://gusku.site/game/anodyne-2-return-to-dust",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Anodyne 2: Return to Dust\", \"description\": \"Looking for information on Anodyne 2: Return to Dust? Check out the release date (Aug 12, 2019), developer insights from Melos Han-Tani,Marina Kittaka, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Melos Han-Tani,Marina Kittaka\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Analgesic Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/877810/header.jpg?t=1630303429\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}