{
    "AppID": 1142220,
    "Name": "Beat Aim - Rhythm FPS Shooter",
    "Release date": "Nov 1, 2019",
    "About the game": "Beat Aim Goal is simple: Unite Music and Shooter Games Trailer is slightly outdated. Here are few examples of what can be generated in-game. These maps are not included in base game but similar are available from Steam Workshop. Beat Aim is a rhythm game designed for FPS players with AI generated maps. FPS trainers like Kovaak and Aim Lab are fine but quickly become boring and repetitive. 2d games like osu! are nice but have limited content. BeatAim has been developed over last 2-3 years in my free time. After testing many solutions I've finally found the perfect one. Not only it is possible to open any music but also to deeply customize map generation and choose between infinite amount of difficulties . Every gameplay new map is randomly created based on the song. This makes reflex more important than memory - opposite to other rhythm games. Features Slowly Beat Aim is evolving from simple aim trainer to fully featured game: 4 targets types - click, slider (tracking aim), slider with invisible path, WASD arrows (to prevent players from using keyboard to shoot) 3 guns - 2 pistols and 1 LMG Difficulty slider - every map has infinite amount of difficulties, choose one to match your skill Monthly competitions with Patrons and $$$ to win: Esports League - based on leaderboard scores in Ranked mapsa Mapping League - every 2 weeks most popular maps go to Ranked pool Streamers League - our bot counts your viewer's watch time when streaming Beat Aim Progression system - earn Beat Coins by playing the game to unlock new guns Daily quests - earn special materials to craft new guns Transparent roadmap with your feature requests and bug reports from Discord VIP Features Now free for everyone! map generator - open any song (wav, ogg, mp3), configure 25+ parameters, background and visuals to create something amazing 2000+ Steam Workshop maps - share and download user's made maps powerful custom leaderboards - show off your skill by linking a YouTube video of your run to your leaderboard score Future As I own this project it will get better infinitely. Possibly upcoming multiplayer will be one of the most unique way of playing fpses in history. Up to you if I'll be able to create it :) Similar games: Aim Lab, Aim Gods, Kovaak, Osu, Beat Saber, Audica, Pistol Whip, Aimlab, Aimbeast, Aim Hero, AimGods, Audiosurf, McOsu, BPM: BULLETS PER MINUTE. Trailer Music 'Collides Remix' by Dysfunction_AL 'Dragon War' by Makai Symphony 'Who We Are' by Hans Atom Video itself is: 2019 - Licensed under Creative Commons Attribution-ShareAlike 3.0",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1142220/header.jpg?t=1658271857",
    "Price": 14.99,
    "Developers": "Kamyker",
    "Publishers": "Kamyker",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1142220/ss_a16ed41b2ae9a946c62d64725c9132523d0f233e.1920x1080.jpg?t=1658271857,https://cdn.akamai.steamstatic.com/steam/apps/1142220/ss_3a8c50127180d078340fa438071431316ade336f.1920x1080.jpg?t=1658271857,https://cdn.akamai.steamstatic.com/steam/apps/1142220/ss_d5fba4a51c2467322cb93547b70a3edd95db7aa7.1920x1080.jpg?t=1658271857,https://cdn.akamai.steamstatic.com/steam/apps/1142220/ss_703cf6e44c3b1db69bc0ad036d90cf6a5d50c63d.1920x1080.jpg?t=1658271857,https://cdn.akamai.steamstatic.com/steam/apps/1142220/ss_9266ee698d67c1da317d93292d52ae471e67fc05.1920x1080.jpg?t=1658271857,https://cdn.akamai.steamstatic.com/steam/apps/1142220/ss_285aac139fc1abd1f80a4803ff2b307a128a6516.1920x1080.jpg?t=1658271857",
    "Slug": "beat-aim-rhythm-fps-shooter",
    "Meta Title": "Beat Aim - Rhythm FPS Shooter: Nov 1, 2019, Kamyker and F...",
    "Meta Description": "Looking for information on Beat Aim - Rhythm FPS Shooter? Check out the release date (Nov 1, 2019), developer insights from Kamyker, and a complete game...",
    "Alt Text Image": "Official header image for Beat Aim - Rhythm FPS Shooter game - Steam 1142220",
    "Canonical URL": "https://gusku.site/game/beat-aim-rhythm-fps-shooter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Beat Aim - Rhythm FPS Shooter\", \"description\": \"Looking for information on Beat Aim - Rhythm FPS Shooter? Check out the release date (Nov 1, 2019), developer insights from Kamyker, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kamyker\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kamyker\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1142220/header.jpg?t=1658271857\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}