{
    "AppID": 21670,
    "Name": "Bionic Commando",
    "Release date": "Jul 28, 2009",
    "About the game": "The first true sequel to the classic 1988 Nintendo Entertainment System original, Bionic Commando sees the return of the bionically-enhanced Nathan 'R.A.D.' Spencer. Time has not been kind to Spencer: Five years after his heroic defeat of the Imperials, he has been betrayed by the government he swore to serve, imprisoned for crimes he didn't commit, and sentenced to death. On the very day of Spencer's execution, terrorists detonate a massive experimental weapon in Ascension City, unleashing an intense earthquake that has turned the city into rubble and wiped out its population. With the terrain in ruins and the city's air defense grid now in the control of a massive terrorist force whose goal remains unclear, the FSA have only one option left - a behind-the-lines assault. It's the perfect job for a Bionic Commando. Bionic Commando transposes the much loved swing-and-shoot gameplay of the 8-bit original onto a stunning 3D environment of towering buildings, suspended roadways and monorails, deep canyons and sheer rock faces, which are traversed using swinging, scaling, climbing and wall-walking techniques. Key Features: Use the bionic arm to swing between towering skyscrapers at breathtaking speed, hook onto distant objects, zip up on hanging girders and choose your own route through the game Gameplay that moves through horizontal and vertical environments - a 3D game that truly uses all three dimensions. Full multiplayer mode with rich stat-tracking to check whether you're a true commando or a lowly private Use the power of the bionic arm - and of next-gen physics - to realistically throw massive objects, pummel opponents, whip enemies into the air, or pull the landscape apart Arm yourself with a variety of weapons worthy of a Bionic Commando Starring Mike Patton, the former lead singer of Faith No More as the voice of Nathan Spencer Developed by Swedish studio GRIN, developers of the highly acclaimed Ghost Recon: Advanced Warfighter series for PC Bionic Commando takes advantage of the Steam Cloud by storing your save games in the cloud. Simply pick up where you left off when you log into your Steam account on any PC. Players who own both Bionic Commando and Bionic Commando Rearmed will enjoy access to three unlockables in Bionic Commando, including the 'Retro' Nathan 'R.A.D.' Spencer skin, a Prototype Weapon and a secret room in the Fissure level.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/21670/header.jpg?t=1644282932",
    "Price": 9.99,
    "Developers": "Capcom",
    "Publishers": "Capcom",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/21670/0000008814.1920x1080.jpg?t=1644282932,https://cdn.akamai.steamstatic.com/steam/apps/21670/0000008815.1920x1080.jpg?t=1644282932,https://cdn.akamai.steamstatic.com/steam/apps/21670/0000008816.1920x1080.jpg?t=1644282932,https://cdn.akamai.steamstatic.com/steam/apps/21670/0000008817.1920x1080.jpg?t=1644282932,https://cdn.akamai.steamstatic.com/steam/apps/21670/0000008818.1920x1080.jpg?t=1644282932,https://cdn.akamai.steamstatic.com/steam/apps/21670/0000008819.1920x1080.jpg?t=1644282932",
    "Slug": "bionic-commando",
    "Meta Title": "Bionic Commando: Jul 28, 2009, Capcom and Full Overview",
    "Meta Description": "Looking for information on Bionic Commando? Check out the release date (Jul 28, 2009), developer insights from Capcom, and a complete game summary.",
    "Alt Text Image": "Official header image for Bionic Commando game - Steam 21670",
    "Canonical URL": "https://gusku.site/game/bionic-commando",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bionic Commando\", \"description\": \"Looking for information on Bionic Commando? Check out the release date (Jul 28, 2009), developer insights from Capcom, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 28, 2009\", \"author\": {\"@type\": \"Organization\", \"name\": \"Capcom\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Capcom\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/21670/header.jpg?t=1644282932\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}