{
    "AppID": 1447330,
    "Name": "Born Race",
    "Release date": "Apr 5, 2021",
    "About the game": "Born Race is an action-adventure retro-style game about four sperms who wish to win the Most Important Race of Life. An odd adventure with a different story for each one of them. Challenges, exploration and puzzles are necessary for them to reach the ovum. Are you up to the challenge? Story Born Race – it is a funny game about Four Sperms who are the only survivors of the Most Important Race of Life. All the other sperms have died due to the mysterious Invisible Barrier, failing to reach the Birth Sun and fertilize it. They have no choice but to run to the ovum, otherwise they will die. So they need to compete with each other in this race. Along the way they will face several viruses, contraceptive methods and dangerous bosses who don’t want to let them be born. Diaphragm, Exterminators throwing spermicide, Morning-after Pills and a lot of viruses are just a few of them. The game also has several puzzles so you can go forward and explore each one of the levels. This way they advance and try to get to the Birth Sun. Actually, each of them takes a different path to arrive there. This means the story of your character will be different from one another as well. About the characters, Mike is a basketball player, Sammy is a cheerleader, Tommy is a computer nerd and Beth is a nurse. They all have different personalities, a personal development, distinct levels and a surprising ending. After all, are they going to work in these professions after fertilizing, being born and growing up as humans in the future? Play it and find out. Features: A Story For Each of the Characters: there are four sperms and unique stories so that you will be curious about how each one of them will progress on the game (and what their future will be like after they are born); Funny Story and Breakings of the Fourth Wall: the story has a humorous tone and they joke about being in a game. By the way, nobody respects Born Race game designer (unfortunately) and there is even a level called Condom, and yes, including different colors of it; Different Stages for Each Character: each sperm has stages with different puzzle resolutions. You start with Mike and then release the other three characters. Each of these new releases has the mechanics already learned and a new one that changes the whole game and the way to deal with the character's stage. Who imagined that pursuing birth would be so much fun? And to think that there are still 9 months later; Different Bosses: there are four unique and odd bosses! Your analysis is demanded to understand their weaknesses. They are all viruses or contraceptive methods trying to stop you. Notice that in real life they are used to prevent unwanted pregnancy, but here they are villains. It is all a matter of perspective; Infinite Lives and Checkpoints: keep calm because you are going to have infinite lives to try a lot of times. And every time you open a door, the progress is saved. Besides, once you reach a level you can access it at any time you want to pick up vitamins you haven’t collect; Indirectly the game is related to something involving sex but there is no pornography: rest assured, you will not see nudity, obscene acts or anything that could embarrass your father or mother. Everything here takes place inside a fictional human body and of course there is some artistic freedom to create without turning the game into a medical consultation. It would be boring, don’t you think? Social Media and Discord",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1447330/header.jpg?t=1653782758",
    "Price": 1.99,
    "Developers": "Fabiano Naspolini",
    "Publishers": "Fabiano Naspolini",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_461f9095b06600f0b3b3e29a304a0bcfa52ecffc.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_d0f2f6d9ad74118224bd6b41fc5223ab17c98928.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_86a6f2992cdea6a4aaf0d814d9d36befba81cb1a.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_249538c3e31a08c16f125398f7653e557c9e68fa.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_44c4c43c09bd46f2808f8ae5cbb1ac8697e9d7a1.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_c39b340e718512bb982a44958c2e3dddd2fcdaae.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_2c3d544cda911bf624af62df9ea214d2651cf996.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_e81e7c17518db1fe6176ea2698dc269385fe47a0.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_14c757b70d9e120df916dad34bfde4a6ea9ae30d.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_aeb618724ecd9ec03defb9b7d836ea4aebcc0f6a.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_ca20f672da5b5721048bcd4382b1bd52c1e4f532.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_69cac7e44ef29e51c379c750195a09ff26613df4.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_d7b42ed7d3fc2c020352b61489cb50201806c369.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_171034f1a05907cb8635f1e6ca202bd84b0f2d84.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_7c6e0c135a7650947e92cf37ae45cc8717c97fbc.1920x1080.jpg?t=1653782758,https://cdn.akamai.steamstatic.com/steam/apps/1447330/ss_cf8c8797c2b60ef3fc78c36e602cc4c1f7b2f7eb.1920x1080.jpg?t=1653782758",
    "Slug": "born-race",
    "Meta Title": "Born Race: Apr 5, 2021, Fabiano Naspolini and Full Overview",
    "Meta Description": "Looking for information on Born Race? Check out the release date (Apr 5, 2021), developer insights from Fabiano Naspolini, and a complete game summary.",
    "Alt Text Image": "Official header image for Born Race game - Steam 1447330",
    "Canonical URL": "https://gusku.site/game/born-race",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Born Race\", \"description\": \"Looking for information on Born Race? Check out the release date (Apr 5, 2021), developer insights from Fabiano Naspolini, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fabiano Naspolini\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fabiano Naspolini\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1447330/header.jpg?t=1653782758\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}