{
    "AppID": 802120,
    "Name": "Cellyon: Boss Confrontation",
    "Release date": "Oct 1, 2020",
    "About the game": "Cellyon: Boss Confrontation is a cooperative game, inspired by your favorite MMORPGs, where four players need to use strategy and skill to defeat a powerful boss in five to ten minute battles. Cellyon battles have been designed to be like Online Multiplayer RPG Boss encounters. Whether it's movement management or special techniques, character handling is instinctive and immediate. A customizable class system Your class offers a wide range of spells. Polish your ' build ' before the fight, so that it perfectly meets your expectations. Will you optimize it for tanking? healing? dps? Or will you create the hybrid class of your dreams? A myriad of customization options Customize your character to your taste. The more rewards you earn, the more character customization options you have. Combine armor pieces and colors as you like! Cellyon customization is not just about characters. Collect many cosmetic items such as sprays, portraits, totems...and much more! Skill and nothing but Skill Skip the traditional leveling and farming of MMORPGs for an experience based 100% on instance boss battle. Do not believe that raising your character's level or looting an epic sword can make your life any easier. In Cellyon: Boss Confrontation , all that matters is your reflexes, tactics, and team play. An Efficient matchmaking If your friends are not available to help you, our matchmaking system picks for you the players best suited to complement your talents. A world ranking to conquer Compete against players from all over the world and climb to the top of the rankings . You think you're the best? Prove it and claim the first place! The Cellyon: Boss confrontation PVE mode puts you face to face with the most dangerous beings on planet Hildra. Among them you will be able to face : Skain An accomplished swordsman and genius scientist, Skain believes you and your group has great potential: becoming his new guinea pigs! The mad scientist will use his alchemical knowledge to inject various toxic substances into you during battle. To avoid irreparable damage, you will have to purge those substances with other equally toxic substances. Are you sure getting into his lab was such a great idea? EL-29 EL-29 is a huge bomb, mounted on 4 powerful mechanical legs with incredible destructive capabilities. When you meet it, you may wonder who built such a death machine. But you will quickly have another thought: how to come out of this encounter in one piece. If you hope to survive the confrontation with this steel monster, you'll need to be able to control your movements...and juggle your fighting and demining skills. Between weapon passes, be sure to cut the right wire! Dumuzid What is Dumuzid? A wild beast? A nightmare creature armed with daggers as tall as you? In any case be assured of one thing: he spreads death and he wants yours. There are unexplained phenomena around Dumizid. Strange and dangerous planar rifts surround him and could become your best allies as well as your worst enemies. During the battle, keep an eye on the surroundings, the threats are all around you. Become the architect of your own version of Hell by taking control of Boss Confrontation's level editor. Rather than making you use a limited editor, we've decided to give you full control over the tool we use to create our bosses. With Cellyon: Boss Maker , the only limit is your imagination. Your editor, your fight Objectives, movements, boss's life, number of bosses, adds... everything is customizable . You wish to create a fight where Skain and El-29 unite to ruin the players' lives? It's possible. You've imagined a fight where the objective is to have the group fight a boss while standing on a spot on the map to harvest a resource you saw in your dreams? it's also possible! Would you prefer Dumuzid to be pink, move at lightning speed and do star-shaped area damage spells? That's obviously possible! Your conditions, your classes In addition to letting you create your own battles, Cellyon: Boss Maker also lets you control the conditions under which players will fight your bosses. The editor not only allows you to assign special classes to players who are brave enough to accept your challenge, but also allows you to create a class from A to Z for the players! Imagine your spells, define effects, shapes, limits, colors...the editor is your home, and you have absolutely all the keys! Share it! Once the creation of the battle is over, all that's left to do is challenge the whole world! Share your creation with the community via the Steam Workshop to let them experience your personal vision of danger. The future is grim for the heroes who will have to defend Hildra from the corrupt children of the god Cellyon. On the other hand, it will be bright for the players of Cellyon: Boss Confrontation! We've got a lot of new features coming up in the future! The Rift The competitive mode of Cellyon: Boss Confrontation, The Rift , puts your party face to face with a boss while another party battles the same opponent in a parallel universe. The first team to defeat the boss or the last to die wins the game. However, in The Rift players have a new ability: The Trance . The Trance allows you to project yourself into your opponents' universe and provides you with a palette of traps and obstacles perfectly designed to put obstacles in their way. New classes As time goes by, other Inurnim adventurers will step in to join your battles. Among them, the Sun Caster with its spore, plant and natural element based abilities. Also, the Steam Crusader , master of fire and steam, capable of burning his enemies and healing his allies. New bosses In the shadows your enemies prepare and will make themselves known soon enough. New bosses will be appearing very soon! And the best is yet to come!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/802120/header.jpg?t=1647508186",
    "Price": 17.99,
    "Developers": "Sentry Games",
    "Publishers": "Sentry Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_b8ce9f0d79a263f03096d96b70af0041a19a5df1.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_7bcf0bcc19527e77bd48d5944125ae13d0fe6c8e.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_05703958787abc2e965b7da1ad224aeeb63fb400.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_8dd8626544588be803c96f4d5a3a94d95935c9a2.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_85a677b6334df36c18bd72f72cdd95f6ba38f365.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_413934dd4a93010d356954b992d77a02e7c1ebad.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_845a8da3c2a369b639c85beddd84721e8099e61a.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_99202bc268a5452a3f75a89f2c690c704829698a.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_c5ab097030e97c7bf112f4f118f7036dcf0881f2.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_05112e6c67349db3f8ce0d12f8d02a2aed0fdf90.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_028e0727095b23c764475dca9d9e63b1771bd69e.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_1456760db23cb690bce9e35abca603cb600387f2.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_7b817f68e531fe4f9c0c6b0fe9ed486fd8bc8f42.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_77f6d2f0067ac8e21cc0bd6532da56e2ca555c8d.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_5fa995213d45fd8c2511983655f5bc8d8f9506af.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_83cf01ebfa9d501e7dcd82ccc2a28f19ed28a9df.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_f0032e3a6d6c904d5e3d1a12c5cb5b509cea5b64.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_fd3a27806c3c8b3cd550d72f6b706356fe58189b.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_424a71701795724288a885913656cbc7b8b3fcb5.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_7ace1464816cd3f3de47c4edd703adee768a615d.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_9f6859588020a4a52340216f96c3a1e96e0a2776.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_a660cc59081ef67c0d638d2683de7136d3a7d1c2.1920x1080.jpg?t=1647508186,https://cdn.akamai.steamstatic.com/steam/apps/802120/ss_4a5d80d9198806158b555d29716036b610c6de32.1920x1080.jpg?t=1647508186",
    "Slug": "cellyon-boss-confrontation",
    "Meta Title": "Cellyon: Boss Confrontation: Oct 1, 2020, Sentry Games an...",
    "Meta Description": "Looking for information on Cellyon: Boss Confrontation? Check out the release date (Oct 1, 2020), developer insights from Sentry Games, and a complete g...",
    "Alt Text Image": "Official header image for Cellyon: Boss Confrontation game - Steam 802120",
    "Canonical URL": "https://gusku.site/game/cellyon-boss-confrontation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cellyon: Boss Confrontation\", \"description\": \"Looking for information on Cellyon: Boss Confrontation? Check out the release date (Oct 1, 2020), developer insights from Sentry Games, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 1, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sentry Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sentry Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/802120/header.jpg?t=1647508186\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}