{
    "AppID": 766650,
    "Name": "D.R.I.L.L.",
    "Release date": "Jan 23, 2018",
    "About the game": "DynamixVR - D.R.I.L.L. is the first part of our VR wellbeing platform made available to the public. 'A sound mind in a sound body' they say, we concentrate on the latter now: move and exercise in an environment never before. No more routine, just fun. Ship the space cargo through the galaxy, protect it from pirates, defend your base while completing a pain-relief VR exercise specially good for your shoulders and upper back. Play and exercise D.R.I.L.L. is a space tower defense Virtual Reality game, where you'll experience a fun way to complete routine exercises. You're advancing in the game and trought the levels, while you move and that's the goal. Ship and protect your cargo from enemy space pirates, with physical activity. Create your own set of movements in the editor and let the program transform it into an exercise mission. Features Single player, story-driven physical exercise platform Upper-back and shoulder exercise program in VR Motion editor and recorder Move and Play TUTORIAL included in gameplay PLOT and How to play? Fifteen eclipse ago a rare magnetism based life form has arrived to this solar system. The volcanic planet Ogun was impossible to colonise for humans, but the new arrivals have found new home in its iron lava rivers. Human colonies with huge magnetic shields has managed to keep them away from habited areas, but in space Oguns are untouchable with their superior magneto ray and hyper jump technology. To contain this treat, the plans of a planetary magnetic quarantine has been worked out by the brightest scientists of mankind. The final and most devastating task is the delivery of the specially engineered magnetism reflective components to surrounding planets. Since all transportation attempts has failed no one dare to fly those space quarters anymore they call the 'lost space'. To handle the situation the Interplanetary Consulate has created a special space fighter group called D.R.I.L.L. Even if anyone who joins to this suicide unit will receive complete amnesty and a small fortune, still just the maddest and craziest criminals and mercenaries joined to direct response team. You are a Lieutenant Colonel of the Intergalactic Federation Army, and responsible for two D.R.I.L.L. squadrons defending both sides of a precious cargo ship passing through the lost space. You command the fleet through holographic simulation from the base station. When Ogun ships come out of hyper jump you have to keep the cross-hairs of the same side on their ship to target your fighters and electro shield to attack. This way you can delay the use of their most feared weapon: the magneto ray. Ones the magneto ray gun is initiated, there is only one hope for the cargo ship left: for a short period of time a fighter can block the havoc by flying his spacecraft directly into the deadly beam. In military slang it's called 'red-hot-hand'. You can order your squadron to this defence move by keeping the trigger squeezed on the controller of the particular side. Use red-hot-hand when, and only when the enemy is firing to avoid unnecessary casualties. That's all Lieutenant. You can fallow the moves and damages on the 3D map of the area below. Now may proceed with your mission. Bravery and God Speed! Press touch button for main menu. Squeeze trigger to start mission.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/766650/header.jpg?t=1516759064",
    "Price": 0.0,
    "Developers": "dfree",
    "Publishers": "VR-Reel Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/766650/ss_63950d03ac0306c10f7c8c1bf4e7745610f8431b.1920x1080.jpg?t=1516759064,https://cdn.akamai.steamstatic.com/steam/apps/766650/ss_9faa0d7c5b9e6f6dcd1080d347eba1a04fd61b47.1920x1080.jpg?t=1516759064,https://cdn.akamai.steamstatic.com/steam/apps/766650/ss_490f76bac7994d08e02da5f18a1ba6062d8cef99.1920x1080.jpg?t=1516759064,https://cdn.akamai.steamstatic.com/steam/apps/766650/ss_d577b9b223fbeaa7e7701d3f0f8446630b6b5c0e.1920x1080.jpg?t=1516759064,https://cdn.akamai.steamstatic.com/steam/apps/766650/ss_11ef5c1705512db74f7ce113fe759f7f84e285f2.1920x1080.jpg?t=1516759064,https://cdn.akamai.steamstatic.com/steam/apps/766650/ss_3b70f7dfc27b187ebb6301ae8983e3c15c4f2b44.1920x1080.jpg?t=1516759064,https://cdn.akamai.steamstatic.com/steam/apps/766650/ss_a3bbaea4c13446cf44cf71a8aaf9cf2a14a094e7.1920x1080.jpg?t=1516759064,https://cdn.akamai.steamstatic.com/steam/apps/766650/ss_0c24825b55d7b45dd98fd0907bb3f2cd16d2449a.1920x1080.jpg?t=1516759064",
    "Slug": "d-r-i-l-l",
    "Meta Title": "D.R.I.L.L.: Jan 23, 2018, dfree and Full Overview",
    "Meta Description": "Looking for information on D.R.I.L.L.? Check out the release date (Jan 23, 2018), developer insights from dfree, and a complete game summary.",
    "Alt Text Image": "Official header image for D.R.I.L.L. game - Steam 766650",
    "Canonical URL": "https://gusku.site/game/d-r-i-l-l",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"D.R.I.L.L.\", \"description\": \"Looking for information on D.R.I.L.L.? Check out the release date (Jan 23, 2018), developer insights from dfree, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 23, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"dfree\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VR-Reel Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/766650/header.jpg?t=1516759064\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}