{
    "AppID": 1961860,
    "Name": "- Doki Doki Family - 特異体質者のドキドキ家族生活",
    "Release date": "May 25, 2022",
    "About the game": "“Doki Doki Family' is a novel game in which the protagonist, who has a rare life-threatening condition, lives a sweet life with his adoptive big sister, adoptive little sister, and adoptive mother in order to treat it. A bishojo game released in 2018 under the brand 'Inkarose' has been remade for the 'CS Novel Club' platform so that it can be enjoyed by people of different ages all over the world. ◆Introduction --If we can't get your heart racing, you'll die, right? --Maybe it's just me, but you like us, don't you? 'So... I was to begin ''heart rate management'' therapy with my big sister, little sister, and mother...' ◆Synopsis Goro Kosaka has developed a rare condition that will kill him if he doesn't try to keep his heart rate up. Goro's adoptive family decides to use their bodies!? For Goro Kosaka, who would die if his heart stopped racing, so begins a sweet life where the heroines constantly shower the hero with love and affection morning, noon, and night. Mornings with the spoiled little sister... and school with the older sister who works as a teacher... and at home with the beautiful, nurturing mother... Spending everyday receiving 'heart rate management' therapy… such an extraordinary sweet life awaits! ◆Characters ・Suzune Kosaka 'The adoptive big sister. A teacher at Goro's school.' 'At school she comes off as strict, but at home, she is clumsy and forgetful. She enjoys keeping things tidy and her room is always kept clean and neat. ' ・Himari Kosaka 'The adoptive little sister. She attends a different school and loves her big brother, Goro. She is innocent, cheerful, and quite clingy.' 'She likes shoujo anime and manga, and her room is decorated with figurines. She just wants to be with the person she likes. Recently, she has been thinking of ways to shower Goro with her love and affection.' ・Sawa Kosaka 'The adoptive mother. She is a beautiful mother of two daughters who is quite nurturing and supportive.' 'Men cannot help but turn their heads when they see her walking down the street. Even though she is attractive, she dresses feminine and is concerned that she looks old.' ・Goro Kosaka 'The protagonist. He was adopted by the Kosaka family after his parents died in an accident.' A male student who has developed a rare condition. He needs to keep his heart pounding to stay alive. A rare condition!? Make my heart race or die!? Don't you like us? Goro's adoptive family decided to use their bodies!? With the adoptive big sister With the adoptive little sister With the adoptive mother An unbelievably sweet experience awaits!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1961860/header.jpg?t=1653541004",
    "Price": 19.99,
    "Developers": "CyberStep, Inc.,Rideon Works Co. Ltd,",
    "Publishers": "CyberStep, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1961860/ss_b5f9948369b71d47150b89f9b541f9dbfd582abf.1920x1080.jpg?t=1653541004,https://cdn.akamai.steamstatic.com/steam/apps/1961860/ss_f994f1b6ac714634e4ab2b0c34126e521a18d302.1920x1080.jpg?t=1653541004,https://cdn.akamai.steamstatic.com/steam/apps/1961860/ss_c06dfe60680babc519439c35e315f63c1ff2088f.1920x1080.jpg?t=1653541004,https://cdn.akamai.steamstatic.com/steam/apps/1961860/ss_793a78fd2719cac9e69e3d2d445ed4b62c33f007.1920x1080.jpg?t=1653541004,https://cdn.akamai.steamstatic.com/steam/apps/1961860/ss_bae3104d8b54f18908b3218d216962795eb05374.1920x1080.jpg?t=1653541004,https://cdn.akamai.steamstatic.com/steam/apps/1961860/ss_049a18653bd24edd55f3e95ef13865c3bc57855a.1920x1080.jpg?t=1653541004",
    "Slug": "doki-doki-family",
    "Meta Title": "- Doki Doki Family - 特異体質者のドキドキ家族生活: May 25, 2022, CyberS...",
    "Meta Description": "Looking for information on - Doki Doki Family - 特異体質者のドキドキ家族生活? Check out the release date (May 25, 2022), developer insights from CyberStep, Inc.,Rideo...",
    "Alt Text Image": "Official header image for - Doki Doki Family - 特異体質者のドキドキ家族生活 game - Steam 1961860",
    "Canonical URL": "https://gusku.site/game/doki-doki-family",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"- Doki Doki Family - \\u7279\\u7570\\u4f53\\u8cea\\u8005\\u306e\\u30c9\\u30ad\\u30c9\\u30ad\\u5bb6\\u65cf\\u751f\\u6d3b\", \"description\": \"Looking for information on - Doki Doki Family - \\u7279\\u7570\\u4f53\\u8cea\\u8005\\u306e\\u30c9\\u30ad\\u30c9\\u30ad\\u5bb6\\u65cf\\u751f\\u6d3b? Check out the release date (May 25, 2022), developer insights from CyberStep, Inc.,Rideo...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberStep, Inc.,Rideon Works Co. Ltd,\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CyberStep, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1961860/header.jpg?t=1653541004\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}