{
    "AppID": 1126300,
    "Name": "DragonClash",
    "Release date": "Apr 10, 2020",
    "About the game": "DragonClash is an exciting single-player card game of strategic dragon combat set in a war-torn, modern-day world. Each match offers a rich, RPG-lite experience, where you'll hatch a dragon, raise and develop it, and battle a ruthless rival out to steal your dragon egg - all in about 30-minutes! Features Multiple Playable Decks - Hatch and train a dragon using the Red Breather, Blue Adept, Silver Channeler, and Brown Mauler game decks. Dynamic Battles - Master deadly attacks and powerful gifts as you train your dragon from hatchling to elder wyrm. Ruthless Competition - Defeat rivals to challenge powerful nemesis dragons, each a unique boss encounter. Expandable Lairs - Improve your red, blue, silver, and brown dragon lairs, each with 12 levels of features to unlock. Milestones - Over 100 in-game badges to earn. Bonus! Free Content Expansion - The Black Crown New Deck - Defeat one of the game's challenging boss dragons to unlock the Red Mauler game deck. New Rival - Salia, an explosive Red Mauler, joins the roster of opponents. New Boss - Yanthas, The Black Crown, is the chosen of Oblivion. Prove yourself worthy and you may just attract his eye. New Game Board - A new game board, featuring Salia reclaiming her egg. New Milestones - Collect all of the Red Mauler milestone badges. After suffering centuries of war, pollution, and neglect, the dying spirit of Earth, known as Gaia, has called out to her last defenders in a desperate plea for life. Those defenders are dragons, each born from the destruction wrought by the human race and bound to the elemental weaves of Gaia. A savage red dragon may rise from nuclear fire, a shifty blue from the oil soaked oceans, a mad silver from the smog-filled skies, and a hungry brown dragon from the poisoned ground of a toxic waste dump. It was Gaia's hope that the dragons would be better than humanity and help reshape the world in elemental harmony, but the violence that manifested the dragons also gave rise to an entity known as Oblivion. Called 'the Great Father' by the dragons, his influence tainted the dragons at birth, driving them mad with a lust for war. Now the dragons not only battle humanity, but themselves. Ruthlessly hunting for the dragon eggs to satiate their endless hunger for power, the dragons wage an eternal struggle for dominance and the very soul of Earth. Gaia has called out to the last guardians. She has called out to you. Become the dragon and conquer all that oppose you to become the chosen 'Last Kin', and reshape the fate of Earth in your claw.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1126300/header.jpg?t=1629297904",
    "Price": 14.99,
    "Developers": "Warspider Entertainment, LLC",
    "Publishers": "Warspider Entertainment, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1126300/ss_e427e0652cf4ebcd6be8735c79170b2b1819cf0e.1920x1080.jpg?t=1629297904,https://cdn.akamai.steamstatic.com/steam/apps/1126300/ss_c926e7624cf9b7479956d4764ecfa8ad163a4579.1920x1080.jpg?t=1629297904,https://cdn.akamai.steamstatic.com/steam/apps/1126300/ss_6ace90de58ef51e0bbbd74f8bc388bddb3efece2.1920x1080.jpg?t=1629297904,https://cdn.akamai.steamstatic.com/steam/apps/1126300/ss_8795855043e53ff3e8a2ad2dc262e10f223a4906.1920x1080.jpg?t=1629297904,https://cdn.akamai.steamstatic.com/steam/apps/1126300/ss_8f4614ee330f70af7667b42b04f13db04748a6e5.1920x1080.jpg?t=1629297904,https://cdn.akamai.steamstatic.com/steam/apps/1126300/ss_7107d2ecb828c0a852d79c98113f861d5c5af5db.1920x1080.jpg?t=1629297904",
    "Slug": "dragonclash",
    "Meta Title": "DragonClash: Apr 10, 2020, Warspider Entertainment, LLC a...",
    "Meta Description": "Looking for information on DragonClash? Check out the release date (Apr 10, 2020), developer insights from Warspider Entertainment, LLC, and a complete ...",
    "Alt Text Image": "Official header image for DragonClash game - Steam 1126300",
    "Canonical URL": "https://gusku.site/game/dragonclash",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DragonClash\", \"description\": \"Looking for information on DragonClash? Check out the release date (Apr 10, 2020), developer insights from Warspider Entertainment, LLC, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 10, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Warspider Entertainment, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Warspider Entertainment, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1126300/header.jpg?t=1629297904\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}