{
    "AppID": 362310,
    "Name": "Dungeon League",
    "Release date": "Oct 31, 2018",
    "About the game": "The Dungeon Master has grown bored waiting to kill the next hero foolish enough to enter his dungeon. The answer? Invite all the heroes in the land and make a show of it! Dungeon League takes everything that is awesome about dungeon crawling and spews it out as ten minutes of chaotic, multiplayer, party-game action. Up to four All Stars take to the randomised dungeon to battle each other and hordes of enemies in a series of fast and competitive events. Enjoy the rapid progression of character growth as heroes gain new powers, snatch powerful items, and slay every monster in sight, all in order to come out on top as the champion of the Dungeon League. Pit hero against hero in either the two vs two Tournament, or the ever chaotic Battle free for all. The ultimate winner will be the first to claim three round victories. Rounds last last just two minutes so players will need to quick in order to dominate the current objective, annihilate the enemy team, loot every chest, and slay every monster. The Dungeon Master’s league has lured a powerful and bizarre cast of heroes to duke it out for supremacy. Luna, the shadow archer, moves unseen through the dungeon while slowing her enemies to a crawl with her frost arrows. Drake, the unhinged pyromancer, incinerates everything in his path with his deadly phoenix and can call down a meteor golem to do his bidding. Albert, the dreamy unicorn prince, prances through the dungeon evading enemies with his fairy blast, and bringing monsters under his control with his illustrious charm. Each round in the Dungeon League will have a different quest objective. It is through completing these objectives that each hero can earn points for their team. There are nine different objectives in the league. In Witches Eye the heroes must hold the eye to score points but at the same time the eye is also slowly killing them. Chicken Chase has teams fighting for control over chickens by carrying them back to their pen, but you can also play dirty and steal the enemy chickens. All of Dungeon League’s modes are available to play online. You can use the matchmaking system if you want to play against or with strangers, or setup a private lobby and lure some distant friends to their demise. Need a break from duking it out against human opponents? Grab some friends and run the procedurally generated death labyrinth known as Gauntlet. Everything is randomised, from the dungeon layout, to the monsters you fight, to the loot that is dropped, meaning no two runs will ever be the same. How deep you delve will determine your final score, with leaderboard placements awaiting those who truly master the Gauntlet. If you want the stakes to be raised from Gauntlet mode then Daily Dungeon has you covered. You get one attempt, with one hero, in the same dungeon as every other competitor. Leaderboards will display who is the master of the day while those that don’t place well can always try again the next day. The Dugout is more than just an intermission. Heroes gain experience based on how well they complete quests in addition to the monsters they have slain. Heroes that level up will be able to learn new skills at the trainer. Heroes will also be able to visit Zug’s shop to spend their gold on a variety of 70+ powerful and unique items. Don’t like what Zug has to sell? Try slipping her a few gold coins… Dungeon League has persistent unlockable items in the form of Trinkets. These can be new Cursors for the Dugout, Gravestones for when your hero dies, and a great number of in-game Emotes with which to taunt your foes.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/362310/header.jpg?t=1615955295",
    "Price": 9.99,
    "Developers": "Christopher Yabsley",
    "Publishers": "Christopher Yabsley",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/362310/ss_6d2d216b7a0b58f4de950c950e236e5124677189.1920x1080.jpg?t=1615955295,https://cdn.akamai.steamstatic.com/steam/apps/362310/ss_1ae288fb8b48f63e29376ac0ece827ef88c580cb.1920x1080.jpg?t=1615955295,https://cdn.akamai.steamstatic.com/steam/apps/362310/ss_482d78770510de445cda22f63f518825e4293343.1920x1080.jpg?t=1615955295,https://cdn.akamai.steamstatic.com/steam/apps/362310/ss_23d09e29aa8c6b7b354cf4f61143badcf43fc419.1920x1080.jpg?t=1615955295,https://cdn.akamai.steamstatic.com/steam/apps/362310/ss_a9bc1423fbf877f0225675175c07077e929d5f43.1920x1080.jpg?t=1615955295,https://cdn.akamai.steamstatic.com/steam/apps/362310/ss_6b853114afb9f03dafbf7817455a5a3b526bc6d1.1920x1080.jpg?t=1615955295,https://cdn.akamai.steamstatic.com/steam/apps/362310/ss_331be713bbbd6f0172094123c024e1e044adb0f4.1920x1080.jpg?t=1615955295,https://cdn.akamai.steamstatic.com/steam/apps/362310/ss_9a67df4370249cedb331d5c30e674739ddfd89c5.1920x1080.jpg?t=1615955295,https://cdn.akamai.steamstatic.com/steam/apps/362310/ss_dd22ea6131979e9acf1484c7db26f23ed095371d.1920x1080.jpg?t=1615955295,https://cdn.akamai.steamstatic.com/steam/apps/362310/ss_ef4ce9e32e7d2a6774538dc5604a6ef2cfc5a187.1920x1080.jpg?t=1615955295",
    "Slug": "dungeon-league",
    "Meta Title": "Dungeon League: Oct 31, 2018, Christopher Yabsley and Ful...",
    "Meta Description": "Looking for information on Dungeon League? Check out the release date (Oct 31, 2018), developer insights from Christopher Yabsley, and a complete game s...",
    "Alt Text Image": "Official header image for Dungeon League game - Steam 362310",
    "Canonical URL": "https://gusku.site/game/dungeon-league",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dungeon League\", \"description\": \"Looking for information on Dungeon League? Check out the release date (Oct 31, 2018), developer insights from Christopher Yabsley, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 31, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Christopher Yabsley\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Christopher Yabsley\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/362310/header.jpg?t=1615955295\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}