{
    "AppID": 1301100,
    "Name": "Forking Hell",
    "Release date": "Jul 1, 2020",
    "About the game": "Forking Hell (do you like the pun?) is a 3D casual arcade-simulation game where the player guides a forklift vehicle around a virtual warehouse and completes customer orders over the working days. Welcome to your new job You work in the Amazing Logistics warehouse, the robot powered e-commerce service of the future. Start by learning to drive a personalised forklift to get your driving licence. You will then begin your job as a forklift driver, collecting packages and delivering them to the truck through the working day. Be careful, the RUMBA-BOTS will zoom around the warehouse stocking up shelves and crashing into you, and could cause you to damage or break customer packages! You will work in different sections of the Amazing warehouse through multiple levels of gameplay, retrieving all sorts of products including office supplies, home furniture and decorations. Some items can easily be explode and be lost forever, while some items can just fall out of their crate. The game includes physics elements to add a challenge to the levels, and add to the simulation experience! Additional gamemodes and experiences Racing minigame: Race against the RUMBA-BOTS and ensure they cannot beat your powerful and speedy forklift throughout different warehouse courses! Live internet radios: Listen to your favourite internet stations live during the game to help get some fresh music live while progressing through your forklift career, including Bounce, Hive365, Simulator Hits, Simulator Radio and Truck Stop Radio. Oculus VR coming soon: We are developing an Oculus VR experience where players can literally sit in the driver's seat and become immersed in the experience! Twitch streaming minigame: We have implemented a cool minigame where streamers can play the game with their viewers and get them to influence gameplay by collecting the boxes with an easy setup! Single player experience Forking Hell is a wonderful little game to play solo as a way to escape reality and just chill out. The chaos of the RUMBA-BOTS combined with the semi-realistic physics helps give an arcade style to the simulation genre. The game is built with controller or keyboard/mouse input to support various play-styles and preferences. Based on a university prototype This product was originally planned and built as part of a university class by Louis Byers in 2020.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1301100/header.jpg?t=1646513919",
    "Price": 3.99,
    "Developers": "Louis Byers",
    "Publishers": "Louis Byers",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1301100/ss_4f1b1361dc26eb8cf6dfce3999d8fd135f1fc3c0.1920x1080.jpg?t=1646513919,https://cdn.akamai.steamstatic.com/steam/apps/1301100/ss_85f0c3137b44b98c0c23e10412fb5098049e8f3b.1920x1080.jpg?t=1646513919,https://cdn.akamai.steamstatic.com/steam/apps/1301100/ss_58b23cc9d111380b52dd4d92fbc596749fb72f56.1920x1080.jpg?t=1646513919,https://cdn.akamai.steamstatic.com/steam/apps/1301100/ss_bbb247c717794a673c5bcf7aec122864a3cbd1a0.1920x1080.jpg?t=1646513919,https://cdn.akamai.steamstatic.com/steam/apps/1301100/ss_3f65ddc7eba3ab3bc5cf1be4b23c66a7ad079efe.1920x1080.jpg?t=1646513919,https://cdn.akamai.steamstatic.com/steam/apps/1301100/ss_74cbefa18f3cf3eaaf190a1a4c6609e1fe4d6474.1920x1080.jpg?t=1646513919",
    "Slug": "forking-hell",
    "Meta Title": "Forking Hell: Jul 1, 2020, Louis Byers and Full Overview",
    "Meta Description": "Looking for information on Forking Hell? Check out the release date (Jul 1, 2020), developer insights from Louis Byers, and a complete game summary.",
    "Alt Text Image": "Official header image for Forking Hell game - Steam 1301100",
    "Canonical URL": "https://gusku.site/game/forking-hell",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Forking Hell\", \"description\": \"Looking for information on Forking Hell? Check out the release date (Jul 1, 2020), developer insights from Louis Byers, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 1, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Louis Byers\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Louis Byers\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1301100/header.jpg?t=1646513919\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}