{
    "AppID": 1755740,
    "Name": "侵入：源代码",
    "Release date": "Apr 28, 2022",
    "About the game": "'Inception: source code' is a pixel wind 2.5d-arpg dungeon exploration game. The game adopts a smooth and refreshing fighting style. You can use a variety of different weapons and bullet skills to explore and defeat the powerful enemies in the maze. In order to support smooth and refreshing combat and enjoy the stimulation generated by continuous collision in combat, the carefully designed skill system will be a very important combat system module in the game. Support bullet counterattack, bounce back! And produce a strong counterattack output! Skills and weapons have a high degree of interaction! With the continuous evolution of intrusion, it is only a matter of time before human intelligent firewall is broken. Human beings know that once the firewall is broken, the whole human civilization will return to the era of no electronic technology. At that time, all intelligent terminals and high-tech weapons will lose their function. If we only rely on traditional thermal weapons, no matter which civilization, mankind will become a real mole ant. For the first time, senior human leaders privately met with the leaders of the cyborg Parliament and several regional leaders of the zombie civilization, and reached a certain funeral agreement in violation of human rights, making the two civilizations provide assistance to the human intelligent firewall at the same time. By concentrating computing power, cyborgs greatly enhance the computing strength of the whole human intelligent firewall, and zombie civilization also introduces a large number of unconscious zombie nerve touch into the intelligent firewall through the terminals provided by cyborgs and humans, so as to block the penetration and damage of intrusion to the human firewall and win time for the three civilizations to jointly attack the intelligent firewall. After discovering that the algorithm of human firewall has been continuously strengthened, the leader of intelligent and mechanical civilization knows that intrusion can still defeat it under continuous evolution, but after all, it takes a very long time. The coalition forces of the three civilizations decided not to give intrusion the opportunity of continuous evolution. In order to shorten this time, the leader of intelligent and mechanical civilization also invested a lot of algorithm resources in this seesaw battle, Just let the invasion complete the evolution faster. This war without gunpowder smoke has entered a white hot state",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1755740/header.jpg?t=1651202914",
    "Price": 4.99,
    "Developers": "MaskCatStudio",
    "Publishers": "MaskCatStudio,DreamStep",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1755740/ss_19e385d1fe1dd65d84bcc8ff227ba1ab90007805.1920x1080.jpg?t=1651202914,https://cdn.akamai.steamstatic.com/steam/apps/1755740/ss_7bd51c6ebaf1970dbb379f8e411bec1b4d756249.1920x1080.jpg?t=1651202914,https://cdn.akamai.steamstatic.com/steam/apps/1755740/ss_6a93a843db7f7139fcc3480164a4bd72cb83f5af.1920x1080.jpg?t=1651202914,https://cdn.akamai.steamstatic.com/steam/apps/1755740/ss_9a00b05a3e6dcbd6e447a1dcea14de0e85434ae7.1920x1080.jpg?t=1651202914,https://cdn.akamai.steamstatic.com/steam/apps/1755740/ss_843b9139e4bdb95a0bfde113c40af6cd3be2ac4a.1920x1080.jpg?t=1651202914,https://cdn.akamai.steamstatic.com/steam/apps/1755740/ss_545e883418a2fbf12a02e352f0472d07158eee17.1920x1080.jpg?t=1651202914,https://cdn.akamai.steamstatic.com/steam/apps/1755740/ss_9cb7da0e385ec6a18c24f67f0f831e7faee7d856.1920x1080.jpg?t=1651202914,https://cdn.akamai.steamstatic.com/steam/apps/1755740/ss_3b58084c546332c0785267ee8400f063f05b70f3.1920x1080.jpg?t=1651202914",
    "Slug": "",
    "Meta Title": "侵入：源代码: Apr 28, 2022, MaskCatStudio and Full Overview",
    "Meta Description": "Looking for information on 侵入：源代码? Check out the release date (Apr 28, 2022), developer insights from MaskCatStudio, and a complete game summary.",
    "Alt Text Image": "Official header image for 侵入：源代码 game - Steam 1755740",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u4fb5\\u5165\\uff1a\\u6e90\\u4ee3\\u7801\", \"description\": \"Looking for information on \\u4fb5\\u5165\\uff1a\\u6e90\\u4ee3\\u7801? Check out the release date (Apr 28, 2022), developer insights from MaskCatStudio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"MaskCatStudio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MaskCatStudio,DreamStep\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1755740/header.jpg?t=1651202914\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}