{
    "AppID": 1783280,
    "Name": "Ghostlore",
    "Release date": "Apr 14, 2022",
    "About the game": "Ghostlore is an 'Eastpunk' Action-RPG where you fight monsters from Southeast-Asian folklore. Inspired by timeless classic ARPG's such as Diablo 2 and Titan Quest, Ghostlore features a detailed item and character customization system, procedurally generated maps, and beautiful 2D isometric art. The bloodthirsty Penanggal is a gruesome creature of with origins in Malay folklore. It comprises of nothing more than a disembodied head and dangling entrails. The Indonesian Babi Ngepet myth tells of sorcerors who sacrifice their humanity in order to become boar demons. The tales of Hungry Ghosts are superstitions brought over by Chinese immigrants - undead horrors cursed to remain forever hungry due to their greed in mortal life. Stories from the maritime region of Southeast-Asia are full of all manner of nightmarish, horrifying creatures. Are you brave enough to face them? Discover over 40 different enemies, each with their quirks and tactics to defeat based on their descriptions in folklore. Explore a procedurally generated world that takes inspiration from the developers' home country of Singapore, its two closest neighbours, Malaysia and Indonesia, and the rest of Southeast Asia. Players unfamiliar with the region will get to experience a culture that is underrepresented and rarely seen in other forms of media. Players who live in Southeast Asia will find plenty of things they recognize - such as the food! Collect and prepare various meals to boost your stats. Don't fight on an empty stomach! Ghostlore allows you to mix-and-match abilities from 3 out of 6 character classes to create your own unique hero. The 6 classes are: The Adept: Mystic warriors skilled in Martial Arts, honing their mind as well as their body. The Exorcist: Able to sense the spirit world with ESP and cast out evil spirits. The Feral: Fearless fighters bestowed with the power of blood magic and the ability to transform into a Weretiger. The Geomancer: Masters of the art of bending the elemental forces of Earth, Fire, Ice and Lightning to their will. The Hashashin: Shadowy assassins who rely on speed and stealth to take down opponents. The Sentinel: Keepers of the forest with the ability to communicate with animals. The Glyph system is where Ghostlore brings something truly new to the Action-RPG table. In your travels you will find Glyphs - magical symbols that you can inscribe onto your body to gain new powers. Each Glyph takes up space on your body (represented in game as a grid). As your level increases, so do the number of glyphs you can inscribe onto yourself. Here's where things get interesting: Compound glyphs are rare and special glyphs that use 5 normal glyph spaces, but grant additional bonuses to glyphs that are placed within their configuration. Plan your Compound Glyph layout in order to maximise stat bonuses! In Ghostlore, you can wield a variety of weapons prevalent in Southeast-Asian martial arts: The Kris or Keris - a blade with a distinctively wavy shape. It is a well-balanced weapon. The Bow and Arrow has been a staple of hunting since the dawn of time; apparently they come in handy with ghost-hunting as well! Parangs , also known as machetes, are cleaving blades with a wide arc. The deadly Kukri knives are the fastest attacking melee weapons in the game. The trusty Spear has the longest reach out of all the melee weapons. Finally, there are enchanted Talismans that can fly and give foes nasty papercuts. In addition, you can find and equip a variety of Amulets. Amulets are commonly sold in many parts of real world Southeast Asia as good luck charms. In the world of Ghostlore, their power is very, very real. Equipping the right Amulet for the situation can mean the difference between a glorious victory and an untimely demise. Local co-op multiplier lets you play with up to 4 of your friends on the same screen. The Shrine of Balance is an optional asynchronous multiplayer feature which lets you help other players by sending them equipment. You have better chances of good loot in return when they use your equipment. Steam workshop support allows you to customise your experience with mods from the community. /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1783280/header.jpg?t=1649952148",
    "Price": 19.99,
    "Developers": "Andrew Teo,Adam Teo",
    "Publishers": "AT-AT Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1783280/ss_eb98d84cc92ef7fe13b738953c30b9d22e8a3c4f.1920x1080.jpg?t=1649952148,https://cdn.akamai.steamstatic.com/steam/apps/1783280/ss_b7850aa3fe07da20ce9944c066e34f3de30d327e.1920x1080.jpg?t=1649952148,https://cdn.akamai.steamstatic.com/steam/apps/1783280/ss_9a558821b4fbc303455084746d7876ab6155db69.1920x1080.jpg?t=1649952148,https://cdn.akamai.steamstatic.com/steam/apps/1783280/ss_b211a22e9636bf3d5cadf654820b5a53d213ee5d.1920x1080.jpg?t=1649952148,https://cdn.akamai.steamstatic.com/steam/apps/1783280/ss_a09e643f3b116559b26bbf37a6c1111ba3eb4076.1920x1080.jpg?t=1649952148,https://cdn.akamai.steamstatic.com/steam/apps/1783280/ss_061c9af069220dbc4d90e5d456d6fddbccd8d14f.1920x1080.jpg?t=1649952148,https://cdn.akamai.steamstatic.com/steam/apps/1783280/ss_ca3f1981310f089b7b14aa736cf4c6acdb762e73.1920x1080.jpg?t=1649952148,https://cdn.akamai.steamstatic.com/steam/apps/1783280/ss_e8bd21fe3a0c96ff5adf1944eeb4f9a4bce9ccbe.1920x1080.jpg?t=1649952148,https://cdn.akamai.steamstatic.com/steam/apps/1783280/ss_9933382f2ccb5f8d3c40d4ba15794c43d4126d97.1920x1080.jpg?t=1649952148,https://cdn.akamai.steamstatic.com/steam/apps/1783280/ss_c78e7853830023495f4a2a52f9f62f8aa9627702.1920x1080.jpg?t=1649952148,https://cdn.akamai.steamstatic.com/steam/apps/1783280/ss_70c0cfbdb88430602880718118f8ab04dcc3a2c8.1920x1080.jpg?t=1649952148,https://cdn.akamai.steamstatic.com/steam/apps/1783280/ss_aa7a7ce6abcc626bd6203bd50f70a55c51642dc9.1920x1080.jpg?t=1649952148",
    "Slug": "ghostlore",
    "Meta Title": "Ghostlore: Apr 14, 2022, Andrew Teo,Adam Teo and Full Ove...",
    "Meta Description": "Looking for information on Ghostlore? Check out the release date (Apr 14, 2022), developer insights from Andrew Teo,Adam Teo, and a complete game summary.",
    "Alt Text Image": "Official header image for Ghostlore game - Steam 1783280",
    "Canonical URL": "https://gusku.site/game/ghostlore",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ghostlore\", \"description\": \"Looking for information on Ghostlore? Check out the release date (Apr 14, 2022), developer insights from Andrew Teo,Adam Teo, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Andrew Teo,Adam Teo\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AT-AT Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1783280/header.jpg?t=1649952148\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}