{
    "AppID": 1271850,
    "Name": "Grand Casino Tycoon",
    "Release date": "May 20, 2021",
    "About the game": "Welcome to Vegas! Grand Casino Tycoon is a fresh and colorful tycoon with unique puzzle elements. Design stunning casinos and lure in your guests by building what they love: Slots, gambling tables, buffets, bars, and yes, even toilets. But you can’t always pick your neighborhood… Different gambler types have different, sometimes opposite demands! Find out what your gamblers like: 1) Analyse their routine. 2) Craft a strategy to separate them by manipulating their decisions, lure them into different parts of your casino and make them enjoy their night out. It’s great, manipulate! 3) Keep them separated ;) 4) Fill your own pockets and profit, profit, profit! (You can even charge your guests for using the toilet. Consider this a valid option for point 4.) To manipulate your guests’ decisions you need to understand their routine. Observe, pick a strategy and make sure your shee- ehm guests behave the way you want. Example. Party folks always start with a drink. Put a bar close to the entrance to lure them away from the compulsive gamblers. Those like to start with a game on the slots. Put the slots on the opposite side . Voilà. Separation level 1 succeeded! Expand from here. Keep the gamblers separated and their satisfaction high! We heard you can even place security cameras to do some market research in your casino or place ads to subversively make your guests think they really need a drink now. Crowd control at its best. Try it and do whatever it takes to reach your goals! Build your casino from scratch and design your very own masterpiece. Pick from countless unique objects and create the casino your players dream of: Slot machines, 3 screen slot machines, curved screen slot machines, video poker, blackjack, roulette, craps, beer bars, wine bars, cocktail bars, different types of buffets, and lots of decorative objects including carpets and floor types to beautify your casino. Build Egyptian rooms, an Asian wing, playful corners, or a marble high stakes area. It is a sight to behold! Expand wisely, optimize your floorplan to accommodate the different desires of your esteemed guests. Research new technologies and place exciting new gambling machines and tables to improve your casino further. Build your legacy! Do you have what it takes to succeed in the challenging world of casino gambling? Be smarter than the rest, overcome challenges and be the casino owner your gamblers love! Challenging campaign with multiple casinos Each casino features different guest types that likes or dislikes each other Find a way to keep them all happy! Sandbox mode VIPs – special guests with snarky comments Extensive tech tree and strategy choices Countless gambling objects (Slot Machines, Poker, Roulette, Craps…) Even more additional objects (bars, restaurants, toilets, cameras, decorations, floor and carpet types, manipulation objects) Gambler routine system (happiness, hunger, thirst, booze, game preferences) Staff management (coffee waiters, bouncers) Diverse strategies to success Even charge your guests for using the toilet: profit, profit, profit!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1271850/header.jpg?t=1656081610",
    "Price": 17.99,
    "Developers": "stillalive studios",
    "Publishers": "Aerosoft GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1271850/ss_c70a20e2df5713db9eb9ce88ffd651553e2894c7.1920x1080.jpg?t=1656081610,https://cdn.akamai.steamstatic.com/steam/apps/1271850/ss_accfa1d50dd82cc33d685e675490c8a5eb0711a0.1920x1080.jpg?t=1656081610,https://cdn.akamai.steamstatic.com/steam/apps/1271850/ss_fe0973a8235ce4e649473a4bcc183ec22db8fc3a.1920x1080.jpg?t=1656081610,https://cdn.akamai.steamstatic.com/steam/apps/1271850/ss_def15598550522bda93d313ab2ed9a9a6106599a.1920x1080.jpg?t=1656081610,https://cdn.akamai.steamstatic.com/steam/apps/1271850/ss_76c807417281343f41392ca8c3d7a0fe445e5f8a.1920x1080.jpg?t=1656081610,https://cdn.akamai.steamstatic.com/steam/apps/1271850/ss_31d640fa1ccdf2234dcc512cf2cbf5b05dda796f.1920x1080.jpg?t=1656081610,https://cdn.akamai.steamstatic.com/steam/apps/1271850/ss_fd32f8a5f5219b1c9271ca86d5c55b30a34a6b42.1920x1080.jpg?t=1656081610",
    "Slug": "grand-casino-tycoon",
    "Meta Title": "Grand Casino Tycoon: May 20, 2021, stillalive studios and...",
    "Meta Description": "Looking for information on Grand Casino Tycoon? Check out the release date (May 20, 2021), developer insights from stillalive studios, and a complete ga...",
    "Alt Text Image": "Official header image for Grand Casino Tycoon game - Steam 1271850",
    "Canonical URL": "https://gusku.site/game/grand-casino-tycoon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Grand Casino Tycoon\", \"description\": \"Looking for information on Grand Casino Tycoon? Check out the release date (May 20, 2021), developer insights from stillalive studios, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"stillalive studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aerosoft GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1271850/header.jpg?t=1656081610\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}