{
    "AppID": 2014980,
    "Name": "Heart Lake心湖",
    "Release date": "Jun 16, 2022",
    "About the game": "'I have ten friends, ten family members, ten are me, and I'm not alone.' 'It's our daily life, we're just here peacefully living the life we ​​want.' 'I don't want to lose anyone, anyone in my family, everyone here ... is so important to me.' The story does not involve any painful memories of Lin Yi, but mainly shows the daily life of Lin Yi and each personality in the inner world. ◇About experience◇ This is a role-playing first-person-view-pixel-style game that includes an online virtual-pixel museum, adding a little bit of gameplay to the experience. By controlling the online Virtual Museum tour, players accidentally come to one small space after another, experiencing their relaxed and happy daily life in the special inner spiritual world of the protagonists. Changes in the internal world are often related to real-world experiences, but this book only describes some of the internal world of the daily story, but also hope you see what you see, see what you don't see, hear what you hear, hear what you don't hear. ◇About the characters◇ Pixel image Lin Yi Initial personality / main personality, gentle and introverted, cautious, cherish every family member. Lin Qi The first child personality, the first to emerge, the longest-lived, is responsible for sustaining the trauma. Appeared when Lin Yi was subjected to domestic violence, bearing the pain and carrying painful memories instead of Lin Yi. Lin Sen The first guardian personality, Lin Yi's brother, the main guardian personality, knows the personality system well. Shortly after Lin Yi's younger brother Lin Yi was born, he was beaten and scolded by his father. When Lin Yi was young, he longed for someone to stand up and protect himself, and Lin Sen was born. Mute Quiet, peaceful, friendly, caring for family, assertive, unable to speak, communicates with others through sign language. Appeared when Lin Yi was scolded by her father and mother and asked her to shut up, to bear verbal scolding for Lin Yi, and was a depression holder. Song Yutang The second child personality, the inner self-help personality, the ideal childhood, is the first social personality - Song Xian's younger brother. Appears when Lin Yi is playing with her childhood playmates, preserving Lin Yi's happy and happy memories, living Lin Yi's ideal life, and other personalities in the personality system are also protecting her from harm. Song Xian Gentle, have their own opinions, know what they want and don't want, don't like being defined by others, don't care about other people's eyes. The first social personality, Song Xian, can play the piano and work instead of Lin Yi in school. She was born when Lin Yi was bullied by her classmates at school and did not want to go to school or communicate with others. It is a personality that is completely opposite to Lin Yi's own personality, origin and many other aspects. Song Xian's parents are very supportive of Song Xian's music dream, and it was his mother Wei Ruqing who discovered Song Xian's singing talent by chance, and asked a teacher to teach Song Xian to sing and teach him about music theory since he was a child. The mouse is a border shepherd puppy with black and white patterns that Song Xian raised when he was 17 years old. Dragonfly Lin Yi, who was alone in the room after suffering, recalled how carefree he was when playing with his playmates outside. Lin Yi wanted to become as free as a dragonfly, to have simple happiness, and to fly away from himself. Noisy and restless families live by the quiet and warm waters, from which dragonflies are born. It was born when Lin Yi was bullied by classmates and had the idea of ​​not going to school and not wanting to communicate with others. Pei Qiubai The second guardian personality, gentle, kind, and understanding. In place of the image of a music teacher, he is good at playing the piano. After Lin Yi's piano enlightenment teacher resigned, she was born to make up for the lack of care in her heart. The image of her sister protects Lin Yi in her own way. Pianoforte The sub-personality, the personality that stays only in the inner world, is keen on playing the piano and is taciturn. A personality created at the moment Lin Yi's music box was smashed. Wei Ruqing Child personality, mother role. She is the mother of the first social personality - Song Xian and the second child personality - Song Yutang. After his parents divorced, Lin Yi was sentenced to his mother, who was very harsh on Lin Yi. Lin Yi longed for maternal love and hoped to have a mother who could truly love her. Wei Ruqing was born out of this desire. Yu Feng The second social personality, Yu Feng, is a tough and straightforward character. Born when Lin Yi first entered the workplace, because his colleagues looked down on Lin Yi's rural background, he often gossips behind his back, and sometimes imposes his job on Lin Yi. When Lin Yi is not good at rejecting others, he will appear instead of Lin Yi, frankly address other people's mistakes, and simply reject others' requests. ◇About the operation◇ Contains automatic archiving. It can be operated in both mouse and keyboard mode, and it is recommended to use the keyboard as the main method. Arrow keys - manipulate the character to move Z key/Enter/Space - confirm X key/Ese - menu key/Cancel/Return Shift key - control the current character to run All items in the space can be dialogued, and important clues and props will have special prompts, and dialogue can advance the plot. ◇About the process◇ It mainly focuses on watching a few short stories, without puzzle solving or too many small game elements. The overall flow of the game is about 30~60 minutes The ending is an open ending, and the plot contains only one line.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2014980/header.jpg?t=1655373820",
    "Price": 0.0,
    "Developers": "心湖制作组",
    "Publishers": "心湖制作组",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2014980/ss_69d929d825f859c1d1fcca412f474e13fc320cc1.1920x1080.jpg?t=1655373820,https://cdn.akamai.steamstatic.com/steam/apps/2014980/ss_723d5f7958b9f111533e50b8763a9c197df409e5.1920x1080.jpg?t=1655373820,https://cdn.akamai.steamstatic.com/steam/apps/2014980/ss_91d9a4879b4feccf44878cf32b29d3d709d4c08d.1920x1080.jpg?t=1655373820,https://cdn.akamai.steamstatic.com/steam/apps/2014980/ss_1af4da6ba523dcc35b863c5580169658cfb85440.1920x1080.jpg?t=1655373820,https://cdn.akamai.steamstatic.com/steam/apps/2014980/ss_c36f32e859ce9d692efaf1410cf26c4a290b4cf1.1920x1080.jpg?t=1655373820,https://cdn.akamai.steamstatic.com/steam/apps/2014980/ss_f933d4b637d97d0ee337de61e74259de5a52527b.1920x1080.jpg?t=1655373820,https://cdn.akamai.steamstatic.com/steam/apps/2014980/ss_3c2d3b2415d862a24139f14485ccd4f2c2cb7870.1920x1080.jpg?t=1655373820,https://cdn.akamai.steamstatic.com/steam/apps/2014980/ss_a7f952376c13187871273e1678caa7142acfcccc.1920x1080.jpg?t=1655373820,https://cdn.akamai.steamstatic.com/steam/apps/2014980/ss_b13c896e86f9accef6665b38d6de6d124d9ea00a.1920x1080.jpg?t=1655373820,https://cdn.akamai.steamstatic.com/steam/apps/2014980/ss_764a6fdaa672422eda5edaeade928fd1ef98c123.1920x1080.jpg?t=1655373820",
    "Slug": "heart-lake",
    "Meta Title": "Heart Lake心湖: Jun 16, 2022, 心湖制作组 and Full Overview",
    "Meta Description": "Looking for information on Heart Lake心湖? Check out the release date (Jun 16, 2022), developer insights from 心湖制作组, and a complete game summary.",
    "Alt Text Image": "Official header image for Heart Lake心湖 game - Steam 2014980",
    "Canonical URL": "https://gusku.site/game/heart-lake",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Heart Lake\\u5fc3\\u6e56\", \"description\": \"Looking for information on Heart Lake\\u5fc3\\u6e56? Check out the release date (Jun 16, 2022), developer insights from \\u5fc3\\u6e56\\u5236\\u4f5c\\u7ec4, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u5fc3\\u6e56\\u5236\\u4f5c\\u7ec4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u5fc3\\u6e56\\u5236\\u4f5c\\u7ec4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2014980/header.jpg?t=1655373820\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}