{
    "AppID": 844660,
    "Name": "Heart of the Woods",
    "Release date": "Feb 15, 2019",
    "About the game": "Heart of the Woods is a fantasy yuri visual novel about paranormal investigation, ancient mysteries, and a love between two girls that transcends life and death. Maddie Raines has had enough. After years of serving as manager, editor, and general business-handler for her best friend Tara's popular paranormal vlog channel, she's finally ready to move forward with her own life. But when she agrees to take one last trip with Tara to the mysterious village of Eysenfeld, she's suddenly swept up in a dangerous supernatural crisis that will change the course of both of their lives forever. A strange young woman named Morgan has promised them undeniable proof of real paranormal phenomena, and what she has to offer eclipses anything they’d ever seen before. However, out of all the strange occurrences the three of them bear witness to, one in particular captivates Maddie in a way she’s never been before: the ghost of a young woman. This woman is Abigail, the victim of a centuries-old injustice now bound eternally to the forest surrounding Eysenfeld. Drawn to Maddie in a way she can’t explain, Abigail reveals herself to another person for the first time in more than 200 years. While Tara and Morgan investigate the mysteries surrounding the village itself, Maddie begins to form a bond with Abigail that grows to be more intense than any bond she’s felt before. As she learns the truth about Abigail’s death and imprisonment, she realizes that it falls to her and her friends to break the curse that has ruled over Eysenfeld for centuries. But more importantly than that, it falls to her to finally free the woman she loves. A part-time manager, part time video editor, and full-time babysitter, Maddie has the thankless job of handling the absolute whirlwind that is her best friend. She’s professional, meticulous and intellectual; the first person to turn to when a problem needs solving. But when their investigation entangles her in an ancient curse, she's forced to confront phenomena beyond her comprehension, and more importantly, her own self doubt. For the last two centuries, the ghost of a young woman has haunted the forests of Eysenfeld. That ghost is Abigail, a kind and playful soul forcibly bound to the forest as part of an ancient curse. Two hundred years of wishing for a life cruelly denied to her have led to a feeling of crushing loneliness and one overwhelming desire: to finally have someone to talk to. One of the world’s most popular paranormal vloggers (according to her), Tara is unfailingly charismatic and bursting with limitless energy. She’s brash, intrepid, and always seeking something new. That often makes her a magnet for trouble: whether it’s from relentless flirting, minor criminal activities or just plain pig-headedness, things around Tara have a tendency to end in chaos. A loyal Taranormal viewer and the daughter of Eysenfeld’s mayor, Morgan is...different. When not running her small and mostly empty antique shop, she’s known to disappear into the woods for days at a time. That, combined with her resistance to traditional social standards, has caused her to develop a bit of a notorious reputation in the village. However, this resistance is not just an act of rebellion: Morgan knows that there’s something sinister deep within Eysenfeld, and she’s not going to stop until she tears it out at the roots. Incredible character and CG art from Rosuuri Full English voice acting Approximately 130,000 words with multiple endings Fully original backgrounds and soundtrack Ending theme from In Love With A Ghost Multiple accessibility options Steam trading cards Extra features including a music room, CG viewer, and guest art gallery At least one really, really gay ghost A full Simplified Chinese translation! 《森灵之心（Heart of the Woods）》正式更新了官方简体中文，感谢白衣汉化组提供的汉化支持。各位玩家可以进入游戏主菜单的选项来选择中文语言啦。 Maddie Raines - Allie Goodell Abigail - Heidi Tabing Tara Bryck - Stephanie 'Teffi' Arata Morgan Fischer - Kira Buckland Evelyn Fischer - Tara Langella Fairy Queen - Emaline Tuck Fairies - Anairis Quinones, Lisa Reimold, Tina Kim",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/844660/header.jpg?t=1610483321",
    "Price": 14.99,
    "Developers": "Studio Élan",
    "Publishers": "Sekai Project,Studio Élan",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/844660/ss_cf81ad286726455bda2f71fd05e0616da0233a90.1920x1080.jpg?t=1610483321,https://cdn.akamai.steamstatic.com/steam/apps/844660/ss_19d3c8d716c64b87f9492d65d35108a2b8cd625d.1920x1080.jpg?t=1610483321,https://cdn.akamai.steamstatic.com/steam/apps/844660/ss_f6959382e868dfe605acb38c02578be32de206cc.1920x1080.jpg?t=1610483321,https://cdn.akamai.steamstatic.com/steam/apps/844660/ss_5ff34bb53897268020235eb0ef811c1e059fdb88.1920x1080.jpg?t=1610483321,https://cdn.akamai.steamstatic.com/steam/apps/844660/ss_2a0b728615dd07e5914c2b576a481ffe9cab9298.1920x1080.jpg?t=1610483321,https://cdn.akamai.steamstatic.com/steam/apps/844660/ss_afbc5d4aae4b83d1f7f54df7fb9669cbef59e6e4.1920x1080.jpg?t=1610483321,https://cdn.akamai.steamstatic.com/steam/apps/844660/ss_343db0995976266b34f5749af5218ad2b1305f45.1920x1080.jpg?t=1610483321,https://cdn.akamai.steamstatic.com/steam/apps/844660/ss_d5b2f9b0dc9408ed3609b4c8415e36ea63ea13d1.1920x1080.jpg?t=1610483321",
    "Slug": "heart-of-the-woods",
    "Meta Title": "Heart of the Woods: Feb 15, 2019, Studio Élan and Full Ov...",
    "Meta Description": "Looking for information on Heart of the Woods? Check out the release date (Feb 15, 2019), developer insights from Studio Élan, and a complete game summary.",
    "Alt Text Image": "Official header image for Heart of the Woods game - Steam 844660",
    "Canonical URL": "https://gusku.site/game/heart-of-the-woods",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Heart of the Woods\", \"description\": \"Looking for information on Heart of the Woods? Check out the release date (Feb 15, 2019), developer insights from Studio \\u00c9lan, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 15, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio \\u00c9lan\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sekai Project,Studio \\u00c9lan\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/844660/header.jpg?t=1610483321\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}