{
    "AppID": 594650,
    "Name": "Hunt: Showdown",
    "Release date": "Aug 27, 2019",
    "About the game": "HUNT TOGETHER. DIE ALONE. The year is 1895, and you are a Hunter tasked with eliminating the savage, nightmarish monsters that have infested the Louisiana Bayou. Play alone or in teams of two or three, as you search for clues to help you track your target and compete against other Hunters who are after the same reward. Kill and banish your target, collect the bounty, and then get ready for the showdown; once the bounty is in your hands every other Hunter on the map will be after your prize. Show no mercy as you fight through a dark, ruthless world with brutal, period-inspired weapons, as you level up, unlock gear, and collect experience and gold for your Bloodline. HIGH-RISK, HIGH-REWARD, HIGH-TENSION GAMEPLAY Competitive, match-based gameplay combines PvP and PvE elements to create a uniquely tense PvEvP experience where your character and your gear are always on the line. Succeed, and you will be rewarded handsomely but remember – a single mistake could cost you your Hunter – and any gear they were carrying. BOUNTY HUNT MODE Team up or go it alone to battle monsters, bosses, and other Hunters to secure the bounty in Bounty Hunt, the game’s main PvPvE mode. Play alone or in teams of two or three with up to 12 players on the map Use Dark Sight to collect clues and track your target Fight brutal creatures and deadly monsters – and the other Hunters who are competing for the same prize Be the first to find and take out the target and collect your reward Get to an extraction point without being killed by those who seek to steal the bounty Live to die another day QUICK PLAY MODE In this shorter mode, solo players compete to be the last Hunter standing. Play solo in a shorter match format against up to 12 other solo players Scavenge for gear Be the first to find and close four rifts in a competition for a diminishing pool of bounty Close the last rift and absorb all its energy -OR- compete to eliminate the leading Hunter to steal their reward Survive the final countdown to complete the mission Last Hunter standing keeps their Hunter - while the others perish, and are lost TRIALS AND TRAINING MODE Prepare for the thrill of the hunt in the game’s Trials and Training modes. These provide a pure PvE experience for honing your skills and maximizing your chances of taking home the bounty. Explore any map without the pressure of a Hunter ambush Sharpen your skills and practice you kills Complete Trial objectives testing your speed, strength, and sniping skills Walk in the shoes of the notorious Hunters who came before you SPECIAL FEATURES: PROGRESSION &amp; DARK SIGHT Progress through the ranks via your Bloodline, which allows you to level up your Hunters. Though a Hunter may die, some experience will always be transferred to your Bloodline, which over time unlocks new weapons and specializations for your other Hunters. Dark Sight allows Hunters to see the unseen by helping you to track clues with a ghostly light and marking players carrying a bounty.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/594650/header.jpg?t=1658736563",
    "Price": 19.99,
    "Developers": "Crytek",
    "Publishers": "Crytek",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/594650/ss_ecccaab1143081ca96d8bf00d8b1c4d3d3291e64.1920x1080.jpg?t=1658736563,https://cdn.akamai.steamstatic.com/steam/apps/594650/ss_36f6d959f75d1cca48c2a98d892d2697f6d4bde6.1920x1080.jpg?t=1658736563,https://cdn.akamai.steamstatic.com/steam/apps/594650/ss_f2a2d3445a568c0748aca08a44f45ceac4810cb4.1920x1080.jpg?t=1658736563,https://cdn.akamai.steamstatic.com/steam/apps/594650/ss_021db5b59b2108a69fa710164b97e58cfaada03c.1920x1080.jpg?t=1658736563,https://cdn.akamai.steamstatic.com/steam/apps/594650/ss_4697d48347130eaf48e03e92556252f6b8744428.1920x1080.jpg?t=1658736563,https://cdn.akamai.steamstatic.com/steam/apps/594650/ss_5d14f045ac48f8aa8ccd643a1db7e83a0c384fba.1920x1080.jpg?t=1658736563,https://cdn.akamai.steamstatic.com/steam/apps/594650/ss_96b76906c12136d782e755a4ee85235826ef40fe.1920x1080.jpg?t=1658736563,https://cdn.akamai.steamstatic.com/steam/apps/594650/ss_0eb340c35e5765530907b9aa49f98b8fe5b47534.1920x1080.jpg?t=1658736563,https://cdn.akamai.steamstatic.com/steam/apps/594650/ss_73a09984fc936bd31349b540147fa85bd35cd84c.1920x1080.jpg?t=1658736563",
    "Slug": "hunt-showdown",
    "Meta Title": "Hunt: Showdown: Aug 27, 2019, Crytek and Full Overview",
    "Meta Description": "Looking for information on Hunt: Showdown? Check out the release date (Aug 27, 2019), developer insights from Crytek, and a complete game summary.",
    "Alt Text Image": "Official header image for Hunt: Showdown game - Steam 594650",
    "Canonical URL": "https://gusku.site/game/hunt-showdown",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hunt: Showdown\", \"description\": \"Looking for information on Hunt: Showdown? Check out the release date (Aug 27, 2019), developer insights from Crytek, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 27, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crytek\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crytek\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/594650/header.jpg?t=1658736563\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}