{
    "AppID": 909500,
    "Name": "Hurricane chase(飓风追击)",
    "Release date": "Jul 24, 2019",
    "About the game": "QQ group：884568898 One day in the future, a terrorist organization code-named Apocalypse hijacked a scientist from a climate laboratory to create countless weather controllers to create tornadoes around the world in an attempt to rule the world. In order to eliminate the threat of weather controllers, countries selected military elites to destroy weather controllers. At the same time, there are some victims of weather controller experiments, adventurers, chasers and other people with different purposes also go to these areas. Hurricane chase is a multiplayer (4vs1) Sports game where one player takes on the role of the Tornado, and the other four players play as Survivors, trying to destroy the weather controllers or attack the Tornado and avoid being destroyed. The physical damage, movement and driving effects of different buildings, sundries, glass, animals and vehicles in the EF0-EF5 tornado are total simulated based on the Fujita series. F0 Tornado Wind speeds between 40 to 72 mph (64 to 116 km/h) Light damage The road sign is destroyed and the lighter object is rolled up . Effect the steering of the car drived by chaser F1 Tornado Wind speeds between 73 to 112 mph (117 to 180 km/h) Moderate damage Surface damage to roofs; mobile homes pushed off foundation. The car drived by chaser will pushed off the road. F2 Tornado Wind speeds 113 to 157 mph (181 to 253 km/h) Significant damage Frame houses have roof torn off; mobile homes complete destroyed; The car drived by chaser will overturned; smaller debris turned into missiles. F3 Tornado Wind speeds between 158 to 206 mph (254 to 332 km/h) Severe damage Roofs completely torn off well-constructed buildings, along with some walls. majority of trees uprooted. the car drived by chaser will lifted off the ground. F4 Tornado Wind speeds between 207 to 260 mph (333 to 418 km/h) Devastating damage. Well-constructed houses are completely destroyed; structures with weak foundations blown away; The car drived by chaser will be thrown; large debris become flying missiles. F5 Tornado Wind speeds between 261 to 318 mph (419 to 512 km/h) Incredible damage Most structures severely damaged or completely destroyed. the car drived by chaser will become flying missiles. The player only need to wait for 80 seconds after the second player joined in, the game will start. The tornado will dynamically downgrade to the corresponding level according the number of the chasers. ----------------------------------------------------------------------------------------------------------------------------------------------------------------------- A letter to player: As an office worker, I eager to chase a tornado, but now I have a family to take care. So I decided to realize my dreams in the virtual world. I have developed two mobile game four year ago on app store. I self-learn unity from 2015. So I decide to use the unity to make a game. In the game I can pursue the tornado. In order to be as realistic, I review a large number of papers, watch a lot of tornado video on youtube. I hope I can simulate the tornado and experience the excitement in the virtual world. From June 2017, I started to use the off-duty time to develop alone. I make a sigle game in a few months. The physical damage, movement and driving effects of different buildings, sundries, glass, animals and vehicles in the EF0-EF5 tornado are total simulated based on the Fujita series. I play it in different scenes for a period. And I thought why I am not share it with more people to experience it. Then I start develop multiplayer game using Unet. And I did it. But unfortunately, when I complete the game two days latter, I received a Email from the unity. The Email noted that it will not support Unet service next year. I am almost crazy. I pondered the difficult of continue with this project in about a month. I decide to try again. I look for alternatives. I want to set up a server by myself. I have set up a server many years ago. But I don't know how to make the unity connect with a local server. I want to use third part service. I found the photon can support the unity easily. I buy a template having photon and unity. That's cost a lot of time. Now, I did it again. I am very proud. In this game, players need against a tornado. I want to design that one player roles as tornado, the other players role as chaser. The number of chaser not limit. But it will not fun enough. So I made it as an asymmetric confrontation game, 4V1. In the future, maybe I will design a map with more than 4 chasers, a map with more than one tornado. Yes, I have designed a map with a lot of tornado last year, that's thrilling. I change the asymmetric confrontation game. The game can be start, if the room not full. The player only need to wait for 80 seconds after the second player joined. The tornado will dynamically drop to the corresponding level according the number of the chasers. Finally, I added rankings, dressups, rewards, and have been published on the steam on July 25th. The follow-up will continue to improve, hoping to be closer to the real experence for chasing tornado. I will add the sea surface map, different terrain map, Mars map, aliens and other scenes, add more types of vehicle like as boats, unicycles, aircraft and so on, add more equipment and more game mode.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/909500/header.jpg?t=1643547369",
    "Price": 2.99,
    "Developers": "2AM(熬夜工作室)",
    "Publishers": "2AM(熬夜工作室)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_703d782e28775402a9b719ba52db81390ef338f6.1920x1080.jpg?t=1643547369,https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_17385b62aa24ccf9019829f5f5ffb72e07187067.1920x1080.jpg?t=1643547369,https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_a4f83d04effd5ab242320d0ee03fb0472effdb26.1920x1080.jpg?t=1643547369,https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_ae3265a174892d6d8a2d8071ff0914397a879831.1920x1080.jpg?t=1643547369,https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_47bc08e656ff48b5b19d7bd2dd2794376f6ca6ad.1920x1080.jpg?t=1643547369,https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_86cc74f0b05e69d343a0e3b1013fb1e563f28448.1920x1080.jpg?t=1643547369,https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_b60430c7dab57b8dcdc5d326c0854c93daaa021f.1920x1080.jpg?t=1643547369,https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_2b216ad10f54105b64c9215c7c0e18ae2fdc28fb.1920x1080.jpg?t=1643547369,https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_6ad5cbb3d448a8ac89969a46fce66b00acbf8c69.1920x1080.jpg?t=1643547369,https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_46da3fa9489f12131ed6ed468720ae1ab167d8ce.1920x1080.jpg?t=1643547369,https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_b41aa5fc5ff3af77eb59e170d69ead8562baf7bd.1920x1080.jpg?t=1643547369,https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_d65c0559ff301ff721a56da91e1e6c4e115e0969.1920x1080.jpg?t=1643547369,https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_3320db9bd6ab0ae96395b9012143f507b00b4a14.1920x1080.jpg?t=1643547369,https://cdn.akamai.steamstatic.com/steam/apps/909500/ss_a6a73f960bebf62e6a96b17ee289bd2b5f6401d8.1920x1080.jpg?t=1643547369",
    "Slug": "hurricane-chase",
    "Meta Title": "Hurricane chase(飓风追击): Jul 24, 2019, 2AM(熬夜工作室) and Full ...",
    "Meta Description": "Looking for information on Hurricane chase(飓风追击)? Check out the release date (Jul 24, 2019), developer insights from 2AM(熬夜工作室), and a complete game sum...",
    "Alt Text Image": "Official header image for Hurricane chase(飓风追击) game - Steam 909500",
    "Canonical URL": "https://gusku.site/game/hurricane-chase",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hurricane chase(\\u98d3\\u98ce\\u8ffd\\u51fb)\", \"description\": \"Looking for information on Hurricane chase(\\u98d3\\u98ce\\u8ffd\\u51fb)? Check out the release date (Jul 24, 2019), developer insights from 2AM(\\u71ac\\u591c\\u5de5\\u4f5c\\u5ba4), and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 24, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"2AM(\\u71ac\\u591c\\u5de5\\u4f5c\\u5ba4)\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"2AM(\\u71ac\\u591c\\u5de5\\u4f5c\\u5ba4)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/909500/header.jpg?t=1643547369\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}