{
    "AppID": 1918330,
    "Name": "Interactive Fiction and Adventure Creator (IFAC)",
    "Release date": "Jun 30, 2022",
    "About the game": "The Interactive Fiction and Adventure Creator (IFAC) is simply the easiest and fastest system for writing and developing multiple choice interactive fiction and old school text adventure games. It’s organization and ease of use allows new authors to quickly become productive in writing their story. You will be writing working games and fiction in no time. And when you come to want to edit your story to improve it, the time saving features that helped you write it will help ensure that your changes will remain consistent throughout the story. PLEASE MAKE SURE YOU DOWNLOAD AND READ THE MANUAL WHICH WILL GUIDE YOU THROUGH ALL THE FEATURES. It’s YOUR World - Make It DO Something! If you’re writing an adventure game, you’ve entered your locations and put some objects around the world but the game needs to react to player input and do things within the game to make the world look alive. That’s why we have the IFAC Language. The IFAC Language allows complex decision making and game actions to be built from small but effective commands that have great power when used correctly in combination. Make the game talk back to the player, initiate events that happen on a timeline or depend on other changes in the world. Give the player some puzzles to solve in order to progress. In short, make your world do something - and make the player adapt to it. You’ll learn how to do that by creating a sample adventure in IFAC from instructions in the manual so you can see how everything comes together. The Community IFAC is a full system and you can write complete stories or games as it is now, but it has so much more potential for additions to the IFAC Language to make ever more complex games. I have additions I already want to make and as you use IFAC I’m sure you will have your own ideas. To that end we have a community to discuss games, help solve problems and propose new commands and additions. Come to the IFAC Community website. I will be hanging out there to answer your questions and take your suggestions or requests for new commands in the IFAC Language. History I am a lone independent developer. A couple of years ago I wanted to write an old school adventure game, because I used to love playing and writing them. About two months in, it became obvious that to do it efficiently what I was going to write was a game creation system - and so my project turned into IFAC. Eighteen months later and here we are. The game itself went by the wayside, but I will try and get back to writing the game now and it will end up being a free DLC or packaged with IFAC down the road, so that you can play it and also see how it was coded inside IFAC. I really enjoy writing adventures and so there may well be more than one, depending on how the time splits between adding features to IFAC and being able to write. This is a labor of love for me and I hope that anyone else who has wanted to tell a story or create a game like this will come along for the ride. I will help you by providing the best tools that I can, as well as encouragement and help designing your story inside IFAC.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1918330/header.jpg?t=1656868315",
    "Price": 29.99,
    "Developers": "Andy Jennings",
    "Publishers": "CodeUpNYC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1918330/ss_5fc1e2340b0b3fa30d893e0137b5da38b6763de4.1920x1080.jpg?t=1656868315,https://cdn.akamai.steamstatic.com/steam/apps/1918330/ss_ee18a3c9caf3e2c1a17d12acde5dbc7702028cb0.1920x1080.jpg?t=1656868315,https://cdn.akamai.steamstatic.com/steam/apps/1918330/ss_db338d2e0c8fbf5395afac63075e57d8795d710e.1920x1080.jpg?t=1656868315,https://cdn.akamai.steamstatic.com/steam/apps/1918330/ss_5364538914bdd579913a37077d073cd5baa369e9.1920x1080.jpg?t=1656868315,https://cdn.akamai.steamstatic.com/steam/apps/1918330/ss_0cb1e0dcf56e1dd9a6e330539f05cd6100263c9f.1920x1080.jpg?t=1656868315",
    "Slug": "interactive-fiction-and-adventure-creator-ifac",
    "Meta Title": "Interactive Fiction and Adventure Creator (IFAC): Jun 30,...",
    "Meta Description": "Looking for information on Interactive Fiction and Adventure Creator (IFAC)? Check out the release date (Jun 30, 2022), developer insights from Andy Jen...",
    "Alt Text Image": "Official header image for Interactive Fiction and Adventure Creator (IFAC) game - Steam 1918330",
    "Canonical URL": "https://gusku.site/game/interactive-fiction-and-adventure-creator-ifac",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Interactive Fiction and Adventure Creator (IFAC)\", \"description\": \"Looking for information on Interactive Fiction and Adventure Creator (IFAC)? Check out the release date (Jun 30, 2022), developer insights from Andy Jen...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Andy Jennings\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CodeUpNYC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1918330/header.jpg?t=1656868315\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}