{
    "AppID": 1460670,
    "Name": "Jungle Town: Birthday quest",
    "Release date": "Dec 3, 2020",
    "About the game": "Explore the world, play and learn with funny animals from Jungle Town! The app is suitable for children from 2 to 5 years old and does not require adult assistance! Play offline without internet anywhere. Discover an exciting birthday quest and complete a variety of tasks with six cute animals! In each level you will find something interesting from real life. Do you want to know what? Welcome to the world of Jungle town! Jungle town, a story-based game, consists of 6 mini-games on different themes, united by one plot. Here you will find 6 levels with exciting tasks: Elephant's birthday. The birthday boy wants to invite friends to visit, but how can he arrange a holiday? Add decorations, of course! Help the elephant decorate the room, decorate the cake, inflate balloons and light the holiday candles! The bully tiger cleverly thought of giving the elephant a ball, but here's the bad luck: he can't find it, because the room is a mess and the gift was lost somewhere among the things. Help the little tiger to remove trash, toys, clean the house from cobwebs and put clothes neatly in the closet. Fashionista porcupine decided to give a shirt to an elephant, join her: choose fabric, patterns, cut and sew details, don't forget to add buttons! A romantic monkey wants to give the elephant a bouquet of flowers. Just to start, flowers need to be grown. Dig up the beds, plant sprouts, take care of them and collect wonderful flowers in a festive bouquet. An inventive raccoon came up with an eco-friendly bike for his friend the elephant. Help him sort parts, build a bicycle, inflate eco-friendly tires and add decorations. The mischievous parrot has an orchard and loves to experiment in the kitchen. He also loves pranks, so he is preparing a rally for the elephant. Harvest berries and fruits for a gift cocktail, mix parrot recipes and laugh with the fun bird! And after you complete all the levels, go to the festive party to find out what surprises the elephant has prepared for friends! Jungle town is a game for preschool children with many interesting tasks to develop mindfulness and fine motor skills. Completing tasks, your child will not only have fun, but also learn about the world, acquire good habits. Want to teach your son or daughter useful skills? Welcome to Jungle town. And also in our children's educational game you will find colorful pictures, cute kind characters, nice melodies, lots of funny animations and the final cartoon party! Try Jungle town now!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1460670/header.jpg?t=1607007618",
    "Price": 3.99,
    "Developers": "Funtyx",
    "Publishers": "Funtyx",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1460670/ss_c7299b425ab2e39e418c75e12d5cc84109ffe97d.1920x1080.jpg?t=1607007618,https://cdn.akamai.steamstatic.com/steam/apps/1460670/ss_5602b96364400952096aebc16a766e9e1e7d175b.1920x1080.jpg?t=1607007618,https://cdn.akamai.steamstatic.com/steam/apps/1460670/ss_c3153d858ce912dff2baa85039ace060b5d00269.1920x1080.jpg?t=1607007618,https://cdn.akamai.steamstatic.com/steam/apps/1460670/ss_8139f290b962c9acf0710e931fe715587f843dd3.1920x1080.jpg?t=1607007618,https://cdn.akamai.steamstatic.com/steam/apps/1460670/ss_c6e37596491e056abae758f5216b0cef4c83e9ca.1920x1080.jpg?t=1607007618,https://cdn.akamai.steamstatic.com/steam/apps/1460670/ss_0dc5ab53b633f6a48759d837ed707c3dcb64b0c7.1920x1080.jpg?t=1607007618,https://cdn.akamai.steamstatic.com/steam/apps/1460670/ss_35772b335acf2a0a607f116829c0fa4d7245ffd0.1920x1080.jpg?t=1607007618",
    "Slug": "jungle-town-birthday-quest",
    "Meta Title": "Jungle Town: Birthday quest: Dec 3, 2020, Funtyx and Full...",
    "Meta Description": "Looking for information on Jungle Town: Birthday quest? Check out the release date (Dec 3, 2020), developer insights from Funtyx, and a complete game su...",
    "Alt Text Image": "Official header image for Jungle Town: Birthday quest game - Steam 1460670",
    "Canonical URL": "https://gusku.site/game/jungle-town-birthday-quest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Jungle Town: Birthday quest\", \"description\": \"Looking for information on Jungle Town: Birthday quest? Check out the release date (Dec 3, 2020), developer insights from Funtyx, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 3, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Funtyx\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Funtyx\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1460670/header.jpg?t=1607007618\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}