{
    "AppID": 1250520,
    "Name": "Love Spell: Written In The Stars - a magical romantic-comedy otome",
    "Release date": "Jul 24, 2020",
    "About the game": "Once Upon A Time, In a bustling town nestled between the mountains and the sea, there lived a young girl who made bad decisions. But aside from her terrible luck and life choices, she was a kind and brave soul who always tried her best to find the light, even in the midst of darkness. One fateful day, she saved the life of a mysterious old woman while crossing the street. The woman turned to her with a knowing smile and in return for her kindness, gifted her a book. Unbeknownst to the girl, the woman she saved was actually a powerful witch-- and the book she received was a magical spellbook capable of making anyone whose name she writes inside its pages, fall in love with her until the next full moon. Our heroine took the book, had a terrible day and went to the local pub to drown her sorrows with a good drink... .......and then she made a really, really bad decision. Love Spell features a variety of game-based interactions to increase the level of storytelling, such as: Nameable Heroine: You can keep our MC’s default name, Luna, or take the lead in the story yourself with a custom name! 4 Different Romantic Routes: Each route in this story was written as a different literary genre featuring a different guy! Whether your cup of tea is the drama involved in romancing a childhood friend or a heart-racing adventure on an expedition with your professor--or even more-- the choice is yours to make! The heroine herself and her interests also differ slightly from story to story, so you’ll have to play all of the routes to experience the full picture! Navigation System: Instead of manual save slots, our game uses a 'Navigate' feature which allows players to revisit previously unlocked chapters in the story through an auto-save function. Interested in going back to explore different choices in the story? No problem! With the navigation feature, you can easily go back in time and change any choice-- the game will record your new decision automatically. HIS P.O.V Stories: Each route features a special chapter where the story is told from your lover’s perspective. See the world and experience his feelings about you through his very eyes! Romantic CGs: In the more intimate moments of your relationship, experience what his embrace feels like first hand with beautiful CG illustrations. Note: There will be no explicit imagery in the game. User Choices: Take control of your destiny by picking first hand what you say or do in the story-- but be careful, the wrong choice could lead to a terrible fate! Multiple Endings: The Good, The Bad and The Epilogues can all be unraveled through your choices in the story! Determine your own fate and decide on your own ending! Are you ready to meet our colorful cast?! Check out our main character and our four current romance-able options below! Besides these five, there are plenty more characters waiting to meet you in the game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1250520/header.jpg?t=1624371857",
    "Price": 18.99,
    "Developers": "Great Gretuski Studios LLC",
    "Publishers": "Great Gretuski Studios LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1250520/ss_42aa9a3f04c9f5bbb55a00203f911610a96bc892.1920x1080.jpg?t=1624371857,https://cdn.akamai.steamstatic.com/steam/apps/1250520/ss_823268eda24a67d4e5db1adf8799009b9c1c4ca6.1920x1080.jpg?t=1624371857,https://cdn.akamai.steamstatic.com/steam/apps/1250520/ss_0089b3ce93c667ef46e2175c19f3c0bf322be4da.1920x1080.jpg?t=1624371857,https://cdn.akamai.steamstatic.com/steam/apps/1250520/ss_d74deb0c20b2e9f4f9558a80943094b020d26956.1920x1080.jpg?t=1624371857,https://cdn.akamai.steamstatic.com/steam/apps/1250520/ss_6adbc652beb0957aea2ff6e14e30d688ab234f90.1920x1080.jpg?t=1624371857,https://cdn.akamai.steamstatic.com/steam/apps/1250520/ss_150f1fea764438cd2bd8ebd0f498851ca24399d6.1920x1080.jpg?t=1624371857,https://cdn.akamai.steamstatic.com/steam/apps/1250520/ss_376c51dca9bd36bbde2ffdce67300fc6895f2acb.1920x1080.jpg?t=1624371857,https://cdn.akamai.steamstatic.com/steam/apps/1250520/ss_f250a4612ffd3327ea1b7793a8fa1eb4464be14f.1920x1080.jpg?t=1624371857",
    "Slug": "love-spell-written-in-the-stars-a-magical-romantic-comedy-otome",
    "Meta Title": "Love Spell: Written In The Stars - a magical romantic-com...",
    "Meta Description": "Looking for information on Love Spell: Written In The Stars - a magical romantic-comedy otome? Check out the release date (Jul 24, 2020), developer insi...",
    "Alt Text Image": "Official header image for Love Spell: Written In The Stars - a magical romantic-comedy otome game - Steam 1250520",
    "Canonical URL": "https://gusku.site/game/love-spell-written-in-the-stars-a-magical-romantic-comedy-otome",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Love Spell: Written In The Stars - a magical romantic-comedy otome\", \"description\": \"Looking for information on Love Spell: Written In The Stars - a magical romantic-comedy otome? Check out the release date (Jul 24, 2020), developer insi...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Great Gretuski Studios LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Great Gretuski Studios LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1250520/header.jpg?t=1624371857\", \"offers\": {\"@type\": \"Offer\", \"price\": 18.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}