{
    "AppID": 1223880,
    "Name": "ManaTech",
    "Release date": "Mar 26, 2020",
    "About the game": "The battle for magic and technology. ManaTech is a fast paced multiplayer twin stick shooter. Take control of a magic user or a technology user and battle against your friends in hazardous arenas. Master your characters' unique abilities and eliminate your opponents. Only one can emerge victorious. Features Unique playable characters: Take control of a magic user, representing the failing society of the Mages' Guilds or a tech user, fighting to establish independance for the commoners. Each character has unique abilities to use and distinctive traits. Play as the nimble bounty hunter with dual pistols, engaging your opponents at range and accuracy or as a blazing spirit of fire, incinerating your opponents at close range with fire balls and explosions. Dynamic arenas: Battle on numerous arenas, each featuring different visuals and hazards for players to negotiate. Take the fight to the floating rings in the sky or the lava caverns. Multiple game modes: Play in different game configurations and in free-for-all or 2v2 team formats. Support for 1 to 4 players: Battle against your friends in a local multiplayer setting or battle against computer controlled opponents or battle against your friends with computer controlled opponents. The Story In the world of Averia, the Mages' Guilds have been able to maintain control the world through the commoners reliance on their magical abilities to perform most tasks. In recent times, the commoners have been able to produce a powerful energy source of their own and have begun the shift to make use of their new found power. In a desperate attempt to maintain relevancy in the world of Averia, the Mages' Guilds have sought to outlaw this power source from the commoners but after failed negotiations, they have launched a violent coup to overthrow the major city of Mythcross. After the governor of Mythcross was killed in the struggle for the city, this sparked a revolt amongst the commoners all over Averia to dismantle the Mages' Guilds. The world of Averia is now embroiled in a civil war between the Mages' Guilds and the Common Populace. Will You Fight For Magic Or Technology?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1223880/header.jpg?t=1586514703",
    "Price": 14.99,
    "Developers": "Drunk Galah",
    "Publishers": "Drunk Galah",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1223880/ss_e50c69475b19038a8c51de33367cf47adc7c75a1.1920x1080.jpg?t=1586514703,https://cdn.akamai.steamstatic.com/steam/apps/1223880/ss_f77844e6c77fd47cbef648f578de6975eec607fc.1920x1080.jpg?t=1586514703,https://cdn.akamai.steamstatic.com/steam/apps/1223880/ss_7ba9d6b0819782c5922efa435596e8e03a135a5e.1920x1080.jpg?t=1586514703,https://cdn.akamai.steamstatic.com/steam/apps/1223880/ss_4fa0f16ac465bebd295ad507e9cbbe39fca26f31.1920x1080.jpg?t=1586514703,https://cdn.akamai.steamstatic.com/steam/apps/1223880/ss_0e046305b77f6e11257311173b4b9b3eb3aeebfe.1920x1080.jpg?t=1586514703",
    "Slug": "manatech",
    "Meta Title": "ManaTech: Mar 26, 2020, Drunk Galah and Full Overview",
    "Meta Description": "Looking for information on ManaTech? Check out the release date (Mar 26, 2020), developer insights from Drunk Galah, and a complete game summary.",
    "Alt Text Image": "Official header image for ManaTech game - Steam 1223880",
    "Canonical URL": "https://gusku.site/game/manatech",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ManaTech\", \"description\": \"Looking for information on ManaTech? Check out the release date (Mar 26, 2020), developer insights from Drunk Galah, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 26, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Drunk Galah\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Drunk Galah\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1223880/header.jpg?t=1586514703\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}