{
    "AppID": 919280,
    "Name": "MovieMator Video Editor Pro - Movie Maker, Video Editing Software",
    "Release date": "Dec 17, 2018",
    "About the game": "Contact market@effectmatrix.com for any problem or proposal regarding Moviemator. We are pleased to assist you. MovieMator Video Editor Pro is a handy and useful video editing software. It easily creates a variety of eye-catching animation effects with keyframes and provides the basic editing features like trimming, cropping, splitting, rotating, adding subtitle. It also brings to the table exceptionally advanced editing functionalities like video overlay (PIP), stabilization, etc. MovieMator Video Editor Pro provides unlimited video and audio tracks for editing large projects. Moreover, it fully supports all media formats like 4K UltraHD, H.265, MP3, OGG, JPG, SVG, etc. and is optimized for the decoding of different formats, which significantly improved the decoding speed and quality. Automatic Keyframe Animation • Automatically insert animation keyframes, making it easy to master keyframe professional animation techniques. • With keyframe animation, dynamic effects are all under your control. Easily Edit Videos/Audios/Images • Unlimited video tracks and audio tracks help users handle all projects. • Basic editing features: merging, splitting, rotating, cropping, trimming, etc. • Seamlessly assemble clips and adjust them frame by frame in the Timeline. • Separate the audio track from a video file with ease. • Create colorful slideshows with photos, music and fades. Create Fantastic Animation Effects with Keyframe Animation Technology • 40+ fixed filter effects: Blur, Old Film, Sharpen, Stabilize, Vignette, White Balance... • Create fantastic animation effects with keyframe animation technology. • Play multiple videos in the same time with Picture-in-Picture effect. • Stabilize your shaky Action Camera footage in one click. • Create Fast/Slow-motion video by adjusting the playing speed as you like. • Enhance your movie by adding personalized subtitles and dazzling transitions. • 20+ dazzling transitions: Dissolve, Iris Circle, Clock Top, Cut, Bar Vertical... Make Personalized Home Movies with Creativity • fixed filter effects: Resize, Rotate, Size and Position, Gain Volume... • Play multiple videos in the same time with Picture-in-Picture effect. • Create Fast/Slow-motion video by adjusting the playing speed as you like. • Support volume adjustment and various audio filters to create perfect sound effect. • Set fade in/out time for videos and audios with freedom. • Enhance your movie by adding personalized subtitles and dazzling transitions. Fully Support Media Files of Any Type • Import all videos/photos shot by iPhone 6s, GoPro, camcorder or other devices. • Support videos/images downloaded from Facebook, Instagram, Flickr and more sites. • Support videos with voiceover that recorded by any screen recording software. • Support all popular video/audio/image formats: MP4, AVI, MPEG, WMV, MKV, MPG, RMVB, M4V, 3GP, FLV, TS, M4V, VOB, F4V, MP3, WAV, MKA, OGG, FLAC, AAC, JPG, PNG, TIF, BMP, SVG... • Work natively with a broad range of formats including ProRes, RED, XAVC, AVCHD, H.264 from DSLR and more. Extremely Intuitive and Friendly Interactive Operation • The interface of MovieMator is intuitive and Real-time preview feature ensures what you see is what you get. • Arrange and Trim all elements on the timeline by dragging and dropping. • Easy-to-use cut, copy, and paste operations. • Hide, mute, and lock the video /audio track with one-click. Powerful Project Preservation and Video Output Capability • Incredibly fast export of HD videos in 200+ media formats for playback on all devices. • Customize output parameters like resolution, frame rate, aspect ratio, encoding and etc. • Save the file as a project for direct editing next time. • Auto save the project when the window is closed unexpectedly.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/919280/header.jpg?t=1620782263",
    "Price": 14.99,
    "Developers": "EffectMatrix",
    "Publishers": "EffectMatrix",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/919280/ss_4927d072fe9b9de50390e9e698ad43e8fce3249a.1920x1080.jpg?t=1620782263,https://cdn.akamai.steamstatic.com/steam/apps/919280/ss_d2aa20ad50f52c2fc5dfc439ab6e57a85abb6129.1920x1080.jpg?t=1620782263,https://cdn.akamai.steamstatic.com/steam/apps/919280/ss_7efb79da15469c7c35875a806750fc407c660633.1920x1080.jpg?t=1620782263,https://cdn.akamai.steamstatic.com/steam/apps/919280/ss_45a8d4687eb5b759edb74e0fdc040524d3326a55.1920x1080.jpg?t=1620782263,https://cdn.akamai.steamstatic.com/steam/apps/919280/ss_c7d8a7729649c7bf9cb6c6f01b61bd815767e6ab.1920x1080.jpg?t=1620782263",
    "Slug": "moviemator-video-editor-pro-movie-maker-video-editing-software",
    "Meta Title": "MovieMator Video Editor Pro - Movie Maker, Video Editing ...",
    "Meta Description": "Looking for information on MovieMator Video Editor Pro - Movie Maker, Video Editing Software? Check out the release date (Dec 17, 2018), developer insig...",
    "Alt Text Image": "Official header image for MovieMator Video Editor Pro - Movie Maker, Video Editing Software game - Steam 919280",
    "Canonical URL": "https://gusku.site/game/moviemator-video-editor-pro-movie-maker-video-editing-software",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MovieMator Video Editor Pro - Movie Maker, Video Editing Software\", \"description\": \"Looking for information on MovieMator Video Editor Pro - Movie Maker, Video Editing Software? Check out the release date (Dec 17, 2018), developer insig...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"EffectMatrix\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"EffectMatrix\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/919280/header.jpg?t=1620782263\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}