{
    "AppID": 1391530,
    "Name": "Mud and Blood",
    "Release date": "Nov 30, 2021",
    "About the game": "The cult classic flash game is back with its own new engine, an evolved AI and a ton of new features. Key Features Award-winning and time-proven firefight simulator as imagined by a solo dev and the MNB community over 12 years. Immerse yourself into a highly randomized battlefield where your decision-making abilities will be tested. Infinite tactical possibilities across miles of procedurally generated terrain from the beaches of Normandy to Berlin. Lead your squad the way you want with a selection of 12 classes from light infantry flankers to heavy gunners. Over 600 lines of original voice acting! Array of weapons and equipment. If it was in WW2 we want it to be in Mud and Blood. Equip a versatile squad that can handle the chaos of combat. Call in off-map support to obliterate your enemies such as airstrikes, artillery and armour. Entirely destructible and flammable environments littered with empty shells, blood and destroyed objects. Fight for every inch of terrain against a merciless enemy that follows the infantry doctrine of WW2. True and gritty tactical combat mechanics designed by a war veteran. Use fire and movement between concealment and cover. Manage the psychological effects of casualties and incoming fire. Faithful to the Mud and Blood tradition, progress through a career and earn one of the many ribbons which in return affect your game. Optional CLASSIC MODE: Play Mud and Blood in a defence scenario against endless waves of enemies. About Ready for some unfair brutality? Experience World War 2 as a squad leader in an extensively random war game. MNB is all about testing your decision-making ability and your faculty to adapt in a scenario where no punches are pulled. This is your show. Complete freedom over how you will conduct your operation with endless options ranging from different soldiers, weapons, buildings, and airstrikes…now get out there and fight with all you got.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1391530/header.jpg?t=1638334228",
    "Price": 12.99,
    "Developers": "urbgames",
    "Publishers": "urbgames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1391530/ss_66468772121ddd97262dbe9531d7f74f0459ccd6.1920x1080.jpg?t=1638334228,https://cdn.akamai.steamstatic.com/steam/apps/1391530/ss_e70e98e80ffc5e627bfb2f4315d6afee11909e86.1920x1080.jpg?t=1638334228,https://cdn.akamai.steamstatic.com/steam/apps/1391530/ss_7d576d3bea80964ddfe1f3f2bd236b7e5e09e8f9.1920x1080.jpg?t=1638334228,https://cdn.akamai.steamstatic.com/steam/apps/1391530/ss_79e91a70ece48dcdc8ae62bf2e0f9cdfcd603efc.1920x1080.jpg?t=1638334228,https://cdn.akamai.steamstatic.com/steam/apps/1391530/ss_5e5b570bf3d9c0ca507fe4932c432295077402cb.1920x1080.jpg?t=1638334228",
    "Slug": "mud-and-blood",
    "Meta Title": "Mud and Blood: Nov 30, 2021, urbgames and Full Overview",
    "Meta Description": "Looking for information on Mud and Blood? Check out the release date (Nov 30, 2021), developer insights from urbgames, and a complete game summary.",
    "Alt Text Image": "Official header image for Mud and Blood game - Steam 1391530",
    "Canonical URL": "https://gusku.site/game/mud-and-blood",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mud and Blood\", \"description\": \"Looking for information on Mud and Blood? Check out the release date (Nov 30, 2021), developer insights from urbgames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"urbgames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"urbgames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1391530/header.jpg?t=1638334228\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}