{
    "AppID": 1225330,
    "Name": "NBA 2K21",
    "Release date": "Sep 3, 2020",
    "About the game": "NBA 2K21 is the latest release in the world-renowned, best-selling NBA 2K series. With exciting improvements upon its best-in-class gameplay, competitive and community online features, and deep, varied game modes, NBA 2K21 offers one-of-a-kind immersion into all facets of NBA basketball and culture - where Everything is Game. In NBA 2K21, new, old, and returning ballers alike will find exciting game modes that offer a variety of basketball experiences: REALER THAN EVER With enhancements across visual presentation, player AI, game modes, and much more, NBA 2K21 continues to push the boundaries as the most authentic, realistic basketball video game experience. Feel the energy of the crowd, the intensity of NBA competition, and the entertainment of the most immersive sports product in gaming today. ELITE GAMEPLAY Enjoy unparalleled control with the ball in your hands, using the advanced Pro Stick. Aim jump shots and layups for a new level of precision and skill, and unlock new signature dribble moves with more effective ball handling. YOUR G.O.A.T. TEAM Build your greatest collection of latest NBA stars and legendary ballers in MyTEAM and compete against other ferocious collectors around the world. New for 2K21, limited-time Seasons offer unique rewards as you compete in new and returning MyTEAM modes. NEW MyCAREER STORY Ascend from high school ball to one of ten officially-licensed college programs to the big leagues in a brand new, cinematic MyCAREER experience. Take your MyPLAYER to the top by making the big moves on the court and even bigger moves off of it, and make a name for yourself along this exciting, dramatic journey. NEW NEIGHBORHOOD LOCALE Soak in the sun as you ball out in 1v1s, 3v3s, and 5v5s; the new Neighborhood in 2K21 takes your game beachside with all-new visuals and layout. Flash your skills &amp; style in the Park, squad up in Pro-Am, and earn prizes in dynamically-updated 2K Compete Events. ALL THE LATEST DROPS AND MUSIC From head to toe, look the part of a baller with all-new apparel and sneaker drops from your favorite clothing, accessory and shoe brands. And ball while taking in the dynamic 2K21 music experience, which features the latest big artists from around the world and breakthrough musicians waiting to be discovered. USA BASKETBALL Relive USA Basketball’s championship legacy. Take the court with classic teams, collect MyTEAM cards featuring past stars, and show off your pride with MyPLAYER gear.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1225330/header.jpg?t=1614622937",
    "Price": 59.99,
    "Developers": "Visual Concepts",
    "Publishers": "2K",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1225330/ss_1166d3057f493160e6ec5a85aaa674d830ff25db.1920x1080.jpg?t=1614622937,https://cdn.akamai.steamstatic.com/steam/apps/1225330/ss_4d48f01cd6c486a937f70ef2361f57d68d75f03f.1920x1080.jpg?t=1614622937,https://cdn.akamai.steamstatic.com/steam/apps/1225330/ss_4bf58ddcf117134cd6bdd28d432daf1af9c491cc.1920x1080.jpg?t=1614622937,https://cdn.akamai.steamstatic.com/steam/apps/1225330/ss_1f1c59a984eebc0a5b2c287b47420f2e48b79528.1920x1080.jpg?t=1614622937,https://cdn.akamai.steamstatic.com/steam/apps/1225330/ss_4421d237908a7ad9b73bd3b02a7bc17971d67d0f.1920x1080.jpg?t=1614622937,https://cdn.akamai.steamstatic.com/steam/apps/1225330/ss_19466ddcb738a6fe52a9da3d849fac40daa6d885.1920x1080.jpg?t=1614622937",
    "Slug": "nba-2k21",
    "Meta Title": "NBA 2K21: Sep 3, 2020, Visual Concepts and Full Overview",
    "Meta Description": "Looking for information on NBA 2K21? Check out the release date (Sep 3, 2020), developer insights from Visual Concepts, and a complete game summary.",
    "Alt Text Image": "Official header image for NBA 2K21 game - Steam 1225330",
    "Canonical URL": "https://gusku.site/game/nba-2k21",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NBA 2K21\", \"description\": \"Looking for information on NBA 2K21? Check out the release date (Sep 3, 2020), developer insights from Visual Concepts, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 3, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Visual Concepts\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"2K\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1225330/header.jpg?t=1614622937\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}