{
    "AppID": 446760,
    "Name": "Neighborhorde",
    "Release date": "Jun 5, 2017",
    "About the game": "You and your pals are playing too many videogames. Mom said it’s time to go outside for a bit. Little does she know the dangers appearing outside in Neighborville. Portals open up from another dimension. Evil robots, dragons, wizards, and zombie Abe Lincoln burst out from these portals and start attacking you and your pals! Luckily, you have your trusty wooden sword and your pal saved some bottlerockets from 4th of July. How is that going to help? Use your imagination, kid. ------------------------------------------------------------------------------------------ Videogame-like gameplay! Local, cooperative survival action with 1-4 players. TV-headed bots can help you while you wait for your friends. Play as cute low-poly animal kids. So cute! Tons of spooky enemies: Fight to survive against waves of enemies from your imagination like zombie Abe Lincoln your school’s creepy lunch lady. Boss fights too! Every game is unique: Unlock 80+ weapons and superpowers as the game progresses. Become more powerful than you could ever imagine. Then get stomped to death by a giant foot. A bumpin soundtrack inspired by your favorite 90s grooves. Developed in GameMaker: Studio. ------------------------------------------------------------------------------------------ Remember being a kid? Inspired by Calvin and Hobbes, Ed Edd &amp; Eddy, and our childhood experiences, Neighborhorde aims to capture those countless hours spent imagining action movie scenarios. We miss the days of impromptu LAN parties with Halo, Mario Kart and the like, so we've designed Neighborhorde to have just the right amount of juicy nostalgia while also featuring hardcore gameplay that will test your friendships. Each night you'll unlock more of the 40+ crazy toys to add to your arsenal and become a more powerful team by choosing from 40+ game-changing superpowers. Break open presents found around the map to find the rad weapons you've chosen. Dash around as flames blast out from your feet with the new 'Hot Feet' superpower you just picked. You think to yourself, 'No baddie can stop me now!' However, as you get stronger, so does the horde of spooky enemies. As you progress you'll face a randomly-selected but ever-increasing combination of enemies including goop-tossing Lunch Ladies, magic-blasting Wizards, and axe-wielding Abe Lincolns. They're mean enough on their own, but mix these enemies together and they'll send you running home to Mommy. Survive 3 nights in a row, and you'll have to face your first of many epic boss fights. As you're bashed apart by the onslaught of baddies, you realize the only way to survive is the power of friendship; staying close to your team in the Friend Zone is the only way you'll regain your health. Since there are 80+ weapons and superpowers, and tons of enemies, no game is the same as the last and you’ll always have a new strategy to try. Blast bottle rockets at evil dodgeballs. Blow a bubble-gum-shield to protect your team. Catch the incoming robots on fire with your hair dryer flamethrower. Bash a wizard's face off with your trusty wooden sword. Can you defeat the bad guys before bedtime? TL;DR: Go outside, get rad toys, work together, defeat bad guys, avoid bedtime. ------------------------------------------------------------------------------------------ Can I play alone/single-player? Yes, but it's much funner with your pals (or strangers)! Are you planning any other platform releases? We're focusing on Windows/Mac first, but we hope to release on other platforms after the initial release. Are you planning on translating the game's text to any other languages? Depending on the amount of interest in other languages, we'd love to! What are you using to make this game? Gamemaker: Studio, yo! For a 3d game? FOR A 3D GAME! How many weapons/toys and superpowers are there in the game? 40 of each, currently. That's a lot of possibilities! Why does the hairdryer shoot flames out? Why does the electric guitar shoot lightning out? Why does the dog doo explode? Faulty wiring I guess? ------------------------------------------------------------------------------------------ We at Fermenter Games have wanted to build a co-op game we could play together on each other's couches for a long time, so Neighborhorde is our dream project. It’s been really fun so far making this thing with my best friends, and it’s even funner to play test. We want Neighborhorde to fit on your shelf between Towerfall Ascension, Mario Kart, and Sports Friends. We’re still hard at work on Neighborhorde, and if you’ve got ideas, we’re all ears. Let us know what you’d like to see by making a post in the Community. This game IS for you and your pals after all. Stay up to date with the development on our website or on Twitter at @fermentergames . See you in Neighborville!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/446760/header.jpg?t=1597172543",
    "Price": 4.99,
    "Developers": "Fermenter Games",
    "Publishers": "Fermenter Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/446760/ss_caeddf287b2568cc1a6eb5f6450aa3b6d663e24a.1920x1080.jpg?t=1597172543,https://cdn.akamai.steamstatic.com/steam/apps/446760/ss_761ae4e6e381914c1a4258e8621ef6baf3c75adb.1920x1080.jpg?t=1597172543,https://cdn.akamai.steamstatic.com/steam/apps/446760/ss_0afaf39dca52da4b21f3750840f3f720daf104d7.1920x1080.jpg?t=1597172543,https://cdn.akamai.steamstatic.com/steam/apps/446760/ss_97895505cd3a6019446e64bb9b29bddfba3784ff.1920x1080.jpg?t=1597172543,https://cdn.akamai.steamstatic.com/steam/apps/446760/ss_6d499d429267b1c4986a293fd623d76b06492769.1920x1080.jpg?t=1597172543,https://cdn.akamai.steamstatic.com/steam/apps/446760/ss_1017edc6ebe3a130ba0f351c0dcec53c6c8e98ce.1920x1080.jpg?t=1597172543,https://cdn.akamai.steamstatic.com/steam/apps/446760/ss_cfd000f64a89d5330c7ab7fdf5d119680a13bcc5.1920x1080.jpg?t=1597172543,https://cdn.akamai.steamstatic.com/steam/apps/446760/ss_221b2ac9c29be0941c67dcba6428c802840555eb.1920x1080.jpg?t=1597172543",
    "Slug": "neighborhorde",
    "Meta Title": "Neighborhorde: Jun 5, 2017, Fermenter Games and Full Over...",
    "Meta Description": "Looking for information on Neighborhorde? Check out the release date (Jun 5, 2017), developer insights from Fermenter Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Neighborhorde game - Steam 446760",
    "Canonical URL": "https://gusku.site/game/neighborhorde",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Neighborhorde\", \"description\": \"Looking for information on Neighborhorde? Check out the release date (Jun 5, 2017), developer insights from Fermenter Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 5, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fermenter Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fermenter Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/446760/header.jpg?t=1597172543\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}