{
    "AppID": 975510,
    "Name": "Panzer Paladin",
    "Release date": "Jul 21, 2020",
    "About the game": "The sight of giant swords blazing through the night sky might be hair-raising, but stand your ground! The sinister Ravenous and his legions of brutal demons are poised for battle. Even all the armies of the world can’t stop them, but humanity has one final ace in the hole: cutting-edge power armor called Paladin. It's now up to a strong-willed android named Flame to become a Squire, pilot the Paladin and track down all Weapon Keepers and their diabolical leader. The showdown between mankind’s technological prowess and the powerful forces of the occult has begun! Seize weapons from the denizens of the Netherworld and give them a taste of their own medicine! Show them the power of cutting-edge technology fused with masterful swordplay. Slash, bash and thrust your way through a series of mind-blowing levels around the world, all of it rendered in glorious 8-bit graphics! Hop in your Paladin and take up arms! An engaging action-platformer with fun and intuitive swordplay! Take control of Grit, the mighty Paladin power armor, or eject and play as Flame, the small-but-swift Squire pilot! Robots meet demons! Crush the forces of the occult with the power of cutting-edge technology! Over 100 melee weapons to seize from enemies! Forge your own custom melee weapons with the Blacksmith and find them on the Panzer Paladin Steam Workshop. Use weapons profusely: wield, throw, or shatter them! Snap a weapon in half to cast a powerful spell! Slash, bash and thrust your way through 17 mind-blowing levels located around the world! Carefully crafted 8-bit graphics, just like you remember them! CHALLENGE CORE CONTENT UPDATE This free content update includes the following new features: New Challenge Mode with 11 rooms to truly test your skills Speedrun replay and leaderboard now available for all new rooms Brand new Classic 8-bit Soundtrack option Blacksmith weapons storage increased Panzer Paladin is an action-platformer game featuring intuitive swordplay mechanics. The protagonist pilots the Paladin power armor to fight giant demons by using their own weapons against them. Swordplay is the core of the game mechanics in Panzer Paladin. The player can equip and use any weapon dropped by defeated enemies, attack or block, aim high or low, use weapons advantageously through a rock-paper-scissors style weapon type system, and cast spells by breaking weapons. Weapons abound in levels, so the player is encouraged to use them profusely. The Paladin is the main way to fight enemies, but players can also eject and control Flame, the small-but-swift Squire pilot. Flame uses a laser whip to attack enemies, swing across gaps, and even recharge the Paladin’s energy. Giant weapons — swords, lances, hammers — hailing from the dark depths of space, blazed across the sky and pierced their way through historic locations all around the world. As a declaration of war against mankind, the Parthenon, atop the Acropolis of Athens, was first to be cut through by an ominous blade. Upon impact, each of the weapons opened a breach in the fabric of reality and unleashed legions of colossal demons. In anticipation of such unforeseen Earth-threatening events, the International Security Council formed Gauntlet, a science committee developing super-sophisticated defense technologies. Gauntlet discovers that denizens of the Netherworld can only be defeated by their own weapons. Spirit Weapons are forged with spirits of the deceased and humans can’t brandish them without becoming corrupted by their foul energy... However, a machine would be immune to demonic corruption! Gauntlet recommissions Flame, a former rescue operations android, to become a Squire. She takes control of Grit, the last remaining Paladin unit — a state-of-the-art suit of power armor capable of wielding Spirit Weapons. To arms! Overseeing operations from aboard the Avalon, their flying headquarters, Gauntlet is ready. The showdown between mankind’s technological prowess and the powerful forces of the occult has begun! It's up to Flame and Grit to defeat the Weapon Keepers, and ultimately face off against Ravenous, the sinister leader of the invasion. JOIN THE COMMUNITY",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/975510/header.jpg?t=1627680207",
    "Price": 19.99,
    "Developers": "Tribute Games Inc.",
    "Publishers": "Tribute Games Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/975510/ss_33d2583584504868e4bc2098384ac2fc01fd78cc.1920x1080.jpg?t=1627680207,https://cdn.akamai.steamstatic.com/steam/apps/975510/ss_347ff706b7e51940befdc8bbee0ab4c954f965ae.1920x1080.jpg?t=1627680207,https://cdn.akamai.steamstatic.com/steam/apps/975510/ss_c389837c7ef70d44bab26f9e5fa1b4f2b0b40c16.1920x1080.jpg?t=1627680207,https://cdn.akamai.steamstatic.com/steam/apps/975510/ss_97dfb1c9c7f02e29eac4de0fed88ae25bfe65156.1920x1080.jpg?t=1627680207,https://cdn.akamai.steamstatic.com/steam/apps/975510/ss_12a05bec4a96532016514ac38240a1815df35f8c.1920x1080.jpg?t=1627680207,https://cdn.akamai.steamstatic.com/steam/apps/975510/ss_84b99f2d78028aa3cd95d2bb55fb142de5d1fd32.1920x1080.jpg?t=1627680207,https://cdn.akamai.steamstatic.com/steam/apps/975510/ss_7eb6e8171e6f8d11d0a1fcd44d40ea0b7b6f7f5d.1920x1080.jpg?t=1627680207,https://cdn.akamai.steamstatic.com/steam/apps/975510/ss_e36dd94e6e024a8cd2d2a17edde3087eb9ef4ad2.1920x1080.jpg?t=1627680207,https://cdn.akamai.steamstatic.com/steam/apps/975510/ss_b22a1cb23f8c8fefc318cb708ce23cbdaadc689f.1920x1080.jpg?t=1627680207,https://cdn.akamai.steamstatic.com/steam/apps/975510/ss_cc19e4560e15a7cb7e54ce10aae8266809be819f.1920x1080.jpg?t=1627680207,https://cdn.akamai.steamstatic.com/steam/apps/975510/ss_725a3bf844330867596499670f13678837a8f599.1920x1080.jpg?t=1627680207",
    "Slug": "panzer-paladin",
    "Meta Title": "Panzer Paladin: Jul 21, 2020, Tribute Games Inc. and Full...",
    "Meta Description": "Looking for information on Panzer Paladin? Check out the release date (Jul 21, 2020), developer insights from Tribute Games Inc., and a complete game su...",
    "Alt Text Image": "Official header image for Panzer Paladin game - Steam 975510",
    "Canonical URL": "https://gusku.site/game/panzer-paladin",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Panzer Paladin\", \"description\": \"Looking for information on Panzer Paladin? Check out the release date (Jul 21, 2020), developer insights from Tribute Games Inc., and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tribute Games Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tribute Games Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/975510/header.jpg?t=1627680207\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}