{
    "AppID": 1347970,
    "Name": "Patch Quest",
    "Release date": "May 7, 2021",
    "About the game": "Patch Quest is the only Roguelike-Metroidvania fusion where you can mount and ride EVERY monster in the game! Get ready to Leap, Glide, Tunnel, Bite, Slither, Websling and Explode your way through a shuffling patchwork maze. Survival depends on bending the forces of nature to your own ends! (Supports 2P Local co-op) Discover Patchlantis Once home to a lost civilisation, Patchlantis has now been fully reclaimed by nature. Fierce monsters, rugged terrain and booby-trapped ruins are all a fact of life, here. Even the island's patchwork terrain will get shuffled each night by a powerful storm! Set up camp in the middle of an Open-World map! Jungles, Desert, Mountains and Coastline. Which way will you explore next? Plunder dungeons, unlock shortcuts, and travel deeper into the island. Claim Your Mount! Patchlantis is packed with deadly monsters. But that's not always a bad thing - because your Lasso lets you claim a monster as your mount! Every species can be mounted, and they all have unique skills! Buzzerker can take flight Sandamander can tunnel underground Torrentoise has a hard, reflective shell Combusdile can spit hot fire Velostrich has lightning-fast reflexes There's dozens more monsters with loads more skills! Level Up, Power Up! The Explorer's Guild has your back - we wouldn't drop you into all this danger unprepared! Every single run will help you get a little bit stronger, until you can face even the toughest of beasts. Earn 20 Exploration Gadgets that unlock extra gameplay mechanics Level up your affinity with each monster to gain new Mount Skills Draw power from the plants and ruins scattered over the island Unlock gates, open shortcuts, and expand your reach! Bond with your Pets! As you explore, you'll collect and catalogue the islands many plant species. Bring the right plants back to Base Camp to bond with your Pet Monsters , levelling them up! Every monster has unique likes. You can summon your pets to help out with combat, especially when they're well looked after! Collect over 100 unique plants! Grow your Base Camp garden and level up your pets Summon your pets while exploring the world And travel deeper the next time your explore! Can you unravel the mystery of why Patchlantis fell? I sense that something sinister lies beneath the island's surface. Hey, I see you read all the way to the bottom! Patch Quest is my passion project and I want to keep bringing new mounts, dungeons and treasures to the game for a long time yet to come. Thanks for checking it out - and feel free to join the Discord Community to learn more about future development! :D",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1347970/header.jpg?t=1657214013",
    "Price": 13.99,
    "Developers": "Lychee Game Labs",
    "Publishers": "Curve Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1347970/ss_ee13f244ead7c4276e9ab1804dc42c44de4b7ad1.1920x1080.jpg?t=1657214013,https://cdn.akamai.steamstatic.com/steam/apps/1347970/ss_8a4194155b8eef4df1260b03ff505d2383f5f092.1920x1080.jpg?t=1657214013,https://cdn.akamai.steamstatic.com/steam/apps/1347970/ss_54ae36e86ad23167e2dfbb4e0005d657b6bc040d.1920x1080.jpg?t=1657214013,https://cdn.akamai.steamstatic.com/steam/apps/1347970/ss_b5c2e3d0c225f226738b7349693f4dae8c96564c.1920x1080.jpg?t=1657214013,https://cdn.akamai.steamstatic.com/steam/apps/1347970/ss_64c6f5da7d66c5aba83a022a42df691c28c1c04b.1920x1080.jpg?t=1657214013,https://cdn.akamai.steamstatic.com/steam/apps/1347970/ss_3a6d48b3d89663494fbc5b240d9e5cd30a9317dd.1920x1080.jpg?t=1657214013,https://cdn.akamai.steamstatic.com/steam/apps/1347970/ss_2e3540b9739ba7a659277cadf140502c13f58e5b.1920x1080.jpg?t=1657214013,https://cdn.akamai.steamstatic.com/steam/apps/1347970/ss_6e6e360bc3ba86e7c26aa2a57006b6692b3102d2.1920x1080.jpg?t=1657214013,https://cdn.akamai.steamstatic.com/steam/apps/1347970/ss_2307b648d06017013d82381978dd4194abfd2d3f.1920x1080.jpg?t=1657214013,https://cdn.akamai.steamstatic.com/steam/apps/1347970/ss_fefd27054e734f504648946da65a2f7835e5c424.1920x1080.jpg?t=1657214013",
    "Slug": "patch-quest",
    "Meta Title": "Patch Quest: May 7, 2021, Lychee Game Labs and Full Overview",
    "Meta Description": "Looking for information on Patch Quest? Check out the release date (May 7, 2021), developer insights from Lychee Game Labs, and a complete game summary.",
    "Alt Text Image": "Official header image for Patch Quest game - Steam 1347970",
    "Canonical URL": "https://gusku.site/game/patch-quest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Patch Quest\", \"description\": \"Looking for information on Patch Quest? Check out the release date (May 7, 2021), developer insights from Lychee Game Labs, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lychee Game Labs\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Curve Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1347970/header.jpg?t=1657214013\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}