{
    "AppID": 524390,
    "Name": "PCMark 10",
    "Release date": "Jun 22, 2017",
    "About the game": "PCMark 10 is the latest version in our series of industry standard PC benchmarks. Updated for Windows 10 with new and improved tests, PCMark 10 is also faster and easier to use. The industry standard PC performance benchmark for Windows. Relevant, real-world tests covering a wide range of everyday activities. Accurate and impartial, ideal for comparing systems and choosing upgrades. Created in cooperation with leading hardware and software companies. PCMark benchmarks measure the performance of your PC using tests based on real-world applications and activities. In PCMark 10, these tests include everyday tasks like browsing websites, video chat, writing and spreadsheets, photo and video editing, and playing games. Run the main benchmark and you'll get a PCMark 10 score that you can use to compare your PC with other systems or to see the impact of Windows updates and hardware upgrades. PCMark 10 updates many of the tests in PCMark 8 and adds new ones too. With its new and improved workloads, the main PCMark 10 benchmark takes less than half the time of the equivalent test in PCMark 8. Each benchmark run produces a high-level benchmark score, mid-level test group scores, and low-level workload scores. You can also compare results side by side in the app. PCMark 10 shares the same style of user interface as 3DMark and VRMark. With its familiar layout, it's easy to start benchmarking with PCMark 10. Benchmark tests PCMark 10 The main PCMark 10 benchmark test measures your PC's performance for a wide range of activities from everyday essentials and productivity applications to demanding work with digital media content. PCMark 10 Express PCMark 10 Express is a shorter benchmark that focuses on basic home PC use. It includes the Essentials and Productivity test groups. It is less demanding than the main PCMark 10 benchmark. PCMark 10 Extended PCMark 10 Extended expands the main PCMark 10 benchmark with demanding gaming tests that measure GPU and CPU performance. The PCMark 10 Extended benchmark gives you a complete view of your PC's performance for the widest range of activities. Main features Easy to use, no technical know-how needed. Works with all types of PC, from desktops to tablets. Includes the PCMark 10, Express and Extended benchmarks. Explore your PC's performance with custom runs. In-depth hardware monitoring graphs. Compare results side by side in the app. Automatically save your results offline. Demo features Unlimited runs with the main PCMark 10 test. Other benchmarks, features, and settings are locked.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/524390/header.jpg?t=1632572970",
    "Price": 29.99,
    "Developers": "UL",
    "Publishers": "UL",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/524390/ss_59138c8435902c2f368f2609a94f531761260d56.1920x1080.jpg?t=1632572970,https://cdn.akamai.steamstatic.com/steam/apps/524390/ss_02a6ff082caad1f43ea8ae28213457774bd70250.1920x1080.jpg?t=1632572970,https://cdn.akamai.steamstatic.com/steam/apps/524390/ss_05605a1f89c03ce61c12bd21e559d1f8e3d7fc56.1920x1080.jpg?t=1632572970,https://cdn.akamai.steamstatic.com/steam/apps/524390/ss_128c23a3e21340f5728544550701abe5db1d1911.1920x1080.jpg?t=1632572970,https://cdn.akamai.steamstatic.com/steam/apps/524390/ss_7ce074228546a35a6f0e2de70dd252977f15c39e.1920x1080.jpg?t=1632572970,https://cdn.akamai.steamstatic.com/steam/apps/524390/ss_37d6124f0e2105bfa46f65b7649b3456b224ac5c.1920x1080.jpg?t=1632572970,https://cdn.akamai.steamstatic.com/steam/apps/524390/ss_ec560f391e1527d9287edde1dab18dc86f2d4d9e.1920x1080.jpg?t=1632572970,https://cdn.akamai.steamstatic.com/steam/apps/524390/ss_4a350ef305b612707c8bcbdba6c6ab7240e4be42.1920x1080.jpg?t=1632572970,https://cdn.akamai.steamstatic.com/steam/apps/524390/ss_2cec357cdc9ba091f7dea6a44059a80545d52995.1920x1080.jpg?t=1632572970",
    "Slug": "pcmark-10",
    "Meta Title": "PCMark 10: Jun 22, 2017, UL and Full Overview",
    "Meta Description": "Looking for information on PCMark 10? Check out the release date (Jun 22, 2017), developer insights from UL, and a complete game summary.",
    "Alt Text Image": "Official header image for PCMark 10 game - Steam 524390",
    "Canonical URL": "https://gusku.site/game/pcmark-10",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"PCMark 10\", \"description\": \"Looking for information on PCMark 10? Check out the release date (Jun 22, 2017), developer insights from UL, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 22, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"UL\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"UL\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/524390/header.jpg?t=1632572970\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}