{
    "AppID": 1024970,
    "Name": "Quantum Legend - VR Experience",
    "Release date": "Mar 4, 2019",
    "About the game": "'Quantum Legend vr show' is a game experience software. We provide the visual experience of several scene effects in the game, and a survival mode of fighting to mecha 'sky array'. we have temporarily provided two basic weapons for this game mode. We will update this experienc version regularly, and please look forward to the official playable demo version. With the development and evolution of artificial intelligence technology, in 2033, electronic intelligence gradually got rid of shackles of human beings, realized self-evolution, and became a new intelligent species on the earth. With the rapid development of human science and technology, the use of intelligent prosthetic limbs and artificial organs has gradually matured. The life span of humans undergoing electronic prosthesis transformation is extended to 150 to 200 years old, thus differentiating the new species 'Cyborg'. With independent thinking, infinite life and self-evolution, the electronic intelligence is unwilling to accept human control. Artificial intelligence has completely disappeared, and electronic intelligence has built its own social civilization system. The low fertility rate and the disparity between the rich and the poor have highlighted the disadvantages of the human governments. They have to retreat from the political standpoint and recognize the existence of electronic lives. As time goes by, the contradictions gradually deepened. In 2037, the united front of the human government and the Cyborgs launched a clean-up campaign for electronic lives which triggered the First Quantum War. In 2052, Humans, Cyborgs and Robots has reached an armistice through diplomatic means to divide the control of the earth. The war lasted for fifteen years and left earth in ruins, Humans and Cyborgs lost 35% of their population. The number of Robots has accelerated to multiply doubled compared to before the war. In the postwar years, different life form groups no longer followed the social rules established on the basis of human beings. The era of human domination is completely over, and an earth society controlled by multiple life forms was born. We have developed this stealth action game with a 'Metal Gear' type of sneaking and a ' Shadow of the Colossus ' style giant boss battle. The most important thing is that we use the vr display mode, which is a hardware breakthrough experience in the stealth game category. In order to give the player a real-world sneak sensation, we spent a lot of time on the enemy's AI design to make the enemy's reaction closer to human feedback. Players will find the enemy soldiers quite difficult in the game, so sometimes using the terrain with the aid of props can help get rid of the enemy's pursuit. In addition to the core gameplay, we pay special attention to the plot and worldview settings, so this is a story-driven game. In the future, we will gradually release the latest content to the players in the form of chapters. This release is a visual experience version.that only supports vive and oculus, does not currently support Microsoft mr devices. The oculus experience is especially recommended. touch is the best vr controller in our current experience. If you don't know how to use the controller, please see our manual.（ in quick reference ）",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1024970/header.jpg?t=1552189483",
    "Price": 0.0,
    "Developers": "BeiJing FlyDream Interactive co.,ltd",
    "Publishers": "BeiJing FlyDream Interactive co.,ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1024970/ss_b9dbd5fe8ea3baabd9eee63ba27691e26015d143.1920x1080.jpg?t=1552189483,https://cdn.akamai.steamstatic.com/steam/apps/1024970/ss_fb5166b007f5387fb6402b3b7120fbac745a5a49.1920x1080.jpg?t=1552189483,https://cdn.akamai.steamstatic.com/steam/apps/1024970/ss_a1a056c43608f84666e636d5501ad0e10fabee25.1920x1080.jpg?t=1552189483,https://cdn.akamai.steamstatic.com/steam/apps/1024970/ss_8dcd291b42d937e090e0a83796b7bff9d33a23ce.1920x1080.jpg?t=1552189483,https://cdn.akamai.steamstatic.com/steam/apps/1024970/ss_3b24fd13085c1c2817b99bf968e088e3c0471f5b.1920x1080.jpg?t=1552189483",
    "Slug": "quantum-legend-vr-experience",
    "Meta Title": "Quantum Legend - VR Experience: Mar 4, 2019, BeiJing FlyD...",
    "Meta Description": "Looking for information on Quantum Legend - VR Experience? Check out the release date (Mar 4, 2019), developer insights from BeiJing FlyDream Interactiv...",
    "Alt Text Image": "Official header image for Quantum Legend - VR Experience game - Steam 1024970",
    "Canonical URL": "https://gusku.site/game/quantum-legend-vr-experience",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Quantum Legend - VR Experience\", \"description\": \"Looking for information on Quantum Legend - VR Experience? Check out the release date (Mar 4, 2019), developer insights from BeiJing FlyDream Interactiv...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"BeiJing FlyDream Interactive co.,ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BeiJing FlyDream Interactive co.,ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1024970/header.jpg?t=1552189483\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}