{
    "AppID": 616700,
    "Name": "Rage of Car Force: Car Crashing Games",
    "Release date": "Jul 30, 2020",
    "About the game": "Rage of Car Force is a multiplayer PvP online game that will not allow you to break away, without a feeling of complete military dominance over the enemy. You can smash cars, ram enemy, shoot and drive ahead, but also take revenge on him! Choose a new battle car without leaving the ride and continue the deadly car battles. All modern legendary cars that can be upgraded! Take a look at your favorite car multiplayer shooters in a new way! Improve your steel rage car as you wish: from upgrade armor power to installing a sports body kit or painting in your favorite color. A huge arsenal of all modern weapons! Experience the classic shotgun, pistol gun, machine gun or rocket launcher, but also ultra-modern laser or plasma guns. Try real car crashing multiplayer games! Improve your weapons, upgrade your cars, train your skills to become a more effective shooter on the battlefield! Become a legendary fighter in the Rage of Car Force arena! FEATURES: Improve your car during the battle! Try all modern equipment types for every occasion. Deal max damage to the enemy or to make your armor stronger? You can take everything you need with you or find bonuses directly on the map. Play multiplayer games without limits! No need to worry about running out of gas or ammunition. He came, saw, won - anytime, anywhere. Exciting gaming features! Choose your battle style! Crazy war or planned attacks? A variety of battle arenas! Take part in various gaming tournaments, win prizes in the ratings! Use different types of weapons, select and combine upgrades! Improve combat vehicles! Show your superiority to the enemy. Get rewards not only for luck but also for gaming skills. Choose your playing style! Catching up with gunfights, crushing rams, a test of cunning and perseverance when capturing the flag of opponents, team unity or proof that even one is capable of being the best warrior - all the ways open here. Choose any - and drive ahead!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/616700/header.jpg?t=1657259087",
    "Price": 0.0,
    "Developers": "XDEVS LTD",
    "Publishers": "XDEVS LTD",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/616700/ss_8a61da7f64428afc48f9a7afc26f1fc0ebadd967.1920x1080.jpg?t=1657259087,https://cdn.akamai.steamstatic.com/steam/apps/616700/ss_7594250f6606c1fb645952544ffe3fdabcd65a0f.1920x1080.jpg?t=1657259087,https://cdn.akamai.steamstatic.com/steam/apps/616700/ss_f79b23b8c9c06c3a1e1fdb5927cc2763bc450d74.1920x1080.jpg?t=1657259087,https://cdn.akamai.steamstatic.com/steam/apps/616700/ss_781de0baf936822c7f9b67dae72ed2c146092f1e.1920x1080.jpg?t=1657259087,https://cdn.akamai.steamstatic.com/steam/apps/616700/ss_e63cdd6c7c767ad9c7bfb6c96a08197a525ee590.1920x1080.jpg?t=1657259087",
    "Slug": "rage-of-car-force-car-crashing-games",
    "Meta Title": "Rage of Car Force: Car Crashing Games: Jul 30, 2020, XDEV...",
    "Meta Description": "Looking for information on Rage of Car Force: Car Crashing Games? Check out the release date (Jul 30, 2020), developer insights from XDEVS LTD, and a co...",
    "Alt Text Image": "Official header image for Rage of Car Force: Car Crashing Games game - Steam 616700",
    "Canonical URL": "https://gusku.site/game/rage-of-car-force-car-crashing-games",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rage of Car Force: Car Crashing Games\", \"description\": \"Looking for information on Rage of Car Force: Car Crashing Games? Check out the release date (Jul 30, 2020), developer insights from XDEVS LTD, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"XDEVS LTD\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"XDEVS LTD\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/616700/header.jpg?t=1657259087\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}