{
    "AppID": 397190,
    "Name": "Sengoku Jidai: Shadow of the Shogun",
    "Release date": "May 19, 2016",
    "About the game": "Sixteenth century East Asia is in turmoil. In Japan, the ruling Shogun family has lost its grip on the country. A civil war is brewing as regional lords actively expand their influence. In Korea, the Joseon dynasty is paralysed by factional struggle within the royal court. In China, the might of the Ming dynasty is waning due to rebellions and foreign incursions. These seemingly separate internal conflicts will pave the way for an international war involving the three countries. Sengoku Jidai: Shadow of the Shogun is a turn-based tactical and strategic game set during this turbulent time; primarily focusing on the Japanese Warring States period and Japanese Invasion of Korea. Other armies from East Asia are also made available to simulate different conflicts across the region. Take command of diverse armies which employ varying tactical doctrines. Lead your chosen army and their generals to victory in set-piece historical battles or 'what-if' skirmish situations against an AI or human opponent. Become more ambitious and achieve regional domination through the operational campaign layer where you have to deal with the consequence of preceding battles. To become the Japanese Shogun, to overthrow the Emperor of the Middle Kingdom, or to establish a Pan-Asian Empire, one requires mastery of the battlefield. In this time of turmoil, Asia is yours for the taking! Features : Accurate simulation of East Asian battle in the 16th and 17th centuries, particularly the Sengoku Jidai (Japanese Warring States period) and Imjin War (Japanese invasion of Korea and Chinese intervention). Unique graphic style influenced by Japanese paintings. Historical scenarios covering key engagements of the period Campaign mode allows you to rewrite history as you play through key campaigns of the era. Terrain, manpower, supply, attrition, sieges and economic damage all need to be taken into account. The decisions you make on the strategic map will affect the forces available to you in battle. The results of each battle will have long-term effects on the strength, experience and elan of your units. Classic Turn-based, tile based gameplay. Easy to use interface, hard to master gameplay. Battalion-sized units. Named generals who can influence combat and morale of units under their command as well as engage enemy generals in personal combat. Single player and multiplayer battle modes. Skirmish system allows unlimited “what-if” scenarios using historically realistic armies from carefully researched army lists, on realistic computer generated terrain maps. Armies covered include numerous Japanese clans, Ikko Ikki, Wokou Pirates, Joseon Korean, Ming Chinese, Chinese and Tribal rebels, Eastern and Western Mongols, Jurchen and Imperial Manchu (Qing Chinese) armies. Each faction has multiple lists covering the development of their armies through the 16th and 17th centuries. Skirmish scenarios are randomly generated and include open battle, attack on a defensive position, defence of a defensive position, awaiting reinforcements, enemy awaiting reinforcements, flank march. In skirmishes players can pick their armies from the army list or allow the computer to pick the army for them. Effective AI makes sound tactical decisions. Historical battle AI customised to the historical tactical situation. 6 difficulty levels allow the challenge to increase as you develop your battlefield skills. Numerous different unit organisations, combat capabilities and tactical doctrines allow full representation of tactical differences and developments through the period. Mod friendly game system with built-in map editor. Multiplayer mode allows historical scenarios and “what-if” scenarios to be played by two players using Slitherine’s easy to use PBEM server.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/397190/header.jpg?t=1631260479",
    "Price": 29.99,
    "Developers": "Byzantine Games",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_b5c5288dcb93400a80f8236fbba9c934c260c436.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_6aaabbfde0d4a1b99842ac65e2f11a6b85eaf45b.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_083fec5c6544ee55cf493159d330a1db860d34f9.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_818d089492815e2ebd079c6a6378648e5679198e.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_61f2819d26cf87268b1621945acbe093547d7308.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_41478303d071ec3cfd8c2946f288a707413c6dae.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_ff7a5632cd07a3b5ce8849f99b176b917c277853.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_e1cdf62fe6d5d505275e0d7a7e4ce0fbecac8e4f.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_6eb989b7c14f1f6235856d7d4a45882c582005fc.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_4e60fd1b12f76c59c2d3c3e50012aa4daef69e63.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_683a29e65f764732ef53f44c23ee023526443dd2.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_8a1610512b99d9f3ad8549d7b8ead39053aed3c3.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_a6b53eef262d262d55591ea3bad5edf3f566118a.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_45e301642a991ee1c5df58329b2f23d005d70a8c.1920x1080.jpg?t=1631260479,https://cdn.akamai.steamstatic.com/steam/apps/397190/ss_17973290e4455e8c0d276c8a9c932926399b2a86.1920x1080.jpg?t=1631260479",
    "Slug": "sengoku-jidai-shadow-of-the-shogun",
    "Meta Title": "Sengoku Jidai: Shadow of the Shogun: May 19, 2016, Byzant...",
    "Meta Description": "Looking for information on Sengoku Jidai: Shadow of the Shogun? Check out the release date (May 19, 2016), developer insights from Byzantine Games, and ...",
    "Alt Text Image": "Official header image for Sengoku Jidai: Shadow of the Shogun game - Steam 397190",
    "Canonical URL": "https://gusku.site/game/sengoku-jidai-shadow-of-the-shogun",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sengoku Jidai: Shadow of the Shogun\", \"description\": \"Looking for information on Sengoku Jidai: Shadow of the Shogun? Check out the release date (May 19, 2016), developer insights from Byzantine Games, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 19, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Byzantine Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/397190/header.jpg?t=1631260479\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}