{
    "AppID": 1128430,
    "Name": "Solitaire Match 2 Cards. Valentine's Day",
    "Release date": "Sep 9, 2019",
    "About the game": "Solitaire: Match 2 Cards. Valentine's Day. Matching Card Game isn't just a card game, it's a genuine love story! 120 unique card deals all in the spirit of the most romantic day of the year, all for you! This game is for people who enjoy card games as spider solitaire, pyramid, hearts, klondike, free cell, crescent, golf, addiction, three peaks, yukon, forty thieves, scorpion, gaps, canfield, crazy quilt, algerian, montana, eight off, calculation, clock solitaire. But regardless of the type, solitaire is an age-old game that never loses its flavor! Solitaire is fun to play no matter what your favorite version because the basic premise has withstood the test of time! Match two cards of any suit, try your hand at lots of different card deals, use the joker and let the positive holiday vibes keep on flowing! True love is when you find your ideal partner. Flirting, teddy bears, long moonlit walks, two hearts merged into one, and the sweetest, most romantic feelings. Find all this and more in our wholly unique card deals this February 14! Solitaire: Match 2 Cards. Valentine's Day. Matching Card Game. Matching Card Game. These card pairs are for fans of unique deals! Find and gather card pairs quickly and a special multiplier increases your reward. Use coins to buy bonuses: shuffle, cancel last move, joker. Choose your difficulty level: “Professional” is only for the genuine Solitaire lover! Premium quality romantic music and graphics will whisk you away to the romantic atmosphere of a Valentine’s Day match made in heaven! Ask your sweetheart: “Will you be my valentine?” with the help of Solitaire: Match 2 Cards. Valentine's Day. Matching Card Game. - Card solitaire game for new players and experts alike - Unique game mechanics – choosing pairs of cards - Use different bonuses – mulligan, shuffle, joker - Collect gold cards to complete levels and unlock new locations - Collect bonus cards to get more coins and bonuses - Collect cards fast to make combos and get good rewards - 12 locations, 120 levels and several difficulty modes - For daring players, we offer special tasks and over 20 colorful trophies - Premium graphics to get you in the mood! - Original themed decks and 9 card backs - Beautiful music to help you relax and concentrate on the game",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1128430/header.jpg?t=1568036457",
    "Price": 0.49,
    "Developers": "Creobit",
    "Publishers": "8floor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1128430/ss_edbcba725ca18128c3a0579d278081c317e3cc41.1920x1080.jpg?t=1568036457,https://cdn.akamai.steamstatic.com/steam/apps/1128430/ss_c9243bc002c2980cbe20efcfcec9e8ab91a3e16f.1920x1080.jpg?t=1568036457,https://cdn.akamai.steamstatic.com/steam/apps/1128430/ss_1e34aa68a33354216d2183e36758b91f02e47406.1920x1080.jpg?t=1568036457,https://cdn.akamai.steamstatic.com/steam/apps/1128430/ss_4b43804ef9e322471c1fdb22057118284d74c4bb.1920x1080.jpg?t=1568036457,https://cdn.akamai.steamstatic.com/steam/apps/1128430/ss_7b1466361d180a759407b32bdfceddd012f3d8b4.1920x1080.jpg?t=1568036457",
    "Slug": "solitaire-match-2-cards-valentine-s-day",
    "Meta Title": "Solitaire Match 2 Cards. Valentine's Day: Sep 9, 2019, Cr...",
    "Meta Description": "Looking for information on Solitaire Match 2 Cards. Valentine's Day? Check out the release date (Sep 9, 2019), developer insights from Creobit, and a co...",
    "Alt Text Image": "Official header image for Solitaire Match 2 Cards. Valentine's Day game - Steam 1128430",
    "Canonical URL": "https://gusku.site/game/solitaire-match-2-cards-valentine-s-day",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Solitaire Match 2 Cards. Valentine's Day\", \"description\": \"Looking for information on Solitaire Match 2 Cards. Valentine's Day? Check out the release date (Sep 9, 2019), developer insights from Creobit, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Creobit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8floor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1128430/header.jpg?t=1568036457\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}