{
    "AppID": 1056570,
    "Name": "TAISHO x ALICE episode 1",
    "Release date": "Nov 27, 2019",
    "About the game": "DUALICE(TAISHO x ALICE episodeI) is a fairytale visual novel in which YOU must save your Prince Charming! The game is fully voiced in Japanese (excluding the main character). As you progress through the story, you will be asked to make choices at key points that will lead you to different endings. You will take on the role of the fairytale heroine in order to rehabilitate your chosen love interest and guide him to his 'happily ever after'! At the end of the prologue, you will choose your prince and enter the Looking-Glass World. Each love interest has his own standalone story set in an alternate universe where the relationships between the characters will vary. *Episode 1 features two love interests: Cinderella and Red Riding Hood. [STORY] Once upon a time, in a topsy-turvy world... In the beginning, you find yourself lost within a world of utter darkness. Your memories are gone; even your name is a mystery. But just when the bitter loneliness threatens to break your spirit, you meet Alice—a blond-haired, blue-eyed young man who promptly christens you 'Arisu.' Like you, Alice cannot remember anything beyond his own name. Ignoring his protests, you drag him along with you through the darkness... until you happen upon a massive mirror made of crystal. You stumble through the glass and into the Looking-Glass World, an antiquated fairytale dreamscape that feels oddly familiar... There, amid a colorful cast of gender-swapped fairytale characters, you take on the role of the heroine and join them in their twisted tales. How will the story end? It's up to you! ONCE UPON A TIME, your parents arrange a marriage between you and a man named Cinderella. But there's no way you're marrying a guy you've never met! So you sneak over to his cafe to spy on him... only for him and his brothers to mistake you for a beggar and give you a job you didn't even know you wanted! From now on, you'll live under the same roof as your potential future husband, all while he has no idea of your true identity. Will his love blossom before the clock strikes twelve? ONCE UPON A TIME, you receive a threatening letter in the mail from someone identified only as 'The Wolf.' Thankfully, Officer Red Riding Hood has come to your rescue! Except... he wants to keep you under 24-hour surveillance?! It's just the two of you, all alone in your mansion. But how can you romance Officer Handsome when he keeps you at arm's length? And who is 'The Wolf,' anyway? You'll need to work together to solve the case—and perhaps you'll melt his frosty exterior along the way! 【VOICE】 CINDERELLA -- Daisuke Hirakawa RED RIDING HOOD -- Tomoaki Maeno KAGUYA -- Toshiki Masuda GRETEL -- Takuya Eguchi SNOW WHITE -- Syouta Aoi WIZARD -- Wataru Hatano ALICE -- Yoshitugu Matsuoka WOLF -- Natsuki Hanae HUNTSMAN -- Tomohisa Hashizume",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1056570/header.jpg?t=1655956857",
    "Price": 9.99,
    "Developers": "Primula",
    "Publishers": "pencil",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1056570/ss_68dd26de4aba5c72c2fd7188256c05afa634c7da.1920x1080.jpg?t=1655956857,https://cdn.akamai.steamstatic.com/steam/apps/1056570/ss_7a917a5c1c819f7639059ca8f23783c70dab2844.1920x1080.jpg?t=1655956857,https://cdn.akamai.steamstatic.com/steam/apps/1056570/ss_874de66f2d82783f7f7908ce4f651278ba61c0ab.1920x1080.jpg?t=1655956857,https://cdn.akamai.steamstatic.com/steam/apps/1056570/ss_8a5f3795ef12847a395192d3f0623d96c0594bd3.1920x1080.jpg?t=1655956857,https://cdn.akamai.steamstatic.com/steam/apps/1056570/ss_f84b2ccbe4a59912a7e733e8d298bc76a8f7276b.1920x1080.jpg?t=1655956857,https://cdn.akamai.steamstatic.com/steam/apps/1056570/ss_55980fddcc6588dbac66afce243a47b02531ea42.1920x1080.jpg?t=1655956857,https://cdn.akamai.steamstatic.com/steam/apps/1056570/ss_b341f474944cce880d3d1b62c0b220e4a5aa0c34.1920x1080.jpg?t=1655956857,https://cdn.akamai.steamstatic.com/steam/apps/1056570/ss_da8bd402302c776adbc9b70ca4e6d9b54cd92bf8.1920x1080.jpg?t=1655956857",
    "Slug": "taisho-x-alice-episode-1",
    "Meta Title": "TAISHO x ALICE episode 1: Nov 27, 2019, Primula and Full ...",
    "Meta Description": "Looking for information on TAISHO x ALICE episode 1? Check out the release date (Nov 27, 2019), developer insights from Primula, and a complete game sum...",
    "Alt Text Image": "Official header image for TAISHO x ALICE episode 1 game - Steam 1056570",
    "Canonical URL": "https://gusku.site/game/taisho-x-alice-episode-1",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TAISHO x ALICE episode 1\", \"description\": \"Looking for information on TAISHO x ALICE episode 1? Check out the release date (Nov 27, 2019), developer insights from Primula, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 27, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Primula\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"pencil\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1056570/header.jpg?t=1655956857\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}