{
    "AppID": 1755580,
    "Name": "The Jackbox Party Starter",
    "Release date": "Jun 29, 2022",
    "About the game": "The Jackbox Party Starter is coming soon to help get your party started! We’ve gathered three of our most beloved games into one handy pack! With so many titles to choose from, we decided to help take out some of the guesswork and hand you three games that are sure to give you hours of entertainment! We’ve updated Quiplash 3, Trivia Murder Party 2 and Tee K.O. with all of our most recent settings and improvements such as moderation, subtitles, content filtration, and settings menu upgrades. Additionally, we’ve fully localized the voice acting, subtitles and even credit songs in French, Italian, German and Spanish! No extra controllers needed; players use their phones or tablets to play along! Got a bigger group? Play with up to 8 players and up to 10,000 audience members. Quiplash 3 Players enter a head-to-head battle of wits by answering a comedic prompt and letting the other players (and the audience) decide which they like best! Is that it? Uh, no. Quiplash 3 now has a Moderation feature that allows responses to be seen prior to being displayed on screen. Additionally, a new filtering option allows profanity and hateful speech to be blocked before even reaching moderation. So that’s it, right? Thank you for asking, but no! Quiplash 3 has a new final round called Thriplash, where the prompts ask players to enter three responses. That’s three times the chances to be funny! Originally part of The Jackbox Party Pack 7, Quiplash 3 in The Party Starter has been fully revamped with new features and localizations in French, Italian, German and Spanish! Tee K.O. In Tee K.O., players are on the clock to create drawings and write as many slogans as possible. The pictures and slogans are then given out at random. Whoever combines their drawings and slogans to create the best t-shirt wins, as designs are pitted against each other in head-to-head battles. The t-shirts with the highest votes in each round must survive the final gauntlet to become the best. Tee… K.O. Get it? Perhaps the most beloved part of Tee K.O. is the fact that you can make your stupid great creations a reality and purchase actual versions of your t-shirts. Just click the gallery button at the end of the game or view your past galleries at Jackbox.tv. Originally in The Jackbox Party Pack 3, Tee K.O. has been fully revamped with new features and localizations in French, Italian, German and Spanish! We made it easy to share your t-shirts on Facebook and Twitter. Be sure to tag @jackboxgames to show us what you’ve made! For some reason, it’s a lot of shirts with hotdogs…. Trivia Murder Party 2 Still on the run from the police after the events of the first Trivia Murder Party, the serial killer host has moved into the Murder Hotel where he grew up. In the past his family killed unsuspecting guests at their hotel, but now the host is using the hotel to run his bizarre game show… where he kills unsuspecting guests. Like the first Trivia Murder Party, players answer trivia questions–and answering incorrectly will send you to the Killing Floor to play mini-games that can kill. New mini-games include avoiding swords jabbed into a magician’s box, tattooing the killer’s back, and most terrifying of all… using a rotary phone! Trivia Murder Party 2 is packed full of new surprises. Can you finish the game with a bomb strapped to your body? What would you do if you could haunt one of the other players? Would it be weird if the killer thought you were his mother? Originally in The Jackbox Party Pack 6, Trivia Murder Party 2 has been fully revamped with new features and localizations in French, Italian, German and Spanish!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1755580/header.jpg?t=1656563492",
    "Price": 19.99,
    "Developers": "Jackbox Games, Inc.",
    "Publishers": "Jackbox Games, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1755580/ss_fea373e452a1143747585b1ef0b7a58d42a5eefa.1920x1080.jpg?t=1656563492,https://cdn.akamai.steamstatic.com/steam/apps/1755580/ss_f7856cf2de2177a93152bbcb2aa83aab801e2b0f.1920x1080.jpg?t=1656563492,https://cdn.akamai.steamstatic.com/steam/apps/1755580/ss_8bc0017288c21ae06bea1c02298f84927724d1aa.1920x1080.jpg?t=1656563492,https://cdn.akamai.steamstatic.com/steam/apps/1755580/ss_84016513b301435727ba2a621b6154332222b404.1920x1080.jpg?t=1656563492,https://cdn.akamai.steamstatic.com/steam/apps/1755580/ss_0ab66e7688b051444a940e778f8dbcb0e32f3676.1920x1080.jpg?t=1656563492,https://cdn.akamai.steamstatic.com/steam/apps/1755580/ss_fdaa23aa321f94dc9a373218409187d717fdf894.1920x1080.jpg?t=1656563492,https://cdn.akamai.steamstatic.com/steam/apps/1755580/ss_2f0054a3d4bdc40ed6b46f497c81636c3c4a4d0a.1920x1080.jpg?t=1656563492,https://cdn.akamai.steamstatic.com/steam/apps/1755580/ss_4e22cf628abfac18bd505315acc70321e9836300.1920x1080.jpg?t=1656563492,https://cdn.akamai.steamstatic.com/steam/apps/1755580/ss_9bf14b797556994ddccff9b684b3c0551858496b.1920x1080.jpg?t=1656563492,https://cdn.akamai.steamstatic.com/steam/apps/1755580/ss_57563cc35892e925c9c481b724beb96a79844e88.1920x1080.jpg?t=1656563492,https://cdn.akamai.steamstatic.com/steam/apps/1755580/ss_4b86dfade6521b46d59e6ed6e03619db1d5b4c16.1920x1080.jpg?t=1656563492,https://cdn.akamai.steamstatic.com/steam/apps/1755580/ss_9bba3a3185e658347a8cacb2d4d86c51eaf3cfe2.1920x1080.jpg?t=1656563492,https://cdn.akamai.steamstatic.com/steam/apps/1755580/ss_4939bf1cb106e18d172ab3a578a6eb7142f870f9.1920x1080.jpg?t=1656563492",
    "Slug": "the-jackbox-party-starter",
    "Meta Title": "The Jackbox Party Starter: Jun 29, 2022, Jackbox Games, I...",
    "Meta Description": "Looking for information on The Jackbox Party Starter? Check out the release date (Jun 29, 2022), developer insights from Jackbox Games, Inc., and a comp...",
    "Alt Text Image": "Official header image for The Jackbox Party Starter game - Steam 1755580",
    "Canonical URL": "https://gusku.site/game/the-jackbox-party-starter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Jackbox Party Starter\", \"description\": \"Looking for information on The Jackbox Party Starter? Check out the release date (Jun 29, 2022), developer insights from Jackbox Games, Inc., and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jackbox Games, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jackbox Games, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1755580/header.jpg?t=1656563492\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}