{
    "AppID": 1736400,
    "Name": "TramSim Munich - The Tram Simulator",
    "Release date": "Nov 4, 2021",
    "About the game": "Discover with TramSim Munich a new city with numerous landmarks as well as the low-floor tram model R2.2.b! Transport your passengers on three detailed tram lines in full length through the centre of the Bavarian capital. Historic buildings, squares and museums have been displayed close to reality and authentic AI traffic as well as dynamic passenger and pedestrian behaviour bring the city to life. Each of the three lines has it’s highlights: the line 23, for example, starts at the Münchner Freiheit and the line 27 is not only in use during the day, but also at night. The type R2.2b tram is a highly detailed reconstruction of the model and convinces with its special driving dynamic and high quality. The vehicle is completely repaintable and can thus appear in other cities’ designs as well. Original announcements and true to the original line alternating operation round up the tram experience. TramSim Munich offers realistic operating procedures and equipment as well as a detailed track model. The Munich route network with countless hours of fun awaits you! Line 23 (Münchner Freiheit – Schwabing Nord) Line 27 (Petuelring – Sendlinger Tor) Line 28 (Scheidplatz – Sendlinger Tor) Highly detailed reconstruction and model quality Great functionality Special driving dynamics Widely used vehicle series in Germany → fully repaintable for other cities Authentic line alternating operation Original announcements Realistic operating procedures and operating equipment (signal system, stop equipment, catenary system) Detailed track model Dynamic passenger and pedestrian behaviour Authentic AI traffic (individual traffic and AI tram) The type R2.2b is part of the R series, the very first low-floor trams of the MVG. The vehicles of the type R2.2 were, after 15 years of usage, modernized from the ground up and are in operation since 2011, known as series R2.2b. Interior and exterior are in the modernised design, consisting of blue and white-aluminum. New support bars, extended passenger information, and sliding doors are marks of the redesign. Reconstructed with a focus on detail and quality, Munich's R2.2b is driven through the virtual city. The vehicle is styled in the modern redesign of the MVG and provided with diverse functionality and it's unqiue behavior of movement. Since this model is used in many cities in Germany, the tram is fully repaintable to be able to style it in any design you want to. The R2.2b is known for its unique and sometimes unintuitive driving dynamics. Because of the way the tram is built, the individual tram-bodies influence each other. At the end of a curve, this behavior leads the train to sway into the other direction. Even some curbs in the city have been cut out to accommodate this! As can be expected from TramSim Vienna, the tram in Munich is realised with realistic, and true-to-detail functionality. Discover the R2.2b with it’s authentic driving dynamics. Wether Open World or scheduled service with timetable, the full TramSim experience is waiting for you in Munich! All features you know and love from TramSim Vienna, will as well be found in TramSim Munich. Even more than that! A dynamic weathersystem, handicapped people, e.g. people in wheelchairs, and a lot more new features await you in the beautiful city. The route 23 runs from the Münchner Freiheit, over the Schwabinger Tor, and finally to Schwabing Nord. It is a special route in the city, as it starts in a specially built station-building at the Münchner Freiheit and operates on an independent track body and its own bridge structure. Time of travel for those 7 stops is about 8 minutes and therefore suits itself for short playing sessions, as a complete tour can be finished in 25 minutes. The route 27 runs in the heart of Munich, starting from the Sendlinger Tor over Karlsplatz, Karolinenplatz, Kurfürstenplatz, and Hohenzollernplatz, to the Petuelring. This route is not just operating by day, it is also used by night. Time of travel for those 15 stops along the route is about 20 minutes. Going past so many known attractions, like the Pinakotheken or the Alte Börse, time will just fly! The route 28 starts from the Sendlinger Tor as well and runs over Karlsplatz and Karolinenplatz to the Kurfürstenplatz. There it splits from the shared route with route 27 and travels to the Scheidplatz. Time of travel for the 12 stops along the route is about 16 minutes. Try it yourself! Become a tram-driver and drive our route network through the beautiful Munich.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1736400/header.jpg?t=1648125704",
    "Price": 34.99,
    "Developers": "ViewApp",
    "Publishers": "Aerosoft GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_a3e9bf1be645f329d3d8aa39ff63367f0bff05fa.1920x1080.jpg?t=1648125704,https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_3037ea6594d4a6c1cf187c69a4f486b6bd8ef614.1920x1080.jpg?t=1648125704,https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_a681d7e2c35d1f0bfbe581592c5dc2d42f51f16a.1920x1080.jpg?t=1648125704,https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_1a50d67d351ae38c58000f70a8859cc2c4eb9fac.1920x1080.jpg?t=1648125704,https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_a95662dcc543c99f8d78fc58ac337a96d4863f70.1920x1080.jpg?t=1648125704,https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_f4a89502704744d3886c34546375ff065884a83e.1920x1080.jpg?t=1648125704,https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_07b2f6320e22f69101386ebdd5efd363b99eb9a5.1920x1080.jpg?t=1648125704,https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_dc48330d52ea2f5921ba6d2aab151eec9603bfea.1920x1080.jpg?t=1648125704,https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_d6f92bb7b2df6016d9d1a1cc75f31311ef5bcdad.1920x1080.jpg?t=1648125704,https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_c08ee8352e897c46c8765d053844b77b4087f1d3.1920x1080.jpg?t=1648125704,https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_b2bc8e5cb6d3816d49c20fb8bc42ea7c55e671f7.1920x1080.jpg?t=1648125704,https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_ab2e9c915f8bc502f60b4b96f580794d6fcd3f19.1920x1080.jpg?t=1648125704,https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_8803921c9afc2743b3f7aa48e8501ead809f6490.1920x1080.jpg?t=1648125704,https://cdn.akamai.steamstatic.com/steam/apps/1736400/ss_9a650da38834ca26d1432f0bad4933287dd53f24.1920x1080.jpg?t=1648125704",
    "Slug": "tramsim-munich-the-tram-simulator",
    "Meta Title": "TramSim Munich - The Tram Simulator: Nov 4, 2021, ViewApp...",
    "Meta Description": "Looking for information on TramSim Munich - The Tram Simulator? Check out the release date (Nov 4, 2021), developer insights from ViewApp, and a complet...",
    "Alt Text Image": "Official header image for TramSim Munich - The Tram Simulator game - Steam 1736400",
    "Canonical URL": "https://gusku.site/game/tramsim-munich-the-tram-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TramSim Munich - The Tram Simulator\", \"description\": \"Looking for information on TramSim Munich - The Tram Simulator? Check out the release date (Nov 4, 2021), developer insights from ViewApp, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"ViewApp\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aerosoft GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1736400/header.jpg?t=1648125704\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}