{
    "AppID": 757300,
    "Name": "Truberbrook / Trüberbrook",
    "Release date": "Mar 12, 2019",
    "About the game": "»Trüberbrook« is a thrilling mystery-sci-fi adventure game. Enjoy an adventurous vacation to a 1960's parallel universe! A Sci-Fi-Mystery Adventure Game with handmade scenery. Imagine yourself on a vacation to Europe in the late sixties. Now, picture yourself as a young American scientist; Hans Tannhauser. Yes, that's your name in this scenario. While you're at it, think of Trüberbrook, a remote village in rural, mountain-sloped and densely forested cold-war Germany. Because, that's where you somehow end up after hitting the continent. But who cares, you won the trip in a lottery! Or at least, that’s how it seems. But don't fear, instead of getting some rest, you could find yourself having to save the world … Suspense! Mystery! Thrills! After all, it's a single player sci-fi mystery adventure game. We want to keep you entertained! Join American student Tannhauser, stranger in a strange land Set in cold-war rural Germany in the late 1960s Inspired by Twin Peaks, The X-Files, Stranger Things &amp; Star Trek Indulge in universal themes such as love, friendship, loyalty, self-discovery and dinosaurs Handmade miniature scenery! Full voice acting in both English and German! Atmospheric, moody soundtrack Up to 10 hours of super exciting gameplay! Trüberbrook was successfully funded on Kickstarter in December 2017 within only 30 hours. The game will be enhanced by several new features thanks to the joint force of our 5078 wonderful backers! &lt;3 The year is 1967. The world policy is dominated by the Cold War and Vietnam, Russia and America are racing to the moon. At the same time in Europe, students take to the streets from Paris to Berlin. On a larger scale, the world is locked in turmoil, but most people are unaware of the events unfolding in an overlooked, sleepy part in the German province. Hans Tannhauser , an American student in his late twenties is caught by surprise: Out of the blue, he wins a trip to a small, German village, Trüberbrook . Truber-what? No idea! It doesn’t help he can’t remember taking part in any lottery in the first place … Happy to put some distance between him and his Ph.D. in quantum physics, he makes his way to Trüberbrook, Germany, bursting with curiosity. But shortly after his arrival, inexplicable things start to happen: A mysterious stranger breaks into his room at the Guesthouse Waldeslust and steals a paper on physics. But who would do that? And why? Gradually, he gets to know the various villagers and spa guests, one more peculiar than the other. Only young anthropologist Greta Lemke, who is on a research trip to Trüberbrook, seems normal to him. Before he knows it, Greta becomes Tannhauser’s accomplice on the adventure of a lifetime ! It slowly dawns on the aspiring physicist that his presence in Tüberbrook is not accidental – he is here to save the world! As the story proceeds, Tannhauser teams up with Greta Lemke , a student of paleoanthropology, and bumps into the enigmatic inventor Lazarus Taft . Hans Tannhauser is an American physics student in his mid-twenties – and a clever one at that. The adorable little fellow is well-read, always curious and of a deeply friendly nature. Greta Lemke was always the fiercest kid in the sandbox; cute but merciless if someone dared interrupting her excavations of twig bones and toy artefacts. The somewhat overenthusiastic student of paleoanthropology arrives in Trüberbrook on an adventure to unravel the mysteries surrounding the village. As much a reclusive inventor as it gets, Lazarus Taft quickly became talk of the town due to his superior card playing. There must be a reason he bought this costly old mansion in Trüberbrook, of all places … What's up with Lazarus Taft? Trüberbrook is full of quirky villagers, tourists and strangers – like the gruffy but warm-hearted innkeeper Trude or her daughter Leni, 'the weird kid' from Trüberbrook Elementary. And there's the old baron, a veteran of two world wars, or Lessing, the prototype of modern day conspiracists. And of course Trübi, the legendary lake monster. To name a few. One of the most distinctive features of the game is the unique visual style. The sceneries are purely handmade. 'Handmade' as in: 'Manufactured using real hands!' And fingers! Not the most efficient way of doing things, but certainly the most inefficient one. We're loving it, though! Look at what we do here, piece by piece, by the sweat of our brows. Every little detail is custom-made. The models are digitized using a technique called photogrammetry and later retopologized. This way we get highly detailed polygon models that blend perfectly with our digital characters. It is a lot of work, but also quite exciting! You may ask yourself, how can they reach this level of detail? Are there very tiny people involved? They can't accomplish all of this with mere human hands, right? Well yes, we can! The answer might be our abundance of professional hands. Twenty-four seven at our disposal in all shapes and colors, they get things done! Every scene gets an individual treatment and is staged with actual physical lighting. This allows us to simulate different hours of the day or weather conditions. Even a change of seasons is possible just by redecorating the set with real tiny little snowflakes, no joke. This way we achieve an exceptional and magical look that visually reflects the world of Trüberbrook. Trüberbrook is a story-driven adventure game with a strong focus on characters and the narrative, but includes a lot of puzzles that need to be solved to progress the story. The puzzles are designed to integrate into the narrative. You navigate Tannhauser through the different sceneries from a third person perspective, usually in long distance shots to intensify the impression of peeking into a little diorama. The story unfolds as you interact with your environment, talk to other characters and solve puzzles. These range from inventory-based puzzles to social challenges (such as persuading other characters) up to passing unsettling psycho tests. For the console versions, we came up with a very intuitive controller input, allowing you to move the line of sight and walking directions independently. For the PC versions, you can choose between classic point and click mouse controls, and the controller navigation. The soundtrack of Trüberbrook is an original composition to fit the mood of the game – sort of a tranquil doom jazz. Inspirations come from the works of Tom Waits , Angelo Badalamenti , Mark Lanegan , Timber Timbre or Bohren &amp; der Club of Gore . The soundtrack is directed by Sebastian Nagel &amp; Albrecht Schrader. We've spent a lot of time working on a voice acting concept that joins in with the genetic code of the game. Since the protagonist is an American in the midst of a bunch of Germans, we wanted to reflect this in our choice of actors: In the international English audio, the main character Tannhauser speaks native American English, while all of the townspeople of Trüberbrook sport genuine German accents!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/757300/header.jpg?t=1649753088",
    "Price": 3.59,
    "Developers": "btf",
    "Publishers": "Headup,WhisperGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/757300/ss_333f8d443e1c33f5adffb4d245b033bf8f7ecc1e.1920x1080.jpg?t=1649753088,https://cdn.akamai.steamstatic.com/steam/apps/757300/ss_cd57e1fdf36114f9561b50b076a7c8ed32fed53d.1920x1080.jpg?t=1649753088,https://cdn.akamai.steamstatic.com/steam/apps/757300/ss_94e7c0669b1d6454696a6d5c288719f9a76c5ef0.1920x1080.jpg?t=1649753088,https://cdn.akamai.steamstatic.com/steam/apps/757300/ss_b37ecb4bf47ddd33cd79a558b690195778a1dccc.1920x1080.jpg?t=1649753088,https://cdn.akamai.steamstatic.com/steam/apps/757300/ss_49c76495398b930607f07578850578033c6a1f1b.1920x1080.jpg?t=1649753088,https://cdn.akamai.steamstatic.com/steam/apps/757300/ss_dd3a301f14761416e86d729df889217cbbcc5b13.1920x1080.jpg?t=1649753088,https://cdn.akamai.steamstatic.com/steam/apps/757300/ss_05ad263c60693a1bf3f3a9ee74f22f11e32762bb.1920x1080.jpg?t=1649753088",
    "Slug": "truberbrook-trberbrook",
    "Meta Title": "Truberbrook / Trüberbrook: Mar 12, 2019, btf and Full Ove...",
    "Meta Description": "Looking for information on Truberbrook / Trüberbrook? Check out the release date (Mar 12, 2019), developer insights from btf, and a complete game summary.",
    "Alt Text Image": "Official header image for Truberbrook / Trüberbrook game - Steam 757300",
    "Canonical URL": "https://gusku.site/game/truberbrook-trberbrook",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Truberbrook / Tr\\u00fcberbrook\", \"description\": \"Looking for information on Truberbrook / Tr\\u00fcberbrook? Check out the release date (Mar 12, 2019), developer insights from btf, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"btf\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Headup,WhisperGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/757300/header.jpg?t=1649753088\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}