{
    "AppID": 1585590,
    "Name": "VirtualRehabART4Health",
    "Release date": "May 7, 2021",
    "About the game": "VR designed for awe and rehab. The experience combines virtual art, technology, and rehabilitation. When we, in reality, are contained to our home, nursing home, or hospital room. We can in the virtual reality experience wonder in new, calming worlds. A remarkable intersection between art, pain relief, and exercise. some voices in betatesting: wow! So beautiful and peaceful! I want to use this as a relaxing break in my computer work! I love the small figures in the sea landscape and the growing flowers in the yoga session. So beautiful music and peaceful surroundings! The voice of the psyiotherapist is so relaxing! So nice to walk around, looking for growing flowers and make the waterdrops water the landscape. I forgot my pain and that I am in a boring institution! thank you! so full of fantasy and awe! Within the VR-headset, the player is surrounded by calming forests and oceanscapes, sounds of nature, and classical music. The player can also perform yoga and physiotherapy exercises with a personal, virtual trainer. By orienteering with a map in a 3D environment, the player can practice and develop their cognition. The exercises and movements have been designed by professional yoga instructors and physiotherapists that work with rehabilitation. Virtual Rehab ART4Health VR design Åsa Egnér Programming Johnny Nyman, Softwarehut Polen Modelling Carolina Ask, Evermotion, Polen Music Satie, Grieg, Debussy, Bach, Mozart, Ravel, Schumann. Pianist Jonathan Sersam Sound Hans Nilsson och Joar Egnér Löfberg Motion Capture HumLabb, Lunds Universitet Video David Blomquist Yoga- and voice instruction Michaela Tellenmark Physiotherapy Ulrika Björck, Caroline Dahlberg Voice instruction physiotherapy Oliver Lindman Dancer Osama Al Shihabi Character modelling Peter Flygenring Toft Business advisor Anne-Sofie Frey. Created with support from Vinnova Innovation. Credits: Theis Madsen MD&amp;CEO CopenRealityApS. Virtual Rehab has been further developed from a prototype called “Virtual Recovery”. The basic idea and prototype were developed in a collaborative project between VR designer Åsa Egnér, Kreativitetsbanken and Dr Theis Madsen, CopenReality ApS. The prototype was funded by Cross4Health. ©VirtualRehabART4Health MENU In the game’s menu the player can choose options for language, environment, exercises, standing or sitting, and easy or more advanced difficulty. Easy difficulty excludes movements above shoulder height. EXPLORATION: Yoga, Physiotherapy The player can explore visual and calming worlds at their own pace, either by sitting or standing. By using the controller, the player moves through ocean- and forest environments, and makes their way to either a yoga- or physio-therapy exercise with different difficulty levels. 3D Orienteering VR enables a unique opportunity to train 3D orienteering via a map. This may develop the coordination between mind and body, since the player learns to navigate to different targets. Yoga och Physiotherapy Through paintings, the player enters either an oceanscape or a redwood forest. They are then automatically transported to a previously chosen yoga- or physiotherapy session. Rewards Besides relaxation, exploration, and exercise, the player is rewarded with for instance growing flowers and trees, northern lights, and water drops. These rewards and the beautiful environments and sounds can create awe and motivate the player to return to the game and the exercise. Personal Trainer The player exercises with other 3D-characters, which simulates a group session with a virtual instructor. Research There are many scientific reports about the advantages of VR. In virtual reality, the brain is ”tricked” into believing that it is in a new location. VR distracts from pain, and can relieve stress and anxiety. Technology All characters in the game are created through motion capture technology in co-operation with the university of Lund’s Humlabb. To play Virtual Rehab, you need: ● a VR headset with the associated controller for Oculus rift or HTC Vive. ● a copy of the game which will be available on digital platforms such as Steam. ● a computer that meets the system requirements for VR. MENU: FOREST/GARDEN SWEDISH/ENGLISH FOREST – explore, physiotherapy ● Press and release the thumbstick to move forward, choose directions with the pointer. ● Explore nature, and water the environment with dew drops along the way. ● Training: the instructor begins the exercise when the player enters the ring of stones. ● Imitate the instructor’s movements. 4 different exercise locations. ● After the training session: hit dewdrops with the front trigger, so that trees grow. Orienteering forest ● Press and release the thumbstick to move forward, choose directions with the pointer. ● Orienteering: open the map with the front trigger and navigate toward the goal. ● At the goal, move potential rocks with the side button, aim at the dewdrop. ● 3 orienteering goals appear on the map per round. Physiotherapy, single ● In the menu, choose options for standing, sitting, and easy or advanced difficulty. ● Travel through a painting to the exercise. ● Aim at the dewdrops with the front trigger after a finished session of physiotherapy. ● Enjoy growing trees and a beautiful night sky that finishes the session. OCEAN – explore, yoga ● Press, and release, the thumbstick to move forward, aim with the pointer. ● Walk around in nature, watch flowers and water the environment with dewdrops. ● Yoga: when the player enters the ring of stones, the instructor begins the exercise. ● Imitate the instructor’s movements. Put down the hand controller. ● The flowers grow during the yoga movements. 4 different exercise locations. Orienteering ocean ● Press and release the thumbstick to move forward, aim with the pointer. ● Orienteering: open the map with the front trigger and navigate toward the goal. ● At the goal, move rocks with the side button, aim at dewdrops so that flowers grow. ● On the map a new goal appears which the player can find, three goals per round. Yoga, separate ● In the menu, choose standing, sitting, easy or advanced difficulty. ● Travel through a painting to the yoga exercise. The controller can be excluded. ● Imitate the instructor’s movements. ● Enjoy growing trees and a starry night sky that concludes the round. Virtual Rehab ART4Health",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1585590/header.jpg?t=1620549874",
    "Price": 2.99,
    "Developers": "VR design Åsa Egnér, Modelling Evermotion, Carolina Ask,,Programming Johnny Nyman Softwarehut,Character modelling Peter Flygenring Toft,Pianist Jonathan Sersam Sound Hans Nilsson Joar Löfberg Dancer Osama Al Shihabi,Motion Capture HumLabb, Lunds Universitet Video David Blomquist Yoga Michaela Tellenmark Physiotherapy Ulrika Björck, Caroline Dahlberg Oliver Lindman Credit: Theis Madsen MD&CEO CopenRealityApS",
    "Publishers": "VirtualRehabART4Health",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1585590/ss_33239e1f685dcb3f258ce6db9ef5752ef03edd1a.1920x1080.jpg?t=1620549874,https://cdn.akamai.steamstatic.com/steam/apps/1585590/ss_fbdb5d56bcb7e73cb0aaa79cc4762013d71c51e4.1920x1080.jpg?t=1620549874,https://cdn.akamai.steamstatic.com/steam/apps/1585590/ss_e5f5cf09574506d743e8a3ba1e9b9dade9149d36.1920x1080.jpg?t=1620549874,https://cdn.akamai.steamstatic.com/steam/apps/1585590/ss_e0baa6d46308673ea7e8e425e7ff55d61438192c.1920x1080.jpg?t=1620549874,https://cdn.akamai.steamstatic.com/steam/apps/1585590/ss_88418533ccabe03583e85cfd0733055ac0243acc.1920x1080.jpg?t=1620549874",
    "Slug": "virtualrehabart4health",
    "Meta Title": "VirtualRehabART4Health: May 7, 2021, VR design Åsa Egnér,...",
    "Meta Description": "Looking for information on VirtualRehabART4Health? Check out the release date (May 7, 2021), developer insights from VR design Åsa Egnér, Modelling Ever...",
    "Alt Text Image": "Official header image for VirtualRehabART4Health game - Steam 1585590",
    "Canonical URL": "https://gusku.site/game/virtualrehabart4health",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VirtualRehabART4Health\", \"description\": \"Looking for information on VirtualRehabART4Health? Check out the release date (May 7, 2021), developer insights from VR design \\u00c5sa Egn\\u00e9r, Modelling Ever...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"VR design \\u00c5sa Egn\\u00e9r, Modelling Evermotion, Carolina Ask,,Programming Johnny Nyman Softwarehut,Character modelling Peter Flygenring Toft,Pianist Jonathan Sersam Sound Hans Nilsson Joar L\\u00f6fberg Dancer Osama Al Shihabi,Motion Capture HumLabb, Lunds Universitet Video David Blomquist Yoga Michaela Tellenmark Physiotherapy Ulrika Bj\\u00f6rck, Caroline Dahlberg Oliver Lindman Credit: Theis Madsen MD&CEO CopenRealityApS\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VirtualRehabART4Health\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1585590/header.jpg?t=1620549874\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}