{
    "AppID": 1141020,
    "Name": "Adventure Escape Mysteries",
    "Release date": "May 5, 2020",
    "About the game": "Experience the unique puzzles and critically-acclaimed stories enjoyed by tens of millions of players. Investigate cryptic clues, unravel a mystery, and solve puzzles in beautifully illustrated adventures! Play An Epic story Solve a murder mystery in the Trapmaker trilogy. Play as Detective Kate Gray and walk in her shoes as you investigate a mysterious murder. Interrogate suspects and use your own cunning to discover everyone's secrets. Play as notorious pirate Captain Conroy in Pirate's Treasure ! Conroy is about to get the score of his life, when he discovers a treasure map that sends him on an adventure across the high seas. Play The Covenant , the premium horror game! Sam goes on a camping trip with her high school friends. An ancient evil awakens, forcing you to choose who will be sacrificed to The Hunger each night! Will anyone escape? Solve Unique Puzzles Use your observation skills, deductive reasoning, and cunning to solve our puzzles. Collect treasures and tools in your inventory, find clues, and enjoy a brilliant escape room experience from the comfort of your mobile device. Hear What Our Players Say “I'm obsessed with your games, I've played them all. No other games are comparable. Please come out with a new one! Great job!' 'I just love your games. I hope you continue making such games. They are just amazing, exciting, thrilling and not that tough that you lose interest in the game!' “These are the absolute best escape room games available!' Support An Indie Company We're an indie game studio that loves making games and puzzles. In fact, our team has been to over a hundred escape rooms. At Haiku, we have a game design philosophy we call “satisfying challenge.” We think puzzles should be tough but solvable, so we spend a lot of time designing unique puzzles that we think you'll love! Key Features The most ingenious escape room gameplay. Investigate the environment and interpret clues to solve the puzzles! Explore 100+ beautifully illustrated scenes Play unique puzzles that delight the mind Save your progress so you can play on multiple devices! More stories to come! Third Party Account We use a 3rd party account from a provider called Playfab. The account is not required to play the game, but players who are signed in can also sync their progress with their mobile device.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1141020/header.jpg?t=1601349624",
    "Price": 0.0,
    "Developers": "Haiku Games Co",
    "Publishers": "Haiku Games Co",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1141020/ss_e966d31843062137dbc59b26e7e5351a1e863c37.1920x1080.jpg?t=1601349624,https://cdn.akamai.steamstatic.com/steam/apps/1141020/ss_5319365b1ed9ae890c9168c2a7dd774b10d6c344.1920x1080.jpg?t=1601349624,https://cdn.akamai.steamstatic.com/steam/apps/1141020/ss_d1c2022a427a8b9ed7c4c506c93db1ee087ab9d9.1920x1080.jpg?t=1601349624,https://cdn.akamai.steamstatic.com/steam/apps/1141020/ss_fd8c149eccfdd1fa3d4594412415a2083d4e7744.1920x1080.jpg?t=1601349624,https://cdn.akamai.steamstatic.com/steam/apps/1141020/ss_e4284b201d1738824173c642e12032d5dcbe693b.1920x1080.jpg?t=1601349624,https://cdn.akamai.steamstatic.com/steam/apps/1141020/ss_8c538060fac7703efb7d5f7908b10f823ae7c21e.1920x1080.jpg?t=1601349624,https://cdn.akamai.steamstatic.com/steam/apps/1141020/ss_4e847d85eb3b9a3f8a127cbe20b79c4af910ee9a.1920x1080.jpg?t=1601349624",
    "Slug": "adventure-escape-mysteries",
    "Meta Title": "Adventure Escape Mysteries: May 5, 2020, Haiku Games Co a...",
    "Meta Description": "Looking for information on Adventure Escape Mysteries? Check out the release date (May 5, 2020), developer insights from Haiku Games Co, and a complete ...",
    "Alt Text Image": "Official header image for Adventure Escape Mysteries game - Steam 1141020",
    "Canonical URL": "https://gusku.site/game/adventure-escape-mysteries",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Adventure Escape Mysteries\", \"description\": \"Looking for information on Adventure Escape Mysteries? Check out the release date (May 5, 2020), developer insights from Haiku Games Co, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Haiku Games Co\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Haiku Games Co\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1141020/header.jpg?t=1601349624\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}