{
    "AppID": 1975890,
    "Name": "Alone",
    "Release date": "Jul 22, 2022",
    "About the game": "Having fled the destruction of his people, and shipwrecked on an island, our hero must rebuild, survive, and thrive. Alone is an isometric RPG with citybuilder elements. Collect resources and use them to craft items and weapons. Build a settlement on a rich and fertile island. And hunt in the darkest forests, or slay the undead in the cursed crypts. Explore and Claim the blighted islands that make up the world and become a Jarl worthy of the sagas Follow the your destiny... or don't Follow a quest-driven storyline following your character's journey that starts with a shipwreck, and leads them to restore a blighted world to it's rightful state . Or treat the world as a sandbox and do your own thing. Survive, Thrive, and Rebuild Harvest resources on a procedurally generated island. Catch fish, fell trees, forage for food, and mine for metals and stone. Use the resources to build your home, and other buildings you will need to survive on this deserted island. Build farms to ensure a steady supply of food, choosing your crops carefully according to your focus, and a lighthouse to attract traders to help supply resources you might be missing. Hunt Explore a procedurally generated forest, and hunt animals for their leather and meat. Or travel even deeper and be hunted by wolves and bears. And perhaps you might find treasures hidden within. Craft Turn your raw materials into tools, to help you harvest more efficiently. Or turn them into weapons, armour, and shields to help you fight your enemies. Obtain rare materials from your hunting and exploration, and use them to make even stronger weapons. Or create attractive furniture to decorate your buildings with. Use the cookhouse to mix and match food ingredients, and gain powerful bonuses. Battle, Explore, and Conquer Test your skill in combat against various enemies, defeat them and become stronger. Use special attacks and boosts to give yourself an edge. Explore the infinite depths of the cursed crypts, where the undead walk freely and treasure and knowledge can be found aplenty. Defeat boss monsters such as the Shaman or Fallen Knight, and use their knowledge to unlock more powerful attacks. Repair your ship to unlock a procedurally generated world of islands, each ruled by a goblin tribe, and blighted with dark magics. Use your skills and gods-given powers to defeat these enemies, restore them to their natural glory, and plant your own flag upon them. Make use of the rare resources available only on these dangerous islands to make you, and your settlement more powerful. Honour the gods, and celebrate in style Build a temple and leave appropriate sacrifices - the spoils of war - or marks of your own skill - and the gods may aid you on your quests. Use the result of your farming prowess to brew or cook marvellous recipes. Build the Jarl's Hall and sit upon a throne worthy of a conquering hero of the sagas.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1975890/header.jpg?t=1658488217",
    "Price": 9.89,
    "Developers": "Epic Llama Games",
    "Publishers": "Epic Llama Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1975890/ss_4c585be736169ca2155c7652c493a211476a4be1.1920x1080.jpg?t=1658488217,https://cdn.akamai.steamstatic.com/steam/apps/1975890/ss_e3d19c376d5614cca2380aa82b40cc79058c624b.1920x1080.jpg?t=1658488217,https://cdn.akamai.steamstatic.com/steam/apps/1975890/ss_68caa81423f7a0c6bc8ff2435954c98cdf76c519.1920x1080.jpg?t=1658488217,https://cdn.akamai.steamstatic.com/steam/apps/1975890/ss_de242cac73b0e9f7b03e932c3fad0af56264c466.1920x1080.jpg?t=1658488217,https://cdn.akamai.steamstatic.com/steam/apps/1975890/ss_530b159360595fb5517574fb04a5470ea26cffee.1920x1080.jpg?t=1658488217,https://cdn.akamai.steamstatic.com/steam/apps/1975890/ss_d9e8354e18b18954dc7bdd0bc75c82e1d843e807.1920x1080.jpg?t=1658488217,https://cdn.akamai.steamstatic.com/steam/apps/1975890/ss_625e57d037149b56a98c80cd15c61e7bef8e4991.1920x1080.jpg?t=1658488217",
    "Slug": "alone",
    "Meta Title": "Alone: Jul 22, 2022, Epic Llama Games and Full Overview",
    "Meta Description": "Looking for information on Alone? Check out the release date (Jul 22, 2022), developer insights from Epic Llama Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Alone game - Steam 1975890",
    "Canonical URL": "https://gusku.site/game/alone",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Alone\", \"description\": \"Looking for information on Alone? Check out the release date (Jul 22, 2022), developer insights from Epic Llama Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Epic Llama Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Epic Llama Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1975890/header.jpg?t=1658488217\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.89, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}