{
    "AppID": 535380,
    "Name": "Asteroid Blaster VR",
    "Release date": "Sep 28, 2016",
    "About the game": "Grab your laser guns and strap on your jet pack. Asteroid Blaster VR lets you jump into virtual reality space and start blowing up rocks and UFOs. Blast giant asteroids into rubble and power-up your weapons and energy with collectible bonuses as you battle flying saucers in the clouds of rocky debris. Boost your score and firepower with every gem and gadget you catch, but keep an eye on your radar scope while watching your thruster, shield and laser energy! Bringing back the casual feel of a video arcade classic, a game of Asteroid Blaster VR can deliver a quick 'shoot 'em up' break or a marathon competition to beat the latest high score. Friendly for lefties , you can set your rocket thrust, laser pointer and status screen on the controller arms you prefer, and an in-game tutorial and help text hints will give everything you need to start blasting your way through over a dozen different scenes. Fly around, shoot stuff and have fun with Asteroid Blaster VR! Arcade Mode: In addition to progressing through different asteroid waves and scenes, Asteroid Blaster VR can also be started in 'Arcade Mode'. Arcade Mode sets the player in a slow-paced game environment which grows progressively more difficult as time passes. If you want to let your friends jump right in to virtual reality and start blasting without going through a tutorial first, Arcade Mode is for you! Two paths are available for starting your Asteroid Blaster VR game in Arcade Mode: Open your Start On Wave screen and select wave '00 - Arcade Mode'. OR Open your Options screen and toggle the Start in Arcade Mode option on. That will set your main menu Start button to launch your game in Arcade Mode (rather than on Wave 1). Free Demo Available Want to give Asteroid Blaster VR a try? You can play through our free demo! Just click the 'Download Demo' button to install on your Vive and start blasting your way through space. The demo game gives you a sample of an earlier game wave and the asteroids and UFOs you'll meet in the full game. For an example of Arcade Mode and later game waves, check out the gameplay video linked above. Available for Arcade Commercial Licensing on SynthesisVR Available for Arcade Commercial Licensing on SpringboardVR",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/535380/header.jpg?t=1649473475",
    "Price": 3.99,
    "Developers": "A-Blast Games",
    "Publishers": "A-Blast Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/535380/ss_092f80ef49f8d78736baa30b07861a1ca357298e.1920x1080.jpg?t=1649473475,https://cdn.akamai.steamstatic.com/steam/apps/535380/ss_98af4896b8e8ef892854d296afc9e5313bb68cc7.1920x1080.jpg?t=1649473475,https://cdn.akamai.steamstatic.com/steam/apps/535380/ss_e1fa5aa3007bffa63122818a483df690754bd849.1920x1080.jpg?t=1649473475,https://cdn.akamai.steamstatic.com/steam/apps/535380/ss_54bcb45ed930c0e7758c77e4c793c075495a7534.1920x1080.jpg?t=1649473475,https://cdn.akamai.steamstatic.com/steam/apps/535380/ss_5d32e4d98cc8122edc8ebbb591a63990617e1366.1920x1080.jpg?t=1649473475,https://cdn.akamai.steamstatic.com/steam/apps/535380/ss_3a88d7dee8c0c6a41668bcfdb4e52d54d6470ce3.1920x1080.jpg?t=1649473475",
    "Slug": "asteroid-blaster-vr",
    "Meta Title": "Asteroid Blaster VR: Sep 28, 2016, A-Blast Games and Full...",
    "Meta Description": "Looking for information on Asteroid Blaster VR? Check out the release date (Sep 28, 2016), developer insights from A-Blast Games, and a complete game su...",
    "Alt Text Image": "Official header image for Asteroid Blaster VR game - Steam 535380",
    "Canonical URL": "https://gusku.site/game/asteroid-blaster-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Asteroid Blaster VR\", \"description\": \"Looking for information on Asteroid Blaster VR? Check out the release date (Sep 28, 2016), developer insights from A-Blast Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 28, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"A-Blast Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"A-Blast Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/535380/header.jpg?t=1649473475\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}