{
    "AppID": 1571660,
    "Name": "Au-Delà",
    "Release date": "Feb 28, 2022",
    "About the game": "Introduction You control a child who has to go to sleep, alone, in his house, after his parents have left. You will manage as best you can to go to sleep, remembering the instructions given by them, but everything does not go as planned. Surrounded by monsters, you will find yourself in unusual situations as you try to find out where your parents are. The character You control a character: a child who is alone at home. He is afraid of the dark and constantly needs his fluffy rabbit with him. His movements are those of a child, he does not jump very high and does not have a large inventory. The main objective The main objective is to find your parents. For this purpose, you will have to explore the entire house, collect information and items, without dying, by solving puzzles or confronting monsters. What makes this game different? Rather than a classic approach to a 3D horror video game, Au-Delà takes the side of a 2D side view, offering a new experience by making you discover another way to appreciate the dark atmosphere of a horror game. It is especially intended for players who like to explore, solve mysteries and who are not afraid of monsters at night. This game also offers a new idea of ​​gameplay by asking you to build OCD throughout the game, making the atmosphere more oppressive. The whole thing is accompanied by a narrative with creaky humor. Features Exploration: Explore the family house and solve all the mysteries it contains. Inventory: A child cannot carry a lot of items, you will have to choose what you want to keep with you. OCD: You will have to repeat different actions each time you enter a room, an oversight can potentially cost you your life. Time: Time passes as you progress, find your parents before sunrise. Survival: Many monsters will attack you, each of them has its own peculiarities and needs to be avoided differently. Chases: Some monsters will not give you time to breathe, escape quickly or die. Dialogs: Interact with the monsters to get to know them better. Multiple endings: Some of your actions will have an influence on the end of the game. Drawings: Collect the drawings hidden in the house to unlock the secret ending.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1571660/header.jpg?t=1646053356",
    "Price": 4.99,
    "Developers": "Julien Baumgartner,Pénélope Schachner",
    "Publishers": "Pénélope Schachner,Julien Baumgartner",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1571660/ss_250973102ea5a351a922a93dca2d229bba9bdde2.1920x1080.jpg?t=1646053356,https://cdn.akamai.steamstatic.com/steam/apps/1571660/ss_e0f5588265334900f7432772cda660c7c4e938cc.1920x1080.jpg?t=1646053356,https://cdn.akamai.steamstatic.com/steam/apps/1571660/ss_2a6c0fd9bc4dcd89772496d4db542cdaa2ff0d04.1920x1080.jpg?t=1646053356,https://cdn.akamai.steamstatic.com/steam/apps/1571660/ss_ef4dc88dcac80af9ad349b90f298e06c92ea5e95.1920x1080.jpg?t=1646053356,https://cdn.akamai.steamstatic.com/steam/apps/1571660/ss_6badd0d237254c57793239f32a5278301b36e4ad.1920x1080.jpg?t=1646053356,https://cdn.akamai.steamstatic.com/steam/apps/1571660/ss_487edd5bf9676719caf8d5872f72cc32e12f4438.1920x1080.jpg?t=1646053356",
    "Slug": "au-del",
    "Meta Title": "Au-Delà: Feb 28, 2022, Julien Baumgartner,Pénélope Schach...",
    "Meta Description": "Looking for information on Au-Delà? Check out the release date (Feb 28, 2022), developer insights from Julien Baumgartner,Pénélope Schachner, and a comp...",
    "Alt Text Image": "Official header image for Au-Delà game - Steam 1571660",
    "Canonical URL": "https://gusku.site/game/au-del",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Au-Del\\u00e0\", \"description\": \"Looking for information on Au-Del\\u00e0? Check out the release date (Feb 28, 2022), developer insights from Julien Baumgartner,P\\u00e9n\\u00e9lope Schachner, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Julien Baumgartner,P\\u00e9n\\u00e9lope Schachner\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"P\\u00e9n\\u00e9lope Schachner,Julien Baumgartner\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1571660/header.jpg?t=1646053356\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}