{
    "AppID": 485610,
    "Name": "Ball 3D: Soccer Online",
    "Release date": "Mar 31, 2017",
    "About the game": "Features Multiplayer 11 Game modes 21 Stadiums Dedicated servers Antilag system Realistic physics Ball editor Customization Bots Tutorial Replays Statistics Soccer Game Ball 3D is the first soccer game in a new genre. Control one player on the field and kick the ball high or low, fast or slow, curve, lob, jump, dribble and perform tricks. Create or find your team and join tournaments. Discover a multiplayer soccer game played by over 1 million players. Gameplay Ball 3D: Soccer Online is a computer game where you have 100% control over the angle of your kicks. Every awesome goal you score depends only on your skills, but be careful as every mistake you make is also only your fault. The physics is powered by the professional physics engine, which ensures realistic ball behavior like in the real soccer. Third person camera makes the gameplay very dynamic and unique among soccer video games (some call them football games). It's the first time you can play football like this, very unique experience in the online gaming world. It is uniquely satisfying to see how the goal net moves after you score or how the whole goal moves after you hit the goalpost. Every competitive gamer will enjoy this. Welcome new players! After you enter the game, a short tutorial awaits you. It will teach you how to move, jump, kick and curve. New players need just 3 minutes on average to learn the basics of the game. Feel free to train in the tutorial for as long as you want, you can also come back to it later. It is recommended to finish the tutorial before going online, but don't worry it is short and simple. Bots are ready to play If you would like to train the moves you just learned, your next step may be to play against bots. You can choose from 4 difficulty levels and decide if you would like to train being the striker or the goalkeeper. Say 'hello' to the bots, they never answer, but they always listen... Soccer Online Playing with bots is so fun, but this is a multi-player esport game. It's time to go online in the multiplayer mode and play with others over the internet. We support new players a lot. During the first 14 days you have a beginner status. It lets you play on the special rooms marked as beginners. You can use this time to familiarize yourself with the game by playing with players at your level. If you feel too good to play on the rooms for beginners, you can always join the normal rooms available for all players. After 14 days you will become an expert and you will be able to play on the 3rd kind of rooms, available only for the experts. Thanks to all this you can always play soccer online with the players at your level. Unique, cooperative gameplay is the strongest element of the game. Multiplayer Speaking of rooms. You can play on dedicated rooms or you can join rooms hosted by other players. You can also create your own room. The game offers very advanced and optimized network code, including client side prediction anti-lag system. Ball 3D is one of the most dynamic soccer games, yet the network code is able to handle this in a very smooth way making the online multiplayer experience very enjoyable. Try it yourself. Teams Sooner or later you will meet some nice people in the world of Ball 3D. You may create a team with them. Choose a name and create it in the user panel, then invite your friends to join. Remember to create some nice-looking shirts for your new team. When you do so, you will be ready to compete in leagues, cups and tournaments. Wouldn't it be nice to win the Ball 3D World Cup? To achieve this you will need a skillful squad and some effective strategy. Man of the match Every move you make during the match is recorder in the form of statistics. Based on these statistics a ranking of players is formed. By the end of the match, the name of the best player will be featured and shown to others as the man of the match. Do your best to put your name there! It tastes really great to be the best soccer player of the match. Replays You can record all your matches and watch them later. There is already one replay in the game for you to watch and see how others are playing. Replays will help you to improve your soccer skills in our game. Soccer variations The game contains many different stadiums and modes. If normal soccer is not enough for you, you can try modes like: Darts, Pong and many others. Ball 3D is a very fun game. More than soccer Ball 3D is not only soccer, but also other sports for you to enjoy on-line with your friends. You will be surprised when you will see the other sports: Basketball, Handball, Hockey, Racing, Battle Royale and much more. Each of them has their own stadiums and unique rules. Ball 3D: Soccer Online is a multi-sport simulation game available on pc and mac. Updates The game has been already updated over 200 times. We are constantly adding new content and optimizing the existing features. Support You can contact us by email, on the forum, social media or discord. All the links are in the community section in the main menu of the game. Feel free to ask questions or make suggestions. Become a Ball 3D player Are you ready to join our community? You are invited, we can't wait to see you in the game. Start playing soccer right away.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/485610/header.jpg?t=1658827577",
    "Price": 9.99,
    "Developers": "Unusualsoft",
    "Publishers": "Unusualsoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/485610/ss_84e726c28f37a2f0fd9956b2cd42ff07b20a5d6f.1920x1080.jpg?t=1658827577,https://cdn.akamai.steamstatic.com/steam/apps/485610/ss_364e97fa7de55d28f3f21ff2ae91ccbef266c700.1920x1080.jpg?t=1658827577,https://cdn.akamai.steamstatic.com/steam/apps/485610/ss_7706fcdc956b7065416f32ddd905722ca0da5cb1.1920x1080.jpg?t=1658827577,https://cdn.akamai.steamstatic.com/steam/apps/485610/ss_5028cb44709901f42c6a4cad196301861aaedd73.1920x1080.jpg?t=1658827577,https://cdn.akamai.steamstatic.com/steam/apps/485610/ss_60eb447d2a4cb818a596d3ace220f8669634a0c3.1920x1080.jpg?t=1658827577,https://cdn.akamai.steamstatic.com/steam/apps/485610/ss_73b1128cb81a52ed22a2a706e724b69f82769b4e.1920x1080.jpg?t=1658827577,https://cdn.akamai.steamstatic.com/steam/apps/485610/ss_4aa0405aefe12d7152ffa475367ff117392a75c8.1920x1080.jpg?t=1658827577",
    "Slug": "ball-3d-soccer-online",
    "Meta Title": "Ball 3D: Soccer Online: Mar 31, 2017, Unusualsoft and Ful...",
    "Meta Description": "Looking for information on Ball 3D: Soccer Online? Check out the release date (Mar 31, 2017), developer insights from Unusualsoft, and a complete game s...",
    "Alt Text Image": "Official header image for Ball 3D: Soccer Online game - Steam 485610",
    "Canonical URL": "https://gusku.site/game/ball-3d-soccer-online",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ball 3D: Soccer Online\", \"description\": \"Looking for information on Ball 3D: Soccer Online? Check out the release date (Mar 31, 2017), developer insights from Unusualsoft, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Unusualsoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Unusualsoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/485610/header.jpg?t=1658827577\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}