{
    "AppID": 1776170,
    "Name": "Barton Lynch Pro Surfing 2022",
    "Release date": "Apr 7, 2022",
    "About the game": "Barton Lynch Pro Surfing 2022 is a sports game that pits you against the world’s best surfer’s at the most exotic locations on the planet. The expansive world tour features an in-depth leader-board and sports commentary, or if you prefer to free surf, just cruise the massive locations instead. Cutting edge graphics meets hardcore physics &amp; beautifully brutal waves. Pump control uses the wave’s power so you can surf faster and unlock more moves. More speed = more moves! Pump, smash that lip, get sooo barreled and launch airs from waves that barrel, peak, break left, right, or just foam crumble. Customize your own character to within an inch of your life, or, play as some of today’s top pros including: Yago Dora, Clay Marzo, Nathan Florence, Soli Bailey, Mahina Maeda, Vahine Fierro, Felicity Palmateer, and of course the legendary world champion, coach and Pro Surfing commentator Barton Lynch. CUSTOMIZE YOUR OWN SURF CONDITIONS – MADE FOR YOU, BY YOU Control the weather! Use your sick weather tool to directly impacts how you play. So create any surf conditions you want using the amazing weather tool that affects conditions in real-time. Big, sunny, low tide and glassy? You got it! Messy &amp; small with a heavy cross-shore wind – just so you can practice your boosts? What? Yeah! WORLD CHAMPS &amp; UNDERGROUND HEAVYWEIGHTS See how you compare to the big names on the tour, including Yago or Soli, or underground chargers in Nathan &amp; Clay. Or what about taking on big wave chargers Vahine, Mahina or Felicity? A MASSIVE CAREER MODE Set out to conquer the world rankings in a singles career or via online leaderboards with friends. Manage your money, equipment, your health and your performance to reach the top. The Tour is a sporting challenge like no other, so leave no stone unturned as its going to test you CUSTOMIZABLE CHARACTERS The possibilities are massive – no seriously – huge. You can customize your entire look, but then on top of that all of your choices impact what happens in the game. With your surfer’s equipment, different wetsuits, rashies, board shorts, fins, board shapes including sizes, widths, bottom, tails, rails, noses – every item customizable and gameplay based. To boot, we feature some of the most recognized surf brands like Billabong, Quiksilver, Roxy, MR Surfboards, Lost, Pyzel, ONeil, Creatures Of Leisure, Futures Fins, and many more. REAL LIFE ICONIC LOCATIONS BL Pro Surfing locations are all real-world breaks designed to take you where you want to be. From Snapper, Mundaka, to Pipeline or the Box – we’ve got you covered. Should you rock off at Snapper or take your chances in the channel? Want to perfect that bottom to top backside snap before pulling in to get shacked at Hossegor? Now you can. Should you paddle big Jaws or Tow in? That’s a dilemma. But what about paddling from Main Break to the Box when it’s pumping? Yep, you can do that too. GAME MODES Tour Modes, Free Surf, Trick Challenges – endless hours of challenges and replay-ability. Sure, the games graphics might look a bit pretty, but this is a surfing experience with a true sense of gameplay depth. A set of progressive difficulties at each location helps build your skills and knowledge of the waves so you can take your real-time skills and start ripping it up in real life. LEGIT SOUNDTRACK Smoking Martha, Kilns, Oly Sherman, Wing Defence, Mesmeriser and Bad Pony headline the distinctive music that blends well with BL Pro Surfing’s worldwide vibe and fluid physics-based control mechanics.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1776170/header.jpg?t=1655543339",
    "Price": 39.99,
    "Developers": "Bungarra Software Pty Ltd",
    "Publishers": "Bungarra Software Pty Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1776170/ss_c55c9526f4f44e26999cd7d761d826b95d28a82b.1920x1080.jpg?t=1655543339,https://cdn.akamai.steamstatic.com/steam/apps/1776170/ss_5d3a8bbc14ee8f1b321313abddbd2e6ebf8e2635.1920x1080.jpg?t=1655543339,https://cdn.akamai.steamstatic.com/steam/apps/1776170/ss_4d1e494a2f4d330c077296ce6c4446462b30708c.1920x1080.jpg?t=1655543339,https://cdn.akamai.steamstatic.com/steam/apps/1776170/ss_773e8da63449fdb68c0745c55844e6a88c72d905.1920x1080.jpg?t=1655543339,https://cdn.akamai.steamstatic.com/steam/apps/1776170/ss_9ee28e3322dfca0c01e10ecb5098ee24fb289dc0.1920x1080.jpg?t=1655543339,https://cdn.akamai.steamstatic.com/steam/apps/1776170/ss_d805e16b409989fbbc433815acacd4958cee2f70.1920x1080.jpg?t=1655543339,https://cdn.akamai.steamstatic.com/steam/apps/1776170/ss_9234231eafce8f285dae4a0da2c490ea1a448ce8.1920x1080.jpg?t=1655543339,https://cdn.akamai.steamstatic.com/steam/apps/1776170/ss_6e89f53d193087783708a7208eb7557195213bf1.1920x1080.jpg?t=1655543339,https://cdn.akamai.steamstatic.com/steam/apps/1776170/ss_9d422877d7b5ca31d1e4cc52bdbf921745e45b6e.1920x1080.jpg?t=1655543339,https://cdn.akamai.steamstatic.com/steam/apps/1776170/ss_9b1dce4e348c1c539fa88e217dd7d48d7c1b65f0.1920x1080.jpg?t=1655543339,https://cdn.akamai.steamstatic.com/steam/apps/1776170/ss_dd904c5ed8af022d06b2fddd420c175f89584966.1920x1080.jpg?t=1655543339,https://cdn.akamai.steamstatic.com/steam/apps/1776170/ss_4b6334ad067408d6b7fc9a3d179a9f91e3daa845.1920x1080.jpg?t=1655543339,https://cdn.akamai.steamstatic.com/steam/apps/1776170/ss_1a1ca58a1e3ebb5a854e2614aa628c9d313ba293.1920x1080.jpg?t=1655543339",
    "Slug": "barton-lynch-pro-surfing-2022",
    "Meta Title": "Barton Lynch Pro Surfing 2022: Apr 7, 2022, Bungarra Soft...",
    "Meta Description": "Looking for information on Barton Lynch Pro Surfing 2022? Check out the release date (Apr 7, 2022), developer insights from Bungarra Software Pty Ltd, a...",
    "Alt Text Image": "Official header image for Barton Lynch Pro Surfing 2022 game - Steam 1776170",
    "Canonical URL": "https://gusku.site/game/barton-lynch-pro-surfing-2022",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Barton Lynch Pro Surfing 2022\", \"description\": \"Looking for information on Barton Lynch Pro Surfing 2022? Check out the release date (Apr 7, 2022), developer insights from Bungarra Software Pty Ltd, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bungarra Software Pty Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bungarra Software Pty Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1776170/header.jpg?t=1655543339\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}