{
    "AppID": 889170,
    "Name": "Battle Royale Builder",
    "Release date": "Jan 10, 2019",
    "About the game": "Battle Royale Builder lets you practice Building, Editing, and Shooting with no limits and AI to practice against! No harvesting resources, no sitting in a queue, no severs, no fall damage, just Build, Edit, and Shoot, with or without AI! Features: AI: Play alone or practice against AI that is included in several modes, including AI that can shoot back! Training Modes: Survival (AI), Target Practice (AI), Build Race and Edit Race allow you to practice specific skills, or just load up Sandbox and do whatever you want! Survival: Practice your full skillset: Build, Edit, and Shoot to see how long you can survive against wave after wave of AI that moves, takes damage, and shoots back! Target Practice: Improve your aim, tracking, flick shots, and even boxing up the enemy against an AI that runs around, including critical damage to the head! Build Race: Test your ability to build quickly and efficiently by running a race through a series of sky rings on your way to the Finish Line! Edit Race: Train your ability to Edit quickly and efficiently while navigating a maze of structure to the Finish line! Build System: Walls, Floors, Stairs, and Roofs, all connect together with the correct rule set! Edit System: Walls, Floors, Stairs and Roofs can all be Edited with all possible edit combinations! Weapons: Basic Assault Rifle, SMG, Shotgun, and Sniper Rifle included to allow you to work on your aim as well as integrate gun play into your building and editing practice! Destruction System: Destroy individual pieces or entire structures based on weak points, including destruction by Edit! Custom Keybinds: Customize all of your Building and Movement hotkeys, including Mouse and Controller sensitivity, ADS/Scope sensitivity and more! Turbo Build and Settings: Full settings menu includes Turbo Building, Run by Default, Sprint Toggle and more! Character Movement: Jump, Crouch, Sprint or Jog, it's all in with the correct speeds! Controller: Xbox One and PS4 Controller Support. Choose from Controller Profiles (Builder Pro, Quick Builder, Combat Pro, and Old School) and set custom Controller sensitivity! Note: a mouse is still needed for navigating menus.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/889170/header.jpg?t=1547168327",
    "Price": 2.99,
    "Developers": "Skeptika1",
    "Publishers": "Skeptika1",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/889170/ss_477ece24028d1e059b4b1021d7d783ef46571532.1920x1080.jpg?t=1547168327,https://cdn.akamai.steamstatic.com/steam/apps/889170/ss_11ced3a96dec96d09fd9829a84ecc24a7887303a.1920x1080.jpg?t=1547168327,https://cdn.akamai.steamstatic.com/steam/apps/889170/ss_7886e08cf473c0527402c5e5ed55732ada500b44.1920x1080.jpg?t=1547168327,https://cdn.akamai.steamstatic.com/steam/apps/889170/ss_13dc83b45e2d206f2f081f646220a683cdbedf82.1920x1080.jpg?t=1547168327,https://cdn.akamai.steamstatic.com/steam/apps/889170/ss_c9eb6a8b1004dcc89198bacdab76ab855efc3731.1920x1080.jpg?t=1547168327,https://cdn.akamai.steamstatic.com/steam/apps/889170/ss_83f1af40b4e7764d20e53dde6c6eaba69f2778db.1920x1080.jpg?t=1547168327,https://cdn.akamai.steamstatic.com/steam/apps/889170/ss_2b455ec7c638d5db80eb1142e3a1e136770f437c.1920x1080.jpg?t=1547168327",
    "Slug": "battle-royale-builder",
    "Meta Title": "Battle Royale Builder: Jan 10, 2019, Skeptika1 and Full O...",
    "Meta Description": "Looking for information on Battle Royale Builder? Check out the release date (Jan 10, 2019), developer insights from Skeptika1, and a complete game summ...",
    "Alt Text Image": "Official header image for Battle Royale Builder game - Steam 889170",
    "Canonical URL": "https://gusku.site/game/battle-royale-builder",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Battle Royale Builder\", \"description\": \"Looking for information on Battle Royale Builder? Check out the release date (Jan 10, 2019), developer insights from Skeptika1, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 10, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Skeptika1\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Skeptika1\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/889170/header.jpg?t=1547168327\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}