{
    "AppID": 941020,
    "Name": "BAYANI - Fighting Game",
    "Release date": "Jun 11, 2019",
    "About the game": "Have questions about the game? Message us on Discord! BAYANI is a fast-paced 1-on-1 indie fighting game that features a simplified 6 button control scheme. It is designed with accessibility in mind as it is meant to be easy to pick-up for newcomers to the fighting game genre. It utilizes one button specials and moves that can easily chain to one another to lower the barrier of entry. With the help of professionals in the fighting game industry as well as support from the local fighting game community (FGC), it is designed to be competitive with deep and intricate gameplay mechanics suitable for high-level play and mind games. At it's core, BAYANI is an easy to play but difficult to master. By decreasing the skill level for execution, players can focus more on the mind-games and high-level of play needed to master the genre. FAST-PACED COMBAT BAYANI features a fast-paced combat system with air dashes, fast movement speed, reversals, reset mechanics, break mechanic, projectiles, grabs, powerful Fatal Strikes and devastating Final Arts to give the players a plethora of options to choose from. Opening up your opponent, baiting out attacks, and managing meter is needed to completely master the game fully. CONTROLS Making the game easier to play without taking away its depth and complexity is one of the main goals of BAYANI. By decreasing the execution barrier, players can focus more on the deep mind games and complex mechanic interactions that are present in fighting games. The game can be played using the keyboard, a gamepad, an arcade stick, or whatever controller the player wishes to use. As it uses a simplified 6-button control scheme, players can play with what is most comfortable to them. THE CHARACTERS BAYANI's final roster on release will include 8 unique characters with different archetypes, playstyles, and mechanics. Every character in BAYANI are all inspired by historical figures that have had a significant impact in the country’s history. This makes every character unique and different to play and makes for a varied playing experience. STAGE BASED ON REAL LOCATIONS All stages in the game is based on real locations in the Philippines where each stage has significant relation to the game characters and their real life inspirations. EARLY ACCESS FEATURES Philippine history inspired characters: All the characters in the game are inspired from REAL LIFE historical personalities of the Philippines. Stages base on real locations: All stages in the game are based on real locations in the Philippines where each stage has significant relation to the game character's real life inspiration. Single Player Arcade Mode: Fight against random AI controlled opponents in a one-on-one close quarter combat. 2 Players Versus Mode: Choose your favorite character and compete with your family and friends through local 1v1 multiplayer. Training Mode: Check character moves, practice devastating combos and explore each available BAYANI character. Immersive Soundtrack: Feel each character's personality, strength, sadness and conflict through originally composed music.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/941020/header.jpg?t=1656957999",
    "Price": 15.99,
    "Developers": "Ranida Games",
    "Publishers": "Ranida Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/941020/ss_f4334902dcb27d8c850d3319c90da028f395d93a.1920x1080.jpg?t=1656957999,https://cdn.akamai.steamstatic.com/steam/apps/941020/ss_1179e896848bd7e5ed2089474374b697c17675c5.1920x1080.jpg?t=1656957999,https://cdn.akamai.steamstatic.com/steam/apps/941020/ss_4dbfb29ed268fe51a8e2467c300460d6b4fc2efa.1920x1080.jpg?t=1656957999,https://cdn.akamai.steamstatic.com/steam/apps/941020/ss_122966b8a3790319502ed90a757a68dd3e8050f4.1920x1080.jpg?t=1656957999,https://cdn.akamai.steamstatic.com/steam/apps/941020/ss_1af946da24d14ba0183de563eeb8f37638466ef0.1920x1080.jpg?t=1656957999,https://cdn.akamai.steamstatic.com/steam/apps/941020/ss_8c8db9b09496adc0578ebd0e523f69bc5e7fcf68.1920x1080.jpg?t=1656957999,https://cdn.akamai.steamstatic.com/steam/apps/941020/ss_bc06c6f021d8a62f12dce7d9b0167f7b54a3ac73.1920x1080.jpg?t=1656957999,https://cdn.akamai.steamstatic.com/steam/apps/941020/ss_f35f794189fd32846c1f3f34bae7816c8e693a45.1920x1080.jpg?t=1656957999,https://cdn.akamai.steamstatic.com/steam/apps/941020/ss_61a2da2fd92d096a8a2f3198fb49b3447192a2d5.1920x1080.jpg?t=1656957999",
    "Slug": "bayani-fighting-game",
    "Meta Title": "BAYANI - Fighting Game: Jun 11, 2019, Ranida Games and Fu...",
    "Meta Description": "Looking for information on BAYANI - Fighting Game? Check out the release date (Jun 11, 2019), developer insights from Ranida Games, and a complete game ...",
    "Alt Text Image": "Official header image for BAYANI - Fighting Game game - Steam 941020",
    "Canonical URL": "https://gusku.site/game/bayani-fighting-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BAYANI - Fighting Game\", \"description\": \"Looking for information on BAYANI - Fighting Game? Check out the release date (Jun 11, 2019), developer insights from Ranida Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 11, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ranida Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ranida Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/941020/header.jpg?t=1656957999\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}