{
    "AppID": 916010,
    "Name": "Beating A Dead Horse With A One-Trick Pony",
    "Release date": "Nov 21, 2018",
    "About the game": "Beating A Dead Horse With A One-Trick Pony is a first-person RPG (ArtPG) with a narrative, mild melee combat, and some platforming elements. The game is a sequel to, Jeff Koons Must Die!!! , and is set in the same destroyed museum that the previous game ended in. The game comprises six levels and you must escape each successive area in order to progress through the story. You will enlist the help of some old friends to help along the way and, hopefully, uncover your own path. Some Level Themes: Aftermath: Revel in the destruction of days past. Contemplate your actions or inaction. The Church of Kitsch: Escape the confines of a rigid structure. Visit the church and pay respects. Art and Commerce: Visit the opportunity hub in order to generate some currency, attend the learning annex, and apply to exhibit at Art Basil Minneapolis. Keep an eye on your relevance though, you will need it. Art and Celebrity: Visit a mystical land where you will learn how to become an art star. Create your own personal mythology and acquire currency from collectors. Be careful though, you might lose yourself. Redemption: Re-visit the past and connect with your roots. Excavate. The Road Home: Escape the final structure and light four beacons in order to finish the game. Easter Eggs: There are multiple easter eggs and hidden areas in the game. Some achievements are unlocked by finding these areas. Mouse and Keyboard Controls: WASD to move forward, backward, and side to side. HOLD LEFT SHIFT and any movement key (WASD) in order to sprint. SPACE BAR to jump. E to interact with some objects. RIGHT MOUSE CLICK to pick up some objects. LEFT MOUSE CLICK to swing melee weapon/tool, when equipped. ESCAPE KEY will bring up main menu at any time. Gamepad Controls: LEFT THUMBSTICK to move. RIGHT THUMBSTICK to look around. Hold LEFT TRIGGER while moving to sprint. TOP FACE BUTTON to Interact (Use this when the game prompts to Press E). BOTTOM FACE BUTTON to jump. RIGHT TRIGGER to swing melee weapon/tool, when equipped. BOTTOM FACE BUTTON to select menu items or select dialogue. LEFT THUMBSTICK to navigate menu items. SPECIAL LEFT BUTTON (menu button) to pause game and open menu at any time. Save Game Function: This game saves access to each level as they are completed and saves information on the last level regarding lit beacons. It does not save location data or incremental progress (other than the beacon info). If you quit the game in the middle of a level you will need to start over when you reload it (other than the last level). Note from the dev: This game was created over a year from November 2017 through November 2018. It was a very personal project that deals with my struggles navigating the pitfalls of the art world and my realizations and epiphanies regarding the complex systems within that world. It is a love letter as well as a Dear John letter.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/916010/header.jpg?t=1542823977",
    "Price": 6.99,
    "Developers": "Hunter Jonakin",
    "Publishers": "Pomp Life Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/916010/ss_c93315ad252e51cbc154dc5f59bf6585a51379f1.1920x1080.jpg?t=1542823977,https://cdn.akamai.steamstatic.com/steam/apps/916010/ss_817139a289feb42e50b409550bc7db6a88c24d6a.1920x1080.jpg?t=1542823977,https://cdn.akamai.steamstatic.com/steam/apps/916010/ss_1cbd2089fa561e3f43b4834b2087d66549409ccb.1920x1080.jpg?t=1542823977,https://cdn.akamai.steamstatic.com/steam/apps/916010/ss_2d080324e0d34d3d8a2936f2fc680a3b75ee922f.1920x1080.jpg?t=1542823977,https://cdn.akamai.steamstatic.com/steam/apps/916010/ss_decd512e70fdac8b7455b0096dd0786d2ef1d1eb.1920x1080.jpg?t=1542823977,https://cdn.akamai.steamstatic.com/steam/apps/916010/ss_46586dc0d97905d4fa247eaca3cc966c6c5b0baa.1920x1080.jpg?t=1542823977,https://cdn.akamai.steamstatic.com/steam/apps/916010/ss_9039d7d17a8c3685dd2a2cd43579d62881024290.1920x1080.jpg?t=1542823977,https://cdn.akamai.steamstatic.com/steam/apps/916010/ss_efa764b59957ea2475958e23062582b86163537e.1920x1080.jpg?t=1542823977,https://cdn.akamai.steamstatic.com/steam/apps/916010/ss_cffe34ffa15141b20f604d133fcca1e980d60608.1920x1080.jpg?t=1542823977",
    "Slug": "beating-a-dead-horse-with-a-one-trick-pony",
    "Meta Title": "Beating A Dead Horse With A One-Trick Pony: Nov 21, 2018,...",
    "Meta Description": "Looking for information on Beating A Dead Horse With A One-Trick Pony? Check out the release date (Nov 21, 2018), developer insights from Hunter Jonakin...",
    "Alt Text Image": "Official header image for Beating A Dead Horse With A One-Trick Pony game - Steam 916010",
    "Canonical URL": "https://gusku.site/game/beating-a-dead-horse-with-a-one-trick-pony",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Beating A Dead Horse With A One-Trick Pony\", \"description\": \"Looking for information on Beating A Dead Horse With A One-Trick Pony? Check out the release date (Nov 21, 2018), developer insights from Hunter Jonakin...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 21, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hunter Jonakin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pomp Life Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/916010/header.jpg?t=1542823977\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}