{
    "AppID": 1524810,
    "Name": "Carotic - Academic Version",
    "Release date": "Mar 8, 2021",
    "About the game": "Carotic is a top-down 3D couch-co-op hide-and-seek game for 2-4 players. Each player plays the role of a car in a very busy city. Their task is to drive like the other NPC cars while trying to identify the other players. In order to gain points the other players must be destroyed by dashing into them. The player with the most points after a set amount of time wins. HIDE AND SEEK This is just the core gameplay of Carotic as described above. The players' goal is to find the other competitors and dash into them resulting in points for this player and destruction with a short respawn timer for the other. Dashing NPCs does not penalize the player apart from revealing them because of the particle effect and speed up that they gain. REACH THE GOALS In addition to the normal game mechanics there are circles of particles that spawn randomly on the map. Players can drive through them to gain additional points providing a common incentive for the players to group up on one point which allows for more options to destroy the other players. DESTROY THE TOWN Evolved from a previous idea – the chaos mode – in which all buildings on the map were destructible. Similar to the REACH THE GOALS game mode this one has the additional quirk that there is always one random building which can be destroyed by dashing into it. Destroying buildings is rewarded with points which again, creates a common incentive for the players to group up around a key point on the map. KRAKATTACK If you can’t guess it from the title of the game mode, KRAKATTACK features a kraken which is attacking the town. The players can dash into its tentacles to make them retreat into the water. The monster will also destroy players if it slams on them. There is also lightning and thunder that will strike the ground randomly and if a player is too close to the point where the lightning struck, they will get destroyed. FREE FOR ALL RACE Is completely different from the other game modes. Players race against each other on a different map - no hiding, no seeking, just racing. In addition to the dash, the players can select events which they can trigger to gain an advantage over the other players. They can destroy buildings to create shortcuts, let a bus drive and destroy all cars in its way, drop a crate from a crane and spawn a boat that jumps onto the street to destroy everything in its way and more!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1524810/header.jpg?t=1615223159",
    "Price": 0.0,
    "Developers": "Marc Kletz",
    "Publishers": "Marc Kletz",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1524810/ss_3982afa451d6184e103fb33a5653e9136e1ad0d9.1920x1080.jpg?t=1615223159,https://cdn.akamai.steamstatic.com/steam/apps/1524810/ss_6d9fd7b895ef58941ef8a72ca0ded56c7a84f9ee.1920x1080.jpg?t=1615223159,https://cdn.akamai.steamstatic.com/steam/apps/1524810/ss_4e4cc053183a6abc042b8ad8e3a1a13bf1db34f8.1920x1080.jpg?t=1615223159,https://cdn.akamai.steamstatic.com/steam/apps/1524810/ss_c08f12e237a32adb12b0fc02e7deea1232810cf1.1920x1080.jpg?t=1615223159,https://cdn.akamai.steamstatic.com/steam/apps/1524810/ss_26a4ba42c3327bc0c617d7ad6b9b17d6da988fb1.1920x1080.jpg?t=1615223159,https://cdn.akamai.steamstatic.com/steam/apps/1524810/ss_a68502a519c51f405c47cd2c2f1912e47422795b.1920x1080.jpg?t=1615223159,https://cdn.akamai.steamstatic.com/steam/apps/1524810/ss_fa0a6b2f9e5e3a286b609bae7674a364038e2144.1920x1080.jpg?t=1615223159",
    "Slug": "carotic-academic-version",
    "Meta Title": "Carotic - Academic Version: Mar 8, 2021, Marc Kletz and F...",
    "Meta Description": "Looking for information on Carotic - Academic Version? Check out the release date (Mar 8, 2021), developer insights from Marc Kletz, and a complete game...",
    "Alt Text Image": "Official header image for Carotic - Academic Version game - Steam 1524810",
    "Canonical URL": "https://gusku.site/game/carotic-academic-version",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Carotic - Academic Version\", \"description\": \"Looking for information on Carotic - Academic Version? Check out the release date (Mar 8, 2021), developer insights from Marc Kletz, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 8, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Marc Kletz\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Marc Kletz\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1524810/header.jpg?t=1615223159\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}