{
    "AppID": 762900,
    "Name": "Cars with Guns: It's About Time",
    "Release date": "Dec 18, 2017",
    "About the game": "Cars with Guns isn't a very complicated game. You get some Cars. You get some Guns. You put them together. Now throw in a time machine that leads to car combat arenas based on various time periods from 65 million B.C. to 10000 A.D. Blow some stuff up. Run some things over. Do some crazy stunts. Snipe someone with a Railgun. Get points for all of it. Whoever has the most points when time runs out wins. Points carry over into your garage to buy new cars and guns. Bring some Friends. CwG supports 1-4 players with up to 12 computer opponents in one arena. Join forces in Team Battle or play Free For All. Each vehicle can have 4 weapon systems mounted to it at once. In hindsight that was probably too many. CwG aims to bring unique and funny elements to the table. Weird stuff a AAA company would never do. Velociraptors will get run over. Cows will explode. Pyramids will fly. Physics will be laughably wonky. Someone will get sniped from across the map with a 13th century cannon. The Roman Colosseum will finally host Car to Car combat. We might not be able to bring you anything comparable to a million dollar AAA title, but Cars with Guns is sure to bring some laughs. Longer Description - Cars with Guns was designed to be a fun and easy game to break out when friends are over. There is virtually no wait when loading the game up, you start in your garage and additional players can drop in and out of split-screen by pressing the start button. The game was designed to be played with xbox controllers, but any controller that works on PC should work. Keyboard/mouse is supported but not exactly recommended. Right now Cars with Guns has one game mode - We'll call it 'Classic'. In classic mode players and AIs gain points for everything: Drifting, jumping, flipping, rolling, destroying the environment, shooting other cars, ramming other cars, blowing up other cars, knocking other cars out of the arena, running over wildlife, etc. all give points. The combo system rewards players for keeping a stunt going as long as possible. Whoever has the most points when the chosen time runs out wins. More game modes are planned - more info in the 'Expected content' section below. Vehicles have high freedom of movement for a car game. Vehicles can 'Jump', 'Spin' or 'Roll' at the press of a button. Yes, cars can jump. Features: Full Vehicle Physics. Destroyable Environments. Good mix of vehicles from 50's cars to high end sportscars, as well as trucks, and even a school bus. A hover car will be added in a later update. Vehicles get dented up, parts blow off. Pickups system allows vehicles to store and use a pickup on demand. (Repair, Shield, Airstrike, Super Boost, Zero G, More being added.) Change Vehicle paint. Full body wrap available on one car, more coming soon. Load-out your car with several different weapons from mini-guns to lasers to missile racks. Earn credits by playing matches and use them to unlock new Vehicles and Weapons. Giant TV screen based menu system, so all 2+ players can purchase cars and guns or change game settings simultaneously. It also makes it easy to see your completion percentage at a glance. 1-4 player split-screen. *Note* No online play is planned. Split-screen Couch Co-Op/Versus with 2-4 players is the primary purpose of this game. Current Early Access State: As of now there are 15 unlockable Vehicles. (9 cars, 3 Lifted Trucks/SUVs, 1 Sportscar with a 4x4 lift and 1 bus) 12 unlockable Weapons. 4 Arena Maps. (some still a WIP) 1 primary game mode. Important Early Access notes: Take note that this is a *very* early access game that has had about 4 months of development by 2 developers. One of the reasons we released it for early access in it's current state is to keep feedback from players. If you have issues with the game, please contact us about it before leaving a bad review. We will work to fix any issues people report ASAP and are open to any and all ideas you may have. We realize there is a shortage of content as of now, but we think we have a solid core that's good enough to distribute while we continue to polish the game and make more Gameplay modes, Levels, Vehicles and Weapons. We hope the price we listed CwG for is fair. It may be a bit much for it in it's current state, but it includes all future updates. We will never release paid DLCs. Purchasing the game will get you all future content. Expected content before game is considered 'finished': 20+ Vehicles 20+ Weapons 9+ Levels 4+ Game Modes More game modes will be added such as an arena mode where you and your friends join forces to fight off waves of enemy AI vehicles of ever increasing difficulty and quantity, capture the flag, and king of the hill. Mini games such as 'Drifting Contest' and 'Car Bowling' will be added. Trailer video was made with an early version, lots has changed and will continue to change.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/762900/header.jpg?t=1520713924",
    "Price": 0.99,
    "Developers": "Null Reference Games LLC",
    "Publishers": "Null Reference Games LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_32b92f5db7520d118566d1b7632540d8283d7665.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_8439bb3151cd086439d35d45d7d665d20e11a0de.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_d450c633c17adb287149eacbb1a362bba1f1172b.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_4a96f340b14d1cf45be0dbd52f0788912bbba006.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_edff8e76dd118ffd0a2bdf6e49f7003d3fc0c2d5.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_c4f3da27f62d93dd59563886f93d6f236357673c.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_ea323aad5e110433f8156535e0d2136b196714a4.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_ebaaf02d7bbb79b9254dca3ed03bae80e38f33e2.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_63495e36709261af5b6974b1956a5ea9e255bdf5.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_da43393663000d019fb91459dbe962f1656a64e8.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_2d5ebc58faa885cd3c031cf9ade9ea434ba86438.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_77ab0e4bdd6822dd677d92427ff349782bf26db3.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_edf8832504182965bdc6b82a97ab35d1c996f5bd.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_4eebb69b0679cd94e34e42a05c6eb72a3b9ad2e9.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_8cd860bb747dbb264353e4d5a30b096d63fe67d2.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_ff7863c7b9b7c9d09a3c133d7e4136fa9963d6ab.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_779e9b400a8c455e9fdeaf61abcca6beac9aa235.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_aaa5aa938e8bc1990008a56fef29a9f6a26051f9.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_fe7bd6d0098fbe1d671d43715177f44467edd516.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_6221776db0f8a139bfcbd1456fa05440e250c3a5.1920x1080.jpg?t=1520713924,https://cdn.akamai.steamstatic.com/steam/apps/762900/ss_bbe21f533f81b7d7a8c54e7a6e29498d54886ebc.1920x1080.jpg?t=1520713924",
    "Slug": "cars-with-guns-it-s-about-time",
    "Meta Title": "Cars with Guns: It's About Time: Dec 18, 2017, Null Refer...",
    "Meta Description": "Looking for information on Cars with Guns: It's About Time? Check out the release date (Dec 18, 2017), developer insights from Null Reference Games LLC,...",
    "Alt Text Image": "Official header image for Cars with Guns: It's About Time game - Steam 762900",
    "Canonical URL": "https://gusku.site/game/cars-with-guns-it-s-about-time",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cars with Guns: It's About Time\", \"description\": \"Looking for information on Cars with Guns: It's About Time? Check out the release date (Dec 18, 2017), developer insights from Null Reference Games LLC,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 18, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Null Reference Games LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Null Reference Games LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/762900/header.jpg?t=1520713924\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}