{
    "AppID": 527160,
    "Name": "Cmoar VR Cinema",
    "Release date": "Sep 29, 2016",
    "About the game": "Watching your favourite movies has never been so immersive as in our Cmoar VR Cinema! Bringing the atmosphere of your favourite cinema straight to your home enables you to relive all those exciting moments you had when you first stepped into the auditorium. Relax and enjoy those glorious battles, romantic finales, comedic moments once more in the most immersive VR Media Player on Steam! FEATURES Dynamic Lighting effect Four beutiful realistic sceneries LAN PLEX support ( DLNA server) [NEW!] LAN shared media (UPNP/DLNA media servers) [NEW!] Disc (DVD) with navigation (inside LAN category) [NEW!] 3D 180° &amp; 360° movies with options (orientation/zoom/tilt) [NEW!] Support for 2D &amp; 3D Movies (SBS/Over-Under) Watching Youtube videos (1080p 2D) Watching Youtube videos (1080p 3D) Seat change ability Embedded subtitles and audio track support Full Native HTC Vive &amp; Oculus support VR gamepad support VR menu interface Add every video and directory to Favourites 'Last-viewed” option Many subtitle encoding formats If you have problems with Plex discover - see a tutorial (if default Plex setup is not working) : or to restart Plex server. If you encounter any problems feel free to contact us on sboczek@10antshill.com . Dynamic Lighting The VR Cinema enables you to fully immerse yourself in the world of virtual reality and watching your favourite movie once again has never been so realistic. Sit comfortably in your seat an allow yourself to be mesmerised by the experience. Seat change ability Can't see enough? Don't like your seat? Now you can change your seat in three of our environments and enjoy the movie from a completely different perspective. Youtube &amp; Youtube 3D Watching videos has never been easier as now you are simply two clicks away from enjoying every Youtube video in our cinema. Whether it be Youtube or Youtube 3D, everything is within your reach. Steam VR compatibility Your favourite mobile VR Cinema is now available on PC. Precise motion tracking and natural controller gestures enable you to fully adopt stationary VR's advantages to enhance your experience within our virtual reality. VR Gamepad support Use your VR controller to fully navigate within our cinema's menu. It has never been easier to manouver through your files and search for your favourite moments. In conjuction with its precision and intuitive user interface, Cmoar VR Cinema enables you to sit back and fully enjoy the movie. Transitional realistic sceneries (home, cinema, boat show) If you don't like the current auditorium you can immediately make a quick switch to a cozy, comfortable room or you can quickly disable the entire environment to solely focus on the main screen. The choice is yours. Add every movie to Favourites With just one click you can add your most beloved movie to the Favourites label. It will always be there for you whenever you would like to quickly watch it again without all the tedious searching and selecting. Only Local* - means that Plex server has to be on a machine that runs Cmoar VR Cinema. We're working on expanding Plex support further in the near future.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/527160/header.jpg?t=1565166502",
    "Price": 9.99,
    "Developers": "Pixel Edge Games",
    "Publishers": "Pixel Edge Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/527160/ss_010ca16a823cbd698e8859bad9f06e6cf3d3785d.1920x1080.jpg?t=1565166502,https://cdn.akamai.steamstatic.com/steam/apps/527160/ss_a11d129323203eed563651413f1aadb5c8312aae.1920x1080.jpg?t=1565166502,https://cdn.akamai.steamstatic.com/steam/apps/527160/ss_533109b8318b4d3da92cfba04e408d9d176bf83b.1920x1080.jpg?t=1565166502,https://cdn.akamai.steamstatic.com/steam/apps/527160/ss_62b569e973f0c550a6cba6e1a10bb9e860786e31.1920x1080.jpg?t=1565166502,https://cdn.akamai.steamstatic.com/steam/apps/527160/ss_62b569e973f0c550a6cba6e1a10bb9e860786e31.1920x1080.jpg?t=1565166502",
    "Slug": "cmoar-vr-cinema",
    "Meta Title": "Cmoar VR Cinema: Sep 29, 2016, Pixel Edge Games and Full ...",
    "Meta Description": "Looking for information on Cmoar VR Cinema? Check out the release date (Sep 29, 2016), developer insights from Pixel Edge Games, and a complete game sum...",
    "Alt Text Image": "Official header image for Cmoar VR Cinema game - Steam 527160",
    "Canonical URL": "https://gusku.site/game/cmoar-vr-cinema",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cmoar VR Cinema\", \"description\": \"Looking for information on Cmoar VR Cinema? Check out the release date (Sep 29, 2016), developer insights from Pixel Edge Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 29, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pixel Edge Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pixel Edge Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/527160/header.jpg?t=1565166502\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}