{
    "AppID": 364970,
    "Name": "CopperCube 5 Game Engine",
    "Release date": "May 1, 2015",
    "About the game": "CopperCube is a full-featured 3D game engine. No programming needed! Create 3D games, apps and even 3D websites quickly. Includes terrain editor, low poly modelling tools, 3D models, precreated game AI, effects and more. There are also plenty of features for advanced users, like JavaScript scripting and shader support. Create your own 3D worlds and 3D models, set camera controllers, materials, behaviors, click 'publish' and your game or app is ready. As Windows or Mac OS X apps, WebGL websites, Flash .swfs, or Android apps. You can do all this without programming. High performance 3D engine CopperCube includes manually optimized 3D engines for all supported targets, running with OpenGL, Direct3D, WebGL and Stage3D. Simple-Click game system No programming needed: Wether you want to create a simple 3D game, a complex, epic adventure, or a first person shooter: Select from lots of created behaviors and adjust them accordingly. Terrain Editor Create your own 3D worlds directly in the editor, textures can be painted quickly with automatic texture blending into the terrain. There are also tools for placing grass and bushes, and creating trees. Physics Engine Next to the the built-in blazingly fast collision and repsonse system, there is also a full physics engine integrated when publishing as Windows .exe and Mac OS X .app. Character Animation You can model and animate characters using any 3D software, export it into one of the supported file formats and then import them into Coppercube. Also, it is possible to download existing 3D models from the web and use them in the editor. Low poly editing tools You can edit your own 3D models directly in CopperCube: It includes a simple 3D modelling tool for creating levels, models and items. Cross Platform Script system For advanced users, there is a Javascript API working on all publishing targets. Additionally, when using Flash, you can use ActionScript 3. And for WebGL, there is even a second big JavaScript library with direct access available, which is even open source. High quality Light Mapper The editor includes a high quality light mapping tool. Place your lights, click on 'calculate' and your 3D levels will look great. Native WebGL support Unlike in other 3D engines, CopperCube's WebGL code is handwritten and highly optimized: Your 3D game will download quickly and run fast, even if run directly on a website. CopperCube's WebGL client is just about incredible 200 KB in size! Many publishing targets Create 3D games for these targets, with one single click: Windows (.exe) apps Mac OS X (.app) apps WebGL websites (.html) Android (.apk) apps Flash websites (.swf) With the WebGL and Flash targets, your games work basically everywhere, even on iPhone and iPad. This is the Basic Edition of CopperCube, with which it is possible to create games, apps and websites with a maximum of 10 scenes per file. It is possible to upgrade to the Professional Edition via DLC, which then adds video playback support, adds a scene metrics tool, allows unlimited scenes per file, and has further smaller advanced features, like a CL interface.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/364970/header.jpg?t=1478232728",
    "Price": 19.99,
    "Developers": "Ambiera e.U.",
    "Publishers": "Ambiera e.U.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/364970/ss_071a87d13282b6990022b7f60eeb2e7a71a5dbf6.1920x1080.jpg?t=1478232728,https://cdn.akamai.steamstatic.com/steam/apps/364970/ss_afb9e223476415516e39824ebcc36676ec8bd0f8.1920x1080.jpg?t=1478232728,https://cdn.akamai.steamstatic.com/steam/apps/364970/ss_f0035e255bd2364eb25e65c9ae63ad588ff5c2c3.1920x1080.jpg?t=1478232728,https://cdn.akamai.steamstatic.com/steam/apps/364970/ss_0413da1089178ee5c831ff15ceef4cf2e8aa4d6f.1920x1080.jpg?t=1478232728,https://cdn.akamai.steamstatic.com/steam/apps/364970/ss_398738968b0fe545e88021f1e88b94bbead6c8a0.1920x1080.jpg?t=1478232728,https://cdn.akamai.steamstatic.com/steam/apps/364970/ss_d987b337e3c5d9143510d68769dd1859961e6ba7.1920x1080.jpg?t=1478232728,https://cdn.akamai.steamstatic.com/steam/apps/364970/ss_2f34a61cea9bac747a2184e6da702399b4a074c9.1920x1080.jpg?t=1478232728,https://cdn.akamai.steamstatic.com/steam/apps/364970/ss_eb8d3a602d963ab0ee4125f36edb61396b83bbc1.1920x1080.jpg?t=1478232728,https://cdn.akamai.steamstatic.com/steam/apps/364970/ss_49f296604877ed074ba4ff8a5da32d3dc63f9f9f.1920x1080.jpg?t=1478232728",
    "Slug": "coppercube-5-game-engine",
    "Meta Title": "CopperCube 5 Game Engine: May 1, 2015, Ambiera e.U. and F...",
    "Meta Description": "Looking for information on CopperCube 5 Game Engine? Check out the release date (May 1, 2015), developer insights from Ambiera e.U., and a complete game...",
    "Alt Text Image": "Official header image for CopperCube 5 Game Engine game - Steam 364970",
    "Canonical URL": "https://gusku.site/game/coppercube-5-game-engine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CopperCube 5 Game Engine\", \"description\": \"Looking for information on CopperCube 5 Game Engine? Check out the release date (May 1, 2015), developer insights from Ambiera e.U., and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 1, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ambiera e.U.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ambiera e.U.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/364970/header.jpg?t=1478232728\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}