{
    "AppID": 499580,
    "Name": "Crystal Control II",
    "Release date": "Jul 12, 2017",
    "About the game": "CAUTION! Crystal Control II is primarily a local multiplayer experience and requires at least one gamepad to fully enjoy. A solo practice mode can be played with keyboard only, but if you don't plan on playing with friends we don't recommend you buy our game! Crystal Control II is a competitive bullet hell game for two players. Choose from 8 characters, each with their own unique abilities, as you fight for control of the battlefield. Capturing crystals gives you more firepower, which means more bullets for your opponent to dodge. Capture majority crystals and unleash your special attack! Local multiplayer action for two! Fight for control of the crystals to gain more firepower and take out your opponent...you only need to get one hit on them to win! Easy to learn, hard to master! We've seen players of all skill levels pick up the game and understand it's simple controls. Don't let the simplicity fool you, though! The skill ceiling can be quite high, allowing room for the competitive folks to shine. Eight playable characters! Each character has different movement speeds, charge shots, and 'Control' abilities (which can be executed after capturing more than half of the total crystals on-screen)! Solo practice mode! Crystal Control II was designed from the ground up as a competitive game for two players, but if you don't have a friend nearby you can still enjoy our new target practice mode. try to get a high score on every stage! Some notes about controller support Crystal Control II is best played with two gamepads, but the game also includes two alternate modes if you only have one (keyboard vs gamepad or shared single gamepad). Unfortunately, it's impossible to play the Versus mode of Crystal Control II with keyboard only. Most keyboards have a limit on simultaneous key presses that is much too low for the number of keys Crystal Control II would require (which means that key presses would be dropped randomly and create unfair matches). Solo Mode, however, is playable with either a gamepad or a keyboard.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/499580/header.jpg?t=1500494474",
    "Price": 4.99,
    "Developers": "Virtually Competent, LLC",
    "Publishers": "Virtually Competent, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/499580/ss_03077e04085f701462f398d6506d9e5fc0803ce0.1920x1080.jpg?t=1500494474,https://cdn.akamai.steamstatic.com/steam/apps/499580/ss_6feb63ca2ec1a55d8c14667eb93c5542c506743e.1920x1080.jpg?t=1500494474,https://cdn.akamai.steamstatic.com/steam/apps/499580/ss_c419b2887f33dd2fa7c519e5fd4578eff51f9149.1920x1080.jpg?t=1500494474,https://cdn.akamai.steamstatic.com/steam/apps/499580/ss_eb66c763edf40f6f138c90f013e2e89b64ba0da2.1920x1080.jpg?t=1500494474,https://cdn.akamai.steamstatic.com/steam/apps/499580/ss_b7f0a86ceff0e8930a10029815bbfd3b1f1bfe63.1920x1080.jpg?t=1500494474",
    "Slug": "crystal-control-ii",
    "Meta Title": "Crystal Control II: Jul 12, 2017, Virtually Competent, LL...",
    "Meta Description": "Looking for information on Crystal Control II? Check out the release date (Jul 12, 2017), developer insights from Virtually Competent, LLC, and a comple...",
    "Alt Text Image": "Official header image for Crystal Control II game - Steam 499580",
    "Canonical URL": "https://gusku.site/game/crystal-control-ii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crystal Control II\", \"description\": \"Looking for information on Crystal Control II? Check out the release date (Jul 12, 2017), developer insights from Virtually Competent, LLC, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 12, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Virtually Competent, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Virtually Competent, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/499580/header.jpg?t=1500494474\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}