{
    "AppID": 1368850,
    "Name": "Cursed Treasure 2 Ultimate Edition - Tower Defense",
    "Release date": "Jul 14, 2022",
    "About the game": "Cursed Treasure 2 Ultimate Edition includes all existing game content of Cursed Treasure 2, plus 3 hand-crafted new levels! The total game re-balance and new mission rating system makes it more fun to play all previous levels once again, even if you have played before. The mission rating mechanism has been changed from 'Don't touch my gems' to 'Come touch my gems' that you always get a 3-star rating for the mission as long as there are still 3 gems on the field! The enemy waves have been adjusted and where the gem dropped will also affect enemies’ behaviors, all of these make the gameplay enjoyable with various of skills and tactics for many possible combinations. Why be good when you can be... bad? Cursed Treasure 2 is an addictive tower-defense game that puts the power of darkness at your fingertips. As a creature of ultimate evil, you don't ask for much... just to raze the odd kingdom and have your cache of all-powerful magical gems safely hidden away. Too bad the (ugh) good guys are out to steal them. Using the powers of the orcs, demons, and undead, you'll build unique and powerful towers along paths to destroy any hero that dares get close. Upgrade your undead crypts to instill fear in foes that make them flee in the opposite direction, or turn your demonic temples into mighty icons capable of turning the ground to lava beneath anyone's feet. You'll upgrade and enhance each unique type, and of course, unlock spells of your own to enter the fray... when the going gets tough, the tough drop meteors on everyone else, after all. Sure, your enemies have paladins and angels and ninjas and more, but when you've got power like yours, they'll wish they stayed at home. Cursed Treasure 2 is casual but engaging tower-defense with style, packed with 27 levels that can be conquered normally or in Night Mode for even more challenge. It's good to be bad. Features Three powerful and monstrous tower-types, each with their own unique skills to unlock! 27 levels of maniacal mayhem across a lush fantasy world. Replay stages in re-balanced Night Mode with limited illumination for added challenge. Earn ability points to improve everything from spells to towers and more. A wide variety of enemies tricky powers and abilities to overcome. A vibrant and colorful style... just because you're evil doesn't mean you can't look good. What's new in Ultimate Edition 3 gems instead of 5 and updated mission rating requirements: just keep all the gems on the level to get Brilliant! Yes, they can touch your gems now. 3 brand-new levels! Hand-crafted and polished. Total re-balance. More fun on every enemy wave. Among other things, the dwarves are not that mighty now - don’t bother piling up the skulls to beat them. Easy mana bottles and coins pick-up with mouse over. You won’t mis-click the scrolls anymore. Mana bottles auto-collection. Don't forget to upgrade the mana limit! Updated experience system - now you get experience even if you lose. But not if you quit - hold on to the last! Optimization and debugging for the smoother evil spreading experience. No more erased saves",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1368850/header.jpg?t=1658397593",
    "Price": 8.99,
    "Developers": "IriySoft",
    "Publishers": "Surefire.Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1368850/ss_bde3847f4674b4bd229be170f7579ba4f7c5b798.1920x1080.jpg?t=1658397593,https://cdn.akamai.steamstatic.com/steam/apps/1368850/ss_ab91b48d29665685835584a540ee32125b2eb81a.1920x1080.jpg?t=1658397593,https://cdn.akamai.steamstatic.com/steam/apps/1368850/ss_d73f8d37b4de514d113ae89c1706e0a0f37b294a.1920x1080.jpg?t=1658397593,https://cdn.akamai.steamstatic.com/steam/apps/1368850/ss_386929430a2aef2eea5e69936a2c55bfd1cc3d8c.1920x1080.jpg?t=1658397593,https://cdn.akamai.steamstatic.com/steam/apps/1368850/ss_0b60c6718d58e2e3adfa2c7458540916f1c2d568.1920x1080.jpg?t=1658397593,https://cdn.akamai.steamstatic.com/steam/apps/1368850/ss_715474df7f5a406d520a98aab3eea71169296bd7.1920x1080.jpg?t=1658397593,https://cdn.akamai.steamstatic.com/steam/apps/1368850/ss_e83a52e3c3caaad4eecf86c9553c995da258a0f7.1920x1080.jpg?t=1658397593,https://cdn.akamai.steamstatic.com/steam/apps/1368850/ss_2ad36a54a5be349a4d638dc25033d1a807a97d0b.1920x1080.jpg?t=1658397593,https://cdn.akamai.steamstatic.com/steam/apps/1368850/ss_293df59a34510a71aab528f0d2442a11e3d19c66.1920x1080.jpg?t=1658397593,https://cdn.akamai.steamstatic.com/steam/apps/1368850/ss_f14ece9a9ffa9590c2557aaa86d8ee17ffb5e9b4.1920x1080.jpg?t=1658397593,https://cdn.akamai.steamstatic.com/steam/apps/1368850/ss_6baafba48107fa46b2fe3744c90fa3841c83a9de.1920x1080.jpg?t=1658397593",
    "Slug": "cursed-treasure-2-ultimate-edition-tower-defense",
    "Meta Title": "Cursed Treasure 2 Ultimate Edition - Tower Defense: Jul 1...",
    "Meta Description": "Looking for information on Cursed Treasure 2 Ultimate Edition - Tower Defense? Check out the release date (Jul 14, 2022), developer insights from IriySo...",
    "Alt Text Image": "Official header image for Cursed Treasure 2 Ultimate Edition - Tower Defense game - Steam 1368850",
    "Canonical URL": "https://gusku.site/game/cursed-treasure-2-ultimate-edition-tower-defense",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cursed Treasure 2 Ultimate Edition - Tower Defense\", \"description\": \"Looking for information on Cursed Treasure 2 Ultimate Edition - Tower Defense? Check out the release date (Jul 14, 2022), developer insights from IriySo...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"IriySoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Surefire.Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1368850/header.jpg?t=1658397593\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}