{
    "AppID": 1104050,
    "Name": "Deep Diving VR",
    "Release date": "Sep 12, 2019",
    "About the game": "Deep Diving Simulator has been remade and reworked for the Virtual Reality audience as each part of the game has been carefully redesigned and reprogrammed to allow for the best aquatic experience there is! Approach the sea life, explore new areas, and discover the unknown in a completely new and engaging way! Swim your way to your destination one stroke at a time! By the community's request, the game supports all of the currently available controllers such as the Oculus Touch, Vive controllers, the always popular gamepad, and even the classic mouse and keyboard. WHAT CAN YOU EXPECT? Deep Diving VR will enable you to experience what it takes to be a modern diver. With relaxing exploration, you will discover the uncharted waters of the world while carefully monitoring your oxygen level and decompression. Gather forsaken relics, visit sunken vessels, discover unknown species and be rewarded by Professor Adams for your findings. Each submerge gives you the opportunity to uncover mysteries that would prefer to remain forever forgotten, such as the lost city of Atlantis. KEY FEATURES Stunning Visuals - from the coldest oceans to the hottest seas, immerse yourself in the underwater adventure by experiencing beautiful locations and vivid sea life. Immersive Approach - each dive teaches you what it takes to be a professional diver as you must take care of your oxygen level as well as managing your position to avoid the life-threatening decompression sickness. Underwater Danger - the world you are about to visit is a precarious one as you have to avoid hidden rays, roaming sharks, and a whole lot more. Hunting for the Unknown - help Professor Adams in recovering various sunken objects while learning about our mysterious underwater world. Prepare Yourself - with each successful dive you will acquire more valuable gear which enables you to unlock areas you previously could not reach before. Games Beyond™ - lend a hand in saving our oceans and seas while learning about the submerged world and its enigmatic inhabitants.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1104050/header.jpg?t=1591289209",
    "Price": 19.99,
    "Developers": "Jujubee S.A.",
    "Publishers": "Jujubee S.A.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1104050/ss_4ae509f7759bb48eaef00d8be2ff1b5180fdd4ec.1920x1080.jpg?t=1591289209,https://cdn.akamai.steamstatic.com/steam/apps/1104050/ss_7a0c64f9e41185312b92975921a70ea247610b8c.1920x1080.jpg?t=1591289209,https://cdn.akamai.steamstatic.com/steam/apps/1104050/ss_b8abd877177914433e452a4c7ada7467260bb3b3.1920x1080.jpg?t=1591289209,https://cdn.akamai.steamstatic.com/steam/apps/1104050/ss_124d2acff60ef941d3e58c5b6ce4a43369c399ac.1920x1080.jpg?t=1591289209,https://cdn.akamai.steamstatic.com/steam/apps/1104050/ss_aacc7627d05e05800975d8555fbd1af8ed09a2fb.1920x1080.jpg?t=1591289209",
    "Slug": "deep-diving-vr",
    "Meta Title": "Deep Diving VR: Sep 12, 2019, Jujubee S.A. and Full Overview",
    "Meta Description": "Looking for information on Deep Diving VR? Check out the release date (Sep 12, 2019), developer insights from Jujubee S.A., and a complete game summary.",
    "Alt Text Image": "Official header image for Deep Diving VR game - Steam 1104050",
    "Canonical URL": "https://gusku.site/game/deep-diving-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Deep Diving VR\", \"description\": \"Looking for information on Deep Diving VR? Check out the release date (Sep 12, 2019), developer insights from Jujubee S.A., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jujubee S.A.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jujubee S.A.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1104050/header.jpg?t=1591289209\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}