{
    "AppID": 1900720,
    "Name": "For The Fatherland",
    "Release date": "Jun 6, 2022",
    "About the game": "6 June 1944, the greatest military invasion in human history begins with over 150.000 Allied soldiers landing in Normandy to face the German Wehrmacht and bring an end to the Second World War. The German Reich has been taken by surprise and for the first time since 1939 it is at risk of a defeat. You have been given the glorious task of stopping the Allied invasion and defending the German territories on the western front. Will you be worthy and protect the Fatherland? Tower Defense In Big! For The Fatherland is a tower defense strategy game taking place during the Second World War and you are in charge of the German forces trying to stop the attacking Allied troops. Place your units in strategic positions, make use of special abilities, and manage resources to counter the incoming enemy waves on large maps with up to four lanes. The future of the Reich is in your hands. Are you up for the challenge? Ongoing Development Currently the game is in the first stage of development with two playable maps (D-Day Beach Landing, Bocage Village) including 8 player units ( e.g., Rifle, Scope, Machine Gun, Flamethrower, Landmine), 5 enemy units (e.g., Rifle, Submachine Gun, Machine Gun), and 4 special abilities such as Smoke Granade. A total of five maps with varying design and mechanics, and additional units such as vehicles are planned for the later stages of development in accordance to community feedback. The current version of FTF includes: Two large maps with four predetermined creep lanes inspired by the D-Day landing on Omaha beach and the Battle of Villers-Bocage Predetermined tower spots in realistic positions Eight tower units including a German Rifleman, a Sniper, a Machine Gunner, a Flamethrower, and a Landmine Five creep units e.g., a American Rifleman, a Submachine Gunner, and a Machine Gunner Four special abilities: Smoke Grenade, Mortar Strike, and Sniper Shot Upgrades for increased damage and unlockables All units vary in damage, cost, speed et cetera Planned for the future: Flexible creep pathways and free placement of player units to allow more strategic variety Usable map effects and abilities such as artillery fire, boost etc. Advanced units including land vehicles and planes Three additional maps in different settings (Carentan, ???, ???) Join the Community Please consider helping with the development of For The Fatherland and kindly provide feedback on unit and effect balancing, as well as on the map design. Moreover, you can find additional media, screenshots, and development updates on the discord server! For The Fatherland!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1900720/header.jpg?t=1658741144",
    "Price": 4.99,
    "Developers": "Zuckrprinz Games",
    "Publishers": "Zuckrprinz Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1900720/ss_de670f2f32d1e0daada997509a91bd614ff88775.1920x1080.jpg?t=1658741144,https://cdn.akamai.steamstatic.com/steam/apps/1900720/ss_99f68245e53a7d9a86ace9dc4870f0460a0154b7.1920x1080.jpg?t=1658741144,https://cdn.akamai.steamstatic.com/steam/apps/1900720/ss_5f0a41300a6d85d65dea31aa83816411a1b4ac3a.1920x1080.jpg?t=1658741144,https://cdn.akamai.steamstatic.com/steam/apps/1900720/ss_69cd62e9e9a1d91adfa9fd5ed02b1e1d56ba558c.1920x1080.jpg?t=1658741144,https://cdn.akamai.steamstatic.com/steam/apps/1900720/ss_36a88e83c6205a70b3c2ee187c2ccecfb37703f4.1920x1080.jpg?t=1658741144,https://cdn.akamai.steamstatic.com/steam/apps/1900720/ss_c2055c5073fbad04c264d19b2cfe502e779dc0ef.1920x1080.jpg?t=1658741144,https://cdn.akamai.steamstatic.com/steam/apps/1900720/ss_c7e74d5bc022d77ba2c1ed4af0deaef2dff6dcd6.1920x1080.jpg?t=1658741144,https://cdn.akamai.steamstatic.com/steam/apps/1900720/ss_6efd1277fa40666fd2c0a88ae5f8f9ffdae8c3a0.1920x1080.jpg?t=1658741144,https://cdn.akamai.steamstatic.com/steam/apps/1900720/ss_c8ad33fee33934a6ddc9c10bb613932971183c9a.1920x1080.jpg?t=1658741144,https://cdn.akamai.steamstatic.com/steam/apps/1900720/ss_b1ec367d53792cac25521ab88a64ade0989377f1.1920x1080.jpg?t=1658741144",
    "Slug": "for-the-fatherland",
    "Meta Title": "For The Fatherland: Jun 6, 2022, Zuckrprinz Games and Ful...",
    "Meta Description": "Looking for information on For The Fatherland? Check out the release date (Jun 6, 2022), developer insights from Zuckrprinz Games, and a complete game s...",
    "Alt Text Image": "Official header image for For The Fatherland game - Steam 1900720",
    "Canonical URL": "https://gusku.site/game/for-the-fatherland",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"For The Fatherland\", \"description\": \"Looking for information on For The Fatherland? Check out the release date (Jun 6, 2022), developer insights from Zuckrprinz Games, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zuckrprinz Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zuckrprinz Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1900720/header.jpg?t=1658741144\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}