{
    "AppID": 1567800,
    "Name": "星空列车与白的旅行",
    "Release date": "May 14, 2021",
    "About the game": "Game introduction The train I hopped on races through the darkness of the night, under the starry sky. What a great trip. This tour was a winner. I travel alone, with the pleasant night breeze blowing against me. I’ve met some friendly passengers, a cute conductor… and a girl with cat ears? What will this journey leave within her? And what will it bestow unto me? …Let us have a fun journey together. Noir (the correct would be Noire though…) CV. Ohno Yuuko The protagonist meets her by chance on the train, the Milky Way. Though she has cat ears and a tail growing from her, she doesn’t seem to pay them any heed. She has no memories and is always in a daze. Although it’s unclear who Noire is, she has a soft spot for Akatsuki. I’m the conductor of this train, and will be the guide for this tour. My name is Karuha Ramuneko, but you can call me Karuha-chan. Karuha CV. Hoshitani Mio She introduces herself as the guide of the Stellar Railway, the Milky Way. Though she calls herself a conductor, she has no knowledge on trains and quickly panics when something goes wrong. Karuha is the type who can’t do anything unless the protagonist gives her a little push on the back. Uu... But the kitty was afraid. Neri CV. Serizawa Yuu A mysterious girl, but Akatsuki feels like he’s met her before… I’ll go smoke in another car then. Could you say sorry to her for me? Hanae CV. Kohara Riko A beautiful lady who happens to be sharing the ride. Being a chain smoker, she can’t get very close to Noire who doesn’t like smoke. Fuhh, nghhh… I can’t eat any more… Gibier CV. Oomori Nichika A cheerful girl and fellow passenger, she hails from Sweden. Gibier is of course a nickname – her real name is Jennifer Manyorder. Personally, I’m satisfied with just getting to taste this. Takase CV. Kawanishi Kengo Seated at the very back of the train, he always looks up at the stars in the sky. Rather aloof and detached. Kaneshiro Akatsuki A fairly dull animator, he dreams to become a director one day and create his own anime but is still quite a ways away. He manages to win a slot on a rail tour that he happened to apply for, and so goes on a strange journey. Gameplay This is a visual novel. You can read it by clicking the mouse. There is no game operability. Disclaimer: All the characters in this game were over 18 years old at the time of the game plot.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1567800/header.jpg?t=1636464184",
    "Price": 19.99,
    "Developers": "しらたまこ",
    "Publishers": "inc.ZOFE,Syawase Works China",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1567800/ss_0a867988459c958759b309d3ae3f8e2b08c492a7.1920x1080.jpg?t=1636464184,https://cdn.akamai.steamstatic.com/steam/apps/1567800/ss_ad089bbbd3d0772108b49957aa9741b572709680.1920x1080.jpg?t=1636464184,https://cdn.akamai.steamstatic.com/steam/apps/1567800/ss_50e787c76248031ad02856e0c01f4aa62fe4ad77.1920x1080.jpg?t=1636464184,https://cdn.akamai.steamstatic.com/steam/apps/1567800/ss_76102ca0e3086cd74392505a7ed86f5028518ed3.1920x1080.jpg?t=1636464184,https://cdn.akamai.steamstatic.com/steam/apps/1567800/ss_63476b6978b052819108d9fd6e22fb67b6012798.1920x1080.jpg?t=1636464184,https://cdn.akamai.steamstatic.com/steam/apps/1567800/ss_b4ab1913fb3fa4dfc25ad22f7f88152e55280894.1920x1080.jpg?t=1636464184,https://cdn.akamai.steamstatic.com/steam/apps/1567800/ss_1832aeb2724f195f7437fa41d32ac56b204ba4a4.1920x1080.jpg?t=1636464184,https://cdn.akamai.steamstatic.com/steam/apps/1567800/ss_ae3665438cffe4eb77788f9b097c6b6a89dc0bda.1920x1080.jpg?t=1636464184",
    "Slug": "",
    "Meta Title": "星空列车与白的旅行: May 14, 2021, しらたまこ and Full Overview",
    "Meta Description": "Looking for information on 星空列车与白的旅行? Check out the release date (May 14, 2021), developer insights from しらたまこ, and a complete game summary.",
    "Alt Text Image": "Official header image for 星空列车与白的旅行 game - Steam 1567800",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u661f\\u7a7a\\u5217\\u8f66\\u4e0e\\u767d\\u7684\\u65c5\\u884c\", \"description\": \"Looking for information on \\u661f\\u7a7a\\u5217\\u8f66\\u4e0e\\u767d\\u7684\\u65c5\\u884c? Check out the release date (May 14, 2021), developer insights from \\u3057\\u3089\\u305f\\u307e\\u3053, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u3057\\u3089\\u305f\\u307e\\u3053\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"inc.ZOFE,Syawase Works China\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1567800/header.jpg?t=1636464184\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}