{
    "AppID": 1758550,
    "Name": "契约唤灵师",
    "Release date": "Nov 9, 2021",
    "About the game": "'Contract Summoner' is a two-dimensional multiplayer online game. The battle mode of the game is round battle. The game itself will not be open for internal purchase. Game features: *Role selection: There are three different classes for players to choose at the beginning of the game. When each character reaches level 65, it will be open to the second genre. Players can choose and add points freely according to their preferences *Partner system: This is the largest and most important system of the game. Players can obtain partners with different functions by recruiting and collecting fragments, and can freely match the lineup. The training directions of partners with different functions are also very different. At the same time, players can complete the specified tasks, obtain skin vouchers and redeem skin for their favorite partners. *Various ways to play: There are rich mainline, branch line tasks and daily tasks in the game. In addition, the game has different biased tasks. Players can complete some or all of them according to their own needs. In order to increase the interest of the game, we have also added some. *Equipment creation: After reaching level 50, six different stunt equipment may be created, and the equipment also has other small enhancement systems. Players can build their own equipment according to their professional positioning. *Lineup matching: The game battle is the protagonist + 4 own partners (other players). The partners are divided into ordinary and legendary partners. Players can build multiple lineups to deal with various battles in the game. Scientific lineup matching is a great skill for you to beat the level. Come and join our game! Set up your own guild, strengthen your equipment and cultivate your partners. Let yourself not fear the challenge of any level. I hope the game can bring happy surprise experience to all players",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1758550/header.jpg?t=1636524061",
    "Price": 10.99,
    "Developers": "五五开工作室",
    "Publishers": "五五开工作室",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1758550/ss_3ebe75507618c72b493f54ae1edbcf87c3336aad.1920x1080.jpg?t=1636524061,https://cdn.akamai.steamstatic.com/steam/apps/1758550/ss_cba14fb4e549f7079fb9f872bb65706645218d0f.1920x1080.jpg?t=1636524061,https://cdn.akamai.steamstatic.com/steam/apps/1758550/ss_a52af93872a2bb51338eb7b41e14bb3c1a332333.1920x1080.jpg?t=1636524061,https://cdn.akamai.steamstatic.com/steam/apps/1758550/ss_de46149d26ee78ec6eace8aa284246bf118d73ce.1920x1080.jpg?t=1636524061,https://cdn.akamai.steamstatic.com/steam/apps/1758550/ss_07167ac671ab9b3ce1329e7daf238cb536afe7dc.1920x1080.jpg?t=1636524061",
    "Slug": "",
    "Meta Title": "契约唤灵师: Nov 9, 2021, 五五开工作室 and Full Overview",
    "Meta Description": "Looking for information on 契约唤灵师? Check out the release date (Nov 9, 2021), developer insights from 五五开工作室, and a complete game summary.",
    "Alt Text Image": "Official header image for 契约唤灵师 game - Steam 1758550",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5951\\u7ea6\\u5524\\u7075\\u5e08\", \"description\": \"Looking for information on \\u5951\\u7ea6\\u5524\\u7075\\u5e08? Check out the release date (Nov 9, 2021), developer insights from \\u4e94\\u4e94\\u5f00\\u5de5\\u4f5c\\u5ba4, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 9, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4e94\\u4e94\\u5f00\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u4e94\\u4e94\\u5f00\\u5de5\\u4f5c\\u5ba4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1758550/header.jpg?t=1636524061\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}