{
    "AppID": 1600900,
    "Name": "怕不怕趴喵霸霸 Ghost Party Nyanbaba",
    "Release date": "Jan 21, 2022",
    "About the game": "Story background: Nyanbaba from the cat's ear planet came to earth in a flying saucer and burned his tongue with milk tea as soon as he landed. Angry nyambaba, she said she would retaliate against mankind with magic! Introduction to the game: This is a very scary (cute?) Looking for hidden item type click game! The game player plays the weak and stupid human, investigates suspicious hidden objects in various styles, and does not let Nyanbaba's magic trick succeed. Some of the hidden points are illogical or strange, and some may be ancient and strange big monsters (little cute?). Please find all hidden points within the time, otherwise the villain nyanbaba will jump out and scare the players with very, very scary (actually cute) Chinese voice! Playing methods and features: Lovely story setting, lovely art style, lovely Chinese dubbing. It contains 10 different scenes, and each scene contains 20 strange hidden points. Different from the traditional hidden goods game, it is not a reference comparison between the left and right of the two pictures, but a single picture, with a wider field of vision. After playing each scene repeatedly and accumulating 100%, the button to enter the second round mode will appear. Hidden points appear randomly in the first round, and all hidden points appear in the second round. Click error to deduct seconds. Deduct more seconds in the second round. Suitable for family fun of all ages. The rules are simple and there is no language understanding barrier. Hidden achievements are hidden in built-in secrets. Suitable for works, gifts for children and girlfriends, as well as all cat girl fans! Because the personal charm of cat girls may lead to mental retardation of some players, and the symptoms are deliberate failure. 故事背景： 来自猫耳娘星球的Nyanbaba驾驶着飞碟来到地球，刚刚降落就被奶茶烫伤了舌头。震怒的Nyanbaba，她表示要用幻术对人类发起报复！ 游戏介绍： 这是一款非常可怕（可爱？）的寻找隐藏物品类型的点击游戏！ 玩家扮演弱小愚蠢的人类，在各种风格的场景中，调查可疑的隐藏物品，不让Nyanbaba的幻术得逞。 隐藏点有些是不符合逻辑或是奇怪的，有些可能是古灵精怪的大怪兽（小可爱？）。 请在时间之内找到所有隐藏点，否则大反派Nyanbaba会跳出来，用非常非常恐怖（实际上可爱）的中文语音吓唬玩家！ 玩法和特色： 可爱的故事设定，可爱的美术风格，可爱的中文配音。 包含10个不同的场景，每个场景包含20个奇怪的隐藏点。 不同于传统隐藏物品游戏，并非2个图左右参照对比，而是单独一幅画面，视野更加开阔。 反复游玩每个场景积累到100%后，会出现进入第二轮模式的按钮。 第一轮随机出现隐藏点，第二轮出现全部隐藏点。 点击错误，扣除秒数。第二轮扣除更多秒数。 适合全年龄阖家欢。 规则简单，无语言理解障碍。 隐藏成就藏在内置秘籍里。 适合作品礼物送给小朋友和女朋友，还有所有猫女孩粉丝！ 因为猫女孩的个人魅力可能导致一些玩家降智，症状表现为故意失败。",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1600900/header.jpg?t=1652139040",
    "Price": 0.99,
    "Developers": "冷笑黑妖",
    "Publishers": "冷笑黑妖",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1600900/ss_8dbe18a685add8ccbd6e7c1854b9885ea161198e.1920x1080.jpg?t=1652139040,https://cdn.akamai.steamstatic.com/steam/apps/1600900/ss_d56d9fc6dec26f2b7f1382e0abc0e66593b4536c.1920x1080.jpg?t=1652139040,https://cdn.akamai.steamstatic.com/steam/apps/1600900/ss_abf2134870c4636497095f878071ec90ef60cf56.1920x1080.jpg?t=1652139040,https://cdn.akamai.steamstatic.com/steam/apps/1600900/ss_d1a396d5875f9ce20b772d2bde158119b3e3893b.1920x1080.jpg?t=1652139040,https://cdn.akamai.steamstatic.com/steam/apps/1600900/ss_0908b15fc25dbee2036f3ab69baa0283ba5bf824.1920x1080.jpg?t=1652139040",
    "Slug": "ghost-party-nyanbaba",
    "Meta Title": "怕不怕趴喵霸霸 Ghost Party Nyanbaba: Jan 21, 2022, 冷笑黑妖 and Full...",
    "Meta Description": "Looking for information on 怕不怕趴喵霸霸 Ghost Party Nyanbaba? Check out the release date (Jan 21, 2022), developer insights from 冷笑黑妖, and a complete game su...",
    "Alt Text Image": "Official header image for 怕不怕趴喵霸霸 Ghost Party Nyanbaba game - Steam 1600900",
    "Canonical URL": "https://gusku.site/game/ghost-party-nyanbaba",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6015\\u4e0d\\u6015\\u8db4\\u55b5\\u9738\\u9738 Ghost Party Nyanbaba\", \"description\": \"Looking for information on \\u6015\\u4e0d\\u6015\\u8db4\\u55b5\\u9738\\u9738 Ghost Party Nyanbaba? Check out the release date (Jan 21, 2022), developer insights from \\u51b7\\u7b11\\u9ed1\\u5996, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u51b7\\u7b11\\u9ed1\\u5996\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u51b7\\u7b11\\u9ed1\\u5996\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1600900/header.jpg?t=1652139040\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}