{
    "AppID": 1251970,
    "Name": "Gladiator Manager",
    "Release date": "Jan 28, 2021",
    "About the game": "Overview Gladiator Manager is a sports management and tactical text-based battle simulation game. The player takes on the role of manager of a team of gladiators, trying to win a league and a cup. The back end managerial part of the game has similarities to games like Football Manager and Out of the Park and involves hiring new fighters by judging their potential and skills, training them, and then selecting the right combination to gain tactical advantages over opposing teams. Fighters can be veterans, citizens, criminals or slaves, each with their own unique game mechanisms and characteristics, and come in six classes: gladiator, rogue, barbarian, defender, retarius and leader. Each class can hybridize by selecting perks from other trees. Key Features Simultaneous turn based combat Class advantage and RPS decisions Armour and blood mechanics 6 different fighter classes 4 different origin stories Over 100 perks including over 30 special moves Develop specialist class killers Discipline, bravery and morale Disobedient fighters sometimes ignore your instructions Try to maintain high control in fights by using defensive moves to generate better attacking opportunities Highly detailed optional battle report that reveals every RNG roll for every single mechanic – no ‘black box’ outcomes Strategic selection in 1v1, 2v2, 3v3 and 4v4 fights Stats, stats, stats! Over 100 different types of injury, with different consequences Blindness, concussion, unconsciousness and severed limbs Detailed injury recovery system with realistic temporary and permanent consequences Economic simulation with wages and signing fees, prize money and kill bonuses Sophisticated newgen fighter generator with new hiring options every four fights that depend on team reputation 5 tier league system and cup Full and optimised blow by blow simulation of all other AI games to ensure realistic results Team popularity mechanic that is influenced by fighter bravery and correlates to crowd attendance Training and development Sophisticated portrait generator with over 310 million combinations Full customisation options for gladiator and world themes, allowing ancient or modern names Moddable txt and sql files to allow changes to name generation and save game files Tactical Battles The battles are turn-based, tactical, and deeply simulated. A key feature is that all orders are issued to all fighters simultaneously by the player and the AI resulting in a rock, paper, scissors outcome that depends on whether the fighters are trying to attack, defend, move or pull off a special strategy. The chances of success depend largely on the relative control of the fighters, and that in turn depends on whether they have managed to defend successfully in previous turns. Fighters can gain access to over 30 special moves by levelling up, and another 60+ passive perks. Fantastic Artwork Fighters are rendered beautifully by a powerful random portrait generator that can create a whopping 310,810,500 combinations from different parts lovingly crafted by the amazing French artist Mesrile. We are really proud of the result which in our view tops the portraits put out by many triple A games like CK2. Transparent and Player-Controlled Randomness Another key feature to the game is total transparency of battle mechanics. As a simulation game there is naturally a lot of random number generation on the default settings, but by clicking on the ‘detailed battle report’ tab on the battle screen the player can see every single roll that the game makes, and can determine exactly why any particular outcome has occurred. This also allows the player to work out what fighter attributes are especially important in any given situation. Don't like RNG? Just turn it off! The game has three modes: simulation (default); low RNG (akin to the D&amp;D D20 system); and fixed - with no RNG at all! In line with the battle mechanic transparency the game is also completely transparent about the effectiveness of training and fighter development. A fighter’s ability to improve attributes is determined by a focus set by the player and their innate potential for a given skill – something the player can begin to work out by watching how well they develop. The game always lets the player know when training succeeds. Deep Simulation The game keeps a wide selection of statistical records of the fighters for all the sports fan stat geeks out there, and displays them at the end of the fight. All other enemy v enemy battles are fully simulated with no shortcuts, to ensure that the league is always an accurate representation of the ability of the teams. The AI gets no advantages and fights with the same options as the player. There are five leagues, with ten teams in each, and a cup competition that spans the leagues each season. Detailed and Realistic Injuries Whether they succeed or fail, a fighter can be injured, maimed or killed in the arena, and the game has a detailed injury mechanism whereby a fighter can suffer from over 100 different specific injuries that have varying effect on their ability to fight. Some injuries can result in blindness, concussion or loss of a limb, with corresponding consequences in battle. In the end a fighter will either be killed or will succumb to fear and yield. Customisation The game can be considerably customised, with selectable themes for the world (team names, division names) and for the fighters, with randomly generated names from Rome, Gaul, Britannia or modern-day Europe (England, Spain, France, Italy, Russia). The player can even choose total randomness, giving a mixture of names from all themes. Not enough customisation? Download any free SQLite editor and change any aspect of your save game. Present Build The game is currently fully functional and can be played successfully over multiple seasons. There are bound to be some remaining bugs but there are no known game breakers. The game is pre-alpha and has not yet been released. Plans for the Future! Game development will not end with release. I fully intend to continue supporting the game going forwards, adding features for free, with no planned DLC. That may change if I decide to introduce any really massive new features. Current plans for the next year include: Persistent Morale and Energy between fights to impact on selection choices Scouting options to improve recruitment and recruit visibility Synergy options between gladiators using personality, nationality and relationships Additional difficulty options In-game achievement rewards (correlating with Steam achievements)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1251970/header.jpg?t=1611856249",
    "Price": 7.99,
    "Developers": "Eternity Games",
    "Publishers": "Eternity Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_b9255164e62b90a6ee01766c49e97246fab873cb.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_76cdae6a059a8b394b550d29ec0d9f9851dd26d3.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_24d432d33c0f79a6a08b2bfaa1edabe591104024.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_6bfe2fd1de38db556f1e1d5972d24b7f27ad42f4.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_cb7e735ea8f342eea25721ac017a0308c9900b19.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_bad447cc36df0d03950adf51d438a19efbd6f18b.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_fef3df4568cbc50ce61b24fbcd6b2cbc0988085d.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_907a7782795b100e25e3bdc59041338a2965df1d.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_65392c56a0c0d382c94176c5f4d48d178fc7f88f.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_1cd2b8ba2456221371197c4cc0d080420d43eacd.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_38884e08645b3ea1ffa60cb68c62699b952b5353.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_8be01b66dd21f9c6c0270761b4c5c0551f12cec2.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_1597d95063e38054a5e6d3ce3158a5faa1ede3fb.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_6c38ddc2e3ca4d8d918916949ccf25e94b1f4b10.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_d4483ac07a325dc1ea949cddd7674ad79340a32d.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_8fd7e3f2357c168e2f9e9e051aa5bac1206c36d7.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_c9cd52298e02a36e4112f5a95144fc0c9afd4029.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_47ae7daa54ba8bff4ec331648d1cb71e44b37658.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_dab4e453f6073c5b2d2eb3e015a6e2a233a74ded.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_d6303400f84839d153a4cb6728e9a82a673fe616.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_4571aeedc5c5af2ad7b7ce791408548f00805a75.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_f9dd443481204d254fd9c4af2cf5ca43cabe2330.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_92e8e0602781cae6a97b9f01190d3416d5ab602e.1920x1080.jpg?t=1611856249,https://cdn.akamai.steamstatic.com/steam/apps/1251970/ss_e91d13161a23f6310e5c4dda6fd3878c7eddad73.1920x1080.jpg?t=1611856249",
    "Slug": "gladiator-manager",
    "Meta Title": "Gladiator Manager: Jan 28, 2021, Eternity Games and Full ...",
    "Meta Description": "Looking for information on Gladiator Manager? Check out the release date (Jan 28, 2021), developer insights from Eternity Games, and a complete game sum...",
    "Alt Text Image": "Official header image for Gladiator Manager game - Steam 1251970",
    "Canonical URL": "https://gusku.site/game/gladiator-manager",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gladiator Manager\", \"description\": \"Looking for information on Gladiator Manager? Check out the release date (Jan 28, 2021), developer insights from Eternity Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eternity Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eternity Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1251970/header.jpg?t=1611856249\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}