{
    "AppID": 1851380,
    "Name": "Happy's Humble Burger Barn",
    "Release date": "Dec 28, 2021",
    "About the game": "Happy's Humble Burger Barn was the prototype concept we published on Itch.io in 2020. A little over a year later we created our fully featured title Happy's Humble Burger Farm. We wanted to release the prequel on steam so the game can be experienced by those who have never played it before! Have you ever DREAMED of working at the best burger place ever? Your dream is about to become a reality as you just landed a brand new job at Happy's Humble Burger Barn! Welcome to Happy Humble's Burger Barn, home of the chilled beef burger, can we take your order? It's time to show your new boss what you're made of. Don't let the Happy's Humble Family down! Featuring a state-of-the-art Burger Chef Simulation™ that'll get your buns toasted and patty sizzlin'. The burger cooking is so realistic your very perception of reality will abruptly fade into a kaleidoscope of introspective turmoil that is re-transmitted as the ultimate low-poly PS1 burger cooking experience! The sizzle of the burgers as they cook on the grill, like music to your ears, will lull you into a deep relaxation not unlike an ASMR whisperer with a rare talent and the highest-end microphone connected directly into your ears like vintage Leslie speakers with the rotary cranked. The crispy green lettuce, the tomato oh-so ripe and juicy, the onions sliced to perfection will have your taste-buds surfing the waves of satisfaction, impressing all the tourists that had congregated at Burger Beach on Flavor Island. Tend to your customers as their demand for Happy's delicious Chilled Beef Burgers increases every minute. Satiate their hunger, quench their thirst...after all, the customer is always right. Fulfill orders from the menu featuring mouth watering items such as: The Happy's Deluxe Burger French Fries Salmon Nuggets Soft Drinks Shakes What are you waiting for? You have customers waiting! Your goal as a Happy Humble Employee is to manage all aspects of the restaurant. The entire staff had the great timing of ALL calling out on your first day. Even the person who is supposed to be training you! This includes sanitation, order delivery, and general fast food duties. Try to fulfill all the customers orders while living your best life as a minimum wage worker. Flip the burger, fill the cup. Scoop the fries, order up! Flip the burger, fill the cup. Scoop the nuggets, order up! Flip the burger, fill the cup. Scoop the fries, order up! Flip the burger, fill the cup. Scoop the nuggets, order up! And on, and on it goes. What tangled deep fried webs we weave. Happy's Humble Burger Barn is a horror / thriller adventure with a focus on perception. This small game was made in a little under a month and is our homage to the PSX era and aesthetic. It's a short (~1 hour) experience in which we focused on experimental design concepts",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1851380/header.jpg?t=1640724155",
    "Price": 0.0,
    "Developers": "Scythe Dev Team",
    "Publishers": "tinyBuild",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1851380/ss_ad1131582122bab668b49586170f2cbc83f77ab0.1920x1080.jpg?t=1640724155,https://cdn.akamai.steamstatic.com/steam/apps/1851380/ss_d1c3ae6cd5ba1fc721023670e0d86aa1644c2aa2.1920x1080.jpg?t=1640724155,https://cdn.akamai.steamstatic.com/steam/apps/1851380/ss_02fcf5812916d930f50bafb6a5079ac230f7f56d.1920x1080.jpg?t=1640724155,https://cdn.akamai.steamstatic.com/steam/apps/1851380/ss_9c883a1b7dd36a9c3ebff72e095be26186a5ffa2.1920x1080.jpg?t=1640724155,https://cdn.akamai.steamstatic.com/steam/apps/1851380/ss_a2df020505cd3f6d7c1d50bb72b153f5f3c65a9e.1920x1080.jpg?t=1640724155",
    "Slug": "happy-s-humble-burger-barn",
    "Meta Title": "Happy's Humble Burger Barn: Dec 28, 2021, Scythe Dev Team...",
    "Meta Description": "Looking for information on Happy's Humble Burger Barn? Check out the release date (Dec 28, 2021), developer insights from Scythe Dev Team, and a complet...",
    "Alt Text Image": "Official header image for Happy's Humble Burger Barn game - Steam 1851380",
    "Canonical URL": "https://gusku.site/game/happy-s-humble-burger-barn",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Happy's Humble Burger Barn\", \"description\": \"Looking for information on Happy's Humble Burger Barn? Check out the release date (Dec 28, 2021), developer insights from Scythe Dev Team, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Scythe Dev Team\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"tinyBuild\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1851380/header.jpg?t=1640724155\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}