{
    "AppID": 525610,
    "Name": "Hardware Engineering",
    "Release date": "Sep 28, 2016",
    "About the game": "Hardware Enginnering is a simplified digital circuit design game presenting an opportunity to dive into digital engineering with ease. The game goes from the basic logic components to those of a great complexity, so that the expertise of player who has gone through the whole game is comparable with first college levels, and yet the game requires no previous knowledge of electronic design or programming. Every new theoretical idea is first presented to you in a tutorial and subsequently practised in the near workspace. The outputs of your design efforts are tested through a list of tasks, so that there are practically infinitely-many ways to reach the next level, although some are more optimized than others. However, the more ingenuous designs begin to be an absolute necessity when you move further in the game. There are four game modes featured. Slow-paced Tutorial and Design modes allow you to design each component they further use from the basic logic. A set of 25 (+hidden) achievements then makes your progress visible to others. Sandbox mode gives you all components available in game with infinite workspace to create, test, debug and save whatever you want for further use or publication, and even when you run out of challenges there, there is the option of competing with other players ( currently in Alpha test phase ). All game's components, levels and tasks are stored in a readable format to be easy to edit or create. Scripting of new components, writing new levels and tutorials as well as tests is possible using respective editors included in the game. Please note that the game is in Alpha and ONLINE ONLY . The original though was that the game would be available on all kind of devices (in various versions), and not all of them (e. g. tablets or smartphones) could bear the complexity of simulation or some other aspects of gameplay (e. g. compilation). It was a design choice made early in the development process and is currently not revertable. We are, however, planning to rewrite the code for the release from the Alpha stage.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/525610/header.jpg?t=1488266498",
    "Price": 4.99,
    "Developers": "Pb Studios",
    "Publishers": "Pb Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/525610/ss_f50b27afa433ba571ca5d039f8f0890dc0d2ff67.1920x1080.jpg?t=1488266498,https://cdn.akamai.steamstatic.com/steam/apps/525610/ss_ab81b0f464dada66e207185f3cc246f2f7da9c27.1920x1080.jpg?t=1488266498,https://cdn.akamai.steamstatic.com/steam/apps/525610/ss_8b53a6b4ebb6076b8bd9ac4caf198a3752f18d69.1920x1080.jpg?t=1488266498,https://cdn.akamai.steamstatic.com/steam/apps/525610/ss_68cf5829c93c1c801fa3c6888d5049a9eff02244.1920x1080.jpg?t=1488266498,https://cdn.akamai.steamstatic.com/steam/apps/525610/ss_cf8640ac76f3134ba7738dad7576b820606d173e.1920x1080.jpg?t=1488266498,https://cdn.akamai.steamstatic.com/steam/apps/525610/ss_c6b60655f9828147ba0f748d26e9fb598ce4ac0c.1920x1080.jpg?t=1488266498",
    "Slug": "hardware-engineering",
    "Meta Title": "Hardware Engineering: Sep 28, 2016, Pb Studios and Full O...",
    "Meta Description": "Looking for information on Hardware Engineering? Check out the release date (Sep 28, 2016), developer insights from Pb Studios, and a complete game summ...",
    "Alt Text Image": "Official header image for Hardware Engineering game - Steam 525610",
    "Canonical URL": "https://gusku.site/game/hardware-engineering",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hardware Engineering\", \"description\": \"Looking for information on Hardware Engineering? Check out the release date (Sep 28, 2016), developer insights from Pb Studios, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 28, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pb Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pb Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/525610/header.jpg?t=1488266498\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}