{
    "AppID": 1637370,
    "Name": "Letters From a Rainy Day -Oceans and Lace-",
    "Release date": "Jun 29, 2021",
    "About the game": "Luscious artwork brings the beautiful streets of Kamakura in June to life in this bittersweet sapphic story of a romance that begins with blackmail... 'Letters From a Rainy Day -Oceans and Lace-' is a yuri adventure game based on the theme of love between girls at a girls' school in Kamakura, Japan. One blackmail letter leads two strangers to start dating, and their relationship slowly changes. The Steam version includes Simplified Chinese, Traditional Chinese, English, and Japanese versions, and supports multiple languages that can be switched in-game. 【STORY】 The prestigious private girls' school, Kikyou Academy, educates young ladies from elementary age to university. With cell phones forbidden on school grounds, letter writing is a pastime for many of the girls. One day, Shiori Minato is asked out by an older girl she doesn't know--Mikoto Kurahashi. Shiori: 'She's confessing to me... But why does she look so angry?' Still, she says yes, thinking of it as an opportunity to build something between them. One day, popular student Mikoto Kurahashi receives a blackmail letter, threatening to harm her sister, Yumi Kurahashi, unless she asks out a first-year student named Shiori Minato. At first, Mikoto thinks it's a prank--until Yumi gets hurt. So, she asks Shiori out in order to protect her sister. Mikoto: 'Was so she desperate to date me that she'd resort to blackmail?' Mikoto starts dating Shiori believing her to be the blackmailer. At the same time, Shiori struggles to get Mikoto to engage with her. It's June in Kamakura, and the hydrangeas are blooming. Two girls are brought together, their relationship manipulated by blackmail. And so begins their bittersweet story... 【SETTING】 Kikyou Academy A private girls' academy that educates students from elementary school through to university. The campus is situated atop a hill about fifteen minutes from Kamakura Station. The academy has strict rules its students must abide by, and cell phones are forbidden on school grounds. Consequently, letters are still used as a form of communication, and the girls use their shoe boxes in the entrance hall as letter boxes. Students who attend the school from elementary age through to university are expected to leave as perfect examples of well-educated young ladies. Kamakura An ancient city steeped in history, popular today as a tourist spot. Famed for its hydrangeas, June sees the city streets awash in blue and purple flowers. Close to the sea, the Enoshima Electric Railway line running from Kamakura to Fujisawa offers stunning views of the ocean. 【CHARACTERS】 【CREDITS】 Art: sheepD Planning &amp; Scenario Writing: Mikuriya Mikuri Backgrounds: Amakani, Chi-sa Music: etonenote Movie: NIRAI-KANAI STUDIO Design: cao. Production: Lily Spinel Sales: Hublots",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1637370/header.jpg?t=1625142775",
    "Price": 16.99,
    "Developers": "Lily Spinel",
    "Publishers": "HUBLOTS,mirai works",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1637370/ss_7a3a35362f0cbce3c2ffbc38e50995bc296eb37e.1920x1080.jpg?t=1625142775,https://cdn.akamai.steamstatic.com/steam/apps/1637370/ss_65b388bf0285c6e3636a473ff5830759f004b692.1920x1080.jpg?t=1625142775,https://cdn.akamai.steamstatic.com/steam/apps/1637370/ss_8fe05dbada54b18fb5916f3bb65df9d4042e26b5.1920x1080.jpg?t=1625142775,https://cdn.akamai.steamstatic.com/steam/apps/1637370/ss_f031c75352dccdf7b101c9a122d01472e7e15765.1920x1080.jpg?t=1625142775,https://cdn.akamai.steamstatic.com/steam/apps/1637370/ss_354e7686a0850acb0548c4b63cb1bee579b02763.1920x1080.jpg?t=1625142775",
    "Slug": "letters-from-a-rainy-day-oceans-and-lace",
    "Meta Title": "Letters From a Rainy Day -Oceans and Lace-: Jun 29, 2021,...",
    "Meta Description": "Looking for information on Letters From a Rainy Day -Oceans and Lace-? Check out the release date (Jun 29, 2021), developer insights from Lily Spinel, a...",
    "Alt Text Image": "Official header image for Letters From a Rainy Day -Oceans and Lace- game - Steam 1637370",
    "Canonical URL": "https://gusku.site/game/letters-from-a-rainy-day-oceans-and-lace",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Letters From a Rainy Day -Oceans and Lace-\", \"description\": \"Looking for information on Letters From a Rainy Day -Oceans and Lace-? Check out the release date (Jun 29, 2021), developer insights from Lily Spinel, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 29, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lily Spinel\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HUBLOTS,mirai works\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1637370/header.jpg?t=1625142775\", \"offers\": {\"@type\": \"Offer\", \"price\": 16.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}