{
    "AppID": 856570,
    "Name": "Lost Flame",
    "Release date": "Aug 2, 2019",
    "About the game": "Lost Flame is a modern roguelike game featuring unique and challenging turn-based combat. Explore the ruined kingdom of Hiraeth, fight against legendary warriors of the past and discover the reasons of the cataclysm. The game takes lots of inspiration from classical roguelikes and includes stuff such as turn-based, permadeath, lots of procedural content. There is a number of features which are something new in the genre, the most important one being a unique take on the turn based combat. Melee combat focuses a lot on positioning and movement, it's not the typical bump into enemy until it dies. Dodging attacks Most of the enemy attacks are slow and you can usually dodge them by simply walking away: It's simple at first area or two, but gets more difficult very quickly! Big and unique enemies Lost Flame features lots of multitile enemies Most of the enemies have some unique traits or abilities and you cannot just apply the same approach to everything you meet. Different weapons Depending on which weapon you carry, you have access to, usually, 3 or 4 different special attacks. For example with long sword you can slash 3 grid tiles in one turn: with short sword you can lunge - jump one grid and attack in one turn with halberd you can slash around everything in a huge semi-circle There are also other weapon types, such as spears, greatswords, all kind of axes and maces and a few more. Each with their own set of attacks. Some unique weapons have completely new, unique attack types. Each type of weapon requires a different strategy in combat, for example with short swords you are extremely mobile and can land quick hits on single targets, while dodging enemy strikes, with big weapons such as great axes or halberds, you usually want to position well and attack multiple enemies at once, because your attacks, while powerful, are slow. Customization of character builds Your character is completely defined by the items he carries. You can empower your weapons by selecting which rings you want to wear, their effects are unique and usually it's not obvious which ring will suit best for your current build, below are a few ring types you can find: Right now there 60 ring types possible to be found. Your character has 4 ring fingers. There are multiple magical item enchants (prefixes and suffixes), for example: Another layer of customization are scrolls of enchant items. They are quite plentiful and you can use them almost on any non-consumable item - you can enchant weapons, armor, but also rings, wands and other usable magical items. What you will want to enchant depends on you and there are no clear-cut correct answers here. SFX Lost Flame features cinematic music, rich sound effects and recorded voice overs for NPCs. Gameplay features While the game gets more difficult in the later areas, the earliest areas also require some thinking, you cannot just autopilot through them. Mistakes are costly - when in combat usually single move, or attack can determine the outcome Power curve is quite flat - while with proper equipment your character can dish out significant damage, he still remains quite fragile and getting too cocky results in a quick death There is a small id game - there are unidentified potions and scrolls you can find, however they get identified every time you gain a level. All attacks consume stamina and if you run out of it, you can no longer use weapon special attacks (you can still use the basic 'bump into enemy' attack) and you receive more damage There is rich lore behind the game world, however it's not 'in your face' - if you are interested you can connect the dots about game world from the flavor texts of items and monsters (this one is work in progress, I have the lore and the story all laid out, however there are still lots of flavor texts to be written)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/856570/header.jpg?t=1645995242",
    "Price": 13.99,
    "Developers": "Bartosz Bojarowski",
    "Publishers": "Bartosz Bojarowski",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/856570/ss_565b962d3e3312dc663819a45b9ed2aa4d1b2e51.1920x1080.jpg?t=1645995242,https://cdn.akamai.steamstatic.com/steam/apps/856570/ss_07ecb04d99ed8936b0f8f048076b9be144311ef9.1920x1080.jpg?t=1645995242,https://cdn.akamai.steamstatic.com/steam/apps/856570/ss_3da032fbcc37a67a70f5610c854b1450f741e278.1920x1080.jpg?t=1645995242,https://cdn.akamai.steamstatic.com/steam/apps/856570/ss_d77cb4efa4006ea1a890028a34c23d59c44fe65f.1920x1080.jpg?t=1645995242,https://cdn.akamai.steamstatic.com/steam/apps/856570/ss_ca0dacee1fb67925c894cfc831ae69b93badd1f8.1920x1080.jpg?t=1645995242,https://cdn.akamai.steamstatic.com/steam/apps/856570/ss_0aa40d6d8ae244bc8770c16a732c00f2a93349fe.1920x1080.jpg?t=1645995242,https://cdn.akamai.steamstatic.com/steam/apps/856570/ss_d8be93c5283daa156ac65721787a704480ff2049.1920x1080.jpg?t=1645995242,https://cdn.akamai.steamstatic.com/steam/apps/856570/ss_80b1805a9b6dd5171caa21ff381fbd9115cd30f9.1920x1080.jpg?t=1645995242,https://cdn.akamai.steamstatic.com/steam/apps/856570/ss_239b0e1cdd6ccd526647ab7f413f39d60a52b77d.1920x1080.jpg?t=1645995242",
    "Slug": "lost-flame",
    "Meta Title": "Lost Flame: Aug 2, 2019, Bartosz Bojarowski and Full Over...",
    "Meta Description": "Looking for information on Lost Flame? Check out the release date (Aug 2, 2019), developer insights from Bartosz Bojarowski, and a complete game summary.",
    "Alt Text Image": "Official header image for Lost Flame game - Steam 856570",
    "Canonical URL": "https://gusku.site/game/lost-flame",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lost Flame\", \"description\": \"Looking for information on Lost Flame? Check out the release date (Aug 2, 2019), developer insights from Bartosz Bojarowski, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 2, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bartosz Bojarowski\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bartosz Bojarowski\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/856570/header.jpg?t=1645995242\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}