{
    "AppID": 764050,
    "Name": "Maelstrom",
    "Release date": "Sep 20, 2019",
    "About the game": "Grim fantasy combined with thunderous naval combat in a vibrant, monster-saturated world! Captain an Orc, Dwarf or Human warship and sail the turbulent Abyssal Ocean with online multiplayer, in free-for-all &amp; team based matches. Be ruthless! Sink other players ships, take their loot and collect their bounty! Be greedy! Maps are littered with floating treasure chests and ships loaded with gold. Be cunning! As the match progresses hungry sea monsters become more aggressive and encroach the safe waters ships can sail in. Ships sailing in 'Dead Waters' for too long end up as monster chow! Be unsinkable! At the end of a match ships can be upgraded and customized with captains, cannons, armor, mates and more! BOMBASTIC BROADSIDES! Cannons are the heart of combat in Maelstrom. Cannonballs are physics controlled, with a significant firing arc and hang time, meaning prediction and good aim are necessary to deal damage effectively. On the receiving end, players with good reactions and anticipation coupled with a nimble ship can dodge incoming fire. WARSHIPS WIN WITH WITS Enemy ships can be rammed, grappled and boarded! Maneuver a ship through the swelling sea and prepare for ramming! The faster the ship is moving the more devastating the collision will be on impact. Boarding locks both ships in place while crews fight it out. If one crew manages to kill all of the opposing crew, it can spell disaster &amp; sink a ship quickly, sending it to the depths! ARMOR, AMMO AND POSITIONAL DAMAGE Each ship has armor on all four sides. The armor sections serve as additional defense toward damage to that side and must be destroyed before the ship's hull can be damaged. Maneuvering to keep your armor between you and your enemy is vital to staying afloat - and seeking the enemy's damaged sides will make you much more lethal in combat! Every cannon has access to three kinds of ammunition and can swap during combat to suit the situation. Ammo is unlimited. Iron shot blasts chunks out of ship armor and hull. Chain shot is used to shred enemy sails and cripple a ship’s speed. Grapeshot slaughters enemy crew and makes ships easier to board. LURKING THE DEEP Like the ocean they reside in, sea monsters are titanic forces of nature. They stalk unwary captains and can devour a ship whole. Like this Murkwater Thrasher. Each ship in Maelstrom is a character with a colorful history and unique weaponry as well as strengths and weaknesses such as speed, firepower, crew, and toughness. There are many unique ships available for players to unlock and explore. ASHBORNE, HUMAN FRIGATE Ashborne has incredibly punishing broadsides and wields spell-infused incendiary ammo, unique to her, which ignites enemy ships! FREE-TO-PLAY DEFINITION FOR MAELSTROM: As Free-to-Play definitions vary with games we want to define it clearly so players know what they can expect: All gameplay and progress can be unlocked by playing the game for free. No additional purchases are needed to enjoy the game to its fullest extent. There are no ways to purchase a competitive advantage in game. Players must play the game to progress &amp; become more powerful. There are no ways to purchase a top tier ship with a powerful crew, it must be earned by playing the game. Players can however, accelerate progression with boosts. Gold is in-game currency and earned by playing the game. Gunpowder is premium currency &amp; the only item sold for cash in-game. It is used to buy all of the premium items in the store such as the battle pass, cosmetics, boosters &amp; bundles. Gunpowder can also be earned for free via the Battle Pass, completing quests &amp; checking the store. Battle Passes unlock cosmetics, gold or gunpowder &amp; there is a premium track that unlocks additional rewards for gunpowder. Future content will be added through seasonal Battle Passes, events or content drops. There are no loot boxes. All Items are directly purchasable in the store.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/764050/header.jpg?t=1606855761",
    "Price": 0.0,
    "Developers": "Gunpowder Games, Inc.",
    "Publishers": "Double Jump Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/764050/ss_8b167200abf53651ebe58c2dc2f1b6e2ed3f8165.1920x1080.jpg?t=1606855761,https://cdn.akamai.steamstatic.com/steam/apps/764050/ss_4bc80a4919c80b0a806e68f8b8915259d1c5cad3.1920x1080.jpg?t=1606855761,https://cdn.akamai.steamstatic.com/steam/apps/764050/ss_181845fc1b55db961b3cd776dd3f2dfc87db1cc9.1920x1080.jpg?t=1606855761,https://cdn.akamai.steamstatic.com/steam/apps/764050/ss_20fc2880b5128764a70e29af1295ff3b42281899.1920x1080.jpg?t=1606855761,https://cdn.akamai.steamstatic.com/steam/apps/764050/ss_b116111831cfde17edd8366e06ad14db76e31662.1920x1080.jpg?t=1606855761,https://cdn.akamai.steamstatic.com/steam/apps/764050/ss_c1c21fafb09508dcbc6d6103d2f6c607d34e4e4a.1920x1080.jpg?t=1606855761,https://cdn.akamai.steamstatic.com/steam/apps/764050/ss_db3e8d079e96f3036fe4bc630940956e38db12e8.1920x1080.jpg?t=1606855761,https://cdn.akamai.steamstatic.com/steam/apps/764050/ss_1d358094f28431329c4b26227545f52d329a68d5.1920x1080.jpg?t=1606855761",
    "Slug": "maelstrom",
    "Meta Title": "Maelstrom: Sep 20, 2019, Gunpowder Games, Inc. and Full O...",
    "Meta Description": "Looking for information on Maelstrom? Check out the release date (Sep 20, 2019), developer insights from Gunpowder Games, Inc., and a complete game summ...",
    "Alt Text Image": "Official header image for Maelstrom game - Steam 764050",
    "Canonical URL": "https://gusku.site/game/maelstrom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Maelstrom\", \"description\": \"Looking for information on Maelstrom? Check out the release date (Sep 20, 2019), developer insights from Gunpowder Games, Inc., and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 20, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gunpowder Games, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Double Jump Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/764050/header.jpg?t=1606855761\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}