{
    "AppID": 234330,
    "Name": "MARVEL Puzzle Quest",
    "Release date": "Dec 5, 2013",
    "About the game": "Marvel Comics Super Heroes come to life in this Official Marvel role playing game with a unique Match 3 battle mechanic! S.H.I.E.L.D. mishandles a powerful new resource called Iso-8, allowing the Super Villain Norman Osborn to take control of the agency and replace it with H.A.M.M.E.R., unleashing his own power hungry agenda in The Dark Reign. Super Heroes and Villains must unite in this match 3 RPG game to defeat Norman Osborn's rise to power and restore balance to the Marvel Universe! Create your own epic dream team using the strongest Super Heroes and the nastiest Super Villains! Play characters like Spider-Man, Captain Marvel, Iron Man, and the Hulk as you battle your way to victory. Thor, Doctor Strange, Deadpool, and more await! Assemble your team and get ready for the fight! FEATURES ★ Join a community of 15 million players worldwide! ★ Collect and upgrade over 200 of your favorite MARVEL Super Heroes and Super Villains to perfect your strategy and find the winning combination to dominate your foes! ★ Battle to build up your powers, unlock new abilities, and find new Supports to craft the perfect team of Marvel Super Heroes and take down your enemies! ★ Form alliances with your friends and use your collective power to fight other players in events and epic battles. ★ Challenge your team of Super Heroes in exciting Player vs. Player Tournaments ★ Snag the top rank in Tournaments, Alliances, and Season Play for new character rewards and other prizes! ★ New events, features and tournaments direct from the Marvel Universe ★ Exclusively written by Marvel’s Frank Tieri (Iron Man, Wolverine, Weapon X) and Alex Irvine (Iron Man: The Rapture, Daredevil Noir) COLLECT &amp; UPGRADE HEROES TO GAIN REWARDS! Harness the power of Iso-8 to upgrade your Super Hero dream team and collect comics to unlock Marvel characters and new superpowers. THE ORIGINAL MATCH 3 SUPER HERO GAME! Match tiles to annihilate your opponents, harnessing Hulk’s superpower strength or Professor X’s mind control to manipulate the game board! Match 3 gems in a row to power up, damage and bring even the most powerful Marvel Comics characters to their knees. Will you be able to rank among the top champions? PLAY MARVEL’S TOP HEROES AND VILLAINS Recruit your favorite Super Hero characters from X-Men, Avengers, S.H.I.E.L.D., Guardians of the Galaxy and more to create the ultimate Marvel dream team! Whether you play Spider-Man alongside his arch-nemesis Venom, or play Captain Marvel alongside her Ms. Marvel successor, Kamala Khan, YOU assemble your very own epic team of Marvel Comics Super Heroes! With over 200 Marvel characters available, MARVEL Puzzle Quest’s ever-growing list of Super Hero comics and movie characters is updated regularly including Black Panther, Ant-Man, Daredevil, Hela, Thanos, and more! ■ Like us on Facebook: www.facebook.com/MarvelPuzzleQuest ■ Subscribe on YouTube: www.youtube.com/MarvelPuzzleQuestGame ■ Follow us on Twitter: www.twitter.com/MarvelPuzzle ■ Follow us on Instagram: www.instagram.com/MarvelPuzzleQuest INSTALL MPQ TO UNLEASH YOUR INNER SUPER HERO AND BECOME PART OF THE MARVEL UNIVERSE! App is available in English, French, Italian, German, Spanish, Japanese, and Korean.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/234330/header.jpg?t=1654368714",
    "Price": 0.0,
    "Developers": "Demiurge Studios",
    "Publishers": "D3 Go!",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/234330/ss_5f3416988531a0651daea6207400cebb299543ee.1920x1080.jpg?t=1654368714,https://cdn.akamai.steamstatic.com/steam/apps/234330/ss_00af818b630eb9aea907ac161a786d55bc882f9a.1920x1080.jpg?t=1654368714,https://cdn.akamai.steamstatic.com/steam/apps/234330/ss_9191d091d72eed18b259c7cf8f6ff62657e07ffa.1920x1080.jpg?t=1654368714,https://cdn.akamai.steamstatic.com/steam/apps/234330/ss_de21a6a2029917d5bc4b43fb596c2a8a80b72e7e.1920x1080.jpg?t=1654368714,https://cdn.akamai.steamstatic.com/steam/apps/234330/ss_71f3883c7d40634b01582fd2bebb8fbdd0989e01.1920x1080.jpg?t=1654368714,https://cdn.akamai.steamstatic.com/steam/apps/234330/ss_1a8d73e8f0bc64c7bfb423d2c7bb2898fa66db8e.1920x1080.jpg?t=1654368714,https://cdn.akamai.steamstatic.com/steam/apps/234330/ss_2e22f100bb6165bfca798ea922bd7ed421af63e4.1920x1080.jpg?t=1654368714,https://cdn.akamai.steamstatic.com/steam/apps/234330/ss_7450a75cf034554573134d5cb34d6484265a75e0.1920x1080.jpg?t=1654368714,https://cdn.akamai.steamstatic.com/steam/apps/234330/ss_b1f6c7bec1b05588be9f8b9e0062d93aad814c02.1920x1080.jpg?t=1654368714",
    "Slug": "marvel-puzzle-quest",
    "Meta Title": "MARVEL Puzzle Quest: Dec 5, 2013, Demiurge Studios and Fu...",
    "Meta Description": "Looking for information on MARVEL Puzzle Quest? Check out the release date (Dec 5, 2013), developer insights from Demiurge Studios, and a complete game ...",
    "Alt Text Image": "Official header image for MARVEL Puzzle Quest game - Steam 234330",
    "Canonical URL": "https://gusku.site/game/marvel-puzzle-quest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MARVEL Puzzle Quest\", \"description\": \"Looking for information on MARVEL Puzzle Quest? Check out the release date (Dec 5, 2013), developer insights from Demiurge Studios, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 5, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"Demiurge Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"D3 Go!\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/234330/header.jpg?t=1654368714\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}