{
    "AppID": 874040,
    "Name": "Ministry of Broadcast",
    "Release date": "Jan 30, 2020",
    "About the game": "A country divided by The Wall. To cross it and reach your family, you must compete on - and win - a reality TV show broadcast by the Regime. Ministry of Broadcast is a narrative-driven single player cinematic platformer mixing Orwell’s 1984 with modern reality TV. Rife with dark humor, sarcastic quips, and a general absurdity of the system. Seemingly built overnight, The Wall has divided both a country in two and a man from his family. To see them again, our ginger-haired protagonist has decided to become a contestant on “The Wall Show”, a Regime-organized TV show allowing competitors the opportunity to escape to freedom on the other side. However, as he progresses through the camp, our contestant soon realizes exactly how the Regime and the show operate. The promise of freedom is not exactly what it seems. Inspired by games such as Prince of Persia (1989) and Oddworld: Abe’s Exoddus , Ministry of Broadcast revives the spirit of classic cinematic platformers where players need nimble run-and-jump reflexes as well as a healthy aversion to falling from precarious heights. To reach freedom and family, you must lead the protagonist through each of the Arenas while under the ever-watchful mechanical eye of the Regime. The variety of hazardous, dilapidated environments hold an array of obstacles for you to manage—leg-shattering drops (scared of heights?), flaming barrels of garbage (extra-smelly, extra-flamey), inconveniently-placed spike pits (of course), hanging steel beams (so much rust)—but none of this is to speak of the fates of those you meet along the way. FEATURES Cinematic platformer: Run, jump, crash, and climb your way through each Arena as the narrative unfolds around you. Much of the story is unveiled via smoothly integrated animation sequences, within the environment, or from NPCs muttering bits of dialogue as you dive and dodge around them. Environmental HUD: Rather than having a screen cluttered with overlaid indicators, HP bars, and minimaps, any information the player will need is incorporated into the environment. Hints and clues are meshed into the game’s art, subtle and specific, players will need a keen eye if they want to survive each Arena without breaking their legs. Puzzle-solving: Use your wits, and at times a dash of ruthlessness, to advance through the Arenas. You’ll have to interact with the environment itself to solve most of the puzzles: use the protagonist’s momentum to move platforms, flip the occasional lever, and sometimes you might have to sacrifice an NPC or two to cross a particularly spiky pit. Story and Personality: Featuring lots of impish humor, Grade A sarcasm, and comic mischief, all balanced perfectly with the dark, heavy themes presented in this dystopian world. Animals: Besides traps, guards, cops and other enemies, try to outrun many animals of this world. Steve Irwin would be proud. Deaths: Survive more than 30 unique deaths. Secret locations: Discover all the secret locations and try to find your missing boots.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/874040/header.jpg?t=1588969300",
    "Price": 14.99,
    "Developers": "Ministry of Broadcast Studios",
    "Publishers": "Hitcents,PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/874040/ss_a373e0a8d5e7486654c4e36e5aa25ddcb0f6c9a6.1920x1080.jpg?t=1588969300,https://cdn.akamai.steamstatic.com/steam/apps/874040/ss_4719c09328894b37820fdc9497fdde244a47a879.1920x1080.jpg?t=1588969300,https://cdn.akamai.steamstatic.com/steam/apps/874040/ss_929bfa34f115edc7c09beea3ea50265cee9a0e99.1920x1080.jpg?t=1588969300,https://cdn.akamai.steamstatic.com/steam/apps/874040/ss_8a543e98a35ee520d4b40ce4e50774426367d043.1920x1080.jpg?t=1588969300,https://cdn.akamai.steamstatic.com/steam/apps/874040/ss_231ce07132d956a2071af357b546d7bf4286cbfa.1920x1080.jpg?t=1588969300,https://cdn.akamai.steamstatic.com/steam/apps/874040/ss_cc10ca9e882ef06a858006f4d49b3a185ab8622c.1920x1080.jpg?t=1588969300,https://cdn.akamai.steamstatic.com/steam/apps/874040/ss_25400b125473fd3cd30015bc0f6baa48f2e76f07.1920x1080.jpg?t=1588969300,https://cdn.akamai.steamstatic.com/steam/apps/874040/ss_0c09cd1a7773a6aeffe9496f9611499ed028087d.1920x1080.jpg?t=1588969300,https://cdn.akamai.steamstatic.com/steam/apps/874040/ss_f538e71f2cd953e31709c7022abdddea617b149f.1920x1080.jpg?t=1588969300",
    "Slug": "ministry-of-broadcast",
    "Meta Title": "Ministry of Broadcast: Jan 30, 2020, Ministry of Broadcas...",
    "Meta Description": "Looking for information on Ministry of Broadcast? Check out the release date (Jan 30, 2020), developer insights from Ministry of Broadcast Studios, and ...",
    "Alt Text Image": "Official header image for Ministry of Broadcast game - Steam 874040",
    "Canonical URL": "https://gusku.site/game/ministry-of-broadcast",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ministry of Broadcast\", \"description\": \"Looking for information on Ministry of Broadcast? Check out the release date (Jan 30, 2020), developer insights from Ministry of Broadcast Studios, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ministry of Broadcast Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hitcents,PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/874040/header.jpg?t=1588969300\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}