{
    "AppID": 906110,
    "Name": "Minotaur Arcade Volume 1",
    "Release date": "Dec 21, 2018",
    "About the game": "Minotaur Arcade Vol. 1 brings you two arcade-style games in a classic yet modern style. You can even play in VR to get that Tron-esque feeling of being inside an arcade game. Vol. 1 comprises two classic Llamasoft titles: Gridrunner, an exhilarating shooter; and Goatup, a fun platformer. Gridrunner is a classic Llamasoft title that was created in the days of the Vic 20 and which has evolved across many platforms over the intervening years. This implementation strips away complexity and is an attempt to imagine what an arcade game of Gridrunner might have looked like had it been implemented on arcade hardware of the time. (Well, we do allow ourselves some modern comforts, like being able to model every pixel of the display as voxels, and that whole thing of being able to play in VR). Simple beginnings: shoot the baddies on the grid with your little green ship. Celebrate Britain's newfound global chumpery by blowing up the Union Jack on level 2. The result is pure score-chasing fun. Shoot all the baddies, collect powerups to boost your own firepower to at times overwhelming superiority, blast through rack after rack dealing with increasingly tricky enemies and level geometries. Everything blows apart into scintillating smithereens the way Eugene Jarvis taught us it should. Strawberries stream down the sphere to be smashed into their very atoms. Collect powerups to augment your firepower to ridiculous levels. Play in three different modes - Pure, where you begin from level 1 and try to get the highest score you can; or Endurance, where you start at the beginning and never receive any extra lives throughout the game. Alternatively use the Restart Best feature in Casual mode to allow you to begin on any level you have previously reached with your best-ever lives and score at that point. Climb, explore and raise a family in Goatup. Goatup is a light-hearted platformer that'll have you baaing with joy. You are a little nanny goat whose mission in life is to climb up as high as you can and to raise as many kids as you can along the way. Kiss any billy goats you see, just like in real life. Kiss any billy goats you see, and keep eating grass (and any other items that may pop out of the ground on the way) and eventually you'll be rewarded with a kid. Keep having kids and they will follow you in a long queue. The more kids you have, and the higher you climb, the more points you will score. Eat grass and find objects to give birth. If you are careful you may be able to bop musk oxen for more points. Climb up through a variety of themed zones. Discover powerups that can augment your powers for a while as you climb. Can you make it to the top? What happens if you do? Discover new zones as you climb. Perhaps you will see some denizens you recognize. If you have VR, put on your headset and get closer to your growing family!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/906110/header.jpg?t=1545391203",
    "Price": 6.99,
    "Developers": "Llamasoft Ltd.",
    "Publishers": "Llamasoft Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/906110/ss_2b89b27cbcda54206d124c3586b9a68c3ed964e9.1920x1080.jpg?t=1545391203,https://cdn.akamai.steamstatic.com/steam/apps/906110/ss_8b77c10ac3a62d9afbf5e04d2464c4ddeda635dd.1920x1080.jpg?t=1545391203,https://cdn.akamai.steamstatic.com/steam/apps/906110/ss_6901c456692af1b596ca05558e6ed8dd17d5be3e.1920x1080.jpg?t=1545391203,https://cdn.akamai.steamstatic.com/steam/apps/906110/ss_852e7f99bf754d91abd3a58320264f466c405125.1920x1080.jpg?t=1545391203,https://cdn.akamai.steamstatic.com/steam/apps/906110/ss_46139f90fe7100409c52cef226c818a39ab015ee.1920x1080.jpg?t=1545391203,https://cdn.akamai.steamstatic.com/steam/apps/906110/ss_9bb59c11051e692faffee44e00dbaecf1b796704.1920x1080.jpg?t=1545391203,https://cdn.akamai.steamstatic.com/steam/apps/906110/ss_5db6954b97f6ce9112eff972dd88aafc618fc5c5.1920x1080.jpg?t=1545391203,https://cdn.akamai.steamstatic.com/steam/apps/906110/ss_7c17021bed401f158ff0893db1618500bdf58aff.1920x1080.jpg?t=1545391203,https://cdn.akamai.steamstatic.com/steam/apps/906110/ss_340e37e58bc8aed24b4769e298838fee72838bac.1920x1080.jpg?t=1545391203,https://cdn.akamai.steamstatic.com/steam/apps/906110/ss_00c467cefb7560daa73ed798b31fe87169db30ed.1920x1080.jpg?t=1545391203",
    "Slug": "minotaur-arcade-volume-1",
    "Meta Title": "Minotaur Arcade Volume 1: Dec 21, 2018, Llamasoft Ltd. an...",
    "Meta Description": "Looking for information on Minotaur Arcade Volume 1? Check out the release date (Dec 21, 2018), developer insights from Llamasoft Ltd., and a complete g...",
    "Alt Text Image": "Official header image for Minotaur Arcade Volume 1 game - Steam 906110",
    "Canonical URL": "https://gusku.site/game/minotaur-arcade-volume-1",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Minotaur Arcade Volume 1\", \"description\": \"Looking for information on Minotaur Arcade Volume 1? Check out the release date (Dec 21, 2018), developer insights from Llamasoft Ltd., and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Llamasoft Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Llamasoft Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/906110/header.jpg?t=1545391203\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}