{
    "AppID": 998330,
    "Name": "My Desktop Alive",
    "Release date": "Dec 26, 2018",
    "About the game": "We spend an incredibly large amount of time sitting in front of our computer. We perform all sort of tasks, but every time we move from one task to another, we come back to the same, immobile, dull desktop. That’s why sometimes it’s good to twist things a bit, and have a lively bunch hang out around your computer screen. It’s all about the good company. These friends will be there to cheer you up while working on that neverending excel file, will make you think twice before replying to your boss’ angry email, will drive positive thoughts to your mind on a cloudy day. Missing your cat at the office? Here’s a tiger that won’t split your coffee mug on your keyboard. Need a friend but you can’t stand hugs? Here’s a cute short-armed t-rex who’s unable to hug. Got the green thumb but you live in a basement? Here’s a tree, two trees, three trees! Keep focusing on the things you have to do while life goes on your desktop, you don’t have to worry about anything. Just… keep an eye on those robots, it’s not clear how they got there... Select all the elements you want to bring to life on your desktop. Once you are ready, click the 'START' button and let the magic happen. Now that your desktop is populated you can: - Drag and drop each element holding the left mouse button to move it around - Animate an element by double-clicking it - Open an element’s control panel by right-clicking on it The control panel allows you to rotate, resize, duplicate, remove or change the depth of a single element. Moreover, it’s possible to edit 4 features that will affect all the scenes: - PERSPECTIVE CAMERA : simply change the camera view from orthographic to perspective. - FREE ROAMING : activating this feature will apply physics to all elements, which will then be free to ambulate around your desktop, and bite your icons off if they feel like it. - NATURAL INSTINCT : when this option is on, nature starts taking its course and each animal becomes either hunter or prey. Studies are being conducted on robots to analyse the impact on their artificial intelligence. - FUNNY MODE : top secret",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/998330/header.jpg?t=1652018985",
    "Price": 2.99,
    "Developers": "Tunnel Vision Studio",
    "Publishers": "Tunnel Vision Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/998330/ss_d9215187fc8d74b74d3fbb6844ecf55c063b917d.1920x1080.jpg?t=1652018985,https://cdn.akamai.steamstatic.com/steam/apps/998330/ss_6286125430ffb8ef9a8c787ca0e7c6c35b720742.1920x1080.jpg?t=1652018985,https://cdn.akamai.steamstatic.com/steam/apps/998330/ss_185594c242754bea056cc42d22f118454c9245d8.1920x1080.jpg?t=1652018985,https://cdn.akamai.steamstatic.com/steam/apps/998330/ss_02d40c1d454c14728b2584d3dc7af135eba6955b.1920x1080.jpg?t=1652018985,https://cdn.akamai.steamstatic.com/steam/apps/998330/ss_fb35f5df5683fd193fe30b8dc1d1e6a102ee0984.1920x1080.jpg?t=1652018985",
    "Slug": "my-desktop-alive",
    "Meta Title": "My Desktop Alive: Dec 26, 2018, Tunnel Vision Studio and ...",
    "Meta Description": "Looking for information on My Desktop Alive? Check out the release date (Dec 26, 2018), developer insights from Tunnel Vision Studio, and a complete gam...",
    "Alt Text Image": "Official header image for My Desktop Alive game - Steam 998330",
    "Canonical URL": "https://gusku.site/game/my-desktop-alive",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"My Desktop Alive\", \"description\": \"Looking for information on My Desktop Alive? Check out the release date (Dec 26, 2018), developer insights from Tunnel Vision Studio, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 26, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tunnel Vision Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tunnel Vision Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/998330/header.jpg?t=1652018985\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}