{
    "AppID": 744630,
    "Name": "Mystery Stone from Heaven",
    "Release date": "Nov 17, 2017",
    "About the game": "Description： Mystery Stone from Heaven is created by Simple Studio and based on UE4 engine. We designed and recomposed a fantastic story based on the history of Shuidonggou that was a national 5A scenic spot. One day in 2008, an archaeologist discovered a fragment from a shinning stone. With curiosity and doubt, he traversed into dream which located on a huge maze made of Grand Canyon in 40,000 years ago (Quaternary Glaciation). Exploring with brave and wisdom, the secrets were uncovered slowly… After finishing the adventure of Paleolithic Period, the archaeologist went into the second dreamland which located on the Great Wall of Ming dynasty (500 Years Ago). The left side of the Great Wall was immense prairie belonged to Tartar of Mongolia and the other side was magnificent ancient city belonged to Ming dynasty. At the meantime, new thrilling challenges emerged… You would learn how to drill wood to make fire to survive, make stone implement, search the ancient roll, kill the wooly rhinoceros, collect the skeletons from an elegant princess and other clues to unravel the spectacle and secret of Shuidonggou. The VR Game was designed elaborately and good for educating. You would not only enjoy the fantastic VR Technology, but also witness the wisdom from our ancestor in Shuidonggou. (Attention: Preventing from getting hurt or harming on others, please do not play VR game with drastically intense and long workouts) Features： Subtitle：Chinese and English subtitle, Chinese dub. Massive Environment：Unique Yadan landform of Shuidonggou, magnificent Great Wall and thrilling Troop-hiding Cave. Various animals from prehistoric age：Saber-toothed Tiger, Mammoth, Wooly Rhinoceros, Deodicurus who had been extincted. Abundent Interaction: Drill wood to make fire, hunting Wolly Rhinoceros and collect properties into Bag System. Creative Inspiration：Shuidonggou is one of the earliest excavated Paleolithic Sites in China. It is honored as “the birthplace of prehistoric archaeology in China”, “The historical evidence on cultural exchange between China and western countries”. Shuidonggou is also listed as one of “the 100 archaeological discoveries on the most significance about Chinese Civilization ” by China. It is National 5A Tourist Scenic Spot, National Key Cultural Relics Protection Units, National Geological Park. What’s more, Shuidonggou is the most intact three-dimensional system of military defense about the Great Wall in China. Shuidonggou can be literally comprehended as “Water Cave Channel” in Chinese. Because of restless rivers, cave eroded by yellow river and channel formed by flowing stream.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/744630/header.jpg?t=1510911491",
    "Price": 6.99,
    "Developers": "Simple Culture and Creativity LLC",
    "Publishers": "Shuidonggou Travel Development co.LTD,Simple Culture and Creativity LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/744630/ss_408203c13874b779687d8636d658de52a98a1de4.1920x1080.jpg?t=1510911491,https://cdn.akamai.steamstatic.com/steam/apps/744630/ss_cb95b2ab00dad5ebc4274b3072e63be0956bacc8.1920x1080.jpg?t=1510911491,https://cdn.akamai.steamstatic.com/steam/apps/744630/ss_18602082ade6eb988a2d21df16a51cce04b8324f.1920x1080.jpg?t=1510911491,https://cdn.akamai.steamstatic.com/steam/apps/744630/ss_a11db384cba257a4aa3f11ccbc189efa64478588.1920x1080.jpg?t=1510911491,https://cdn.akamai.steamstatic.com/steam/apps/744630/ss_1004b11d8c39fdf3b18ac7330c031be4ed41e543.1920x1080.jpg?t=1510911491,https://cdn.akamai.steamstatic.com/steam/apps/744630/ss_1b45b755ea55fe8a00385941a2455f25eb3c1a3a.1920x1080.jpg?t=1510911491,https://cdn.akamai.steamstatic.com/steam/apps/744630/ss_b5d25eab0e534e641ab5cf8023daf9a082837f6e.1920x1080.jpg?t=1510911491",
    "Slug": "mystery-stone-from-heaven",
    "Meta Title": "Mystery Stone from Heaven: Nov 17, 2017, Simple Culture a...",
    "Meta Description": "Looking for information on Mystery Stone from Heaven? Check out the release date (Nov 17, 2017), developer insights from Simple Culture and Creativity L...",
    "Alt Text Image": "Official header image for Mystery Stone from Heaven game - Steam 744630",
    "Canonical URL": "https://gusku.site/game/mystery-stone-from-heaven",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mystery Stone from Heaven\", \"description\": \"Looking for information on Mystery Stone from Heaven? Check out the release date (Nov 17, 2017), developer insights from Simple Culture and Creativity L...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 17, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Simple Culture and Creativity LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shuidonggou Travel Development co.LTD,Simple Culture and Creativity LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/744630/header.jpg?t=1510911491\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}