{
    "AppID": 1433210,
    "Name": "Notebook Artillery",
    "Release date": "Nov 5, 2020",
    "About the game": "Once upon a time in the late 20th century AD, near the turn of the penultimate decade of the millennia, a magical confluence occurred in Middle School Macintosh computer labs across the globe: Artillery . Infamously known by teachers as the scourge of attention -- countless students spending entire computer lab periods firing cannons at each other instead of writing English assignments. The temptation too great, no child could refuse the siren's call of the game's accurate physics model and competitive nature. Notebook Artillery is a love letter to hours wasted playing video games in Middle School computer labs instead of working on class assignments. And sure, maybe if I would've spent more time paying attention in class and less time playing video games I wouldn't be making indie games as a means to pay off insane amounts of student debt. But hey, its 2020 and maybe this can be one last beacon of hope for myself and everyone who loves this kind of game. Players choose their 'firing angle' and 'powder amount' to fire cannonballs at opposing player's towers, or break floating targets in a solo player target practice mode. The randomly generated stage layouts will change strategy from round to round, and wind strength has an effect on a cannonball's trajectory which players must account for. Its simple arcade-simulation-action, fun for all ages, with completely hand drawn game art running at a gorgeous 4K. It's like you're looking directly into a Trapper Keeper and the imagination of every middle school kid. Whats not to love? Hand drawn game art in gorgeous 4k. Play Solo target practice, or challenge local friends and family in vs mode. 3 unique world styles fashioned after various wild west motifs. Stage layouts are randomly generated to make no two games the same. Fight the wind and dodge trees to destroy opponents strongholds. Completely visual buttons, no in-game writing. This was such a fun game to make, and it's so much fun to play with my kids, I hope you find it as fun as I do. And for fans of the original Macintosh classic, I hope this fulfills the desire to play this game again. Made with GameMaker Studio 2",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1433210/header.jpg?t=1623182740",
    "Price": 4.99,
    "Developers": "Austin Ivansmith Games",
    "Publishers": "Austin Ivansmith Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1433210/ss_69247a8d196f4a9e0169d55331338c436fe3403c.1920x1080.jpg?t=1623182740,https://cdn.akamai.steamstatic.com/steam/apps/1433210/ss_cb426816107ae6117585aae23d1ce1517ee9754b.1920x1080.jpg?t=1623182740,https://cdn.akamai.steamstatic.com/steam/apps/1433210/ss_780fe22c3baffd61d812d7067bc84ef1fe60327e.1920x1080.jpg?t=1623182740,https://cdn.akamai.steamstatic.com/steam/apps/1433210/ss_55581fac382a36abd586efd97da8a36f7a741af3.1920x1080.jpg?t=1623182740,https://cdn.akamai.steamstatic.com/steam/apps/1433210/ss_d555c790eebb3edbccc5404bcee82a1b1b7df41c.1920x1080.jpg?t=1623182740",
    "Slug": "notebook-artillery",
    "Meta Title": "Notebook Artillery: Nov 5, 2020, Austin Ivansmith Games a...",
    "Meta Description": "Looking for information on Notebook Artillery? Check out the release date (Nov 5, 2020), developer insights from Austin Ivansmith Games, and a complete ...",
    "Alt Text Image": "Official header image for Notebook Artillery game - Steam 1433210",
    "Canonical URL": "https://gusku.site/game/notebook-artillery",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Notebook Artillery\", \"description\": \"Looking for information on Notebook Artillery? Check out the release date (Nov 5, 2020), developer insights from Austin Ivansmith Games, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Austin Ivansmith Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Austin Ivansmith Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1433210/header.jpg?t=1623182740\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}