{
    "AppID": 1105240,
    "Name": "Pakicetus",
    "Release date": "Aug 7, 2020",
    "About the game": "Developed by students at University of Idaho. Development was affected by COVID-19. DESCRIPTION Three hundred years ago, the carelessness of old-world society led to catastrophic environmental ruin. Fearful for humanity’s survival, a small group of scientists calling themselves the Pakicetus retreated to the bottom of the ocean and established your home, Bastion. However, the halls of Bastion have become crowded and resources are running low, threatening the entire colony’s survival. You have been selected to locate a safe site and build a second home for the “The Pak”. Take command and captain a 60-man submersible, Salvation, as you explore the abyss while gathering resources along the Mid-Atlantic Ridge. Environmental events, mutant fish, and an unknown enemy are the only things separating your ship and crew from a new colony and saving your home. EXPLORE Explore realistic mid-ocean ridge segments while hunting for food for your crew and resources to fuel upgrades and research. Use the ship’s database of geologic knowledge to master gameplay and improve resource management. Take advantage of the opportunities provided by the deep; they are few and far between. COLLECT RESOURCES Find and gather the elements you need to maintain and upgrade your ship. Collect serpentinite and basalt rocks off the seafloor and filter the hot water plumes of hydrothermal vents. Keep an eye out for geologic events such as earthquakes that could point you toward richer resources waiting to be harvested. RESEARCH AND UPGRADE Decide what technologies to research and systems to upgrade – everything takes resources and the clock is ticking. Do you force your way through via sophisticated weapons systems, or avoid dangers by amplifying engines and expanding your fleet of resource gathering bots? What strategy will you employ? STORY Your crew was born here in the deep. Only myths of the old world exist. Learn about why humanity retreated to the ocean floor and how they use resources there through your crew and the ship’s database in this short campaign. SCIENCE Enjoy a window into marine geology of the deep-sea. In game geologic events, seafloor shape, and the resources you gather are all based on scientific data. What would you expect form a game funded by the United States National Science Foundation?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1105240/header.jpg?t=1596831324",
    "Price": 0.0,
    "Developers": "Polymorphic Games",
    "Publishers": "University of Idaho,Polymorphic Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1105240/ss_505ddd6ac8976f8a02c3985d5a3a4e1bd8560c68.1920x1080.jpg?t=1596831324,https://cdn.akamai.steamstatic.com/steam/apps/1105240/ss_155d1d7d2bad715828c56127f794d9072aebb410.1920x1080.jpg?t=1596831324,https://cdn.akamai.steamstatic.com/steam/apps/1105240/ss_9dc37c204d279057b4e09ac4cfe3ad8a436c407f.1920x1080.jpg?t=1596831324,https://cdn.akamai.steamstatic.com/steam/apps/1105240/ss_1c3f0bd3fdd333a1469bacf73575a008559d8865.1920x1080.jpg?t=1596831324,https://cdn.akamai.steamstatic.com/steam/apps/1105240/ss_1f60aa867c84cfc21ebf0f43ed47829730efeec4.1920x1080.jpg?t=1596831324",
    "Slug": "pakicetus",
    "Meta Title": "Pakicetus: Aug 7, 2020, Polymorphic Games and Full Overview",
    "Meta Description": "Looking for information on Pakicetus? Check out the release date (Aug 7, 2020), developer insights from Polymorphic Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Pakicetus game - Steam 1105240",
    "Canonical URL": "https://gusku.site/game/pakicetus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pakicetus\", \"description\": \"Looking for information on Pakicetus? Check out the release date (Aug 7, 2020), developer insights from Polymorphic Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 7, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Polymorphic Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"University of Idaho,Polymorphic Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1105240/header.jpg?t=1596831324\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}