{
    "AppID": 792000,
    "Name": "Pit Blocks 3D",
    "Release date": "Sep 27, 2018",
    "About the game": "Put your skills to the test in Pit Blocks 3D ! Keep your blocks from piling up by strategically placing them across 5 backgrounds complete with individual storylines. With special interactive stages and creatures, and classic tile-based gameplay, Pit Blocks 3D will keep you coming back for more. Choose from 3 different game modes: Basic, Advanced and Expert – each with different brick sizes. Enjoy beautiful environments with their own unique stories. Opt for specific pit sizes or select a random one. Jam to a large selection of soundtrack themes including Retro, Heavy Metal, and Piano! Earn more than 20,000 achievements. Each environment in Pit Blocks 3D features a limited storyline that sets the mood. Some environments even have enemies and/or bosses. Solar System: The Solar System is one of the easiest environments to play through. As part of a galactic exploration party, you begin the level by viewing the Solar System from afar – under the instructions of your Captain, Keen. The mood is set, and the adventure begins. Once hyper-spacing over to Neptune, you can start playing and place the incoming bricks. After battling through 5 levels of cube-matching frenzy, you travel to planet Earth. At this stage, there is a short intermission before you continue on to your journey to map the Solar System – reaching the Sun at level 9. Painted Forest: The main challenge is time. Upon entering this level, you're greeted by a Green Dragon and fish swimming in a pond. As a treasure hunter sent by Her Royal Highness, you're searching for the lost treasure of the Great Warrior Red Shield. Once reaching level 8, you learn of twin bears who are guarding the secret treasure. You must chase them away and reach level 9 to open the chest. Fantasy: Our mages brought us grave news! The Leviathan is about to wreak havoc upon the peaceful Fantasy Nation! You must destroy him before he rises. You must face two bosses: the henchman Troll and the Leviathan. Upon defeating the Leviathan, you can continue playing to infinity and beyond, standing over the defeated Leviathan. Ice Cave: The ice elemental minions will shoot ice missiles at you – and if they pass too close to the camera, it shakes. The ice missiles might also blow up or get up in your face, which will increase the difficulty level. You can always dodge these by moving the camera around. Volcano: This environment is the most difficult of all environments, mainly due to its Level 8 artillery barrage of fire against the player by the volcano’s fire minions. This is one environment where the player can fight back, however. The final level of the environment, level 10, is a face to face encounter with a fire dragon... a lava dragon... a magma dragon... a hot dragon! The player must beat this level in order to win the environment and earn their achievement.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/792000/header.jpg?t=1605584025",
    "Price": 19.99,
    "Developers": "SRM Games",
    "Publishers": "SRM Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/792000/ss_298250ab3b9a864cf1630fdfc5c012168d17d076.1920x1080.jpg?t=1605584025,https://cdn.akamai.steamstatic.com/steam/apps/792000/ss_68f63fc4ecd5a25d3ccf1bb5d3fe480ecbc19cd8.1920x1080.jpg?t=1605584025,https://cdn.akamai.steamstatic.com/steam/apps/792000/ss_51d8dd15e3d3e2f1020e4d50bd8971369cf92e28.1920x1080.jpg?t=1605584025,https://cdn.akamai.steamstatic.com/steam/apps/792000/ss_61ca83d68a6f8baccecfb6ed1127cb3f9e61c7ad.1920x1080.jpg?t=1605584025,https://cdn.akamai.steamstatic.com/steam/apps/792000/ss_0d4a5875d889a348a9781f0ce9439b21e8cf3d28.1920x1080.jpg?t=1605584025,https://cdn.akamai.steamstatic.com/steam/apps/792000/ss_3bc09d8262f2cda63cc7d7d70b44e363b5448e79.1920x1080.jpg?t=1605584025,https://cdn.akamai.steamstatic.com/steam/apps/792000/ss_29a78b65308ea753190666d627e2dec50dd10766.1920x1080.jpg?t=1605584025,https://cdn.akamai.steamstatic.com/steam/apps/792000/ss_3992fd2733706a18b8f7e83bd79eba6393762d35.1920x1080.jpg?t=1605584025,https://cdn.akamai.steamstatic.com/steam/apps/792000/ss_5769f56aae45b96d478ad63f68f218998d00e675.1920x1080.jpg?t=1605584025,https://cdn.akamai.steamstatic.com/steam/apps/792000/ss_9f46216841c657eaaff2d25fe7445e9e6d432bde.1920x1080.jpg?t=1605584025",
    "Slug": "pit-blocks-3d",
    "Meta Title": "Pit Blocks 3D: Sep 27, 2018, SRM Games and Full Overview",
    "Meta Description": "Looking for information on Pit Blocks 3D? Check out the release date (Sep 27, 2018), developer insights from SRM Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Pit Blocks 3D game - Steam 792000",
    "Canonical URL": "https://gusku.site/game/pit-blocks-3d",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pit Blocks 3D\", \"description\": \"Looking for information on Pit Blocks 3D? Check out the release date (Sep 27, 2018), developer insights from SRM Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"SRM Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SRM Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/792000/header.jpg?t=1605584025\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}