{
    "AppID": 682960,
    "Name": "Purgation",
    "Release date": "Oct 6, 2017",
    "About the game": "Purgation: A ceremonial cleansing from defilement or uncleanness by the performance of appropriate rites. SYNOPSIS You awake gradually. You are in a dark cell. You are drifting in and out of consciousness between bouts of violent hallucinations. You are physically weak and have no memory of who you are or why you are here. You are scared, very scared. The voices in your head tell you that you should be. And you have a feeling, a very bad feeling that you are not alone. THE GAME Purgation is a survival horror experience where your only hope of escape lies in discovering and confronting your past… if you can survive long enough. Escape your cell to wander around an abandoned mansion and learn more about yourself but you are not alone and you are too weak to fight. Your only options are running and hiding to survive. Dive into a fully immersive VR horror experience as you embark on a journey to discover the truth about yourself, about who are you and why you have woken up drugged and alone in a dark prison cell during a power outage. Are you brave enough to leave your cell and explore the basement environment of the abandoned mansion by torchlight to discover clues about your past and a means to escape. Investigate why you are hearing the voices and screams of familiar people during bouts of hallucinations. Discover who was it put you here and why. There are so many unanswered questions and there is the biggest question of all. Will you be able to face the truth and confront your past when you discover it. The hardest prison to escape is in your mind. FEATURES COMPELLING HORROR EXPERIENCE: Psychological thriller VR experience ! INTERACTION: Explore and interact with your environment to find clues about your past. INTUITIVE CONTROLS: Use the touch-pad of your controller and the direction you're facing to move around. Immersion and a sense of presence guaranteed. PLOT DRIVEN EXPERIENCE: Learn more and more about the world you have woken up in as you explore the basement and mansion in an attempt to escape. OPPRESSIVE ATMOSPHERE: Feel the tension and your stress levels rising as you wander around weak, drugged and helpless. Note: This horror game has been designed for Virtual Reality with jump scares. People suffering from a weak heart, or any other medical condition or a weak disposition should not play the game. You should remain aware of your surroundings while playing the game to avoid any injuries. Please note. This game was made by a group of students in 10 weeks with no previous game development experience. Please review accordingly.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/682960/header.jpg?t=1507461548",
    "Price": 0.0,
    "Developers": "Arttu Tuovinen,Paul Georgeon,Corentin Jezequel,Eddine Omar,Alexandre Petrault,Johan Rendy",
    "Publishers": "Michael Callaghan",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/682960/ss_9435992015fdac16d4ec668e2581c5b5fe4bb030.1920x1080.jpg?t=1507461548,https://cdn.akamai.steamstatic.com/steam/apps/682960/ss_36e136e5528208e4e5f46bb53770fa3ceeba842f.1920x1080.jpg?t=1507461548,https://cdn.akamai.steamstatic.com/steam/apps/682960/ss_13f34854b5e65d4331bceb0dbfff5a7b4c6f8815.1920x1080.jpg?t=1507461548,https://cdn.akamai.steamstatic.com/steam/apps/682960/ss_18003263dabfd849fdd30bef69067a298859ad2c.1920x1080.jpg?t=1507461548,https://cdn.akamai.steamstatic.com/steam/apps/682960/ss_ae9cb09dfae3b194be2dd4de9b7a59732bcf683d.1920x1080.jpg?t=1507461548,https://cdn.akamai.steamstatic.com/steam/apps/682960/ss_ebb82b65013a0c1e5b8ddd0b204c51e1ceda6031.1920x1080.jpg?t=1507461548,https://cdn.akamai.steamstatic.com/steam/apps/682960/ss_de3ddc41d386c3e7a49b5464bd23c74de933aa8b.1920x1080.jpg?t=1507461548",
    "Slug": "purgation",
    "Meta Title": "Purgation: Oct 6, 2017, Arttu Tuovinen,Paul Georgeon,Core...",
    "Meta Description": "Looking for information on Purgation? Check out the release date (Oct 6, 2017), developer insights from Arttu Tuovinen,Paul Georgeon,Corentin Jezequel,E...",
    "Alt Text Image": "Official header image for Purgation game - Steam 682960",
    "Canonical URL": "https://gusku.site/game/purgation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Purgation\", \"description\": \"Looking for information on Purgation? Check out the release date (Oct 6, 2017), developer insights from Arttu Tuovinen,Paul Georgeon,Corentin Jezequel,E...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 6, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Arttu Tuovinen,Paul Georgeon,Corentin Jezequel,Eddine Omar,Alexandre Petrault,Johan Rendy\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Michael Callaghan\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/682960/header.jpg?t=1507461548\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}