{
    "AppID": 1399760,
    "Name": "Randomlands",
    "Release date": "Sep 9, 2020",
    "About the game": "Randomlands is an action First-Person-Shooter game that features over 80,000 possible randomly generated guns and 6 mechanically different enemies to shoot at. The gameplay is a mix between Doom and Borderlands, with fast non-stop action and a constant switch between weapons. Intended gameplay time is 20-40 minutes, but you can play forever to get the highest score! This is the first ever computer game I've released, and was done when I was a 15 year old high-school kid. I hope you enjoy playing it as much as I enjoyed making it! The game starts with you learning the controls, then you are immediately confronted by your first adversaries. There aren't much handholding in the game, learn it as you play! As you keep going, the enemies get stronger, but they also drop better guns. Some guns are better than the others though, pick carefully. A good gun is the difference between life and death! If you don't like the gun you picked, you can always go back to the previous one. Just don't lose where you dropped it. Try to kill enough of them before they kill you! Whenever you level up, you receive full health, and increased maximum health. Time it to your advantage. Enemies are deadly to you, but they are also deadly to each other. Use this to your advantage, especially the relentless ZomGaz enemies are great at destroying others for you. Later RocketTanks can be used to shot at other enemies, or even at each other. You don't have to use your own gun all the time. Your overlords are hiding in the UFO above, and keeping you from escaping. However, the fight-zone will change as time goes on. Pay attention to the changing landscape, often you will need to use height to your advantage, and avoid corners to not be caught in a surprise explosion! The game does in fact have an ending, reach round 8 to trigger it. If you are successful in figuring out what to do, you should succeed by round 10! Hint: Do read the signs scattered around the map! The score system is actually very intricate. A lot of things give you score, and many more reduce it. To reach the highest score, defeat as much enemies as possible before killing the UFO, refrain from getting hit, and make enemies kill each other instead of spending ammo. However don't forget to have fun! More features are planned for the game, mostly better Steam integration. If there is enough buzz, I will also consider continuing development for more guns and enemies.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1399760/header.jpg?t=1600693358",
    "Price": 0.99,
    "Developers": "Atahan Öztürk",
    "Publishers": "Atahan Öztürk",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1399760/ss_0deba0c70b7f0950ea13e9fc0dfd98fe356466d7.1920x1080.jpg?t=1600693358,https://cdn.akamai.steamstatic.com/steam/apps/1399760/ss_e3956d100c075f30ecb265dc4a2bdcb757fa4ba6.1920x1080.jpg?t=1600693358,https://cdn.akamai.steamstatic.com/steam/apps/1399760/ss_eccb078e97bef369804af44d703c86deda003c89.1920x1080.jpg?t=1600693358,https://cdn.akamai.steamstatic.com/steam/apps/1399760/ss_ec685cbbf5a8880b267c6f5e8302c4cccd1a49fb.1920x1080.jpg?t=1600693358,https://cdn.akamai.steamstatic.com/steam/apps/1399760/ss_a33f1728c9a26fc9c88c777963f9057e618ebf51.1920x1080.jpg?t=1600693358,https://cdn.akamai.steamstatic.com/steam/apps/1399760/ss_ce2604485e1e9f6e0921ba4712b9d2bfafe0fbc9.1920x1080.jpg?t=1600693358,https://cdn.akamai.steamstatic.com/steam/apps/1399760/ss_b5799a4103caea76e2330cca9ff676e565203b30.1920x1080.jpg?t=1600693358,https://cdn.akamai.steamstatic.com/steam/apps/1399760/ss_c0a4cf155ee112a880d70a816ebe1122acd35f40.1920x1080.jpg?t=1600693358",
    "Slug": "randomlands",
    "Meta Title": "Randomlands: Sep 9, 2020, Atahan Öztürk and Full Overview",
    "Meta Description": "Looking for information on Randomlands? Check out the release date (Sep 9, 2020), developer insights from Atahan Öztürk, and a complete game summary.",
    "Alt Text Image": "Official header image for Randomlands game - Steam 1399760",
    "Canonical URL": "https://gusku.site/game/randomlands",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Randomlands\", \"description\": \"Looking for information on Randomlands? Check out the release date (Sep 9, 2020), developer insights from Atahan \\u00d6zt\\u00fcrk, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Atahan \\u00d6zt\\u00fcrk\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Atahan \\u00d6zt\\u00fcrk\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1399760/header.jpg?t=1600693358\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}