{
    "AppID": 983050,
    "Name": "Sticky Apps :: Monitor Ping",
    "Release date": "May 8, 2019",
    "About the game": "Sticky Apps :: Monitor Ping is an application to view your network connection to multiple systems on the Internet. This is a great way to monitor your PING/network to game servers, video streaming servers, or your ISP in general. This software is titled 'Sticky Apps' as each application can be stickied to your desktop, allowing for easy viewing of information. MONITOR YOUR PING Monitor your ping to various servers on the Internet Change the number of destinations you monitor Change colors scheme to fit your needs Provide alerts if latency/ping gets too high Provide alerts if packet-loss exists Sticky this anywhere on your desktop Export an image of your ping statistics What is the difference between this and command prompt ping? The built-in Windows command prompt ping is more of a real-time latency checker to a single host. This Monitor Ping application improves upon that in several ways: Ping multiple locations at once with a simple click (it saves locations) Has a graphical interface that you can scale in size to give an immediate, visual representation of latency Can alert you if packet-loss exceeds a certain threshold Can alert you if real-time latency exceeds a certain threshold Provides an ongoing log-file of packet-loss and excess latency Tracks packetloss in an ongoing fashion Has options to enable the tracking graph size (eg, 60 seconds of history vs 60 minutes) Is visually pleasing Can 1-click export the graph into an image (PNG) Won't this use up a lot of bandwidth? Not at all! Each monitor uses approx. 32 bytes of traffic per second in/out. To put that in perspective, you can poll a server 32,000 times before it uses even 1 MB in/out. By comparison, just watching a single second (1 second) of 1080p video on Youtube uses roughly 100,000 times more bandwidth than each monitor you have running. Why would I use this? This is a great way to decide 'Is it me?' by doing the following: Set up Monitor #1 to be your router (ie, 192.168.0.1 / 10.0.0.1 or such). Set up Monitor #2 to be your next-up hop of your ISP (do a tracert to determine this). Set up Monitor #3 to be something typically very reliable. I suggest 8.8.8.8 or google . com Set up Monitor #4 to be an online game server you typically play on. Now let's say you're getting drops from your favorite game server, or experiencing lag. Just by looking at the Monitor Ping app, you can now confirm some very important information. Is it between your PC and your router (such as bad wifi?). Well, just check Graph #1 and that will answer it. No packetloss + steady latency = not a wifi problem. Is it your connection between your home and your ISP such as a cable model issue? Well, cheeck Graph #2 and that will answer it. Is it your ISP backbone? Well, Graph #3 will help answer that. Is it the actual game server's network? Graph #4 will help that. This application is a great first step in determining network connectivity issues, as well as just having an overall monitor to see how things are operating. RECENT UPDATES New Alerts System! You can now receive alerts/notification of packetloss as well as high latency by the following methods: Windows task tray icon alert Audio alert Log-file entry of the alert Support For 25+ Languages! The application now supports all supported Steam languages!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/983050/header.jpg?t=1558884422",
    "Price": 3.99,
    "Developers": "Tim Sullivan,StartupTim, LLC",
    "Publishers": "Tim Sullivan,StartupTim, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/983050/ss_f2087aa3d65d14c9bf07a0ac3ad9864a9852317e.1920x1080.jpg?t=1558884422,https://cdn.akamai.steamstatic.com/steam/apps/983050/ss_fc788e20864caaeef6851ed063f070cc4bb73c30.1920x1080.jpg?t=1558884422,https://cdn.akamai.steamstatic.com/steam/apps/983050/ss_70f39def5d2a87c1e76a63be2c38b4f47b6e6c41.1920x1080.jpg?t=1558884422,https://cdn.akamai.steamstatic.com/steam/apps/983050/ss_ccb9dc39d7221c709c99007d1b1d8657c05dc0fa.1920x1080.jpg?t=1558884422,https://cdn.akamai.steamstatic.com/steam/apps/983050/ss_c79a529f8c29ebc7d50427da35de75680419feb2.1920x1080.jpg?t=1558884422,https://cdn.akamai.steamstatic.com/steam/apps/983050/ss_764355e4426b0fb7ad1253e5d8b2fa0a7a8d693b.1920x1080.jpg?t=1558884422,https://cdn.akamai.steamstatic.com/steam/apps/983050/ss_350898e1fa7cb6ee128b5db658bf8f203587e771.1920x1080.jpg?t=1558884422",
    "Slug": "sticky-apps-monitor-ping",
    "Meta Title": "Sticky Apps :: Monitor Ping: May 8, 2019, Tim Sullivan,St...",
    "Meta Description": "Looking for information on Sticky Apps :: Monitor Ping? Check out the release date (May 8, 2019), developer insights from Tim Sullivan,StartupTim, LLC, ...",
    "Alt Text Image": "Official header image for Sticky Apps :: Monitor Ping game - Steam 983050",
    "Canonical URL": "https://gusku.site/game/sticky-apps-monitor-ping",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sticky Apps :: Monitor Ping\", \"description\": \"Looking for information on Sticky Apps :: Monitor Ping? Check out the release date (May 8, 2019), developer insights from Tim Sullivan,StartupTim, LLC, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 8, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tim Sullivan,StartupTim, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tim Sullivan,StartupTim, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/983050/header.jpg?t=1558884422\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}