{
    "AppID": 340520,
    "Name": "Tallowmere",
    "Release date": "Mar 3, 2015",
    "About the game": "RAISE YOUR SHIELD Indulge Lady Tallowmere. See how far through her lovingly violent dungeons you can delve in this 2D indie action roguelike-inspired platformer. New rooms are procedurally generated every time you play, meaning you'll have to be on your guard for every randomly-placed enemy, elite, boss, and treasure chest you'll come across. Each room gets progressively bigger, harder, and more rewarding the further you go. The concept is simple yet hard to master: Raise your shield to block enemy attacks. Lower your shield and strike your foes when the timing is right. Jump or move to avoid traps, or use your shield to reduce damage taken. Find the key to advance to the next room. Collect weapons, outfits, headgear, and shields of various rarities to aid your journey. Turn in souls from slain enemies to increase your base stats and passive abilities. Stay alive as long as you can. Brace yourself as you learn the quirks of each foe, trap, and room type so you can strive for that 'one more run' high-score victory. Each dungeon is infinite in length so it's up to you to push your limits; local scoreboards and online leaderboards let you track your greatest efforts. Play with keyboard (and optionally mouse buttons), or use your favourite gamepad/controller. Tallowmere offers single-player and local co-op madness (up to 4 players sharing the same screen) for fun frantic couch gaming. KEY FEATURES Action roguelite platformer with randomly-generated levels, each room bigger than the last Wreak havoc with trusty axes, hefty clubs, teleporting katanas, stealth-enabling emerald daggers, freezing ice wands, bouncing grenades, embroiling flamethrowers, and powerful rocket launchers Find and equip outfits, headgear, shields, and more Hunt for power with 7 tiers of item rarities ranging from Basic to Otherworldly Learn to conquer multiple enemy types with elite variations, including fire mages, archers, leapers, conductors, ogres, flail knights, feelers, bloats, and zaeries Satisfying combat with persistent bloodsplats and gibs Tactical shield blocking Infinite jumping Deadly traps and obstacles to try and avoid, such as spinning pinwheels, acid clouds, and extremely pointy spikes Coins, hearts, souls, and keys to collect from slain foes Hardcore permadeath to keep your adrenaline going Treasure chests to loot Potions to keep you alive Room events and bosses to master Passive abilities for you to gain strength and then some Coin-loving merchants Difficulty settings to match your pain threshold Challenge modes Combat log Soft savegame system (so you can quit and resume later) and personal high-score system with cross-platform Steam Cloud support Global Steam leaderboards for speedruns and bragging rights Dev console for cheats Sacrificial kittens You're not afraid... or are you? To those who will be lured into Lady Tallowmere's dungeons: good luck. LANGUAGES &amp; TRANSLATORS English Finnish (Suomi) – Tomi Turkki &amp; Olli-Samuli Lehmus French (Français) – Christophe Braguy German (Deutsch) – Spiffosi, sePL, &amp; John Westfield Italian (Italiano) – Luca Pattarini Japanese (日本語) – Teyon Japan Korean (한국어) – The Balance Polish (Polski) – Maciej Ułanowicz Portuguese-Brazil (Português-Brasil) – Lucas Videla Russian (Русский) – Tycho Davidianus Simplified Chinese (简体中文) – Kai Shao Slovenian (Slovenski jezik) – Alen Korez Spanish (Español) – Jose M. Gaspar Turkish (Türkçe) – A. Ozkal BONUS Buy Tallowmere on Steam and get the Android port as a free DLC . Note: • 'Local Co-op' means you can connect up to 4 controllers and play with your friends in the same room sharing the same screen. Network/LAN co-op is not available.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/340520/header.jpg?t=1609665346",
    "Price": 3.99,
    "Developers": "Chris McFarland",
    "Publishers": "Chris McFarland",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/340520/ss_04f36c734f3a752a4b89fbb393e57f4f8bafc626.1920x1080.jpg?t=1609665346,https://cdn.akamai.steamstatic.com/steam/apps/340520/ss_91e07747675abe43493727904e5f61491632770b.1920x1080.jpg?t=1609665346,https://cdn.akamai.steamstatic.com/steam/apps/340520/ss_dad0c488dfdf2a523b295fa963bc66a4522186e3.1920x1080.jpg?t=1609665346,https://cdn.akamai.steamstatic.com/steam/apps/340520/ss_5bb7d0e8bfed4323caa59d6f0afc3091125de852.1920x1080.jpg?t=1609665346,https://cdn.akamai.steamstatic.com/steam/apps/340520/ss_b6a90d94bfe76a3f22bf8f6e1d212ec065797faf.1920x1080.jpg?t=1609665346,https://cdn.akamai.steamstatic.com/steam/apps/340520/ss_d794291757f844b2c611973d1056703a335ee2f2.1920x1080.jpg?t=1609665346,https://cdn.akamai.steamstatic.com/steam/apps/340520/ss_4f3384b6c03178d37b6c2f8bc0d4936067abca11.1920x1080.jpg?t=1609665346,https://cdn.akamai.steamstatic.com/steam/apps/340520/ss_9431695681939fdb30a4163378b5c2ec6b1c218a.1920x1080.jpg?t=1609665346,https://cdn.akamai.steamstatic.com/steam/apps/340520/ss_862614bae4bf2969829a35a0847f66b243ffc5f7.1920x1080.jpg?t=1609665346",
    "Slug": "tallowmere",
    "Meta Title": "Tallowmere: Mar 3, 2015, Chris McFarland and Full Overview",
    "Meta Description": "Looking for information on Tallowmere? Check out the release date (Mar 3, 2015), developer insights from Chris McFarland, and a complete game summary.",
    "Alt Text Image": "Official header image for Tallowmere game - Steam 340520",
    "Canonical URL": "https://gusku.site/game/tallowmere",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tallowmere\", \"description\": \"Looking for information on Tallowmere? Check out the release date (Mar 3, 2015), developer insights from Chris McFarland, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 3, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chris McFarland\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Chris McFarland\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/340520/header.jpg?t=1609665346\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}