{
    "AppID": 1190400,
    "Name": "The Wonderful 101: Remastered",
    "Release date": "May 19, 2020",
    "About the game": "A team of heroes from around the world must UNITE to protect the earth from vicious alien invaders! This band of 100 Wonderful Ones works together using their fantastic abilities to create a variety of forms. Whether it be a giant fist or a sharp blade, they’ll use their wits and power to overcome the enemy’s pitfalls and perils! And the final member of this team of courageous heroes—is you. From PlatinumGames, creators of the Bayonetta series, ASTRAL CHAIN, NieR:Automata, and Metal Gear Rising: Revengeance, comes The Wonderful 101: Remastered! This game will be PlatinumGames' first self-published title, and is a powered-up version of The Wonderful 101, originally released by Nintendo on September 15th, 2013 as a Wii U exclusive. The Wonderful 101: Remastered offers the unprecedented ability to control 100 heroes at once, with the flowing controls and dynamic action that are the PlatinumGames hallmark. It’s all brought together by a pulse pounding tale of heroic bravery and friendship standing tall against evil, and is PlatinumGames’ most ambitious offering to date. Hideki Kamiya, director of The Wonderful 101, has supervised this remaster and added numerous improvements to ensure that this game can be more easily and thoroughly enjoyed by all and on various platforms, and with improved visuals, framerate, and loading time for an enhanced experience on all fronts. Key Features Over 100 unique and dazzling, each with their own backstories and emblems! Change weapons in a flash with the “Unite Morph” system! Draw shapes to switch between swords, whips, hammers, and more to battle with strategy and flair! Unite Morphs can be more than just weapons! Build hang gliders and bridges to cross chasms, and bounce and blast your way to great heights! Use your smarts as well as your strength to solve puzzles and persevere! Don’t forget—a hero’s true calling is protection! Rescue the citizens you come across and your bravery will inspire them to UNITE UP! For a limited time, of course. Your missions will take around the world! Through cities, across the ocean floor, deep in the jungle, and to a host of exciting locations! Grab your controllers and try out 'Multiplayer Missions', a shared-screen co-op mode that can be enjoyed by up to four players at once! Whether you'll work together for the mission or compete for the highest score is up to you and your friends.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1190400/header.jpg?t=1647491885",
    "Price": 39.99,
    "Developers": "PlatinumGames Inc.",
    "Publishers": "PlatinumGames Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1190400/ss_945b937be17b21d8110dd1a6a421c1bbb4069448.1920x1080.jpg?t=1647491885,https://cdn.akamai.steamstatic.com/steam/apps/1190400/ss_4f8d0a1dcdb036a072ebb9109ad83c738637222a.1920x1080.jpg?t=1647491885,https://cdn.akamai.steamstatic.com/steam/apps/1190400/ss_83e175ad88f7a7d67969db6a6af7dd5161c2d891.1920x1080.jpg?t=1647491885,https://cdn.akamai.steamstatic.com/steam/apps/1190400/ss_abdfc3e403b8f648ddf23ac59ef4e43ffd75adee.1920x1080.jpg?t=1647491885,https://cdn.akamai.steamstatic.com/steam/apps/1190400/ss_5dfa38d3f06c6aaaa524f3d56d9b033088f9bb63.1920x1080.jpg?t=1647491885",
    "Slug": "the-wonderful-101-remastered",
    "Meta Title": "The Wonderful 101: Remastered: May 19, 2020, PlatinumGame...",
    "Meta Description": "Looking for information on The Wonderful 101: Remastered? Check out the release date (May 19, 2020), developer insights from PlatinumGames Inc., and a c...",
    "Alt Text Image": "Official header image for The Wonderful 101: Remastered game - Steam 1190400",
    "Canonical URL": "https://gusku.site/game/the-wonderful-101-remastered",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Wonderful 101: Remastered\", \"description\": \"Looking for information on The Wonderful 101: Remastered? Check out the release date (May 19, 2020), developer insights from PlatinumGames Inc., and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 19, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"PlatinumGames Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PlatinumGames Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1190400/header.jpg?t=1647491885\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}