{
    "AppID": 1933740,
    "Name": "The Caligula Effect 2",
    "Release date": "Jun 22, 2022",
    "About the game": "●STORY Redo - a world without regrets. Regret - a mysterious virtuadoll. Those who hear her songs find themselves transported into another world. The world of Redo is a virtual world built from the regrets of many people. 'If only I'd done things differently...' This is a world where everyone's secret desire to redo their lives can come true. A place where they can become the person they would have been had they chosen differently... Redo - a dull world with no regrets, where anyone can experience a life redone. Another Songstress and the Go-Home Club Another virtuadoll exists - χ. She seeks to destroy the false world of Redo. She gives strength to the protagonist - who is slowly awakening to reality - as her chosen partner. They form the Go-Home Club, gathering other members who have also found out about the world outside Redo. Thus begins their arduous task of making it home against the will of the creator of the world. Go-Home Club's True Selves In Redo, members of the club are in their 'redone' forms, which they have obtained by ignoring reality and undoing past regrets. Their true selves are secret forms only the player can deal with. Tread carefully and choose actions that will leave no regrets... 　 ●CHARACTER STORIES In the world of Redo, Go-Home Club members are in their 'redone' forms - manifestations of past regrets that have been undone. Each member is trapped in a situation dreadful enough to cause them to turn away from reality. What happened to them? And why are they trying so hard to return to that painful reality? These are only some of the mysteries the player must unravel. There is a chance you may find the members' true selves unacceptable. So tread carefully and choose actions that will leave no regrets... 　 ●BATTLES Imaginary Chain Chain combos in the battle system while predicting the future! The battled system is turn-based. Once an action is selected, you can peer into the future and see what it looks like successfully executed. Use this ability wisely to coordinate attacks with allies or cover them during bad situations. χ-Jack When certain conditions are met in battle, a χ-Jack is activated, in which χ's singing voice hijacks the battlefield and powers up the Go-Home Club. The effects differ according to the song chosen. This move is powerful enough to completely turn the tide of battle. Develop χ's abilities to improve the effects of a χ-Jack.​ 　 ●OTHER FEATURES WIRE Use WIRE's group chat function to discuss club goals or ask allies questions on private chat. You may be surprised by what you can learn from their replies.​ Some special questions can only be obtained with high affinity or via quests. CAUSALITY LINK Even residents of the ideal world Redo have minor gripes and problems to contend with.​ Perhaps these stem from their true selves or personal relationships in reality...? Complete quests from townsfolk to gather more information and uncover hidden truths.​",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1933740/header.jpg?t=1656310886",
    "Price": 49.99,
    "Developers": "historia Inc.,FURYU Corporation",
    "Publishers": "historia Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1933740/ss_8ba7a67edd935dbfc3360f4a3788d2de300b909e.1920x1080.jpg?t=1656310886,https://cdn.akamai.steamstatic.com/steam/apps/1933740/ss_74468289126963d1cdb254d87b09324d824d8648.1920x1080.jpg?t=1656310886,https://cdn.akamai.steamstatic.com/steam/apps/1933740/ss_e3d0a7f9e493d5fd1ad09c72a654adc099486f35.1920x1080.jpg?t=1656310886,https://cdn.akamai.steamstatic.com/steam/apps/1933740/ss_45872bc0febe75354f2382ec37bf4eae91f7d812.1920x1080.jpg?t=1656310886,https://cdn.akamai.steamstatic.com/steam/apps/1933740/ss_1dbdad3aaa9d5c8bf56849b9698762287d9d3c76.1920x1080.jpg?t=1656310886,https://cdn.akamai.steamstatic.com/steam/apps/1933740/ss_2b4497a25dede1d452c584747620e55213bfcc9f.1920x1080.jpg?t=1656310886",
    "Slug": "the-caligula-effect-2",
    "Meta Title": "The Caligula Effect 2: Jun 22, 2022, historia Inc.,FURYU ...",
    "Meta Description": "Looking for information on The Caligula Effect 2? Check out the release date (Jun 22, 2022), developer insights from historia Inc.,FURYU Corporation, an...",
    "Alt Text Image": "Official header image for The Caligula Effect 2 game - Steam 1933740",
    "Canonical URL": "https://gusku.site/game/the-caligula-effect-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Caligula Effect 2\", \"description\": \"Looking for information on The Caligula Effect 2? Check out the release date (Jun 22, 2022), developer insights from historia Inc.,FURYU Corporation, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"historia Inc.,FURYU Corporation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"historia Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1933740/header.jpg?t=1656310886\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}