{
    "AppID": 1264970,
    "Name": "The Conquest of Go",
    "Release date": "Dec 7, 2020",
    "About the game": "The rules of Go are fairly simple and are covered in full within interactive in-game tutorials. In short, two players take turns placing stones on the board with the goal to control more territory than the opponent. The strategy to accomplish this goal runs deep, which is what has kept people playing Go for thousands of years. In The Conquest of Go , the player will compete against nations for control of land and resources through a campaign mode with Go gameplay. Players will improve their skills by playing matches, reviewing matches, and solving Go problems. Several educational and AI assisted features are available to help new and experienced players. Once the player has grasped the basics, they can also challenge opponents online from around the world. Battle against computer controlled nations for ownership of land across the map Fortify and protect land by solving Go puzzles Play matches in several different terrains and board sizes depending on the size and environment of the land being conquered Cities are populated within conquered land which supply resources to the army Resources can be spent on different abilities to assist your army during battles Defend against enemy invasions by completing matches from a preset board positions Collect legendary match records of notable professional Go players throughout the history of Go Review matches with the AI to discover mistakes and optimal moves and improve the morale of your army Several options are available to setup each campaign to the player's preferences and difficulty Join the Online Go Server (OGS) community of over 200,000 ranked players Challenge players to live matches to play directly, or correspondence matches which can be played over longer periods of time, allowing players to connect and play moves when available Participate in ranking ladders Play casual and ranked matches View and spectate active matches being played Communicate with players and spectators through in-game chat NOTE: Regional firewalls may interfere with the connection to online servers Automatic adjustment of AI skill and handicap to match the player's skill level during the campaign At max AI level, the AI is able to compete with professional Go players AI analysis can be toggled on in order to see optimal moves and variations recommended by the AI Ability to display of estimated win rate and score percentages as well as territory during matches or match review Learn the rules, basic shapes, and strategy of Go through interactive tutorials Explore recommended opening moves for various board sizes and handicaps through opening guides Learn Go terminology from the glossary system Learn and recognize Go shapes as they are played with the automatic shape detection system Learn additional concepts and strategies from other players through the Steam Workshop Play against a local opponent on the same computer, play against the AI, or pit AIs against each other for local match play Various settings for board size (5x5 - 19x19), handicap, komi, and time are available Use the practice board to freely setup and play stones",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1264970/header.jpg?t=1655918894",
    "Price": 14.99,
    "Developers": "Wolfey Studios, LLC",
    "Publishers": "Wolfey Studios, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1264970/ss_b5f2cbf2efc9b79cee53fd336c8c563f524338cd.1920x1080.jpg?t=1655918894,https://cdn.akamai.steamstatic.com/steam/apps/1264970/ss_1b03e5979fe56b99d9cd0b425d67f4472a6861bf.1920x1080.jpg?t=1655918894,https://cdn.akamai.steamstatic.com/steam/apps/1264970/ss_1b86f6ef86b3f8a49cd0025287efb6df68031afe.1920x1080.jpg?t=1655918894,https://cdn.akamai.steamstatic.com/steam/apps/1264970/ss_71e5d55d38c621638d8df0399150a2a6aeac485e.1920x1080.jpg?t=1655918894,https://cdn.akamai.steamstatic.com/steam/apps/1264970/ss_4b1c880225f07d631e0acc659d3755105878ca85.1920x1080.jpg?t=1655918894,https://cdn.akamai.steamstatic.com/steam/apps/1264970/ss_a1e1ff1b97ed4f9e74bf65127e79133939b09372.1920x1080.jpg?t=1655918894,https://cdn.akamai.steamstatic.com/steam/apps/1264970/ss_37b759646af61d8bf8e0186913fe15d3a9cc79a0.1920x1080.jpg?t=1655918894,https://cdn.akamai.steamstatic.com/steam/apps/1264970/ss_d6fa88ced8ef659ae3ea0ca0cdb972643d22d34b.1920x1080.jpg?t=1655918894,https://cdn.akamai.steamstatic.com/steam/apps/1264970/ss_c0ceacc7b144bb1b80e8c7b77e67dd2777bbbdd8.1920x1080.jpg?t=1655918894,https://cdn.akamai.steamstatic.com/steam/apps/1264970/ss_d5bf6e68bcd683890fe10759fa79592ce9e66558.1920x1080.jpg?t=1655918894",
    "Slug": "the-conquest-of-go",
    "Meta Title": "The Conquest of Go: Dec 7, 2020, Wolfey Studios, LLC and ...",
    "Meta Description": "Looking for information on The Conquest of Go? Check out the release date (Dec 7, 2020), developer insights from Wolfey Studios, LLC, and a complete gam...",
    "Alt Text Image": "Official header image for The Conquest of Go game - Steam 1264970",
    "Canonical URL": "https://gusku.site/game/the-conquest-of-go",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Conquest of Go\", \"description\": \"Looking for information on The Conquest of Go? Check out the release date (Dec 7, 2020), developer insights from Wolfey Studios, LLC, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 7, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wolfey Studios, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wolfey Studios, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1264970/header.jpg?t=1655918894\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}