{
    "AppID": 1827180,
    "Name": "Toram Online",
    "Release date": "Dec 19, 2021",
    "About the game": "Toram Online, the popular smartphone game, is now available on Steam! Enjoy Toram Online on your big computer screen without having to worry about your data usage or battery! Unrestricted character creations! With more than 500 billion combinations available, feel free to create your own character to your liking! Sword? Magic? Anything you like! 'Profession', which is often the case with MMORPG, does not exist in Toram. Sword? (Magic) Staff? Bow? Halberd? Feel free to decide your own fighting style! Build &amp; Train your character to your heart's content! Equipped with a 'Skill Tree' system enabling players to enhance and strengthen their characters as they wish. Create combos and discover your own battle style! Changeable weapons and equipment color! You can color your favorite weapon with the color you like when you obtain equipment with a 'Color Info'! Moreover, you can freely create the abilities of your equipment as you proceed further with the game...! Go on an adventure with your friends across the country! RPG (MMORPG) that can be played and connects you with your friends online across the country! The powerful monster that you fail to beat on your own could possibly be knocked down by forming a party with your friends! Let's explore the vast and beautiful 3D world with many friends! Party play even by yourself! You can even enjoy party play when you are playing alone by borrowing and battling together with other player's character known as 'mercenary' or by summoning a 'partner' from your own sub-characters! 【Story Setting】 Decades ago, the world was hit by a devastating catastrophe, crumbling the ground into pieces. The gods quickly gathered the pieces scattered in all directions and hurriedly put them together. The result, a bizarre looking world resembling a mosaic. The nation that was originally there had ceased to exist. As a result of repeated clashes of principles and interests among the 4 tribes, the people split into 4 factions. At such times, an adventurer (you) came to this peculiar world. The adventurer (you) goes through a series of adventures while meeting various people belonging to the 4 factions in the world to confront the secretly proliferating mysteries behind it...... Service performance and availability are not guaranteed when Devices do not meet the recommended system requirements Virtual machines or emulators are being used VPN(Virtual Private Network) is being used",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1827180/header.jpg?t=1649938921",
    "Price": 0.0,
    "Developers": "Asobimo, Inc.",
    "Publishers": "Asobimo, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1827180/ss_e141ba137c77b76bc01226c23949eabf89cfd1e4.1920x1080.jpg?t=1649938921,https://cdn.akamai.steamstatic.com/steam/apps/1827180/ss_56650948fa3873b521b5a61971e6905c4c9d0fdf.1920x1080.jpg?t=1649938921,https://cdn.akamai.steamstatic.com/steam/apps/1827180/ss_6ec1915c29eb3114b2f9f17efcc606f020b86bee.1920x1080.jpg?t=1649938921,https://cdn.akamai.steamstatic.com/steam/apps/1827180/ss_4e052d4e9e124fd1f12f33f974021e51033a6ec8.1920x1080.jpg?t=1649938921,https://cdn.akamai.steamstatic.com/steam/apps/1827180/ss_e50b8e2f70dad44545cd96e2d7be5ad3a12b977b.1920x1080.jpg?t=1649938921,https://cdn.akamai.steamstatic.com/steam/apps/1827180/ss_8f819ffcb468f53fdae0be72b29864658a80c2a1.1920x1080.jpg?t=1649938921",
    "Slug": "toram-online",
    "Meta Title": "Toram Online: Dec 19, 2021, Asobimo, Inc. and Full Overview",
    "Meta Description": "Looking for information on Toram Online? Check out the release date (Dec 19, 2021), developer insights from Asobimo, Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for Toram Online game - Steam 1827180",
    "Canonical URL": "https://gusku.site/game/toram-online",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Toram Online\", \"description\": \"Looking for information on Toram Online? Check out the release date (Dec 19, 2021), developer insights from Asobimo, Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Asobimo, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Asobimo, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1827180/header.jpg?t=1649938921\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}