{
    "AppID": 629690,
    "Name": "Vaporum",
    "Release date": "Sep 28, 2017",
    "About the game": "Vaporum is a grid-based, single-player &amp; single-character dungeon crawler RPG seen from the first person perspective in an original steampunk setting. Inspired by old-school games like Dungeon Master I and II, the Eye of the Beholder series, and the most recent Legend of Grimrock I and II. Stranded in the middle of an ocean, in front of a gigantic tower, the hero has to find out what the place is, what happened there, and most importantly, who he is. First person real-time combat Puzzles and level-wide objectives Gadget-based RPG system Lots of exploration, loot, and character customization Mysterious storyline filled with secrets Fully voiced main characters Immersive steampunk setting Combat takes place in real time. Each enemy has a distinctive set of strengths and weaknesses so you have to employ different tactics to beat each one. Weapon types have each a set of unique bonuses and behaviors which adds more depth and thought when choosing what weapons to equip. You will find many types of gadgets: direct attacks, area attacks, offensive &amp; defensive buffs... These gadgets are powerful, but some enemies are immune to certain types of attacks, so you will have to figure out the best way to deal with every encounter the game throws at you. Solve intriguing puzzles and level-wide objectives where you have to use both your wits and reflexes. While most puzzles and riddles are contained in a single room, progression objectives can span an entire level or even multiple levels. Instead of increasing the abilities of your human character, you will improve an exoskeleton rig you wear. The game combines a 'you are what you wear' aspect with a long-term development of your exo-rig. The gadget-based system allows you change your loadout of gadgets at any time, giving you a great deal of flexibility to deal with various situations. On the other hand, as you progress, you get to unlock useful circuits on your exo-rig, gaining significant permanent attribute bonuses and passive skills. Stranded on a small islet in the middle of an ocean, you enter a gigantic mechanical tower. Nothing makes sense to you, but it is all strangely familiar... If you want to get into the backstory and uncover the mysteries of the tower, you can delve right into it by reading all the notes you can find. Don't worry, though, you can safely ignore all the text. All major story points are narrated by the main characters and they are fully voiced! There are many optional areas in the game that you can choose to explore. They usually present some form of additional challenge, but come with a reward too! The tower is riddled with secret passages that contain unique items and notes of its inhabitants, giving you an insight into their lives and events that precede your arrival.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/629690/header.jpg?t=1568630621",
    "Price": 19.99,
    "Developers": "Fatbot Games, s. r. o.",
    "Publishers": "Fatbot Games, s. r. o.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/629690/ss_66f1fc70c63876054c68b037aebd1c94a1d032e3.1920x1080.jpg?t=1568630621,https://cdn.akamai.steamstatic.com/steam/apps/629690/ss_852756f7c76368ed0434f61c1fe385e52184a37c.1920x1080.jpg?t=1568630621,https://cdn.akamai.steamstatic.com/steam/apps/629690/ss_0e73437ef0972df24098a66fe44b80c8ddb24267.1920x1080.jpg?t=1568630621,https://cdn.akamai.steamstatic.com/steam/apps/629690/ss_6ec0bbb93cb9d2e3c0f57c5b0ebf0ced136dd616.1920x1080.jpg?t=1568630621,https://cdn.akamai.steamstatic.com/steam/apps/629690/ss_f81d2f4c4583e1be00b4dacab5805114b31b2078.1920x1080.jpg?t=1568630621",
    "Slug": "vaporum",
    "Meta Title": "Vaporum: Sep 28, 2017, Fatbot Games, s. r. o. and Full Ov...",
    "Meta Description": "Looking for information on Vaporum? Check out the release date (Sep 28, 2017), developer insights from Fatbot Games, s. r. o., and a complete game summary.",
    "Alt Text Image": "Official header image for Vaporum game - Steam 629690",
    "Canonical URL": "https://gusku.site/game/vaporum",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Vaporum\", \"description\": \"Looking for information on Vaporum? Check out the release date (Sep 28, 2017), developer insights from Fatbot Games, s. r. o., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 28, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fatbot Games, s. r. o.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fatbot Games, s. r. o.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/629690/header.jpg?t=1568630621\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}