{
    "AppID": 806950,
    "Name": "Victory At Sea Pacific",
    "Release date": "Sep 14, 2018",
    "About the game": "Search and Destroy Enemy Fleets across the Second World War’s Pacific Theatre. Engage in a tactical game of cat and mouse in this huge open world naval warfare Real Time Strategy. Plan your own campaign in Victory at Sea Pacific. Victory at Sea Pacific - the game of naval combat during the Second World War where a player can switch between commanding the entire Pacific theatre to zooming down to take control of individual ships and flights of planes. Fire the torpedoes from your submarine wolf pack or step onto the Bridge to direct your fleets and change the course of the war. Bringing an epic approach to real time strategy war gaming , players develop their own story with an open world sandbox mechanic  in a desperate attempt to win the World War 2. The game sees you to take part in a nerve wracking game of cat and mouse as you scour the seas in search of enemy fleets and send submarines to strangle their supply lines. In Victory at Sea Pacific you can covertly recon enemy positions and launch a large scale amphibious assault by sea and air against the chosen targets. Fighting a coastal invasion brings together large numbers of ships from landing craft of various types, to multiple flights of aircraft and mighty ships to bombard the enemy positions in an attempt to capture key objectives from the enemy In addition Victory at Sea Pacific allows you to take command of large squadrons of planes against enemy fleets and send scouts to hunt for the enemy wherever they may be. You can also train your crews in and out of combat, setting drills and rest periods as well as managing rations and monitoring their morale. Do you push them to breaking point or build a highly skilled team ready for combat. Choose your fate in Victory at Sea Pacific In Victory At Sea Pacific your destiny is in your hands, there are no levels, there is no do over. This is Pacific Warfare from day one until ultimate victory is achieved. Every engagement is important, the combat merciless, and the outcome is uncertain. Upgrade ports and build shipyards to customise and create multiple fleets, sending them to different parts of the Pacific theatre to perform whatever tasks you see fit. Will you send submarines to harass enemy supply ships or send flights of planes to hunt for enemy ships? Remember you must always be vigilant, it only takes a fleet to slip past you in the night and attack a poorly defended allied port to see the tide turn against you. How the naval war in the Pacific ends is up to you and the decisions you make. A huge fleet to choose from. With over 100 ship classes and counting, representing thousands of vessels, and dozens of types of aircraft and ports spanning the Pacific ocean, Victory At Sea Pacific represents limitless strategic options as you find yourself in total command of the Pacific Theatre during WW2. Victory at Sea Pacific features; Search and destroy enemy fleets across the entire Pacific Ocean Effortlessly switch between commanding the entire Pacific theatre and controlling the fate of individual vessels and planes Upgrade Ports and build shipyards Harass shipping and starve ports of vital supplies Organise large scale amphibious assaults on major ports Control unique vessels such as the huge I-400 submarine aircraft carrier Build highly skilled crews ready for combat Pausable gameplay allows you to order fleets and then continue the action Play as Axis or Allied fleets (RN campaign coming soon) From small skirmishes involving single destroyers and hunting down merchantmen, to the clashing of massive fleets against implacable enemies, Victory at Sea Pacific is your ticket to exciting battles that take place on the dangerous seas of World War II.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/806950/header.jpg?t=1598528231",
    "Price": 39.99,
    "Developers": "Evil Twin Artworks",
    "Publishers": "Evil Twin Artworks",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_454ae448c85acef2f850c714a70fbfc4dac2168b.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_82c9213466a0fd8217a953f9bb6ccfd90a72b298.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_55df8022eedf86a2d22c601e489cf93548910f84.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_6caee47d0b41bbf7c386b5272e895c647dd2e639.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_456cd06e16827e00535f96d83d4242225900d5f6.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_e9b35db5a5632268fa56e3f80d6d727818f18693.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_feacb83a31e1f578188f45f60ca0f9039dc9427b.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_e8961d53114e86033ae7f749b1bdf29a3a1eec77.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_64f7082558fb0a99322248e8ff55736262342c2d.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_513b4cf42e2cf79a768db43a295e3e8fe7d940af.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_9c4790ca6ae8f41c7908d7be7332ede80ca1082e.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_be3e29198a0e954efbb05eeae24d0ef07360c23a.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_dd60a032d2fe5b5bffd55e42ffcee447183b7688.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_1e63a3db6f3172902fc3e8826797706f1bfff8cb.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_57de156576606aad347696c86e3d6aacd7fa4055.1920x1080.jpg?t=1598528231,https://cdn.akamai.steamstatic.com/steam/apps/806950/ss_fdd6f93be35732bc8d7442913112a7be90da168f.1920x1080.jpg?t=1598528231",
    "Slug": "victory-at-sea-pacific",
    "Meta Title": "Victory At Sea Pacific: Sep 14, 2018, Evil Twin Artworks ...",
    "Meta Description": "Looking for information on Victory At Sea Pacific? Check out the release date (Sep 14, 2018), developer insights from Evil Twin Artworks, and a complete...",
    "Alt Text Image": "Official header image for Victory At Sea Pacific game - Steam 806950",
    "Canonical URL": "https://gusku.site/game/victory-at-sea-pacific",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Victory At Sea Pacific\", \"description\": \"Looking for information on Victory At Sea Pacific? Check out the release date (Sep 14, 2018), developer insights from Evil Twin Artworks, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 14, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Evil Twin Artworks\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Evil Twin Artworks\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/806950/header.jpg?t=1598528231\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}