{
    "AppID": 1057990,
    "Name": "Viking Trickshot",
    "Release date": "May 3, 2019",
    "About the game": "A throwing physics challenge that's tricky to master, set in a bizarre Viking universe. Play kubb for laughs in ridiculous 2 player (shared device or online), or for gold and to unlock all achievements in 1 player, with more than 100 levels! Based on the real Viking game of kubb, taken to the extreme. Encounter various worlds and play with various characters from Viking mythology. The rules are deceptively simple: throw batons to knock over your kubbs (logs) while trying to avoid theirs, and finally take out the king to win! But knock over the king too early, and it's game over. The free BASE GAME includes more than 50 levels (combined 1 and 2 player) with the two core batons, and unlimited online multiplayer. A one-off in-app purchase for the FULL GAME will allow you to unlock all remaining content and mechanics, including any future updates. FULL GAME FEATURES: - 50+ 2 player levels (local multiplayer/shared device or online) - 50+ 1 player levels with bronze/silver/gold trophies to earn - More (60+ total) fun and challenging achievements for the completionists - Custom drawn and animated characters and worlds to unlock by completing 1 player levels - A handful of different batons with fun mechanics, and levels designed to complement them - Custom made epic soundtracks TIPS: - The controls are a little tricky! Don't worry if you don't get 'em immediately - it won't take long - 2 player is best enjoyed for the lols. See a potentially crazy shot? DO IT - You can play 1 player while searching for someone to play with online - Don't go for gold straight away when you start 1 player. Fly through bronze first to unlock everything, then come back for gold - Some gold levels are much harder than others. If stuck, skip and come back later - You can tune the game's difficulty (both ways) in the Accessibility settings - Online multiplayer features cross-play between iOS/Android/Steam versions of Viking Trickshot (players must be on the same game update/version) --- Viking Trickshot's free base game includes 20+ single player levels with two core mechanics, 25+ two player levels, and unlimited online or local multiplayer. The full game DLC adds a further 70+ single and two player levels (combined), many new crazy characters, mechanics, achievements to unlock, and more - and will include any new updates, forever. We know people work hard for their money and only want you to spend it on us if you know you really like the game, which is why we've opted for this free base game + premium full game model: so you can play the real game with more than 2 hours of content and unlimited online multiplayer, hopefully love it, and then decide to buy it - or if you don't love it, you can part ways without having wasted any money. Note that buying the full game doesn't immediately provide access to all content: you'll still need play the game to unlock them by progressing through the single player mode! Chat with the devs, share crazy trickshots and check out what other projects are in the works at the Doodad Games Discord server ! Art, animations, music, level design and more from Ethan Close .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1057990/header.jpg?t=1627709445",
    "Price": 0.0,
    "Developers": "Doodad Games,Ethan Close",
    "Publishers": "Doodad Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1057990/ss_3e7eb315541359e77ba5300217a29358e8595d20.1920x1080.jpg?t=1627709445,https://cdn.akamai.steamstatic.com/steam/apps/1057990/ss_fa8a54c6270f7e135c66c19c56f5925b2e59eefb.1920x1080.jpg?t=1627709445,https://cdn.akamai.steamstatic.com/steam/apps/1057990/ss_298d62a9bc2147fbc50f585bb315267a13b01da1.1920x1080.jpg?t=1627709445,https://cdn.akamai.steamstatic.com/steam/apps/1057990/ss_07fa3133d84a24add0a2c4b04883984480c91c03.1920x1080.jpg?t=1627709445,https://cdn.akamai.steamstatic.com/steam/apps/1057990/ss_dcaa61842e73225d3c9bb65b7031472c421f58ca.1920x1080.jpg?t=1627709445,https://cdn.akamai.steamstatic.com/steam/apps/1057990/ss_9e0de8f6978f278f8920503a6c0921e8f67d6b99.1920x1080.jpg?t=1627709445,https://cdn.akamai.steamstatic.com/steam/apps/1057990/ss_03f3646bdb6fdff769904666796e26739564de9f.1920x1080.jpg?t=1627709445",
    "Slug": "viking-trickshot",
    "Meta Title": "Viking Trickshot: May 3, 2019, Doodad Games,Ethan Close a...",
    "Meta Description": "Looking for information on Viking Trickshot? Check out the release date (May 3, 2019), developer insights from Doodad Games,Ethan Close, and a complete ...",
    "Alt Text Image": "Official header image for Viking Trickshot game - Steam 1057990",
    "Canonical URL": "https://gusku.site/game/viking-trickshot",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Viking Trickshot\", \"description\": \"Looking for information on Viking Trickshot? Check out the release date (May 3, 2019), developer insights from Doodad Games,Ethan Close, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 3, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Doodad Games,Ethan Close\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Doodad Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1057990/header.jpg?t=1627709445\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}