{
    "AppID": 1740670,
    "Name": "VZX Creative",
    "Release date": "Jan 6, 2022",
    "About the game": "Link to VZX Player If you are new to VZX please start with our basic / consumer product. It's free to download. Refunds Also please keep an eye out for Steams refund rules. Not included here as they can change, but keep that in mind. You can evaluate the full product and get a refund but within some time and usage limitations. VZX Creative The VZX music visualizer family of programs generates awesome audio reactive graphics in real time from any audio source - music player, youtube, microphone, line-in etc. VZX Creative is an application suite for creatives and professionals who wish to have better control over live visualization playback and or create their own music visualizations. VZX Creative is comprised of 2 separate products: VZX Player Professional Plays Vovoid's full range of DLC visuals in addition to custom made visuals. Plays DLC you have already bought for VZX Player (Consumer player) but not with all features Plays Pro Player versions of DLC Output separated from GUI: The Output ( VZX Pro Player ) is a separate application/binary from the GUI ( VZX Pro Controller ). Run GUI/Controller on one monitor, graphics output on another monitor. Run GUI/Controller on one computer, output on another computer. Control commands are sent over the network - locally or over the LAN. Audio Audio recording is also detached into its own application, can also run on a separate computer Audio data is also sent via network - locally or over the LAN. Preset creation with: Support for tweak parameters (all DLC including consumer DLC packs) Up to 4 layers of custom overlay images with full industry standard blend mode support (Only if you own Pro DLC) Color Palette manager which can be used in tweak/overlay parameters in presets and chosen during live playback Playlist support, multiple playlists Handling of multiple complete states as mostly human-readable JSON files (where one state includes presets, palettes playlists etc) In-app documentation UI supports click actions on touch screens - for instance using an android tablet as an extra screen Exactly position the output window for streaming setups VZX Artiste Modular programming environment focused on letting you control and tweak rendering of music visuals and other content Immersive UI focused on fine-tuning the graphical output Over 200 programming modules covering maths, rendering, audio input, image loading and more In-app and online reference documentation",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1740670/header.jpg?t=1657038919",
    "Price": 11.99,
    "Developers": "Vovoid Media Technologies AB",
    "Publishers": "Vovoid Media Technologies AB",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1740670/ss_f145bd0e583141abcd059adb4edce7f362f86db8.1920x1080.jpg?t=1657038919,https://cdn.akamai.steamstatic.com/steam/apps/1740670/ss_b1a118549ffb3684c81416ae8c6d53b2e773fc89.1920x1080.jpg?t=1657038919,https://cdn.akamai.steamstatic.com/steam/apps/1740670/ss_5a1f193336c14ba4dfdd0d69971b2ff3a48bb68c.1920x1080.jpg?t=1657038919,https://cdn.akamai.steamstatic.com/steam/apps/1740670/ss_69c3744487c0eb5c049105b781ceeffcf93bb6e4.1920x1080.jpg?t=1657038919,https://cdn.akamai.steamstatic.com/steam/apps/1740670/ss_1dbe4aa9332509164154907c3427a6b4f93a854f.1920x1080.jpg?t=1657038919,https://cdn.akamai.steamstatic.com/steam/apps/1740670/ss_e895387b5197ecf091f3fbf76b7f476505c403e9.1920x1080.jpg?t=1657038919",
    "Slug": "vzx-creative",
    "Meta Title": "VZX Creative: Jan 6, 2022, Vovoid Media Technologies AB a...",
    "Meta Description": "Looking for information on VZX Creative? Check out the release date (Jan 6, 2022), developer insights from Vovoid Media Technologies AB, and a complete ...",
    "Alt Text Image": "Official header image for VZX Creative game - Steam 1740670",
    "Canonical URL": "https://gusku.site/game/vzx-creative",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VZX Creative\", \"description\": \"Looking for information on VZX Creative? Check out the release date (Jan 6, 2022), developer insights from Vovoid Media Technologies AB, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Vovoid Media Technologies AB\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vovoid Media Technologies AB\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1740670/header.jpg?t=1657038919\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}