{
    "AppID": 908420,
    "Name": "We Happy Few - Soundtrack and Digital Goods Bundle",
    "Release date": "Aug 29, 2018",
    "About the game": "This Soundtrack and Digital Goods Bundle includes the official We Happy Few soundtrack in .MP3 and .FLAC format, along with other digital goodies to fill your life with Joy: Desktop wallpapers featuring a mix of 4K screenshots and concept art Phone wallpapers Ringtones, including soundtrack clips and other iconic lines from the game A lyric sheet so you can sing along! The soundtrack includes songs from the game as well as The Make Believes, a tailor-made boy band paying tribute to the swinging sounds of the ‘60s, with original tunes created just for We Happy Few. The Make Believes are: Murray A. Lightburn - Lead Vocals, Guitar, Bass Brad Barr - Lead Vocals, Guitar Andrew Barr - Drums, Percussion, Backing Vocals Patrick Watson - Lead Vocals, Keyboards Tracks: 1. Dead Of Winter by The Make Believes 2. Out Of The Blue by The Make Believes 3. La La La by The Make Believes 4. Smiling Crime by The Make Believes 5. Zombieland by The Make Believes 6. When You're Gone by The Make Believes 7. Georgie Joy by The Make Believes 8. Wellington Wells Broadast Corporation by Nicolas Marquis 9. Dead Chuffed by Nicolas Marquis 10. House Of Curious Behaviors by Nicolas Marquis 11. Lovely Day For It by Murray Lightburn 12. Suspect On The Loose by Nicolas Marquis 13. Parade District by Nicolas Marquis 14. The Garden District by Nicolas Marquis 15. Hamlyn, A Seaside Town by Nicolas Marquis 16. Brassed Off by Nicolas Marquis 17. Dead Chuffed - Dazed And Confused by Nicolas Marquis 18. Everything Will Be As Right As Rain by Nicolas Marquis 19. Joy And A Happy Face by Nicolas Marquis 20. On Cloud Nine by Nicolas Marquis 21. Enlightenment Is Found In Mushrooms by Nicolas Marquis 22. Angry Mushrooms by Nicolas Marquis 23. Wellington Wells Anthem by Nicolas Marquis 24. Military Camp by Nicolas Marquis 25. Jubilator Music by Nicolas Marquis 26. The Bobby Song by Nicolas Marquis 27. The Church Of Simon Says by Nicolas Marquis 28. Notes Of Distraction by Nicolas Marquis 29. Lift To The Executive Committee by Nicolas Marquis 30. Suspicious At The Jumble Sale by Nicolas Marquis 31. The Plague Shelter by Nicolas Marquis 32. Are They Sleeping? By Nicolas Marquis 33. Overdose and Crash by Nicolas Marquis 34. Last Legs by Nicolas Marquis 35. Victoria's Abdelazer by Henry Purcell Arranged by Nicolas Marquis 36. Welcome To Wellington Wells by Nicolas Marquis 37. Sunny Day by Nicolas Marquis 38. Garden District Reprise by Nicolas Marquis 39. Joy And A Happy Face Reprise by Nicolas Marquis 40. Who's Up For Simon Says by Nicolas Marquis 41. A Seaside Town Reprise by Nicolas Marquis 42. Train Station by Nicolas Marquis 43. The Ratholm Fog by Nicolas Marquis 44. Sunny Day - Down And Out by Nicolas Marquis 45. Department Of Science by Nicolas Marquis 46. Ollie's Defense by Nicolas Marquis 47. Fighting For Joy by Nicolas Marquis 48. Arthur's Escape by Nicolas Marquis",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/908420/header.jpg?t=1648682427",
    "Price": 7.99,
    "Developers": "Compulsion Games",
    "Publishers": "Gearbox Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/908420/ss_24ca4cf6caaf975e73f81d0ac6d4822d5a142d38.1920x1080.jpg?t=1648682427,https://cdn.akamai.steamstatic.com/steam/apps/908420/ss_77d76bbd5a722910fe68a4f03ba115e9ef15db9b.1920x1080.jpg?t=1648682427,https://cdn.akamai.steamstatic.com/steam/apps/908420/ss_83643a06fbeb506b1e6089839ff53dcba813c7a2.1920x1080.jpg?t=1648682427,https://cdn.akamai.steamstatic.com/steam/apps/908420/ss_1980d11bdd2c9183192511f4e3d739c1bf01d35e.1920x1080.jpg?t=1648682427,https://cdn.akamai.steamstatic.com/steam/apps/908420/ss_ba3bce11b77d398a0fd96624a58cd149df94b12d.1920x1080.jpg?t=1648682427",
    "Slug": "we-happy-few-soundtrack-and-digital-goods-bundle",
    "Meta Title": "We Happy Few - Soundtrack and Digital Goods Bundle: Aug 2...",
    "Meta Description": "Looking for information on We Happy Few - Soundtrack and Digital Goods Bundle? Check out the release date (Aug 29, 2018), developer insights from Compul...",
    "Alt Text Image": "Official header image for We Happy Few - Soundtrack and Digital Goods Bundle game - Steam 908420",
    "Canonical URL": "https://gusku.site/game/we-happy-few-soundtrack-and-digital-goods-bundle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"We Happy Few - Soundtrack and Digital Goods Bundle\", \"description\": \"Looking for information on We Happy Few - Soundtrack and Digital Goods Bundle? Check out the release date (Aug 29, 2018), developer insights from Compul...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 29, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Compulsion Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gearbox Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/908420/header.jpg?t=1648682427\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}