{
    "AppID": 1529100,
    "Name": "What The Maze",
    "Release date": "Mar 10, 2021",
    "About the game": "Imagine you are in an experiment that pushes you to your limits. Which takes your breath away. Which will kill you in the worst case .. This is the 'What The Maze' experiment! You wake up in front of the gate of a gigantic maze and have something to eat and drink. The gate opens and before you are in the labyrinth it closes again. You are trapped You don't know what to expect in the labyrinth. Is it true that this was all just an experiment? Or do the machines want to bring you underground? Find out! Getting started: As soon as you arrive in the game, you'll hear a mysterious voice instructing you. Listen to it carefully, because it won't repeat itself and will give you information about the maze. This information may or may not be true. You have a small starting capital of food and drink. You also have a battery. In this world, batteries are slightly larger. The gate opens after about a minute. Then your survival instincts are needed. Graves: I was once told that there are graves hidden in the labyrinth. There are buried those who have tried this experiment before you. You must find them all because there are relics hidden there. I think you have to find them all. It can be very hard, but you can get some friends to help you. Yes! You can choose up to 3 friends to do this experiment with you. Unique AI Technique: The team has put a lot of effort into the development of the Ai's to offer an incredibly scary gaming experience. While you think that nothing can happen to you right now, you walk around the corner and encounter a scary creature. The more graves you find, the harder it is to fight against the souls. But there are also random graves. These weaken the strength of the souls, making it a more enjoyable gaming experience. However, it should be said that when you buy this game, you also get a good handful of adrenaline. Inventory system: The inventory system in one of the tactical points of the game. Whether it is the correct allocation of food and drink or the sensible use of the glow sticks. Due to the adrenaline factor in the game, you generally have a little more hunger and thirst. Therefore, it is very important to keep an eye out for food and drink in the maze. If you get lost, the glow sticks can help. These can simply be dropped and thus it is almost impossible to run the same way again. Rush Mode: The last renewal was the 'Rush Mode'. If you don't feel like being scared, you can race with a friend. In a test lab for the next mazes, a random maze is built at each start, through which you can race against a friend. In short, the first to find the exit is the winner. This mode was a lot of fun for the whole development team.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1529100/header.jpg?t=1615738513",
    "Price": 5.99,
    "Developers": "Jannis Cloodt",
    "Publishers": "JC Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1529100/ss_ca0b2fea6308205cd411f205082a83bc7c7cc432.1920x1080.jpg?t=1615738513,https://cdn.akamai.steamstatic.com/steam/apps/1529100/ss_7006bdc25c920ec0f981ed32bb0012a967f6702c.1920x1080.jpg?t=1615738513,https://cdn.akamai.steamstatic.com/steam/apps/1529100/ss_1f699fcd3c5864fdce416badd9ec6d9d8179973d.1920x1080.jpg?t=1615738513,https://cdn.akamai.steamstatic.com/steam/apps/1529100/ss_bcab76f79d5d3783d1dff7a75131363df8f47813.1920x1080.jpg?t=1615738513,https://cdn.akamai.steamstatic.com/steam/apps/1529100/ss_23c79e2a075a59d78b7789774cfb12c327fd62b1.1920x1080.jpg?t=1615738513,https://cdn.akamai.steamstatic.com/steam/apps/1529100/ss_1ae32b50cad6db3be7ab7b60c1f134414e821d7e.1920x1080.jpg?t=1615738513",
    "Slug": "what-the-maze",
    "Meta Title": "What The Maze: Mar 10, 2021, Jannis Cloodt and Full Overview",
    "Meta Description": "Looking for information on What The Maze? Check out the release date (Mar 10, 2021), developer insights from Jannis Cloodt, and a complete game summary.",
    "Alt Text Image": "Official header image for What The Maze game - Steam 1529100",
    "Canonical URL": "https://gusku.site/game/what-the-maze",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"What The Maze\", \"description\": \"Looking for information on What The Maze? Check out the release date (Mar 10, 2021), developer insights from Jannis Cloodt, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jannis Cloodt\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JC Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1529100/header.jpg?t=1615738513\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}