{
    "AppID": 338080,
    "Name": "A列車で行こう8",
    "Release date": "Jan 8, 2015",
    "About the game": "This game is only available in Japanese. Railroad management and City Development simulation game, A-Train 8 keeps the strong mechanics of the A-Train series and put the whole map in 3D for the first time. A game to both control a living 3D city, and enjoy watching the landscape you helped create. This game is only available in Japanese. A-Train in 3D as only the PC can handle A-Train 8 renders the whole town in 3D for a more beautiful and realistic experience. However this switch for 3D does not change that it takes only your mouse to control rail construction and camera freely. Streamlined control that can only be found on computer, which can be enhanced by using high definition monitor and high spec machines. Featuring 10 premade Map, but also a free map construction tool for unlimited creation A-train 8 feature 10 maps each with their own specific challenge. You are also free to design you own map using the construction tool which gives you full control over all city features, but also the terrain geography itself. Over 200 trains Featuring real trains from Japan Rails and other private companies, the game gives you full control to create trains up to 7 wagons, but also control wether they work as local trains or express trains. Create your own city train network using to the best all those trains at your disposal. Railroad Management By creating rails and station, you can create new flow of people and contribute to the development of the city. Siding, Single Cross, Double Cross allow you to create you railroad freely. Of course Subway and Elevated railways can be built too. Build your ideal train network and see it contribute to the town and its surroundings. *DirectX9.0c or better is necessary for a number of functions to fully work *No guarantee for any machine not supporting DirectX9.0c or better *Please make sure your machine can run the game before buying by using the benchmark : Benchmark Page #040 Railway vehicle production cooperation Hokkaido Ryoaku Tetsudo Kabushikigaisha Higashi Nihon Ryoaku Tetsudo Kabushikigaisha Nishi Nihon Ryoaku Tetsudo Kabushikigaisha Shikoku Ryoaku Tetsudo Kabushikigaisha Kyuushuu Ryoaku Tetsudo Kabushikigaisha Nihon Kamotsu Tetsudo Kabushikigaisha Eizan Dentetsu Kabushikigaisha Odakyu Dentetsu Kabushikigaisha Kinki Nihon Tetsudo Kabushikigaisha Keio Dentetsu Kabushikigaisha Keisei Dentetsu Kabushikigaisha Keihan Denki Tetsudo Kabushikigaisha Keihin Kyuukou Dentetsu Kabushikigaisha Shutoken Shintoshi Tetsudou Kabushikigaisha Seibu Tetsudou Kabushikigaisha Tokyo Kyuukou Dentetsu Kabushikigaisha Tokyo Chikatetsu Kabushikigaisha Tobu Tetsudo Kabushikigaisha Nagoya Tetsudo Kabushikigaisha Chubu Kokusai Kuukou Kabushikigaisha Nankai Denki Tetsudo Kabushikigaisha Nishi Nihon Tetsudo Kabushikigaisha Hanshin Denki Tetsudo Kabushikigaisha Hiroshima Dentetsu Kabushikigaisha Hokuetsu Kyuukou KAbushikigaisha Tokyo Toshi Koutsukyoku Osaka Toshi Koutsukyoku Fukuoka Toshi Koutsukyoku Commercial license",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/338080/header.jpg?t=1657611664",
    "Price": 49.99,
    "Developers": "ARTDINK",
    "Publishers": "Komodo",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/338080/ss_84a5f853d6837ba1961269fc97961d0dcb844891.1920x1080.jpg?t=1657611664,https://cdn.akamai.steamstatic.com/steam/apps/338080/ss_db3b398769e7d63145f0874b57d22ce7748e46f7.1920x1080.jpg?t=1657611664,https://cdn.akamai.steamstatic.com/steam/apps/338080/ss_793e93ee8282bf566a918b67c55b8e208b46bbbc.1920x1080.jpg?t=1657611664,https://cdn.akamai.steamstatic.com/steam/apps/338080/ss_7aacb728ccc56a10cfc964b028693e31f3a8ab56.1920x1080.jpg?t=1657611664,https://cdn.akamai.steamstatic.com/steam/apps/338080/ss_a9d55c349f9e88e35aa78162bafe59f23968db96.1920x1080.jpg?t=1657611664,https://cdn.akamai.steamstatic.com/steam/apps/338080/ss_06487f75f820644c045a5d8f697cef3ddb4bd9d5.1920x1080.jpg?t=1657611664,https://cdn.akamai.steamstatic.com/steam/apps/338080/ss_ebdf5af8376f5970365e12835c1bfaae8c8ceeb0.1920x1080.jpg?t=1657611664,https://cdn.akamai.steamstatic.com/steam/apps/338080/ss_d5cf9131ecea760a70f171c0791b6cf7f243fcf3.1920x1080.jpg?t=1657611664,https://cdn.akamai.steamstatic.com/steam/apps/338080/ss_b59199353da5617e0f3f2cb5bed1eb82bd475bc1.1920x1080.jpg?t=1657611664",
    "Slug": "a8",
    "Meta Title": "A列車で行こう8: Jan 8, 2015, ARTDINK and Full Overview",
    "Meta Description": "Looking for information on A列車で行こう8? Check out the release date (Jan 8, 2015), developer insights from ARTDINK, and a complete game summary.",
    "Alt Text Image": "Official header image for A列車で行こう8 game - Steam 338080",
    "Canonical URL": "https://gusku.site/game/a8",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"A\\u5217\\u8eca\\u3067\\u884c\\u3053\\u30468\", \"description\": \"Looking for information on A\\u5217\\u8eca\\u3067\\u884c\\u3053\\u30468? Check out the release date (Jan 8, 2015), developer insights from ARTDINK, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 8, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"ARTDINK\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Komodo\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/338080/header.jpg?t=1657611664\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}