{
    "AppID": 313660,
    "Name": "Alea Jacta Est",
    "Release date": "Nov 4, 2014",
    "About the game": "“ALEA JACTA EST” (The Die is Cast) is what Caesar said as he crossed the Rubicon River when he learned that the Senate had removed him from his command. Crossing that small Italian river was equivalent to disobeying Rome’s orders and entering into open rebellion. The great confrontation with Pompey was about to begin… One of them would become the Master of Rome, and the other would die… Alea Jacta Est is the first historical strategy game on the PC to cover the main Roman civil wars, created by a dedicated team of experts to bring the epic battles that pitted Romans against Romans in conflicts such as those between Rome, Sertorius, and Mithridates. With an incredible level of rich historical detail and historical accuracy, it is one of the few strategy games where the player must face the real dilemmas and challenges of the Romans during the time. Not only must you build and train armies, maneuver them and engage the enemy, but you must also maintain an economic and diplomatic balance with your neighbors. Using the successful and famous AGE engine, Alea Jacta Est covers the whole of Europe, Northern Africa, and part of Eastern Europe, part of more than 2,800 regions, complete with cities, roads, fortifications, weather types, tribes and kingdoms of the time of the scenario. Featuring 5 campaigns from 87 BC to 197 AD, hundreds of historical leaders, units and events, Alea Jacta Est is a must-have for any grand strategy fan. Features Ancient Command System (based on the Wars in America system), allowing for a good representation of historical army command in the Roman era. Quick and simple system of Construction of Units, allowing players to choose and purchase their forces as they wish (or can). Decisions features, playable on the map, like wild cards assets Diversified set of historical events, allowing multiple choices events and options, hereby enhancing flexibility and re-playability. Different updates and other rules, in particular combat system adapted to the Ancient warfare. Map: all of the Roman Empire and neighboring lands, with over 2800 different regions and seas, a lot of room for maneuvers. Over a thousand of leaders and units with specific pictures.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/313660/header.jpg?t=1575025221",
    "Price": 24.99,
    "Developers": "Ageod",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/313660/ss_079bae42e199d6a8f5a919e0e149949ad9be9e18.1920x1080.jpg?t=1575025221,https://cdn.akamai.steamstatic.com/steam/apps/313660/ss_68d0034447133992a794077c42a5c7408eddfc5c.1920x1080.jpg?t=1575025221,https://cdn.akamai.steamstatic.com/steam/apps/313660/ss_de372b96dea2c1e3d9d5d8e77bc5440f9ce53b43.1920x1080.jpg?t=1575025221,https://cdn.akamai.steamstatic.com/steam/apps/313660/ss_6e3fe950704d5b3d592e63d044fad771b63b9ec4.1920x1080.jpg?t=1575025221,https://cdn.akamai.steamstatic.com/steam/apps/313660/ss_7fe168b3dad425b861e52b45230cd86ab9aaec36.1920x1080.jpg?t=1575025221,https://cdn.akamai.steamstatic.com/steam/apps/313660/ss_d577504a0f7d8d3e76770871391a831304664d80.1920x1080.jpg?t=1575025221",
    "Slug": "alea-jacta-est",
    "Meta Title": "Alea Jacta Est: Nov 4, 2014, Ageod and Full Overview",
    "Meta Description": "Looking for information on Alea Jacta Est? Check out the release date (Nov 4, 2014), developer insights from Ageod, and a complete game summary.",
    "Alt Text Image": "Official header image for Alea Jacta Est game - Steam 313660",
    "Canonical URL": "https://gusku.site/game/alea-jacta-est",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Alea Jacta Est\", \"description\": \"Looking for information on Alea Jacta Est? Check out the release date (Nov 4, 2014), developer insights from Ageod, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 4, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ageod\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/313660/header.jpg?t=1575025221\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}