{
    "AppID": 801700,
    "Name": "AlpenCROSS",
    "Release date": "Apr 5, 2018",
    "About the game": "TransALP – find your own way aCROSS the Alps. The challenge is to find your best way from one CHECKPOINT to the next. 500m or 10km, explore the terrain! You get points for successful rides. With this points you´l unlock BIKES, equipment, outfits and new sections. Combine it, find your tactics to master the game! Make more points with STUNTS if this is your way,... but the focus is to drive a Mountain bike with smooth movement, possibility's, physics, cycle feeling and – interacting with the terrain! Your want find out more? OK, find it, explore it,... Check out the home of AlpenCROSS What makes this Game NOVEL? The accessible bike physic A mixture of skill and tactics, for beginners and professionals! The “open Alps” principle! Find your own way to reach the CHECKPOINTS The “Nature simulation” Cycling is more than kick to pedal! Wind, stream rushing, bees buzzing, the wind that sweeps through the crest…. GAME Play The trip planning leads you over 32 challenges in 5 different sections across the Alps! there are 2 GAME MODES: TIMERUSH: By this challenges, the way points are just 100 meters apart and make breakneck routes. ORIENTING: To orient yourself you must plan the tour yourself, preferably with the map, to reach the next way point (far away). SPECIALS will help you Tactically combined in preparing the TOUR. Wider tires for the Cross Country , or use the advantages of glasses? The protectors, hmm, is there room for the MAP? I can take only 3 Specials. 12 SPECIALS, BIKES 5 and 4 OUTFITS provide new possibilities and combinations! MOUNTAIN-BIKES The balanced Fully The cross country with hard tail and 29 inch wheels The Fat bike find completely new routes The Enduro has an unbuffered strut the Downhill makes me to an chamois… SMART RANKING Through successes are quickly unlocked new SPECIALS and Tougher challenges. Easy start – Heavy Master EASY CONTROL Quick and easy to control! cozy Per controller, on the Couch with Beamer or with the keyboard for a fast lap in the office …. All pre-set and configurable intuitively, easy and comfortable! REPLAY Marvel at your own driving performance! After your tour, show the replay and see your wild ride again to view the replay from several perspectives. SPECIAL MOVES Slides - with the rear brake. Physics pure and 180 degrees if you want and if you can! Pump kick - put all your weight full in the pedal MAKING OF 5 Years Development and distilling good material make a real good drop of Whisky: The DRIVERS MOVEMENT isn't an precalculated prerendered. It is a sketch what happens in movement with an Physical Ragdol. So you see no driving part twice! NATURE PHOTOS +5000 Photos from the Alpine region for backgrounds Textures plan graphics CODE +40,000 Lines of code to calculate the tire Traction at the right angle. also the offset to determine when wind gusts, also the height of the lake level to calculate … +300 Shader from Shader Model 3.0 Among other post process Photoreal or optional RAW shader. collect material SOUND Sounds like a babbling brook? Like a thundering waterfall? +600 Sound recordings for all they know the sound only to hear at the crest! MUSIC 26 cool tracks for those who prefer music underscore the action in the ear! VEGAN PRODUCTS As the collecting pictures and sounds in the nature, no animals or animal products were used or damaged. Also with the virtualisation no fauna or flora has been disturbed.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/801700/header.jpg?t=1523031683",
    "Price": 6.99,
    "Developers": "Harald Wiestner - farbWERK",
    "Publishers": "Harald Wiestner - farbWERK",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_cf4f30cb507c6bb528d4dd43198c5e5480e7badd.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_8e8b5ab40e1e14381b1d8d8417e7e669e0f42f28.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_a94ab1dcdbfce2886abd340637f59728313a3b09.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_d5293492bfdc43247e02100634d8059b190be839.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_4f1f9edd7d8ead467f2c00044a4d2785b431f35d.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_35612b134294c578991bf98a979f3d9a42fd165f.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_d6635f7f0a5be7d88421255c0917fd2297efd0fc.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_8cb2c8ecf29c413b34ca31f8cc00664b415ea15c.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_a4dce1bd4ee0d8ec2583f5fad8792037e8f989b7.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_852a00b68cbd8016f8b6e7a39d7e0a211ce74837.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_ed93ccc7e556b39871e9589a57d14771bbcd0f5e.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_4a223316ddb2ff68f2ae8fe2ed479984c27df3bd.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_61c11ca9adfc73e83eb963cc1aca7890e1f72f08.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_b8fe6411ea798876e6ca405812c78d4d62cfc89d.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_f8dcb1a04a0a1f29d1087e121188bd270d043d5a.1920x1080.jpg?t=1523031683,https://cdn.akamai.steamstatic.com/steam/apps/801700/ss_2e18c7cd7d34f690072b9f3d089b55358a3bc9b9.1920x1080.jpg?t=1523031683",
    "Slug": "alpencross",
    "Meta Title": "AlpenCROSS: Apr 5, 2018, Harald Wiestner - farbWERK and F...",
    "Meta Description": "Looking for information on AlpenCROSS? Check out the release date (Apr 5, 2018), developer insights from Harald Wiestner - farbWERK, and a complete game...",
    "Alt Text Image": "Official header image for AlpenCROSS game - Steam 801700",
    "Canonical URL": "https://gusku.site/game/alpencross",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"AlpenCROSS\", \"description\": \"Looking for information on AlpenCROSS? Check out the release date (Apr 5, 2018), developer insights from Harald Wiestner - farbWERK, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 5, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Harald Wiestner - farbWERK\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Harald Wiestner - farbWERK\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/801700/header.jpg?t=1523031683\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}