{
    "AppID": 361420,
    "Name": "ASTRONEER",
    "Release date": "Feb 5, 2019",
    "About the game": "Explore and reshape distant worlds! Astroneer is set during the 25th century Intergalactic Age of Discovery, where Astroneers explore the frontiers of outer space, risking their lives in harsh environments to unearth rare discoveries and unlock the mysteries of the universe. In this space sandbox adventure, players can work together to build custom bases above or below ground, create vehicles to explore a vast solar system, and use terrain to create anything they can imagine. A player’s creativity and ingenuity are the key to thriving on exciting planetary adventures! In Astroneer you can: Reshape the ground under your feet as though it were made of clay. In Astroneer, players use their deform tool to dig, collect, shape and build anything they wish. Use this ability to dig to the center of the planet, build a ramp into the sky, or make megaliths just by using terrain! Survive on and explore carefully crafted planets that can be entirely deformed and traversed. Our vast solar system includes 7 wondrous planets that players can travel between and explore every inch of, from the entire spherical surface, through treacherous layers of caves, all the way down to the mysterious core. Each of those planets has unique and challenging surface and cave biomes that offer a multitude of challenges for players on their journey. Snap together components and objects to build bases and vehicles. Items that Astroneers craft and find in the world can all be snapped and connected together to create unique creations for any situation. Customize and decorate your bases, vehicles, and Astroneer. Play with friends in 4 player online drop-in/drop-out co-op. Astroneer is better with friends. Group up with other players and work together to create massive industrial bases or to create fun games in the extensive creative sandbox. Discover and uncover the mysteries of the solar system. Once Astroneers are ready, they may choose to attempt to understand and possibly harness the power behind mysterious structures found in the world. Astroneer began as an Early Access title on Steam and would not be here today if not for your support, feedback, and ideas throughout that process. Now that we have delivered our 1.0 version, we want to reiterate our pledge to continue building on the foundation that is Astroneer with free, ongoing content updates. If you're curious about the direction we're aiming for, be sure to go check out our roadmap and our development vlogs to keep updated on what we are working on!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/361420/header.jpg?t=1656698434",
    "Price": 29.99,
    "Developers": "System Era Softworks",
    "Publishers": "System Era Softworks",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/361420/ss_539bc5211ccdad2bc6cc70e4af40194d74eb0256.1920x1080.jpg?t=1656698434,https://cdn.akamai.steamstatic.com/steam/apps/361420/ss_858b8bece04b753a6b35a009776a4de9dd6e0df7.1920x1080.jpg?t=1656698434,https://cdn.akamai.steamstatic.com/steam/apps/361420/ss_cd719a15ce46e46b78837df49f705d4dd27a2b81.1920x1080.jpg?t=1656698434,https://cdn.akamai.steamstatic.com/steam/apps/361420/ss_436f3ea0934a6ecd3fdd2f260ef535d80b8c185d.1920x1080.jpg?t=1656698434,https://cdn.akamai.steamstatic.com/steam/apps/361420/ss_13682f989b3f0d68afb92d5d50185b0258dd4767.1920x1080.jpg?t=1656698434,https://cdn.akamai.steamstatic.com/steam/apps/361420/ss_c7c54244add5ac921f2ae5b28f6f3efbc8470823.1920x1080.jpg?t=1656698434,https://cdn.akamai.steamstatic.com/steam/apps/361420/ss_63402300a9d8f1eff80a3034b872995db03158ab.1920x1080.jpg?t=1656698434,https://cdn.akamai.steamstatic.com/steam/apps/361420/ss_a1b3fd7d139ba491aba79a3731af0cf7dec04e0a.1920x1080.jpg?t=1656698434,https://cdn.akamai.steamstatic.com/steam/apps/361420/ss_6b0756c148cad9b8029475d516a110dda3f3bac8.1920x1080.jpg?t=1656698434,https://cdn.akamai.steamstatic.com/steam/apps/361420/ss_0e35ef544d0f7767253e90cad603adb32a026096.1920x1080.jpg?t=1656698434",
    "Slug": "astroneer",
    "Meta Title": "ASTRONEER: Feb 5, 2019, System Era Softworks and Full Ove...",
    "Meta Description": "Looking for information on ASTRONEER? Check out the release date (Feb 5, 2019), developer insights from System Era Softworks, and a complete game summary.",
    "Alt Text Image": "Official header image for ASTRONEER game - Steam 361420",
    "Canonical URL": "https://gusku.site/game/astroneer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ASTRONEER\", \"description\": \"Looking for information on ASTRONEER? Check out the release date (Feb 5, 2019), developer insights from System Era Softworks, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 5, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"System Era Softworks\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"System Era Softworks\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/361420/header.jpg?t=1656698434\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}