{
    "AppID": 1892620,
    "Name": "CEO",
    "Release date": "May 20, 2022",
    "About the game": "Play the CEO of a multi-national conglomerate and dominate the world's markets. Grow oranges to make orange juice, raise cattle for beef and leather or log timber to make furniture and paper. Take risks by building an expensive mine to get the lithium your batteries need, or monopolize the steel market by buying up all iron deposits. Sell cheap imports or research your own assembly lines to make high quality goods. Advertise your products to attract the rich consumers who care less about price or invest in training to reduce your manufacturing costs. Do you have what it takes to best the other conglomerates fighting for dominance? Complex simulation of a business environment Huge variety in products Scenarios with leaderboard Sandbox game with your own rules and goals Play against AI competitors or up to 5 friends World with multiple regions that react to player's actions Farming Build farms to grow crops like cotton and rubber and raise livestock to provide leather, wool and more. Raw Materials Build mines, logging camps and oil wells to extract iron, timber, oil and other natural resources. These resources are limited in availability and must be acquired at an auction. Process your raw materials into intermediate products like steel, paper and plastics in your factories. Manufacturing Build more factories to combine all of this into consumer products ranging from cat litter and beef jerky to desktop computers and electric cars. Build R&amp;D labs to improve your manufacturing standards and beat your competition by having the highest quality products. Retailing Spend money on advertising and manufacture quality products to gain awareness and loyalty and beat your competition by having the best brand. Train your employees to increase their efficiency and beat your competition on price by having the lowest production costs.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1892620/header.jpg?t=1653068916",
    "Price": 17.99,
    "Developers": "Salty Olives",
    "Publishers": "Salty Olives",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1892620/ss_4fd33287476702a85189484aed909d0005b8741b.1920x1080.jpg?t=1653068916,https://cdn.akamai.steamstatic.com/steam/apps/1892620/ss_03990cecede6a88a65df3750c248930366bd8abc.1920x1080.jpg?t=1653068916,https://cdn.akamai.steamstatic.com/steam/apps/1892620/ss_5a7e3da580857df2c663e8614f1d93be6be2292a.1920x1080.jpg?t=1653068916,https://cdn.akamai.steamstatic.com/steam/apps/1892620/ss_504effa001010dc09776892e3c614b98a3067184.1920x1080.jpg?t=1653068916,https://cdn.akamai.steamstatic.com/steam/apps/1892620/ss_01c06e334ac64042f651da56d4d34828e2f9c334.1920x1080.jpg?t=1653068916",
    "Slug": "ceo",
    "Meta Title": "CEO: May 20, 2022, Salty Olives and Full Overview",
    "Meta Description": "Looking for information on CEO? Check out the release date (May 20, 2022), developer insights from Salty Olives, and a complete game summary.",
    "Alt Text Image": "Official header image for CEO game - Steam 1892620",
    "Canonical URL": "https://gusku.site/game/ceo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CEO\", \"description\": \"Looking for information on CEO? Check out the release date (May 20, 2022), developer insights from Salty Olives, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Salty Olives\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Salty Olives\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1892620/header.jpg?t=1653068916\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}