{
    "AppID": 347170,
    "Name": "Combat Air Patrol 2: Military Flight Simulator",
    "Release date": "Jun 6, 2016",
    "About the game": "Feel the power of flying the AV8B Harrier II. A flight and naval combat simulator with mission planner and fully dynamic open ended campaign. CAP2 is a middle ground simulator , you won't need to read a 300 page manual to get off the ground, nor will you be carrying dozens of missiles when you fire it up. Key Features - All of the features listed here are currently available unless otherwise stated. They are perhaps not 100% polished (after all its EA!) but enough to give players an idea of where the game is heading. AV-8B HARRIER II 3D Cockpit: AA and AG radar modes, MFD and HUD displays. Current selectable controls include: water injection, canopy latch, MFD buttons, gear, flap settings and more. Night illumination is also enabled, with separate adjustable lighting for self illuminated instruments and the cockpit floodlights. Current animated controls include: flightstick, throttle and nozzle angle. We plan to make every part of the cockpit selectable during EA. Fuel tanks including associated fuel flow logic and displays, you’ll be able to mod them soon. Weapons: Litening pod, AIM-9 Sidewinder, AIM-120 AMRAAM, AGM-65 Maverick, AGM-84 Harpoon, AGM-88 Harm, MK82 Bomb, MK83 Bomb, MK84 Bomb, LAU76. Air to air refueling: KC767 tanker, realistic hose physics, 3 difficulty levels or toggle to off. Radio comms: Radio exchanges, background chatter and formation control commands. Moddability: Harrier fuselage and cockpit photo is available now. Helmet art and fuel tanks to be added soon. Sound: 3D environmental audio A BEAUTIFUL WORLD 100% BASED ON REALITY Protect the straits of Hormuz and train in some of the most iconic sites across the globe including: Yuma (Arizona), Kaneohe Bay (Hawaii) and The Mach Loop (Wales) Geographically accurate environmental lighting, based on longitude, latitude, date and time. OpenStreetMap data accurately places buildings, vegetation, rail and roads. There are already thousands of objects in game and we are continuously adding more which drop with each new patch. Of course, a host of custom objects are also included, such as: power lines, lighthouses, water tanks, ATC towers, rigs etc. We've recently added lighting to roads, runways, taxiways and buildings, illuminating villages and cities which really adds to immersion. TOD/lighting controls. Once the updated day/night sky shader is complete you'll be able to adjust the full 24hr cycle, plus advancing mission time will be added. Accurate star map &amp; realistic weather effects FULLY DYNAMIC, OPEN ENDED CAMPAIGN Misson Genres: ​Air to air, air to land, maritime, training Mission planner: Control your fleet and air assets, plan your mission waypoints and target ingress/egress together with your fleet formation, route and speed Civilian traffic transit shipping lanes, enter &amp; leave ports ​Please note: mission cycles and planner are currently under priority development and will be finalised soon. VR Oculus Rift, HTC Vive an Open VR compatible headsets MULTI PLAYER CAP2 is currently a single player game, but here's what will be available when we enable MP: Campaign co-op mode: take part in other players campaign missions or ask for help. Fleet vs Fleet: play co-op against an AI fleet or against other players. Send requests or opt for open invitation. ASSETS The following assets are in game now, we plan to add more assets during EA. USS Nassau (LHA-4) with animated elevators, deck crane and deck tugs. Deck crew will be added soon. MiG-21 (Recently improved) F4 Phantoms Fast attack boats Ships &amp; Submarines ​KC767 tanker CONTROLLERS / HARDWARE Flightstick HOTAS Rudder and MFD panel support Gamepad mode Track IR support Supports very wide screen aspect ratios EA player requests - currently under consideration for development AFTER the key features above Falklands campaign, dynamic weather system, additional aircraft Should you buy CAP2 now? If you don’t yet own CAP2 obviously we’d love for you to join the crew. We encourage you to read the above features list carefully, particularly with reference to what's currently enabled so that you have the correct expectation. It's worth remembering that as we add new features and content to CAP2 throughout EA, the price will increase. CAP2 uses a custom built engine that delivers a totally unique, immersive and realistic experience. After initial flight and tactical training you will be pitched into an immersive scenario against aggressive ground, sea and air based enemies. Use the fully articulated cockpit, your skills as a pilot and your tactical awareness to engage in dogfights, carry out ground attacks and command your fleet to ultimately ensure the safety of your comrades and the final capitulation of the enemy. Strategic decisions such as commanding your fleet on the tactical map and your performance in the air will affect the final outcome: Go 'gung ho' with a full out assault and the outcome will be in the balance or plan ahead and the end result will be your ultimate victory!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/347170/header.jpg?t=1583860304",
    "Price": 29.99,
    "Developers": "Sim155 Limited",
    "Publishers": "Sim155 Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_c445fba510141d28011dd95e3926e24cae7834f9.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_d70dc5e3ca3497dae5c259d6f6c86b39e0d7dd59.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_bff39d4aa5a4952c37917db5c63bd51e54cd6c94.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_53139da431b05e2e3c7997be3f687e6198d2aff2.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_b748c23d8376197000df3525b567017ff78a0e67.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_5f6a385eb82b6a161b177ac0c7d66d13ecd710b5.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_d5d2a8af5bd6090c3333064184a31a47d60d2b68.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_dd42bf6842033a19adc582d17f8a4e6b227f2606.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_8eeecf48fdffa7f5b67a795cd4ca049700ed6ef2.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_44fbd5be71dd160e85f26d03eaa4fe9aa7cc5538.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_fb441a31033b7dc6a489bea3cf2eca1037768e0b.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_2f24639da6cce9aa3b34d13a402ab8c365cde8ef.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_19b5093407d3af8a0c2096a45003e0fd81bb4957.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_4e68107e351363a64d7d5e82a457af2a5bfed1d8.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_c3681483a8784ac890165d2c0b0da6d1915307aa.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_61bf458321c8d21cbff36cf08229907551f4f9c5.1920x1080.jpg?t=1583860304,https://cdn.akamai.steamstatic.com/steam/apps/347170/ss_97d8c3cca759b8af75af5b2b2f16028b36b60252.1920x1080.jpg?t=1583860304",
    "Slug": "combat-air-patrol-2-military-flight-simulator",
    "Meta Title": "Combat Air Patrol 2: Military Flight Simulator: Jun 6, 20...",
    "Meta Description": "Looking for information on Combat Air Patrol 2: Military Flight Simulator? Check out the release date (Jun 6, 2016), developer insights from Sim155 Limi...",
    "Alt Text Image": "Official header image for Combat Air Patrol 2: Military Flight Simulator game - Steam 347170",
    "Canonical URL": "https://gusku.site/game/combat-air-patrol-2-military-flight-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Combat Air Patrol 2: Military Flight Simulator\", \"description\": \"Looking for information on Combat Air Patrol 2: Military Flight Simulator? Check out the release date (Jun 6, 2016), developer insights from Sim155 Limi...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 6, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sim155 Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sim155 Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/347170/header.jpg?t=1583860304\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}