{
    "AppID": 1087530,
    "Name": "Crazy World",
    "Release date": "Dec 21, 2021",
    "About the game": "About Crazy World: Sent to Earth to live as a human during a time of political and technological upheaval, your mission is to save human kind from a evil parasitical force which threatens to destroy mankind. It has turned society upside down, welcome to Crazy World. Crazy World is an open-world life sim in a procedurally generated World. Unlike any RPG game you have ever played. Limitless freedom of gameplay. You can become anything you want to be, from a criminal to a businessman. Join factions and fight other factions. You start off getting thrown out of the house by your drunk stepfather and you must then survive on your own. You can get a job, commit crimes, and later buy businesses, properties and even invest in the stock market. Choose from 21 different characters and try to earn a living, while at the same time investigating and taking down an evil cult. Here are some of the included features of the game; -9 different starting classes - Pyscho Brute, Genius, Artist, Techie, Entrepreneur, Socialite, Drug Dealer, Outcast(Dual class artist and fighter) and Weirdo(dual class techie and fighter). -Procedurally (randomly) generated cities, country, city districts and buildings. Each time you start a new game the world will be different. -Many Different occupations including fast food, banks, supermarkets, malls, car dealerships, factories, pawn shops, book stores, bars &amp; liquor stores. The jobs are based on mental 'battles' with hilarious customer situations and events such as disputes and complaints. You can progress in the jobs and get promotions and raises. -Join groups and gangs, including; the government, CIA, Freemasons, Crips, Bloods, Hippies, Freedom Fighters and Religious Extremists. You can join these groups and go on missions from them, gain ranks and get allies and team members. -Reputation system; in the game you have reputations with the different factions which are affected by your actions in the game. This allows for a lot of possibilities with playing off of the rivalries between groups. The game changes as your reputation levels change. -Dynamic economy. The game uses a economy which will be different from game to game and which changes as you play the game. This affects housing prices, job opportunities and the stock market. -Buy real estate. You can buy, rent and sell houses and apartments. These are randomly generated places which you can choose to live in or you can rent them out or sell for a profit. -Negotiations and Mental battles. Not all battles in this game are physical the game has situation where you must use your characters mental abilities for situations such as job interviews, working on the job and negotiations. - Over 150 character abilities. As your character gains experience you will unlock new abilities, both physical and mental. -Over 80 weapons and armor choices. Everything from golf clubs to chainsaws to fully automatic machine guns. -Character development; Your character will grow based on your actions in the game. It is very open ended so they become what you make of them. You can use books or enroll in college to boost your characters mental abilities and employment opportunities, or on the other hand you could join a gang and gain fighting abilities or even become a pimp and grow an empire of ho's! -Criminal mode; You can flip on 'criminal mode' at anytime in the game and this opens up new options for your interactions with characters in the game. -Stock market: invest money in gold, oil , company stocks or treasury bonds. Read the news and learn about events which effect the market and profit off of the changes in the game's economic market system. -Gain friends and allies; in the game you will meet characters who can join your group. You can then call them on the phone in the game to join anytime. (If they feel like it!) -Addiction system; use substances to enhance your abilities but beware you can get addicted and then possibly suffer penalties from withdraw until you kick the habit. -Business ownership; You can buy many of the business in the game and earn money each month off of their profits. Owning the business will also open up new in game events.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1087530/header.jpg?t=1640109275",
    "Price": 9.99,
    "Developers": "Daniacea Games",
    "Publishers": "Daniacea Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1087530/ss_85a9ad8b8c3be3d945bbccf3c5e233a476164d07.1920x1080.jpg?t=1640109275,https://cdn.akamai.steamstatic.com/steam/apps/1087530/ss_239440f34400ab68755bb72adab5a2225a5b8c6c.1920x1080.jpg?t=1640109275,https://cdn.akamai.steamstatic.com/steam/apps/1087530/ss_69802c817b874fa8b0416932d3e675dca67a4cd0.1920x1080.jpg?t=1640109275,https://cdn.akamai.steamstatic.com/steam/apps/1087530/ss_94573bf276d79b9a39594fa790f2c2497521b3df.1920x1080.jpg?t=1640109275,https://cdn.akamai.steamstatic.com/steam/apps/1087530/ss_78e86003009f7ac5c6a7030e4df4548801441fb5.1920x1080.jpg?t=1640109275,https://cdn.akamai.steamstatic.com/steam/apps/1087530/ss_8a1d0ff470bed6c8d1b932f5eac95ce8909e5e4f.1920x1080.jpg?t=1640109275,https://cdn.akamai.steamstatic.com/steam/apps/1087530/ss_bba64feafa4e47a6f51569c20e5ee9826c62f61c.1920x1080.jpg?t=1640109275,https://cdn.akamai.steamstatic.com/steam/apps/1087530/ss_aef02c898f6910eb1c52d6a365a419642a69e3a2.1920x1080.jpg?t=1640109275,https://cdn.akamai.steamstatic.com/steam/apps/1087530/ss_4f0b3f9511801e5181d74f179c3ae69245090a6c.1920x1080.jpg?t=1640109275,https://cdn.akamai.steamstatic.com/steam/apps/1087530/ss_44019a0b68c261ca869c5698b79d0d827461cb9e.1920x1080.jpg?t=1640109275",
    "Slug": "crazy-world",
    "Meta Title": "Crazy World: Dec 21, 2021, Daniacea Games and Full Overview",
    "Meta Description": "Looking for information on Crazy World? Check out the release date (Dec 21, 2021), developer insights from Daniacea Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Crazy World game - Steam 1087530",
    "Canonical URL": "https://gusku.site/game/crazy-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crazy World\", \"description\": \"Looking for information on Crazy World? Check out the release date (Dec 21, 2021), developer insights from Daniacea Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Daniacea Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Daniacea Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1087530/header.jpg?t=1640109275\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}