{
    "AppID": 1367880,
    "Name": "Critterland",
    "Release date": "Aug 15, 2020",
    "About the game": "Critterland is a fast-paced 2D real-time strategy (RTS) game that pits you against the forces of nature. Spawn, adapt, and amass your army of plants, herbivores, and carnivores, discovering new strategies and ecological dynamics. in Critterland, you design and place critters of various species, and select adaptations for those critters as you build and place each critter in the style of a role-playing game. Each critter reproduces, creating new lineages that interact with the others in the world. Your goal is to find synergies between your species that achieve gameplay objectives. Play Modes Critterland has two play modes: Campaign Sandbox The Critterland campaign is a sequence of increasingly complex puzzle-like levels where you must discover synergies between species to achieve objectives in the world, such as surviving an onslaught of invasive species or living through an apocalyptic volcano eruption. Critters There are several types of critters: Plants Herbivores Decomposers Carnivores Each category of critters (plants, herbivores, decomposers, and carnivores) has a unique set of adaptations that you design so that each species offers different gameplay dynamics. For example, decomposers eat dead critters, while plants can be upgraded to eat other critters. Adaptations Use the Critter builder to select adaptations for individual Critters and place them on the map, where they will spontaneously move and interact with other critters. Once you have a feel for the gameplay dynamics, you can experiment with the sandbox mode to find even stranger ecological equilibria. Critters eat each other according to the familiar food chain. However, you can invert this food chain in certain ways, such as giving a plant lineage the Carnivorous adaptation to turn the tables on the herbivores! As critters digest, they leave behind poop. If you design critters that can eat poop, then wonderful synergies may emerge. Each category of critters (plants, herbivores, and carnivores) has a unique set of adaptations. For example, herbivores can have the Assertive adaptation which gives them the ability to push away Carnivores seeking to eat them. Likewise, plants can have Drifting Seeds , enabling them to reproduce across the land beyond the reach of the landlubbers who strive to eat them. The in-game adaptation wheel offers even more choices and specializations of each adaptation. Experiment and see which combos you enjoy most! Music Critterland's campaign offers an atmospheric original soundtrack (OST), also available on Steam. Fact If nothing else, remember this: wombats poop cubes.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1367880/header.jpg?t=1597974587",
    "Price": 0.0,
    "Developers": "Kendall Zhu,Richard Amankwaa,Saketh Rama",
    "Publishers": "Kendall Zhu,Richard Amankwaa,Saketh Rama",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1367880/ss_e7a077f604559a9a7e9c5573b11d80b5f1cc31f0.1920x1080.jpg?t=1597974587,https://cdn.akamai.steamstatic.com/steam/apps/1367880/ss_5fda96af9700b47730eebccb388a5d0e094feaed.1920x1080.jpg?t=1597974587,https://cdn.akamai.steamstatic.com/steam/apps/1367880/ss_7904b09a9f41910cc5613767dd96e4c78ac20bf3.1920x1080.jpg?t=1597974587,https://cdn.akamai.steamstatic.com/steam/apps/1367880/ss_5f8257574b048a3cf89f5cac2691afe0d8e193c0.1920x1080.jpg?t=1597974587,https://cdn.akamai.steamstatic.com/steam/apps/1367880/ss_93196695c3d8d62efb0483bf3188f46a7e39e0ea.1920x1080.jpg?t=1597974587,https://cdn.akamai.steamstatic.com/steam/apps/1367880/ss_4a6401977df927d6a54e7303b429c03dfc6aa44e.1920x1080.jpg?t=1597974587",
    "Slug": "critterland",
    "Meta Title": "Critterland: Aug 15, 2020, Kendall Zhu,Richard Amankwaa,S...",
    "Meta Description": "Looking for information on Critterland? Check out the release date (Aug 15, 2020), developer insights from Kendall Zhu,Richard Amankwaa,Saketh Rama, and...",
    "Alt Text Image": "Official header image for Critterland game - Steam 1367880",
    "Canonical URL": "https://gusku.site/game/critterland",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Critterland\", \"description\": \"Looking for information on Critterland? Check out the release date (Aug 15, 2020), developer insights from Kendall Zhu,Richard Amankwaa,Saketh Rama, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 15, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kendall Zhu,Richard Amankwaa,Saketh Rama\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kendall Zhu,Richard Amankwaa,Saketh Rama\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1367880/header.jpg?t=1597974587\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}