{
    "AppID": 679550,
    "Name": "CyberLink PhotoDirector 9 Ultra",
    "Release date": "Oct 6, 2017",
    "About the game": "PhotoDirector For Travel Believe it or not, creating great travel shots isn't that hard. And you don't need expensive cameras and lenses. PhotoDirector's one-click presets instantly improve your images. Total 360º Photo Editing NEW PhotoDirector makes it easy to create spectacular images with photos taken using 360º cameras. It's a whole new perspective on movie photography. Your Own Little Planet Turn your photos into a world of their own in just a few quick clicks with the new Little Planet feature. Watch the demo video above to see just how easy it is. Panoramas from 360º Shots Creating panorama images has never been easier. With a 360º image and PhotoDirector you're well on your way to creating truly panoramic shots. Hide Tripods Ensure that your 360º photos are picture perfect. Cover your tripod or selfie-stick with a range of options so they don't distract from the focus of your image. Intelligent Content-Aware Editing Remove objects or people from photos simply by brushing over them or move objects from one part of a shot to another. PhotoDirector instantly fills spaces using an intelligent algorithm that blends perfectly with the surrounding background. One-click Presets Create impressive photos with creative presets featuring HDR, black &amp; white, and split tone ranges as well as presets designed for portraits &amp; landscapes. Photos with Motion Motion Stills are an amazingly creative twist on standard photographs. Brush over sections of a video clip to retain movement in that area only. Other parts appear frozen in time! Stunning photos from video Now you can take the perfect picture from your videos. With just a click you can capture a razor-sharp still image that you can use to create your own perfect timelapse, group photo, multi-exposure or layered image. PhotoDirector For Landscapes Give yourself the best chance of landing great photos with PhotoDirector's easy-to-use tools for creativity and correction in landscape projects. Layer Editing Made Easy Express Layer Templates contain all the layer components that make up complex images. They're not only an easy way to put together stunning images, but also help to show how layers combine to produce photographic effects. More Blending Modes NEW Blending layers offers amazing creative possibilities for combining multiple photos into a single breathtaking image in a way that is effortless. Sharper Images. Better Clarity. NEW Strip away haze, fog and smog to reveal crisp, clear landscapes with the intuitive Dehaze slider. For a truly professional touch use the Defringe tool to get rid of distracting color fringes in your digital photography for a sharper look. Artistic Overlays Combine semi-transparent images with your photos to create unique shots instantly. Raw Format Support PhotoDirector not only supports JPEG and TIF files, but also a broad range of popular and proprietary RAW file formats from the world’s leading digital camera manufacturers. PhotoDirector for Family Memories While there are hundreds of family photo ideas out there, your family is one of a kind. PhotoDirector is designed to help you create stunning family memories, unique to you. Perfect Group Photos Everytime Use Video-to-Photo Face Swap to instantly create perfect group photos from video footage. Ensure everyone is smiling, and all eyes are open! More Lens Profiles PhotoDirector supports an ever-growing collection of more than 100 lens profiles that allows it to quickly and accurately fix common lens flaws. Create Your Own GIFs NEW Animated GIFs are a fun way to turn videos into short, creative images. They're perfect for sharing short clips on social media like Facebook, or can also be used on web pages and blogs to create more engaging content. Easier Photo Management IInstantly identify people in photos, then sort and store them for easy browsing later. Intelligently Fix Photos Fast Automatically redistribute the tonal values in an image and get rid of unwanted color casts. PhotoDirector For Portraits PhotoDirector is packed with unique portrait tools that help bring out your subject's unique characteristics, turning average photos into exceptional ones. Radiant Skin Make every face perfect with skin smoothening to remove wrinkles, blemish, shine, eye bags and red eye removal. Face Retouching Take off extra pounds with an easy slider to reshape faces for a slimmer look. Enlarge the eyes too for added attraction. Adjust Skin Tone Intelligently adjust skin tone in your portraits for the look you are after. Give your subjects healthier looking skin or a perfect tan in moments. Body Reshaper Tool Unique Body Shaper tool lets you quickly apply adjustments to the body’s natural contours. Give your photo shoots a professional feel.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/679550/header.jpg?t=1574186434",
    "Price": 0.0,
    "Developers": "CyberLink",
    "Publishers": "Koch Media,CyberLink",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/679550/ss_da1652b82b13221e908105268159f929ab3f351e.1920x1080.jpg?t=1574186434,https://cdn.akamai.steamstatic.com/steam/apps/679550/ss_b3486ebc392fa124b97948a566403d393e468ae0.1920x1080.jpg?t=1574186434,https://cdn.akamai.steamstatic.com/steam/apps/679550/ss_7d94d626ee7cbc5d3c0e55eea3f6a83ceb7e7796.1920x1080.jpg?t=1574186434,https://cdn.akamai.steamstatic.com/steam/apps/679550/ss_9db655f9386ef9e82c0107c3a971b25685d182b9.1920x1080.jpg?t=1574186434,https://cdn.akamai.steamstatic.com/steam/apps/679550/ss_512e6e188d68708194f71ae2cc9ef38b57ed7023.1920x1080.jpg?t=1574186434,https://cdn.akamai.steamstatic.com/steam/apps/679550/ss_8384cf9aca9351a4d305356d5f50f2df9f47e5fc.1920x1080.jpg?t=1574186434,https://cdn.akamai.steamstatic.com/steam/apps/679550/ss_b4c519ec6eb3905b533cc3b8d4e640fd105a7edf.1920x1080.jpg?t=1574186434",
    "Slug": "cyberlink-photodirector-9-ultra",
    "Meta Title": "CyberLink PhotoDirector 9 Ultra: Oct 6, 2017, CyberLink a...",
    "Meta Description": "Looking for information on CyberLink PhotoDirector 9 Ultra? Check out the release date (Oct 6, 2017), developer insights from CyberLink, and a complete ...",
    "Alt Text Image": "Official header image for CyberLink PhotoDirector 9 Ultra game - Steam 679550",
    "Canonical URL": "https://gusku.site/game/cyberlink-photodirector-9-ultra",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CyberLink PhotoDirector 9 Ultra\", \"description\": \"Looking for information on CyberLink PhotoDirector 9 Ultra? Check out the release date (Oct 6, 2017), developer insights from CyberLink, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 6, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberLink\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Koch Media,CyberLink\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/679550/header.jpg?t=1574186434\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}