{
    "AppID": 405500,
    "Name": "Dangerous Golf",
    "Release date": "Jun 2, 2016",
    "About the game": "Mixing arcade style high score gameplay with humorous irreverence, Dangerous Golf isn't about Par or Birdie. The aim of the game is to cause maximum damage over 100 holes and four unusual locations. Smash up the toilets, make a big mess in the Kitchen, destroy priceless antiques in the Palace. This is golf played indoors where the more expensive the object the higher its game value. Humorous destruction and over the top trickshots are the way to score big. Destroy enough things off the Tee and you’ll earn a SmashBreaker. This turns your Ball into a Fireball that you can steer around the level causing more destruction and chaos. The bigger the mess, the bigger the Score. Long shots, Ricochets and yet more Destruction are the name of the game when Putting. Hitting your ball straight into the hole is NOT what Dangerous Golf is about and whilst you can do that it won’t earn you the big medals or help you beat your Friends to the top of the Leaderboards. If you buy and play our game … thank you .. and we hope you have fun. We are supported 100% by our players, no corporate or VC safety nets here. So if you experience any problems at all please tell us – so we can have a go at fixing whatever problem it is you’re having. We are a team that loves to listen to our players and we strive to do better every day. Details at / . Four Ways to Play World Tour - 10 tours, 10 holes in each. As you progress you unlock new locations and extra Abilities that'll help you do even more Damage. Coop World Tour – Play the World Tour co-operatively with a friend or family member. This is the perfect couch Co-op experience. Both players play sequentially into the same scene making it the perfect game for players of mixed ability. One or more controllers. Party Golf (Offline) – Local competitive pass-the-pad Party Golf mode for 4 players. Use one or more controllers, all sign in with your profiles or play as guests, this is the perfect game to put on when your friends come round. Party Golf (Online) – Take on and play against the most dangerous golfers in the world. Up to 8 Players. Four Unique Locations USA – Kitchen – Make a huge mess in the Kitchen. Splat food onto the walls and floor, break Microwave Ovens and Dishwashers. Break open the Store Room, access the Back Alley and trash the Bathroom. England – Castle - Cause chaos in the Castle. Knock down the suits of Armour, spill paint onto works of art and smash priceless antiques. Explore the Dungeon, Armoury, Queens Corridor and redecorate the Great Hall. France – Palace - Let them eat cake – but only after you’ve knocked it all to the floor. Break bottles, vases, tables, grand pianos and grandfather clocks. Drop down to the Wine Cellar, make a noise in the Library or break into the Secret Vault. Australia – Disturb the peace and serenity of the Outback. Set fire to the pumps, break all the windows and run riot in the store. Tee Off on the Forecourt, make work for somebody in the Workshop, spray paint in the Paint Shop, rock the Rooftop and light up the Alleyway.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/405500/header.jpg?t=1626416166",
    "Price": 19.99,
    "Developers": "Three Fields Entertainment",
    "Publishers": "Three Fields Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/405500/ss_39b020bf7899b10638fff54c190c478bedc753f9.1920x1080.jpg?t=1626416166,https://cdn.akamai.steamstatic.com/steam/apps/405500/ss_0b3d3774069e2caf8cc8ad3f2507ef99ac3eb236.1920x1080.jpg?t=1626416166,https://cdn.akamai.steamstatic.com/steam/apps/405500/ss_3b8743722f845bf5841cb102f7389ca1d8289755.1920x1080.jpg?t=1626416166,https://cdn.akamai.steamstatic.com/steam/apps/405500/ss_c25e86c154f2c50bed07cbff3a39b980e7ab2ee2.1920x1080.jpg?t=1626416166,https://cdn.akamai.steamstatic.com/steam/apps/405500/ss_32dc5b2e990f949cca26525cf76d35544d79caaf.1920x1080.jpg?t=1626416166,https://cdn.akamai.steamstatic.com/steam/apps/405500/ss_1847546ce1153e5be6db2508cce6b61e367e5493.1920x1080.jpg?t=1626416166,https://cdn.akamai.steamstatic.com/steam/apps/405500/ss_70f400204d6f7dc863cd197984c2988926ad274c.1920x1080.jpg?t=1626416166,https://cdn.akamai.steamstatic.com/steam/apps/405500/ss_aab9e4e9414f3b56abe67eac7ea925cd91004117.1920x1080.jpg?t=1626416166,https://cdn.akamai.steamstatic.com/steam/apps/405500/ss_3827f812ffb253b8b09a28763fc6987493425ab1.1920x1080.jpg?t=1626416166,https://cdn.akamai.steamstatic.com/steam/apps/405500/ss_0977bff7f0ba7e98c511e957836f6b3395b0bde4.1920x1080.jpg?t=1626416166",
    "Slug": "dangerous-golf",
    "Meta Title": "Dangerous Golf: Jun 2, 2016, Three Fields Entertainment a...",
    "Meta Description": "Looking for information on Dangerous Golf? Check out the release date (Jun 2, 2016), developer insights from Three Fields Entertainment, and a complete ...",
    "Alt Text Image": "Official header image for Dangerous Golf game - Steam 405500",
    "Canonical URL": "https://gusku.site/game/dangerous-golf",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dangerous Golf\", \"description\": \"Looking for information on Dangerous Golf? Check out the release date (Jun 2, 2016), developer insights from Three Fields Entertainment, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 2, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Three Fields Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Three Fields Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/405500/header.jpg?t=1626416166\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}