{
    "AppID": 601530,
    "Name": "Darkarta: A Broken Heart's Quest Collector's Edition",
    "Release date": "Mar 8, 2017",
    "About the game": "HOW FAR WILL YOU GO TO SAVE YOUR ONLY DAUGHTER FROM DEATH? ⭐ The 'GAME OF MOTHERHOOD &amp; TRUE LOVE' was CLASSIC HIT RANK 1 in both PC &amp; Mac markets (Bigfishgames) ⭐ Grabbed over 10 INTERNATIONAL AWARDS ( Includes Game Connection America, Indigo Europe, Casual Connect Asia ) AN UNTOLD SAGA OF TRUE LOVE from the game house of Tuttifrutti Interactive . DARKARTA: A BROKEN HEART'S QUEST(Collector's Edition) ‘Darkarta’ is the frantic quest of a mother in search of her kidnapped daughter along the enchanted valleys of forgotten Indus civilization. Like all moms, for Mary her daughter Sophia was everything. Mary came with her husband and daughter to these remote isles, in search of her long lost family roots. She never knew the story of her dark past until the day she received that strange, mysterious letter. In a fraction of second, her life is shattered forever! Broken &amp; betrayed, she is forced to step onto a game of life and death, where danger is awaiting her in every corner! You are Mary on this journey. Enter the enchanted 'Netherworld' where your destiny is written in blood and which whispers of true love. 3700 years have gone by, but even time could not heal it… The sweetest songs are those that sing of broken hearts... WHAT CAN YOU EXPECT? (Did you hear us say, hmm...unique features?? ) ⭐ AN EXCITING JOURNEY THROUGH THE LOST CIVILIZATION OF THE INDUS VALLEY The game was inspired by Indus fantasy mythologies/epics and the philosophy of ‘reincarnation’. Mysterious twists and turns await you and your journey unravels an unexplored, magnificent fictional world! ⭐ THE GAME OF MOTHERHOOD, AGAINST RACISM! One of the best adventure games about motherhood, an untold saga of true love. It’s also about the ‘lost &amp; forgotten lives’ of star crossed lovers, torn apart from each other by the racist world! Darkarta raises voice against the most prevailing evil of all times, ‘racism’ upholding humanity. ⭐ UNFORESEEN ENVIRONS WITH 5-6 HRS OF GAME PLAY Critically acclaimed artistry! Breath-taking visuals! Very detailed scenes with non-repetitive puzzles. ⭐ PREQUEL COMIC BOOK A beautifully illustrated comic book with the backstory of the main plot. ⭐ BONUS CHAPTER: “RISING OF THE PHOENIX” The player gets the freedom of playing in ‘GOD’ mode in the bonus chapter for the Collector’s Edition. ⭐ MOM'S DIARY PAGES The memories, thoughts, and even actions of Mary are carefully crafted on the diary pages. It also has a detailed character sketch, list of objectives to accomplish, and the route map which shows your current position in the game. ⭐ 30 NOSTALGIC MEMORY COLLECTIBLES You may collect precious, valuable &amp; nostalgic memories on your way or after the gameplay. ⭐ 36 HALL OF FAME MEDALS Bag all the titles from our original and authentic ‘Hall of Fame’ list and make us proud! ⭐ 28 MORPHING OBJECTS Collect morphing objects on your go or after! ⭐ CONCEPTS, WALL PAPERS &amp; SOUND TRACKS Mesmerizing music would make you feel like heaven! ⭐ REPLAY MINI GAMES/HOP/CUT-SCENES As you dive into the bewitched 'Netherworld', fear of the unknown or fear of the unexpected, what will stop you? If it is to save your one and only daughter, how far will you go? FOLLOW US HERE: Facebook - / Twitter - Instagram - Pinterest- / Linkedin - -interactive/",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/601530/header.jpg?t=1637127892",
    "Price": 9.99,
    "Developers": "Tuttifrutti Interactive",
    "Publishers": "Tuttifrutti Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/601530/ss_249cd0be8672770a35e5b2edf4fbcf467e3ee6c3.1920x1080.jpg?t=1637127892,https://cdn.akamai.steamstatic.com/steam/apps/601530/ss_c0af741108222e8066c2670c376892f3833f197b.1920x1080.jpg?t=1637127892,https://cdn.akamai.steamstatic.com/steam/apps/601530/ss_ffd6cd136ce458b24621099d17fca852a8f1174d.1920x1080.jpg?t=1637127892,https://cdn.akamai.steamstatic.com/steam/apps/601530/ss_3ba164b76c68b2bb44cd66512382b1fa6b7eec26.1920x1080.jpg?t=1637127892,https://cdn.akamai.steamstatic.com/steam/apps/601530/ss_e5b71b42b83765789a88c5348945ad0d79e665d6.1920x1080.jpg?t=1637127892,https://cdn.akamai.steamstatic.com/steam/apps/601530/ss_6cfafff367589dfcf36177287a931d4d1e70c03e.1920x1080.jpg?t=1637127892,https://cdn.akamai.steamstatic.com/steam/apps/601530/ss_cc05ae9e16bfc5067e3458b1a91960f0c5b6d0d8.1920x1080.jpg?t=1637127892,https://cdn.akamai.steamstatic.com/steam/apps/601530/ss_2e07ad998e221bea937b9c1cd502c335dcb91efe.1920x1080.jpg?t=1637127892,https://cdn.akamai.steamstatic.com/steam/apps/601530/ss_7f25f25828c32c959a2235ae9838bcfea4c11be8.1920x1080.jpg?t=1637127892",
    "Slug": "darkarta-a-broken-heart-s-quest-collector-s-edition",
    "Meta Title": "Darkarta: A Broken Heart's Quest Collector's Edition: Mar...",
    "Meta Description": "Looking for information on Darkarta: A Broken Heart's Quest Collector's Edition? Check out the release date (Mar 8, 2017), developer insights from Tutti...",
    "Alt Text Image": "Official header image for Darkarta: A Broken Heart's Quest Collector's Edition game - Steam 601530",
    "Canonical URL": "https://gusku.site/game/darkarta-a-broken-heart-s-quest-collector-s-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Darkarta: A Broken Heart's Quest Collector's Edition\", \"description\": \"Looking for information on Darkarta: A Broken Heart's Quest Collector's Edition? Check out the release date (Mar 8, 2017), developer insights from Tutti...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 8, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tuttifrutti Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tuttifrutti Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/601530/header.jpg?t=1637127892\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}