{
    "AppID": 455720,
    "Name": "Dolphin Defense",
    "Release date": "May 16, 2016",
    "About the game": "Start at the DOLPHINVERSE: a hub for different games and experiences within Dolphin Defense LAB This area has arcade machines you can use to access new areas. Right now you can go to SUNSETあの日 and Tunnel Force Vortex (TFV). The sunset is a place to relax for a while. The clouds slowly change and there are some things to explore and see. TFV is an arcade-style game where you try and get a full combo while swinging your arm to move your player smoothly around the inside of a tunnel. The visuals become more intense as you get multiplier power-ups. It's made to be played with the included music or your own playlists using separate headphones. DOLPHIN DEFENSE Take on the role of a Dolphin Defense Department (DDD) staffer by dropping, dripping, throwing, and shooting balls containing jetpacks through time and space. With a lot of skill and a little bit of luck, these jetpacks will help dolphins get out of sticky situations. As you save more dolphins you'll be able to travel deeper into the DDD's 4th Dimension Outpost. Your colleagues Saki, Pepper, and Julius will befriend you and help you out. After all saving dolphins is hard work, but it's all in a days work for you. This game has 20 levels called zones and some extras. At the beginning you have access to a field-training tutorial that will teach you the basics and 3 zones that you can play. As you save dolphins in each zone you will unlock access to more waypoints that you can teleport to. New waypoints will have more zones and new interactions with characters. You have the opportunity to save 3, 5, or 10 dolphins in each zone. The number of dolphins you save depends on your score. Your score is computed differently for each level but usually consists of balls through rifts, rifts hit, and/or cubes hit multiplied together. Diversity in maximizing the various components in each zone is key to getting higher scores. Your scores are compared against the tiers shown on the screen in the results scene. Check the Action Board at the beginning to see how many dolphins you’ve saved in each zone and what your next objective is. The story unfolds a little more at each new waypoint. At first the characters are focused on explaining how to play the game, but after a few waypoints the dialogue shifts to giving you insight into their world. If you are confused on how to get a higher score on a zone then read the debrief that is available on the menu before you enter the zone. Most zones require skill and practice to get familiar with what you need to do to win and many zones have an element of randomness so your experience will be slightly different each time you play. Seated/Standing Dolphin Defense is now playable for seated and standing players! The Dolphinverse, SUNSETあの日, and Tunnel Force Vortex are the most suitable for seated and standing players, but I have also added the ability to increase the number of dolphins you have saved in Dolphin Defense so that new areas can be accessed more easily. Some levels will still be difficult to play while seated or standing, but anyone who wishes may bypass those and still have a full experience. Theme Song Lyrics Can't you see I'm waiting for you You and me Have so much to do If I'm gone The world will be a darker place Come on Give it your all We've got to Save the Dolphins We've got to La la la la love the Dolphins We've got to La la la la love the Dolphins Come with me We'll save the dolphins One two three No need to be twins If I'm gone The world will be a darker place Come on Give it your all We've got to Save the Dolphins We've got to La la la la love the Dolphins We've got to La la la la love the Dolphins Save them!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/455720/header.jpg?t=1552492730",
    "Price": 0.0,
    "Developers": NaN,
    "Publishers": NaN,
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/455720/ss_861b391b0485da01c78d45683de8af15739f5e18.1920x1080.jpg?t=1552492730,https://cdn.akamai.steamstatic.com/steam/apps/455720/ss_7ebee1a75e782f95611fec67c72d8e9fc9d20862.1920x1080.jpg?t=1552492730,https://cdn.akamai.steamstatic.com/steam/apps/455720/ss_64f55b2ed6c63bfb763306abc5b42354ef613ce2.1920x1080.jpg?t=1552492730,https://cdn.akamai.steamstatic.com/steam/apps/455720/ss_71b16c6f954cb851634884da0475a7d234694977.1920x1080.jpg?t=1552492730,https://cdn.akamai.steamstatic.com/steam/apps/455720/ss_39a6b783ba77035b2e4ff1dc7cefd7c6794cea89.1920x1080.jpg?t=1552492730,https://cdn.akamai.steamstatic.com/steam/apps/455720/ss_4e10cac55ab004918f3f557256a9f3e760cd472e.1920x1080.jpg?t=1552492730,https://cdn.akamai.steamstatic.com/steam/apps/455720/ss_bdef42f2b8d37e8e96f7aaff8119dd5a730d0226.1920x1080.jpg?t=1552492730,https://cdn.akamai.steamstatic.com/steam/apps/455720/ss_8001afd180da8a7cc93c63a334f7ea555dc7bd40.1920x1080.jpg?t=1552492730",
    "Slug": "dolphin-defense",
    "Meta Title": "Dolphin Defense: May 16, 2016, nan and Full Overview",
    "Meta Description": "Looking for information on Dolphin Defense? Check out the release date (May 16, 2016), developer insights from nan, and a complete game summary.",
    "Alt Text Image": "Official header image for Dolphin Defense game - Steam 455720",
    "Canonical URL": "https://gusku.site/game/dolphin-defense",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dolphin Defense\", \"description\": \"Looking for information on Dolphin Defense? Check out the release date (May 16, 2016), developer insights from nan, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 16, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": NaN}, \"publisher\": {\"@type\": \"Organization\", \"name\": NaN}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/455720/header.jpg?t=1552492730\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}