{
    "AppID": 1834820,
    "Name": "First Bite",
    "Release date": "Feb 13, 2022",
    "About the game": "ONE NIGHT. THREE VAMPIRES. MAKE A DEAL WITH DEATH OR DIE TRYING. What would you do if you had the chance at a second life, after death? Put your destiny in the hands of three centuries-old vampires in this LGBTQ+ dark comedy visual novel. Play as Noe, a normal human, fanfic writer, and lover of all things supernatural with a distinct lack of self-preservation, as they take a chance and enter the strange house on Dead End Drive with the hope that the rumors they’ve heard about its inhabitants are true. There they find Laurel, Ilyas, and Valeria, and they quickly discover that there’s no escape, but not all endings are fatal. TREAD LIGHTLY , because there are over 25 ways to die in First Bite, and your journey to immortality won't be a smooth one. If you enjoyed What We Do In The Shadows but wanted it to be just a little bit gayer... this is the game for you. Please note that while the game is rated 18+ there is no full-frontal nudity if that's what you're here for. CHARACTERS Valeria Andrei (She/They) “All I’m thinking about is shredding your throat like barbecue, so talk fast.” She might be the youngest of our trio, but Valeria certainly believes she has the upper hand. But don't let her pretty face fool you, her bite is far worse than her bark. Though... both leave a pretty nasty sting. She's fucked Dracula, likes poetry, cheating at board games, internet shopping, and warm-blooded murder. Laurel Portman (He/They) 'Is there something I can do for you? Yes. Is there something I will do for you? Quite unlikely, but it's worth a shot.' Laurel is pushing 300 and is a lover of Hot Topic, insincerity, and watching their victims bleed out on the floor while they watch TV. He's also a seasoned connoisseur of the backhanded compliment and a force to be reckoned with. Tread lightly. Or not... Ilyas Al-Rai (He/Him) “Desperation makes your blood sweeter, so... beg.” Ilyas is the oldest but definitely not the wisest of the trio, coming in at a solid 2400 years old. Lover of athleisure, Eurodance, lifting weights, and thinking he's the smartest guy in the room. (Spoiler: he's not.) He's big, he's buff, and he's loveable as hell, but you don't want to be his prey. UNLESS... ​FEATURES​ Three vampires to romance Partial voice acting with the talents of Alejandro Saab (Fire Emblem: Three Houses), Jalen Cassell (JoJo's Bizarre Adventure), and Marie Westbrook (Jujutsu Kaisen) Approximately 4 hours playtime across all routes and endings If romance isn't your thing, forge an (albeit cursed) friendship Choose your pronouns and customize your characters name Four collectible CGs 26 potential 'Dead Ends.' Choose your words wisely, or find fangs at your throat A Death Tally to keep track of your failures Multiple potential 'positive' outcomes",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1834820/header.jpg?t=1645035031",
    "Price": 9.99,
    "Developers": "First Bite Games",
    "Publishers": "First Bite Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1834820/ss_f1f41294e2b012359968d64a5a66d5269e04c60e.1920x1080.jpg?t=1645035031,https://cdn.akamai.steamstatic.com/steam/apps/1834820/ss_8892a276524c29e829796949ca5d5578d81255f0.1920x1080.jpg?t=1645035031,https://cdn.akamai.steamstatic.com/steam/apps/1834820/ss_3dc27492696ad838c38eecb9483233e1a4f746da.1920x1080.jpg?t=1645035031,https://cdn.akamai.steamstatic.com/steam/apps/1834820/ss_9587dc163cba342ef3b415335bdd88909558c663.1920x1080.jpg?t=1645035031,https://cdn.akamai.steamstatic.com/steam/apps/1834820/ss_117a8e534a39e60b59967028843dc4d72fc00ecf.1920x1080.jpg?t=1645035031",
    "Slug": "first-bite",
    "Meta Title": "First Bite: Feb 13, 2022, First Bite Games and Full Overview",
    "Meta Description": "Looking for information on First Bite? Check out the release date (Feb 13, 2022), developer insights from First Bite Games, and a complete game summary.",
    "Alt Text Image": "Official header image for First Bite game - Steam 1834820",
    "Canonical URL": "https://gusku.site/game/first-bite",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"First Bite\", \"description\": \"Looking for information on First Bite? Check out the release date (Feb 13, 2022), developer insights from First Bite Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"First Bite Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"First Bite Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1834820/header.jpg?t=1645035031\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}