{
    "AppID": 265000,
    "Name": "FORCED SHOWDOWN",
    "Release date": "Mar 29, 2016",
    "About the game": "'Extremely fun game with constant action and virtually limitless replayability. Every new battle you start is different, there are endless possibilities of deck building with all 4 characters.' - Jyren 'I love this game! I have played many hours of The Binding of Isaac, Terraria, Ziggarut, Rouge Legacy, Risk of Rain and other rouge-likes you probably havent heard of. I have to say this game is among my favorites and its brand new.' - Mîchæl GET FREE DLC FOR ALL OUR GAMES 'I wish I knew how to eloquently express how excellent this game is. It just taps so many buttons for me with the nicely balanced rogue-like, the achievable-yet-challenging unlockables, the genuinely interesting deckbuilding, and satisfying combat.' - John 'It plays like I always felt ARPGs and MOBAs should - skillshots, accuracy, timing and evasion; button mashing and brute-force will get you nowhere in this game.' - Radical 'Venom' Max 'FORCED SHOWDOWN combines everything I like in video games. The combat is skill based and offers on the fly strategy solving skills. It has a great difficulty curve that makes me want to hone my skills to become better as time goes. The card system takes some beats from Hearthstone in how decks are created. Playing cards and combos at the start of each round offers a great way to shake up the rounds.' - It's High Noon 'Gameplay: Amazing Graphics: Godlike Varity: Great' - Carlolz 'There are tons of cards to collect that, besides all the different characters, companions, monsters, arenas, modifiers and whatnot, add to the enormous variety that makes every playthrough feel completely fresh.' - Nachtfischer May you die gloriously and to great applause! Greetings Human and welcome to FORCED SHOWDOWN: 'The only show in the galaxy with lives on the line!' Pick one of the 4 contestants from across the FORCED universe - each a master of their own style of combat - and try to become a superstar of my show, as you battle through worlds of monstrous enemies and face off against epic arena bosses. You may die horribly and repeatedly, but think of your fans and smile for the cameras! Cards boost your action abilities! In my show, you will unlock cards that let you boost your stats and upgrade your abilities differently each battle. Use clever deckbuilding and show off your epic combos! In the end though, it's all up to your own action skills, on the arena floor, to carry you through both times of luck and misfortune. Features Intense singleplayer action gameplay with deckbuilding to upgrade your stats and abilities in new ways each battle. 4 characters with unique attacks and ability sets + unique cards to mutate and upgrade their abilities. (+1 with the Drone Invasion expansion) 150+ cards to unlock and use in your deckbuilding. (all in-game; no microtransactions! ) 60+ quests unlock content and achievements. Dinosaur and dragon companions to unlock and have fight by your side. Fight in 8 different worlds. Encounter 70+ different enemies. 10 bosses for raid-like finales. In higher difficulties, each boss also plays cards against you in arenas. Puffs??? From Roguelike-learner to Super Hardcore: The first game show makes sure new players get a chance to learn. Less than 3% of players are skilled enough to beat the endboss of the third show. 40+ special rules make sure each battle is unique. Discover what they do and learn to handle the challenges. Bonus levels (added in free content update 43) Emblem System: Unlock mastery emblems for each game show that let you play it with added special challenges. The best players in the world can manage 12 mastery points in the toughest game show. The maximum is 30. (added in free content update 42) Daily modes and monthly seasons to test your skills and strategies against the rest of the world, and win awesome prizes!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/265000/header.jpg?t=1560428692",
    "Price": 19.99,
    "Developers": "BetaDwarf",
    "Publishers": "BetaDwarf",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/265000/ss_614bb3d622582114222508342bffd921bb82677c.1920x1080.jpg?t=1560428692,https://cdn.akamai.steamstatic.com/steam/apps/265000/ss_bcf5981afcfd084b2a067c79b47e2b30706b8326.1920x1080.jpg?t=1560428692,https://cdn.akamai.steamstatic.com/steam/apps/265000/ss_d13f3aa1cb75eaf894db8cf70f60fd716edabbbe.1920x1080.jpg?t=1560428692,https://cdn.akamai.steamstatic.com/steam/apps/265000/ss_0ceb56f3827ce890f1ab91121074c3979cec6370.1920x1080.jpg?t=1560428692,https://cdn.akamai.steamstatic.com/steam/apps/265000/ss_48276456a84eb0f34414e6b0e92f8a7baf51b790.1920x1080.jpg?t=1560428692,https://cdn.akamai.steamstatic.com/steam/apps/265000/ss_7ea2f40b89ca47360f51ca9103d899c161d25908.1920x1080.jpg?t=1560428692,https://cdn.akamai.steamstatic.com/steam/apps/265000/ss_4544c6414788b816ceed592812fb5cb2583fe5df.1920x1080.jpg?t=1560428692,https://cdn.akamai.steamstatic.com/steam/apps/265000/ss_4e73f290d1cd169a67e7bba4d0505823f2b91b58.1920x1080.jpg?t=1560428692,https://cdn.akamai.steamstatic.com/steam/apps/265000/ss_4401f64823b0148e05793f8c97da14a47eb89a07.1920x1080.jpg?t=1560428692,https://cdn.akamai.steamstatic.com/steam/apps/265000/ss_4b607a7351416c2798ec27953cc26c809c2b8205.1920x1080.jpg?t=1560428692,https://cdn.akamai.steamstatic.com/steam/apps/265000/ss_9410f66306168ac08b384bd4a4c6166678e96908.1920x1080.jpg?t=1560428692,https://cdn.akamai.steamstatic.com/steam/apps/265000/ss_4459fd70f878492589afa91aa5c0f9ac741b069b.1920x1080.jpg?t=1560428692,https://cdn.akamai.steamstatic.com/steam/apps/265000/ss_b05a7fec692625ca23d4c432c04e08321efad5f3.1920x1080.jpg?t=1560428692",
    "Slug": "forced-showdown",
    "Meta Title": "FORCED SHOWDOWN: Mar 29, 2016, BetaDwarf and Full Overview",
    "Meta Description": "Looking for information on FORCED SHOWDOWN? Check out the release date (Mar 29, 2016), developer insights from BetaDwarf, and a complete game summary.",
    "Alt Text Image": "Official header image for FORCED SHOWDOWN game - Steam 265000",
    "Canonical URL": "https://gusku.site/game/forced-showdown",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"FORCED SHOWDOWN\", \"description\": \"Looking for information on FORCED SHOWDOWN? Check out the release date (Mar 29, 2016), developer insights from BetaDwarf, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 29, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"BetaDwarf\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BetaDwarf\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/265000/header.jpg?t=1560428692\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}