{
    "AppID": 1173400,
    "Name": "Futa Fix Dick Dine and Dash",
    "Release date": "Dec 21, 2020",
    "About the game": "Emily has a problem. One day, a long, meaty cock appeared in between her legs. Ashamed of her new member, she became a shut-in and avoided opening up to other people. The fact that she has to beat her meat multiple times a day to stay sane doesn't help either. She now works at a restaurant and bar, where no one else knows about her little (huge) problem. It's been several years now, and Emily has realized that unless she makes a change in her life soon, all she will have to look forward to is constant masturbation and loneliness. Help her overcome her fears and get her to open up to her co-workers. Perhaps in time they will open up (their legs) to her as well. Emily used to be an outgoing girl until she woke up one day and found she had something extra between her legs. Ashamed of her body, she became withdrawn and antisocial. No one else knows about her secret, but she feels like unless she does something soon, she may become a shut-in chronic masturbator for the rest of her life. The party girl who never grew up and a waitress at the same restaurant Emily works at. Cindy’s life is a blur of drinks, loud music, and partying. All she wants out of life can be found on a dance floor. Emily and she do not know each other that well, even though Cindy is constantly trying to drag her out to one club or another. She often wonders how Emily turned out the way she was and how anyone could lead such a boring life. Tall, athletic, and outgoing, Clover doesn’t let anything get in the way of what she wants to do. She works at the same restaurant as Emily and has known her for a few years. She always invites Emily to do things with her, most of which Emily declines. However, the two of them may learn that they’re more like each other than they suspect. Clover’s older sister. Lilly doesn’t appear to have a job, yet appears to always have money to burn through. She has appeared a few times at the restaurant and found Emily’s shy and withdrawn manner to be endearing. She is a deeply affectionate and caring older sister and spends much time wondering how Clover is doing. The co-owner and manager of the restaurant. Rachael at a glance seems like a serious, business-oriented woman who does not tolerate any nonsense. However, Emily often gets the impression that she’s just putting on a front and doesn’t show her true personality when she’s at work. Rachael suspects much the same of Emily or thinks that she is hiding something about herself. She intends to get to the truth of the matter one day. Main Features HD 1080p &amp; Fullscreen options Visual Novel/Point and click 2+ hours of content 20+ illustrated scenes with animations Partially voiced characters CG Gallery Extras and secrets Original Soundtrack and audio",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1173400/header.jpg?t=1654290063",
    "Price": 11.99,
    "Developers": "Cyberframe Studios",
    "Publishers": "Critical Bliss",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1173400/ss_b427ab33cec09b61e194175ff205ff4f59136311.1920x1080.jpg?t=1654290063,https://cdn.akamai.steamstatic.com/steam/apps/1173400/ss_0f3bb07f099fcc304765344cb35817872cd61851.1920x1080.jpg?t=1654290063,https://cdn.akamai.steamstatic.com/steam/apps/1173400/ss_11fb15fed5ea89f5a7f2b69a27ba361e6aed3886.1920x1080.jpg?t=1654290063,https://cdn.akamai.steamstatic.com/steam/apps/1173400/ss_19a187c5bda819bd8c16aea7ee84401c9c26c19f.1920x1080.jpg?t=1654290063,https://cdn.akamai.steamstatic.com/steam/apps/1173400/ss_469bd0035c970bcb6ca8a2587aea920834a13498.1920x1080.jpg?t=1654290063,https://cdn.akamai.steamstatic.com/steam/apps/1173400/ss_9dbd06437dc2589f44aa7778bf5e7ae730060b6f.1920x1080.jpg?t=1654290063,https://cdn.akamai.steamstatic.com/steam/apps/1173400/ss_c0b10ac2bee040bf77f959648dc5524996000b68.1920x1080.jpg?t=1654290063,https://cdn.akamai.steamstatic.com/steam/apps/1173400/ss_c2baa9f09cbead8b0a6e4578b23bccea32b8b08f.1920x1080.jpg?t=1654290063,https://cdn.akamai.steamstatic.com/steam/apps/1173400/ss_631e4d350d3d5c4194d53b03bc6b212fe5ae483f.1920x1080.jpg?t=1654290063,https://cdn.akamai.steamstatic.com/steam/apps/1173400/ss_4515a81a4f04da8cde960e0e484e55dd0918dc80.1920x1080.jpg?t=1654290063",
    "Slug": "futa-fix-dick-dine-and-dash",
    "Meta Title": "Futa Fix Dick Dine and Dash: Dec 21, 2020, Cyberframe Stu...",
    "Meta Description": "Looking for information on Futa Fix Dick Dine and Dash? Check out the release date (Dec 21, 2020), developer insights from Cyberframe Studios, and a com...",
    "Alt Text Image": "Official header image for Futa Fix Dick Dine and Dash game - Steam 1173400",
    "Canonical URL": "https://gusku.site/game/futa-fix-dick-dine-and-dash",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Futa Fix Dick Dine and Dash\", \"description\": \"Looking for information on Futa Fix Dick Dine and Dash? Check out the release date (Dec 21, 2020), developer insights from Cyberframe Studios, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cyberframe Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Critical Bliss\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1173400/header.jpg?t=1654290063\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}