{
    "AppID": 1719180,
    "Name": "Gobby McGobblenutz Presents - The Questionably Quirky Quiz Show",
    "Release date": "Oct 4, 2021",
    "About the game": "(This game, as well as many others in our bundle, is FANTASTIC for Youtubers &amp; Streamers to create content, engage with their audience, &amp; allow their audience to better get to know them through answering a series of questions about the content creator! This creates a unique experience for all parties involved, and players playing the game themselves can enjoy the solo experience tremendously all on their own as well!) The Questionably Quirky Quiz Show Are you ready to be a part of history? To have your name added into the Hall of Legends as you progress through the game and become a part of something bigger OUTSIDE of the game? Would you like to be featured as a meaningful part of future episodes, written specifically with you in mind and your name plastered into the Winner's Section for all to see? Well then, welcome all new-comers! You will answer a series of questions... Some of these questions are difficult to answer, some of these questions may make you INCREDIBLY uncomfortable... Do you have what it takes to make it all the way through? Can your brain, stomach, and balls (Or Ladyballs), handle it? One way or another... We WILL find out on The Questionably Quirky Quiz Show... And then, we'll see if YOU are a winner as you share your point total with us and see if it matches the hidden point total revealed in the next episode! How many players will end up a winner? How many of you will be featured in the next episode? How many of your names will be put into a game for everyone to enjoy? We're about to find out! Warning: The Questionably Quirky Quiz Show is an adult-themed game with graphic textual details. It is not intended for younger audiences or those who are prudish in any way, shape, or form. Some of the topics involved may be deemed lewd, crude, and incredibly offensive. We hope you enjoy your time playing, and may your panties remain unbunched! Features: Short and sweet Be a part of history with Player - Developer interaction Have your name featured as a Winner in future episodes so you can brag to all of your friends! (Or anyone willing to listen to you...) The only game with this theme of its kind Very atmospheric, psychological, and stupid Sit back, relax, and answer in-depth questions to reveal ridiculous scenarios Super affordable for a unique experience Disgustingly hilarious and disturbingly revealing",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1719180/header.jpg?t=1646499000",
    "Price": 1.99,
    "Developers": "Randumb Studios",
    "Publishers": "Randumb Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1719180/ss_7914a6d7c775bcaf8ea38ee008a6cf93cad8eb8f.1920x1080.jpg?t=1646499000,https://cdn.akamai.steamstatic.com/steam/apps/1719180/ss_4635ac0e476bc62169cbcbe0040444acac73644c.1920x1080.jpg?t=1646499000,https://cdn.akamai.steamstatic.com/steam/apps/1719180/ss_4e1d414e3e157bb599a1a88f7cff9db43a6e081e.1920x1080.jpg?t=1646499000,https://cdn.akamai.steamstatic.com/steam/apps/1719180/ss_fab711ba57e9d965467c3fa3446a4ceb7f07b5ab.1920x1080.jpg?t=1646499000,https://cdn.akamai.steamstatic.com/steam/apps/1719180/ss_3a423e8365ba3185145bcfd7b479fe25435792ca.1920x1080.jpg?t=1646499000,https://cdn.akamai.steamstatic.com/steam/apps/1719180/ss_fe1906081abcfcaf97d6a839b8a4cd6e85395913.1920x1080.jpg?t=1646499000",
    "Slug": "gobby-mcgobblenutz-presents-the-questionably-quirky-quiz-show",
    "Meta Title": "Gobby McGobblenutz Presents - The Questionably Quirky Qui...",
    "Meta Description": "Looking for information on Gobby McGobblenutz Presents - The Questionably Quirky Quiz Show? Check out the release date (Oct 4, 2021), developer insights...",
    "Alt Text Image": "Official header image for Gobby McGobblenutz Presents - The Questionably Quirky Quiz Show game - Steam 1719180",
    "Canonical URL": "https://gusku.site/game/gobby-mcgobblenutz-presents-the-questionably-quirky-quiz-show",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gobby McGobblenutz Presents - The Questionably Quirky Quiz Show\", \"description\": \"Looking for information on Gobby McGobblenutz Presents - The Questionably Quirky Quiz Show? Check out the release date (Oct 4, 2021), developer insights...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Randumb Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Randumb Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1719180/header.jpg?t=1646499000\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}