{
    "AppID": 1606640,
    "Name": "GrandMa Badass - a crazy point and click adventure",
    "Release date": "May 5, 2021",
    "About the game": "/!\\ COMING SOON In order to immerse you in the most total and pleasant immersion, it has been decided to withdraw episodes 1 and 2 from sale in the store to offer you the game in its most complete and final version. New additions, changes etc in the gameplay have been done on the game which will therefore give you a whole new experience when it is released soon. Add it to your wishlist and watch for its release on Steam or on Adipson Studio's Twitter! GRANDMA BADASS POINT AND CLICK GrandMA Badass is a cartoon style 2D point and click game in which you will only need the mouse to control a 90 year old grandma who is going to live a life. extraordinary adventure. You are going to plunge into the heart of an Adventure game that mixes riddles and puzzles with a twists and turns with various characters, each more charismatic than the other. HISTORY GrandMa certainly never imagined having to have such a lousy day. And yet she had started so badly! Woken up in the early morning by Marius, her hungry black cat, she will begin by disillusionment and understand that her day is not going to be the most pleasant ... Forced to face the dangers of the Coronavirus and the vagaries of poverty, GrandMa will very quickly find herself in dirty stories, where she will have to rub shoulders with the underworld and the organized crime of her city ... to find her cat kidnapped in this dirty day… FEATURES Enter a fun and animated adventure, filled with characters with their own personalities and a big place in the story that evolves over the episodes, making GrandMa travel from her living room to the city, then to various distant countries ... A point and click game in the style of old school games, with original dialogue in the form of bubbles, like in the comics. Texts and descriptions of objects fully translated into English Find the solution to many puzzles following a certain logic Configure the game under several screen resolutions You can use the in-game configuration system to change GrandMa's walking and moving speed An intelligent quest log allows you to always stay up to date with your objectives and to find your way around easily You can combine objects together to design new ones You only need the mouse to control the game and the movements of GrandMa The Prologue of the game is available for free on the demo (approximately 30 minutes of play minimum) Each episode immerses you in an adventure lasting between 1 hour minimum and 3 hours or more. Very simple dialogs with an icon display system in speech bubbles, like in a comic strip and an audio mix of languages ​​in a hilarious gibberish and perfectly understandable to all) Backup system to secure yourself at any time or quit the game at any time! GrandMa Badass is a game logical enough never to lose the player and requires a minimum of observation and logic to complete each episode. Dare to enter this universe and live an extraordinary experience in a fun, funny environment and through rather original gameplay and features ...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1606640/header.jpg?t=1656889524",
    "Price": 0.0,
    "Developers": "Adipson Studio",
    "Publishers": "Adipson Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1606640/ss_1baea2f9c2d585266909802efcd72f656e9a330f.1920x1080.jpg?t=1656889524,https://cdn.akamai.steamstatic.com/steam/apps/1606640/ss_3490b4a01c340524988c8f9f85fca2734595f8d2.1920x1080.jpg?t=1656889524,https://cdn.akamai.steamstatic.com/steam/apps/1606640/ss_32d507ae56726c6de1445bb85810873905d714e1.1920x1080.jpg?t=1656889524,https://cdn.akamai.steamstatic.com/steam/apps/1606640/ss_c47c91c13e23520af3d03a3bda6c96091b813fe3.1920x1080.jpg?t=1656889524,https://cdn.akamai.steamstatic.com/steam/apps/1606640/ss_5fc532e5cf797e58ed9820cb2888da8e44c72b38.1920x1080.jpg?t=1656889524,https://cdn.akamai.steamstatic.com/steam/apps/1606640/ss_d19e65aafa10c2946ab50fd907b15bc833cc2296.1920x1080.jpg?t=1656889524,https://cdn.akamai.steamstatic.com/steam/apps/1606640/ss_0603742dab97ef59c1680fd2c3db58c72521ba28.1920x1080.jpg?t=1656889524,https://cdn.akamai.steamstatic.com/steam/apps/1606640/ss_0a95d70cd780c6d72fd144f67e0b280ec5c278be.1920x1080.jpg?t=1656889524,https://cdn.akamai.steamstatic.com/steam/apps/1606640/ss_4aa50c03bc3f9d8b31234edd549510388f1cf8e0.1920x1080.jpg?t=1656889524,https://cdn.akamai.steamstatic.com/steam/apps/1606640/ss_bfd1d43633815c1b81a02d183f5a467172d68510.1920x1080.jpg?t=1656889524,https://cdn.akamai.steamstatic.com/steam/apps/1606640/ss_7b75564e6177bd693409dfe70cc4fc519960d5e9.1920x1080.jpg?t=1656889524",
    "Slug": "grandma-badass-a-crazy-point-and-click-adventure",
    "Meta Title": "GrandMa Badass - a crazy point and click adventure: May 5...",
    "Meta Description": "Looking for information on GrandMa Badass - a crazy point and click adventure? Check out the release date (May 5, 2021), developer insights from Adipson...",
    "Alt Text Image": "Official header image for GrandMa Badass - a crazy point and click adventure game - Steam 1606640",
    "Canonical URL": "https://gusku.site/game/grandma-badass-a-crazy-point-and-click-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"GrandMa Badass - a crazy point and click adventure\", \"description\": \"Looking for information on GrandMa Badass - a crazy point and click adventure? Check out the release date (May 5, 2021), developer insights from Adipson...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Adipson Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Adipson Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1606640/header.jpg?t=1656889524\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}