{
    "AppID": 418190,
    "Name": "Helen's Mysterious Castle",
    "Release date": "Mar 18, 2016",
    "About the game": "Caution As this game was created using RPG Maker, the following features exclusive to the RPG Maker engine listed below can be used. To take a screenshot using the Steam Overlay feature, please change the function key to any key other than F12. F12: Reset the game Alt + Enter: Toggle Full screen/Window mode Helen knows little about who she is―or even where she is―and she's dying to find out more. Stranded on a floating island with a labyrinthine castle just begging to be explored, Helen lets her curiosity get the better of her. Fortunately for Helen, she's more than capable of taking care of herself. Armed with a plethora of weapons she finds along the way on her journey, Helen must battle monsters, collect new equipment, and uncover the many secrets of her mysterious home. Helen spends the game fighting on her own, and she wouldn't have it any other way. Using the game’s unique 1-on-1 combat system, Helen can collect weapons and toggle between them during battle as the situation dictates. Take advantage of the passage of time and knowledge of your opponents to quickly swap in the right weapon for the job and finish off your foes before they have the chance to react. Enhance weapons using experience points collected from defeated enemies, collect new weapons hidden deep inside the labyrinth, and put together the ultimate arsenal. Equip and upgrade weapons of all shapes and sizes―from bows and shields, to broadswords and devastating magic spells. Learning when to use each weapon is the ultimate key to victory. Helen Our heroine. A girl of few words. Ardis A man who lives with Helen. The Demon King Ruler of the terrifying Four Lords. Undead Knight He seems to appear wherever Helen goes. Zack Another adventuring hero. The Fairy The hero Zack's attendant. Death is not the End. Death can come swiftly in the world of Helen's Mysterious Castle―but it's not the end of the adventure. Every time Helen perishes, she'll reawaken in the cabin with a piping hot Salisbury steak ready to be eaten. Gobbling up this delicious meal will grant a permanent increase to her lifeline, rendering otherwise-unbeatable foes just a little bit easier. FAQ FAQ Q. Does Helen level up? A. While Helen herself does not level up, her items can be enhanced using experience points. Q. There is a glitch or aspect ratio issue in the game. A. Please switch to Window mode by pressing F4 or Alt + Enter. Q. Is there a game manual? A. There is a ReadMe file available inside your Steam directory: C:\\Program Files\\Steam\\steamapps\\common\\Helen's Mysterious Castle\\helen Q. Why does the Japanese version crash? A. The Japanese-language coding in this game runs only on Japanese system locales. If you want to play the game in Japanese and it crashes, please change your system locale to Japanese.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/418190/header.jpg?t=1574409844",
    "Price": 1.99,
    "Developers": "Satsu",
    "Publishers": "PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/418190/ss_992124197405820446e7ffa9507626b1086fb6b2.1920x1080.jpg?t=1574409844,https://cdn.akamai.steamstatic.com/steam/apps/418190/ss_7308f977cbbbcee24052ca8da5b250c87b0664dc.1920x1080.jpg?t=1574409844,https://cdn.akamai.steamstatic.com/steam/apps/418190/ss_0f04b5e96fb05f5b6442df8efdf4d0dcb6a72e49.1920x1080.jpg?t=1574409844,https://cdn.akamai.steamstatic.com/steam/apps/418190/ss_190a6fe63cb5900d433486a9ff8283866f04c0c6.1920x1080.jpg?t=1574409844,https://cdn.akamai.steamstatic.com/steam/apps/418190/ss_d927e130d267ca0ab7cd0313a8f5ff7849d1978c.1920x1080.jpg?t=1574409844,https://cdn.akamai.steamstatic.com/steam/apps/418190/ss_1d1653051a9777aa86b66276c1915633dba36299.1920x1080.jpg?t=1574409844,https://cdn.akamai.steamstatic.com/steam/apps/418190/ss_59ae35ea8ebcb05fb1e3947e8d566d0e93281ce0.1920x1080.jpg?t=1574409844,https://cdn.akamai.steamstatic.com/steam/apps/418190/ss_e0a387c73e2dbf19c778f0244457b40a11ba6ecb.1920x1080.jpg?t=1574409844,https://cdn.akamai.steamstatic.com/steam/apps/418190/ss_19e27be9d558941cfd52f00c8fb89b4f53192360.1920x1080.jpg?t=1574409844",
    "Slug": "helen-s-mysterious-castle",
    "Meta Title": "Helen's Mysterious Castle: Mar 18, 2016, Satsu and Full O...",
    "Meta Description": "Looking for information on Helen's Mysterious Castle? Check out the release date (Mar 18, 2016), developer insights from Satsu, and a complete game summ...",
    "Alt Text Image": "Official header image for Helen's Mysterious Castle game - Steam 418190",
    "Canonical URL": "https://gusku.site/game/helen-s-mysterious-castle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Helen's Mysterious Castle\", \"description\": \"Looking for information on Helen's Mysterious Castle? Check out the release date (Mar 18, 2016), developer insights from Satsu, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 18, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Satsu\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/418190/header.jpg?t=1574409844\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}