{
    "AppID": 1485100,
    "Name": "Hentai Femdom Sim: Femdom University",
    "Release date": "Aug 4, 2021",
    "About the game": "Hentai Femdom Sim: Femdom University is a unique Open-World Game where your sexual nightmares come true. Throughout the game, you play as a new student and are surrounded by dominant girls, teachers and monstergirls. In order to survive, you have to try not to get seduced, manage your resources and win in erotic battles! You also have to pay rent by the end of each week, or there will be consequences! DATING Find a cute girl and treat her nice- and she might get interested in you. Benefits Struggling in the university? Friends are what you need! Get closer to the npcs and they might help you! Enslavement Life as a slave is not so bad. At least you don't need to pay rent, and you get food and a warm place to stay at night. Each mistress has her own way to dealing with her property. A nerdy girl will use you for her experiments and shrink you while a sadistic girl will inflict lots of pain on you. FACTIONS Good Factions: All of your actions will have consequences in reducing or increasing your 'reputation' of those factions. How popular are you gonna be to the university-girls in the campus? And will the teachers like you? Evil Factions: If you chose to endure the bullying of the gang 'Skullgirls', you will lose their respect and they may start doing even worse things to you. You could fight and earn their respect. But fighting and losing has a heavy price. Work Factions: You can either try to earn money your own way, or you can simply work in a shop. How you treat the customers is up to you. But the lady in charge may abuse you if you are not careful...! A BIG WORLD TO EXPLORE Lots of friendly and hostile Monster Girls, waiting for you to explore. Trade stones to items in the Goblin Village, Get Blessings to increase your power, Help the Succubus in her farm, Entertain Bowsette, Save Earth~Chan. However a big world also means a lot of danger. Take care of yourself, or you might find yourself inside the belly of a slimegirl.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1485100/header.jpg?t=1628117631",
    "Price": 24.99,
    "Developers": "SaliaCoel",
    "Publishers": "SaliaCoel",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1485100/ss_55f532a959d578addd92f051caa87237be7eed7e.1920x1080.jpg?t=1628117631,https://cdn.akamai.steamstatic.com/steam/apps/1485100/ss_c66740f10af6925ba4de8362b62db727e542e190.1920x1080.jpg?t=1628117631,https://cdn.akamai.steamstatic.com/steam/apps/1485100/ss_678638bb3e92a36d0d4ebcfdd5e32e7c5e79c8d9.1920x1080.jpg?t=1628117631,https://cdn.akamai.steamstatic.com/steam/apps/1485100/ss_44035dfc83fa673287700f956791155ba4285c6c.1920x1080.jpg?t=1628117631,https://cdn.akamai.steamstatic.com/steam/apps/1485100/ss_a05359e366d84585b86fdd44f9cf18490dc06784.1920x1080.jpg?t=1628117631",
    "Slug": "hentai-femdom-sim-femdom-university",
    "Meta Title": "Hentai Femdom Sim: Femdom University: Aug 4, 2021, SaliaC...",
    "Meta Description": "Looking for information on Hentai Femdom Sim: Femdom University? Check out the release date (Aug 4, 2021), developer insights from SaliaCoel, and a comp...",
    "Alt Text Image": "Official header image for Hentai Femdom Sim: Femdom University game - Steam 1485100",
    "Canonical URL": "https://gusku.site/game/hentai-femdom-sim-femdom-university",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hentai Femdom Sim: Femdom University\", \"description\": \"Looking for information on Hentai Femdom Sim: Femdom University? Check out the release date (Aug 4, 2021), developer insights from SaliaCoel, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"SaliaCoel\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SaliaCoel\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1485100/header.jpg?t=1628117631\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}