{
    "AppID": 1100800,
    "Name": "I Walk Among Zombies Vol. 2 (Adult Version)",
    "Release date": "Aug 12, 2019",
    "About the game": "The Earth descends into chaos, the victim count rising at an astronomical rate. Those unlucky enough to survive spend their days in despair. But among them is our protagonist. Will he use his power to become a hero, or something else...? Story Yuusuke was a shut-in with a dislike of other people, until the zombies appeared. Fortunately for him, for some reason they wouldn't attack him. As he was exploring the zombie-infested town, he came across Mitsuki and her brothers holed up in a supermarket and started living with them. Just as they were adjusting and feeling happy with their new life, an unfortunate incident occurred that spelled the end of their time in the supermarket. Instead, they took flight for the town hall, where they'd heard the rest of the survivors had taken refuge. This was to be their safe haven, a place to keep on living away in safety from the zombies. “However, the zombies weren't the only threat.” What awaits those trying to carry on living? Is it hope, or will it be despair? For the intelligent zombies have begun to move, and sneer at those who still draw breath. Based on the hit novel from the adult novel site Nocturne Novels! Features Featuring breathtaking artwork from Saburo-sensei Full voice acting for the female cast Filled with images of the characters and scenes which add a wealth of details and emotions to the story. Fully uncensored artwork About “Nocturne Novels is a submission-based novel site for 18+ stories. Budding novelists can submit their stories and have them published to be viewed by anyone.” (Excerpt from the Nocturne Novels website) Nocturne Novels is the division of Syosetu focusing on 18+ novels. The additional possibilities of adult content broaden the range of stories on offer, and brand new works, separate from those on the main site though just as popular, keep popping up. A submission-based novel site where budding novelists can submit their 18+ stories, it's the perfect place for up-and-coming Light Novel writers to make their professional debut, and it has led big publishers to often pick up novels there for publication. Within Nocturne Novels, one outstanding novel has picked up rave reviews and taken the top spot in the yearly rankings: “A World Filled With Zombies Where Only I Am Not Attacked.” Readers are captivated by the detailed world descriptions and the hectic plot, but what stands out most of all is the characters' realism and credibility. Fans say that they forget they’re reading a story, feeling like they’re pulled in to the world. By adding art and music to make this story into a visual novel, this thrilling zombie tale has reached a whole new level!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1100800/header.jpg?t=1634586051",
    "Price": 14.99,
    "Developers": "Seacoxx",
    "Publishers": "Denpasoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1100800/ss_676291b744a4306abc4b917f539af97c5e8cc7f2.1920x1080.jpg?t=1634586051,https://cdn.akamai.steamstatic.com/steam/apps/1100800/ss_6aaf42c0086d9f0b8c452b1728096890ff972177.1920x1080.jpg?t=1634586051,https://cdn.akamai.steamstatic.com/steam/apps/1100800/ss_1a318628e3d4a82fbb8634d9f0b8ac2747a98153.1920x1080.jpg?t=1634586051,https://cdn.akamai.steamstatic.com/steam/apps/1100800/ss_15f29743562be7a6c2315e7173f436a7ef2ae2fc.1920x1080.jpg?t=1634586051,https://cdn.akamai.steamstatic.com/steam/apps/1100800/ss_d63f4ea35c02e136e27d8af19c2b677fd3e16642.1920x1080.jpg?t=1634586051,https://cdn.akamai.steamstatic.com/steam/apps/1100800/ss_1d50dff1ab2d45a90d3551699c87dc05b9c1b966.1920x1080.jpg?t=1634586051,https://cdn.akamai.steamstatic.com/steam/apps/1100800/ss_a8c38853193a421e25b040d780e177ce0d5f47bd.1920x1080.jpg?t=1634586051,https://cdn.akamai.steamstatic.com/steam/apps/1100800/ss_cb2a952f78c010efdc5108fa606cddbe6bfd6a02.1920x1080.jpg?t=1634586051",
    "Slug": "i-walk-among-zombies-vol-2-adult-version",
    "Meta Title": "I Walk Among Zombies Vol. 2 (Adult Version): Aug 12, 2019...",
    "Meta Description": "Looking for information on I Walk Among Zombies Vol. 2 (Adult Version)? Check out the release date (Aug 12, 2019), developer insights from Seacoxx, and ...",
    "Alt Text Image": "Official header image for I Walk Among Zombies Vol. 2 (Adult Version) game - Steam 1100800",
    "Canonical URL": "https://gusku.site/game/i-walk-among-zombies-vol-2-adult-version",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"I Walk Among Zombies Vol. 2 (Adult Version)\", \"description\": \"Looking for information on I Walk Among Zombies Vol. 2 (Adult Version)? Check out the release date (Aug 12, 2019), developer insights from Seacoxx, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Seacoxx\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Denpasoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1100800/header.jpg?t=1634586051\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}