{
    "AppID": 1281920,
    "Name": "Iron Reckoning",
    "Release date": "Nov 5, 2020",
    "About the game": "Iron Reckoning is an action-oriented adventure game that unravels within a sci-fi/fantasy setting. Utilize a unique movement mechanic to traverse the environment and gain an advantage in combat! Test your reflexes and timing by summoning weapons and casting offensive magic! Every challenge will highlight your resilience and creativity in battle. Explore the Aalegan Isles, reclaim the lost territory, and unveil the truth behind the machine presence that threatens humanity! In the distant future, the warrior called Jaena is tasked with eradicating the machines which reside on an artificial island. In order to stop them, she must explore this uncharted territory and uncover the mystery behind what her enemies have been planning for the past several centuries. But this is no easy task; many obstacles block her path, including the ruthless Ward warriors, the giant weaponized golems known as the Vagabonds, and a maniacal cult leader who has earned the title 'Nomad.' As this quest becomes personal, the challenges will test Jaena's resolve and threaten her humanity, the only quality which separates her from the machines she had sworn to destroy. Your only choice is to cut through your enemies, prove your worth as a warrior, and claim control over the Aalegan Isles. As Jaena, you must master the legendary Bladerush ability in order to take the fight to the machines. Summon a dagger, and throw it in any direction. Your power is linked to the blade, and its strength allows you to pull yourself towards it at a high velocity. The potential is endless--throw your dagger into an enemy to soar towards them for a quick attack, or keep a blade hidden somewhere safe for a quick getaway. You can even chain Bladerush jumps to stay airborne for long periods of time, flying through the air for as long as you can manage your mana resources. This power is yours to wield. Massive leaps through the air can get you close to an enemy. But to deal real damage, you'll need to wield Jaena's signature broadsword, Claymore V. Timing is everything, waiting for the ideal moment to strike as you create opportunities with offensive magic and movement skills. How and when you summon your weapons will be key in discovering your strategy for eliminating your foes, and clearing the island of the machine threat! Navigate a fantasy-inspired landscape using Jaena's Bladerush ability Take down waves of enemies that wield a variety of weapons Uncover the mystery that lurks within the Aalegan Isles Unleash a flurry of combat maneuvers &amp; parry attacks by mastering Jaena's blade Encounter a series of bosses, including the towering Vagabonds Go head-to-head with Nomad, the ruthless leader of the Ward Clan Full story experience &amp; a vast world that is yours to explore 4k screen support &amp; runs at any framerate Native versions for Mac OSX, Windows, and Linux Support for common input hardware, including the XBox One and PS4 controllers Complete subtitle support and other common accessibility features Full original soundtrack &amp; album release",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1281920/header.jpg?t=1644027168",
    "Price": 14.99,
    "Developers": "RobProductions",
    "Publishers": "RobProductions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1281920/ss_f40c58bcb2b862eea4a91f65052d39536e1fcde5.1920x1080.jpg?t=1644027168,https://cdn.akamai.steamstatic.com/steam/apps/1281920/ss_1bb8541a0ccf81a1d405ce59210b719688e61d0b.1920x1080.jpg?t=1644027168,https://cdn.akamai.steamstatic.com/steam/apps/1281920/ss_977075517665c8bdce8a3b8a76fb54361d691ca9.1920x1080.jpg?t=1644027168,https://cdn.akamai.steamstatic.com/steam/apps/1281920/ss_27effaa5471070457799aaec09deb485cb2dd75f.1920x1080.jpg?t=1644027168,https://cdn.akamai.steamstatic.com/steam/apps/1281920/ss_ef8bc59971ff77bac80c5c9c5fd8a240c83aed08.1920x1080.jpg?t=1644027168,https://cdn.akamai.steamstatic.com/steam/apps/1281920/ss_72a089074dc0a721b8416d85fead425c455511ec.1920x1080.jpg?t=1644027168,https://cdn.akamai.steamstatic.com/steam/apps/1281920/ss_e6f98f0c99b97ae09a744052d86f7532d81bea45.1920x1080.jpg?t=1644027168,https://cdn.akamai.steamstatic.com/steam/apps/1281920/ss_fdb91b8e867c5f35957698e8d07d3b2db3cb4c06.1920x1080.jpg?t=1644027168,https://cdn.akamai.steamstatic.com/steam/apps/1281920/ss_2cc8a46e66f53099c05e5a29fe4997ab9fe9eef1.1920x1080.jpg?t=1644027168,https://cdn.akamai.steamstatic.com/steam/apps/1281920/ss_c9584c67ec0766c3c1343f87116701e8d7c89894.1920x1080.jpg?t=1644027168,https://cdn.akamai.steamstatic.com/steam/apps/1281920/ss_51cbd6e10cf4300b9c70b270558daa38d8dc355b.1920x1080.jpg?t=1644027168,https://cdn.akamai.steamstatic.com/steam/apps/1281920/ss_dae3ccbca7e7c75b76dbcde1321d72e0e36a0e60.1920x1080.jpg?t=1644027168",
    "Slug": "iron-reckoning",
    "Meta Title": "Iron Reckoning: Nov 5, 2020, RobProductions and Full Over...",
    "Meta Description": "Looking for information on Iron Reckoning? Check out the release date (Nov 5, 2020), developer insights from RobProductions, and a complete game summary.",
    "Alt Text Image": "Official header image for Iron Reckoning game - Steam 1281920",
    "Canonical URL": "https://gusku.site/game/iron-reckoning",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Iron Reckoning\", \"description\": \"Looking for information on Iron Reckoning? Check out the release date (Nov 5, 2020), developer insights from RobProductions, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"RobProductions\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"RobProductions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1281920/header.jpg?t=1644027168\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}