{
    "AppID": 1558020,
    "Name": "Lazy Chess",
    "Release date": "Mar 12, 2021",
    "About the game": "Lazy Chess is a non-profit chess puzzle that aims to innovate the game and reduce the intimidation factor for new or self-conscious players. On average, there are more than 30 legal chess moves available to a player in a turn, creating vigintillions (that’s 10 followed by 63 zeros) of possibilities throughout a game. Lazy Chess compresses all those possibilities. Every turn, it offers you the best 2, 3 or 4 moves you could make. The only catch? You won’t know which move is the best! The world's most sophisticated chess engine, Stockfish, analyzes the board and offers you the best two moves, but it won’t tell you which move is best until after you’ve confirmed your choice. The board plays as a real chess game would while limiting your selections. In any turn, your options may allow you to defend, progress, capture, or even use special rules such as castling. The moves provided in Lazy Chess can always win the match, but how strong are your decisions? Lazy Chess is designed to take the stress out of chess. By simplifying the game, players of all levels will be able to play good chess with winning strategies. Those new to chess will learn creative moves and tactics, and those with experience can play with speed against a world-class neural network. Compete against an AI opponent, online with strangers or friends, or with the person next to you! Looking for a greater challenge? Lazy Chess offers dozens of settings and variants, introducing random moves, varying Stockfish “depth” and a real-time advantage tracker. Challenge Mode allows you to use the openings of famous games and see if you can progress with the grandmasters. Those looking for further analysis of their games can copy the PGN of their game to their clipboard, or analyze it externally on external sites! Lazy Chess was created by Cinq-Mars Media , a 501(c)(3) non-profit organization developing educational games and technology, support of scientific research related to human safety and education, and to make such technology and research available on a charitable basis. Discord Join our server:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1558020/header.jpg?t=1643046472",
    "Price": 2.99,
    "Developers": "Christopher Cinq-Mars Jarvis",
    "Publishers": "Cinq-Mars Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1558020/ss_22fcd53d473a3c3735074efa33f1d9ce161fc3af.1920x1080.jpg?t=1643046472,https://cdn.akamai.steamstatic.com/steam/apps/1558020/ss_9270cfd3407aa8e81e033bee593c4ed0096711fd.1920x1080.jpg?t=1643046472,https://cdn.akamai.steamstatic.com/steam/apps/1558020/ss_e846bb5078227f8039e924881c5c95ea37b8a639.1920x1080.jpg?t=1643046472,https://cdn.akamai.steamstatic.com/steam/apps/1558020/ss_db5e291ee79bcc7465b9d9e6e36fd0bfc84185ea.1920x1080.jpg?t=1643046472,https://cdn.akamai.steamstatic.com/steam/apps/1558020/ss_b70dbba255fb1724913fab5a102ce6a4d5f1c176.1920x1080.jpg?t=1643046472,https://cdn.akamai.steamstatic.com/steam/apps/1558020/ss_f40c642c4cf211c727b8d0d01847e0c822b6c3a3.1920x1080.jpg?t=1643046472",
    "Slug": "lazy-chess",
    "Meta Title": "Lazy Chess: Mar 12, 2021, Christopher Cinq-Mars Jarvis an...",
    "Meta Description": "Looking for information on Lazy Chess? Check out the release date (Mar 12, 2021), developer insights from Christopher Cinq-Mars Jarvis, and a complete g...",
    "Alt Text Image": "Official header image for Lazy Chess game - Steam 1558020",
    "Canonical URL": "https://gusku.site/game/lazy-chess",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lazy Chess\", \"description\": \"Looking for information on Lazy Chess? Check out the release date (Mar 12, 2021), developer insights from Christopher Cinq-Mars Jarvis, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Christopher Cinq-Mars Jarvis\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cinq-Mars Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1558020/header.jpg?t=1643046472\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}