{
    "AppID": 794600,
    "Name": "LET IT DIE",
    "Release date": "Sep 26, 2018",
    "About the game": "In the year 2026 AD, a large tectonic disturbance caused mass destruction around the world. In the midst of the destruction, South Western Tokyo split off into the ocean where the seismic activity caused a large spire to rise out of the ocean piercing the island creating a tower-like structure deemed holy by some. Under the watchful eye of Uncle Death, madness has spread across the world... Senpai! I was waiting for you! My name is Uncle Death, and I have a feeling we’re going to get along just fine... Your task is simple, get to the top of the tower. Let’s reach for the top, Senpai! Fight your way to the top in this chaotic and pulp survival action taking free-to-play to a whole new level. Begin your journey in your underwear and survive by any means necessary while taking advice from Uncle Death, a skateboarding reaper. Rumor has it that a sacred treasure awaits at the top of the Tower of Barbs for those that survive the climb. Many dangers and mysteries remain hidden from the eyes of mankind and await those courageous enough to dare approach the tower. Collect and Develop Unique Equipment Players fight through a treacherous tower obtaining various types of weapons and armor while finding creatures and mushrooms to eat in order to stay alive. Pry weapons and armor from the cold dead grasp of your fallen foes or craft even better gear. Eat mushrooms, frogs, and other odd creatures to keep your strength up or activate special abilities. Strategize when it's best to fight or sneak away to fight another day. You may lose your belongings upon death, but death doesn't always have to be the end... Hyper-Violent Rage Moves &amp; Goretastic Kills When hacking and slashing your foes just isn't enough, you can use ultra violent Rage Moves or Goretastics to finish them off with style! Asynchronous PvP Haters Upon death, a player’s “death data” is circulated among other player’s games where they will appear as formidable opponents called Haters. Hunters Need some loot but don't have the time to go exploring the tower yourself? Send one of your Fighters to an unsuspecting enemy, and they will invade their world as a Hunter. These potentially lethal foes can gather up items and resources from an enemy's tower for a set period of time. If they are killed before that, they get sent home crying to their master. TDM Tetsuo brings the Tokyo Death Metro to a platform near you! Join a team, attack your opponents and raid their stash, but keep in mind they can return the favor! You can also enjoy bonus rewards during the Tokyo Death Metro Battle Rush Season. We hope to see you enjoying Tokyo Death Metro's Luxury Attack Liner! Train your body Develop Equipment Eat everything that can be eaten If you’re stolen from, steal it back ...and, if you’re killed, kill them back! All-Star Voice Cast Jukka Hilden Daveigh Chase Verne Troyer Traci Lords Mark Hamill ...and MORE! VIP Service A VIP elevator service will be available for maximum convenience while slaughtering your foes. Direct Hell also insures your resources if your base is raided in the Tokyo Death Metro. Sign up today for total coverage! Support for Multiple Languages (Including Simplified and Traditional Chinese) English and Japanese audio and text options are both available. The game also supports text for French, Italian, German, Spanish, Korean, Brazilian Portuguese, and Simplified Chinese, and Traditional Chinese. Oh, One Last Thing!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/794600/header.jpg?t=1651010046",
    "Price": 0.0,
    "Developers": "GRASSHOPPER MANUFACTURE INC.,SUPERTRICK  GAMES,Inc.",
    "Publishers": "GungHo Online Entertainment America",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/794600/ss_7e2e7f0bfb1d1023c52a01ec2df13133548467da.1920x1080.jpg?t=1651010046,https://cdn.akamai.steamstatic.com/steam/apps/794600/ss_0785890f98e8b418566c5b14b6cb68140509cf18.1920x1080.jpg?t=1651010046,https://cdn.akamai.steamstatic.com/steam/apps/794600/ss_705ff3cd98ea7805d44be97e58a68e7fff8161ca.1920x1080.jpg?t=1651010046,https://cdn.akamai.steamstatic.com/steam/apps/794600/ss_550ead3a0a4ffda958c3821e8ecdc2c0a585511a.1920x1080.jpg?t=1651010046,https://cdn.akamai.steamstatic.com/steam/apps/794600/ss_1d78f073d9101315e3f7c0d5c5b2e6c46b8d11be.1920x1080.jpg?t=1651010046,https://cdn.akamai.steamstatic.com/steam/apps/794600/ss_62efccf5696ac50835e65b398ccb36aae1a72815.1920x1080.jpg?t=1651010046,https://cdn.akamai.steamstatic.com/steam/apps/794600/ss_a9e2b3881cf8bfd47d288502a317fbfe01171a74.1920x1080.jpg?t=1651010046,https://cdn.akamai.steamstatic.com/steam/apps/794600/ss_4d49c7dc810cfbf9355abf1c98664c1ed46c84aa.1920x1080.jpg?t=1651010046,https://cdn.akamai.steamstatic.com/steam/apps/794600/ss_91ee25faadc71e047c48f2278c5ff2bea372584a.1920x1080.jpg?t=1651010046,https://cdn.akamai.steamstatic.com/steam/apps/794600/ss_f08822901d3da961cd28a587c6da4bd84c096359.1920x1080.jpg?t=1651010046,https://cdn.akamai.steamstatic.com/steam/apps/794600/ss_9b595ab58941afe1c104d22c9166934249dbd90f.1920x1080.jpg?t=1651010046,https://cdn.akamai.steamstatic.com/steam/apps/794600/ss_948a93b4233c15651d243f079f8b8079e8b462cd.1920x1080.jpg?t=1651010046,https://cdn.akamai.steamstatic.com/steam/apps/794600/ss_948a93b4233c15651d243f079f8b8079e8b462cd.1920x1080.jpg?t=1651010046",
    "Slug": "let-it-die",
    "Meta Title": "LET IT DIE: Sep 26, 2018, GRASSHOPPER MANUFACTURE INC.,SU...",
    "Meta Description": "Looking for information on LET IT DIE? Check out the release date (Sep 26, 2018), developer insights from GRASSHOPPER MANUFACTURE INC.,SUPERTRICK  GAMES...",
    "Alt Text Image": "Official header image for LET IT DIE game - Steam 794600",
    "Canonical URL": "https://gusku.site/game/let-it-die",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LET IT DIE\", \"description\": \"Looking for information on LET IT DIE? Check out the release date (Sep 26, 2018), developer insights from GRASSHOPPER MANUFACTURE INC.,SUPERTRICK  GAMES...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 26, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"GRASSHOPPER MANUFACTURE INC.,SUPERTRICK  GAMES,Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GungHo Online Entertainment America\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/794600/header.jpg?t=1651010046\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}