{
    "AppID": 1101060,
    "Name": "Lumen",
    "Release date": "May 16, 2020",
    "About the game": "Lumen is an RPG developed with the famous RPG Maker software. However, it was used mainly as a template: the game boasts customized systems and graphics as well as an original soundtrack designed by a team of four creators brought together by their common passion for RPGs! The objective of Lumen is to immerse the player in the atmosphere of classic 2D RPGs, which have been a major part of our youth (Golden Sun, Chrono Trigger). While retaining a strong identity of its own, Lumen is also a homage to this incredible legacy! In Lumen, the Imperium Prod team was at first trying to re-create the feeling of old-school RPGs: exploration, quests, and dialogues with numerous NPCs ... But Lumen has a personality of its own, with varied gameplay and original systems! Here’s a sneak peek. On the three continents of Piastol, Amesial and Dangral, fights are frequent, though no random encounters happen. Foes are visible on the map, and you can decide to elude battle most of the time. However, some more aggressive creatures will not hesitate to charge and chase you! Battle sequences are turn based (with no waiting time) but strewn with mini-QTEs (1 to 3 button presses) to validate the player's choices. It's not just about hammering the action key: using a potion or the last resort ability acquires another taste when your dexterity is also involved! This system is balanced with a counter and evasion system, which highlights the strategic aspect of battle: you can choose to bear the brunt of an attack to counter immediately, or evade to stay out of harm's way. Because it’s not all about action, Lumen is teeming with rich dialogues and encourages the player to discover the game’s world through them. Learn the secrets of Baccus Farm in a full-fledged investigation phase. Argue and negotiate your way through difficult situations using the different members of your party and their distinct personalities to interact with NPCs. A good RPG starts with a good interface. From acquiring abilities with pearls won in battle to buying and equipping powerful items, Lumen takes inspiration from the classics to offer players intuitive menus that work in conjunction with the game’s background. Dialogues and battles are the core of the adventure, but many surprises are waiting as the story unfolds and the gameplay becomes richer. Bemko and his party will remember this game of hide-and-seek in the tunnels under Bromure or their trophy chase for the Explorers’ Guild! Games will test your dexterity, riddles will test your intelligence and companion quests will enable you to learn about your party. So many things are in store! The end word Despite not having the marketing impact of bigger games, Lumen has had a very positive critical reception on specialized sites and has sold nearly a thousand copies to this day in French. Lumen is the result of a four-year-old project, uniting 4 people with very different backgrounds through their shared passion for video games and their will to tell a great story!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1101060/header.jpg?t=1589637314",
    "Price": 5.99,
    "Developers": "Imperium",
    "Publishers": "Imperium",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1101060/ss_3f6461caa6fbe900c62455cfc620ecc6d2180909.1920x1080.jpg?t=1589637314,https://cdn.akamai.steamstatic.com/steam/apps/1101060/ss_84b0463d51be3a51781a8c2ed0872f20ecf69327.1920x1080.jpg?t=1589637314,https://cdn.akamai.steamstatic.com/steam/apps/1101060/ss_0b57cc986d393908b16ee98ed8b79bad11cbbefe.1920x1080.jpg?t=1589637314,https://cdn.akamai.steamstatic.com/steam/apps/1101060/ss_5afe2adf1656a5fa31b74f3e7834bde5cbaf21d3.1920x1080.jpg?t=1589637314,https://cdn.akamai.steamstatic.com/steam/apps/1101060/ss_451b890142ef74d9dcb618c038dcf1fac72b837e.1920x1080.jpg?t=1589637314",
    "Slug": "lumen",
    "Meta Title": "Lumen: May 16, 2020, Imperium and Full Overview",
    "Meta Description": "Looking for information on Lumen? Check out the release date (May 16, 2020), developer insights from Imperium, and a complete game summary.",
    "Alt Text Image": "Official header image for Lumen game - Steam 1101060",
    "Canonical URL": "https://gusku.site/game/lumen",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lumen\", \"description\": \"Looking for information on Lumen? Check out the release date (May 16, 2020), developer insights from Imperium, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 16, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Imperium\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Imperium\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1101060/header.jpg?t=1589637314\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}