{
    "AppID": 774141,
    "Name": "MIAZMA or the Devil's Stone",
    "Release date": "May 2, 2018",
    "About the game": "Jonathan Hunt is a journalist from New York. Solving the case of Yoomurjak’s ring earned him the reputation of an expert of mysteries in the past. This time he is asked by a nuclear physics institute to throw light upon a disappearance, but the mission turns into a hunt for a peculiar meteorite that fell on earth centuries ago. What is inside the devilish stone? There must be a good reason why certain persons have been trying to get hold of it at all costs. Playing as the main character in third-person perspective, you will - Investigate a curious disappearance and search for clues - Decipher secret documents - Solve puzzles left behind from the past - Explore the enigmas of obscure laboratories in a top-level scientific institute - Interview characters about what they know and what they do - When in trouble, use the laws of nature and common sense to escape - Unravel the legend of mysterious cosmic treasures and prevent disaster! Key features: • Immersive storyline • Third-person perspective • Live-action cinematic scenes • Over 20 real locations to explore • Over 20 characters by excellent actors and voice artists • A series of puzzles and challenging tasks perfectly integrated in the plot • Smart apps for various tasks • Easy mode: optional tutorial, in-game hints and skip-puzzle functions • Logged dialogues About the previous episode: Yoomurjak’s Ring The story begins when Jonathan Hunt, a journalist from New York, arrives in the city of Eger in Hungary for a break. He has local ancestry and speaks the language, but this is not the only motive for his visit. In the heritage of his great-grandfather, the globetrotter professor Samuel Hunt (known from the Agon series), he found two letters dated back in 1898. The letters were from a somewhat lunatic Hungarian scientist about a time machine he claimed to be working on. The references point to Eger, and Jonathan wants to find out what happened to the man and his preposterous invention. But soon he realizes that someone is desperately trying to stop him… About the development of Miazma Like Yoomurjak’s Ring, this title is also an FMV adventure game, developed by the same crew. It takes you to real locations with live-action cinematic approach. The game designer is Pierrot, also known for his adventure game series Agon. Miazma was developed with the support of the Institute for Nuclear Research of the Hungarian Academy of Sciences (Atomki) in the framework of scientific project Understandable-available physics. English localization was supported by EPS, NuPECC and ENSAR2. Additional supporters: KIA Motors Hungary.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/774141/header.jpg?t=1569593513",
    "Price": 0.99,
    "Developers": "Private Moon Studios",
    "Publishers": "Microïds Indie",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/774141/ss_3785f00e7543c6531b6326b8480f7ba4de857b91.1920x1080.jpg?t=1569593513,https://cdn.akamai.steamstatic.com/steam/apps/774141/ss_9a31b708ecaef0d78e6cf116248905d24ee282d9.1920x1080.jpg?t=1569593513,https://cdn.akamai.steamstatic.com/steam/apps/774141/ss_e8790d5a3da5e617266510d1a62259f989f7898b.1920x1080.jpg?t=1569593513,https://cdn.akamai.steamstatic.com/steam/apps/774141/ss_98c3b19ec2bd6831c577c5e21da820f266ba3737.1920x1080.jpg?t=1569593513,https://cdn.akamai.steamstatic.com/steam/apps/774141/ss_5a5b1a7a77f1f0179edd074ce874988291a56d24.1920x1080.jpg?t=1569593513,https://cdn.akamai.steamstatic.com/steam/apps/774141/ss_fc61b30a3927a60ef03841829c522d6e34c56c5e.1920x1080.jpg?t=1569593513,https://cdn.akamai.steamstatic.com/steam/apps/774141/ss_fd5eed1483245507d2137143d7af75f04fbefc49.1920x1080.jpg?t=1569593513",
    "Slug": "miazma-or-the-devil-s-stone",
    "Meta Title": "MIAZMA or the Devil's Stone: May 2, 2018, Private Moon St...",
    "Meta Description": "Looking for information on MIAZMA or the Devil's Stone? Check out the release date (May 2, 2018), developer insights from Private Moon Studios, and a co...",
    "Alt Text Image": "Official header image for MIAZMA or the Devil's Stone game - Steam 774141",
    "Canonical URL": "https://gusku.site/game/miazma-or-the-devil-s-stone",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MIAZMA or the Devil's Stone\", \"description\": \"Looking for information on MIAZMA or the Devil's Stone? Check out the release date (May 2, 2018), developer insights from Private Moon Studios, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 2, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Private Moon Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Micro\\u00efds Indie\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/774141/header.jpg?t=1569593513\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}