{
    "AppID": 1828780,
    "Name": "Midnight Stories 4",
    "Release date": "Dec 14, 2021",
    "About the game": "Midnight Stories This VISUAL NOVEL continues the life of Cindy, that takes 33% of the game and the rest is full of side stories with various people and hot scenes. This way you can explore all kind of kinks and pleasures and topics. The game is in 4K ultra HD resolution and fully voiced. For the side stories a huge numbers of voice actors will be delivering crystal audio for your pleasure. The MS4 plan has 3 episodes and 3-5 side stories (at least 1 side stories per episode). One episode will have at least 2.000 words and the side stories will be very focused on the 'hot stuff'. This is the most advanced build ever, with random event: random voice, random image, sound effects (steps, heart beat, whip whoosh) and audio panning left or right based on the characters position. Some images have even 10+ character to follow the story as much as possible. Relationships that can be randomized or fully controlled by you adds even more depth to the game. (In the code there is a random element that makes the choice for you, in order to keep the game uninterrupted. You can take full control by enabling from the game menu the option: random relationships and turn off relationship randomizer - to make your own choice. Some elements are kept fully random, like 1 of 3 clothes for the part where Cindy visits SOFI or when audio is random: Kevin's voice has a total of 7 tones (same content), Kara's voice has 2 tones (same content), etc. - a close and open of the game is needed for the new initialization of the random variables.) Game Plan Sisters of Fashion and Influence (side story Kevin and Kara ) Prince Charming or Prince Frog (side story Diamonds ) The First Task (side story Katie and Victoria ) Cool stuff: - Kevin and Kara has 3 endings (Kevin, Kara and narrator voices) - Diamonds has 3 options of voices (1st person Cindy and 3rd person (normal audio or large hall audio effect) (Man, Woman, Cindy and narrator voices) - Animations in 4K in Kevin and Kara and The First Task - Awesome options menu, where you can select: intro animation time, manual relationships, man voice in Diamonds , woman voice in Diamonds , etc. - A lot of random goodies: random clothes, random voices (Kevin in Prince Charming ... has 7 voices / tones), etc. - Scenes with 20+ characters loaded in render program - took 10x as long as one normal render - Sound mastery: sound effects, sound panned to left or right, depending where the character is positioned, erotic sounds as background in all hot scenes. I plan to do more side stories as time permits, but after finishing the at least 3 side stories, I need to go back and finish MS3.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1828780/header.jpg?t=1639934914",
    "Price": 7.99,
    "Developers": "CodeRenderX",
    "Publishers": "CodeRenderX",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1828780/ss_559fd67326f25ad0db9e61a85899a6cea89c6b54.1920x1080.jpg?t=1639934914,https://cdn.akamai.steamstatic.com/steam/apps/1828780/ss_be3bc23d234b3ed2f166fd2e4f51468710276592.1920x1080.jpg?t=1639934914,https://cdn.akamai.steamstatic.com/steam/apps/1828780/ss_f751ca568bc1f78086f1ef4ee35b6cb05c4349b2.1920x1080.jpg?t=1639934914,https://cdn.akamai.steamstatic.com/steam/apps/1828780/ss_1cbabe75a81f54ee273a8b96d695b0de82db5d0b.1920x1080.jpg?t=1639934914,https://cdn.akamai.steamstatic.com/steam/apps/1828780/ss_8116dc4cd98c53966ba7d5951d9b5158e067bed8.1920x1080.jpg?t=1639934914,https://cdn.akamai.steamstatic.com/steam/apps/1828780/ss_8aa060ccca99e74ceb74dae2ce5e34b9d88d2ba2.1920x1080.jpg?t=1639934914",
    "Slug": "midnight-stories-4",
    "Meta Title": "Midnight Stories 4: Dec 14, 2021, CodeRenderX and Full Ov...",
    "Meta Description": "Looking for information on Midnight Stories 4? Check out the release date (Dec 14, 2021), developer insights from CodeRenderX, and a complete game summary.",
    "Alt Text Image": "Official header image for Midnight Stories 4 game - Steam 1828780",
    "Canonical URL": "https://gusku.site/game/midnight-stories-4",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Midnight Stories 4\", \"description\": \"Looking for information on Midnight Stories 4? Check out the release date (Dec 14, 2021), developer insights from CodeRenderX, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"CodeRenderX\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CodeRenderX\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1828780/header.jpg?t=1639934914\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}