{
    "AppID": 850000,
    "Name": "Noel the Mortal Fate S1-7",
    "Release date": "May 15, 2018",
    "About the game": "*PLEASE READ: To All Users Purchasing the English Version! [English: New translation of S6 and S7 update] Thank you for your patience. The new S6 and S7 translations of 'Noel the Mortal Fate' were updated today! We hope you enjoy English speakers! This is a story about the revenge of a girl who lost her arms and legs to a devil… Noel The Mortal Fate is a charismatic adventure game developed by Kanawo with RPG Maker. After its success in Japan, as well as gaining a manga adaption, Noel The Mortal Fate is now available worldwide on Steam in English, Japanese and Simplified Chinese with seasons 1 - 7 available now in one package. Noel Cerquetti, a girl who lost her arms and legs in a contract, works together with the great devil Caron, to get her revenge against one man. This man – dubbed the 'pride of the citizens' – is Burrows, the mayor of LaPlace. Why is this girl furiously seeking revenge against this unrivalled man, loved by the people for bringing peace to LaPlace that was once overrun by the mafia? While unsteady without her limbs, Noel doesn't give up on her path of revenge, as Caron watches mercilessly, at times risking his own life to support her. With vengeance, the pair begins their chase after Burrows. Performing at the memorial ceremony... The highest honor, goal, and dream for every young musician living in LaPlace. While everyone waits for the announcements nervously, only Noel looks confident. She was certain. 'I will win the piano competition this year.' However, that confidence would soon turn to despair. The winner was her best friend, Jillian. Burrows, the mayor of LaPlace, proposes a 'deal' to a desperate Noel. Believing his words, Noel heads to the meeting, without knowing a devil was waiting... After losing both her arms and legs, Noel vows revenge against Mayor Burrows. To find evidence of corruption, she attempts to sneak into the shipping company, Aquarius. But the Mayor's secretary, Cybilla, anticipates this, setting a trap for Noel and her devilish partner, Caron. Caught in an underground labyrinth, the two encounter numerous challenges. Can they overcome the dangers and safely escape? But amidst their escape, Noel seems to be acting strange... Barely escaping, Noel and Caron swim to a hideout – a place Caron knows well. In this 'hideout,' there are many traces of Caron and a certain someone living here. After being confronted by Noel with evidence, Caron begins to speak of his past with “that person' he once made a contract with. And the shocking truth was revealed... Now marked as terrorists, a police officer, claiming to be 'the Demon of Justice', appears before Noel and Caron. To avenge a personal grudge, a young man called Oscar D, begins to attack Noel and Caron with a mysterious ability. In addition to the movements of the police, Jillian takes action to save Noel. The girl and devil's revenge move to a whole new level with the entanglement of various characters’ intentions. After a desperate battle with Oscar D, Caron is taken away from Noel. Left alone in a hopeless situation, Noel finds hope in one man... The Bomber who once confronted Noel and Caron – the Demon of Explosions – 'Fugo Dressel.' Noel breaks into the facility imprisoning Bomber by herself. But will Noel be able to take back Caron? With the help of the former enemy, Bomber, Noel rescues Caron. This was also the moment when Caron and Noel finally gain a fellow 'member.' And now, Noel's next goal is to take down Burrow's funding source, the Casino 'Misty.' Disguised in uniforms, Noel and the others sneak in. Take down the Casino swirling in conspiracy by using 'cheats!' Burrows loses his important source of funds as Casino 'Misty' goes up in flames. With a weakening police force, Noel and the others decide this is the time for the biggest attack. The day chosen for the final battle, is the one that changed Noel's fate… …the memorial ceremony. Waiting at the long desired concert hall is Noel's best friend, Jillian. While reminiscing the past, the two girls confirm their resolve to finally confront each other...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/850000/header.jpg?t=1628583956",
    "Price": 14.99,
    "Developers": "Vaka Game Magazine,KANAWO",
    "Publishers": "Vaka Game Magazine,PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/850000/ss_ed6543811f9f3dd962ad066f622088daea532034.1920x1080.jpg?t=1628583956,https://cdn.akamai.steamstatic.com/steam/apps/850000/ss_4f006f904c12d73b488d819d1b64c217de6aaaec.1920x1080.jpg?t=1628583956,https://cdn.akamai.steamstatic.com/steam/apps/850000/ss_af47ab16de19380472a0a3e6f5c356bbc120b935.1920x1080.jpg?t=1628583956,https://cdn.akamai.steamstatic.com/steam/apps/850000/ss_118779d6a8b43b96bcb39a7812ce97ea0783341f.1920x1080.jpg?t=1628583956,https://cdn.akamai.steamstatic.com/steam/apps/850000/ss_44b40aa9d9e81b62b3d5c730c2755396cd7b3fe1.1920x1080.jpg?t=1628583956,https://cdn.akamai.steamstatic.com/steam/apps/850000/ss_fe6ac93f77cc8a3ec2b7dbb241b4a387d43833e9.1920x1080.jpg?t=1628583956",
    "Slug": "noel-the-mortal-fate-s1-7",
    "Meta Title": "Noel the Mortal Fate S1-7: May 15, 2018, Vaka Game Magazi...",
    "Meta Description": "Looking for information on Noel the Mortal Fate S1-7? Check out the release date (May 15, 2018), developer insights from Vaka Game Magazine,KANAWO, and ...",
    "Alt Text Image": "Official header image for Noel the Mortal Fate S1-7 game - Steam 850000",
    "Canonical URL": "https://gusku.site/game/noel-the-mortal-fate-s1-7",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Noel the Mortal Fate S1-7\", \"description\": \"Looking for information on Noel the Mortal Fate S1-7? Check out the release date (May 15, 2018), developer insights from Vaka Game Magazine,KANAWO, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Vaka Game Magazine,KANAWO\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vaka Game Magazine,PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/850000/header.jpg?t=1628583956\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}