{
    "AppID": 1029940,
    "Name": "Open Colour",
    "Release date": "Nov 1, 2019",
    "About the game": "Mood Lighting The Color of Open Colour comes from the Color Room. The Color Room offers 10 hidden features along with an infinite amount of Color possibilities. Say, you don't want the Color Pattern? No worries! Simply change the Color Tone to meet your needs using the arrow keys.. Say, you don't want the Color to be so bright? No worries! Simply change the Color Brightness using one of the many Color Control's keyboard inputs. Will you find all seven of the hidden Color Rooms? Only time will tell, but the future is clouded... Decorations Open up your real space to the virtual world, or bring the virtual world into your real space using Open Colour's Decorations Room. You can Interact with Decoration Sets as a whole, or use the Decoration Controls to interact with over 100,000 Decoration Variations, from 15 different Decoration Sets. The Decoration Room is perfect for use, night and day… and you might even find a friend along the way... Take a Chance Use the Dice Room to take a chance on seeing over 10 pieces of hidden Abstract Artwork. If you want something a little more recognizable, the Dice Room has over 40 different sprites and over 80 variations for you to display on your Monitor. By using the Dice Room Clock you can keep the time with a unique image to look at. Do you want to take a chance on the Dice Room? Your fortune is written in the stars… Open Colour Open Colour is a great way to have something interesting to show on your computer’s screen. Perfect for use at a party, while your working, or anytime you’re around your computer. You can always keep the time using one of Open Colour’s 5 different Clocks, which offer a variety of different locations to be displayed at. Don’t like time? Use the Clock Settings to turn the Clocks off Use the Color Room to change the mood of your room. Use the Decorations Room to widen your real space into the virtual world. Use the Dice Room to take a chance on Abstract Artwork, or something you might recognize. Open Colour, the perfect enhancer for your real space.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1029940/header.jpg?t=1603813986",
    "Price": 0.99,
    "Developers": "Jonah Rollins",
    "Publishers": "Jonah Rollins",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1029940/ss_a1a20f3ace553fc653a1086df232e0beb176a6ae.1920x1080.jpg?t=1603813986,https://cdn.akamai.steamstatic.com/steam/apps/1029940/ss_8dbe1077c2178deb156844e4862a5ec37d833acc.1920x1080.jpg?t=1603813986,https://cdn.akamai.steamstatic.com/steam/apps/1029940/ss_1323b106c68f7eef4cbcc0c4d5b30988632835d6.1920x1080.jpg?t=1603813986,https://cdn.akamai.steamstatic.com/steam/apps/1029940/ss_c2f579080daeafc32cc25313c0231067a4624620.1920x1080.jpg?t=1603813986,https://cdn.akamai.steamstatic.com/steam/apps/1029940/ss_36f49b8bd792301bfae1f9a01c309dc6955a7b41.1920x1080.jpg?t=1603813986,https://cdn.akamai.steamstatic.com/steam/apps/1029940/ss_21d17527fde16169e997525e3f5366a32f9b6e7f.1920x1080.jpg?t=1603813986",
    "Slug": "open-colour",
    "Meta Title": "Open Colour: Nov 1, 2019, Jonah Rollins and Full Overview",
    "Meta Description": "Looking for information on Open Colour? Check out the release date (Nov 1, 2019), developer insights from Jonah Rollins, and a complete game summary.",
    "Alt Text Image": "Official header image for Open Colour game - Steam 1029940",
    "Canonical URL": "https://gusku.site/game/open-colour",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Open Colour\", \"description\": \"Looking for information on Open Colour? Check out the release date (Nov 1, 2019), developer insights from Jonah Rollins, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jonah Rollins\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jonah Rollins\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1029940/header.jpg?t=1603813986\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}