{
    "AppID": 1394520,
    "Name": "Path to Prosperity",
    "Release date": "Sep 18, 2020",
    "About the game": "Setting In Path to Prosperity, you are sent to the small village on a newly discovered island in order to develop the settlement and create a thriving industry. In order to win, you have to amass wealth, and send a predetermined amount of coin back to your homeland. But every development costs coin, and you have to constantly assess whether an investment is going to pay off for you in the long run. You start with only few houses and villagers, and let your people collect food and resources for you until you can support more villagers. Build up your logistics and start producing goods you can sell. Continuously increase the size of your economy and settlement, and make sure you can defend what you have created, while ensuring you are more efficient than your opponents! Competitors While you only have pirates to content with in singleplayer, you can play against up to 3 friends in multiplayer. The first to send home the agreed upon amount of coin wins - but if you do too well, your competitors may choose to spend their coin on soldiers to attack you. Every investment needs to be weighed and often the person who seemed to be falling behind can end up on top. First Person Perspective In Path to Prosperity, you are thrown into the shoes of a commander on an island - with all advantages and disadvantages this brings with it. Unlike in a traditional RTS, you can't zoom out to get a better feeling for the land, or see an opponent's army advance from halfway across the map. So exploration, anticipating your opponents moves, securing chokepoints, and staying on top of what is happening on the island is paramount to secure victory. Having your boots on the ground also means that you can quickly leap in to make important changes, however, so you can cut down a tree if your villagers are slow to collect wood; you can build that house next to your new mine; or take out a gun to help fend off the pirates - just make sure to not get distracted from the bigger picture! Build your settlement The most efficient way of getting things done on the island is by using your villagers to collect resources, produce goods, and defend what you have created. Every house you place provides additional room for villagers, and every villager uses food. Make sure that your food production and deliveries to your markets are always secure to avoid your peoples' starvation. Should your villagers die, they will come back on the next ship - but you will have to reallocate their jobs and the disruption may just mean that your competitors overtake you. Once your settlement is large enough, you can use buildings like the bathhouse or cafe to increase your peoples' productivity and make your city look much more appropriate for your achievements. Explore and find riches Every island has riches hidden in the jungle. A node system spawns random loot, ore veins, and pirates of different value and threat throughout the map. Exploring the island can not only give you a better lay of the land, but can also provide your settlement with early advantages, or lead to the discovery of a gold or gem vein that you can exploit. But balance your exploration carefully - the existence of a rich vein is not guaranteed, and you may be better off managing your settlement instead. Conversely, ignoring what the island has to offer may allow your competitors to win without your intervention. The seed market Traders offer seeds for nutritional and luxury crops at your port. The seeds are randomised in each game and you have to adapt to what is available. The market is also limited in quantity, so any seed you buy is unavailable for your competitor and vice versa. Choose carefully whether you invest in a crop early on, or whether it is better for you to go with cheaper, less profitable industries to begin with. Additional crops will become available to you when you have submitted a quarter, half, and three-quarter of the required coin to your Queen, so time your submissions to reap the most rewards.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1394520/header.jpg?t=1625166973",
    "Price": 14.99,
    "Developers": "Essence Games",
    "Publishers": "Essence Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1394520/ss_d98ddc4795cc2c142f0ea0a7c762a0e95740b090.1920x1080.jpg?t=1625166973,https://cdn.akamai.steamstatic.com/steam/apps/1394520/ss_ff035c181b7cc881becedc94e502c7ba01165a3e.1920x1080.jpg?t=1625166973,https://cdn.akamai.steamstatic.com/steam/apps/1394520/ss_fc9a841cca2e17fbf7bf2f3e2845ddebda7f19ce.1920x1080.jpg?t=1625166973,https://cdn.akamai.steamstatic.com/steam/apps/1394520/ss_0f1309454eaefcb2d1be881cf038ec843097d49b.1920x1080.jpg?t=1625166973,https://cdn.akamai.steamstatic.com/steam/apps/1394520/ss_ad4e4a997cf39fed0d08e8b53d08fd8f1de2122a.1920x1080.jpg?t=1625166973,https://cdn.akamai.steamstatic.com/steam/apps/1394520/ss_03b27201dd2e3d88b8e890f3b8e04023f0c36beb.1920x1080.jpg?t=1625166973,https://cdn.akamai.steamstatic.com/steam/apps/1394520/ss_ce7372f1f75af592526cf2994aa559e946099d90.1920x1080.jpg?t=1625166973,https://cdn.akamai.steamstatic.com/steam/apps/1394520/ss_63fee9d2265f95856fb7fc624f04298be8e592c6.1920x1080.jpg?t=1625166973,https://cdn.akamai.steamstatic.com/steam/apps/1394520/ss_420df9821e7551d0fe075723fa9865a4caaae5c8.1920x1080.jpg?t=1625166973,https://cdn.akamai.steamstatic.com/steam/apps/1394520/ss_1cc893ff613411ebbc64188ae7ff2b409326a6d7.1920x1080.jpg?t=1625166973",
    "Slug": "path-to-prosperity",
    "Meta Title": "Path to Prosperity: Sep 18, 2020, Essence Games and Full ...",
    "Meta Description": "Looking for information on Path to Prosperity? Check out the release date (Sep 18, 2020), developer insights from Essence Games, and a complete game sum...",
    "Alt Text Image": "Official header image for Path to Prosperity game - Steam 1394520",
    "Canonical URL": "https://gusku.site/game/path-to-prosperity",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Path to Prosperity\", \"description\": \"Looking for information on Path to Prosperity? Check out the release date (Sep 18, 2020), developer insights from Essence Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Essence Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Essence Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1394520/header.jpg?t=1625166973\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}