{
    "AppID": 777420,
    "Name": "Quests Unlimited",
    "Release date": "Feb 13, 2018",
    "About the game": "Quests Unlimited is a fusion of an idle game and traditional RPG. Gone are the days of grinding dungeons yourself over and over again in an effort of progressing your characters. All the grinding is done for you. You can watch the epic struggle between your party and a giant ogre, or you can tab out of the game and read your emails. Tab back into the game when you've had your fill of surfing the web and utilize all the gold your party has acquired to upgrade their gear and deliver even more devastation! Key features: Smart camera following system. The camera will dynamically follow your party to always give you the best view of the action. Level progression system. Your party gains experience as they defeat monsters and complete quests allowing them to level up. Equipment upgrade system. A member of your party straggling behind? Spend some gold to upgrade their equipment so they can more efficiently destroy your enemies. Save/load system with auto-save option. NO MICRO TRANSACTIONS! Make constant progress in a grind heavy RPG style game without wasting your life! To be very clear, Quests Unlimited is a game that you don't have to actively play. There's no mechanics requiring twitch reflexes or any sort of competitive pvp or the like. This is a game for people who enjoy older style rpg's but don't have the time to invest into the progression systems of those style of games. The goal is to give the player the satisfying feeling of progression without having to invest their entire life in a game. This kind of game is not for everyone so please be aware of what this product is trying to be and not expect it to be something else. This game can and will play completely by itself, but that doesn't mean it always should! Take advantage of the lower cool-downs of player initiated skills. Drink potions to keep your party members in the fight. Upgrade strategically to aid your chances in encounters. There are ways to be active in the game to make progression faster and more lucrative, so by all means keep the game active and enjoy yourself. Just know that the game will continue playing and everything will be fine even if you're called away from your computer unexpectedly.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/777420/header.jpg?t=1550970561",
    "Price": 4.99,
    "Developers": "Oxrock Studio",
    "Publishers": "Oxrock Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/777420/ss_9ec71487eb3514313f8bc0f2f46554e9125b1aa8.1920x1080.jpg?t=1550970561,https://cdn.akamai.steamstatic.com/steam/apps/777420/ss_8897a7e51cfe5088c1b67ce565eba1ca5a3b17f0.1920x1080.jpg?t=1550970561,https://cdn.akamai.steamstatic.com/steam/apps/777420/ss_9b03322b13e3d1c82b869da7bad1aa503a0ea91b.1920x1080.jpg?t=1550970561,https://cdn.akamai.steamstatic.com/steam/apps/777420/ss_81e1c1a61dda1144c9549d901588f6b080b87ec1.1920x1080.jpg?t=1550970561,https://cdn.akamai.steamstatic.com/steam/apps/777420/ss_eae770fa65803638a31e5dd89adf7cd186011f06.1920x1080.jpg?t=1550970561",
    "Slug": "quests-unlimited",
    "Meta Title": "Quests Unlimited: Feb 13, 2018, Oxrock Studio and Full Ov...",
    "Meta Description": "Looking for information on Quests Unlimited? Check out the release date (Feb 13, 2018), developer insights from Oxrock Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Quests Unlimited game - Steam 777420",
    "Canonical URL": "https://gusku.site/game/quests-unlimited",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Quests Unlimited\", \"description\": \"Looking for information on Quests Unlimited? Check out the release date (Feb 13, 2018), developer insights from Oxrock Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Oxrock Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Oxrock Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/777420/header.jpg?t=1550970561\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}