{
    "AppID": 962230,
    "Name": "Quicken® WillMaker® Plus 2019 and Living Trust",
    "Release date": "Nov 9, 2018",
    "About the game": "Quicken® WillMaker® Plus 2019 and Living Trust is the easiest way to create your estate plan, whether you're just getting started or you want to update your previous arrangements. This powerful software guides you through the process from beginning to end, giving you the practical and legal information you need to make the best decisions for you and your family. Quicken WillMaker Plus is the original will-writing software, created and updated regularly by Nolo’s experts. Free legal updates will keep your program current through 2019. Technical support is also available. The benefits of using Quicken WillMaker Plus include: • A customized estate plan for you and each member of your family, including a will, health care directive and other essential documents * • An easy-to-use interview format that lets you complete documents at your own pace • A user-friendly legal manual answers common questions • A team of lawyer-editors working to ensure each document reflects the laws of your state* • Get free living trust software! (Requires registration.) * Estate planning documents are not valid in Canada, Louisiana or U.S.Territories. Get Nolo’s Living Trust Software! Register your copy of Quicken WillMaker Plus 2019 to access Nolo’s Living Trust software. Make a legally valid living trust document to ensure that your property bypasses lengthy and expensive probate proceedings and goes directly to the people you've designated. Online Promissory Note Use this online promissory note (like an IOU) to lend or borrow money. With this form, you can choose from the following types of loans: • installment payments without interest • installment payments with interest • lump-sum payment • interest-only payments (balloon payment) You’ll be able to revise, print, send or download your promissory notes at any time during your one-year subscription. Secure access, anytime, anywhere. Free NoloCloud Form When you register your Quicken WillMaker Plus you will also get a free one-year subscription to any online form of your choice. With NoloCloud you can access your form anywhere at any time. We have forms for real estate, estate planning, business, finance and much more. Restrictions apply. Want to know more? Here’s a closer look at what you can do with Quicken WillMaker Plus: Your Will The heart of every estate plan is a will, also known as a last will and testament. This legal document puts you in control of who inherits your property and who would take care of your children if it were ever necessary. Without a will, state law determines these issues. Your will also allows you to name an executor (sometimes called a “personal representative”) to carry out our wishes. And you can appoint a trusted person to manage property left to young people. With Quicken WillMaker Plus, you can revise and update your will whenever you like. Living Trust Ensure that your property bypasses lengthy and expensive probate proceedings. Your Health Care Directive Spare your loved ones difficult decisions by laying out your wishes for medical care and naming someone to carry out your instructions. Health Care Power of Attorney Name a trusted person (your “health care agent”) to make important medical decisions for you if necessary. Living Will State what types of medical treatment you do or do not want if you are too ill or injured to direct your own care. Your health care providers must do all they can to follow your wishes. Your Durable Power of Attorney for Finances A durable power of attorney ensures that someone you trust (called your “agent” or “attorney-in-fact”) will be on hand to manage the many practical, financial tasks that will arise if you become incapacitated. For example, bills must be paid, bank deposits must be made and someone must handle insurance and benefits paperwork. In most cases, a durable power of attorney for finances is the best way to take care of tasks like these. Your Final Arrangements Plan a funeral or other ceremony and ease the burden on your loved ones. Describe your preferences for burial, cremation, memorials, obituaries and more. Documents for Your Executor Make sure your executor has needed forms and instructions to do the job: checklists, letters, notices and claim forms. Information for Caregivers and Survivors Organize your information so that your survivors don't have to. Use this document to give them details about everything from bank accounts, to passwords, to the names of people you’d like contacted in the event of an emergency. Create the following forms with Quicken WillMaker Plus 2019: Estate Planning • Will • Living Trust (requires registration) • Durable Power of Attorney for Finances • Final Arrangements • Health Care Directive (Living Will &amp; Health Care Power of Attorney) • Information for Caregivers and Survivors • Letter to Survivors • Property Worksheet • Revocation of Health Care Directive • Revocation of Power of Attorney Executors • Affidavit of Domicile • Employee Death Benefits Letter • Executor’s Checklist • Executor’s Letter to Financial Institution • General Notice of Death • Notice to Creditor of Death • Request for Death Certificate Home and Family • Authorization for International Travel With Minor • Authorization for Minor’s Medical Treatment • Authorization to Drive a Motor Vehicle • Child Care Agreement • Child Care Instructions • Elder Care Agreement • Housekeeping Services Agreement • House sitting Instructions • Notice to Put Name on Do Not Call List • Pet Care Agreement • Request for Birth Certificate • Subscription or Membership Cancellation form • Temporary Guardianship Authorization for Care of Minor Personal finance • General Bill of Sale • Limited Power of Attorney for Finances • Notice to Terminate Joint Credit Card Account • Online Promissory Note • Revocation of Power of Attorney • Security Agreement for Borrowing Money",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/962230/header.jpg?t=1541787411",
    "Price": 79.99,
    "Developers": "Nolo",
    "Publishers": "Individual Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/962230/ss_78beaf1bd9c31024f9784844de20a9e6459adaf5.1920x1080.jpg?t=1541787411,https://cdn.akamai.steamstatic.com/steam/apps/962230/ss_80e790d9159026d9da2d0a137f378a1126cf9401.1920x1080.jpg?t=1541787411,https://cdn.akamai.steamstatic.com/steam/apps/962230/ss_9f9ec69105e4fd90536d27d581ae7650fcc5f292.1920x1080.jpg?t=1541787411,https://cdn.akamai.steamstatic.com/steam/apps/962230/ss_91538efd700805fa5ee09494402205462d8052a3.1920x1080.jpg?t=1541787411,https://cdn.akamai.steamstatic.com/steam/apps/962230/ss_dcd351dff968a0ce5d328b42ea013b190c7aacdd.1920x1080.jpg?t=1541787411",
    "Slug": "quicken-willmaker-plus-2019-and-living-trust",
    "Meta Title": "Quicken® WillMaker® Plus 2019 and Living Trust: Nov 9, 20...",
    "Meta Description": "Looking for information on Quicken® WillMaker® Plus 2019 and Living Trust? Check out the release date (Nov 9, 2018), developer insights from Nolo, and a...",
    "Alt Text Image": "Official header image for Quicken® WillMaker® Plus 2019 and Living Trust game - Steam 962230",
    "Canonical URL": "https://gusku.site/game/quicken-willmaker-plus-2019-and-living-trust",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Quicken\\u00ae WillMaker\\u00ae Plus 2019 and Living Trust\", \"description\": \"Looking for information on Quicken\\u00ae WillMaker\\u00ae Plus 2019 and Living Trust? Check out the release date (Nov 9, 2018), developer insights from Nolo, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nolo\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Individual Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/962230/header.jpg?t=1541787411\", \"offers\": {\"@type\": \"Offer\", \"price\": 79.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}