{
    "AppID": 1057790,
    "Name": "Ramen",
    "Release date": "Apr 24, 2019",
    "About the game": "Ramen spends a lot of time considering how best to spend his last productive days. He recently learned that some silent investors for a small pizza restaurant have secretly hidden their tax returns deep in a privately owned local uranium mine. He insisted on revealing the source of their dirty money to the public and it’s gotten him into some hot water. He snuck his way inside the mine, found out where they keep the records, and just before he strapped the documents to his back in preparation to leave, he thought “Will this be a worthwhile escape?” He then enthusiastically blindfolded himself for added danger! He didn’t know you were coming to help, he barely knows you’re there, and he doesn’t think he needs you. Your mission, should you choose to accept it, is to guide and protect Ramen during his passage through the dangerous valley. Keep him alive so the truth about those crooks can be brought to light. In this game, you start with an birds eye view of a map full of obstacles and enemies. You must first chart the path across the playing field that Ramen, the character you are escorting and protecting, will follow once the action starts. Simultaneously, you can purchase ammunition and powerups that will assist you for the successful completion of each stage. Enemies and obstacles are randomly distributed at the start of each match. Every match is unique. Once you click 'Ready', you can start to clear enemies from the map. There is a fixed number of enemies that will spawn. It is recommended that you take down each group of enemies using the type of munition that's designed to do the most damage to that enemy type as that will allow you to start the final boss fight with the most firepower at your disposal. The boss is the same character on every map but his behavior is dependent on your play style. If you collect all the hidden folders, clear a sufficient amount of enemies, and get Ramen across the finish line with full health, you will have defeat the game with a perfect score.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1057790/header.jpg?t=1556090010",
    "Price": 3.99,
    "Developers": "Loxodonta",
    "Publishers": "Loxodonta",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1057790/ss_236eb666501f3f1069576fb740b0329057049235.1920x1080.jpg?t=1556090010,https://cdn.akamai.steamstatic.com/steam/apps/1057790/ss_24a86b522a41030171340a856b4f47e1941ac9cf.1920x1080.jpg?t=1556090010,https://cdn.akamai.steamstatic.com/steam/apps/1057790/ss_d78b58a3b3421fd322119771099cd9a989b129ce.1920x1080.jpg?t=1556090010,https://cdn.akamai.steamstatic.com/steam/apps/1057790/ss_7440302297dad84b562575c5219fa2131e96dbce.1920x1080.jpg?t=1556090010,https://cdn.akamai.steamstatic.com/steam/apps/1057790/ss_bd5b60380a2d10043f6708c68460ef8338fad39e.1920x1080.jpg?t=1556090010,https://cdn.akamai.steamstatic.com/steam/apps/1057790/ss_52b46c635df1080c088b475641070ab20d1507c6.1920x1080.jpg?t=1556090010",
    "Slug": "ramen",
    "Meta Title": "Ramen: Apr 24, 2019, Loxodonta and Full Overview",
    "Meta Description": "Looking for information on Ramen? Check out the release date (Apr 24, 2019), developer insights from Loxodonta, and a complete game summary.",
    "Alt Text Image": "Official header image for Ramen game - Steam 1057790",
    "Canonical URL": "https://gusku.site/game/ramen",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ramen\", \"description\": \"Looking for information on Ramen? Check out the release date (Apr 24, 2019), developer insights from Loxodonta, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 24, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Loxodonta\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Loxodonta\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1057790/header.jpg?t=1556090010\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}