{
    "AppID": 967460,
    "Name": "Red Eclipse",
    "Release date": "Dec 19, 2019",
    "About the game": "A modern, completely free first person shooter. No fees, no microtransactions, no lootboxes. Fast paced, modern first person shooter action with seven unique main weapons. Built on the permissively licensed, open source Tesseract engine. Available for Windows, GNU/Linux, BSD, and macOS. Parkour, impulse boosts, dashing, and other tricks. A huge amount of mutators and game altering variables. Create maps with other players in realtime co-op edit. Over 15 years of active development, and still going! Red Eclipse builds on its own legacy of fast-paced unique, impactful gameplay and combines that with the visual capabilities of the superb and modern Tesseract engine to create a game that redefines what a first person shooter is. There is absolutely no money whatsoever behind this project, and the entirety of the assets and source code are freely available to copy, modify, and redistribute. The entirety of the game is built on the contributions of volunteers, from the engine (which does not trace its heritage to any commercial studio) to the assets, levels, modes, user interfaces, and maps. We do not recieve lucrative income from selling skins or lootboxes or any microtransactions, and the servers and infrastructure is graciously run and maintained by volunteers. This game is built on the Tesseract engine, written by one of our developers, Lee Salzman. Tesseract is a modern, deferred pipeline engine with realtime dynamic lighting, shadows, HDR, screenspace reflection, and dynamic organic model deformation. Tesseract and its predecessors, Cube and Cube 2, are all built from the ground up as open source engines with more permissive licensing than essentially every other 3D engine available. In a 'by the people, for the people' nature, we try to work closely with our community and invite everyone to have their say in order to provide a better overall experience, aiming to create a game environment that is fun and easy to play, while still having elements to master. If you think you might have something to contribute to the game or community, please feel free to talk to us. We maintain a standard of friendly behaviour in our community, so don't be afraid to speak up and have your say in building this game for us all!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/967460/header.jpg?t=1640934864",
    "Price": 0.0,
    "Developers": "Quinton Reeves,Lee Salzman",
    "Publishers": "Quinton Reeves",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/967460/ss_14873d8586cea19cc43e8e4a90f176929fe0b1d7.1920x1080.jpg?t=1640934864,https://cdn.akamai.steamstatic.com/steam/apps/967460/ss_2f9a84b7ca5fb467cb76fdf19707719eb2d84a4b.1920x1080.jpg?t=1640934864,https://cdn.akamai.steamstatic.com/steam/apps/967460/ss_790730ce35cdace359cb1464dcdd350c96ff8d96.1920x1080.jpg?t=1640934864,https://cdn.akamai.steamstatic.com/steam/apps/967460/ss_46db525a90229bbcf048a09512389bea5ad82804.1920x1080.jpg?t=1640934864,https://cdn.akamai.steamstatic.com/steam/apps/967460/ss_2e9171a35e307846aef3956c1e33e11144f65aec.1920x1080.jpg?t=1640934864",
    "Slug": "red-eclipse",
    "Meta Title": "Red Eclipse: Dec 19, 2019, Quinton Reeves,Lee Salzman and...",
    "Meta Description": "Looking for information on Red Eclipse? Check out the release date (Dec 19, 2019), developer insights from Quinton Reeves,Lee Salzman, and a complete ga...",
    "Alt Text Image": "Official header image for Red Eclipse game - Steam 967460",
    "Canonical URL": "https://gusku.site/game/red-eclipse",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Red Eclipse\", \"description\": \"Looking for information on Red Eclipse? Check out the release date (Dec 19, 2019), developer insights from Quinton Reeves,Lee Salzman, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 19, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Quinton Reeves,Lee Salzman\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Quinton Reeves\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/967460/header.jpg?t=1640934864\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}