{
    "AppID": 590690,
    "Name": "Sprint Vector",
    "Release date": "Feb 8, 2018",
    "About the game": "The most popular game show in the universe is always scouting for stars... and its newest and brightest is YOU! Hosted by everyone’s favorite robo-personality, Mr. Entertainment, Sprint Vector sends its intrepid contestants running, jumping, climbing, flinging, drifting, and even flying across crazy interdimensional race courses and challenge maps where your speed and finesse are put to the test. These intense head-to-head matches have become the must-see event of the millennium! Sprint Vector is the ultimate competitive VR game: a multiplayer adrenaline platformer that merges the physical thrill of extreme sports competition with the unhinged energy of a zany game show spectacle. Survios’ innovative Fluid Locomotion System lets you comfortably attain and maintain extreme speeds in VR. Use your entire body to run, jump, drift, zip, climb, fling, shoot, dodge, and fly with intuitive motion controls! Add in a pulsing electronic soundtrack, hilarious running commentary, powerful projectiles and boosts, as well as multiplayer support for up to eight players, and you’ve got a hit show no matter what planet you’re on! Step into the vector blades of an intergalactic star, rev up, and explode onto Sprint Vector’s colorful landscapes on a variety of races courses and challenge maps. Scale towering pyramids and plunge into alien ruins, leap across giant pits while dodging debilitating blobs of sludge, or survive the trap-riddled roads of an ancient city—but watch out for your fellow sprinters! It’s just one slow mine, nitro, or impulse jump between glory and defeat. Competitive multiplayer matches : Public and private online multiplayer modes pit up to eight players against each other in intense, high-speed races as you vie for a spot on the Global Leaderboards. 12 killer race tracks : 12 complex race courses full of obstacles, shortcuts, and game-changing power-ups make for endless replay value. Nine challenge courses : Take on these diabolical courses designed to test your sprinting prowess to the extreme. Tackle three specific challenges across nine single-player challenge courses with Local and Global Leaderboards. Customizable solo play : Run through courses and learn the ropes at your own pace with customizable solo game settings. Weapons and Power-Ups : What’s a little friendly competition without a bit of self-serving sabotage? Take aim at both the course and your competitors with glove blasts and game-changing power-ups. Eight intergalactic competitors : Choose from eight colorful characters “recruited” from every corner of the galaxy, from notorious Daxx to ethereal Luna to streetwise Hendrix, each with multiple skins.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/590690/header.jpg?t=1565043590",
    "Price": 29.99,
    "Developers": "Survios",
    "Publishers": "Survios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/590690/ss_47dbcf246ecaf43dc2732a1a41f052ae8ff501fc.1920x1080.jpg?t=1565043590,https://cdn.akamai.steamstatic.com/steam/apps/590690/ss_bce38246eba6663b512294e685179190be258825.1920x1080.jpg?t=1565043590,https://cdn.akamai.steamstatic.com/steam/apps/590690/ss_9a35db803970a285804f97ff078eca1f0bf30146.1920x1080.jpg?t=1565043590,https://cdn.akamai.steamstatic.com/steam/apps/590690/ss_375e95672a3e8b8567d1fc459c577dbf555247d4.1920x1080.jpg?t=1565043590,https://cdn.akamai.steamstatic.com/steam/apps/590690/ss_25e54853de3b53c0bd629357d1d57ea82dbc3fdc.1920x1080.jpg?t=1565043590,https://cdn.akamai.steamstatic.com/steam/apps/590690/ss_250d7fb827f4862e980b096121670e49ceadb761.1920x1080.jpg?t=1565043590,https://cdn.akamai.steamstatic.com/steam/apps/590690/ss_408821d4e4c7b027ad1285c9776ded7d370c0744.1920x1080.jpg?t=1565043590",
    "Slug": "sprint-vector",
    "Meta Title": "Sprint Vector: Feb 8, 2018, Survios and Full Overview",
    "Meta Description": "Looking for information on Sprint Vector? Check out the release date (Feb 8, 2018), developer insights from Survios, and a complete game summary.",
    "Alt Text Image": "Official header image for Sprint Vector game - Steam 590690",
    "Canonical URL": "https://gusku.site/game/sprint-vector",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sprint Vector\", \"description\": \"Looking for information on Sprint Vector? Check out the release date (Feb 8, 2018), developer insights from Survios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Survios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Survios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/590690/header.jpg?t=1565043590\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}