{
    "AppID": 1033640,
    "Name": "SYNAPTIC DRIVE",
    "Release date": "May 28, 2020",
    "About the game": "【About】 1-on-1 3D online shooting battles with fixed camera angle. While players attack straight ahead with guns, they can also fire and steer homing bullets with wires, and time-lag attack to shave down HP with trackers. The sizes of the battle arenas are just right, and stopping for a moment can become your downfall. You'll need to push yourself and awaken synapses to handle the speed. 【World Setting】 Set hundreds of years in the future, diverse fighters from space have assembled on one planet to battle in competitions. Some want to show off their abilities, some live to fight, while others are after prize money... Whatever the reason may be, they're all aiming to come out on top. To attain superhuman reflexes, these fighters have mechanized their bodies to activate synapses in the brain. Such are the origins of Synaptic Drive™. 【Customization】 The key to victory lies in customization.First, select a body, then customize to your liking by choosing from over 100 types of trackers, wires, and guns. Zip around with a light body and machinegun, or go with a durable heavy body to take on hits from bombs,it's all up to you. 【Gun】 Your main weapon, and the one that attacks straight ahead. This will act as the core of your attacks since it fires faster than the other weapon types. 【Wire】 A homing weapon that can have its trajectory controlled after firing. Fly it towards evading enemies, turning corners to efficiently land it. 【Tracker】 Put pressure on your enemies with auto-tracking bullets. Use in combination with other weapons and chase them down with time-lag attacks. There are various types of trackers, with some that install onto the ground and others that follow along. 【Body】 This part determines not only durability and speed, but how your character looks. Choose a body by tactical abilities, or just focus on how cool they look. There are also apparently bodies that are hidden away... Play and find out for yourself. 【Battle Arenas】 The beautiful scenes that make up the various arenas are enough to heal the minds of players grown tired from fighting. However, don't forget that these are rigorous battle grounds, and arena walls will turn into shields for machinegun bullets once battle begins. There are also blocks within the arenas that will break, so which arena you go with is vital to increasing the number of victories you land. 【Cross-platform Match】 You can play online matches against users all over the world including Nintendo Switch users. Experience the battle across platforms.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1033640/header.jpg?t=1593162355",
    "Price": 29.99,
    "Developers": "Thousand Games",
    "Publishers": "YUNUO GAMES",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1033640/ss_41f5d733d3c2474855951d2ca61df66ef67d065b.1920x1080.jpg?t=1593162355,https://cdn.akamai.steamstatic.com/steam/apps/1033640/ss_74b5cdb72607b574b76f4214ecf66f3c1bf2d924.1920x1080.jpg?t=1593162355,https://cdn.akamai.steamstatic.com/steam/apps/1033640/ss_62d066d9440c6058d1101132789e2b7362600ff4.1920x1080.jpg?t=1593162355,https://cdn.akamai.steamstatic.com/steam/apps/1033640/ss_f69177e1df07e62b62529471dd1e895258925aa1.1920x1080.jpg?t=1593162355,https://cdn.akamai.steamstatic.com/steam/apps/1033640/ss_44a898a22bde8a8f77a727bc69a4dae327aec8ff.1920x1080.jpg?t=1593162355,https://cdn.akamai.steamstatic.com/steam/apps/1033640/ss_112e012b3b72ff7c23ff7043d7e5aa3a32bd0370.1920x1080.jpg?t=1593162355",
    "Slug": "synaptic-drive",
    "Meta Title": "SYNAPTIC DRIVE: May 28, 2020, Thousand Games and Full Ove...",
    "Meta Description": "Looking for information on SYNAPTIC DRIVE? Check out the release date (May 28, 2020), developer insights from Thousand Games, and a complete game summary.",
    "Alt Text Image": "Official header image for SYNAPTIC DRIVE game - Steam 1033640",
    "Canonical URL": "https://gusku.site/game/synaptic-drive",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SYNAPTIC DRIVE\", \"description\": \"Looking for information on SYNAPTIC DRIVE? Check out the release date (May 28, 2020), developer insights from Thousand Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 28, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Thousand Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"YUNUO GAMES\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1033640/header.jpg?t=1593162355\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}