{
    "AppID": 1679770,
    "Name": "Tank Guards",
    "Release date": "Jul 16, 2021",
    "About the game": "'Tank Guards' is a tank as the theme of the strategic defense class to develop the game. Terrible enemies will invade your base, you have to upgrade your base, arm your tanks, and take advantage of the terrain, with friends to defend against their crazy attack. ★ Unique custom mode You can customize everything in the game, maps, graphics, music, experience different fun ★ Rich topographic maps There are not only rich official maps, but also a random map mode, which allows you to customize the occurrence probability of items and obstacles, giving you a different strategy experience every time you play. You can also customize the map and play with the map you want to play. You can also open all map random appearance mode, official map, custom map, random map random appearance, make the map experience more rich. ★ Plenty of tanks There are 26 types of enemies, including self-exploding tanks, collision tanks, stationary long-range rocket tanks, etc., to make the game more challenging. ★ Rich props There are 46 powerful items, such as rocket barrel items that do a lot of damage, signalling items that can automatically target enemies, powerful barrel items that can push enemy tanks into the water to drown enemies, and powerful barrel items that can throw enemies off the map to death, etc. You can collect gold to buy items, or you can sell the original price of the items for gold. Some items do not co-exist, so you need to find a way to build a powerful tank. When you first enter the battlefield, you can replace more advantageous tanks according to the map. You can only replace them once per round. You can customize the occurrence probability of items. ★ Rich terrain There are 11 completely different terrain types. There are rivers that can drown enemies, barriers that tanks can pass through but bullets can't, fortresses that can block bullets, marshes that can trap tanks, etc. Make the experience richer. ★ You can get gold coins from the battlefield. The more enemies you annihilate, the more difficult it is, and the more passes you pass, the more gold coins you will get. ★ In the mode setting interface, you can enter the tank factory. You can upgrade it and purchase accessories with gold coins. The higher the factory level is, the more tank life is on the battlefield, and unlock new props. ★ Local online Friends can use tanks in your base to fight alongside you. You can customize the buttons for a better game experience. ★ Unlock all Steam achievements",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1679770/header.jpg?t=1626451668",
    "Price": 1.99,
    "Developers": "CAOLEI",
    "Publishers": "CAOLEI",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1679770/ss_bdef3a37e9da995f5eebb797af2bcd3e9700ab9e.1920x1080.jpg?t=1626451668,https://cdn.akamai.steamstatic.com/steam/apps/1679770/ss_a8647eb1191797a98449f671f2a5b86ed9526ebc.1920x1080.jpg?t=1626451668,https://cdn.akamai.steamstatic.com/steam/apps/1679770/ss_3825074e9f002251797a63d9c2adcb41e54b776b.1920x1080.jpg?t=1626451668,https://cdn.akamai.steamstatic.com/steam/apps/1679770/ss_123e8405736187541304c6ddcf740e6af649cf64.1920x1080.jpg?t=1626451668,https://cdn.akamai.steamstatic.com/steam/apps/1679770/ss_773b317b6fbd76226af063acb016ac3c5f546fcd.1920x1080.jpg?t=1626451668",
    "Slug": "tank-guards",
    "Meta Title": "Tank Guards: Jul 16, 2021, CAOLEI and Full Overview",
    "Meta Description": "Looking for information on Tank Guards? Check out the release date (Jul 16, 2021), developer insights from CAOLEI, and a complete game summary.",
    "Alt Text Image": "Official header image for Tank Guards game - Steam 1679770",
    "Canonical URL": "https://gusku.site/game/tank-guards",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tank Guards\", \"description\": \"Looking for information on Tank Guards? Check out the release date (Jul 16, 2021), developer insights from CAOLEI, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"CAOLEI\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CAOLEI\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1679770/header.jpg?t=1626451668\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}