{
    "AppID": 916100,
    "Name": "Telefrag VR",
    "Release date": "Jul 19, 2019",
    "About the game": "Telefrag VR is a hellishly fast-paced shooter with visceral movement and combat mechanics. Dash, shoot, and teleport around unique arenas that feature impossible geometry where there is no right side up and death can come from any direction. You’d better bring your A game and telefrag your enemies into oblivion if you want to excel in PvP duels. Set in an alternative universe where the Roman Empire never collapsed, you step into the shoes of a new breed of a gladiator on the road to becoming a champion. Use your speed, accuracy, and wits to outmaneuver and defeat your enemies, crushing them beneath your feet. Loadout Management – Pick your favorite loadout to outwit your enemy. Combine powerful firearms to create the most powerful set. Each weapon features two firing modes and a unique teleportation attack. Teleport Attacks and Telefrags – Use teleport to move through the play space or telefrag your enemy! See them reduced to a pulp, using the well-known ability. Guns – Pick the best one, including classic arena shooter weapons, such as Rocket Launchers and Flak Cannons, as well as futuristic Plasma Rifles. Fast-Paced Matches – You have two different locomotion types at your disposal. Get comfortable with dash movement or experience, why gladiatorial battles are reserved for the most persistent ones in the free locomotion. Impossible spaces – Fight in unique arenas arranged with no regard for gravity, opening up various angles of attack and movement. The designed maps will force you to be on guard. Arena Game Mode – Fight in 1v1 deathmatches on the principle of rounds. Climb up the leaderboards and conquer the most significant win streak. The Empire has never forgotten about their beliefs and traditions, including gladiatorial battles, which have now become the most prestigious sport in the sprawling intergalactic Empire. You can play 1v1 deathmatches in a best-of-five rounds format to determine the ultimate victor . As for futuristic gladiators, there is no place for losers. Wager your hard-earned loadouts and try to stay alive for as many matches as possible to make your mark in the global leaderboards. PvP matches will require a good knowledge of the arenas in addition to creative use of dashes and teleports to gain the upper hand in combat. But these abilities are for more than just defense and evasion – after all, the game is called Telefrag . Tired of shooting or in the middle of reloading? No problem, teleport through your enemies to watch as they’re reduced to a pulp. The game’s abstract arenas will test your skills. Move dynamically through the designed maps and don't stay in one place under any circumstances. Shoot your opponents with a range of firearms, from the staples of the genre to new, unique entries. But if you’re going to outwit your enemies, you’ll need to choose your loadouts carefully! Some may work better against your opponent than others. Each weapon also has a unique, built-in teleportation attack that is more than just a means of locomotion. Prove that in this prestigious sport you have something to say. Put on VR goggles and immerse yourself in the futuristic times of the Great Empire !",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/916100/header.jpg?t=1632476259",
    "Price": 16.99,
    "Developers": "Anshar Studios",
    "Publishers": "Anshar Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/916100/ss_75a49cd391615ec5ca1bc753269936b33a43e4f6.1920x1080.jpg?t=1632476259,https://cdn.akamai.steamstatic.com/steam/apps/916100/ss_381e3b053404999e80449e42ef9b45f88e1ef36f.1920x1080.jpg?t=1632476259,https://cdn.akamai.steamstatic.com/steam/apps/916100/ss_48a002c6729e4a76df427cd7f78c8c606709c2cd.1920x1080.jpg?t=1632476259,https://cdn.akamai.steamstatic.com/steam/apps/916100/ss_f36569dfea11d413a338ada32111ca9f2e103bc9.1920x1080.jpg?t=1632476259,https://cdn.akamai.steamstatic.com/steam/apps/916100/ss_d002a30bf6bf0716d3f563f04581d7e0d5f4bdac.1920x1080.jpg?t=1632476259,https://cdn.akamai.steamstatic.com/steam/apps/916100/ss_b63e5cfdd96440b36bc164335b8752fc1b103956.1920x1080.jpg?t=1632476259,https://cdn.akamai.steamstatic.com/steam/apps/916100/ss_c2fe188c0e193f500f6ac5d825b741ee530e4034.1920x1080.jpg?t=1632476259,https://cdn.akamai.steamstatic.com/steam/apps/916100/ss_bbb0bb00b5c341e3fe9c6a9e33fbc018037c6f91.1920x1080.jpg?t=1632476259,https://cdn.akamai.steamstatic.com/steam/apps/916100/ss_8a48ac3acb2fe623e5ff91ed7e1e0fccb100adf9.1920x1080.jpg?t=1632476259,https://cdn.akamai.steamstatic.com/steam/apps/916100/ss_ee4d7d92cca886786dc276a63dc831e76745052c.1920x1080.jpg?t=1632476259",
    "Slug": "telefrag-vr",
    "Meta Title": "Telefrag VR: Jul 19, 2019, Anshar Studios and Full Overview",
    "Meta Description": "Looking for information on Telefrag VR? Check out the release date (Jul 19, 2019), developer insights from Anshar Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Telefrag VR game - Steam 916100",
    "Canonical URL": "https://gusku.site/game/telefrag-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Telefrag VR\", \"description\": \"Looking for information on Telefrag VR? Check out the release date (Jul 19, 2019), developer insights from Anshar Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 19, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Anshar Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Anshar Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/916100/header.jpg?t=1632476259\", \"offers\": {\"@type\": \"Offer\", \"price\": 16.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}