{
    "AppID": 1777980,
    "Name": "Touhou Adventure",
    "Release date": "Oct 20, 2021",
    "About the game": "Touhou Adventure takes place in the land of Gensokyo, a super natural realm made of magic. Dangerous youkais dwells the infamous places of Gensokyo, prepare yourself to fight, train, become stronger! But fear not! you can be helped by various inhabitants of this mysterious land, sells, buy stuff and become richer! In this game you can Craft Plant and plow Shoot Talk to people Sell and buy Travel Crafting Crafting lets you build various objects, such as bullets and pellets, by adding various object in the correct order on the crafting grid, you can a new item out of it, which can be sold or bought. Plant and plow A core mechanic of the game, where you can plow your fields, plant crops and harvest these crops, but you need to know that you can't plow everywhere, only where the player reside can the land be plowed, see it as convenient farming, where you don't need to travel a lot to get your crops done. Off course crops can be sold and bought. Shoot Another core mechanic of the game, since it is based on bullet hell. You can shoot any bullet you have on your inventory by equipping them on the hotbar, then pressing on the numbers from 1 to 9. You don't actually kill enemies, they always respawn at some point, they just get too tired to fight and disappear, every enemies drops a coin when defeated, coins are useful for trading! Talk to people As the land is full with a bit of everything, including NPC, you can interact with them, by click E when closed to it. Some off the NPC might have things to sell, or important piece for the lore, it's up to you to talk to them, embark a journey of wonders! Sell and buy Money is important to anyone in anywhere, even in Gensokyo! Why not trading then ? Sometimes you can't find an item you want, or maybe it's too hard to get it. Well then money is the way to go ! Each coin is 1 amount of money, but use it wisely! Most of the shops are in the human village for now Travel The playable will be huge! But for now it's way smaller, but even that, there is still a lot to explore, NPC are scattered around the map, they might have important things to say, who knows... Each bit of the map is unique, having points of interest, and based from the original franchise, if you're a Touhou fan, you might enjoy these little things Controls 'WASD' is for moving 'LMB' for shooting 'RMB' for using tools 'SHIFT' for going slower 'E' is for interacting 'B' for brining the inventory 'X' is for bombs 'R' is for getting back the catch(when fishing) 'C' for bringing the crafting menu",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1777980/header.jpg?t=1634751882",
    "Price": 4.99,
    "Developers": "Crimson Games",
    "Publishers": "Crimson Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1777980/ss_734b6061c6d80044ab31e8f0e4709a3719996441.1920x1080.jpg?t=1634751882,https://cdn.akamai.steamstatic.com/steam/apps/1777980/ss_58e8da089fa96071c23f4d4a92eff5266018169d.1920x1080.jpg?t=1634751882,https://cdn.akamai.steamstatic.com/steam/apps/1777980/ss_125b50d15b5dc945dc9820cddb44076b91cc5fc2.1920x1080.jpg?t=1634751882,https://cdn.akamai.steamstatic.com/steam/apps/1777980/ss_2465b6b87cd7a87cd2eb88a3f040fbcb8d686171.1920x1080.jpg?t=1634751882,https://cdn.akamai.steamstatic.com/steam/apps/1777980/ss_ed05ee32f7ac63120beb26b2992372c2b90172cf.1920x1080.jpg?t=1634751882,https://cdn.akamai.steamstatic.com/steam/apps/1777980/ss_739707c818935c60f3f1b7325a467c22baa8bc3a.1920x1080.jpg?t=1634751882",
    "Slug": "touhou-adventure",
    "Meta Title": "Touhou Adventure: Oct 20, 2021, Crimson Games and Full Ov...",
    "Meta Description": "Looking for information on Touhou Adventure? Check out the release date (Oct 20, 2021), developer insights from Crimson Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Touhou Adventure game - Steam 1777980",
    "Canonical URL": "https://gusku.site/game/touhou-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Touhou Adventure\", \"description\": \"Looking for information on Touhou Adventure? Check out the release date (Oct 20, 2021), developer insights from Crimson Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crimson Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crimson Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1777980/header.jpg?t=1634751882\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}