{
    "AppID": 1031480,
    "Name": "TouHou Makuka Sai ~ Fantastic Danmaku Festival Part II",
    "Release date": "Mar 18, 2019",
    "About the game": "Touhou Makuka Sai ~ Fantastic Danmaku Festival partⅡ is a danmaku shooting game, which is the second part of Touhou Makuka Sai. The repeat of incident is coming again. Can the girls going to the netherworld solve the mystery? ★CONTROL OF KEYBOARD →←↑↓ Movement Z Shooting, Confirm X Bomb, Cancel Shift Slow Movement Esc Pause ★CONTROL OF GAMEPAD Make sure you have already disabled steam input! Support Xbox 360, Xbox One and PlayStation 4 Controller (You can choose a default config on game launcher window) Basically support most of other controllers but if it lose control you need to modify the move threshold in controller config ★STORY BACKGROUND The spring of Gensokyo arrived one month ago... Unprecedented blizzard suddenly hit, making Gensokyo become colder than Winter. Soon, Youkais became restless under the overwhelming blizzard. “It's too similar…it shouldn't be a coincidence, should it?' Miko from jinja, witch from forest, and wind priestess specially comes for the incident gather again. They all know something in heart but also full of uncertainty and anxiety. To solve the mystery before thing goes worse, they have to start off to find out the root of the incident, even under the fierce blizzard. ★DESIGN OF NEW CHARACTER ○Wandering white 修普 Hyp Race: Unknown Ability: to make people fall asleep Floating in the snowing sky, a white youkai of owl covered by giant white wings, is hard to be awarded for its protection color in the snow. The feathers change to snow after falling out of his pillow, which slightly contributes to the heavy snow of Gensokyo. He states that his appearing is for food. But he is very lazy and will fall asleep during battle and seems not very strong. ○Fairy of sweetness and fragrance 莉莉·怀特 Lily White Race: Fairy Ability: To announce the coming of spring She is arranged to welcome the guests coming to the festival at the entrance of netherworld by the host of the festival and for this reason, she is also heavily dressed up. She is somewhat mind losing and keep attacking comers without invitation using new ability of unknown origin acquired. ★ABOUT Youmu Konpaku It seems like a normal day in Hakugyokuro, Youmu is required strangely by Yuyuko to make purchasement at Human Village. 'You know, how long it takes me to reach Human Village?' Though Youmu complains, she goes out without any further words. However, when she comes to the outland, the abnormal blizzard totally shocked Youmu. After continuingly questioned several woodcutters who search for firewood under snow, Youmu finally convinced herself that it is now Spring. Everyone locked himself at home at Human Village, which totally ruined the purchase plan of Youmu. But what is even worse is that countless youkai is uprising under the blizzard in the Gensokyo… ★GAME FEATURES -Seems familiar but a brand new different script. -Significant stage show and danmaku also full of challenges, bringing visual experience different from traditional shooting games. -Serial sequel after a gap of 5 years, challenging the ultimate limit of danmuku",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1031480/header.jpg?t=1622557613",
    "Price": 12.99,
    "Developers": "东方幕华祭制作组",
    "Publishers": "东方幕华祭制作组",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1031480/ss_2d8eb6c57988b66622c1c540a87b982ec759661b.1920x1080.jpg?t=1622557613,https://cdn.akamai.steamstatic.com/steam/apps/1031480/ss_6102dfa30838dadc9d51daf6866a91954bd648e3.1920x1080.jpg?t=1622557613,https://cdn.akamai.steamstatic.com/steam/apps/1031480/ss_5ef2c7ba3ab98fe8a9ab680f678b6ce15f502118.1920x1080.jpg?t=1622557613,https://cdn.akamai.steamstatic.com/steam/apps/1031480/ss_43fa1e6455ea753bbbbd0aafce11a9c5a5f75afc.1920x1080.jpg?t=1622557613,https://cdn.akamai.steamstatic.com/steam/apps/1031480/ss_1cce85fb8391fbfb1441f6daa670b1a342bfd89c.1920x1080.jpg?t=1622557613",
    "Slug": "touhou-makuka-sai-fantastic-danmaku-festival-part-ii",
    "Meta Title": "TouHou Makuka Sai ~ Fantastic Danmaku Festival Part II: M...",
    "Meta Description": "Looking for information on TouHou Makuka Sai ~ Fantastic Danmaku Festival Part II? Check out the release date (Mar 18, 2019), developer insights from 东方...",
    "Alt Text Image": "Official header image for TouHou Makuka Sai ~ Fantastic Danmaku Festival Part II game - Steam 1031480",
    "Canonical URL": "https://gusku.site/game/touhou-makuka-sai-fantastic-danmaku-festival-part-ii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TouHou Makuka Sai ~ Fantastic Danmaku Festival Part II\", \"description\": \"Looking for information on TouHou Makuka Sai ~ Fantastic Danmaku Festival Part II? Check out the release date (Mar 18, 2019), developer insights from \\u4e1c\\u65b9...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 18, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4e1c\\u65b9\\u5e55\\u534e\\u796d\\u5236\\u4f5c\\u7ec4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u4e1c\\u65b9\\u5e55\\u534e\\u796d\\u5236\\u4f5c\\u7ec4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1031480/header.jpg?t=1622557613\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}