{
    "AppID": 1095040,
    "Name": "Unexplored 2: The Wayfarer's Legacy",
    "Release date": "May 27, 2022",
    "About the game": "Procedural roguelite RPG in a vast world Unexplored 2 creates a vast, rich fantasy world for you to discover. It has a cool twist on permadeath: your character may die, but the world might persist. The game is an ambitious, procedural action-RPG without grind, xp, or gold. Instead the story is all about your choices and their consequences as history unfolds. As the titular Wayfarer you take on the quest to destroy the Staff of Yendor, for which you’ll have to traverse your world. Along the way you’ll meet tribes, encounter magical creatures and explore ancient ruins to discover mythical weapons and historic items. When you die… The game is challenging and you will die often. You may make a wrong choice, take on one too many creatures, or forget to stock up on food before traveling a desert. Whatever the reason, when your character dies, they’re gone. No autosaving or quickloading. However, you can choose to continue your adventures with a new character in the same world, a few years later. Your new character will witness the result of the choices your previous adventurer made. You can leave items in a safe spot, ready for your next Wayfarer to pick up and use. The world ends You can try to fulfill your quest to destroy the Staff of Yendor with consecutive Wayfarers in the same world. However, when you die during your final mission, your world ends. Permanently. So, make sure you are prepared well and know everything there is to know about the last and most dangerous part of your adventure. When you fail, that world vanishes. The only thing left to do is to generate a whole new world with its own history, and begin the quest anew. Key features Radical content generation: Ludomotion's radical approach to content generation creates many layers of unique content, every time a new world is generated. Generative storytelling: Though every Wayfarer's ultimate goal may be similar, every hero will have their own world, story, and encounters. Systemic depth: The game features many systems and you will discover something new every time you play, even after hundreds of hours of gameplay. Legacy system: Actions of your past heroes impact the fortunes of those that follow in their footsteps. Use your legacy wisely to give your successive adventurers greater hopes of completing their quest. Permadeath in a persistent world: When your hero dies, they stay dead. But you can choose to return to the same world with a new Wayfarer. Or, if you prefer, begin a new adventure in a completely unexplored world. Unique presentation: The worlds in Unexplored 2 are presented in a unique and beautiful art style, beyond what is conventionally expected from a generative game. A stylish lighting system sets the mood and adapts to the time of day and local weather conditions. Orchestral adaptive soundtrack: Your adventure is accompanied by an orchestral, original soundtrack which reacts to the action and decisions you make as a player.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1095040/header.jpg?t=1658066121",
    "Price": 24.99,
    "Developers": "Ludomotion",
    "Publishers": "Big Sugar",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1095040/ss_df6086053cb6c3d9545c8108fee93dbe56bb7afc.1920x1080.jpg?t=1658066121,https://cdn.akamai.steamstatic.com/steam/apps/1095040/ss_079cda2e978cc1ccd4543fd5e5f0936786d361a6.1920x1080.jpg?t=1658066121,https://cdn.akamai.steamstatic.com/steam/apps/1095040/ss_c093d644a239ad09d24460a2a590438a47afc2cd.1920x1080.jpg?t=1658066121,https://cdn.akamai.steamstatic.com/steam/apps/1095040/ss_6685f88bf0ade135da4f4d11915335a615d7f3f9.1920x1080.jpg?t=1658066121,https://cdn.akamai.steamstatic.com/steam/apps/1095040/ss_5f8e4125fab236ae067a4ec52755ef7dd54dd3af.1920x1080.jpg?t=1658066121,https://cdn.akamai.steamstatic.com/steam/apps/1095040/ss_3fe4b60c6fa778bb3b4b715c40fc9010c6ee8292.1920x1080.jpg?t=1658066121,https://cdn.akamai.steamstatic.com/steam/apps/1095040/ss_bbe16e9717ac2c25725e5432a9f7e3b141dcf771.1920x1080.jpg?t=1658066121,https://cdn.akamai.steamstatic.com/steam/apps/1095040/ss_0db036735df599b1563fee20d900c3cf5bfe0109.1920x1080.jpg?t=1658066121,https://cdn.akamai.steamstatic.com/steam/apps/1095040/ss_c7314a669fcf4e127010d873550022774976741f.1920x1080.jpg?t=1658066121,https://cdn.akamai.steamstatic.com/steam/apps/1095040/ss_144dd3dc6f99b9515625b9af9d51b8f3845c54e4.1920x1080.jpg?t=1658066121,https://cdn.akamai.steamstatic.com/steam/apps/1095040/ss_c742dbfed7ed1a79cc47dae9c4b7b1274ded12bb.1920x1080.jpg?t=1658066121",
    "Slug": "unexplored-2-the-wayfarer-s-legacy",
    "Meta Title": "Unexplored 2: The Wayfarer's Legacy: May 27, 2022, Ludomo...",
    "Meta Description": "Looking for information on Unexplored 2: The Wayfarer's Legacy? Check out the release date (May 27, 2022), developer insights from Ludomotion, and a com...",
    "Alt Text Image": "Official header image for Unexplored 2: The Wayfarer's Legacy game - Steam 1095040",
    "Canonical URL": "https://gusku.site/game/unexplored-2-the-wayfarer-s-legacy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Unexplored 2: The Wayfarer's Legacy\", \"description\": \"Looking for information on Unexplored 2: The Wayfarer's Legacy? Check out the release date (May 27, 2022), developer insights from Ludomotion, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ludomotion\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Big Sugar\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1095040/header.jpg?t=1658066121\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}