{
    "AppID": 1077450,
    "Name": "Wally and the FANTASTIC PREDATORS",
    "Release date": "Sep 3, 2019",
    "About the game": "According to my best friend Anton: Wally and the FANTASTIC PREDATORS is a perma-death rogue-lite where you play as Wally, a predatory fox who is attacking defenseless animals in their own homes and taking all their money. During your decent you also get to experience verbal abuse from various NPCs, but it’s okay because you can hug the backpack guy and that’s fantastic. That’s right, you were the FANTASTIC PREDATOR all along. I think there’s more than 3 levels, but I really can’t be sure as the game is incredibly difficult. Legends speak of legends that manage to beat the Foxlion and get to level 4. From the trailer though there seems to imply more content probably only accessible by about five that made it this far. Despite being so difficult and me bad at videogames, the game is very fun to play. The game is fast paced and handles very smoothly. Wally always moves like you tell him to and has a very satisfying moveset. There’s a lot of upgrades to pick up that changes the gameplay in various ways, both positive and negative. The developer is constantly interacting with the community and is very in love with his creation. You can tell a lot of love went into this product. The game is overflowing with charm and details, it’s an absolute recommendation from me. End Thank you Anton I freaking love you man! Your review is better than anything I could have written! -Oscar Gonzalez Wally and the FANTASTIC PREDATORS is a weird game wearing the skin of a traditional rogue-lite. What sets Wally the game apart is it's attitude . Wally is the weird kid in middle school who Naruto runs in between classes. It's weird, wholesome and confident in itself. It's that confidence that is omni-present in pretty much every part of the game. It's also not afraid of going to extremes in order to make a point or to make a good joke! I remember this one time I was really bored and thought, dude wouldn't it be hilarious if we made a dungeon where everything just became the letter A. The enemies, the bullets, every ui element it would be an a and it would be confusing as heck!! Why? Idk I thought it was hilarious lol To keep every day extra spicy we add unique twists in dailiy runs. Twists can be things like have a 50% of throwing a bonus bomb or start a run in a glass cannon mode, or applying some strong buff such as a CRIT to all weapons in the dungeon. Inspired by Binding of Isaac's infinite synergies combinations, you start a run with a wimpy weapon, over time you find passive items, curses, weapons, quests that permanently change the rules of a single play sessions session (such as getting a curse that makes every bomb shoot a fireball at your face whenever they explode). Dying resets everything giving each run a completely unique experience. There is also a COOP mode where you can torture your friends by making them play with you, it's local only so you only need one copy! (Not because I'm generous, it's just that I just that I have no idea how to netcode lol) KEY FEATURES Daily Twists , These Daily/Weekly runs we introduce crazy twists every day! Start one daily run with maximum movement speed or start a run over encumbered with bombs. Compete with 600+ members of our discord community! Local COOP which means you only need one copy of Wally to enjoy with a friend! 10 Dungeons 150+ different Upgrades/Curses/Weapons/Quests/Daily Twists. With so many stack able passives interacting with each other it'll take years to see every combination. Hugging Simulator 5 Single Player Run types 5 Boss fights that will make you say, WHAT THE HECK IS THAT Branching paths, get as greedy as much as you want, do you want to trade all your max health and become a glass cannon? Why the heck not! True Ending, (It's a mystery to everyone what it is)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1077450/header.jpg?t=1658598164",
    "Price": 14.99,
    "Developers": "Oscar Gonzalez",
    "Publishers": "Oscar Gonzalez",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_af52b8f9ef34af0ea1629a4b180377dd6f82ecd3.1920x1080.jpg?t=1658598164,https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_9406df3f46d4037f21274ea09874ae1e95735bd2.1920x1080.jpg?t=1658598164,https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_13a2d034d6bce3a0e9d412162bf6fccdbe323e4c.1920x1080.jpg?t=1658598164,https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_6190ef51bf919bc2cf246ff4ef457043d8b7a6f1.1920x1080.jpg?t=1658598164,https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_65a08cdbff449137cfdf4b601871574a885124a1.1920x1080.jpg?t=1658598164,https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_5032dcf3a92f7e6f426f87913bc560625906c93a.1920x1080.jpg?t=1658598164,https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_3ff5c9880d6f80427732e9735f2633f930797e27.1920x1080.jpg?t=1658598164,https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_1e06305a1e4d1a2a8f38d64b476e1e4dc564092d.1920x1080.jpg?t=1658598164,https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_cc72302d71a31f4ea36c2dd8f8bd6ae22f339e17.1920x1080.jpg?t=1658598164,https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_2e7da8fa5bcbffa6f9b7684c2ab2f3288d07b568.1920x1080.jpg?t=1658598164,https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_5c3f15a570016b11a04ac1920bfb0eded101d1f9.1920x1080.jpg?t=1658598164,https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_1716c2bd08ac46aa0055f034e7ef39cce2971e5c.1920x1080.jpg?t=1658598164,https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_a8dc5be143a119755b33f87d9dd44a61021ffdea.1920x1080.jpg?t=1658598164,https://cdn.akamai.steamstatic.com/steam/apps/1077450/ss_e4d389a497574ddd7f1236ad543b2f2874e736f6.1920x1080.jpg?t=1658598164",
    "Slug": "wally-and-the-fantastic-predators",
    "Meta Title": "Wally and the FANTASTIC PREDATORS: Sep 3, 2019, Oscar Gon...",
    "Meta Description": "Looking for information on Wally and the FANTASTIC PREDATORS? Check out the release date (Sep 3, 2019), developer insights from Oscar Gonzalez, and a co...",
    "Alt Text Image": "Official header image for Wally and the FANTASTIC PREDATORS game - Steam 1077450",
    "Canonical URL": "https://gusku.site/game/wally-and-the-fantastic-predators",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wally and the FANTASTIC PREDATORS\", \"description\": \"Looking for information on Wally and the FANTASTIC PREDATORS? Check out the release date (Sep 3, 2019), developer insights from Oscar Gonzalez, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 3, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Oscar Gonzalez\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Oscar Gonzalez\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1077450/header.jpg?t=1658598164\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}