{
    "AppID": 1475460,
    "Name": "3 Minute Heroes",
    "Release date": "Nov 17, 2021",
    "About the game": "3 Minute Heroes is a real-time strategy game that combines tower defense, deck building, and rogue-like genres. Stop waves of vicious monsters by placing units on the field and using proper cards. Keep your home safe for 3 minutes! Features 20 Heroes : Each hero has its own skill and cards. Pick two other heroes and secure your home. Playing style changes according to the combination of heroes. Make your heroes cooler by combining triple hero cards! View each hero's specialty in the Warrior’s Training Journal. 400+ Cards : Intuitive, unique cards. You do not have to know every card, since cards that appear in a single game are restricted to selected heroes. There are also special cards that only appear in hard mode (The Great Invasion)! It is a great experience for both beginners and skilled players. 12 Rounds : Every round takes 3 minutes. There are dozens of monsters and bosses from 6 different factions: slimes, goblins, ghosts, golems, demons, and dragons. Monsters and bosses have a variety of different patterns. At the end of each round, you can choose one of the three rewards to upgrade your deck. Keywords 20 Keywords : With “Remodel a card,” you can add keywords to your cards to make them more powerful. You can add the keyword “Combo” to repeat the number of times a card was played this round, or add the keyword “Guardian” to make the targets of this card Invincible! Check out more keywords in “3 Minute Hero.” Loot System 20 Loots : Enemies drop different loot depending on the chosen heroes. Click on them to activate their effects. Through “Adjust loots,” you can add new loot or increase the drop rate of existing ones. Quest 20 Conditions, 60 Rewards : For each round, AI tracks the player's top 3 actions. If your deck has a strong magic card for killing a lot of enemies, choose “When you kill enemies with magic damage.” Whenever conditions are met, various reward effects are automatically triggered. Arena : Arena is an auto-battler mode where you can fight other players. It's asynchronous and based on the system of 3 Minute Heroes, so it's easy to start. Combine over 50 synergies, over 100 arena quest effects to reach the highest rank! 10 Extreme Stages : Challenge the stages with 5 altars. Each Altar appears randomly and works for 30 seconds. All heroes may be stunned, or enemies may appear at the triple rate, both of which last for 30 seconds. As the stage level goes up, the altars are stacked up, so a total of 50 altars are added in the end. Watch out for stage 10! And More... Saga of heroes : You can view the stories of heroes when conditions are met, such as unlocking all the heroes or clearing the 5th stage of the Great Invasion. The saga of heroes will be added continuously. Upgrade : Clear rounds to get clover and use it to upgrade your hero. Continue challenging with more powerful heroes!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1475460/header.jpg?t=1644806204",
    "Price": 9.99,
    "Developers": "Sinkhole Studio",
    "Publishers": "Sinkhole Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1475460/ss_cb202e53684eb8db5d6298288e4ac069e14deddd.1920x1080.jpg?t=1644806204,https://cdn.akamai.steamstatic.com/steam/apps/1475460/ss_0b80397ba2cc87d9c99053af3364bbbcbaa89c4b.1920x1080.jpg?t=1644806204,https://cdn.akamai.steamstatic.com/steam/apps/1475460/ss_5db95296d4c4f59f45f6adbc7a76750f62e0900b.1920x1080.jpg?t=1644806204,https://cdn.akamai.steamstatic.com/steam/apps/1475460/ss_95e9ebafae09ce905a47ef48ad2d57034d3ed954.1920x1080.jpg?t=1644806204,https://cdn.akamai.steamstatic.com/steam/apps/1475460/ss_e8ea9ba8959724ad8df4d561f3bca587e2115188.1920x1080.jpg?t=1644806204,https://cdn.akamai.steamstatic.com/steam/apps/1475460/ss_f42480fee123bd9e83d8c70c4bef68300b7e85d6.1920x1080.jpg?t=1644806204,https://cdn.akamai.steamstatic.com/steam/apps/1475460/ss_60b4c5140237e1db9b7564b4ef449e54f74dcfe4.1920x1080.jpg?t=1644806204,https://cdn.akamai.steamstatic.com/steam/apps/1475460/ss_5b1d645762379bd5dc193ed19be305584e3604dc.1920x1080.jpg?t=1644806204",
    "Slug": "3-minute-heroes",
    "Meta Title": "3 Minute Heroes: Nov 17, 2021, Sinkhole Studio and Full O...",
    "Meta Description": "Looking for information on 3 Minute Heroes? Check out the release date (Nov 17, 2021), developer insights from Sinkhole Studio, and a complete game summ...",
    "Alt Text Image": "Official header image for 3 Minute Heroes game - Steam 1475460",
    "Canonical URL": "https://gusku.site/game/3-minute-heroes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"3 Minute Heroes\", \"description\": \"Looking for information on 3 Minute Heroes? Check out the release date (Nov 17, 2021), developer insights from Sinkhole Studio, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 17, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sinkhole Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sinkhole Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1475460/header.jpg?t=1644806204\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}