{
    "AppID": 523870,
    "Name": "Breaking Fast",
    "Release date": "Jun 8, 2017",
    "About the game": "The food has rebelled… and it sure is furious! Breaking Fast is a frantic race between breakfast foods in which there are no rules and the only goal is to win, and if possible, humiliate and ravage your adversaries. But wait—let’s stop for a second and talk seriously: too much play can ruin friendships. Seriously. Don’t buy this game if you want to keep your friends. You still want to continue reading? Don’t say we didn’t warn you! Breaking Fast pulls together the best aspects of classic multiplayer games like Mario Kart and Super Smash Brawl and joins them into a unique gaming experience that is both satisfying and thrilling . With each race, you gain experience points and unlock new foods, each one more surprising and nourishing than the last, not to mention exciting new scenarios and tournaments. And if playing in local multiplayer with up to 3 friends isn’t enough, you can also play online with up to 7 unknown foods over the Internet. Or even better: why not mix it up and crush both your friend sitting on your couch and an unknown player from the Internet, all at the same time? In Breaking Fast, there are no limits: a good breakfast should be shared with as many people as possible! Clearly, if you like both breakfast and competitive multiplayer games like Mario Kart (but you don’t have a Switch), look no further because this is your game: Breaking Fast, the breakfast racing game. Local multiplayer up to 4 players and online mode for up to 8 players. And even better: play with your friends or family against several strangers over the Internet. Because a good breakfast deserves to be shared! If you’re not one to share food, play alone against up to 7 CPUs who will challenge you to unknown limits: Dark Souls will be a walk in the park! Delicious gameplay, both simple and profound. The game’s easy to learn and accessible to all, while still being complex and demanding for more advanced players. Endearing characters that you will love when you control them and hate when they attack you. There is no middle ground. Customize your gaming experience: do you want short races with a countdown and a finish line, or do you prefer to experience the excitement of a tournament where each race counts in your journey to the winners podium? Cutting-edge 2D graphics with 16 K* and a cartoonish style so delicious that you will want to munch between meals. You’ll never see a bacon strip with such definition! Kafkaesque situations that will make you reflect about life and come to profound conclusions such as sometimes one must go backwards to win (when you see the blue glove you’ll know what we’re talking about…). They say breakfast is the most important meal of the day and because we believe it’s only fair that all people are able to enjoy it, 5% of studio sales** will go to the NGO World Food Program. Tale Studios is a small Spanish studio co-founded by Manuela Ruiz and Francisco Moyano, artist and programmer of the game, respectively. We also received help from David Mariscal—a programmer who especially worked to make online mode possible—and Óliver Moya, in charge of music and sound effects. * Definition might not be that high but come on, it’s an indie game with a low budget. ** Net operating profit after tax (NOPAT)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/523870/header.jpg?t=1513853994",
    "Price": 9.99,
    "Developers": "Tale Studios",
    "Publishers": "Tale Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/523870/ss_8334c5e52a95e5863c7ee43df1cace87dd1645d3.1920x1080.jpg?t=1513853994,https://cdn.akamai.steamstatic.com/steam/apps/523870/ss_496193a59c42b96acb69e1aa4e556d7bfcd3e574.1920x1080.jpg?t=1513853994,https://cdn.akamai.steamstatic.com/steam/apps/523870/ss_4509d3fb63aff4be523ae4c667e8921318ef35dd.1920x1080.jpg?t=1513853994,https://cdn.akamai.steamstatic.com/steam/apps/523870/ss_c2d6a723c37ed6f4a04a4e4616783744a21c3eea.1920x1080.jpg?t=1513853994,https://cdn.akamai.steamstatic.com/steam/apps/523870/ss_ddec11be8771367eb8a3776c39b0999bcd2d9bf8.1920x1080.jpg?t=1513853994,https://cdn.akamai.steamstatic.com/steam/apps/523870/ss_0afbc2c95dea5292936162c14e1895eab551a772.1920x1080.jpg?t=1513853994",
    "Slug": "breaking-fast",
    "Meta Title": "Breaking Fast: Jun 8, 2017, Tale Studios and Full Overview",
    "Meta Description": "Looking for information on Breaking Fast? Check out the release date (Jun 8, 2017), developer insights from Tale Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Breaking Fast game - Steam 523870",
    "Canonical URL": "https://gusku.site/game/breaking-fast",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Breaking Fast\", \"description\": \"Looking for information on Breaking Fast? Check out the release date (Jun 8, 2017), developer insights from Tale Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tale Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tale Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/523870/header.jpg?t=1513853994\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}