{
    "AppID": 319850,
    "Name": "Bridge Constructor Medieval",
    "Release date": "Sep 15, 2014",
    "About the game": "Dive into the Middle Ages and play the successor to the worldwide #1 hit, Bridge Constructor Bridge Constructor Medieval turns back the clock a few centuries to the time of knights and castles. Build sturdy bridges to supply your city with provisions - or cunningly constructed bridges that collapse under the weight of attacking troops, sending the horde of enemies into the abyss below. You won’t even be safe from cannon fire in the 40 brand new levels. Protect your foot soldiers and your horse-drawn carriages with covered bridges and stable pillar structures. There is a total of five materials available to help you build the perfect bridge: wood, heavy wood, stone and ropes, along with the new addition of the bridge roof. Throughout the exciting background story, you will familiarize yourself with the various materials on a step-by-step basis and learn everything you need to know so that your bridges meet the requirements of the different levels. Innovative game modes in store for you! Besides building stable bridges, there's also plenty on offer for veterans to discover in the new game modes. In the siege level, your bridge is bombarded by enemy catapults. Strengthen your bridge so that it doesn't collapse and protect your own troops on the bridge with a bridge roof. In another new game mode, you build your bridges so that they collapse under the load of enemy units to send as many of them as possible into the abyss. In addition, the unique bonus challenges will leave even the most experienced players at their wit’s end. That way, both bridge-building professionals and novices will face a challenge in Bridge Constructor Medieval. FEATURES: For the first time: Build bridges in the Middle Ages! Brand new levels and game modes for a completely new gaming experience Design sturdy bridge roofs to protect yourself from enemy catapults Construct cunning bridge traps to send advancing enemy troops into the abyss Exciting and funny background story Enjoy beautiful medieval landscapes Achievements and leaderboards",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/319850/header.jpg?t=1649420124",
    "Price": 1.49,
    "Developers": "ClockStone",
    "Publishers": "Headup Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/319850/ss_6c2255c11eda07d74407333e84e31135887741ea.1920x1080.jpg?t=1649420124,https://cdn.akamai.steamstatic.com/steam/apps/319850/ss_f2d9136d362b89493f407fe05d77c36f268248f1.1920x1080.jpg?t=1649420124,https://cdn.akamai.steamstatic.com/steam/apps/319850/ss_01da942bb98db918e27ae05bcce10909596eb9ef.1920x1080.jpg?t=1649420124,https://cdn.akamai.steamstatic.com/steam/apps/319850/ss_a137ccef4baaa9b74319cf134ed147ea28dac773.1920x1080.jpg?t=1649420124,https://cdn.akamai.steamstatic.com/steam/apps/319850/ss_bc6bafbde09d5db69372ae6e24cdc88962bf6400.1920x1080.jpg?t=1649420124",
    "Slug": "bridge-constructor-medieval",
    "Meta Title": "Bridge Constructor Medieval: Sep 15, 2014, ClockStone and...",
    "Meta Description": "Looking for information on Bridge Constructor Medieval? Check out the release date (Sep 15, 2014), developer insights from ClockStone, and a complete ga...",
    "Alt Text Image": "Official header image for Bridge Constructor Medieval game - Steam 319850",
    "Canonical URL": "https://gusku.site/game/bridge-constructor-medieval",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bridge Constructor Medieval\", \"description\": \"Looking for information on Bridge Constructor Medieval? Check out the release date (Sep 15, 2014), developer insights from ClockStone, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 15, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"ClockStone\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Headup Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/319850/header.jpg?t=1649420124\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}