{
    "AppID": 1922060,
    "Name": "BrVR Backrooms Virtual Reality",
    "Release date": "Jul 15, 2022",
    "About the game": "No-Clip Out Of Reality and Into BrVR Explore~Scavenge~Survive NOTE TO VALVE INDEX USERS: The inputs are using a community-made binding which makes it possible for Valve Index users to play. If you're still having issues you may need to remap your controllers. Please contact us on our discord () if you have any issues or if you just want to say hi! BrVR Backrooms Virtual Reality is an action-adventure survival game based on The Backrooms, a popular internet creepypasta. The Backrooms are out of the boundaries of the real world and can only be accessed by no-clipping through a floor, elevator, wall, stairs, etc., in a place that inspires deja vu or an uncomfortable feeling of nostalgia. Explore the liminal spaces, survive the entities, scavenge for food, supplies, and weapons, craft items to trade, and try to survive. There is a No Gore mode as well as a no entities mode to allow you to play the experience you seek. We have tried to recreate all of your favorite levels: The Main 9, Level Run for your life, Level 188, The Terror Hotel, Level Fun, The Snackrooms, The Poolrooms, The Sh4dy Gr3y, Kitty's House, The End and so much more. There are mini-games like The Terror Hotel Casino, Skin or No Skin, Backrooms Brawl, Ski Ball, General StarFlares Laser Game, The Charleston Button, Basketball, Squirt Gun Madness, Backrooms Fruit Finale, Music Sequencer, and many more. These levels are complete with bases, outposts, communities, pawn shops, breweries, museums, farmer's markets, and crafting/upgrade workshops. There are also 50+ in-game achievements to accomplish giving you hours of playability. Please note that this game is in Early Access so please leave reviews accordingly. Bugs and general jank should be expected and we may have to wipe data at times. We are very responsive developers and would love to have you on our Discord to help shape the game and work out any issues you may be having. We still have placeholder assets in use that we will eventually replace. Thank you to all the artists whose assets we have used as it has allowed us to work even harder on other areas of the game and do it on a shoestring budget. We are a two-person team not asset flippers. Welcome to the family! BrVR Backrooms Virtual Reality features: - Physics-based avatar that uses VRGK. Full body or hands only. - Explore 70+ immersive levels with or without entities - Enjoy 80+ interactable items to use while exploring, surviving, or in combat - Slay entities to progress forward and don't let them catch you! - Multiple cameras to make videos with; we've got you streamers! - Control cameras and sound effects from the keyboard - Build traps to catch entities - Lots of fun mini-games - Craft items, shelters, and weapons to help you survive with scavenged materials - Trade with NPCs to gain valuable items - Upgrade benches allow you to make better items - There are three difficulty modes - Liquid brewers allow you to create new substances and items such as fortified almond water and friendship potions - Befriend entities and let them fight for you - There is a sandbox mode where you can spawn items at will, meet the entities, and tinker with backrooms objects - There's a no gore/no entities mode where you can freely survive among the backrooms - Cut down trees (we don't promote deforestation) to make shacks - A front rooms area where you can pick out your loadout and then no-clip into the backrooms - A vault in your front rooms to store items you've found, achievements you've completed, and special items you've collected - 'Dark' levels, a serious challenge with 4 times the entities, more darkness, murky water, and heightened danger - Find ways to make Backrooms Bucks - Meme-friendly environment THE HUB WILL BE LOCKED DOWN AS OF THE NEXT PATCH. You will still be able to access it in sandbox mode, but you won't get your achievements and items. We stream new features, playtesting, gameplay, and walkthroughs of the game 5 days a week on YouTube. Discord Link: This game includes flashing/disorienting lights, blood effects, fantasy violence, and potentially disturbing/creepy content. We are not responsible for any injuries received during the game. There are no teleport or comfort settings at this time. There are jump scares and memes!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1922060/header.jpg?t=1658627672",
    "Price": 4.99,
    "Developers": "Paul Wallace,John Wallace",
    "Publishers": "LakesideCentral LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1922060/ss_c71a0e021f03d721af5e3c36fe6a8a535d7bb0ea.1920x1080.jpg?t=1658627672,https://cdn.akamai.steamstatic.com/steam/apps/1922060/ss_ed8145a82d4f0a672f1105c4b44950f5ee05a61c.1920x1080.jpg?t=1658627672,https://cdn.akamai.steamstatic.com/steam/apps/1922060/ss_7b1e5afc4523a29fc952dd85d3a61f14c0181d7e.1920x1080.jpg?t=1658627672,https://cdn.akamai.steamstatic.com/steam/apps/1922060/ss_5b86a67d434b2173b2f98f8b4b3d17c3bf9a437b.1920x1080.jpg?t=1658627672,https://cdn.akamai.steamstatic.com/steam/apps/1922060/ss_e33bda4cadd07992bacb1c0bfdf935669c1a491a.1920x1080.jpg?t=1658627672,https://cdn.akamai.steamstatic.com/steam/apps/1922060/ss_cd5d0332ad5ec94201fbdd3153211c07bc95a47b.1920x1080.jpg?t=1658627672,https://cdn.akamai.steamstatic.com/steam/apps/1922060/ss_2c40803c2ebe138fd9ed059d2c57d7dcf21ab2a1.1920x1080.jpg?t=1658627672",
    "Slug": "brvr-backrooms-virtual-reality",
    "Meta Title": "BrVR Backrooms Virtual Reality: Jul 15, 2022, Paul Wallac...",
    "Meta Description": "Looking for information on BrVR Backrooms Virtual Reality? Check out the release date (Jul 15, 2022), developer insights from Paul Wallace,John Wallace,...",
    "Alt Text Image": "Official header image for BrVR Backrooms Virtual Reality game - Steam 1922060",
    "Canonical URL": "https://gusku.site/game/brvr-backrooms-virtual-reality",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BrVR Backrooms Virtual Reality\", \"description\": \"Looking for information on BrVR Backrooms Virtual Reality? Check out the release date (Jul 15, 2022), developer insights from Paul Wallace,John Wallace,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Paul Wallace,John Wallace\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LakesideCentral LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1922060/header.jpg?t=1658627672\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}