{
    "AppID": 872400,
    "Name": "Capsella The Lights of Lucern",
    "Release date": "Jun 2018",
    "About the game": "In Lucern’s darkest times only a few will rise to bear the light. Are you mighty and brave enough to be one of them - to stand against the tides of darkness that threaten to engulf the world? Immerse yourself in an MMO-like experience played from the comfort of your couch, best enjoyed with friends in co-op! Capsella the Lights of Lucern is an action-driven adventure that unites the gameplay and party systems of JRPGs with the mechanics of MMOs. Explore dungeons across different worlds, create various tactics to defeat groups of enemies and fight adrenaline-inducing bosses - all without the time-wasting leveling of MMOs. The Link Crystals are primordial magical formations that bind all the dimensions together… Strange corruption has crept into the Crystals, twisting them and corrupting them. Left unchecked, the corruption will disrupt the balance between the light and darkness and shatter the connections between the dimensions. Goddess Aina has chosen four heroes that have seen the light in the darkness. They have been entrusted with Capsella - a powerful artifact capable of dispelling the corruption. The heroes must carry the artifact to each of the worlds of Lucern and discover who - or what - is the force behind the corruption. You can play as four different characters, each featuring a unique playstyle and set of techniques. It is up to you to discover your preferred way of fighting and to learn the varied synergies between the characters, as each of them performs a key role in the party. Lucas Rochben is a knight who understands that a shield and a sword are one whole weapon and that defence is the best offence. Aran Hathel is a mighty warrior armed with a two-handed weapon and can unleash earth - and bone - shattering blows. Laurina Thoron is a swift archer who focuses on staying out of harm's way and dealing damage from afar. Ambar Aranel is a powerful mystic who can sense the flows of magic and shape them to his will - either to do harm or protect his comrades. Fight enemies and bosses across seven different worlds, joined by friends or AI allies. Discover different synergies, unlock new techniques, upgrade your equipment with elemental properties. Bear the light of Aina and dispel the darkness!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/872400/header.jpg?t=1644267310",
    "Price": 9.99,
    "Developers": "Bravery Software",
    "Publishers": "Bravery Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/872400/ss_0f6279795507fd23b3dc180e2dc90e68639ce053.1920x1080.jpg?t=1644267310,https://cdn.akamai.steamstatic.com/steam/apps/872400/ss_8005d62172e6f6e256fb832d5e0657d83a384143.1920x1080.jpg?t=1644267310,https://cdn.akamai.steamstatic.com/steam/apps/872400/ss_e3969f3065f25ae56242e836e0d0ea513aba90a4.1920x1080.jpg?t=1644267310,https://cdn.akamai.steamstatic.com/steam/apps/872400/ss_513e4b1c211f1e07fd3ea1d4a5f4e46e5299d209.1920x1080.jpg?t=1644267310,https://cdn.akamai.steamstatic.com/steam/apps/872400/ss_4f7ec83b6d4ca516de0a5cfd7bfd9241afa39fc2.1920x1080.jpg?t=1644267310,https://cdn.akamai.steamstatic.com/steam/apps/872400/ss_27816c3db791aa4f3a4d137f37771b0548f6666b.1920x1080.jpg?t=1644267310,https://cdn.akamai.steamstatic.com/steam/apps/872400/ss_05ce21aa8ddf2a6b8a3a203600e2f5b0a8df77e8.1920x1080.jpg?t=1644267310,https://cdn.akamai.steamstatic.com/steam/apps/872400/ss_06ebe2f7ef4b1b4c30f278b73fb833d9ca6798e9.1920x1080.jpg?t=1644267310",
    "Slug": "capsella-the-lights-of-lucern",
    "Meta Title": "Capsella The Lights of Lucern: Jun 2018, Bravery Software...",
    "Meta Description": "Looking for information on Capsella The Lights of Lucern? Check out the release date (Jun 2018), developer insights from Bravery Software, and a complet...",
    "Alt Text Image": "Official header image for Capsella The Lights of Lucern game - Steam 872400",
    "Canonical URL": "https://gusku.site/game/capsella-the-lights-of-lucern",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Capsella The Lights of Lucern\", \"description\": \"Looking for information on Capsella The Lights of Lucern? Check out the release date (Jun 2018), developer insights from Bravery Software, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bravery Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bravery Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/872400/header.jpg?t=1644267310\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}