{
    "AppID": 1537910,
    "Name": "Chaos Galaxy 2",
    "Release date": "Jul 25, 2022",
    "About the game": "Chaos Galaxy 2 is a retro-style grand strategy game deeply influenced by Romance of the Three Kingdoms, Advance War, Super Robot War and other similar games. The program, art, and design are all completed by one developer alone. Welcome to join Chaos Galaxy on Discord: You can set up many building areas on your planets: farms, hives, laboratories, orbital shipyards, arm factories, space fortresses, minefileds... You can produce hundreds of ships and mecha, appoint commanders to lead your fleets, defeat enemy's fleets and capture enemy's planets. You can even produce bio-mechanical legion by studying aliens. Powerful commanders can also use a variety of tricks to win beyond the battle, or use tactical skills to reverse the situation in the battlefield. There are all kinds of relationships between the heros. Hundreds of events will happen in the game: Civil war, discovery of new weapons, trading lost technology from the wandering ark, geting help from the strongest mercenaries, or plundered by the most terrible flight gang. There are a dozen large factions and more local small forces in the galaxy. You can use diplomatic actions to increase your allies and vassals, and disintegrate the relationship between enemies. A player who knows diplomacy can easily win a victory that a dozen fleets can't achieve. Each faction has a set of policy tree, from which can get its five unique units and dozens of economic and military effects. You can also develop strong bio-mechanical units from fighting against aliens, or get lost technology from wandering ark, or even get enemy blueprints when destroying their factions. The factions in the game belong to 8 different faction types, each faction type has its own unique play rule and special planetary building. The imperial factions can vie for the imperial official posts to increase their troop limit in the fleet and the ability of the commander. The pirate factions can capture the enemy's fleeing ships and arms in the battle. Mercenaries and assassins can accept the quests of mercenaries and assassins. AI faction can steal and study the blueprints of other factions. Businessmen can trade and invest. The revolutionary faction can carry out revolutionary propaganda to incite enemy planets to revolt. Aliens can devour planets to absorb life-gene. Choose different factions, you can get completely different game experience. The great empire that ruled the galaxy for a Millennium collapsed under the alien impact. The Imperial admirals, pirates, merchants, cultists, mercenaries and colonists fell into a bloody battle for hegemony. At the same time, the rebellious AI legions and the alien hive fleets are preying the human race without mercy. Only a true hero can guide human beings to survive this Armageddon. Now start your great campaign, use your strategy and courage to end the chaos of the Galaxy!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1537910/header.jpg?t=1658732490",
    "Price": 14.39,
    "Developers": "Han Zhiyu",
    "Publishers": "ChaosGalaxyStudio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1537910/ss_768b06c4e19d9be95e13a3f81f5c59a2c0fb91a0.1920x1080.jpg?t=1658732490,https://cdn.akamai.steamstatic.com/steam/apps/1537910/ss_9a1538edcc3067c165422fac35c03e9ee7f346eb.1920x1080.jpg?t=1658732490,https://cdn.akamai.steamstatic.com/steam/apps/1537910/ss_ebf87208627ea100ade014c579805be7102c2bcd.1920x1080.jpg?t=1658732490,https://cdn.akamai.steamstatic.com/steam/apps/1537910/ss_56be26fafc9f554a816d2bb429095994f9b35e7e.1920x1080.jpg?t=1658732490,https://cdn.akamai.steamstatic.com/steam/apps/1537910/ss_380a8c254e1eb132b0cf81a2e1c0937695749796.1920x1080.jpg?t=1658732490,https://cdn.akamai.steamstatic.com/steam/apps/1537910/ss_f27dfe1d8a602669a85cb46c8519baf7bb988afa.1920x1080.jpg?t=1658732490,https://cdn.akamai.steamstatic.com/steam/apps/1537910/ss_4bde7f21cf7e9bc8b01993d5667d22d5f72db939.1920x1080.jpg?t=1658732490",
    "Slug": "chaos-galaxy-2",
    "Meta Title": "Chaos Galaxy 2: Jul 25, 2022, Han Zhiyu and Full Overview",
    "Meta Description": "Looking for information on Chaos Galaxy 2? Check out the release date (Jul 25, 2022), developer insights from Han Zhiyu, and a complete game summary.",
    "Alt Text Image": "Official header image for Chaos Galaxy 2 game - Steam 1537910",
    "Canonical URL": "https://gusku.site/game/chaos-galaxy-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Chaos Galaxy 2\", \"description\": \"Looking for information on Chaos Galaxy 2? Check out the release date (Jul 25, 2022), developer insights from Han Zhiyu, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Han Zhiyu\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ChaosGalaxyStudio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1537910/header.jpg?t=1658732490\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}