{
    "AppID": 1231270,
    "Name": "Dead's Prison Watcher",
    "Release date": "Feb 15, 2020",
    "About the game": "You are here to make your last job as a prison officer, but be aware for what kind of horror are waiting for you... Or just work a little more if you don't want to have a bad time. Here is what means to be a high security prison, but now is just a terrifying place that you can't stand still if you don't want a horrifying death. The problem is due bad circumstances some of them are gone... Alright, most of them. But your job are simply to watch the cameras and free the innocents at the right time, you do not need to worry about them after they leave the prison, just pay attention for the next one. In total have four innocents, each one need to be freed after a specific time in a specific order to make everything goes well. But the problem is the prisoner will chase each one to death until they have reached freedom. Your job is to monitor the cameras at the control room, having six guards willing to you send him to energy production or medicine collection, meaning that you can't leave the prison, run out of energy or letting yourself insane. But sending your guards to collect medicine close to him have some dangers, maybe he can chase to kill. Of course if you know where the prisoner is, will be more safer to your guards if you send they to where the prisoner isn't. A map can be accessed to see the prison blocks and in what cell will have medicine, but keep in mind that the prisoner knows where all medicine is. Camera files eventually goes corrupted if the prisoner gets close to them, you need to be sure that you are frequently accessing a partially corrupted camera to gradually lower his corruption levels. A warning will appear on the map monitor if a camera is high corrupted, but be sure that you access them before it corrupts even more. If not, the camera is eventually irreversibly corrupted and you will repair it yourself. Over time, camera corruption can be inevitable, and if one guard dies... You have no guarantee that you will not see him after that. Go spent a little time working for your new 'manager' on this strategic and terrifying game, I wish you a great job!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1231270/header.jpg?t=1628000697",
    "Price": 1.99,
    "Developers": "Twisted Gentleman",
    "Publishers": "Twisted Gentleman",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1231270/ss_9d91547702840ff88c6943d42f5fe90e661f0a0b.1920x1080.jpg?t=1628000697,https://cdn.akamai.steamstatic.com/steam/apps/1231270/ss_ea97c5d4cd9cf73c70edd416c7cd9aa6c3257408.1920x1080.jpg?t=1628000697,https://cdn.akamai.steamstatic.com/steam/apps/1231270/ss_bd2c1678b114b120491816d17063bafc677a0e1b.1920x1080.jpg?t=1628000697,https://cdn.akamai.steamstatic.com/steam/apps/1231270/ss_2db3dbfe058b171da840da4034e812a9e0be8d3c.1920x1080.jpg?t=1628000697,https://cdn.akamai.steamstatic.com/steam/apps/1231270/ss_d76121d019bc8552a1b4ffdb060b9a0a467ce369.1920x1080.jpg?t=1628000697",
    "Slug": "dead-s-prison-watcher",
    "Meta Title": "Dead's Prison Watcher: Feb 15, 2020, Twisted Gentleman an...",
    "Meta Description": "Looking for information on Dead's Prison Watcher? Check out the release date (Feb 15, 2020), developer insights from Twisted Gentleman, and a complete g...",
    "Alt Text Image": "Official header image for Dead's Prison Watcher game - Steam 1231270",
    "Canonical URL": "https://gusku.site/game/dead-s-prison-watcher",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dead's Prison Watcher\", \"description\": \"Looking for information on Dead's Prison Watcher? Check out the release date (Feb 15, 2020), developer insights from Twisted Gentleman, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 15, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Twisted Gentleman\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Twisted Gentleman\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1231270/header.jpg?t=1628000697\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}