{
    "AppID": 1037940,
    "Name": "Dead Monarchy",
    "Release date": "Jun 18, 2019",
    "About the game": "Please Read Before Buying! Dead Monarchy is now going through a rebuilding process so updates won't be as frequent. If you feel the game is not ready yet based on what I've mentioned below, it would be best to hold out and not buy the game yet. For those that do buy the game to provide me with feedback and to help support ongoing development, you have my utmost gratitude. Dead Monarchy is an open world, turn-based tactical RPG inspired by games such as Battle Brothers, XCOM and Jagged Alliance. Equip your warriors with historically inspired equipment and attempt to survive in a dying world overrun by all manner of monsters. There are three layers to the game. The 'town' layer where you manage the player base, the 'map' layer where you traverse the world and take on contracts and the 'combat' layer where you engage enemies in turn-based tactical combat. Currently in Early Access, the goal of the game is to hunt down and defeat the 5 Monarchs whilst simultaneously building up your company and upgrading/defending your base. [NEW] A multi-region open world map free for the player to traverse. There are 5 large maps, each map is a unique biome and has multiple settlements. This is still currently in active development. [NEW] There is now a perks system which completely reworks character progression. You can optionally carry up to two weapons which allows you to mix and match abilities at the expense of not fully mastering a specific weapon type. There are now also perks for boosting stats. Still in active development. [NEW] A manual save/load system has now been implemented as well as an optional ironman mode which is enabled during the start of a new game. Previously there was only an autosave system. That has changed, there are now 3 save slots for non ironman playthroughs and only 1 save slot for the ironman playthrough. Starting a new ironman playthrough will delete the current ironman playthrough. Not new but as an additional note, character death is permanent unless you reload a save file. Turn-based, tactical combat where the player can control up to 18 warriors at once. No longer do you have to justify to yourself for playing with a small party of 6 poor souls against the world. Combat is phase based, meaning all units within a faction act before the next faction goes however movement is based on action points allowing movement multiple times in a turn. Counter attacks and attacks of opportunity, ranged combat, synergistic abilities, flanking, action point system, positional bonuses and elevation tiles that influence hit chance. 45 active abilities divided into 9 weapon types. Sword, axe, mace, greatsword, greataxe, warhammer and rapier. There are then 2 ranged weapon types, longbow and crossbow. A boatload of armor sets to collect with heaps more to come in the future. 5 unique biomes to fight in, with each biome containing its own environmental hazards. Combat maps also have partial random map generation. Rocks, trees, environmental hazards and singular elevation tiles are all randomly generated using an algorithm. 65 monsters of which 60 have unique monster models. Not all unique monster abilities are animated yet, so there could be some confusion when it comes to 'feedback' during combat. Assume leadership over a town. Take on contracts to gather resources. Use those resources to upgrade your town buildings to prepare your warriors against the eventual town assaults and to give them the necessary support to hunt down the Monarchs. Dead Monarchy Studios is me, one guy named Kevin Zhang. I'm a solo developer and a gamer who's been chasing a lifelong dream of creating a RPG that I could live in. I was born and raised in Australia and I spent my childhood playing games. Dead Monarchy is my passion project and it has been influenced by games such as Battle Brothers, XCOM and Jagged Alliance. I plan to develop Dead Monarchy for several years, even after release. If I don't, then I'll see you at the stake. Cheers, Kevin.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1037940/header.jpg?t=1642570683",
    "Price": 9.99,
    "Developers": "Kevin Zhang",
    "Publishers": "Dead Monarchy Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_2fe05fe2acf350a899900b224a248984bc5caabf.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_99b9feb4b539d26204f2093f8fbb68004b02373d.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_b36ff028aba6ae262dbc1d97e6e35408ad74e692.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_f530f7982f77508e51ac1a0accfb056da0fb4e0a.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_09ed8129f5c8a65e553c51c4fc648b4ae26fab79.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_4712bf462e834ab93cf784c52178a4a0121600a7.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_7a812636f43a61a52adf3560b600e667d898fd73.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_aa6c50b1444cc4bc6fe1013f5c560810a6ccc5f5.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_7c9ea0f3bd31b60a08d7c3d824dedf1d3092acb1.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_100be99a18539502e4ac8e1000402cfe178ec174.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_9e3bd79ccf7eb8a4da94fa1acba7332ecaf262e6.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_7be202d4cb4d118ce4a6f7a2dcab97d1eb8fc22e.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_bcab7add519537ad9b9712c9ba715faf499d8450.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_28890349c792d721740969abd43a6f06e62b475a.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_fbeca0b28dfe21c1d35817ba8eaf422a229c33d1.1920x1080.jpg?t=1642570683,https://cdn.akamai.steamstatic.com/steam/apps/1037940/ss_373fc8fbb65a242735a56a56d6b844ff9755fcb4.1920x1080.jpg?t=1642570683",
    "Slug": "dead-monarchy",
    "Meta Title": "Dead Monarchy: Jun 18, 2019, Kevin Zhang and Full Overview",
    "Meta Description": "Looking for information on Dead Monarchy? Check out the release date (Jun 18, 2019), developer insights from Kevin Zhang, and a complete game summary.",
    "Alt Text Image": "Official header image for Dead Monarchy game - Steam 1037940",
    "Canonical URL": "https://gusku.site/game/dead-monarchy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dead Monarchy\", \"description\": \"Looking for information on Dead Monarchy? Check out the release date (Jun 18, 2019), developer insights from Kevin Zhang, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 18, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kevin Zhang\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dead Monarchy Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1037940/header.jpg?t=1642570683\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}