{
    "AppID": 418000,
    "Name": "Demented",
    "Release date": "Nov 18, 2015",
    "About the game": "Waking up as Bennet Helms you find yourself in a unknown place, however you do see your family which questions you deeply. You remember almost nothing but you see that something is wrong with this place, and given a choice to either just run or find your family. Survive, look for clues and items, hide and try to uncover the mysterious truth of the Visual Corporation. Key features: Sanity Sanity controls you . It will decide many things, and you can even use it to your advantage . But what is it actually? The main character is Bennet Helms has a brain tumor on the cerebral part of the brain (The part which controls communication, feelings, sense of reality, etc.). The tumor however can be contained with constant taking pills . Now, a few effects of the Sanity are: Makes the player hallucinate things. Spawns critters ('They can, and they will hurt you', the lower the sanity the more critters will come to hunt you) Decreased vision field. (Depends on the %(percentage) of the players sanity) Lowers your mental condition (Highlighting of things will be drastically decreased) 45% Critters starts start spawning 25% - Walk/Sprint slower 15% - Disabling the ability to sprint 10% - Black/White picture 5% - ' C-Condition ' - You will be very fast, you will ignore pain of the critters (This means you won't be effected if a critter pushes you, for example but you will receive damage), ability to see far objects, medication will be highlighted. *By hurting yourself you can go down to 15% of your HP (hitpoints). Every self-injury gives the sanity bar 20% sanity. WCD To simplify WCD is the ' brain ' of the Demented world. However it depends entirely on the players Health and Sanity (We will get to that in a moment). Now what does WCD do? It: Changes the world (A wall was there buddy? Well now it isn't.) Changes the perception of many things Spawns Critters (Critters are the 'monsters') Adds 'corruption' to the world Plays trick with your mind System Shutdown (SS) - Changes the power in the facility. And other Radiation Radiation is also a strong part of the game, as it can be rewarding but can be quite opposite as well. Also it can stop the decaying of Sanity but as the Radiation is higher it will hurt you too! Since it is a big part we cannot reveal all of the effects of the radiation. Some effects of Radiation are: Slows , or stops sanity from decaying. Depends on the percentage of the radiation. Even with little radiation you lose bits of health. It depends on the percentage of the radiation. 40+ REMs - Occasionally image blurring, and noises in head. 85+REMs - Walk/Sprint a lot slower, bad reflexes, decreased hearing. Future Development Make the WCD a heavy impact on the game, by changing, adding or removing whole parts of the map. Add more effects to the Sanity [For instance: heavy blurring, flashbacks of past, etc.] Add more effects to the Health[For instance: Add a bleed feature, when low on hp, to fall down sometimes] Improve the A.I - I have a great idea for you and am developing it as we speak! It'll be a lot of fun [By fun I mean in your most immediate death] Implementing Physic Engine [Ability to drag objects, boxes etc.] Optimize and polish textures, models and UI More intractable objects and voice overs for characters A lot more to come!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/418000/header.jpg?t=1652185216",
    "Price": 4.99,
    "Developers": "VisualTech48",
    "Publishers": "Volens Nolens Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/418000/ss_0b9b20aab862536ff28c70954bb90136b1642005.1920x1080.jpg?t=1652185216,https://cdn.akamai.steamstatic.com/steam/apps/418000/ss_49ed19314ab7920b310e103a7d0fbf26a4172111.1920x1080.jpg?t=1652185216,https://cdn.akamai.steamstatic.com/steam/apps/418000/ss_64ceceebffd341435f46a0cd5e75c836a906eeca.1920x1080.jpg?t=1652185216,https://cdn.akamai.steamstatic.com/steam/apps/418000/ss_6f5b6d86aecc767c98fb1d90b8447ced525d5d8b.1920x1080.jpg?t=1652185216,https://cdn.akamai.steamstatic.com/steam/apps/418000/ss_782a10e1e287074f595c66fb6eb944338c4b3082.1920x1080.jpg?t=1652185216,https://cdn.akamai.steamstatic.com/steam/apps/418000/ss_8e95055c54dd6fae104465d3c98bbbe188f62a30.1920x1080.jpg?t=1652185216,https://cdn.akamai.steamstatic.com/steam/apps/418000/ss_6f04a7fead99a370c4680212441446902fbf2ba0.1920x1080.jpg?t=1652185216,https://cdn.akamai.steamstatic.com/steam/apps/418000/ss_3a6840f92c43720221acbe7646b5ee55fe4b8c57.1920x1080.jpg?t=1652185216",
    "Slug": "demented",
    "Meta Title": "Demented: Nov 18, 2015, VisualTech48 and Full Overview",
    "Meta Description": "Looking for information on Demented? Check out the release date (Nov 18, 2015), developer insights from VisualTech48, and a complete game summary.",
    "Alt Text Image": "Official header image for Demented game - Steam 418000",
    "Canonical URL": "https://gusku.site/game/demented",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Demented\", \"description\": \"Looking for information on Demented? Check out the release date (Nov 18, 2015), developer insights from VisualTech48, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 18, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"VisualTech48\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Volens Nolens Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/418000/header.jpg?t=1652185216\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}