{
    "AppID": 408440,
    "Name": "Dream Factory",
    "Release date": "Nov 2, 2015",
    "About the game": "Sitting in front of a screen or TV you might think that the process behind filming and producing a movie is a piece of cake. Try and play Dream Factory first. With this Filming Simulator you will ‘dive’ headfirst into the busy world of movie making. Dream Factory is a PC (Win, Mac, Linux) and tablet (iOs, Android) based Simulator game. The movie making process doesn't always catch everyone’s attention because everyone likes watching the final result. But many of us really do like to know what lies behind the curtain, behind the stage… Our approach is to look at the industry in an ironic way. We’ve reviewed many different samples and cliches of both the old and modern Hollywood Industry, and rediscovered the most memorable names who made the filming culture of 20th-21st centuries what it is today. In Dream Factory you will have to create and organize the movie process, you will have to deal with greedy marketeers and tricky-chicky finance directors, while also having to put all your efforts to butter up capricious actors. On top of this you will have to learn how to build your studio and production company, brick by brick while, dealing with accounting problems and the like. But it won’t be a boring process, as we aim to take the humor and irony of the real world filming process and bring it into to our game. You can play the demo on our website &amp; give the games mechanics a go. Our story starts from at the very beginning, that is from brothers Lumiere's era and then continues through epoch by epoch to today and even beyond. That means Dream Factory will give you a glimpse into the future. In the final version of the game you will engage in the following tasks: Studio building process Screenplay writing Movie shooting process Movie promotion by means of marketing campaign Solve different complicated tasks and objectives Level up your characters Discover new movie genres Track the needs of your characters Act according to the cases prescribed in the contract for actresses and actors Avoid waves of fans Manage Actors who are affected by traumas and nervous breakdowns or manage situations where Actors have died while shooting a film Receive awards and participate in exhibitions Compete with your friends and attract their or other competitors actors to your own studio Look up the reviews in press after the movie released and track what was done right and what was done wrong Buy new territory to expand and grow your studio We plan to have 21 type of characters with at least 20 modifications to be drawn for each character to provide the game with more variation. All characters are hired via a HR market that is generated randomly during game play. Super-skilled characters (with high fame or status) may be found on the market alongside with unknown ones which you will have to train and grow yourself. Each type of character will posses his or her own modifiers (traits) that will influence certain game aspects. These traits are added to a character when they're born. Also during the process of filming, relationships between your staff may also come into being. These can be both positive and negative. For example, some relationships may influence other characters to leave the studio. We have already show some of the characters we plan to add below, but we plan to add more from the cinema industry, such as Audio Engineers, Movie Directors or Producers, Stage Movie Directors, Janitors, Managers, Handymen, Finance Directors, Marketeers, Costume and Makeup Artists, Extra Actors, Stunt Coordinators.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/408440/header.jpg?t=1473784711",
    "Price": 9.99,
    "Developers": "The Tambourine",
    "Publishers": "The Tambourine",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/408440/ss_318de8a7650bb0ef3a5f4a208c26a37508a6a70c.1920x1080.jpg?t=1473784711,https://cdn.akamai.steamstatic.com/steam/apps/408440/ss_e93b8e4c99546f7a03fae4c3db335311152581f6.1920x1080.jpg?t=1473784711,https://cdn.akamai.steamstatic.com/steam/apps/408440/ss_ac16977e552bc2a6e9a50092ab5f72e9fc540560.1920x1080.jpg?t=1473784711,https://cdn.akamai.steamstatic.com/steam/apps/408440/ss_4c129858edfb9bba3d66893b3fd4ed9a7784f545.1920x1080.jpg?t=1473784711,https://cdn.akamai.steamstatic.com/steam/apps/408440/ss_8c1d0afe93e52a3a514ce6ff3d9915ac25eed754.1920x1080.jpg?t=1473784711,https://cdn.akamai.steamstatic.com/steam/apps/408440/ss_1e181fe586512166ef956917a52be5f7948166ea.1920x1080.jpg?t=1473784711",
    "Slug": "dream-factory",
    "Meta Title": "Dream Factory: Nov 2, 2015, The Tambourine and Full Overview",
    "Meta Description": "Looking for information on Dream Factory? Check out the release date (Nov 2, 2015), developer insights from The Tambourine, and a complete game summary.",
    "Alt Text Image": "Official header image for Dream Factory game - Steam 408440",
    "Canonical URL": "https://gusku.site/game/dream-factory",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dream Factory\", \"description\": \"Looking for information on Dream Factory? Check out the release date (Nov 2, 2015), developer insights from The Tambourine, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 2, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Tambourine\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Tambourine\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/408440/header.jpg?t=1473784711\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}