{
    "AppID": 65800,
    "Name": "Dungeon Defenders",
    "Release date": "Oct 18, 2011",
    "About the game": "Dungeon Defenders is a Tower Defense Action-RPG where you must save the land of Etheria from an Ancient Evil! Create a hero from one of four distinct classes to fight back wave after wave of enemies by summoning defenses and directly participating in the action-packed combat! Customize and level your character, forge equipment, gather loot, collect pets and more! Take your hero through multiple difficulty modes and challenge/survival missions to earn more experience &amp; even better treasure. Join your friends with 4-player online and local (splitscreen) co-op to plan your strategies together or compete in PvP Deathmatch. Key Features 4-player Online and Local Co-Op - Team-up with up to 3 friends to defend cooperatively, with character classes that support each other’s strengths and weaknesses. Dynamically combine local (splitscreen) and online players and leave/join any time, so that the game’s always full. Tower-Defense Meets Action-RPG - Choose your class, customize your character &amp; equipment, strategically assemble your defenses, and participate directly in action-packed battle to preserve your castle against the invading horde! 4 Distinct Character Classes - Each character class has a different skill tree, set of towers, and even basic attacks! You can choose if you want to play stealthy, turn invisible, and plant traps behind enemy lines with the Huntress or go all out, block off choke points, and brutally beat your foes into submission with the Squire! Loot and Level-Up - Grab the mounds of money and items that your defeated foes drop and trade them or store them for later use in your Item Box! Getting kills and completing waves earns you experience points, which can be used to upgrade your characters, skills, equipment, and towers on a per-statistic basis. Do you want to enhance Hit Points, Attack Rate, Damage, etc? The choice is yours... Store your massive overflow of money in the 'Mana Bank' and then spend it to improve your equipment or trade with other players. Proudly show off your best equipment in your own 'Adventurer’s Tavern', without fear of item theft! Tons of Enemies and Huge Boss Fights - Over 100 simultaneous enemies will attempt to tear through your defenses and gigantic Boss Monsters will appear to rain down havoc upon everyone. Only by employing the most effective defensive strategies, teamwork, and strong characters will you defeat such devilish foes! Many enemy types run the gamut from big dumb Orcs swinging huge axes, to lithe Dark Elves that strike from the shadows, to crazy kamikaze goblins! Can you defeat the epic boss battles and collect the special loot while still defending your crystals? Mission &amp; Game Play Variety - Each level has a different visual setting, layout, enemy types, traps, and distinct surprises. To collect all the loot and reach the highest levels you must take your character through 4 difficulty modes, survival missions, challenge maps, and more! Some maps force you to have mobile defenses, guarding a crystal which warps around the map. Others have YOU attacking enemy encampments! Collect and Trade Pets Online - A variety of pets exist to assist you in the land of Etheria, each with distinct behaviors. These pets can be leveled-up and customized to match your unique play-style. They can even be traded online with other players! Secure Trading System - Afraid another player won't live up to their word? Use our secure trading system to trade your precious weapons, armor, and pets with other players online! Watch your name and fame spread online, as people seek out the best pet raisers or item forgers! A Mountain of Stats - Every shot you take, kill you make, and defense you build is logged and recorded for posterity. Pore over the voluminous charts and graphs at the end of each session to analyze your team’s performance, quickly review your best statistics for each level, and compare your data online with other players to see who is the greatest hero of all. Furthermore, your Achievements are visible for all to see within your very own Adventurer’s Tavern, and the highest scores for each of your heroes are ranked on the worldwide leaderboards! Dungeon Defenders Development Kit - Dungeon Defenders includes a free development kit where you can create and edit new Dungeon Defenders missions and more utilizing all of the existing Dungeon Defenders assets. Download and share these user created levels via Steam Workshop for an endless Dungeon Defenders experience!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/65800/header.jpg?t=1617394709",
    "Price": 14.99,
    "Developers": "Trendy Entertainment",
    "Publishers": "Trendy Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/65800/ss_b1d65cd78ad075bbe2c4ba47a28a6a225018b09c.1920x1080.jpg?t=1617394709,https://cdn.akamai.steamstatic.com/steam/apps/65800/ss_ae947199ba474a6fd5829ab17db98884d8ca0a9e.1920x1080.jpg?t=1617394709,https://cdn.akamai.steamstatic.com/steam/apps/65800/ss_f6b62c43a1d247b4f248a327c93b6531d0124189.1920x1080.jpg?t=1617394709,https://cdn.akamai.steamstatic.com/steam/apps/65800/ss_22b8dc51ea4068e75dbf96c45caaf16c9c55b056.1920x1080.jpg?t=1617394709,https://cdn.akamai.steamstatic.com/steam/apps/65800/ss_419278dc70aff71c28b97615308c5a3ecf37ceaf.1920x1080.jpg?t=1617394709,https://cdn.akamai.steamstatic.com/steam/apps/65800/ss_d38d3f89eb45e5e7d7043510b0c31d88ad7634f4.1920x1080.jpg?t=1617394709,https://cdn.akamai.steamstatic.com/steam/apps/65800/ss_67642e4dce013991fc3104766cb985b22eea1d35.1920x1080.jpg?t=1617394709,https://cdn.akamai.steamstatic.com/steam/apps/65800/ss_72318038bdfb641e8240a1f61e1bef2d517c726d.1920x1080.jpg?t=1617394709,https://cdn.akamai.steamstatic.com/steam/apps/65800/ss_593353f3c6799faedbc41127d1b491d28aa3e5f5.1920x1080.jpg?t=1617394709,https://cdn.akamai.steamstatic.com/steam/apps/65800/ss_d7348325b6c3cd9163c331cce7c78ac46b1e01bf.1920x1080.jpg?t=1617394709,https://cdn.akamai.steamstatic.com/steam/apps/65800/ss_79cd1c409b3731ce7324b993ed55d2a61ade9b47.1920x1080.jpg?t=1617394709",
    "Slug": "dungeon-defenders",
    "Meta Title": "Dungeon Defenders: Oct 18, 2011, Trendy Entertainment and...",
    "Meta Description": "Looking for information on Dungeon Defenders? Check out the release date (Oct 18, 2011), developer insights from Trendy Entertainment, and a complete ga...",
    "Alt Text Image": "Official header image for Dungeon Defenders game - Steam 65800",
    "Canonical URL": "https://gusku.site/game/dungeon-defenders",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dungeon Defenders\", \"description\": \"Looking for information on Dungeon Defenders? Check out the release date (Oct 18, 2011), developer insights from Trendy Entertainment, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 18, 2011\", \"author\": {\"@type\": \"Organization\", \"name\": \"Trendy Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Trendy Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/65800/header.jpg?t=1617394709\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}