{
    "AppID": 1869220,
    "Name": "DYMENSION Prologue:Scary Horror Survival Shooter",
    "Release date": "Feb 3, 2022",
    "About the game": "GET FULL GAME Dymension:Scary Horror Survival Shooter This is a horror game in the first person. You have to go through the first part of the game. You travel from city to city because you are not used to staying in one place. While working at a gas station, you come across a newspaper with a vacancy announcement for the position of a security guard, and by dialing the number, you were asked several questions. Only one point was important - are you ready to follow the rules and perform the tasks? You were not interested in the details, because you did not plan to stay in this place. The only thing that interested you was the payment and bonuses for the night shift. You don’t have much to choose from, and you have only the military service as an experience. Because of your hot-tempered personality, it was difficult for you to linger on past jobs. It was not easy to find the place, because it was hidden far from the nearest settlement. Night, bad weather, lack of good visibility, and you turned onto the wrong road. Precious time is lost. You didn’t find anyone at the founded location and decided to call the intercom. The voice was not very friendly. After receiving the entry code and instructions on where to go next, you get to the meeting place with your employer. The action of the game begins in the elevator. It’s your first day at a new job, you’re a little worried that you’re late. Forgot to read the instructions you received in the mail. Thoughts appeared in my head about how to fix this situation. The elevator doors have opened in front of you, and behind them is a man who is extremely passionate about something. The attempt to start a conversation failed and there was an awkward pause. A siren sounded. You were reminded of the instructions that you didn’t have time to read, and it probably contains important information. Well, nothing, we’ll figure it out on the spot, and you won’t get used to it. You have a strange feeling that the whole situation is extremely strange. As soon as you want to take up your duties, mysterious things begin to happen that frighten… What’s going on here? This is not the job I was hoping for at all, but what if I fell for a trick? You have to find out because the further you go, the more things are starting to get out of control..... Features: - A complicated story with a plot twist ; - You will have to collect information bit by bit and figure out what is happening; - Solve puzzles and use all available objects; - The creepy and tense atmosphere only escalates the situation; - Especially the gloomy concept of the game; - Light is your only helper; - The weapon will not be easy to get, and each cartridge is valuable; - Different mechanics of the characters’ behavior will make you nervous and make quick decisions; - As a bonus, you will open a new location where you can get new hints for the game;",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1869220/header.jpg?t=1648674705",
    "Price": 0.0,
    "Developers": "Midnight Games",
    "Publishers": "Midnight Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1869220/ss_52473100e8c15237b7bbb31c1868d6b03b447296.1920x1080.jpg?t=1648674705,https://cdn.akamai.steamstatic.com/steam/apps/1869220/ss_b3dff6bd813372a9f704592826577abdd8a6a67b.1920x1080.jpg?t=1648674705,https://cdn.akamai.steamstatic.com/steam/apps/1869220/ss_0f964a27bdc0a385e651da512a913dc4ab05ec30.1920x1080.jpg?t=1648674705,https://cdn.akamai.steamstatic.com/steam/apps/1869220/ss_4374ab0e375e0d87cf2c162c184e2490c906e814.1920x1080.jpg?t=1648674705,https://cdn.akamai.steamstatic.com/steam/apps/1869220/ss_40c6914b586b977e2c0108ac605f3a94454dd23e.1920x1080.jpg?t=1648674705,https://cdn.akamai.steamstatic.com/steam/apps/1869220/ss_889785d3a0584965351e90b9d050eca2a1c3529c.1920x1080.jpg?t=1648674705,https://cdn.akamai.steamstatic.com/steam/apps/1869220/ss_bcc251e0e56e231184daed378ea0239e83e3226f.1920x1080.jpg?t=1648674705",
    "Slug": "dymension-prologue-scary-horror-survival-shooter",
    "Meta Title": "DYMENSION Prologue:Scary Horror Survival Shooter: Feb 3, ...",
    "Meta Description": "Looking for information on DYMENSION Prologue:Scary Horror Survival Shooter? Check out the release date (Feb 3, 2022), developer insights from Midnight ...",
    "Alt Text Image": "Official header image for DYMENSION Prologue:Scary Horror Survival Shooter game - Steam 1869220",
    "Canonical URL": "https://gusku.site/game/dymension-prologue-scary-horror-survival-shooter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DYMENSION Prologue:Scary Horror Survival Shooter\", \"description\": \"Looking for information on DYMENSION Prologue:Scary Horror Survival Shooter? Check out the release date (Feb 3, 2022), developer insights from Midnight ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Midnight Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Midnight Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1869220/header.jpg?t=1648674705\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}