{
    "AppID": 912630,
    "Name": "Dystopia",
    "Release date": "Aug 17, 2018",
    "About the game": "[[HARDCORE STRATEGY &amp; CARD GAME]] [[PERMANENT DEATH,DATA ERASE RISK]] Dystopia is 'Turn-Baced Strategy game'. Player is an army back to Japan.He experienced WWII. Player's purpose is 'Trust degree' from one, or both of North Japan[Communist] and South Japan[CIA], in 2 years. For the purpose, players can hire agents in the 'Strategic part' and deploy it to various parts of Japan. The agents has various abilities.The mission succeeds with the probability according to their abilities. And you can get trust degree, funds, and EXP from it. This action consume a week. Excellent agents tend to be dangerous people. Sometimes they hurt other agents and steal your funds. The Agents that died in these processes will never come back, so we recommend that you play carefully. Some enemy may notice your identity 'double spy'. In such a case, 'Raid part' will occur. This part is done by a Card battle based on Janken[Rock-paper-scissors], and all agents participate. This is mandatory and total warfare. If you can not win, your game data will be lost. ~INTRODUCTION~ Japan was divided into North and South. North Korea's Labor Party, South Japan's CIA ... ... They aim for homeland reunification as a double spy. To do that, we need a lot of subordinates, money, settlement power. Depending on whether you are betrayal, heartless or human ... ... everything is entrusted to you. Character design is handled by 'JUNNY' who worked on 'Detective Jingu-ji Saburo[a.k.a. Jake Hunter]'Series! ~ Prologue ~ Lt. Army Intelligence Department lieutenant Ryusuke Igarashi, who was stationed in Manchurian Kwantung Army, I failed to withdraw to the mainland Japan after the end of the war. As a result, my wife and my daughter who was just born at that time have not been contacted Brought by the Soviet Union, detained in Siberia, and received 'education'. Igarashi who was bought the experience as an intelligence department It was sent to Moscow with Shigeo Tanaka who was a former subordinate, 'Study abroad' to the Soviet secret police KGB. In 1953, Igarashi and Tanaka were specially, He was allowed to return to Japan on condition that he will be appointed secret police in Tokyo. Igarashi and others saw that, It was Japan divided into north and south. Steady reconstruction as a member of Western countries South of Japan developing ... ... And undermining Stalin's death under Labor's control, It is northern Japan. Becoming a substantial puppet of America and the Soviet Union, Igarashi saw North and North Japan where the gap spreads. Their urgency is unification of the North and North, In other words, it came to believe that it was 'recapture' of the motherland. A chance of 'collapse' from the inside of North Japan ,,,, I looked for opportunities for contact with the CIA. In 1956, Khrushchev criticized Stalin in the Soviet Union. Peak in the northern Japan reaches its peak. CIA agent by multiplying it We begin full-scale infiltration into North Tokyo. Igarashi and Tanaka who grabbed the information I will make contact with the CIA without missing this machine ....",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/912630/header.jpg?t=1542411274",
    "Price": 0.0,
    "Developers": "BIG BOYS STUDIO",
    "Publishers": "Step cloud inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/912630/ss_5cb42cc8c31bff0efa96b298578ffd6ddacaf33f.1920x1080.jpg?t=1542411274,https://cdn.akamai.steamstatic.com/steam/apps/912630/ss_92767d627a6e188dc646a3f21e8d2d93672838a7.1920x1080.jpg?t=1542411274,https://cdn.akamai.steamstatic.com/steam/apps/912630/ss_5f593ebba79711dff1dd8eba3325f44df205399e.1920x1080.jpg?t=1542411274,https://cdn.akamai.steamstatic.com/steam/apps/912630/ss_12bb8d5e00fdc0148c05df3bd716f1b283495408.1920x1080.jpg?t=1542411274,https://cdn.akamai.steamstatic.com/steam/apps/912630/ss_d90832e113f8af6a6ab6a80b4fe0f0e330781a4c.1920x1080.jpg?t=1542411274,https://cdn.akamai.steamstatic.com/steam/apps/912630/ss_b11f2d66afa173db856dd505304fb3fb96253012.1920x1080.jpg?t=1542411274,https://cdn.akamai.steamstatic.com/steam/apps/912630/ss_c2be18771fd0494e3fd9b4427402d638b85b509c.1920x1080.jpg?t=1542411274,https://cdn.akamai.steamstatic.com/steam/apps/912630/ss_6d758d8bb8c34b867bf75209ca3b36a1a716894e.1920x1080.jpg?t=1542411274",
    "Slug": "dystopia",
    "Meta Title": "Dystopia: Aug 17, 2018, BIG BOYS STUDIO and Full Overview",
    "Meta Description": "Looking for information on Dystopia? Check out the release date (Aug 17, 2018), developer insights from BIG BOYS STUDIO, and a complete game summary.",
    "Alt Text Image": "Official header image for Dystopia game - Steam 912630",
    "Canonical URL": "https://gusku.site/game/dystopia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dystopia\", \"description\": \"Looking for information on Dystopia? Check out the release date (Aug 17, 2018), developer insights from BIG BOYS STUDIO, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"BIG BOYS STUDIO\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Step cloud inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/912630/header.jpg?t=1542411274\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}