{
    "AppID": 265470,
    "Name": "Even the Ocean",
    "Release date": "Nov 16, 2016",
    "About the game": "From the creators of Anodyne comes a grand story about Aliph, a lowly power plant technician for Whiteforge City, who finds her world turned upside-down after a routine maintenance trip goes awry. Now, working directly with Whiteforge's Mayor Biggs to face an unknown menace, Aliph must navigate her newfound power and influence to save the city. Aliph's identities, environmental issues and the world’s fate all hang in the balance of Light and Dark energies. Balance your energy bar with Light and Dark energies to overcome diverse obstacles and stabilize the city. Meet and talk with new friends, powerful allies, and enigmatic travellers Explore the beautiful and strange geography in the overworld, towns, and environments surrounding Whiteforge City Super customizable difficulties and play styles: choose between Complete, Story-only, or Gameplay-only options to make your experience your own ESRB Rating E. Content Warnings below. Presented by Analgesic Productions. ~ Press Quotes 'Even The Ocean is the sort of game I'm pretty primed to like: It's a well-designed, challenging 2D platformer with a unique energy-balancing mechanic. It features an inclusive, politically aware story, with narrative beats about community, identity and activism. It has pretty pixel art and moody music. And it was made by Analgesic studios, the two-person team behind one of my favorite titles of 2013, Anodyne, a beautiful, pointed take on 2D Zelda-style games. That was always going to speak to me. But what I found in Even the Ocean surprised me even further: It's not just a good game, but a milestone for a sensitive, thoughtful studio working in an uncertain and often downright scary world.' - Danielle Riendeau for Waypoint 'Perhaps even more intriguing, though, is how this energy system affects the logic and culture of Even the Ocean‘s world. It makes sense that the tallest city, Whitforge City, and its celestial spire runs on Light energy. Given that it relies on the power plants that Aliph restores to keep running, the city and its Light energy also come to represent industrialism and science.' - Chris Priestman for Killscreen 'Even the Ocean is a shining example of how we should be treating diversity and accessibility in games paired with interesting plaforming challenges.' - Affinity Archives Steam Curator ~ Youtube Gameplay Footage Even The Ocean (1): Super Accessible, Chill Narrative Platformer by Sir TapTap Smash Look! - Even The Ocean Gameplay by Smash GaminG!! - Frazzz -- Content Warnings (No Spoilers) Environmental Doom/Catastrophe, Workplace Deaths, Bigotry towards LGBTQ+ people and POC, mild body horror Content Warnings (Spoilers) Bigotry towards LGBTQ+ people and POC - some of the NPCs in Whiteforge say bigoted things to the player/other characters Workplace Deaths (Early on, a character is electrocuted and dies (no gore or graphic violence though). Later, another character is dead due to electrocution. Mild body horror: Some late-game areas have level art that resembles muscles, muscle cells, and other organic things. Environmental Doom/Catastrophe: The world's energy is unbalanced and it's caused giant creatures to appear. You are trying to stop the world from going out of balance. (BIGGER SPOILER): In the end, you fail and the world is flooded, killing everyone (non-graphically).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/265470/header.jpg?t=1630303249",
    "Price": 14.99,
    "Developers": "Melos Han-Tani,Marina Kittaka",
    "Publishers": "Analgesic Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/265470/ss_c2cb52627dde26f6f8812a771a62a3f15e02635a.1920x1080.jpg?t=1630303249,https://cdn.akamai.steamstatic.com/steam/apps/265470/ss_97e01abb4d9ced6a5369ecbec4e278023a393e46.1920x1080.jpg?t=1630303249,https://cdn.akamai.steamstatic.com/steam/apps/265470/ss_ec59e7ef968e1e4ef97923fd943f4c0fb75ea2ae.1920x1080.jpg?t=1630303249,https://cdn.akamai.steamstatic.com/steam/apps/265470/ss_d9de851c10d86be689442df9cf045c78d74a0854.1920x1080.jpg?t=1630303249,https://cdn.akamai.steamstatic.com/steam/apps/265470/ss_cf4faac164967987526235f4b3ad0b8e23fbd423.1920x1080.jpg?t=1630303249,https://cdn.akamai.steamstatic.com/steam/apps/265470/ss_55ea0c792decca50481af3381c319b4301f77ad1.1920x1080.jpg?t=1630303249,https://cdn.akamai.steamstatic.com/steam/apps/265470/ss_6f59b993950aa718d0eabae5873e6bd2182652fe.1920x1080.jpg?t=1630303249",
    "Slug": "even-the-ocean",
    "Meta Title": "Even the Ocean: Nov 16, 2016, Melos Han-Tani,Marina Kitta...",
    "Meta Description": "Looking for information on Even the Ocean? Check out the release date (Nov 16, 2016), developer insights from Melos Han-Tani,Marina Kittaka, and a compl...",
    "Alt Text Image": "Official header image for Even the Ocean game - Steam 265470",
    "Canonical URL": "https://gusku.site/game/even-the-ocean",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Even the Ocean\", \"description\": \"Looking for information on Even the Ocean? Check out the release date (Nov 16, 2016), developer insights from Melos Han-Tani,Marina Kittaka, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 16, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Melos Han-Tani,Marina Kittaka\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Analgesic Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/265470/header.jpg?t=1630303249\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}