{
    "AppID": 1584900,
    "Name": "Faerie's Bargain: The Price of Business",
    "Release date": "Dec 2, 2021",
    "About the game": "Become the greatest of the goblin merchants in a magical market beneath Victorian London that trades in memories, wishes, secrets, and more. Will you line your pockets, defend the Queen, or plot to put a puppet on the Throne? Faerie’s Bargain: The Price of Business is a 291,000-word interactive fantasy novel by Trip Galey where your choices control the story. It’s entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination. You are a merchant of the Untermarkt, the goblin market that has existed beneath London since High Queen Elizabeth first forged the Treaty with Titania, Queen of Faery. You are skilled in dealing in all manner of impossibilities: new faces and voices, silks spun of starlight, bottled time, twists of fate, and other stranger things. Devote yourself to growing your wealth, or use it for political, social, and magical advantage. If a rival merchant threatens you, fight back with wits and wisdom, or ruthless, underhanded tricks. It’s all in a day’s work. When a mysterious business opportunity takes you by surprise, you have the chance to deal in something new: political intrigue! High Queen Victoria sits upon the Throne, but there are many who would prefer to rule in her place. Do you defend the status quo or use your newfound wealth to fund a little revolution? Your fellow merchants certainly won’t allow an opportunity for profit to slip away. Do you undercut their efforts at the Merchant Conclave, or ignore all the politicking in favor of growing your wealth? Whatever you decide, one thing is certain: It’s time to get down to business! Play as male, female, or non-binary; gay, straight, bisexual, pansexual; asexual and/or aromantic. Play as mostly-human, mostly-faery, or an even balance between the two, and shift the levels between the two extremes as the tory progresses. Make an alliance with a sentient aspect of reality such as Roses, Mirrors, or the Fog of London! Romance—or betray!—a socialite, a Lord, a Lady, maybe even your Supernatural Ally! Make deals with creatures both fey and mortal; trade in favors, memories, magic, bottled time, twists of fate, and more! Attend society balls and grand galas, investigate scheming nobles, and defend (or betray) the Empire from threats without and within! Advocate for the rights of children trapped in factories and labor contracts, or exploit their plight for your own gain. Play politics to bolster or break the relationship between the Empire and Faery, to make your own fortune, or to put a puppet on the Throne!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1584900/header.jpg?t=1638455962",
    "Price": 5.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1584900/ss_7cb50b3376d725a708f1129a9aaf94ef6ffa2d78.1920x1080.jpg?t=1638455962,https://cdn.akamai.steamstatic.com/steam/apps/1584900/ss_65a7d64762a60aaf54caf145e8855aece9ec0b5e.1920x1080.jpg?t=1638455962,https://cdn.akamai.steamstatic.com/steam/apps/1584900/ss_dcacdee5a64badf8b379cae998cc5095318fc92e.1920x1080.jpg?t=1638455962,https://cdn.akamai.steamstatic.com/steam/apps/1584900/ss_e98a82038fd013bc0ba68675c2a1d6805c032643.1920x1080.jpg?t=1638455962,https://cdn.akamai.steamstatic.com/steam/apps/1584900/ss_d44a082c54d8d65e701ddc191b30d64e8330e071.1920x1080.jpg?t=1638455962",
    "Slug": "faerie-s-bargain-the-price-of-business",
    "Meta Title": "Faerie's Bargain: The Price of Business: Dec 2, 2021, Cho...",
    "Meta Description": "Looking for information on Faerie's Bargain: The Price of Business? Check out the release date (Dec 2, 2021), developer insights from Choice of Games, a...",
    "Alt Text Image": "Official header image for Faerie's Bargain: The Price of Business game - Steam 1584900",
    "Canonical URL": "https://gusku.site/game/faerie-s-bargain-the-price-of-business",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Faerie's Bargain: The Price of Business\", \"description\": \"Looking for information on Faerie's Bargain: The Price of Business? Check out the release date (Dec 2, 2021), developer insights from Choice of Games, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1584900/header.jpg?t=1638455962\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}