{
    "AppID": 863190,
    "Name": "Gamer Sensei's Range Royale",
    "Release date": "Sep 17, 2018",
    "About the game": "Welcome to Range Royale! Enter your personal practice arena - a solo experience designed to challenge your shooting skills while testing and improving reflexes. Range Royale is designed by the esports professionals at Gamer Sensei to help you win more in any game where shooting skill matters. Range Royale Early Access Edition Includes 5 Game Modes Practice at the Target Range Improve your accuracy, timing, and target-to-target transition in this classic shooting range mode. Center-mass bullseyes and headshots give more points. Rounds are timed and scored to provide feedback on your accuracy. Speed Your Way to Success Nail as many disc targets as you can. Miss? Round's over. Take too long? Round's over. Run out of time? Round's over. This mode is an unforgiving test of your rapid-fire shooting skills, trigger control, and target recognition speed. Get good on this and Battle Royale firefights will be your oyster. Get Good Against Bots A series of automated opponents spawn across the range, increasing the challenge level. To help you map this to your favorite BR game, these bots engage in realistic enemy behaviors, including, dodging, taking advantage of cover, and firing back. Get good at focusing your fire on armored opponents so you’ll be ready for your next final-10 firefight! Ready for a Challenge? Try our Zombie attack mode. Vulnerable only to headshots, wave after wave of Zombie opponents swarm your position. Defeat as many as you can before they reach out and touch you. This mode combines rapidly increasing enemy spawns with limited target zones to put even the most elite skills to the test. Death from a Distance Take on pop-up targets and roving AI as you work on your long-distance shooting skills on our Sniper Range. Learn to place your shots on moving, dodging targets at multiple distances and difficulties. Next time you find that great scope be confident that you can reach out and touch someone no matter how far away! Range Royale Early Access Edition Also Includes Four Weapons M9 Pistol M416 Micro-Uzi SKS Kar98k 3 Weapon Attachments Iron Sights Red Dot Sight Holographic Sight 2x Scope 4x Scope 8x Scope 3 Ammo Modes Unlimited Ammo (available in Target and Speed Shooter modes) Extended Mag Standard Mag Coming Soon While Range Royale is in Early Access our primary focus is on addressing player feedback and tuning what’s in the game. At the same time we’ll be hard at work on new features for upcoming releases including: Armed Assault Work on your close-quarters chops in this specially-designed range that simulates common in-game battle scenarios. Be prepared next time you turn a corner into enemy fire! More Weapons, Scopes &amp; Mods We’ll be adding more weapons, scopes, and mods over time as part of weapons packs. Some will be included in the core Range Royale bundle while others may be separate purchases. Give us your feedback to help us choose the next weapons to add.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/863190/header.jpg?t=1537206242",
    "Price": 5.99,
    "Developers": "Gamer Sensei",
    "Publishers": "Gamer Sensei",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/863190/ss_c6711f20551f875490616547c8fd901fac9d282b.1920x1080.jpg?t=1537206242,https://cdn.akamai.steamstatic.com/steam/apps/863190/ss_4c7ccaa472dca05aa4bbd913ef469d3d3ec6c3e9.1920x1080.jpg?t=1537206242,https://cdn.akamai.steamstatic.com/steam/apps/863190/ss_ee975a06c79db877874784563bc2ea4a627a8476.1920x1080.jpg?t=1537206242,https://cdn.akamai.steamstatic.com/steam/apps/863190/ss_9b1b9a07a2395e78a46d0caf4c36ea9c89fa240b.1920x1080.jpg?t=1537206242,https://cdn.akamai.steamstatic.com/steam/apps/863190/ss_928ad8d0bce7c8881b975977a798e3921d0cb872.1920x1080.jpg?t=1537206242,https://cdn.akamai.steamstatic.com/steam/apps/863190/ss_a29d2f7cd08324b2709f188c71f96ba78d70a6a6.1920x1080.jpg?t=1537206242,https://cdn.akamai.steamstatic.com/steam/apps/863190/ss_03c8461f58e5016637573783733021b89b2f8704.1920x1080.jpg?t=1537206242,https://cdn.akamai.steamstatic.com/steam/apps/863190/ss_49eed1c665e3213bf841bf446873f2f00e576b54.1920x1080.jpg?t=1537206242,https://cdn.akamai.steamstatic.com/steam/apps/863190/ss_8f0b26bed744514b2bc851ad990b6883a8b04cfb.1920x1080.jpg?t=1537206242",
    "Slug": "gamer-sensei-s-range-royale",
    "Meta Title": "Gamer Sensei's Range Royale: Sep 17, 2018, Gamer Sensei a...",
    "Meta Description": "Looking for information on Gamer Sensei's Range Royale? Check out the release date (Sep 17, 2018), developer insights from Gamer Sensei, and a complete ...",
    "Alt Text Image": "Official header image for Gamer Sensei's Range Royale game - Steam 863190",
    "Canonical URL": "https://gusku.site/game/gamer-sensei-s-range-royale",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gamer Sensei's Range Royale\", \"description\": \"Looking for information on Gamer Sensei's Range Royale? Check out the release date (Sep 17, 2018), developer insights from Gamer Sensei, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gamer Sensei\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gamer Sensei\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/863190/header.jpg?t=1537206242\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}