{
    "AppID": 911430,
    "Name": "Good Company",
    "Release date": "Jun 21, 2022",
    "About the game": "Good Company is an in-depth management sim about building a bustling tech corporation in a world inspired by the trail-blazing spirit of Silicon Valley. Assemble complex production lines, manage employee logistics, and sell high-quality products on the market to become the best company in the whole county! BECOME A PRODUCTION POWERHOUSE Turn a garage into your first manufacturing headquarters and eventually develop it into a leading tech corp. Purchase materials, hire staff and craft a wide range of items as you focus on building an efficient production line that always keeps the goods flowing! AUTOMATE FOR SUCCESS Create complex production loops using a powerful logistics system. Expand into new buildings and improve efficiency with zone management, work policies and fully automated machines. INVENT AND INNOVATE Design new tech products that will conquer an ever-changing market. Focus on in-demand features and create high-quality products - or just squeeze as much profit out of them as you can! GET BIGGER, BETTER, BOLDER Build beyond your humble beginnings by expanding your facilities, investing in new markets and researching new technology. Manufacture advanced products like robots and improve workflow using the power of conveyor belts! BE A BACKYARD VISIONARY Play Campaign mode and follow the story of a local entrepreneur determined to save the economy of their home county! Complete missions with a high rating and prove yourself through additional challenge levels. COLLABORATE WITH FRIENDS Explore unlimited possibilities in Freeplay mode and work together in online Multiplayer for up to 4 players (includes cross-platform compatibility). Single player Campaign Mode Endless Freeplay Mode Co-op Multiplayer Bonus challenge missions Create and optimise complex production lines Manage workflow with the Logistics system Automated workforce and manufacturing Buy materials and manage stock Hire, train and assign tasks to employees Invent and design tech products Research new technologies Sell your products on an evolving market Develop employee skills and nurture their happiness Expand your company across additional buildings Set company goals for your business to achieve Assign business policies with various benefits Compete with rival companies for market influence Undertake company assignments for bonus rewards",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/911430/header.jpg?t=1655890337",
    "Price": 24.99,
    "Developers": "Chasing Carrots",
    "Publishers": "The Irregular Corporation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/911430/ss_830fc5b1202e80d71b38ec546f7b5e37d247dc9f.1920x1080.jpg?t=1655890337,https://cdn.akamai.steamstatic.com/steam/apps/911430/ss_1e9f481ac9a242d04ddecb97066e52ac874e6c2d.1920x1080.jpg?t=1655890337,https://cdn.akamai.steamstatic.com/steam/apps/911430/ss_5f0ecc0111385a639e15ef972c71a696706aea03.1920x1080.jpg?t=1655890337,https://cdn.akamai.steamstatic.com/steam/apps/911430/ss_f010e82143194c77c2640e8675777bef482ac5b2.1920x1080.jpg?t=1655890337,https://cdn.akamai.steamstatic.com/steam/apps/911430/ss_4d52f4632bb03a5d1a9a243ed419845dd6b6a365.1920x1080.jpg?t=1655890337,https://cdn.akamai.steamstatic.com/steam/apps/911430/ss_753dc561927ec0fba4280553598ce6f73be16fca.1920x1080.jpg?t=1655890337,https://cdn.akamai.steamstatic.com/steam/apps/911430/ss_3a82b20a8f4d02349ffa426234ae8c946fd32cbe.1920x1080.jpg?t=1655890337,https://cdn.akamai.steamstatic.com/steam/apps/911430/ss_2f0957b3ac7aa25f9b9d2700a284c3508f95195c.1920x1080.jpg?t=1655890337",
    "Slug": "good-company",
    "Meta Title": "Good Company: Jun 21, 2022, Chasing Carrots and Full Over...",
    "Meta Description": "Looking for information on Good Company? Check out the release date (Jun 21, 2022), developer insights from Chasing Carrots, and a complete game summary.",
    "Alt Text Image": "Official header image for Good Company game - Steam 911430",
    "Canonical URL": "https://gusku.site/game/good-company",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Good Company\", \"description\": \"Looking for information on Good Company? Check out the release date (Jun 21, 2022), developer insights from Chasing Carrots, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chasing Carrots\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Irregular Corporation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/911430/header.jpg?t=1655890337\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}