{
    "AppID": 1226690,
    "Name": "Great British Railway Journeys",
    "Release date": "Mar 5, 2020",
    "About the game": "Discover Bradshaw’s Britain George Bradshaw’s Handbook of 1840 was the first comprehensive tourist guide created for Britain's railways and was the inspiration for the hit television series, Great British Railway Journeys. Your journey will take you to five locations across the length and breadth of Britain… East Coast Main Line The iconic HST kick-started an era of high-speed rail travel and went on to prove itself as capable and versatile over many of Britain’s main lines. Take the HST over one of the busiest railway routes on the British network, the East Coast Main Line, and experience life in the fast lane. Great Eastern Main Line The BR Class 360 has proven hugely successful in high capacity commuter travel, with its spacious interior and modern driving cab. Command this hard-working EMU through the dense urban network of east London, departing the third busiest station in the UK at Liverpool Street. Portsmouth Direct Line One of the busiest commuter networks in Britain, the south western network is serviced by an array of modern EMUs including BR Classes 444, 450, 455/8 and 377s. Step into the driving cabs of four of Britain’s iconic commuter trains and ferry your passengers to Portsmouth out of London’s magnificent Waterloo station. Settle to Carlisle Famous for its numerous viaducts, tunnels and stunning scenery, the Settle-Carlisle line attracts thousands of railfans from all over the world every year. Take control of powerful heavy freight machines, regional passenger and even steam engines and battle the many summits, twists and turns of Cumbria’s historic Lake District route. Chatham Main &amp; Medway Valley Lines Connecting England's garden with London, the south-eastern route through the heart of the Medway valley is operated heavily by third rail powered multiple units. Transport passengers with a wide range of electric multiple units such as the BR Class 375 and BR Class 465 or weave through the busy traffic with American-built BR Class 59 heavy freight locomotives. The ultimate railway hobby powers Great British Railway Journeys! Train Simulator puts you in control of authentic locomotives and brings real world routes to life. Keeping the train collector’s dream alive for more than a decade. If you’re an existing owner of Train Simulator, Great British Railway Journeys expands your existing collection by adding five routes directly into your copy of Train Simulator. Key Features Discover five unique British routes that cover the length and breadth of the country, totalling no less than 370 miles (595 km) of rails to explore: East Coast Main Line: London – Peterborough Great Eastern Main Line: London – Ipswich Portsmouth Direct Line: London – Portsmouth Chatham Main &amp; Medway Valley Lines Settle to Carlisle Line Drive over a dozen different types of trains – including the hard-working Class 360, 365 and 444 and timeless classics such as the Class 37, Jubilee Class and High Speed Train – through rolling hills, bustling cities and past iconic landmarks Take to the rails in more than 40 engaging Scenarios, or create your own journey with Quick Drive Learn the basics of train driving, signalling and other rail operations in the Academy Powered by the ultimate railway hobby, Dovetail Games’ Train Simulator",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1226690/header.jpg?t=1583431258",
    "Price": 29.99,
    "Developers": "Dovetail Games",
    "Publishers": "Dovetail Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1226690/ss_bc3589af43e5b26e703fa5768d0658292dc84199.1920x1080.jpg?t=1583431258,https://cdn.akamai.steamstatic.com/steam/apps/1226690/ss_af1678b5f6750c98db66b41537aaf6068b2a0f73.1920x1080.jpg?t=1583431258,https://cdn.akamai.steamstatic.com/steam/apps/1226690/ss_d3e03bec5eaf69617fd8255b8268edcb49cac4bd.1920x1080.jpg?t=1583431258,https://cdn.akamai.steamstatic.com/steam/apps/1226690/ss_3850130ee287c7fa363aef1b73593be485458a9d.1920x1080.jpg?t=1583431258,https://cdn.akamai.steamstatic.com/steam/apps/1226690/ss_9809430360f8e12974753951700cd5417dc2c458.1920x1080.jpg?t=1583431258,https://cdn.akamai.steamstatic.com/steam/apps/1226690/ss_24094ecab4eb2b577e150f298ea0ab5379d8786c.1920x1080.jpg?t=1583431258,https://cdn.akamai.steamstatic.com/steam/apps/1226690/ss_8e13c7233e52c262de61954d4fc5e64de47eeaea.1920x1080.jpg?t=1583431258,https://cdn.akamai.steamstatic.com/steam/apps/1226690/ss_0c75c5dbff1fc0bc3025128aa437445f25730818.1920x1080.jpg?t=1583431258",
    "Slug": "great-british-railway-journeys",
    "Meta Title": "Great British Railway Journeys: Mar 5, 2020, Dovetail Gam...",
    "Meta Description": "Looking for information on Great British Railway Journeys? Check out the release date (Mar 5, 2020), developer insights from Dovetail Games, and a compl...",
    "Alt Text Image": "Official header image for Great British Railway Journeys game - Steam 1226690",
    "Canonical URL": "https://gusku.site/game/great-british-railway-journeys",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Great British Railway Journeys\", \"description\": \"Looking for information on Great British Railway Journeys? Check out the release date (Mar 5, 2020), developer insights from Dovetail Games, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1226690/header.jpg?t=1583431258\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}