{
    "AppID": 1104690,
    "Name": "Hard to be a King",
    "Release date": "Jun 29, 2020",
    "About the game": "Hard to be a King ( Realm Guardian ) is a voxel strategy game. You will play a role in a fantasy world and become a lord, rule the land, and protect your people. Assign tasks to everyone. Gathering, hunting, farming, keep your people stay away from starving. Crafting, constructing, build a stronghold to resist the dead army. Terrain The terrain of Realm Guardian is voxel based. One kind of cube correspond to one kind of resource. You can DIG a cube to collect its resource ( miner ), or consume resource to BUILD a new cube ( builder ). Environment Deer will eat plants when they are hungry. If there are no plants to eat, they will starve and die. So do wolves. As the bottom of the food chain, Plants will keep growing in a slow rate. Of course if men kill all the wolves and protect deer, all the plants would be ate, and deer finally die for starving. Besides, water is another problem. Wolves from different packs may fight for the only water source. ( Don't worry, human beings won't fell thirsty because the author didn't finish this function :P ). Just like the true nature, sun raise up and fall down every day ( Seasons are in planning ). Deer are more active in daytime. The King The king won't do most of works. All he has to do are rebalancing resources, assigning works ect. The King can talk to one to assign task for him. Of course it will break their current work ( The author feel unhappy when he worked in a game company, he interrupted by designers very often ) Realm Flag banner to claim regin. Flag more banners to enlarge the realm. Most of works ( e.g. mining, building ) can only do in realm. Banners would also support population limit. Peasants Peasants would sleep when they are sleepy ( If free bed exists ). Peasant who lack of sleep will get low work efficiency. Nighttime also bring bad influence ( So does author, he hate overtime work ). When peasants in danger, they will run into the safe area the king designed. Professions: Chamberlain could report to the king and auto assign tasks to civilians Builder could build blueprints designed by the king Chopper could cut down trees and carry logs into storage Craftsman could craft items or stuffs Forager could gather food or small items like cobblestone in from forest. Hunter could hunt for animals, loot their body Miner could dig redprints marked by the king Smith could forge metal items Tailor could make cotton into complex items Chef could produce processed food Farmer could farm the land and harvest crops. Archer , ranged soldier Infantry , melee soldier Food In the early stage of a game, most food come from foraging. But in the middle stage, farming becomes more important. The meaning of chefs are procduce food which support more energy. Especially food would be rotten as time goes by, produce dried food is also a good choice",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1104690/header.jpg?t=1594126695",
    "Price": 6.99,
    "Developers": "tyx",
    "Publishers": "tyx",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1104690/ss_6700aba4bc0f5d738ee57eda63687567c0179fa8.1920x1080.jpg?t=1594126695,https://cdn.akamai.steamstatic.com/steam/apps/1104690/ss_b04d1b0d47970b1d0c7e9c95369c8b83c769f1ca.1920x1080.jpg?t=1594126695,https://cdn.akamai.steamstatic.com/steam/apps/1104690/ss_64d9b4039f99e4afeaf8b944f58012978b947ba1.1920x1080.jpg?t=1594126695,https://cdn.akamai.steamstatic.com/steam/apps/1104690/ss_e949cbff7b6797b64214e7e0c9813e986cdc1575.1920x1080.jpg?t=1594126695,https://cdn.akamai.steamstatic.com/steam/apps/1104690/ss_0818c5431fff27b9a41b89bae9bb0333c386ed8d.1920x1080.jpg?t=1594126695,https://cdn.akamai.steamstatic.com/steam/apps/1104690/ss_7e4f5220974d31ced1f4092ff902a87ce0a9ade2.1920x1080.jpg?t=1594126695",
    "Slug": "hard-to-be-a-king",
    "Meta Title": "Hard to be a King: Jun 29, 2020, tyx and Full Overview",
    "Meta Description": "Looking for information on Hard to be a King? Check out the release date (Jun 29, 2020), developer insights from tyx, and a complete game summary.",
    "Alt Text Image": "Official header image for Hard to be a King game - Steam 1104690",
    "Canonical URL": "https://gusku.site/game/hard-to-be-a-king",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hard to be a King\", \"description\": \"Looking for information on Hard to be a King? Check out the release date (Jun 29, 2020), developer insights from tyx, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"tyx\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"tyx\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1104690/header.jpg?t=1594126695\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}