{
    "AppID": 1557780,
    "Name": "Help Me!",
    "Release date": "Aug 20, 2021",
    "About the game": "Help Me is a game where you become a psychiatrist. You can talk, consult, and treat patients. There are various patients, and it is necessary to choose the treatment method and counselling that suits them. In Help Me!, treatment isn't just about choosing an option. You will need to play several different mini-games or gain knowledge of medicine to choose the appropriate prescriptions and treatments. Inadequate treatment can worsen the patients’ illness or push them to make the wrong choices. In Help Me!, your judgment is very important to the patients. Choose and treat them to the best of your abilities. As you gain fame by treating patients, your hospital will evolve from an old clinic to a luxurious facility. Manage the hospital carefully, transforming it from an old wooden floor to a luxurious location Whenever there is a new patient, listen carefully to various stories and conduct counseling. As you treat patients who arrive at your hospital, you will gradually learn more about the world they live in. Also, through the life stories of the patients, you might be able to catch some clues about the world and the relationships between the characters. + 'This game is not intended to be therapeutic. If you have a mental problem such as depression, or anxiety, consult a medical professional.' Features of the game ◆ A story about the psychiatric challenges that everyone can have - The majority of modern people have mental problems. They can be very rough and deep wounds, or they can be a trivial obsessions or habits. However, like wounds on the body, they are not easily discovered or healed. Experience the healing process as you unravel the related stories. ◆ Lovely illustrations and animations - The characters in Help Me! are expressed as adorable animal friends. Listen to their stories as you watch their gestures and animations. ◆ Mini-Games - In Help Me!, simple mini-games appear to treat patients. Treat patients with your skills through the mini-games. ◆ Hospital Management – The hospital increases its reputation every time you treat patients. It is said that the higher the reputation, the better the patient is treated. In addition, higher the reputation, the better the interior of the hospital.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1557780/header.jpg?t=1640234732",
    "Price": 17.99,
    "Developers": "UnicON",
    "Publishers": "UnicON",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1557780/ss_d719f2a25fac0c674957cce4d90f35a1b51c3c95.1920x1080.jpg?t=1640234732,https://cdn.akamai.steamstatic.com/steam/apps/1557780/ss_6bdb5834632d261cb12ffadceb97dee4bfe624a1.1920x1080.jpg?t=1640234732,https://cdn.akamai.steamstatic.com/steam/apps/1557780/ss_8a1c16e19c694edc885adea1275c4f03fc717760.1920x1080.jpg?t=1640234732,https://cdn.akamai.steamstatic.com/steam/apps/1557780/ss_7f473cfa82fa51db1d51e91ec374d9a5cb3399f4.1920x1080.jpg?t=1640234732,https://cdn.akamai.steamstatic.com/steam/apps/1557780/ss_c405894c968bdf2a84a5d1623d338e1c08bd6ab0.1920x1080.jpg?t=1640234732,https://cdn.akamai.steamstatic.com/steam/apps/1557780/ss_b55f6dbc679aeca6f8730756f87c421bec4750e2.1920x1080.jpg?t=1640234732,https://cdn.akamai.steamstatic.com/steam/apps/1557780/ss_91d165295dd14b2db68973fa880d424a95aeede8.1920x1080.jpg?t=1640234732",
    "Slug": "help-me",
    "Meta Title": "Help Me!: Aug 20, 2021, UnicON and Full Overview",
    "Meta Description": "Looking for information on Help Me!? Check out the release date (Aug 20, 2021), developer insights from UnicON, and a complete game summary.",
    "Alt Text Image": "Official header image for Help Me! game - Steam 1557780",
    "Canonical URL": "https://gusku.site/game/help-me",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Help Me!\", \"description\": \"Looking for information on Help Me!? Check out the release date (Aug 20, 2021), developer insights from UnicON, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"UnicON\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"UnicON\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1557780/header.jpg?t=1640234732\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}