{
    "AppID": 979330,
    "Name": "Hikari! Clover Rescue",
    "Release date": "Dec 17, 2018",
    "About the game": "Hkari! Clover Rescue is a visual novel that puts you in the role as Keigo, a lazy pilot and bounty hunter who needs to stop The Corporation from taking over the world. Save the world, get the girls. All in a hard day's work. STORY In a not-so distant future, a powerful organization known as The Corporation is planning to take over the world by using the power of some mysterious amulets shaped like a clover. In the last days, they’ve kidnapped three different girls, which are supposed to be the owners of this powerful amulets, but still, neither of them know how to use this power properly. To do so, they’re planning to experiment on the girls as much as they need. To prevent this catastrophe to happen, we must take the role of Keigo, a young, lazy pilot and bounty hunter, owner of the Multiple Clover, who has been “recruited” by Kasumi, our main side-kick and guide along the adventure. She tells us that in order to unveil this great mystery behind these amulets and use their power to save the world, we must rescue each girl before is too late and… Have sex with all of them. Are you ready? CHARACTERS Kasumi Our sidekick and main partner throughout this adventure, Kasumi is as beautiful as she's smart. Owner of the C.R.S. ship and the Transparent Clover. Although a little shy and short-tempered at times (kinda tsundere, yeah), she doesn't hesitate to take the lead and use all kind of smart devices to take down the dark plans of The Corporation. Akane Fierce and energetic, Akane is a very loyal and kind-hearted girl. Leader of her own resistance group and owner of the Blue Clover. Although she had to fight for survival from a very young age, she's always willing to risk everything just to see her people smile. Urara While working as a professional model for The Corporation, Urara discovered the shady truth behind them. Owner of the Green Clover. This beautiful lady won’t hesitate to use her charms and sexy figure to seduce and take down the enemy. Shizuka The young and only heir of a very important and powerful company run by her father. Shizuka started to notice some strange behaviors on her family when The Corporation approached to work with them. Owner of the Red Clover. Despite of being only 20 years old, she’s ready to show the world that she’s not a little girl anymore, and she's capable of not only saving her family’s company, but the world by using her powerful attitude. Elizabeth [Information classified by The Corporation] FEATURES Kinetic Visual Novel 8 fully uncensored erotic CGs CG gallery to view CGs and character sprites 5 sexy girls to romance Partial Japanese voice acting Multiple choices",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/979330/header.jpg?t=1580430952",
    "Price": 4.99,
    "Developers": "Toffer Team",
    "Publishers": "Denpasoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/979330/ss_b26474b7cf406c22833db7c2a269ccb8bcce62b1.1920x1080.jpg?t=1580430952,https://cdn.akamai.steamstatic.com/steam/apps/979330/ss_801eca089b0d0a535723881a6dc11beb45df6395.1920x1080.jpg?t=1580430952,https://cdn.akamai.steamstatic.com/steam/apps/979330/ss_c4d39831843dad6a8209f3b5631add61be60e4be.1920x1080.jpg?t=1580430952,https://cdn.akamai.steamstatic.com/steam/apps/979330/ss_da80db69cd124ecd444518f1e5b92fe0182ba5df.1920x1080.jpg?t=1580430952,https://cdn.akamai.steamstatic.com/steam/apps/979330/ss_db04f4337f3aa0ee36e828695d606c4065927ae3.1920x1080.jpg?t=1580430952",
    "Slug": "hikari-clover-rescue",
    "Meta Title": "Hikari! Clover Rescue: Dec 17, 2018, Toffer Team and Full...",
    "Meta Description": "Looking for information on Hikari! Clover Rescue? Check out the release date (Dec 17, 2018), developer insights from Toffer Team, and a complete game su...",
    "Alt Text Image": "Official header image for Hikari! Clover Rescue game - Steam 979330",
    "Canonical URL": "https://gusku.site/game/hikari-clover-rescue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hikari! Clover Rescue\", \"description\": \"Looking for information on Hikari! Clover Rescue? Check out the release date (Dec 17, 2018), developer insights from Toffer Team, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Toffer Team\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Denpasoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/979330/header.jpg?t=1580430952\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}