{
    "AppID": 1858060,
    "Name": "ImmaterialAI",
    "Release date": "Apr 25, 2022",
    "About the game": "ImmaterialAI (IAI) is a self-help and growth app that works in a completely new way: it takes you through the depths of your own mind to help you uncover and dissolve pain, confusion, worries and any other distorted or limiting perspective at a fundamental level. ImmaterialAI is free on Windows, Web and Android, coming soon on more platforms. Emergent uses Direct Mindfulness Experience ultimate reality beyond any concept from your first session Metaphysical therapy Easily overcome any negative inner states with our ontological and epistemic tools Complex research/ note-taking (Plus only) Map data in more than infinity(cubed) dimensions under your own semantics Better understand reality Find undogmatic God, truth, partial truths, falsehoods through AI-assisted Henosis Dream journaling/ World building Connect pieces, contrast them, and uncover the real story Dissect any system Map all the moving parts of a system, easily calculate if the systems fundamentally hold true all data and functionality is stored and runs only locally, data never leaves your device How it all works 4 user paths tailored to your immediate need (Create is Plus only) Overcome, Beyond, Breakthrough and Create Data structure similar to the brain, internet, universe All input in ImmaterialAI is described in either nodes or links between them, like neurons and synapses Your introspection copilot AI-driven insights - our chat AIs and AI functions crawl through your data to expose inconsistencies, new possibilities, circular references and more Multiple ways to see your mind from above We have auto-generated ancestry trees, Sanity check (Plus only) that calculates the validity of your entire library and shows you how your library is distributed under different semantics incl. post-AI validity, Clusters (Plus only) that shows your library as interconnected clusters with points of interest (cluster generation rules adjustable), the automatic graphing in Check for link (Plus only) and Big picture views, and more Smartest filters in the game Filter by item category, focused state, old/new me data, favorites, tasks (Plus), meta models (Plus), ancestry state and more, use separately or simultaneously Unlimited data definitions (Plus only) ImmaterialAI's Meta layer lets you rewrite and add new definitions to the structure of your data, in over infinity^3 dimensions World-first functionality Custom tools like Is it real?, Check for link, Big Picture are only some of the many features you will not find anywhere else Rich text formatting Use markdown to format any node. (Plus only) Use the new built-in buttons to quickly add headers, tables, images, inline IAI nodes and links, code blocks, lists, bold, breaks and more Gamified self-help Gain experience as you use different tools, unlock more advanced tools each level Welcome to the new you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1858060/header.jpg?t=1657172787",
    "Price": 0.0,
    "Developers": "Futuresoup",
    "Publishers": "Futuresoup",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1858060/ss_5834cc50ec30ccd4fce651909d653535640be18d.1920x1080.jpg?t=1657172787,https://cdn.akamai.steamstatic.com/steam/apps/1858060/ss_362fc8abb582f511d76bc67a73272a1d0cda6e5d.1920x1080.jpg?t=1657172787,https://cdn.akamai.steamstatic.com/steam/apps/1858060/ss_ea726fef065175640e755df9ee9b1ac93268890e.1920x1080.jpg?t=1657172787,https://cdn.akamai.steamstatic.com/steam/apps/1858060/ss_2de684abae320ecc6bd8fda2d3b293b6fa4fe851.1920x1080.jpg?t=1657172787,https://cdn.akamai.steamstatic.com/steam/apps/1858060/ss_e57ee9d45b68713649f31b08fed6258ee43eee8c.1920x1080.jpg?t=1657172787",
    "Slug": "immaterialai",
    "Meta Title": "ImmaterialAI: Apr 25, 2022, Futuresoup and Full Overview",
    "Meta Description": "Looking for information on ImmaterialAI? Check out the release date (Apr 25, 2022), developer insights from Futuresoup, and a complete game summary.",
    "Alt Text Image": "Official header image for ImmaterialAI game - Steam 1858060",
    "Canonical URL": "https://gusku.site/game/immaterialai",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ImmaterialAI\", \"description\": \"Looking for information on ImmaterialAI? Check out the release date (Apr 25, 2022), developer insights from Futuresoup, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Futuresoup\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Futuresoup\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1858060/header.jpg?t=1657172787\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}