{
    "AppID": 789950,
    "Name": "INFERNIUM",
    "Release date": "Apr 3, 2018",
    "About the game": "Pac-Man in hell Infernium is a game filled with brutal challenges to overcome. While playing the game you won’t be able to kill or damage most of the enemies but at the same time running away without a second though is not the solution. While being chased you will need to think and reconsider your strategy and open hidden shortcuts while the world and it’s lore will unfold around you in a non-linear way making each playthrough diferent. From the creator of the multi awarded indie game of the year MIND: Path to Thalamus and the dev grant winner Koral . Every little change you make in Infernium will remain like that forever. As a player you will have to be smart about harvesting (or not) Light, interacting with doors, barriers and elevators and even your death. Dying does not reset the world, it’s part of the experience. That’s why there will be consequences if you act careless with your deaths. Infernium is one of the easiest games to mod using the free Unreal Engine 4. If the world of Infernium is not enough for you explore the WORKSHOP to download expansions, modifications of Infernium or even brand new games, done with Infernium's content or custom content! PCMR Only feature. Features Accesibility Matters. When making Infernium accesibility features have been taken into consideration for physically disabled, deaf and colorblind gamers. Main Campaign with +14h of average playtime All upcomming DLC will be free A brutal prison without bars, where the world is the real cell, full of enemies and traps that will make your path challenging. Agony-inducing environments and challenges. 17 interconnected non-linear levels. 6 Easy to use, hard to master player skills to find and improve. Diferent enemy kinds. Each one will require a diferent strategy/skill to overcome. Persistent world. Every little change you make in Infernium will remain like that forever. Robust, deep, Photomode included. New Game + Mode. 24 Achievements. Multiple Endings. PC Exclusive Features Twitch Integration. Your chat will be able to vote for events to happen ingame live. Mod support. Browse and download mods or expand and change something in Infernium yourself! Create your own game inside Infernium if you want! Infernium is one of the easiest games to mod in Unreal Engine! 8K, 4K, upscaling and custom resolutions support, including ultra wide multi monitor resolutions. Robust video settings menu. Make Infernium run smooth even in the really low spec computers. 16K or even more Photomode upscale output. Speedrun clock integrated Artbook, 4K Wallpapers, Making of and goodies included in the game files! Can hell be beautiful? Infernium needed memorable appealing environments (instead of the usual images of a hell full of fire, suffering, screams and lots of reddish, gore landscapes) because in Infernium the most beautiful environments are also the most dangerous ones. This tends to generate disconfort, anxiety and inquietude in the player. It is no coincidence most of the brutal dangers in Infernium can be found at daylight in plain sight rather than in the darker claustrophobic environments.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/789950/header.jpg?t=1619166679",
    "Price": 24.99,
    "Developers": "Carlos Coronado",
    "Publishers": "Carlos Coronado",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/789950/ss_ed19a02663a266f20c8aa7c3e0256ef0a0574024.1920x1080.jpg?t=1619166679,https://cdn.akamai.steamstatic.com/steam/apps/789950/ss_dc3c654a991dee81b54855ca53aedb3ec30d7a8b.1920x1080.jpg?t=1619166679,https://cdn.akamai.steamstatic.com/steam/apps/789950/ss_3df99985c557da3ee6f48811d66bb05f95bdc782.1920x1080.jpg?t=1619166679,https://cdn.akamai.steamstatic.com/steam/apps/789950/ss_2a2bab4bda674ee1be3b5a8ec4ce2bfbb8e7bf33.1920x1080.jpg?t=1619166679,https://cdn.akamai.steamstatic.com/steam/apps/789950/ss_f69dfdb08ab34bfa2ffda408ff8fb7d3a3e186e5.1920x1080.jpg?t=1619166679,https://cdn.akamai.steamstatic.com/steam/apps/789950/ss_be5e73998c3337990e26eacc8dcb1832cd6d11ad.1920x1080.jpg?t=1619166679,https://cdn.akamai.steamstatic.com/steam/apps/789950/ss_af1d432bf75491632792af7d942df432f952b3df.1920x1080.jpg?t=1619166679,https://cdn.akamai.steamstatic.com/steam/apps/789950/ss_6531fc463e1520f1074b845ea3aa1805a08ce74e.1920x1080.jpg?t=1619166679,https://cdn.akamai.steamstatic.com/steam/apps/789950/ss_5d94a12d9ca37ca95ba06539e09f8ca97e560d49.1920x1080.jpg?t=1619166679,https://cdn.akamai.steamstatic.com/steam/apps/789950/ss_bb066e13d7d2a31f102c0372fc63e5d6fe1e0f00.1920x1080.jpg?t=1619166679,https://cdn.akamai.steamstatic.com/steam/apps/789950/ss_3adb4c4b9c30edcbc28365ac8ddefb7b4da0c9d0.1920x1080.jpg?t=1619166679,https://cdn.akamai.steamstatic.com/steam/apps/789950/ss_90589da4a9cedc40215508bdc2045697f1b5ee71.1920x1080.jpg?t=1619166679",
    "Slug": "infernium",
    "Meta Title": "INFERNIUM: Apr 3, 2018, Carlos Coronado and Full Overview",
    "Meta Description": "Looking for information on INFERNIUM? Check out the release date (Apr 3, 2018), developer insights from Carlos Coronado, and a complete game summary.",
    "Alt Text Image": "Official header image for INFERNIUM game - Steam 789950",
    "Canonical URL": "https://gusku.site/game/infernium",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"INFERNIUM\", \"description\": \"Looking for information on INFERNIUM? Check out the release date (Apr 3, 2018), developer insights from Carlos Coronado, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 3, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Carlos Coronado\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Carlos Coronado\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/789950/header.jpg?t=1619166679\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}