{
    "AppID": 1165590,
    "Name": "It Will Find You",
    "Release date": "Nov 4, 2019",
    "About the game": "It Will Find You is a first person narrative driven horror experience, utilising a reactive narrative system that alters the story's flow based on player actions. With a focus on environmental interaction and progressive narrative through game-play, It Will Find You aims to provide an immersive experience where the world evolves in tandem with your decisions, and a dark, twisting narrative is slowly revealed through fully voice acted dialogue. It Will Find You follows Julia, a woman struggling with depression after tragedy has caused her life to fall apart. Needing some time away from the world, she returns to her now empty family home, seeking solace in her childhood. Arriving amidst a terrible storm, Julia quickly realises she is not alone, as a horrific entity stalks the once beautiful woodlands surrounding her family estate. Under the deafening roar of the raging storm, Julia will have to fight for survival against the creature, while plagued by horrific visions that make her question her own reality. With the climax, the curtain will be drawn back revealing a shocking conclusion that turns the game upon its head, in a shocking conclusion, you won't see coming. Build around a Master Event System, It Will Find You's dynamic narrative shifts in real time to match the players in game decisions, altering dialogue, AI behaviour, and narrative events. With 8 different endings available in It Will Find You, players will have to delve deep into Dellich Grove and uncover the Mysteries of Julia's home, discovering dark secrets, and revealing shocking truths. It Will Find You is a promise, not just a title. Julia is not alone in the woods, and the creature stalking her will not rest until it has claimed her life. Players will have to run, hide and defend themselves from the creature's onslaught, ultimately escaping, or becoming its next meal. It Will Find You is a fully voice acted experience narrated by professional actors from across the world. A lot of time was spent ensuring we found the best people for each role, recording them in a professional grade sound studio and then mixing them into our world to make the experience more immersive. The world of It Will Find is a dark and foreboding place, using dynamic, volumetric lighting and detailed environments to create an oppressive sense of isolation. From the shadowy forest to the warmth of Julia's family home, each setting is brought to life in Unity to create an immersive, engaging experience. In It Will Find You almost every object in the game is fully interact-able, with Julia able to pick up, rotate and investigate objects in the world around her. Players will need to use these skills to solve puzzles, find hidden clues, and ultimately escape. FAQ How many people worked on It Will Find You? The game has been a solely developed by myself as a passion project following from Captive Audience. Many voice actors, an awesome composer and some great rubber ducks have contributed along the way though. Is this a direct sequel to Captive Audience? Whilst the game is set in the same universe, it does not directly follow on from Captive Audience, and as such can be played without knowledge of the previous game, though it will definitely enhance the gameplay experience to have played it. How did It Will Find You come about? After finishing Captive Audience, I knew there were more stories to tell in the universe and began to plan out what could be explored next. At the time I was completing my Masters Degree in Games Design, and thought my final project would be the perfect opportunity to start developing the next step in the saga. From there it continued past graduation to where we are now! How many endings are there? Currently the game has 8 endings. Are there achievements? Yes! There are currently 33 achievements in game. Are there subtitles? Yes! The game is fully subtitled. Is there controller support? Not at the moment, keyboard and mouse are required to play. Did you make the 3D models that populate the game? No, I am a terrible 3D modeller and so relied on royalty free assets from websites such as turbo-squid, and the unity asset store. A full list of artists can be found in the credits. Some custom models were also created by Gary Gough, the artist from Captive Audience. Who made the music? Stefanos Yiassemides was the composer for It Will Find You and created all tracks except for the trailer music. Feel free to show him some love for the awesome work he did! Where can I see a list of your voice actors? All voice actors are fully credited in the game, so definitely let them know what a great job they did! Will there be future updates to the game? Whilst there will definitely be fixes and performance patches, content updates are less certain. This is due to working a full time job around solo development, and the fact I believe this story is complete. Will there be another chapter in the Captive Audience Saga? 6 titles including Captive Audience and It Will Find You have been planned out, but the continuation of the series will depend on the success of this title. That being said I love the universe that’s slowly coming into being and would love to delve further into it. If you have any further questions please feel free to drop me a message, or comment and i'll aim to reply asap : )",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1165590/header.jpg?t=1572870738",
    "Price": 0.99,
    "Developers": "Mega Sloth Studios",
    "Publishers": "MegaSloth",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1165590/ss_bfe7f7e8fe8186eade18dd8ef124eabf5bf77809.1920x1080.jpg?t=1572870738,https://cdn.akamai.steamstatic.com/steam/apps/1165590/ss_7ffc280e794ee8afabc8ae7ad6d9e91027d2255c.1920x1080.jpg?t=1572870738,https://cdn.akamai.steamstatic.com/steam/apps/1165590/ss_652f31e05d8afbb1168b69992fb2c4ca33be4ad9.1920x1080.jpg?t=1572870738,https://cdn.akamai.steamstatic.com/steam/apps/1165590/ss_312f7f065d26843ee8bcaa3f4f36ee5fea24dd28.1920x1080.jpg?t=1572870738,https://cdn.akamai.steamstatic.com/steam/apps/1165590/ss_9f5e90c7480b4fcdec10ff4b4cd25d7c54204540.1920x1080.jpg?t=1572870738,https://cdn.akamai.steamstatic.com/steam/apps/1165590/ss_d547b50301c79bc54b691b0007e3394b2012afef.1920x1080.jpg?t=1572870738,https://cdn.akamai.steamstatic.com/steam/apps/1165590/ss_7ef26c8cf2aa7f16fd0c4e8999c5df1e388fee14.1920x1080.jpg?t=1572870738,https://cdn.akamai.steamstatic.com/steam/apps/1165590/ss_5daa1175b092741bad79ccf4330dadcdaec8c8ea.1920x1080.jpg?t=1572870738",
    "Slug": "it-will-find-you",
    "Meta Title": "It Will Find You: Nov 4, 2019, Mega Sloth Studios and Ful...",
    "Meta Description": "Looking for information on It Will Find You? Check out the release date (Nov 4, 2019), developer insights from Mega Sloth Studios, and a complete game s...",
    "Alt Text Image": "Official header image for It Will Find You game - Steam 1165590",
    "Canonical URL": "https://gusku.site/game/it-will-find-you",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"It Will Find You\", \"description\": \"Looking for information on It Will Find You? Check out the release date (Nov 4, 2019), developer insights from Mega Sloth Studios, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mega Sloth Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MegaSloth\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1165590/header.jpg?t=1572870738\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}