{
    "AppID": 1073440,
    "Name": "コイカツ！ / Koikatsu Party",
    "Release date": "Jun 10, 2019",
    "About the game": "━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ The Ultimate Anime Character Maker ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Do you dream about your perfect waifu, and curse the fact that she only exists in your imagination? Well, turn that frown upside down, because the character of your dreams can now be reality! Customizing your own adorable anime character is easy with Illusion's latest and greatest invention—a character creation system that employs ultra high-quality anime-style shaders. ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Over 300+ Adjustable Settings ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Are you a man of culture? Do you have very specific preferences? Well, with over 300 different settings you can adjust, we have all the options you need to sculpt a character to match your refined tastes. Use our custom suite of precision tools to adjust every aspect of your masterpiece, and watch as our engine renders her with ultra high-quality anime shaders. Sleek graphics and textures will help bring your waifu to laifu! ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ A Wealth of Options for Customizing Faces ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Our character creator gives you an unparalleled level of control over facial features, and intuitive controls make it easy for anyone to design the perfect face. Shape, size, position, contours, dimensions—customize them all! Want pointy elf ears? Easy! Want to change the color of just one eye? Piece of cake! You have the ability to make a character for any type of setting you can imagine! Choose from a wide variety of different hairstyles. And even better, you can select different hair sections and adjust them individually for ultimate customizability! ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Sculpt the Perfect Body ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ A wide range of options to customize your character's body will leave you wondering why you ever bothered with real people. Seriously, who needs reality when you have anime? Sculpt every curve with settings both general and specific. Breasts, hips, arms, busts, legs: seriously, we've got options to adjust pretty much anything you can dream of. But wait, there's more! Why not give your character purple skin, or add in cool shadows, or even change the color of her outline? We support all sorts of coloring schemes and light options. I mean, this is anime we're talking about. The sky's the limit! ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 30 Unique Personality Archetypes ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Of course, physical perfection is nothing without personality. That's why we provide 30 fully unique personality archetypes for you to give your waifu! Start with a knockout body, add in the perfect face, and season with a dash of tsundere or tomboy, and blam! You've got your own personally perfect anime heroine! ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Lots and Lots of Erotic Options ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ Now that you've made your perfect waifu, why not consummate your 2D marriage? Well, fear not! We've got you covered with dozens of different sexual options to explore! Use simple mouse controls to touch, pull, lick, finger, and pump to your heart's content. It's simple, it's easy, it's fun, and oh my is it satisfying! Oh, and before we forget! You can also customize your waifu's level of sensuality, tastes, and experience. Depending on the mix and match of her personality archetype and sex settings, she'll react differently to various situations and sensations. Explore them all! ------------------------------------------------------------------------ Note: Although subtitles are not available during erotic encounters, we hope you’ll enjoy the rich selection of characters, brought to life by a varied cast of Japanese voice talent, and the otherwise-extensive, colorful English language translation. Note: The additional expansions (DLC) available in Japan are incompatible with Koikatsu Party and cannot be used.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1073440/header.jpg?t=1617946786",
    "Price": 59.99,
    "Developers": "ILLUSION",
    "Publishers": "ILLUSION",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1073440/ss_a4fce22ff624dd2b5e15c66eac102a32c16b584e.1920x1080.jpg?t=1617946786,https://cdn.akamai.steamstatic.com/steam/apps/1073440/ss_cbdc0aef202f1bb90daa4d7a4f2996abae51ad52.1920x1080.jpg?t=1617946786,https://cdn.akamai.steamstatic.com/steam/apps/1073440/ss_0b7bca9eb57693183f52c03390e2cb20238e91c0.1920x1080.jpg?t=1617946786,https://cdn.akamai.steamstatic.com/steam/apps/1073440/ss_452847502c8c2ec4b9e2d81aab45602586e086ae.1920x1080.jpg?t=1617946786,https://cdn.akamai.steamstatic.com/steam/apps/1073440/ss_2694fbc626719b7f18dd3032d9d80253bbf8a20b.1920x1080.jpg?t=1617946786,https://cdn.akamai.steamstatic.com/steam/apps/1073440/ss_df39014202f9d0eddd5a78e60be6a03ca93cd78f.1920x1080.jpg?t=1617946786,https://cdn.akamai.steamstatic.com/steam/apps/1073440/ss_51c3dda5bb09459418ae07d930823a1ec7bed981.1920x1080.jpg?t=1617946786,https://cdn.akamai.steamstatic.com/steam/apps/1073440/ss_58616aa92ae94300b2d18ce65d50eb6f4879501b.1920x1080.jpg?t=1617946786",
    "Slug": "koikatsu-party",
    "Meta Title": "コイカツ！ / Koikatsu Party: Jun 10, 2019, ILLUSION and Full O...",
    "Meta Description": "Looking for information on コイカツ！ / Koikatsu Party? Check out the release date (Jun 10, 2019), developer insights from ILLUSION, and a complete game summ...",
    "Alt Text Image": "Official header image for コイカツ！ / Koikatsu Party game - Steam 1073440",
    "Canonical URL": "https://gusku.site/game/koikatsu-party",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u30b3\\u30a4\\u30ab\\u30c4\\uff01 / Koikatsu Party\", \"description\": \"Looking for information on \\u30b3\\u30a4\\u30ab\\u30c4\\uff01 / Koikatsu Party? Check out the release date (Jun 10, 2019), developer insights from ILLUSION, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 10, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"ILLUSION\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ILLUSION\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1073440/header.jpg?t=1617946786\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}