{
    "AppID": 722230,
    "Name": "L.A. Noire: The VR Case Files",
    "Release date": "Dec 15, 2017",
    "About the game": "A dark and violent crime thriller set against the backdrop of 1940’s Los Angeles, now in stunning virtual reality. L.A. Noire: The VR Case Files places you directly in the shoes of Detective Cole Phelps as you solve brutal crimes, plots and conspiracies inspired by real cases from 1947 Los Angeles, one of the most corrupt and violent times in L.A. history. Featuring seven cases rebuilt specifically for virtual reality, L.A. Noire: The VR Case Files adds new layers of immersion and realism to Rockstar Games’ atmospheric crime thriller as you solve select cases from the blockbuster original game, spanning mysteries from the Detective desks of Traffic, Arson, Homicide, and more. • Search for clues by grabbing, inspecting and manipulating objects • Get behind the wheel and drive to your next crime scene • Engage in chases, fistfights and shootouts as you track down suspects • Build your case by making notes or drawing freehand in your detective’s notebook • Interrogate witnesses and use your wits to separate truth from lies in a city where everyone has something to hide Additional System Specifications Due to current performance issues with AMD hardware, only specific combinations of AMD and NVIDIA/Intel Hardware will allow the game to play as intended: • If using an AMD Ryzen 7 CPU, an NVIDIA GeForce GTX 1070 (or above) graphics card is required to play • If using an AMD Vega 56 graphics card, an Intel i7 6700 (or above) CPU is required to play • Attempting to use an AMD CPU and GPU together to play the game is not supported at this time L.A. Noire: The VR Case Files only supports a single graphics card architecture; NVIDIA SLI and AMD CrossFire features are not supported. Over time programming changes will change the system requirements for this game. Please refer to your hardware manufacturer and www.rockstargames.com/support for current compatibility information. Some system components such as mobile chipsets, integrated, and AGP graphics cards may be incompatible. Unlisted specifications may not be supported by publisher. Other requirements: Installation and play requires log-in to Rockstar Games Social Club (varies 13+) network; internet connection required for activation and periodic entitlement verification; software installations required including Rockstar Games Social Club platform, DirectX 9, DirectX June 2010 Redistributable Package, Chromium, and Microsoft Visual C++ 2012 and 2015 Redistributable Packages, and authentication software that recognizes certain hardware attributes for entitlement, digital rights management, system, and other support purposes. Single use serial code registration via internet required; registration is limited to one Rockstar Games Social Club account (varies 13+) per serial code; only one PC log-in allowed per Social Club account at any time; serial code(s) are non-transferable once used; Social Club accounts are non-transferable.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/722230/header.jpg?t=1618852074",
    "Price": 14.99,
    "Developers": "Rockstar Games",
    "Publishers": "Rockstar Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/722230/ss_c693a722692225a100b7f1685d092a5de749ee22.1920x1080.jpg?t=1618852074,https://cdn.akamai.steamstatic.com/steam/apps/722230/ss_74c6610e6a1f123a216c96d535575887aa17730e.1920x1080.jpg?t=1618852074,https://cdn.akamai.steamstatic.com/steam/apps/722230/ss_f3b6188b42d86ad034796b6eb9cc6efd1baaff78.1920x1080.jpg?t=1618852074,https://cdn.akamai.steamstatic.com/steam/apps/722230/ss_8621f09b79ef49617307ff5de10a8ebdb7722dd1.1920x1080.jpg?t=1618852074,https://cdn.akamai.steamstatic.com/steam/apps/722230/ss_5e3ab2208c1522b4b82505cc479fc4bba1035fb4.1920x1080.jpg?t=1618852074,https://cdn.akamai.steamstatic.com/steam/apps/722230/ss_6c323685a44ec0f1e0fc3e0a969c5cc030f59c8b.1920x1080.jpg?t=1618852074,https://cdn.akamai.steamstatic.com/steam/apps/722230/ss_7fad147d033bad1194244c3d05a4ba885dbbb12a.1920x1080.jpg?t=1618852074,https://cdn.akamai.steamstatic.com/steam/apps/722230/ss_eb9bac75a343ccac1352e8db1c866dba49de975b.1920x1080.jpg?t=1618852074,https://cdn.akamai.steamstatic.com/steam/apps/722230/ss_f3cd20797a8202016d8f6d8906d3b8f3f3b9aea5.1920x1080.jpg?t=1618852074,https://cdn.akamai.steamstatic.com/steam/apps/722230/ss_b86f9db0c95f11c1f2dc67ef3e9968ba32eb39a2.1920x1080.jpg?t=1618852074,https://cdn.akamai.steamstatic.com/steam/apps/722230/ss_841fa3b5be971fe0462529edae95878fd5fe5fc6.1920x1080.jpg?t=1618852074",
    "Slug": "l-a-noire-the-vr-case-files",
    "Meta Title": "L.A. Noire: The VR Case Files: Dec 15, 2017, Rockstar Gam...",
    "Meta Description": "Looking for information on L.A. Noire: The VR Case Files? Check out the release date (Dec 15, 2017), developer insights from Rockstar Games, and a compl...",
    "Alt Text Image": "Official header image for L.A. Noire: The VR Case Files game - Steam 722230",
    "Canonical URL": "https://gusku.site/game/l-a-noire-the-vr-case-files",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"L.A. Noire: The VR Case Files\", \"description\": \"Looking for information on L.A. Noire: The VR Case Files? Check out the release date (Dec 15, 2017), developer insights from Rockstar Games, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 15, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rockstar Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rockstar Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/722230/header.jpg?t=1618852074\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}