{
    "AppID": 686870,
    "Name": "Lost Items",
    "Release date": "Aug 3, 2017",
    "About the game": "Lost Items, find your items or be stuck ! Lost Items is a simple game in which you must find many items and put them into a box. But be careful ! You're stuck in a strange maze, it changes randomly and there are some ghosts who wants to steal the items on the ground... Fortunately, the maze changes so you can still go to every item. You have many ways to reach your objective. Whether you can use the default character for an increased difficulty or you can also try another character to get useful powers such as infrared sights to find the box easily or even the items ! One of them allows you to jump over the walls, but you can't abuse it, you must let your character take his breath back before jumping again. Even though the ghosts aren't dangerous for you, they can easily get very boring. When, during their walk, they find an item on the ground, they can take it and move it far away. It just depends on their mood, so be sure to take the items before they find them. The more you carry items, the slower you are. But at some point, taking items will make ghosts disappear. There is always twice as many items as ghosts. And because they are nice, the ghosts never disappear without dropping the items they're carrying, if they are. The different difficulties are available so you can enjoy the game in different ways. There are 7 difficulties, from the 41x24 maze to the 141x120 one. And of course, the bigger the maze, the higher the number of items is. List of available powers : The default character. She has no specific power. The fast character. She walks faster and has more strength, so the items won't slow her as much as the other characters. The Lynx. She sees further in the dark so she can find her path to the items and the box easily. The jumper. She can jump over the walls once every 45 seconds. Of course, she can also jump over the items or over the ground, but there is no point in doing that as you can drop the items if you feel like you're too slow. The ghost hunter. Despite her name, she can't kill the ghosts. She can only see them with her infrared sight. A red ghost doesn't carry anything and a green one carries an item. The looter. She has an infrared sight allowing her to see the items near her. The weak one. She can't do anything but finding the box when it is near her with her infrared sight. List of difficulties : Beginner : 41x24 maze, 20 items, 10 ghosts. Easy : 51x36 maze, 40 items, 20 ghosts. Normal : 65x40 maze, 65 items, 35 ghosts. Hard : 81x56 maze, 100 items, 50 ghosts. Insane : 101x70 maze, 175 items, 65 ghosts. Legendary : 125x90 maze, 280 items, 80 ghosts. Impossible : 141x120 maze, 420 items, 100 ghosts. Beat this mode and I give you a cookie ;) As the game is still in development, there are probably many bugs and performances issues. If you see one of them, please tell me ! I'll do what I can to fix that as fast as possible !",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/686870/header.jpg?t=1501782267",
    "Price": 0.0,
    "Developers": "ZoR Dev",
    "Publishers": "ZoR Dev",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/686870/ss_324b5a4e7f14b34ec6cda71d4cae20d7b2b2440b.1920x1080.jpg?t=1501782267,https://cdn.akamai.steamstatic.com/steam/apps/686870/ss_51e18715f784cf2382504b1bad687d7a6ec3a1b3.1920x1080.jpg?t=1501782267,https://cdn.akamai.steamstatic.com/steam/apps/686870/ss_4aa575b15c8f7187097b9adfd0540e6a01aada9f.1920x1080.jpg?t=1501782267,https://cdn.akamai.steamstatic.com/steam/apps/686870/ss_2b7332c537680c392a56b26459363eecaf95a96c.1920x1080.jpg?t=1501782267,https://cdn.akamai.steamstatic.com/steam/apps/686870/ss_f41b194764a677a3added1b4ee744cb7fdd72018.1920x1080.jpg?t=1501782267,https://cdn.akamai.steamstatic.com/steam/apps/686870/ss_9fc61e76a8b7dde78cc7fb940b890c6825ce2473.1920x1080.jpg?t=1501782267",
    "Slug": "lost-items",
    "Meta Title": "Lost Items: Aug 3, 2017, ZoR Dev and Full Overview",
    "Meta Description": "Looking for information on Lost Items? Check out the release date (Aug 3, 2017), developer insights from ZoR Dev, and a complete game summary.",
    "Alt Text Image": "Official header image for Lost Items game - Steam 686870",
    "Canonical URL": "https://gusku.site/game/lost-items",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lost Items\", \"description\": \"Looking for information on Lost Items? Check out the release date (Aug 3, 2017), developer insights from ZoR Dev, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 3, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"ZoR Dev\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ZoR Dev\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/686870/header.jpg?t=1501782267\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}