{
    "AppID": 765810,
    "Name": "Mars Horizon",
    "Release date": "Nov 17, 2020",
    "About the game": "In Mars Horizon, you take control of a major space agency, leading it from the dawn of the space age through to landing astronauts on Mars. Guide your agency through the space race and write your alternate history of space travel - any of the agencies can be the first to land on The Moon if you make the right choices. Manage the numerous challenges faced then and now: Create your own space agency and base with launch pads, research labs, astronaut training facilities, and much more Construct custom vehicles from hundreds of combinations Launch satellites and crewed spacecraft to explore the Solar System Run mission control as you solve the various challenges of turn-based missions to earn scientific advancement and public support Recreate famous missions conducted by NASA, ESA and CNSA - including the Perseverance Rover, Ingenuity Helicopter, Zhurong Rover and Rosetta space probe missions. Explore an extensive tech tree and compete or collaborate with other agencies to plot your roadmap to Mars Choose from five unique space agencies, each with their own traits, base, vehicles, and spacecraft Build with unlimited freedom in a fully-customisable Sandbox Mode You’re in charge of every element of the journey into space: success rides on your decisions. Will you push to stay ahead of the other agencies, or focus on testing and research? There are multiple ways to ensure the first person on Mars is under your command. Every choice matters: will you invest in the most advanced technology or take risks in the rush to the red planet? Using actual events and missions as inspiration, can you handle the challenges faced by real space agencies? Management is a vital aspect of Mars Horizon. You'll need to design and build the right spacecraft, hire and train the crew, and make strategic decisions as mission control to survive the journey to Mars. Enter into diplomatic partnerships with other agencies to share the rewards of space exploration, or risk going it alone to gain greater prestige. Construct the ideal rocket from historically-inspired vehicle parts. Hire contractors to construct vehicles and use their unique benefits to gain a key edge over your competitors. Launching a payload into space is only the first step. In assuming the role of Flight Director of mission control, you'll need to manage your spacecraft's resources and solve strategic challenges in turn-based missions in order to succeed. But beware: space is a very unforgiving environment. These are the critical moment-to-moment decisions of mission control; do you spend power to fix a malfunctioning antenna or save it in case of an oxygen leak? Perhaps risking that extra three months of mission planning could have avoided this issue? Mars Horizon has been made with the input and support of the European Space Agency (ESA) and the UK Space Agency. We’ve collaborated with numerous experts in space exploration from the ESA in creating Mars Horizon. From engineers developing the technology used in Mars programmes, to those designing the next generation of missions, bringing an unprecedented level of authenticity, realism and legitimacy to the gameplay and its scenarios. Dig deeper into the game via our podcast, including discussions with staff from the European Space Agency and UK Space Agency. Check out the podcast in the Steam forums or the main site.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/765810/header.jpg?t=1641900985",
    "Price": 19.99,
    "Developers": "Auroch Digital",
    "Publishers": "The Irregular Corporation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/765810/ss_25cdb531d9a25d480799a17db32c149a289c812a.1920x1080.jpg?t=1641900985,https://cdn.akamai.steamstatic.com/steam/apps/765810/ss_70d5e5755d3b014bf053d3781860f8703d794313.1920x1080.jpg?t=1641900985,https://cdn.akamai.steamstatic.com/steam/apps/765810/ss_6767d6a9b6377d55a1a19fb5e7e01a9e75b3dc68.1920x1080.jpg?t=1641900985,https://cdn.akamai.steamstatic.com/steam/apps/765810/ss_068f6da70f1a6646cfda8ea12b40b9865b6e4e46.1920x1080.jpg?t=1641900985,https://cdn.akamai.steamstatic.com/steam/apps/765810/ss_9b7da2efb07a15cad978d2a115208099e188f1c8.1920x1080.jpg?t=1641900985,https://cdn.akamai.steamstatic.com/steam/apps/765810/ss_0e53c6b105c767f470b0ce38b7946a853ef701c2.1920x1080.jpg?t=1641900985,https://cdn.akamai.steamstatic.com/steam/apps/765810/ss_2bc37bdbb1ac88f9f165bac335fb81220637b456.1920x1080.jpg?t=1641900985,https://cdn.akamai.steamstatic.com/steam/apps/765810/ss_4a9541b42bb752975ef52c3ca11b5928e658abaa.1920x1080.jpg?t=1641900985",
    "Slug": "mars-horizon",
    "Meta Title": "Mars Horizon: Nov 17, 2020, Auroch Digital and Full Overview",
    "Meta Description": "Looking for information on Mars Horizon? Check out the release date (Nov 17, 2020), developer insights from Auroch Digital, and a complete game summary.",
    "Alt Text Image": "Official header image for Mars Horizon game - Steam 765810",
    "Canonical URL": "https://gusku.site/game/mars-horizon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mars Horizon\", \"description\": \"Looking for information on Mars Horizon? Check out the release date (Nov 17, 2020), developer insights from Auroch Digital, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 17, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Auroch Digital\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Irregular Corporation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/765810/header.jpg?t=1641900985\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}