{
    "AppID": 1254370,
    "Name": "No one lives under the lighthouse Director's cut",
    "Release date": "Apr 21, 2020",
    "About the game": "One of these days you finally decide to take out the box with old CDs, mostly old games, covered with 10-year old dust. But you can't outstand the desire to look through all of them and prepare yourself for an hour full of nostalgia. While browsing them, one of the PC games you found there attracts your attention. You don’t remember this game being here. You neither remember buying or playing it. It seems really old, something from the early '00s. The title says “No one lives under the lighthouse”. The game description on the backside of the box seems to be poorly translated from some other language: 'You arrive at the old lighthouse on a small island near the coast of the United States. After the previous keeper has gone missing, you need to take over his duties and watch after the light. The member of the Establishment told you they'll get you an assistant after a week or two, but right now you're on your own. Featuring: Island exploration Enjoy the loneliness and ultra-modern graphics Look after the lighthouse, light the lamp at the sunset Listen what seagulls speak to you No words said Don't open the door that leads to the basement under the lighthouse No one lives under the lighthouse This sounds weird and disturbing. Game screenshots on the box look a bit uncanny. If this game wasn't so old you've probably decided it's another pretentious walking sim with horror elements. You need to check it. The box with other CDs stays in the corridor. You spent at least an hour looking for your old laptop, as your current PC doesn't even have the CD port. Install wizard completes and closes automatically in less than a minute. A text document named 'Instructions.txt' opens immediately after that. Instructions.txt: The keeper is responsible for the care and management of the light, and for the station in general. The keeper is responsible for the careful management and expenditure of stores and supplies. A lighthouse must never be left wholly unattended. Keepers must be courteous and polite to all visitors who conform to the regulations. The lighthouse basement should be locked up tight and not visited not by the keeper, nor anyone else. Lights must be lighted punctually at sunset and must be kept burning at full intensity until sunrise. All preparations must be made early, that there may be no delay in lightning. The lens and the glass of the lantern must be cleaned daily and always kept in the best possible condition. The keeper and his assistance, if he has any, should live in a house near the lighthouse. No one lives under the lighthouse. 'This doesn't sound like proper instructions for a PC game', you think. So you don't bother closing the document and finally launch the game .exe file. What could go wrong? Game features: From 1 to 2 hours of playtime for single walkthrough A slow burn low-jumpscare-rated horror mystery with multiple interpretations Retro aesthetics 3 endings Achievements Full controller support Director's cut: Director's cut (also known previously as Isolated Year Update) introduces a remake of most of the late-game content, completely changing the 2nd hour of the game and also adding some new things to the earlier part of the game. Also all of game's endings were remade and some of them became much harder to achieve than the others. Also, many achievements were remade according to the new content.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1254370/header.jpg?t=1656069571",
    "Price": 6.99,
    "Developers": "Marevo Collective",
    "Publishers": "Marevo Collective",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1254370/ss_b6f371a02e79616743900524f1d664dde39cbfb2.1920x1080.jpg?t=1656069571,https://cdn.akamai.steamstatic.com/steam/apps/1254370/ss_d2f05c8ecacfa75259f5d3138077806f6019d750.1920x1080.jpg?t=1656069571,https://cdn.akamai.steamstatic.com/steam/apps/1254370/ss_26924a22a4ca3afd114777a830c4d2e8142a04ff.1920x1080.jpg?t=1656069571,https://cdn.akamai.steamstatic.com/steam/apps/1254370/ss_b8d51e4d81fcfe278929cf94b451b312aeca57bf.1920x1080.jpg?t=1656069571,https://cdn.akamai.steamstatic.com/steam/apps/1254370/ss_08dfe15ffd9c5cc5536fa0caec831918412ab1b5.1920x1080.jpg?t=1656069571,https://cdn.akamai.steamstatic.com/steam/apps/1254370/ss_b77e92a433c2eace3fafec16ba00bd53a65df7a2.1920x1080.jpg?t=1656069571,https://cdn.akamai.steamstatic.com/steam/apps/1254370/ss_704d6ecdee1d67249280ec7d28894d24714068c2.1920x1080.jpg?t=1656069571,https://cdn.akamai.steamstatic.com/steam/apps/1254370/ss_58cca03e4c60fbccfb7e898eacfe3ad63c918c22.1920x1080.jpg?t=1656069571",
    "Slug": "no-one-lives-under-the-lighthouse-director-s-cut",
    "Meta Title": "No one lives under the lighthouse Director's cut: Apr 21,...",
    "Meta Description": "Looking for information on No one lives under the lighthouse Director's cut? Check out the release date (Apr 21, 2020), developer insights from Marevo C...",
    "Alt Text Image": "Official header image for No one lives under the lighthouse Director's cut game - Steam 1254370",
    "Canonical URL": "https://gusku.site/game/no-one-lives-under-the-lighthouse-director-s-cut",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"No one lives under the lighthouse Director's cut\", \"description\": \"Looking for information on No one lives under the lighthouse Director's cut? Check out the release date (Apr 21, 2020), developer insights from Marevo C...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Marevo Collective\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Marevo Collective\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1254370/header.jpg?t=1656069571\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}