{
    "AppID": 666870,
    "Name": "Perfect Crime",
    "Release date": "Oct 1, 2020",
    "About the game": "Brief Introduction Perfect Crime is a detective game, but it contains neither conventional jigsaw puzzles nor popular small games. It focuses on the logical reasoning of the criminal investigation which includes details like the motive for murder, method, and creation of an alibi. Better yet, a comprehensive and powerful editor of cases will be provided. With the editor’s help, you can effortlessly follow the footsteps of Detective Conan, or become the next Sherlock Holmes, to uncover the great unsolved mysteries! You will choose the murder weapon to kill the victim and remove all the traces. You will choose when and where to act and use optical illusion of other characters to create a perfect alibi. You should consider how to use the different tool marks to confuse the police and forensic experts. You can try to pin the murder on other characters by leaving someone's house keys at the scene of the crime, committing the crime in someone’s house, and so on. Children are not allowed to play the game. Rules of play The game is composed of two processes: crime and investigation. During the crime section, players should plan, create an alibi, choose the best method, process the crime weapon, and destroy evidence at the scene of the crime to avoid the suspicion of murder. Of course, players should also be careful about the specific time of every character's action, which could help them make a rigorous plan. During the investigation section, the police will find more details about the suspects according to their suspicious degree. They will investigate if the suspects have an alibi and places where they regularly visit. Every aspect will influence the suspicious degree. For example, if you don’t have an alibi, then the suspicious degree of you will rise rapidly. But if the murder is done properly by the player, then the police will not find the truth and the murderer will escape. Thus, a perfect crime is made. Details Action: Players will leave traces if they call someone, go to someone’s house, or touch something. Even if they choke someone to death, there will be scratches on their arms because the victim’s struggle. All these traces are important evidence when the police are solving a case. Tools: Players will meet lots of tools in the games, such as keys, cups, daggers, etc. Each tool has its own functions, but these tools cannot be used casually. For example, there are only two persons in the room, the tool and yourself. If you directly take up the knife on the table, the other person will be suspicious and ask you to put it down. But he will not see it if you can shift his focus when you take up the knife. Psychological pressures: Players will have psychological pressure when they are deciding dangerous options. For example, choking someone to death or tying someone up are considered dangerous. If the psychological pressure is too high, then players will not be able to carry out the action. So, players should allocate their psychological pressures reasonably by using some skills. NPC: You will meet a lot of people in the game. They have different personalities and will react distinctively to the same thing. If they see a body in the room, some people will call the police immediately while some curious people will come into the room and check the body, leaving his traces. Alibi: An alibi depends on witnesses in the game. For example, Role A saw you walk into the restaurant at 8 o’clock and leave at 9 o’clock, then he can prove that you were in the restaurant from 8 to 9. If the time of death is 8:30 and it happened in the victim’s house, then you will have an alibi. Players always act as murders in cases, so all the alibis are fake. There are many ways to create an alibi and players are asked to find these ways by themselves. Your suspicious degree will be much lower if you have an alibi, which will contribute to your success. More details will be added to the game: The details make the game more challenging, but players enjoy the game more at the same time, because there are more methods to choose and the game is more realistic. Editor If you are a big fan of Sherlock Holmes or other detective novels, would you want to create a major case by yourself? An editor is provided in the game, which can be used by players to create a case of their own. A few persons’ ability is limited, but we want to give players more freedom as much as possible. So, players are needed to join in. An access is provided in the game, which can be utilized for players to play the cases created by themselves. Players can upload their cases to Steam Work and release their MOD. We always have tremendous faith in the power of players.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/666870/header.jpg?t=1657113518",
    "Price": 11.39,
    "Developers": "Skeleton,GuGong",
    "Publishers": NaN,
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/666870/ss_75e0e79f22cd6f5f736c87342a5dcf5f8892fc0e.1920x1080.jpg?t=1657113518,https://cdn.akamai.steamstatic.com/steam/apps/666870/ss_fa8d745734704be3c7207f02fe0284bb70a64abc.1920x1080.jpg?t=1657113518,https://cdn.akamai.steamstatic.com/steam/apps/666870/ss_fa1f93d54cc7b27c08b73386d2ac9bf8ca9710cf.1920x1080.jpg?t=1657113518,https://cdn.akamai.steamstatic.com/steam/apps/666870/ss_ce400a80c84999a6d2a9bf72839b1e10426870a0.1920x1080.jpg?t=1657113518,https://cdn.akamai.steamstatic.com/steam/apps/666870/ss_78e5b437796f1963ac25967500007e9895eda351.1920x1080.jpg?t=1657113518,https://cdn.akamai.steamstatic.com/steam/apps/666870/ss_8dd1986bc209cb031f430ecfd849cc0bc6398768.1920x1080.jpg?t=1657113518,https://cdn.akamai.steamstatic.com/steam/apps/666870/ss_dabb24839522247e0a143795f4622252eb9ad891.1920x1080.jpg?t=1657113518,https://cdn.akamai.steamstatic.com/steam/apps/666870/ss_4825fca93698a53345c58b65a7abd7936bdac6e7.1920x1080.jpg?t=1657113518",
    "Slug": "perfect-crime",
    "Meta Title": "Perfect Crime: Oct 1, 2020, Skeleton,GuGong and Full Over...",
    "Meta Description": "Looking for information on Perfect Crime? Check out the release date (Oct 1, 2020), developer insights from Skeleton,GuGong, and a complete game summary.",
    "Alt Text Image": "Official header image for Perfect Crime game - Steam 666870",
    "Canonical URL": "https://gusku.site/game/perfect-crime",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Perfect Crime\", \"description\": \"Looking for information on Perfect Crime? Check out the release date (Oct 1, 2020), developer insights from Skeleton,GuGong, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 1, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Skeleton,GuGong\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": NaN}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/666870/header.jpg?t=1657113518\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}