{
    "AppID": 485110,
    "Name": "PlanetFate",
    "Release date": "Jun 6, 2016",
    "About the game": "Defend your planet from incoming asteroids, aliens and more in this VR-only room-scale HTC Vive game. Position defense units in orbits around your planet, plant mines and keep an eye out for planet-bound threats from any direction. PlanetFate is being built from the ground up for virtual reality. Being able to manipulate defense units' orbits using Vive's controllers and move around your playspace to identify incoming threats makes this a tense and action filled game. The fate of your planet rests on your quick thinking, strategic skills and spatial awareness. Current Game Modes Time Challenge: Think you can keep your planet safe for a mere five minutes? We'll see... Endless: How long can you hold off the inevitable? Saturn Supply Run (early build): See below First mission (early build) A very early build of PlanetFate's first mission is now available. Take a cargoship on a delivery run to Saturn and push your way past enemy weapon platforms and asteroid fields. Manage your ship's power between weapons, shields and engines while trying to keep your cargo in one piece. This is an early build of the mission to gather feedback from players. You will likely encounter bugs along the way so please report any on the PlanetFate website or in the community forum. Tips and instructions on how to play the mission: When the ship is ready after leaving the shipyard, push your controller's trackpad to engage engines. Swipe your thumb across the trackpad to shift power between shields, weapons and engines. To aim a turret at an enemy, select the turret with the trigger. Hold the trigger down and move your controller to point towards an enemy. When you feel the controller rumble, you can release the trigger. The turret will lock on and automatically fire when in range. (known bug: sometimes the laser pointer will not display. This is a known UE4 issue and is a high priority) Turrets are blue when inactive, yellow when you select one and green while locked on to a target If a turret or shield is disabled, diverting power to that system will speed up repairs Asteroids permanently disable turrets and shields, so watch out for them A tutorial will be created after the mission is fully developed so thank you for your patience in this early stage. Current Features Full HTC Vive Support: Room scale with full motion controller support Highscores for arcade game modes Adjustable planet height: Whether you're 4ft, 7ft or anything in-between, we've got you covered Optional standing platform: Float in space or give yourself the comfort of some firm footing Variety of weapons: Orbital lasers, torpedoes and mines are only the beginning... Future Mission Modes in Development In addition to the arcade style game modes currently available, PlanetFate will offer players more game modes focused on strategy and longer gameplay. Here's a sneak peek at what's currently in development and how the game will expand over time: Escort Missions: defend ships against pirates, through asteroid fields and other hazards Battlecruiser Missions: control a massive battlecruiser's turrents, shields and fighters in various scenarios Defense Building: build and manage stations, mines, shields and more from invasions Skirmish: build and manage your fleet and engage in room scale battles The type of missions created will be based on the support PlanetFate receives during Early Access. So while the current version only offers arcade-style modes, if you are interested in longer form missions, consider supporting PlanetFate.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/485110/header.jpg?t=1489090150",
    "Price": 3.99,
    "Developers": "Aaron Matthies",
    "Publishers": "Aaron Matthies",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/485110/ss_74ea3321746130f6025da1317c46c0e2667dc86d.1920x1080.jpg?t=1489090150,https://cdn.akamai.steamstatic.com/steam/apps/485110/ss_9058ec9447944b5839fd2ba7bac2fde7a8bcd198.1920x1080.jpg?t=1489090150,https://cdn.akamai.steamstatic.com/steam/apps/485110/ss_2ea9219f83cb1df0e999b2e230eb5d63580ba798.1920x1080.jpg?t=1489090150,https://cdn.akamai.steamstatic.com/steam/apps/485110/ss_b59c40102e508138132ee29cb6a85f21b70c58b8.1920x1080.jpg?t=1489090150,https://cdn.akamai.steamstatic.com/steam/apps/485110/ss_24d6135eb1e6afa416cd2612ae69aa17576b4da4.1920x1080.jpg?t=1489090150,https://cdn.akamai.steamstatic.com/steam/apps/485110/ss_7fd49c526da09fd8ec0a3dfd039b46bf41db88fa.1920x1080.jpg?t=1489090150,https://cdn.akamai.steamstatic.com/steam/apps/485110/ss_69d22b8c441869647a6a350c2c49277bb16493da.1920x1080.jpg?t=1489090150,https://cdn.akamai.steamstatic.com/steam/apps/485110/ss_1fe14bf8e191877a90fbe2a733ce81300985ad79.1920x1080.jpg?t=1489090150,https://cdn.akamai.steamstatic.com/steam/apps/485110/ss_a206c1a4410d8340370067c948e1eddfb1af96ab.1920x1080.jpg?t=1489090150,https://cdn.akamai.steamstatic.com/steam/apps/485110/ss_a83a92f893cadc98731a6c35bd3d0c4edc2ef968.1920x1080.jpg?t=1489090150,https://cdn.akamai.steamstatic.com/steam/apps/485110/ss_89407f725c2c220ce22840f8b6a8cbf881d0a3cc.1920x1080.jpg?t=1489090150,https://cdn.akamai.steamstatic.com/steam/apps/485110/ss_338213322e73d9e48d7df748f96ed017a7672438.1920x1080.jpg?t=1489090150",
    "Slug": "planetfate",
    "Meta Title": "PlanetFate: Jun 6, 2016, Aaron Matthies and Full Overview",
    "Meta Description": "Looking for information on PlanetFate? Check out the release date (Jun 6, 2016), developer insights from Aaron Matthies, and a complete game summary.",
    "Alt Text Image": "Official header image for PlanetFate game - Steam 485110",
    "Canonical URL": "https://gusku.site/game/planetfate",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"PlanetFate\", \"description\": \"Looking for information on PlanetFate? Check out the release date (Jun 6, 2016), developer insights from Aaron Matthies, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 6, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aaron Matthies\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aaron Matthies\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/485110/header.jpg?t=1489090150\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}