{
    "AppID": 419710,
    "Name": "Rogue Singularity",
    "Release date": "Aug 15, 2019",
    "About the game": "Rogue Singularity is a high-speed infinite obstacle course inspired the classic 3D platformers of the 1990s. A wandering black hole – a rogue singularity, in fact – has crashed into your star system, turning countless worlds into floating debris. You control a plucky little robot, traversing the remnants of these worlds while dodging hazards, escaping hostile creatures, and solving devious puzzles. Every level is procedurally generated, so you will never play the same game twice. Customize your robot hero and prepare for a challenge, on Windows PC, Mac and Linux. Rogue Singularity takes players back to the golden age of third-person precision platformers, ideal for speedrunning. Your first job is simply to survive. Each level is packed with hazards, and simply getting from one end to the other with your robot in one piece will be a challenge. As your skills grow, you will be challenged not not only survive, but to reach the end of the level in the fastest possible time. Tackle a level that has been shared through the online community, and you will even be able to race against the ghost of the fastest player. No level will be the same twice. Each location in Rogue Singularity is procedurally generated for ­infinite replayability, but any level you successfully complete is shared with the rest of the community. Master the level, share it, and you’ll set the pace for others to strive for as they jostle for the #1 spot on the leaderboard. There are also weekly challenges which allow you only one chance to make it to the end safely and get your time on the leaderboard. Will you be the fastest survivor? Precision platforming! Surviving this 3D world requires reflexes and precision. An infinite galaxy! Every level of every playthrough is a unique procedurally-made experience. Challenge the world! Share your completed levels with the world and engage in weekly challenges. Tight controls! The game’s controls have been precision engineered to be ultra-responsive. A bizarre universe! Robot monkeys, giant bees, mechanical sharks and more will keep you on your toes. Build that ‘bot! Customize your robot with hundreds of pieces that can be recombined in millions of ways. Tap those toes! Enjoy the hybrid chiptune-electronica soundtrack by Derris Kharlan ( Time Surfer ).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/419710/header.jpg?t=1565875128",
    "Price": 14.99,
    "Developers": "Considerable Content",
    "Publishers": "Considerable Content",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/419710/ss_779f3b4a3a19a2410ef0c842b68d77fa8c6c36fa.1920x1080.jpg?t=1565875128,https://cdn.akamai.steamstatic.com/steam/apps/419710/ss_d1150c889fc663cd5864159299672824b4d3a2a2.1920x1080.jpg?t=1565875128,https://cdn.akamai.steamstatic.com/steam/apps/419710/ss_b4bf5f8ce1ee34a36d76da8ce1b0620844ba4098.1920x1080.jpg?t=1565875128,https://cdn.akamai.steamstatic.com/steam/apps/419710/ss_9bb6d84240730644be99032043bf4f779ed23f09.1920x1080.jpg?t=1565875128,https://cdn.akamai.steamstatic.com/steam/apps/419710/ss_46ac6422642dc616dc906c226b5ff5e0a6a0a38e.1920x1080.jpg?t=1565875128",
    "Slug": "rogue-singularity",
    "Meta Title": "Rogue Singularity: Aug 15, 2019, Considerable Content and...",
    "Meta Description": "Looking for information on Rogue Singularity? Check out the release date (Aug 15, 2019), developer insights from Considerable Content, and a complete ga...",
    "Alt Text Image": "Official header image for Rogue Singularity game - Steam 419710",
    "Canonical URL": "https://gusku.site/game/rogue-singularity",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rogue Singularity\", \"description\": \"Looking for information on Rogue Singularity? Check out the release date (Aug 15, 2019), developer insights from Considerable Content, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 15, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Considerable Content\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Considerable Content\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/419710/header.jpg?t=1565875128\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}