{
    "AppID": 1561920,
    "Name": "Rosemary's Fate Life Worth Living",
    "Release date": "Jun 16, 2021",
    "About the game": "Take the challenge in survival horror Rosemary's Fate. Put on your headphones and play! Action, space, and plot are designed entirely by original 3D sound algorithms. You explore a mysterious world that constantly surprises you with scenes painted by sounds and music. The gameplay is similar to video games, but enriched with a total sensory immersion and lots of work left for the imagination that is stimulated by the amazing ability humans have to „see through sounds”. Rosemary's Fate is also a story stretched in three time dimensions (or rather two time dimensions and one place beyond time and space) that touches the deepest human questions about life and death. True sounds of the Universe were used to create original ambients and sounds effects. Under the facade of a happy woman, there are unexplainable anxieties and longings. There is one remnant of unknown past from before she had been adopted, a totem of identity. Black and white picture of a group of people who seem… fearful? They stand in front of a monumental, red brick building. What are they afraid of? Who are they? And where? Thomas knows he must aid his beloved in the search for her roots. With the help of his friends from a history forum, he finds a lead! The building is the former Owińska mental hospital in Poland, from just before WW II began. And one of the ladies in the picture is… Her great-grandmother? So, Thomas and Mary come to Poland, only to find another photography in an old Cistercian convent library. It’s exactly the same as Mary’s… Or is it? No, hold on, it isn’t. There’s this one little girl next to great-grandma. But before they have time to think, find any meaningful answers, there comes… Oh, we can’t explain this, you have to hear it yourself! Because this is where everything gets complicated. Thomas tries to find himself in these new circumstances. He wanders about in a labyrinth of corridors, sometimes thinking he still is in the present, and only hearing strange revenants. Sometimes realizing he’s now in a completely different place and maybe even time. He hears screams in German, gun shots, crying… Now – or once upon a time – he will meet an extremely important little girl. Oh, and also there’s Blinky, a cat that seems simultaneously dead and alive – what a paradox… Narrative created by sound Action, space, and plot are designed entirely by sound. There is no narrator to guide a player through very dynamic gameplay. Deep sensory immersion We took advantage of the amazing ability humans have to „see through sounds” in the darkness. By properly impacting the sensory stimuli and giving space for the work of imagination, we allow a much deeper immersion in the lore and intensify emotions. Unique genre mix The dynamic of action games, strong emotions of horrors, time &amp; space paradoxes from science fiction, survival challenges, and educational quality like in history games. Rosemary’s Fate is a confluence of history and fiction, entertainment and pensiveness.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1561920/header.jpg?t=1654150797",
    "Price": 9.99,
    "Developers": "Game The Same",
    "Publishers": "Game The Same",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1561920/ss_5c98e59b600e4bbcc7bc3e2db2b8872a5c7c3c09.1920x1080.jpg?t=1654150797,https://cdn.akamai.steamstatic.com/steam/apps/1561920/ss_908fef6ed7665fb94fa26d57e3ce8ab6d0be2559.1920x1080.jpg?t=1654150797,https://cdn.akamai.steamstatic.com/steam/apps/1561920/ss_7807e39342aefe25c6669cd1b077c224d824bed1.1920x1080.jpg?t=1654150797,https://cdn.akamai.steamstatic.com/steam/apps/1561920/ss_7a1b1191de57f7ac19d66ecfcdfc0e601f36f8e1.1920x1080.jpg?t=1654150797,https://cdn.akamai.steamstatic.com/steam/apps/1561920/ss_fd433b40f4ae0a96834be2278b2f4b496aa11602.1920x1080.jpg?t=1654150797,https://cdn.akamai.steamstatic.com/steam/apps/1561920/ss_a884857f842a44dcac9d97ef95159dc4068d0df5.1920x1080.jpg?t=1654150797,https://cdn.akamai.steamstatic.com/steam/apps/1561920/ss_f8772b50beabfee85df11483a03d70d828e191be.1920x1080.jpg?t=1654150797,https://cdn.akamai.steamstatic.com/steam/apps/1561920/ss_1f5fbdfa50db2bf254d6a923de4fef624c3c7cfd.1920x1080.jpg?t=1654150797",
    "Slug": "rosemary-s-fate-life-worth-living",
    "Meta Title": "Rosemary's Fate Life Worth Living: Jun 16, 2021, Game The...",
    "Meta Description": "Looking for information on Rosemary's Fate Life Worth Living? Check out the release date (Jun 16, 2021), developer insights from Game The Same, and a co...",
    "Alt Text Image": "Official header image for Rosemary's Fate Life Worth Living game - Steam 1561920",
    "Canonical URL": "https://gusku.site/game/rosemary-s-fate-life-worth-living",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rosemary's Fate Life Worth Living\", \"description\": \"Looking for information on Rosemary's Fate Life Worth Living? Check out the release date (Jun 16, 2021), developer insights from Game The Same, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Game The Same\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Game The Same\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1561920/header.jpg?t=1654150797\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}