{
    "AppID": 1157640,
    "Name": "Sakura Fox Adventure",
    "Release date": "Oct 25, 2019",
    "About the game": "Mikoto is a foxgirl who lives deep in the woods, in a settlement full of foxgirls called Yamatai. Mikoto’s mother, Himiko, is the leader of these foxgirls, and she commends immense magical powers. As the daughter of an illustrious woman, Mikoto is expected to train hard, and one day take her mother’s place – but there’s a catch. Mikoto is a complete failure of a foxgirl! Despite being twenty-five years of age, Mikoto only has one tail. She fumbles even the simplest of spells, and her hand-to-hand combat skills are laughable. She routinely loses mock battles against her tutor, Ohana, and the other foxgirls in her clan shun and mock her owing to her ineptitude. Unsatisfied with her mundane life in Yamatai, Mikoto dreams of leaving home and speaking to the humans that live in the nearby Warren Village. Mikoto has heard humans are wicked and untrustworthy, but Mikoto is an optimist at heart, and she’s sure humans can’t be as bad as the stories say. And so, on one dark night, Mikoto runs away from her home to attend the annual harvest festival in Warren Village. There, she meets a beautiful knight called Juni, and she is irrevocably drawn to her. An intense, passionate relationship soon blossoms between the pair… But foxgirls like Mikoto aren’t welcome among humans, and Ohana is determined to get her runaway pupil back, no matter the cost. Can Mikoto and Juni’s love work out, or is it doomed to failure? That depends on you! Mikoto is a cheerful, outgoing foxgirl with a zest for life. Adventurous and inquisitive, Mikoto wants nothing more than to explore the world around her – but how can she, when her tutor is so very controlling?! As Mikoto has few friends, she gets overly attached to Juni from the get-go. She’s pushy and insistent, and perhaps her advances are a tad inappropriate… but she’s pure at heart, and apologizes whenever she goes too far. Ohana is Mikoto’s tutor. She’s a forest nymph who’s lived for several centuries, and she possesses immense magical power that rivals even that of Mikoto’s mother, Himiko. Ohana is a stern woman, and she takes her duties as Mikoto’s tutor very seriously. She’s the first to rebuke Mikoto whenever she makes a mistake – but she loves her charge a great deal, and wants only the best for her. Juni is a softly-spoken human who lives in Warren Village. She served in the army for several years, and her skills with a sword are impeccable. Though Juni often wears armor and wields a blade, she’s a kind soul and generous soul who can’t bear to see people in need. Juni has a strong sense of justice, and she’s willing to fight for what she believes is right, even if it comes at the risk of alienating herself from her fellow humans. Feature: - Join Mikoto on her adventure to discover a new world - Soon available in Chinese - Change the outcome of the story with your choices",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1157640/header.jpg?t=1587984768",
    "Price": 9.99,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1157640/ss_802d816055f37667b0e304fa5ca974346fb56f70.1920x1080.jpg?t=1587984768,https://cdn.akamai.steamstatic.com/steam/apps/1157640/ss_a908167941ca989136bafd0cb1d1c9ed0e59a733.1920x1080.jpg?t=1587984768,https://cdn.akamai.steamstatic.com/steam/apps/1157640/ss_72851b7f45198fb152b88f2c64046e85c2349174.1920x1080.jpg?t=1587984768,https://cdn.akamai.steamstatic.com/steam/apps/1157640/ss_4770773d7e8fa1fc48c7f429066dfb6c54e3209c.1920x1080.jpg?t=1587984768,https://cdn.akamai.steamstatic.com/steam/apps/1157640/ss_9485102931194b3ba4c8747e8c3273211b951bde.1920x1080.jpg?t=1587984768,https://cdn.akamai.steamstatic.com/steam/apps/1157640/ss_2807685283445e4046c63b04f3e4230e182e24f8.1920x1080.jpg?t=1587984768,https://cdn.akamai.steamstatic.com/steam/apps/1157640/ss_e361989fedeeb0f022a06eccdb0cfbaa7b96728e.1920x1080.jpg?t=1587984768,https://cdn.akamai.steamstatic.com/steam/apps/1157640/ss_ea1bacae576034c579aff83db62bea9fe26a58d4.1920x1080.jpg?t=1587984768,https://cdn.akamai.steamstatic.com/steam/apps/1157640/ss_d67e456a20e02b83a8d4e4b9594cdde68563fe2d.1920x1080.jpg?t=1587984768,https://cdn.akamai.steamstatic.com/steam/apps/1157640/ss_44db97f24fefa1dcdd22ad2adb8dd357616ac035.1920x1080.jpg?t=1587984768,https://cdn.akamai.steamstatic.com/steam/apps/1157640/ss_51096c6f1a934663261f9528892392dbfb23ca22.1920x1080.jpg?t=1587984768,https://cdn.akamai.steamstatic.com/steam/apps/1157640/ss_fd7876afa45c726092775ec4a3b765aa75aa1db8.1920x1080.jpg?t=1587984768",
    "Slug": "sakura-fox-adventure",
    "Meta Title": "Sakura Fox Adventure: Oct 25, 2019, Winged Cloud and Full...",
    "Meta Description": "Looking for information on Sakura Fox Adventure? Check out the release date (Oct 25, 2019), developer insights from Winged Cloud, and a complete game su...",
    "Alt Text Image": "Official header image for Sakura Fox Adventure game - Steam 1157640",
    "Canonical URL": "https://gusku.site/game/sakura-fox-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura Fox Adventure\", \"description\": \"Looking for information on Sakura Fox Adventure? Check out the release date (Oct 25, 2019), developer insights from Winged Cloud, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 25, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1157640/header.jpg?t=1587984768\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}