{
    "AppID": 264000,
    "Name": "Son of Nor",
    "Release date": "Apr 27, 2015",
    "About the game": "As a Son of Nor, consecrated by the Goddess of the Night, you are all that stands between the human race and total extinction. Only one human enclave remains in the vast desert world of Noshrac, a hidden refuge called The Edge. After 400 years of peace, humanity’s ancient enemy the Sarahul appears once more, forcing you into an adventure to save your people. Armed with telekinesis and terraforming, the gifts granted by the goddess Nor, you will explore the world of Noshrac, fighting through enemy territory and uncovering long-forgotten secrets. On your journey you will discover mysterious structures created by an ancient race that are filled with puzzles and traps – and the key to mystical powers unlike any you’ve ever seen. As a Son of Nor, the World is your Weapon. Use it wisely. Features Telekinesis : Tear rocks out of canyon walls and hurl them at opponents, or use your telekinetic abilities to solve intriguing puzzles. Move and throw objects to prepare traps and use the environment to your advantage! Terraforming : Raise and lower sand to bury enemies, excavate secret passages, block entrances, create barricades or reach elevated places to gain a tactical advantage. Or go haywire and bury entire buildings! Elemental Magic : Unlock Wind, Fire and Essence magic to enhance your arsenal. Cast powerful spells, or enchant telekinetically controlled objects for extra deadly attacks! Combine multiple magic spells to unlock even more powerful techniques! Co-op Multiplayer : Son of Nor supports four-player online co-op play as well as two-player local splitscreen co-op. PvP Multiplayer : Prove who is the most powerful Son of Nor in chaotic four-player competitive multiplayer action! Intriguing Storyline: Experience the full 12+ hour storyline of Son of Nor, set in a deep original universe featuring dozens of characters brought to life by professional voice actors. Character Customization: Create your own male or female character and choose from a wide variety of costume pieces and decorative gear. Become immersed in the world of Son of Nor: no GUI or HUD, everything is embedded naturally and intuitively in the world’s environment. Proving Ground: Test your combat abilities in this playground of destructive delights! Includes an original atmospheric sound track composed specifically for Son of Nor Cutting Edge Peripheral Support: Aim telekinetic objects with your eyes with the SteelSeries Sentry eye tracker or tobii EyeX (Windows Only), or command the game with your mind with the Emotiv EPOC brain computer interface (Windows Only)!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/264000/header.jpg?t=1447359427",
    "Price": 19.99,
    "Developers": "stillalive studios",
    "Publishers": "Viva Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/264000/ss_1bb9cdd3b82a3826239a857f0095f49d2b582bb8.1920x1080.jpg?t=1447359427,https://cdn.akamai.steamstatic.com/steam/apps/264000/ss_b498d7fe2f448e1a64b088b790068e37941924d9.1920x1080.jpg?t=1447359427,https://cdn.akamai.steamstatic.com/steam/apps/264000/ss_b15d4416baa81e8fad9d3c341261b2acfb819f41.1920x1080.jpg?t=1447359427,https://cdn.akamai.steamstatic.com/steam/apps/264000/ss_df3e4f3c4883b3536cac349ea1f6cda36939cbf3.1920x1080.jpg?t=1447359427,https://cdn.akamai.steamstatic.com/steam/apps/264000/ss_f0e439367d8264e809e4dd9d28365e927edad479.1920x1080.jpg?t=1447359427,https://cdn.akamai.steamstatic.com/steam/apps/264000/ss_d0b46dde93f27220d506a2c3cc5b9cdbdedcf62a.1920x1080.jpg?t=1447359427,https://cdn.akamai.steamstatic.com/steam/apps/264000/ss_b21728458118aab3dbb90238efa354c231fb2999.1920x1080.jpg?t=1447359427,https://cdn.akamai.steamstatic.com/steam/apps/264000/ss_18f0044b26e8abaaf2abf6b398784e0a787820f1.1920x1080.jpg?t=1447359427",
    "Slug": "son-of-nor",
    "Meta Title": "Son of Nor: Apr 27, 2015, stillalive studios and Full Ove...",
    "Meta Description": "Looking for information on Son of Nor? Check out the release date (Apr 27, 2015), developer insights from stillalive studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Son of Nor game - Steam 264000",
    "Canonical URL": "https://gusku.site/game/son-of-nor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Son of Nor\", \"description\": \"Looking for information on Son of Nor? Check out the release date (Apr 27, 2015), developer insights from stillalive studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 27, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"stillalive studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Viva Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/264000/header.jpg?t=1447359427\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}