{
    "AppID": 304690,
    "Name": "Star Sonata 2",
    "Release date": "Jun 12, 2020",
    "About the game": "Action-based combat and movement — No queued up actions like many massively multiplayer online games. You are in direct control of your ship. Star Sonata is a 3D top down action based game. Other games, you just press a dodge key, but in Star Sonata you have to manually pilot your ship and avoid those laser beams, bullets, and missiles! Using real time strategy (RTS) controls you can also create robot controlled ships to fight alongside you and deploy defensive or offensive drone platforms. Build your Empire in a Sandbox style universe — Manage your colonies, build bases, deploy defensive drones, establish trade routes with robot controlled ships. The universe resets every 3-4 months which randomizes the galaxies in player buildable space, creating new conflict where there were once settled borders. Players can advance economically by trading between bases, creating their own bases and colonies, killing enemies, collecting Player versus Player (PVP) bounties, or completing one of the 2000 missions. There are thousands of different items that can be obtained or constructed and sold to other players. Become Emperor of the Universe — A player can “win” the game by declaring themselves emperor and defending their palace successfully until the end of the universe. Don’t like the Emperor or want to be the Emperor yourself? Star Sonata is a player vs player game with the universe separated into distinct PVP and non-PVP zones; fight your enemies and lead your team to glory. You can partake in large scale PVP conflicts with hundreds of players, or even little skirmishes on fringe systems. No two players are alike — Star Sonata includes a wide variety of skills and customization options including eight classes, four trade skills, 127 total skills that give various stat increases that the players can train, over 250 player obtainable ships, the ability to change nearly every aspect of your ship’s build including the engine, weapons, energy, shield, and more! In Star Sonata no two players will play the game the same way and no two players will have the exact same build! Free forever, no level limit - Play as long as you like for free, and with no level limit! An optional subscription is required for some content, but most of the game is available without a subscription. One global server, one amazing community - Star Sonata does not separate the community based on region, everyone plays on the same server.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/304690/header.jpg?t=1594676903",
    "Price": 0.0,
    "Developers": "Landauer Games",
    "Publishers": "Landauer Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/304690/ss_5910a52a000dea69016c302e4fbd787c9cd4a4fb.1920x1080.jpg?t=1594676903,https://cdn.akamai.steamstatic.com/steam/apps/304690/ss_325969da362004f8dd8744206b6bb7de2c391bd4.1920x1080.jpg?t=1594676903,https://cdn.akamai.steamstatic.com/steam/apps/304690/ss_9e6c1759f37c1532ff27bd293a5c9a11590581f4.1920x1080.jpg?t=1594676903,https://cdn.akamai.steamstatic.com/steam/apps/304690/ss_9d5749b57c28ffc9691e9d5e29acf73f1b09b0fd.1920x1080.jpg?t=1594676903,https://cdn.akamai.steamstatic.com/steam/apps/304690/ss_01f7bef44a62513faea2a4558d849c3cec729945.1920x1080.jpg?t=1594676903,https://cdn.akamai.steamstatic.com/steam/apps/304690/ss_e52374290b8175b019d1b19af64e4da8729d84d6.1920x1080.jpg?t=1594676903,https://cdn.akamai.steamstatic.com/steam/apps/304690/ss_98402b7df32aefb687316c7017591e5bba372bc6.1920x1080.jpg?t=1594676903,https://cdn.akamai.steamstatic.com/steam/apps/304690/ss_4eba8f7bf2c58ed80407250986d0e1b6d62bfdcb.1920x1080.jpg?t=1594676903",
    "Slug": "star-sonata-2",
    "Meta Title": "Star Sonata 2: Jun 12, 2020, Landauer Games and Full Over...",
    "Meta Description": "Looking for information on Star Sonata 2? Check out the release date (Jun 12, 2020), developer insights from Landauer Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Star Sonata 2 game - Steam 304690",
    "Canonical URL": "https://gusku.site/game/star-sonata-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Star Sonata 2\", \"description\": \"Looking for information on Star Sonata 2? Check out the release date (Jun 12, 2020), developer insights from Landauer Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 12, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Landauer Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Landauer Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/304690/header.jpg?t=1594676903\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}