{
    "AppID": 1983060,
    "Name": "The Twilight of Infinity",
    "Release date": "Jul 1, 2022",
    "About the game": "What if we're living in a world that wasn't meant to exist? What if we existed where pandemics swept the world? Where Presidents were assassinated, whole civilisations vanished, and humanity never colonised the Moon? Someone is changing history. And the world we know may not exist much longer. Solve histories greatest mysteries in The Twilight of Infinity, a time travelling puzzle adventure series where every episode puts you inside the story of a famous historical event. Travel to both distant lands and times to prevent the corruption of time from an unknown entity known as the 'Benefactor'. Series 1 to begin soon Airship Invasion of 1896 Attack on the Hydro Processor A Deuce of Devils Therefore I Am Flight into Yesterday - The Disappearance of Amelia Earhart 2023 New episodes monthly. The greatest puzzles of all time A puzzle game is only as good as it's puzzles, and these ones have defied every attempt to solve them. How do you get a devout religious 1890's rancher to leave his home so that you can intercept the pilot of an airship that technologically shouldn't exist? How can you communicate with a 16th French person with no technology during the Black Death? Can you prove to a 19th century Lord that you're the Devil? Unconventional puzzles require unconventional problem solving. Moving away from conventional gaming puzzles. Rather than randomly inserted abstract puzzles to pad the story, puzzles are dictated by the story itself. Players will have to solve the situation.. Gameplay as diverse as the history it represents Jump from quiet 1890's ranches to busy futuristic offices to oppressive and sinister castles. Time and geography are irrelevant. Solve puzzles, interact with historical legends, investigate, manipulate and convince to unravel the greatest unsolved mysteries of humanity. You made a time machine... Out of a Cassetteboy? Aided by a prophecy book written in the 16th Century by Nostradamus, an instant camera and a time machine made out of a CassetteBoy, Use 1980's technology to manipulate, astonish and confuse the past. Or play catch up and be astonished when visiting the future.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1983060/header.jpg?t=1656709679",
    "Price": 0.0,
    "Developers": "Ono",
    "Publishers": "Ono",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1983060/ss_f152fa992526447b3886d137d78a788683c3c5a5.1920x1080.jpg?t=1656709679,https://cdn.akamai.steamstatic.com/steam/apps/1983060/ss_33c3b6667ed686a8a5b6388335c83b61a67eed48.1920x1080.jpg?t=1656709679,https://cdn.akamai.steamstatic.com/steam/apps/1983060/ss_e16f27adb7ed26ba9aff983ca1c892a076e5e4d6.1920x1080.jpg?t=1656709679,https://cdn.akamai.steamstatic.com/steam/apps/1983060/ss_b53503e9893ddaf74efc4cf081c236753e1a974f.1920x1080.jpg?t=1656709679,https://cdn.akamai.steamstatic.com/steam/apps/1983060/ss_befbe24371f0a27ecece419a0aa17af08da23b6d.1920x1080.jpg?t=1656709679",
    "Slug": "the-twilight-of-infinity",
    "Meta Title": "The Twilight of Infinity: Jul 1, 2022, Ono and Full Overview",
    "Meta Description": "Looking for information on The Twilight of Infinity? Check out the release date (Jul 1, 2022), developer insights from Ono, and a complete game summary.",
    "Alt Text Image": "Official header image for The Twilight of Infinity game - Steam 1983060",
    "Canonical URL": "https://gusku.site/game/the-twilight-of-infinity",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Twilight of Infinity\", \"description\": \"Looking for information on The Twilight of Infinity? Check out the release date (Jul 1, 2022), developer insights from Ono, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ono\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ono\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1983060/header.jpg?t=1656709679\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}