{
    "AppID": 673480,
    "Name": "Timbertales",
    "Release date": "Jun 12, 2018",
    "About the game": "Quick note from the developer: You would like to play a turn based strategy game without experience any world war scenario again and again? Say no more! Timbertales should be your choice! Timbertales is a fantasy turn based strategy game combined with an unique nature theme, which features forest animals and insects. More races will follow soon. Explore the beautiful nature of Timbertales and prepare for epic battles in the forest! If you are thinking about buying Timbertales please keep in mind that I am a very passionate strategy gamer myself, but a solo indie game developer. This means the campaign is quite short and the game quality itself is far away from triple A games with hours of content. What I like to offer you is a solid turn based strategy game with a very different approach theme and mechanics wise. Best of all you can get it at the price, where I tend to spend more on a coffee to go. Make sure to contact me or participate in the community hub if you have any comments, questions or feedback. I appreciate your feedback a lot and I love to implement new features based on community responses. There is a lot of development ongoing at the moment make sure to follow the progress in the latest announcements. Fractions There are different fractions: Vermin and sylvans. Each fraction consists of multiple heroes, which are very unique in look and feel. They provide unique abilities and fit their own role like range dps, melee dps, support, healer etc. Campaign There is a short story mode, which tells the story of the sylvan. This done with a short tutorial, a prolog and the sylvan campaign it self. Every campaign contains of multiple missions. Vermin campaign will follow soon! Enjoy the exciting story of Timbertales Innovative mission objectives and challenges Master all missions, special achievements Challenges Very unique game mode, draft an army of limited options and climb up a special ranking! You will have to defeat an AI opponent with an increasing skill level. With each win your challenge level will be raised and the opponent will get even stronger as your rewards will! Unique game mode, draft an army of limited options and climb a special ranking! Increase your chance of epic rewards with each victory Special ranking Multiplayer You can compete with your individual drafted army composition against other players. There is a special ranking for ranked games based on an competitive rating. Compete with other players in epic multiplayer battles Create an individual army Gain experience and improve your army Mess yourself with other players in the ranking mode Arena A special challenging game mode. Create an army with limited options and crush your enemies. As soon as you lost 3 times with your army the arena ends and you will receive rewards for your progress. A special challenging game mode to compete with real players Draft an army with limited options and crush your enemies Portraits You can also unlock portraits for your account and showcase them. Spheres A defeated Unit has a special drop chance of an unique type of a sphere. There are heal spheres which can heal your units, critical strike spheres which increases the critical strike chance for several rounds and acorn point sphere which increases your acorn points. Acorn points are the in game currency to unlock features. Maps In challenge and multiplayer mode there will be special maps to play on. These maps provide special optional map objectives. If those objectives are completed different events can happen and will grant you an advantage. Timbertales is inspired by the following games: Battle Isle Battle World Kronos Advanced Wars Battle of Wesnoth Jagged Alliance I wanted to create a game, which has the feeling of classical games I played in my childhood, but with a very unique nature theme and challenging content. Unlike 4x turn based strategy games - You will not have to produce units in Timbertales. It is more focused on a table top strategy game approach, where you have to prepare your army before starting the battle. Every character offer his own abilities and style. You will have the choice for just normal attacking or using very special abilities, like healing, cursing or heavy attacks. More diversity coming soon! For more information please visit Twitter / Facebook and my website :) I am looking forward for your support, feedback and comments.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/673480/header.jpg?t=1634657959",
    "Price": 4.99,
    "Developers": "Rainware",
    "Publishers": "Rainware",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/673480/ss_da76b845ab994503b1e11eb1f054984367f493c9.1920x1080.jpg?t=1634657959,https://cdn.akamai.steamstatic.com/steam/apps/673480/ss_420ad15fd3c7ca83675db069abb367c4e45103f2.1920x1080.jpg?t=1634657959,https://cdn.akamai.steamstatic.com/steam/apps/673480/ss_f2095db2ac199cba4bd9d15fa8f3fa09531cf268.1920x1080.jpg?t=1634657959,https://cdn.akamai.steamstatic.com/steam/apps/673480/ss_fdaf44f8c65611241ea1551595a9579d0e4b1843.1920x1080.jpg?t=1634657959,https://cdn.akamai.steamstatic.com/steam/apps/673480/ss_737443ac03a78f93b796e432b0a703749c80de7e.1920x1080.jpg?t=1634657959",
    "Slug": "timbertales",
    "Meta Title": "Timbertales: Jun 12, 2018, Rainware and Full Overview",
    "Meta Description": "Looking for information on Timbertales? Check out the release date (Jun 12, 2018), developer insights from Rainware, and a complete game summary.",
    "Alt Text Image": "Official header image for Timbertales game - Steam 673480",
    "Canonical URL": "https://gusku.site/game/timbertales",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Timbertales\", \"description\": \"Looking for information on Timbertales? Check out the release date (Jun 12, 2018), developer insights from Rainware, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 12, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rainware\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rainware\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/673480/header.jpg?t=1634657959\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}