{
    "AppID": 1661700,
    "Name": "Tyfortress: Tactical Typing",
    "Release date": "Aug 5, 2021",
    "About the game": "Protect human race last fortress against the robots by typing phrases and single words! Build and evolve towers that will help while you destroy robots by typing their words! Oh, and don't forget... Before that, you'll need to type phrases fast to gather a good amount of resources to build towers! The game has three parts: Harvest (text typing), Build (letter typing) and Battle (word typing). Each wave starts with harvest followed by 3 build &amp; battle cycles that increase difficulty gradually. Survive all 5 waves to save the fortress! At the end of each wave you'll receive a bonus score for spare lives and resources! Type phrases to gather resources that will allow you to build towers later! Gain 1 resource for every 60 characters typed. Achieving the speed goals for that level will multiply your gathered resources up to 3.5 times! The length of the phrases increases each wave as well as the time to type them. There are 20 tower cells to build towers on the field, each with a letter associated. Press CTRL + LETTER, to build/evolve a tower in a specific cell. Each tower/evolution costs 1 resource and lives for 60 seconds or less. Evolving a tower makes them shoot and rotate faster, but it decreases the tower lifetime by 10 seconds. Evolving a tower recover its lifetime. This phase is quick, only 3 seconds to think a bit about your strategy and start building your towers for the upcoming battle. You can build and evolve towers even after the Build phase. Type the word below enemies to destroy them. Don't let enemies get to the lane's end! You can keep building and evolving towers at this phase! More than 5000 words: Our vocabulary counts with almost 5500 words, which are grouped by use in day-to-day life, uncommon words are used in some enemies to make them a bit harder. More than 500 phrases: Our phrases list has almost 550 phrases, in which the game will increase the length of the phrases as you advance through the waves. Phrases from famous books, philosophers and writers like: The Little Prince, Sherlock Holmes, Alice's Adventures in Wonderland, Dracula, Peter Pan, Jules Verne, Jane Austen, Socrates, Aristotle, Baruch Spinoza, and more. 4 difficulty levels! Easy (less than 40wpm), Medium (less than 60wpm), Hard (less than 80wpm), Insane (more than 80wpm). Import your own vocabulary: Import your list of words to play! It only works with English words, it will ignore words with special characters. Disable uncommon words: If you don't want to play with unusual words you can disable them! Never Dies Mode: Keep playing even if you lose. Your score will stop increasing but you can keep training! Waves: 5 waves that mix different enemies with different word difficulty level and with longer phrases. Leaderboard: Fight for the highscore. (Steam Integration) Achievements: 95 achievements to conquer. (Steam Integration) Straight to Action: No running around with lots of texts or customizations that take hours. Just enjoy a single-player campaign full of action, strategy and challenge! Steam Cloud Integration",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1661700/header.jpg?t=1635534690",
    "Price": 0.99,
    "Developers": "Sensen Games",
    "Publishers": "Sensen Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1661700/ss_8f14c72c027bc368192f4fa3b2684300fd0d6bb4.1920x1080.jpg?t=1635534690,https://cdn.akamai.steamstatic.com/steam/apps/1661700/ss_923e55e88f7176fcfc1c1c915fe55a5b979a9332.1920x1080.jpg?t=1635534690,https://cdn.akamai.steamstatic.com/steam/apps/1661700/ss_bd99d1f2f079ad0a6c0c792cc51a60db95578687.1920x1080.jpg?t=1635534690,https://cdn.akamai.steamstatic.com/steam/apps/1661700/ss_bc4564c1ce87b4a3e8994d1bbe3473fa904353f8.1920x1080.jpg?t=1635534690,https://cdn.akamai.steamstatic.com/steam/apps/1661700/ss_cd3c05592f4529166b8ec29118791450fcacbef1.1920x1080.jpg?t=1635534690,https://cdn.akamai.steamstatic.com/steam/apps/1661700/ss_63b20c4bac27c7f679318c6db44f6420a4e18cc5.1920x1080.jpg?t=1635534690,https://cdn.akamai.steamstatic.com/steam/apps/1661700/ss_2267323598f131bd4b679418b8ec321b5ea1db33.1920x1080.jpg?t=1635534690",
    "Slug": "tyfortress-tactical-typing",
    "Meta Title": "Tyfortress: Tactical Typing: Aug 5, 2021, Sensen Games an...",
    "Meta Description": "Looking for information on Tyfortress: Tactical Typing? Check out the release date (Aug 5, 2021), developer insights from Sensen Games, and a complete g...",
    "Alt Text Image": "Official header image for Tyfortress: Tactical Typing game - Steam 1661700",
    "Canonical URL": "https://gusku.site/game/tyfortress-tactical-typing",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tyfortress: Tactical Typing\", \"description\": \"Looking for information on Tyfortress: Tactical Typing? Check out the release date (Aug 5, 2021), developer insights from Sensen Games, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sensen Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sensen Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1661700/header.jpg?t=1635534690\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}