{
    "AppID": 843080,
    "Name": "VR Hero Sentry",
    "Release date": "Nov 5, 2018",
    "About the game": "NOTE: ONLY NATIVE SUPPORT FOR HTC VIVE. NO GUARANTEE FOR FUNCTIONALITY ON OTHER VR HEADSETS Inspired by classic RTS hero mods, VR Hero Sentry let's you choose and shape your hero to your unique playstyle, murk monsters and hard bosses, earn experience and spell points to explore your personal spell path and improve your hero stats in a vendor system that offers troops, armory and weapon upgrades. Choose your hero. As a hunter specialized in Fire or Frost, or choose between the arcane powers or Necromancy for your wizard. Choose your loadout of spells for each hero class and upgrade them to fit your strategy Upgrade your heroic beast or train an army of knights and archers. Endless customisable stats, spell- &amp; item strategies. Slaughter melee, ranged and flying hordes and defeat titanic bosses with unique attacks Infinite scalability, gameplay and two outposts to explore. Traditional RPG combat system with aggro, telegraphed attacks and crowd control-effects Challenge yourself with multiple difficulties and leaderboards for competitive gamers And much more..! Find Your Path Explore your favorite build and experience the endless customization in game strategies. Prefer to play glass cannon or tank? Want to rely on your loyal hero beast or invest in building an army; choose whatever style you must to protect Tranquility. As your hero progresses and gains experience, explore play-styles and spells of unique classes. Earn spell points and gold to increase hero stats and enjoy the unparalleled freedom of shaping your own destiny. Discover Your Style Specialize in favorite spells, balance your hero stats or go all in on one hero factor; Tweak your hero with Health, mana, regeneration, spell power and attack damage. Evade, dodge, aim, repeat - Flying, melee and ranged units will challenge your movements and reaction time, as ever-progressing AI and deep aggro system require strategic positioning. The infinite gameplay invites you to improve your fighting over time by experimenting and refining strategies always striving to beat your personal best. But you'll not only be battling your own personal best - we invite every competitive player to seek fame and stardom at the top of the leader board! Video, Audio &amp; Gameplay Options Left-hand support is included. To ensure that all machines and people can experience VR Hero Sentry, you'll find a lot of video &amp; audio settings to be tweaked for personal preference. Furthermore, gameplay options such as AI health canvases can be enabled and disabled, to increase immersion or whatever reason you may have. Forged by fire, the Fire Hunter masters fiery spells of high bursts and explosive power. The Ultimate Spell, a mighty serpent of fire, will annihilate enemies. Has a tamed fire wolf to fight along his side. Fire Hunter Spells : Fire Blast: Explodes on impact, dealing damage to all nearby enemies Fiery Grounds: Fire from below scorches nearby enemies over time Multishot: Up your firepower with 3-7 arrows Dragon’s Breath: Call upon a Dragon of fire to devour your enemies, dealing massive blast damage Dire Wolf: Summons a Dire Wolf to aid you in combat Icy crystals run in the veins of the Frost Hunter, specializing in the handling the power of ice. A powerful hail storm freezes enemies to death, when using the Ultimate Spell. Has a tamed frost wolf to fight along his side. Frost Hunter Spells: Absolute zero: Freezes and deals damage to all nearby enemies Permafrost: Slows and deals damage over time to all nearby enemies Multishot: Up your firepower with 3-7 arrows Hailstone: A frozen boulder comes crashing from above, freezing and dealing massive damage to all nearby enemies Dire Wolf: Summons a Dire Wolf to aid you in combat Mastering mysterious spells, Arcane Wizards use orbs, missiles and mana pools to destroy approaching enemies. Has a loyal hunting owl to damage enemies and a trained a magical arachnid companion. Arcane Wizard spells: Arcane Shot: A throwable orb dealing damage to all nearby enemies Mana Pool: A throwable orb damages and drains Mana from all nearby enemies Arcane Missiles: Launches 3-7 explosive arcane charges Orbiting Arcane: Launches 3-7 orbiting arcane charges Arachnid: Summons a Venemous Spider to aid you in combat The dark powers of the underworld aids the Necromancy Wizard who use blast damage and lifedrain to slay enemies. Has a loyal hunting owl to damage enemies and a trained undead arachnid companion. Necromancy Wizard spells: Dark orb: A throwable orb dealing damage to all nearby enemies Lifedrain: A throwable orb damages and drains Health from all nearby enemies Orbs of Death: Launches 3-7 explosive dark charges Raise Undead: Dealing massive damage to all enemies in a large Radius, Undead rises from dead corpses Arachnid: Summons a Venemous Spider to aid you in combat",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/843080/header.jpg?t=1574451400",
    "Price": 0.0,
    "Developers": "Refocus Solutions",
    "Publishers": "Refocus Solutions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/843080/ss_84d29cac1ba3663fd721dc624d1dcc01c01aa5d2.1920x1080.jpg?t=1574451400,https://cdn.akamai.steamstatic.com/steam/apps/843080/ss_35c1f4c8105e0052cbd292bfaf0d9b1f93dbefa8.1920x1080.jpg?t=1574451400,https://cdn.akamai.steamstatic.com/steam/apps/843080/ss_eaefce4467ab24efe7fcf931862f7e80f851f62a.1920x1080.jpg?t=1574451400,https://cdn.akamai.steamstatic.com/steam/apps/843080/ss_3bcec1b2973ffe68093d320baa3e58910596a4fe.1920x1080.jpg?t=1574451400,https://cdn.akamai.steamstatic.com/steam/apps/843080/ss_efe197aac63c26347331cd8760cf8a5c0e0cb00e.1920x1080.jpg?t=1574451400,https://cdn.akamai.steamstatic.com/steam/apps/843080/ss_1e00c76fa3f0483c4db87e59e8b871d7a6797903.1920x1080.jpg?t=1574451400,https://cdn.akamai.steamstatic.com/steam/apps/843080/ss_c80aa5539173218445f95d9f2dbbd0fcc5a97c4f.1920x1080.jpg?t=1574451400,https://cdn.akamai.steamstatic.com/steam/apps/843080/ss_a8e08552d75bdef2cbfb5d2b7e90cf38d0a14f04.1920x1080.jpg?t=1574451400,https://cdn.akamai.steamstatic.com/steam/apps/843080/ss_da7ba217f3e10f2b8cf0d1e1456a0fc29b424eaa.1920x1080.jpg?t=1574451400,https://cdn.akamai.steamstatic.com/steam/apps/843080/ss_2d3c60ef2441bfce1b6b835a389475ae133955fd.1920x1080.jpg?t=1574451400",
    "Slug": "vr-hero-sentry",
    "Meta Title": "VR Hero Sentry: Nov 5, 2018, Refocus Solutions and Full O...",
    "Meta Description": "Looking for information on VR Hero Sentry? Check out the release date (Nov 5, 2018), developer insights from Refocus Solutions, and a complete game summ...",
    "Alt Text Image": "Official header image for VR Hero Sentry game - Steam 843080",
    "Canonical URL": "https://gusku.site/game/vr-hero-sentry",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VR Hero Sentry\", \"description\": \"Looking for information on VR Hero Sentry? Check out the release date (Nov 5, 2018), developer insights from Refocus Solutions, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 5, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Refocus Solutions\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Refocus Solutions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/843080/header.jpg?t=1574451400\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}