{
    "AppID": 1872740,
    "Name": "你画我拼You draw I puzzle",
    "Release date": "Feb 21, 2022",
    "About the game": "About the game Hello, everyone, 'You draw I puzzle' is an interesting painting jigsaw puzzle casual game, you can drag the graphics fragment step by step to create a complete picture, you can also draw your favorite works, cut into interesting fragment, let other players to challenge your imaginative design. In a nutshell, it's a drawing version of the game level editor. It's not too hard. It's perfect for passing the time. There are already over 100 'official levels' in the game, and you can also challenge other players from around the world to draw your own levels. Of course, it's fun to draw your own levels, so I encourage you to try them out! Currently supported features: Play over 100 official levels Play other players' levels Create your own level Choose different textures when creating levels Three levels of difficulty: 12x10, 18x14, and 24x20 Sort by popularity, latest, play record, etc Uncompleted levels are shown in grey Give a like Collection Leaderboard of completion time The number of levels played worldwide and the pass rate Supports simplified Chinese, traditional Chinese, English, and Russian About me I'm a game developer and I want to make fun games. 'You draw I puzzle' is the first game I tried outside of work and will always be free to play. Indeed, at the beginning, I referred to PixelCraft, a mobile phone game, which is very interesting. But somehow I couldn't open his 'My Level' and 'Artist' screens, and I still don't know what they looked like, so I designed them myself and added some new gameplay features. I was the only one to make this game. I only knew how to write code, but I was not good at art, game design and operation and publicity. However, I will try my best to improve the game and fix the bugs so as to bring you a better game experience. At the same time, I will accumulate experience for the game I want to make next. Thank you for your understanding and support. Next, I would like to add some innovative gameplay to the game, such as: Rotate the fragment randomly to increase the difficulty Added multiplayer matchups and timed challenges Added playback of other players' play sessions Improved editor features to make level building easier If you have better suggestions or ideas, feel free to leave a comment. Have fun!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1872740/header.jpg?t=1645454421",
    "Price": 0.0,
    "Developers": "碎片纪元工作室",
    "Publishers": "碎片纪元工作室",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1872740/ss_07be3a0c89e62d051ef6fa29f8fb0eb5d3bb5688.1920x1080.jpg?t=1645454421,https://cdn.akamai.steamstatic.com/steam/apps/1872740/ss_1f12d7353fec45f1d163e35f5c61889f722a281f.1920x1080.jpg?t=1645454421,https://cdn.akamai.steamstatic.com/steam/apps/1872740/ss_55c652f8d57f74ab3e71116647bd4a3a62da04fd.1920x1080.jpg?t=1645454421,https://cdn.akamai.steamstatic.com/steam/apps/1872740/ss_750c3d9c652079d541d8abb161a75e15208d7796.1920x1080.jpg?t=1645454421,https://cdn.akamai.steamstatic.com/steam/apps/1872740/ss_cc7a6693db60bc6fea31b1430060f0e43bd683be.1920x1080.jpg?t=1645454421",
    "Slug": "you-draw-i-puzzle",
    "Meta Title": "你画我拼You draw I puzzle: Feb 21, 2022, 碎片纪元工作室 and Full Ove...",
    "Meta Description": "Looking for information on 你画我拼You draw I puzzle? Check out the release date (Feb 21, 2022), developer insights from 碎片纪元工作室, and a complete game summary.",
    "Alt Text Image": "Official header image for 你画我拼You draw I puzzle game - Steam 1872740",
    "Canonical URL": "https://gusku.site/game/you-draw-i-puzzle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u4f60\\u753b\\u6211\\u62fcYou draw I puzzle\", \"description\": \"Looking for information on \\u4f60\\u753b\\u6211\\u62fcYou draw I puzzle? Check out the release date (Feb 21, 2022), developer insights from \\u788e\\u7247\\u7eaa\\u5143\\u5de5\\u4f5c\\u5ba4, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u788e\\u7247\\u7eaa\\u5143\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u788e\\u7247\\u7eaa\\u5143\\u5de5\\u4f5c\\u5ba4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1872740/header.jpg?t=1645454421\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}