{
    "AppID": 2095300,
    "Name": "Breakout 13",
    "Release date": "Jan 8, 2023",
    "About the game": "Like unattended weeds, unguided teenagers grow wild. Strapped onto an electrotherapy machine, they are treated as patients by the rest of the world. Their passions are not comprehended and left unanswered. Isolated from the outside world by a cold gate, they become an island in the middle of the dark ocean. Set in the early 21st century, it's a story about a group of stray teenagers in a behavior correction institute. This game is an adaption of Mysteries of Fence from 66RPG. The player will play as the main character, a rebellious teenager who is a game genius but ends up in a behavior correction institute. Learn to survive there while making a series of choices. Investigate in the dark to expose the secrets and conspiracies. Work with your friends to overcome every obstacle on the way. In the end, you will determine the future of the correction institute. The player will experience multiple interactive patterns, including branching storylines, QTE, emulated interaction, clue collection, drawing conclusions from multiple deductions, real-time bugging, multiple-camera surveillance, room escape, and electric shock. In the game world, you are a master. In the real world, however, people call you a troubled teenager. Your families don't understand you, so you're sent to a behavior correction institute, which claims to have cured and saved countless teens like you. In the name of gratitude, you will go through a series of treatment methods in order to 'transform' you, including verbal abuse, corporal punishment, confinement, beating, and electrotherapy in Room 13. Escape , if you have the agility; Investigate , if you can find the concealed truth; Scheme , if you can win your friends' trust; Go home , if you are certain about your choices. Facing all the challenges, not only your fate, but the future of your friends and this correction institute are in your hands. 'Leaving here is not enough. The fear will haunt me for the rest of my life. I must expose his evil deeds. That's the only way we can truly go home.' Captivating Plots - Cinematic visual and audio effects bring you an immersive experience. Delve into the 'transformation' plan, and uncover what's hidden beneath the correction institute. Branching storylines - Hundreds of branches lead to eight primary endings with hidden plots throughout the story. Make difficult decisions, and set foot on the 'Path of Hero'. Frenemy - Are they friends, or enemies? Build relationships step by step, which may unlock the assembly of an incredible team. Your Special Treatment - In Principal Yang's Room 13, say what you want to say, what you should've said, and what you didn't get to say, and feel the 'mind-twisting' light and electricity. About us ALT Lab is an indie game studio dedicated to creating interactive story games. We believe in the power of stories. And we hope to make stories marked by our generation's characteristics known through various means and platforms. A little more to say Being misunderstood seems inevitable for gamers of our generation. If there's any story that can express our feelings, this should be it. Reality is sometimes crazier than stories. Before we started to develop this game, we spent a lot of time doing research and interviews on schools and institutes which claimed to specialize in curing Internet addiction. We were stunned by the absolute absurdity in the real world that spawned the malicious intent of fraudulent institutes, the misunderstanding of parents and society, and the fact that when we were young, we didn't really know how to express ourselves properly. It's our sincere hope that this game will provide a chance for more understanding. We came across many obstacles and challenges in the two-year development. Although affected by the pandemic, we moved around a lot and managed to finish the shooting. We made multiple adjustments and updates before releasing the final version, because we were keenly aware that the theme of this game is unique and significant. We held ourselves to the highest standard, trying to present it in a way that lives up to our original aspiration. It's an honor to bring you this game. We hope children and their parents can understand each other, and treat each other in a more caring and loving way.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2095300/header.jpg?t=1673256588",
    "Price": 8.99,
    "Developers": "ALT Lab",
    "Publishers": "ALT Lab",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2095300/ss_439b65292c7c4bb059d26b53839910cedfb5e5ff.1920x1080.jpg?t=1673256588,https://cdn.akamai.steamstatic.com/steam/apps/2095300/ss_786aedad0193532b65c3e20be5bc3652ac48eb9b.1920x1080.jpg?t=1673256588,https://cdn.akamai.steamstatic.com/steam/apps/2095300/ss_b18132920f118e78e19ce3e1eb0df74dc91c5600.1920x1080.jpg?t=1673256588,https://cdn.akamai.steamstatic.com/steam/apps/2095300/ss_5cf9633bc2a0e6c450af741a1621a0deeddb99f0.1920x1080.jpg?t=1673256588,https://cdn.akamai.steamstatic.com/steam/apps/2095300/ss_7f483519a014249b9c23eb98a04f72b766243cb8.1920x1080.jpg?t=1673256588,https://cdn.akamai.steamstatic.com/steam/apps/2095300/ss_ffa025d9880b2755074ce27802a385c976a0f412.1920x1080.jpg?t=1673256588,https://cdn.akamai.steamstatic.com/steam/apps/2095300/ss_295b2cc29958304cf5e16ba36dc2e888e64359d9.1920x1080.jpg?t=1673256588,https://cdn.akamai.steamstatic.com/steam/apps/2095300/ss_428e4d73a5825d73eaad330d3852c358df7fe4f5.1920x1080.jpg?t=1673256588,https://cdn.akamai.steamstatic.com/steam/apps/2095300/ss_16400571805a131e8f832495503babadebd2f9ee.1920x1080.jpg?t=1673256588,https://cdn.akamai.steamstatic.com/steam/apps/2095300/ss_952336324e23385f33b5423daadbc63c54a84be8.1920x1080.jpg?t=1673256588,https://cdn.akamai.steamstatic.com/steam/apps/2095300/ss_4c94241e65841866821cf53817164b16c36038f8.1920x1080.jpg?t=1673256588,https://cdn.akamai.steamstatic.com/steam/apps/2095300/ss_2e8b15ea0a5b622a146e283d7fc7f5de65286509.1920x1080.jpg?t=1673256588,https://cdn.akamai.steamstatic.com/steam/apps/2095300/ss_8e6224a1409f9a2a6056a7e1ddcb44f4e2335cbe.1920x1080.jpg?t=1673256588",
    "Slug": "breakout-13",
    "Meta Title": "Breakout 13: Jan 8, 2023, ALT Lab and Full Overview",
    "Meta Description": "Looking for information on Breakout 13? Check out the release date (Jan 8, 2023), developer insights from ALT Lab, and a complete game summary.",
    "Alt Text Image": "Official header image for Breakout 13 game - Steam 2095300",
    "Canonical URL": "https://gusku.site/game/breakout-13",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Breakout 13\", \"description\": \"Looking for information on Breakout 13? Check out the release date (Jan 8, 2023), developer insights from ALT Lab, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 8, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"ALT Lab\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ALT Lab\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2095300/header.jpg?t=1673256588\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}