{
    "AppID": 2140680,
    "Name": "Code R.U.B.I.K.",
    "Release date": "Jan 12, 2023",
    "About the game": "Welcome to Round-and-Units-Based Intelligent Kits, trainee supervisor! This time you are tasked to help a simulated company to find ways to maximize income (or, energy). Deploy and move units, choose proper commands and policy, and do whatever else to expand the company, and collect as much income as possible before turns burn out. Remember, put the right units into right cells, and there will be income. It’s just that easy. Key features: 2D Rubik Cube-like map : Units only moves in columns or rows, so plan your every single move carefully. Race with time : earn energy to expand, expand to earn more turns, and spend turns to earn more energy, before the inevitable end. Randomized strategy : the cells reshuffle every turn! So every turn is a brand new challenge to you. Exploit units, commands and policies properly, because every move counts. Unlock new features : expand or finish certain challenges to unlock new unit, new commands, new policies, and even more! Are you ready? Note: Please be aware that no life faces life danger in the simulation. Attachments: Attachment-A List of all units (click to view) Attachment-B List of all commands (click to view) Attachment-C List of all policies (click to hide) Attachment C-1 Ship: Regular Pentahedron (Call Sign NRPS001) Crew: 4 Departure Port: Outpost Station 3, Space Colonization Authority of E.C.S.T.A.S.Y. Load: Experimental Space Capsule Assemblies Mission: Various Sample Collection Logbook D -3day 10:00 AM Navigator The Regular Pentahedron is hovering over the waters. Heading to our predetermined so-called target, at the speed of 1% millilightknot. Estimated arrival time: 15 hours. We have 77.5% energy left. All crew stable and well. I called it waters because it is now boiling like a glass of water with too many effervescent tablets. Through the porthole I can see countless lighting bubbles pop up and expand and crack and vanish in the waters, the 2-dimensioned space. No light escape from areas with no bubbles, they are dark as hollows, but bubbles release light towards us, who observes from a third dimension, and the light beams are just like hairs flowing in water. I could feel the heat from the bottom of our ship. So beautiful are the bubbles, they each has their own inner structures, unique, like snow flowers. But they crack too rapidly that I couldn’t see clearly. All I know is that all bubbles are square, so are their inner structures. I lost my words. I questioned captain if that B in Code: R.U.B.I.K. stands for bubbles, but SP refused to answer me saying that it was a secret. I bet SP doesn’t know it refl. Logbook D -2day 03:16 AM Captain Arrived at predetermined location Gamma at 01:00 AM. 77.4% energy left. Initiated Whole Ship Dimensional Reduction Operation. Estimated finish time: 12 hours. According to our transportation agreement, we woke up the Experimental Space Capsule Assemblies Manager AI at 02:45 AM. Ash has now taken over the load. She is now ready to deploy the Random-Updated Bootstrapping Iterational Knots. All crew stable and well. Our navigator spends too much time staring at the knots. [Speech Logbook] Doc: All Rapid Deployment Units’ vital signs stable. Breathing, I mean. Sound sleeping, in their capsules. Those colonization company employees look like clones in uniforms, especially when they all wear a same kind of smile, or grin. F**king creeps me out. I don’t know about the slimes’ vitals, they still alive I guess. I don’t care about the Intelligent Modules. Eng: All Intelligent Modules stable——meaning, all load units stable. Everything is so good, that if Ash has an unreported bomb hiding in the assemblies, she can launch it right away. Doc: Relax, my brother. Eng: Since we are at least 4 weeks from the nearest space port, wow! Doc: Relax! We are here to investigate a 2-dimensional world nested in our universe, not to blow anything up. Eng: It’s not your first day at work! You—— [Speech Logbook finish] Logbook D -1day 02:30 PM Navigator The light beams grew longer and longer and stretched out beyond the ship, as they became thinner and thinner. After the dimensional reduction ended, a Manipulator Arm has reach out and poked its nose into the waters, to catch the bubbles I guess. The arm’s projection in 2-dimensional space looks like a big square. Cap now locks refl. In the top habitation cabin, where dimensional gradient is higher. To be honest, I can’t see what’s wrong with being a little flat. 74% energy left. All crew flat, stable and well. Logbook D day 02:14 PM Navigator We did it! Ash caught one bubble! She put it on monitor, so that I could finally see the bubble’s inner structures——or, AI re-colored inner structures——clearly this time. We stare at the monitor as if it’s a new born baby, while the bubble roars in the Electromagnetic Cage back in the assemblies. We are all excited. Its inner structures are also made of squares. At first there is 1, then 4, then 9, and so on, like a checkerboard, but the cells are red or green. There are—— [Speech Logbook] Eng: Speech Logbook is quicker. It’s Ash who is operation. It’s always her. And she does not response. [Loud metal crack] Nav: What is that noise? Every time Ash deploys——look, she’s deploying units again. Doc: But the cells are all occupied? I thought there can only be 1 unit in each cell. Eng: I guess that’s why we heard the noises. [Machine Clanking] Eng: Looks like our units can only move in rows or columns. Doc: She’s trying to move unneeded units out of boundary......to make room. Nav: That’s not gonna happen. The units just shows up on the opposite boundary. [Loud noise] Doc: Fuck! Some one tells Ash! Eng: I told you she——again! Hold your position! [Loud noise] Nav: Look, the cells......they reshuffled. [Loud metal crack] Doc: Ash, can you hear me? Ash? Cap, can you please come over bridge? I believe Ash is being too dangerous here. Eng: She does want to blow the whole place. Doc: Captain. Nav: Cap. [Machine Clanking] Cap: On the contrary, Eng, she is delaying an explosion. [Loud noise] Eng: By turning the place upside down? Cap: Well, imagine a baby universe, newly born from a big bang, expanding swiftly, like a gas balloon. But if expanding too fast, it wouldn’t be able to maintain itself. But if you release some tension, some energy from inside, the expanding could be slowed down, then we get a balloon which expands steadily while leaking. [Loud metal crack] Nav: you mean, the bubbles? Cap: Baby universe. In 2 dimension of course, so it looks like bubbles rather than balloons. [Machine Clanking] Eng: But What does this have to do with colonization? Cap: Ash is not tasked to colonize, she is testing energy extractions from R.U.B.I.K.. Nav: We......capture baby universes from 2 dimension, and trap them in 3 dimension, to, drill energy from them? [Loud noise] Eng : I knew! Cap: Don’t panic. We are safe, according to the materials I received. Doc: Captain, it is still my, our wish that you send direct order to Ash and command her to stop her reckless behavior. Cap: Sorry. As a matter of fact, my rank isn’t high enough to command Ash. [Loud noise] Nav: It cracked! Eng: Explosion! [Alert] Eng: Pressure loss! Engine—— [Speech Logbook out] [Speech Logbook] Eng: ......we have spare engine, we have spare energy, spare oxygen, yeah......but we don’t have spare engine of spare engine. One more explosion and we’re all finished. Just don’t forget we have to raise the whole ship’s dimension before we leave! Doc: I know, I know. Ash? Can you hear me? Ash. All I want is to check the Rapid Deployment Units now. Cap: Force enter if she doesn’t response. Ash: I’m sorry Captain, you are not permitted to enter load at unspecified time period. Cap: Permission? I’m coming in, either way. Ash: I’m sorry—— Cap: Have your Rapid Deployment Units managed to retrieve before the explosion? Ash: Captain, I must clarify to you again, that what were deployed into R.U.B.I.K. during the testing are, and will be merely 2-dimensional projections of our units, rather than themselves, and no life form has faced life danger—— Doc: Then let us in! Ash: I must reject. [Loud metal crack] Cap: What is that noise? What are you doing Ash? Doc: She captured another bubble! [Loud noise] [Speech Logbook out] Logbook D 1day 01:11 AM Navigator Good news is that we took back control over load. Bad news is that Ash blew the whole ship up. We worked ourselves to the bone to maintain the ship’s position. But the dimensional gradient is too high here. Something has happened to our bodies. But we can’t waste our energy to re-adjust position. We still have spare energy sufficient for 3 days. Rescue message broadcasted. Wait. [Speech Logbook] [Continuous electrical noise] Doc: All gone. Only empty capsules left. Eng, what have you found? Eng: Several Intelligent Modules left. Nav: What about spare energy? Eng: Ash must have used all energy. Nav: No energy......we still have to wait for rescue. Eng: F**king freezing cold here. Doc: Take a look at the labels on inner capsule: Fortress, Knight, Hermit, Bomb, Miner......That’s my first time seeing this......anybody know what is the number in the upper right corner? Some......kind of capacity? Ability? Nav: All I know is that higher the number is, louder the noises the unit make. Doc: “Ratio......Scaled......R.U.B.I.K. Energy Good Conductor Score”, I’d call it ability nevertheless. Cap: Alright. At least we know Ash didn’t hide anything else from us. Let’s head back to bridge. [Speech Logbook finish] Logbook D 2day Enter log time here Enter log recorder here [Speech Logbook] Eng(whispering): ......I can jump start spare engine, of course. But that requires a lot of energy. A LOT. Not enough even we shut down that electromagnetic cage. Cap: But you are 120% sure you can jump start that spare engine? With enough energy? Eng: Easy as riding bikes. OK I know what you mean......I can rearrange the ship’s energy distribution, I can use the energy to control the Manipulator Arm, I can bypass Ash to capture a bubble for us. No problem. The main issue is—— Cap: There are Intelligent Modules. I’ll deploy them, collect enough energy for us, raise dimension and jump start the engine. And then we leave. That’s all. Nothing else. Cap: I checked Ash’s console. Green cells release energy, red ones absorb. Deeper the color, higher the amplitude. All I need to do is to move the units to appropriate cells, and cells will release or absorb energy through them. Simple. Oh, right, negative unit abilities reverse releasing and absorbing. That’s all. Just like a game. Eng: Alright. Cap: There are countless bubbles beneath us. Theoretically we could play countless bubble games. Eng: The main issue is, I’m afraid, that our remaining energy is only enough for one game. Only one shot. Cap: Okay. Cap: Don’t wait until we don’t even have enough energy for one shot, then. [Speech Logbook finish] Logbook D 3day Enter log time here Navigator Explosion just threw us higher, and upside down. All Intelligent Modules lost in action. We’re still alive. Nothing more. My bones hurt. [Speech Logbook] Nav: Look at the beautiful boiling waters beneath——or above. Numberless universes, emerging, expanding, and vanishing, every ksana, without a word. How fast do you think time flows there? Is it possible for high-intelligent civils to appear in some universes, just like us? Nav: I begged Cap, the other day, that once we back, instead of tell them everything, we just make up a story. “We found nothing but celestial storms”, and “don’t send ships anymore”. Eng: Hug. They don’t need building oil drilling platforms any more. Not even Fusion Reactors. [Speech Logbook finish] Logbook D 4day Enter log time here Enter log recorder here [Speech Logbook] Nav: Come on, say something. Eng: Damn Co-op, f**k it. I f**king knew. There is no good having a high authority AI with a f**king secret mission on board. Shit, my head aches. Cap: Doc? Doc: I have some pain killer pills. And some anti-hypertensives. Eng: Only shitheads eat pain killer pills. I still want my brain to function. Cap: Chill, lay yourself down. It might slow down the internal bleeding. And we all took some pills, you might as well have some. Eng: The ship is drifting, slowly, but my guts can feel it. Drifting higher and higher. Feels like a submarine, diving into the deepest trench. The explosion aftermath did not disappear. It got into my body. Nav: Believe me, I’m more that certain that our ship is steady. Doc: I wonder if it would be better if we are all K.I.A. in the explosion? Nav: Nice thought, but could you make it more positive? Doc: Maybe we should reduce ourselves into total 2 dimensional creatures and all hide into some random bubble we capture. I think we would survive longer this way. Nav: You see, this is more positive. Doc: Come on, save your words. Eng: Such a nice thought, I wonder if there are 2 dimensional mosquitoes there. Cap: Flee into bubbles, we shall not be found by rescue anymore. Guys, we don’t have choices now, but we could still have hope. Let’s just be faithful for a while. Eng: Hey, I can catch a new bubble for y’all. No bullshit. Nav: No, there is no energy for us to use. Eng: Yes there is. We all put on spacesuits, then shut down the whole ship’s life-sustaining system, and re-distribute the energy to manipulator...... Doc: You are talking big. Eng: Yeah. That’s not enough. We also need spacesuits’ spare batteries. Doc: All-in, hug? Eng: Right. Jet the compressed oxygen out to adjust position. Doc: Do you think we can find a nice big 2 dimensional french meal in the bubbles? Cap: Everyone. Nav: Perhaps we could find 2d livings there. Paper people. Cap: Everyone. Put on your spacesuits. Nav: What? Cap: You heard Eng, we still have one more shot. Cap: We capture a new bubble, deploy a R.U.B.I.K. on it, and......start a new game. We will collect energy this time. Nav: Cap, we have lost all units. Nothing to deploy. Cap: I’ll deploy myself. Doc: No way! Cap: Listen up. Navigator takes over command after my deploy. Remember, Nav, there is a turn countdown at the upper right corner of your monitor panel. The bubble explodes after turns counts down to 0. But if you collect enough energy before that, the bubble would expand instead of explode, which buys you extra turns. Collect as much as you can before turns burn out. Cap: You only have time to commit 1 command after every cell reshuffle, unless the bubble expands, which gives you a chance to commit a long term command, or policy, as Ash calls it. Nav: Captain! Cap: Don’t detour if you could go through boundaries. Observe the panel. Skip commands you don’t need. Eng: I like it. I like this idea. Let’s get started. Doc: It might as well to deploy me. Please. Cap: No, I’m the commander, I’m responsible......for the whole thing as well. Navigator, set coordinates right away. Engineer, get the manipulator ready. Doc, prepare 4 sleeping capsules. 4. We go home. [Speech Logbook finish] Logbook D5 day 12:00 PM Ash Mission accomplished. Secret energy source enabled, auto navigation initiated. Estimated return time: 4 weeks. Attachment C-2 Based on data retrieved from mission ship Regular Pentahedron, it is now clear that exploitation of R.U.B.I.K. energy resources provides fruitful profit margin. What is more inspiring is that, by far, the platform deployment and exploitation testings has accomplished BEST goals: Beneficial, Efficient, safe, and trouble-less. Processes of Single Console Application with space mining drones will be further examined before large scale profit activities. It is noticeable that although highly automatization has been achieved in mining processes, it is still of vital importance to include dense human decision-makings in specific mining operation flows, due to the fact that the singular knot profit ceiling expectations depend highly on qualities of decisions over complex problem-solving situations, in which human brains perform better than trained AI. We suggest Brain Vat Department provide adequate computational power assistant to our automatic mining drones. ...... ...... ...... “Why don’t you disguise your flows as some sort of video games and make the brains in flesh do the work? Brain Vat Department has other import projects to attend to. ——Administrator of Brain Vat Department” “Agreed.——E.C.S.T.A.S.Y. CFO”",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2140680/header.jpg?t=1673570683",
    "Price": 22.49,
    "Developers": "Egg Fried Rice",
    "Publishers": "Egg Fried Rice",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2140680/ss_7a2aff37bd75b5d8ea969c08fbd8a1acc4faa0fe.1920x1080.jpg?t=1673570683,https://cdn.akamai.steamstatic.com/steam/apps/2140680/ss_47952414f9371d6a88443f3c21f00539986df853.1920x1080.jpg?t=1673570683,https://cdn.akamai.steamstatic.com/steam/apps/2140680/ss_a82802afa7279bfacff5954b3d5001a37825bd96.1920x1080.jpg?t=1673570683,https://cdn.akamai.steamstatic.com/steam/apps/2140680/ss_141894a0a75d990ba415e04e31f275df6820b922.1920x1080.jpg?t=1673570683,https://cdn.akamai.steamstatic.com/steam/apps/2140680/ss_b1695dd0fe6f2cecd77ad23b333a2e6b7803b860.1920x1080.jpg?t=1673570683,https://cdn.akamai.steamstatic.com/steam/apps/2140680/ss_44433664e3c41dfac178b21378c30c104c09cf7c.1920x1080.jpg?t=1673570683,https://cdn.akamai.steamstatic.com/steam/apps/2140680/ss_422d32f20a6960e4227210ed5f517af8a8eb3fae.1920x1080.jpg?t=1673570683,https://cdn.akamai.steamstatic.com/steam/apps/2140680/ss_66d4b378a3114e2fbdaf451b500382137127f05d.1920x1080.jpg?t=1673570683,https://cdn.akamai.steamstatic.com/steam/apps/2140680/ss_4733d095bef83a0a7adbe2135223fd23feec79f8.1920x1080.jpg?t=1673570683,https://cdn.akamai.steamstatic.com/steam/apps/2140680/ss_6a9b2c14145558ac5a5ebca701fcaf7f24321705.1920x1080.jpg?t=1673570683",
    "Slug": "code-r-u-b-i-k",
    "Meta Title": "Code R.U.B.I.K.: Jan 12, 2023, Egg Fried Rice and Full Ov...",
    "Meta Description": "Looking for information on Code R.U.B.I.K.? Check out the release date (Jan 12, 2023), developer insights from Egg Fried Rice, and a complete game summary.",
    "Alt Text Image": "Official header image for Code R.U.B.I.K. game - Steam 2140680",
    "Canonical URL": "https://gusku.site/game/code-r-u-b-i-k",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Code R.U.B.I.K.\", \"description\": \"Looking for information on Code R.U.B.I.K.? Check out the release date (Jan 12, 2023), developer insights from Egg Fried Rice, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 12, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Egg Fried Rice\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Egg Fried Rice\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2140680/header.jpg?t=1673570683\", \"offers\": {\"@type\": \"Offer\", \"price\": 22.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}