{
    "AppID": 2193970,
    "Name": "DanceXR Pure",
    "Release date": "Jan 6, 2023",
    "About the game": "DanceXR Pure is an universal character model viewer and motion player that supports PMX(MMD) / XNALara (XPS) models and VMD / BVH motion formats. This Pure edition packs advanced features that focus on dance motion playback and VR experiences. Unlike other MMD players DanceXR Pure allows almost any motion to play on any model without any manual tweaking or bone adjustments. It doesn't matter whether the model has IK bones or which standard pose it uses, models &amp; motions are adapted automatically on the fly by our unique motion system to ensure the maximum compatibility. There are also tons of built-in features to enrich your experience and make your favourite characters more life-like. * The characters breath, blink eyes naturally and can make eye contact with you. * Included multiple highly customizable procedural (programmatically generated) motions for you to play with. Including catwalk and 2 different dance moves. * Sophisticated shaders and material settings for you to fine tune the look of your model. Out of the box you get subsurface scattering enabled and anisotropy capable shaders to render natural looks of skin and hair. You can also change materials to totally different colors, switch between transparent and opaque modes and even use the glass mode that has light refraction. * 'Outfit' feature to modify the look of your model, this can create effects like stocking, latex, fishnet and so on. * 'Motion Override' to modify motion on the fly to change arm and leg pose and incorporate accessories like hoverbike into the motion flawlessly. Just to name a few. More features are being developed added in each monthly update. Prior to Steam release we have been supported by our lovely community on Patreon for years. To learn more about the past releases and keep an eye on the future developments follow the link down below to our website and YouTube channel. Please note that we do not provide any content that we don't own within the application. By downloading this app you agree that you take full responsibility for the content you use with it and all legal &amp; copyright requirements are satisfied. The developer of DanceXR will not be responsibility for user generated content.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2193970/header.jpg?t=1672997966",
    "Price": 17.49,
    "Developers": "VR Storm Lab",
    "Publishers": "VR Storm Lab",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2193970/ss_defee5a0a16216577fb5626e173be12a0f6d5f9f.1920x1080.jpg?t=1672997966,https://cdn.akamai.steamstatic.com/steam/apps/2193970/ss_0093eb7b57d00491e898de22a44125fdec7bf91b.1920x1080.jpg?t=1672997966,https://cdn.akamai.steamstatic.com/steam/apps/2193970/ss_2e540f8c1b38f0bb7187d0d5adf74f903ec930d5.1920x1080.jpg?t=1672997966,https://cdn.akamai.steamstatic.com/steam/apps/2193970/ss_b5e70220ed6de77016f43e38d9c196324dfb65a9.1920x1080.jpg?t=1672997966,https://cdn.akamai.steamstatic.com/steam/apps/2193970/ss_bf8ea5e96094dda7f8b3777ea93ac7cd699b7922.1920x1080.jpg?t=1672997966,https://cdn.akamai.steamstatic.com/steam/apps/2193970/ss_b9e2e83e23a1a17655b037288c1dfe8b4d21b006.1920x1080.jpg?t=1672997966",
    "Slug": "dancexr-pure",
    "Meta Title": "DanceXR Pure: Jan 6, 2023, VR Storm Lab and Full Overview",
    "Meta Description": "Looking for information on DanceXR Pure? Check out the release date (Jan 6, 2023), developer insights from VR Storm Lab, and a complete game summary.",
    "Alt Text Image": "Official header image for DanceXR Pure game - Steam 2193970",
    "Canonical URL": "https://gusku.site/game/dancexr-pure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DanceXR Pure\", \"description\": \"Looking for information on DanceXR Pure? Check out the release date (Jan 6, 2023), developer insights from VR Storm Lab, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 6, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"VR Storm Lab\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VR Storm Lab\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2193970/header.jpg?t=1672997966\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}