{
    "AppID": 1748300,
    "Name": "Dear Monster",
    "Release date": "Jan 16, 2023",
    "About the game": "A NSFW tale of magic and love between man and monster with art by the famous bara artist Jouvru! Allen is trapped in a mansion with five magical beasts. Will he escape or claim his legacy as a wizard? Magic is real, the pull is strong, and he can't turn away from these gorgeous monsters. Allen graduated university and was headed off to med school. Then a strange letter arrives. He's pulled onto a new path toward a strange mansion filled with even stranger and alluring creatures. Magic is real, the pull is strong, and can't turn away from these gorgeous monsters. Allen thought he had his life all figured out. He just graduated university and was headed off to med school. Then a strange letter arrives from a grandfather he never knew. He's pulled onto a new path toward a strange mansion filled with even stranger creatures. These fantasy beings shouldn't even exist--and yet, they're somehow familiar. Allen has no time for mysteries, but when he tries to leave he realizes he's trapped, and so are the magical monsters! Allen must solve the mystery of his own past while learning magic by 'bonding' to one of the fantasy creatures. Otherwise he'll never get free! An adults only tale of magic and love between man and monster with art by the famous bara artist Jouvru! Will Allen escape the magical mansion and continue the life he planned--or has his entire world been turned upside-down? Featuring Animated 3D Character Sprites Static Sprite Option for Slower Computers Each Love Interest has a Monster Form ! Includes 40 CGs by the Esteemed Artist Jouvru! Four Routes with a Fifth Orc Route Coming After Launch! A Beautiful Original Sound Track of 15 Songs! Over 200,000 Words of Story! Numerous 18+ CGs Throughout! 19 Possible Endings! Numerous Steam Achievements! Press 'v' to Have Dialogue Read Out Loud ​Requires 2.3GHz or greater CPU computer to play with animated sprites. Players with weaker or slower computers can activate an option to play with static sprites. Allen worked hard as a student to please the strict aunt who raised him. He never knew much about his birth family, but never expected a connection to magic. This might explain a lot of strange things that have complicated his life over the years. He just wants a normal life--or so he thought, anyway. Imbriss came to chew gum and kick Allen's grandfather's ass, but the famed wizard is no where to be found. He'll have to settle for Allen's ass instead...and may want to do other things beside kick it. Faeryn has been waiting for Allen for a long time, and seems to know a lot about him. In fact...he seems to be in love with him. But how is that possible when he just met this sweet and kind unicorn today? The sly fox Momo seems nice enough, but has a penchant for trickery and mischief. It even looks like he uses those things to push people away...but why? Stoic and serious, Hikmat talks a lot about death. He claims to be the mansion's gardener, but Allen's never seen plants like these. He can't help but be intrigued, even if Hikmat seems slightly annoyed by him. And yet...why does he let Allen so close if he doesn't like him at least a little? The name's Slagathor. I'm the cook. Looks like Allen will date me after all do to some crowdfunding win. My route will be added after the initial game launch. Other Y Press Games",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1748300/header.jpg?t=1674411004",
    "Price": 26.99,
    "Developers": "Lovenuts,Y Press Games",
    "Publishers": "Y Press Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1748300/ss_da14aac2dad6a82057471e07c790032a572ce9d4.1920x1080.jpg?t=1674411004,https://cdn.akamai.steamstatic.com/steam/apps/1748300/ss_cef4217f29a39198cac78f3fc25e77c22e64626a.1920x1080.jpg?t=1674411004,https://cdn.akamai.steamstatic.com/steam/apps/1748300/ss_3f3a7f3d47ae2c55f013feaf599517dac617c861.1920x1080.jpg?t=1674411004,https://cdn.akamai.steamstatic.com/steam/apps/1748300/ss_162f857d84f1985c250e80a8e31fbc6ec921a75c.1920x1080.jpg?t=1674411004,https://cdn.akamai.steamstatic.com/steam/apps/1748300/ss_6153090eaaed20acd4364ff3cc820558b0842a1a.1920x1080.jpg?t=1674411004,https://cdn.akamai.steamstatic.com/steam/apps/1748300/ss_058d973b8c0bf7178fcdcdac46e01817bacecb31.1920x1080.jpg?t=1674411004,https://cdn.akamai.steamstatic.com/steam/apps/1748300/ss_5d3f95c4c73f8d141487e390bcbdc3731a48ecd3.1920x1080.jpg?t=1674411004,https://cdn.akamai.steamstatic.com/steam/apps/1748300/ss_6063ad6022fe1282c268776f3e05b5b9c96d2f26.1920x1080.jpg?t=1674411004,https://cdn.akamai.steamstatic.com/steam/apps/1748300/ss_f875a37250f1b4ba89c52b19034711895a1692ba.1920x1080.jpg?t=1674411004,https://cdn.akamai.steamstatic.com/steam/apps/1748300/ss_acef19c6fd378ac966b9728c28ac0514de7fa459.1920x1080.jpg?t=1674411004,https://cdn.akamai.steamstatic.com/steam/apps/1748300/ss_4eb8853e0c38a0f735bef1dabe858ddec7e2bd31.1920x1080.jpg?t=1674411004",
    "Slug": "dear-monster",
    "Meta Title": "Dear Monster: Jan 16, 2023, Lovenuts,Y Press Games and Fu...",
    "Meta Description": "Looking for information on Dear Monster? Check out the release date (Jan 16, 2023), developer insights from Lovenuts,Y Press Games, and a complete game ...",
    "Alt Text Image": "Official header image for Dear Monster game - Steam 1748300",
    "Canonical URL": "https://gusku.site/game/dear-monster",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dear Monster\", \"description\": \"Looking for information on Dear Monster? Check out the release date (Jan 16, 2023), developer insights from Lovenuts,Y Press Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 16, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lovenuts,Y Press Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Y Press Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1748300/header.jpg?t=1674411004\", \"offers\": {\"@type\": \"Offer\", \"price\": 26.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}