{
    "AppID": 2233140,
    "Name": "Double Line Confrontation：New World（双线交锋：新世界）",
    "Release date": "Jan 2, 2023",
    "About the game": "Chapter 1 (Slums): When passing through the slums, the plane was interfered by the running dogs and crashed accidentally. He was the only one of the five crew members who survived. When he explored the slums, he found that this place had been occupied by the running dogs, but there would be two mercenaries in the slums to help you attack the running dogs Chapter 2: When the protagonist came to the Middle East, he fainted in the open space due to the lack of food and water. He recalled the training scene at that time. At that time, the two teams (the Whirlwind Team and the Black Horse Team) fought fiercely and would be eliminated if they were careless Chapter 3: Brank wakes up with his strong perseverance and finds that there is a village in front of him. The village is empty, but there are relatively rich materials. It is a lair for running dogs. He has arranged two armed helicopters to help you evacuate Chapter 4: Blanc comes to the search and rescue center, but finds that it has been occupied. The running dogs have done a lot of fortifications here, and cut off the power of the elevator. Only if they kill a blood way can they succeed Segment system display At the beginning of the game, the player's segment will be hidden. The segment will not be unlocked until the player's victory score reaches 300 points. The player's segment will be based on the KDA index. The segment will be improved only when the player plays his level steadily in the battlefield. On the contrary, if the player intentionally dies or deliberately does not kill the enemy in the game, the player's segment will decline. After 300 points, the segment will be graded, and the score will be higher, It means that the player has rich resume and high rank, which means that the technology is excellent at this stage. That's all. The player has too many deaths, and there is a variance in the middle of the segment, that is, the more deaths, the slower the segment will be upgraded Mercenary mechanism There are beautiful merchants in the game map. You can hire soldiers from the merchants. Soldiers will help you attack your enemies. Mercenaries have a separate name. Characters cannot be revived after death. Mercenaries are rich in types. Welcome to experience the game Main features of the game Excellent firearms feel Exquisite production and maps Segment competition mechanism Perfect sound effect FPS feel optimization and solution High picture quality Game features The multiplayer game training ground can train your marksmanship and bunker knowledge to the greatest extent. Come on! the special arms There is no light at night on the battlefield, but our protagonist has a night vision device to see everything in the dark! Mercenaries are your teammates. They have their own names and beliefs. They are trapped in this huge battlefield, so try to evacuate them Evacuate from the evacuation point on the map and get rewards and honors! Development cost Steam deposit (100 dollars)+free space (10 yuan for the official game website server)+purchase of game materials (12300 yuan)=16000+ Game development experience February 5, 2022: Double line confrontation: the sales performance on the harvest day was not ideal, the developers abandoned the original project, continued to write stories, and developed a double line confrontation: New World February 8, 2022: purchase game materials and plug-ins February 15, 2022: start to integrate various materials and optimize BUG May 15, 2022: After three months of development, the game framework and outline have been basically released May 25, 2022: Game developer test July 29, 2022: Square game platform registration shop page December 17, 2022: Trial version of the game will be launched in Steam Mall Q&amp;A Why should games be charged? Because the developer's own economic problems are not sufficient, the development of the game itself is very expensive. In order to earn back the pledged money, we have no choice but to charge the player! (There must be a discount on holidays) In game instructions This is a boring and dramatic first person shooting game Players in the game can upgrade and unlock segments by killing terrorists Players can upload their game data to the leaderboard at any time Players can create a steam room to invite friends to play together (the game client was stuck during the internal test, possibly because the game accelerator was not turned on and the accelerator developer was on the way to contact) The game is extremely hard, and the player's HP is very thin. Don't always think about the hard front. Use the bunker and terrain advantages reasonably to kill the enemy quickly and reach the evacuation point alive The game has six maps of different difficulty and multiple weapons for players to choose Before the game, it is recommended to enjoy the game manual and visit the official website for more information For more game content, please pay attention to the sun god in the pocket of Bili Bili God/ndieova Laosun to play the game or learn about it through the official website (the official website is slow, please wait patiently)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2233140/header.jpg?t=1672983335",
    "Price": 6.99,
    "Developers": "孙神游戏开发",
    "Publishers": "孙神游戏开发",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2233140/ss_be48cbf944c6c8bfc58615377520b79c2e423b12.1920x1080.jpg?t=1672983335,https://cdn.akamai.steamstatic.com/steam/apps/2233140/ss_a1e5a3f22b950de585559c9ff5a99c497244c8e8.1920x1080.jpg?t=1672983335,https://cdn.akamai.steamstatic.com/steam/apps/2233140/ss_0b67d713b1c768dc3d29af411ca72290ffa8a27b.1920x1080.jpg?t=1672983335,https://cdn.akamai.steamstatic.com/steam/apps/2233140/ss_c6fba7187e64ae1e5b32216997683564e4d09180.1920x1080.jpg?t=1672983335,https://cdn.akamai.steamstatic.com/steam/apps/2233140/ss_5fc9dd22b1878abd091e970cfb1dbd0392b7180e.1920x1080.jpg?t=1672983335,https://cdn.akamai.steamstatic.com/steam/apps/2233140/ss_483b0da665eba1b180b5b9a0cbfd1b538b76766a.1920x1080.jpg?t=1672983335,https://cdn.akamai.steamstatic.com/steam/apps/2233140/ss_e0290ef10418d58f8abd5e6ae9e0a486ff0c481b.1920x1080.jpg?t=1672983335,https://cdn.akamai.steamstatic.com/steam/apps/2233140/ss_768fdf522d9567f5a639f1f657195b47aff267a2.1920x1080.jpg?t=1672983335,https://cdn.akamai.steamstatic.com/steam/apps/2233140/ss_d61eae120b3d1e14636a7f7cfebb6f849c62aadf.1920x1080.jpg?t=1672983335,https://cdn.akamai.steamstatic.com/steam/apps/2233140/ss_532b5b20b4cbc6af501fb7984b0563a648b5dbb7.1920x1080.jpg?t=1672983335,https://cdn.akamai.steamstatic.com/steam/apps/2233140/ss_05260688b83376418e8a35c70c67d3927d51ca81.1920x1080.jpg?t=1672983335,https://cdn.akamai.steamstatic.com/steam/apps/2233140/ss_024f9e229c458f0133995e6f8a5bc973445a7705.1920x1080.jpg?t=1672983335",
    "Slug": "double-line-confrontationnew-world",
    "Meta Title": "Double Line Confrontation：New World（双线交锋：新世界）: Jan 2, 202...",
    "Meta Description": "Looking for information on Double Line Confrontation：New World（双线交锋：新世界）? Check out the release date (Jan 2, 2023), developer insights from 孙神游戏开发, and ...",
    "Alt Text Image": "Official header image for Double Line Confrontation：New World（双线交锋：新世界） game - Steam 2233140",
    "Canonical URL": "https://gusku.site/game/double-line-confrontationnew-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Double Line Confrontation\\uff1aNew World\\uff08\\u53cc\\u7ebf\\u4ea4\\u950b\\uff1a\\u65b0\\u4e16\\u754c\\uff09\", \"description\": \"Looking for information on Double Line Confrontation\\uff1aNew World\\uff08\\u53cc\\u7ebf\\u4ea4\\u950b\\uff1a\\u65b0\\u4e16\\u754c\\uff09? Check out the release date (Jan 2, 2023), developer insights from \\u5b59\\u795e\\u6e38\\u620f\\u5f00\\u53d1, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 2, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u5b59\\u795e\\u6e38\\u620f\\u5f00\\u53d1\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u5b59\\u795e\\u6e38\\u620f\\u5f00\\u53d1\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2233140/header.jpg?t=1672983335\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}