{
    "AppID": 2256720,
    "Name": "Elder Trial：Prologue",
    "Release date": "Jan 24, 2023",
    "About the game": "' Elder Trial: Prologue ' is a Free Version of ' Elder Trial '.You will go to the Trial Land left by the Elder Gods to challenge the trial,facing the raging army of monsters,move to escape and survive,kill monsters and level up yourself,create your ultimate ability,become a nightmare for all enemies! Twitter ：@TheAmiiRain Reddit ： / Discord ： FEATURED Customizable Abilities All Abilities can Super Evolution 20 unique Abilities 40 kinds of Super Evolution Seven unique Trials Weird Random Events Powerful Amulets and Weapons Beautiful hand drawn style Lovely and funny characters ... GAMEPLAY Elder Trial is a Rougelike ARPG game with Customizable Abilities . In this game ,each Ability has a variety of Customizable Enhancement Options. You can choose to make Fireball into a FireballUzi with a very short Cooldown,or into a FireCannon with high damage and wide range! Everything will be Customized by yourself! (Requires a bit of luck) You can also Super Evolve your Abilities. Super Evolution will completely change an Ability. For example, Dragon's Breath can only breathe fire in one direction, but after Super Evolution, Dragon's Breath can breathe fire in four direction! Each Ability has two completely different Super Evolutions, what is the other Super Evolution of Dragon's Breath? Go and see for yourself in the game! An ordinary Ability, after being Enhanced and Super Evolved, no one knows how powerful it will become in the end! Give full play to your imagination, create an ultimate Ability, let the monsters of the trial land tremble for you! There are 20 unique Abilities and 40 kinds of Super Evolution in the game (One Ability can be played happily for a year! 20 Abilities can be played happily for 20 years! ) STORY Disasters are approaching, the world need heroes！ In order to deal with the Monster Disaster, you will go to the Trial Land left by the Elder Gods. As long as you can pass the Trial，you will get the Power of Elder Gods! The Trial Land has been deserted for hundreds of years, no one knows what kind of monsters will lurk here... But don't worry, you are not alone on this journey.Nuwa, one of the Elder Gods, will accompany you on the journey.She will chat with you, help you heal, and even guide you pass the Trial. You'll meet many other weird people, how weird is it? Go and see it for yourself in the game! GAME TIPS Try to focus on Enhance one Ability at the beginning, so that you can survive better. If the Health is too low, you can choose 'rest' in Nuwa to recover the Health. The 'Attack Speed' Enhancement Options for DRAGON BREATH ,RAY OF FROST and BLAZE can shortens their Damage Interval, which means they will deal more damage in the same amount of time. FROZON CLONE can deal Collision Damage. The 'Drution' Enhancement Options is more powerful than you think. Put the mouse on the Ability Panel in the lower left corner, it can display detailed information about your Ability, make good use of this feature. Each map has four items, collect these items as soon as you enter the map, and the items will be destroyed when the progress bar is run out. Each Ability can be Enhanced ten times, choose your Enhancement Options carefully. Although some Abilities are useless in the early stage, after many Enhancements, they will become very powerful. Your Attack Range increases as you level up (but not by much) Always pay attention to the distance between you and monsters, Health will be lost faster than you think.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2256720/header.jpg?t=1674807015",
    "Price": 0.0,
    "Developers": "Amii Game",
    "Publishers": "Amii Game",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2256720/ss_b4cc6cc3711486328f0dc0e9ee6363f37c6b23c7.1920x1080.jpg?t=1674807015,https://cdn.akamai.steamstatic.com/steam/apps/2256720/ss_fd53d69c7894312a7beed56899c3370c8a059d6e.1920x1080.jpg?t=1674807015,https://cdn.akamai.steamstatic.com/steam/apps/2256720/ss_1e9a347f63cf3afdc8558369ee2c6f4a6bc3e64d.1920x1080.jpg?t=1674807015,https://cdn.akamai.steamstatic.com/steam/apps/2256720/ss_1ca3a77524140ecbdc82598818185625a5b66b0a.1920x1080.jpg?t=1674807015,https://cdn.akamai.steamstatic.com/steam/apps/2256720/ss_0fb1859f6b5ad5e6be3b9462defc8f7c78e31f55.1920x1080.jpg?t=1674807015,https://cdn.akamai.steamstatic.com/steam/apps/2256720/ss_97419cfa10027d5de37cb03774d086a763a72add.1920x1080.jpg?t=1674807015,https://cdn.akamai.steamstatic.com/steam/apps/2256720/ss_9f77cbf510919b180856bcded00466b23bca4e53.1920x1080.jpg?t=1674807015,https://cdn.akamai.steamstatic.com/steam/apps/2256720/ss_8d314678cf396890bac66dab972c13a2e6212a89.1920x1080.jpg?t=1674807015,https://cdn.akamai.steamstatic.com/steam/apps/2256720/ss_fee0a16ae63f6bb501cb556ced47ef3950b77304.1920x1080.jpg?t=1674807015,https://cdn.akamai.steamstatic.com/steam/apps/2256720/ss_3745a3597ee9138200de880b3822b871f83c5fb8.1920x1080.jpg?t=1674807015,https://cdn.akamai.steamstatic.com/steam/apps/2256720/ss_6d8547c7f09f03e29e72eff3d63807b3a4d83ecb.1920x1080.jpg?t=1674807015",
    "Slug": "elder-trialprologue",
    "Meta Title": "Elder Trial：Prologue: Jan 24, 2023, Amii Game and Full Ov...",
    "Meta Description": "Looking for information on Elder Trial：Prologue? Check out the release date (Jan 24, 2023), developer insights from Amii Game, and a complete game summary.",
    "Alt Text Image": "Official header image for Elder Trial：Prologue game - Steam 2256720",
    "Canonical URL": "https://gusku.site/game/elder-trialprologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Elder Trial\\uff1aPrologue\", \"description\": \"Looking for information on Elder Trial\\uff1aPrologue? Check out the release date (Jan 24, 2023), developer insights from Amii Game, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 24, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Amii Game\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Amii Game\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2256720/header.jpg?t=1674807015\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}