{
    "AppID": 2164490,
    "Name": "Emberfate: Tempest of Elements",
    "Release date": "Jan 26, 2023",
    "About the game": "ABOUT Set in regular modern-day life, you are the leader of a raiding guild in the world's hottest MMORPG, Emberfate, which has just released the new expansion, Tempest of Elements. Balance the intricacies of being a guild leader, ranging from preparing for boss battles or distributing loot, to managing the complex relationships you have with your fellow players. Engage in conversations with your guildmates, listen to their troubles — and maybe pursue one of the three possible love interests to build a romantic relationship of your own! Take charge of your own fate, and shape the future of those around you. In Emberfate, everyone is dealing with something, and your choices and support could make all the difference. FEATURES An Immersive MMORPG-simulation Experience Be who you want to be in the world of Emberfate! Choose your player character's name, pronouns, background, in-game race / class, guild name, and more!  Venture into the newest raid dungeon, Ruins of Refuge, and prove your worth. Can you lead your raid team to success and defeat all four dragons? Remember to communicate with your party — all lines spoken by the characters over the raid voice chat are fully voiced to ensure the full raider experience of hearing your friends scream in your ear in either excitement or panic. Create lasting bonds with your guildmates and fellow raiders! Chat with them in various text channels — realm, guild, officer, party chat — and occasionally send or receive private messages from them!  Explore and manage life as an Emberfate player with the fully functional guild, mail and inventory system! A Sweet Romance to Remember Tired of only watching and helping your friends' love lives flourish? No problem! There are three love interests you can pursue, who are waiting for that special someone (you) to come into their lives! Grow closer to them over text chats, voice calls — and even video calls!  Again, all the voice and video calls are fully voiced, so be prepared to hear your future partner (maybe) whispering sweet nothings in your ear! Love Interests",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2164490/header.jpg?t=1674783107",
    "Price": 0.0,
    "Developers": "Wind Chimes Games Limited",
    "Publishers": "Wind Chimes Games Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2164490/ss_ca3c62a29d0ba82f6f4d5fa9519f562bba6698ec.1920x1080.jpg?t=1674783107,https://cdn.akamai.steamstatic.com/steam/apps/2164490/ss_6de0db634241a3b80c604fb82a6ca1a480f5c199.1920x1080.jpg?t=1674783107,https://cdn.akamai.steamstatic.com/steam/apps/2164490/ss_3041c66a749291781e105dee537cf98246c31c5f.1920x1080.jpg?t=1674783107,https://cdn.akamai.steamstatic.com/steam/apps/2164490/ss_3064cb675bd850b2f8532df277eea181ab5c45a2.1920x1080.jpg?t=1674783107,https://cdn.akamai.steamstatic.com/steam/apps/2164490/ss_f54281cd44b328c78578aa92de93d8ae7d892a2c.1920x1080.jpg?t=1674783107",
    "Slug": "emberfate-tempest-of-elements",
    "Meta Title": "Emberfate: Tempest of Elements: Jan 26, 2023, Wind Chimes...",
    "Meta Description": "Looking for information on Emberfate: Tempest of Elements? Check out the release date (Jan 26, 2023), developer insights from Wind Chimes Games Limited,...",
    "Alt Text Image": "Official header image for Emberfate: Tempest of Elements game - Steam 2164490",
    "Canonical URL": "https://gusku.site/game/emberfate-tempest-of-elements",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Emberfate: Tempest of Elements\", \"description\": \"Looking for information on Emberfate: Tempest of Elements? Check out the release date (Jan 26, 2023), developer insights from Wind Chimes Games Limited,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 26, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wind Chimes Games Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wind Chimes Games Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2164490/header.jpg?t=1674783107\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}