{
    "AppID": 2203540,
    "Name": "Escape From School : F.E.L.I.K",
    "Release date": "Jan 6, 2023",
    "About the game": "You were locked up at night at school in Chernobyl. You can get out only by blowing up the reactor, but to gain access to the reactor control panel, you need to open the armored door. To do this, we collect all the components and insert them into it. But beware of the monsters and mutants that inhabit this creepy place, each of them will hunt you down. Solve all the secrets of the Soviet school, some of them are scary, some of them are creepy. Also, be careful, radiation exposure can cause hallucinations, so pay attention to every creak you hear. Locations 1 building - the place in which you appear. He is guarded by the mutant F.E.L.I.K, who, although smaller, is intelligent. To escape from him, you need to disappear from his sight for a long time. Look for key cards of different colors and open cabinets in which you can find survival items, as well as items to open doors 2 building - guarded by Ilyich. You should not go to this building if you do not have a camera. Despite the high speed of this ghost, you can eliminate it for a while if you take a photo, so the flash will eliminate it. This city also contains the items to open door 305, as well as the map key. Survival Staffs Camera - is entered only in the first building. carried in the hands. The main purpose of this item is the elimination of Ilyich. The delay between shots lasts 4 seconds, so make sure Illich is close enough to you, because if the flash doesn't hit him, you risk getting caught by him. Also, with the help of the flash, you can show hints on the pictures. Prehistory How would you feel if you woke up at night in a locked abandoned school? In addition to you, there are brodt mutants here, as well as the souls of the workers of this institution. Be extremely careful when walking around this building, any careless movement and you risk being noticed by mutants. Use the ladders in the back rooms to move between floors without being noticed. And if you hear an intensifying pumping sound - run. Gameplay To open the door of office 305, you need to find the following items: 1. Atlas (4x) 2. Lever (4x) 4. Batery (1x) 5. Gear (1x) Other things: 6. Safe key 7. Double door key To find the atlases (1), you need to search the lockers in the offices: To find the levers (2), you need to find the safe key (6) and open safes located throughout the map: F.E.L.I.K A mutant that resulted from a long stay in office 305. He hunts only in Corps 1, has good hearing and sees perfectly in the dark, unlike you. Therefore, pay attention to the sound coming from her speaker, if it gets louder, it means she is close to you. The best way to escape from her is to hide in a locker. But if she sees how you cheated on her, then you risk being destroyed along with him. Illich This creature is located in the building 2. It is more dangerous than mutant F.E.L.I.K because it is a half-ghost, has a high speed of movement and scares the character that stops him for a moment. But having a camera with you, you can eliminate it, although not for long. Victory Conditions When door 305 is open, you should go to the back room of this office. There you need to click on the reactor control panel. After the grim explosion, you need to get out of the ruins of the lyceum.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2203540/header.jpg?t=1673005536",
    "Price": 3.99,
    "Developers": "AXEL STUDIO",
    "Publishers": "AXEL GAMES",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2203540/ss_40291155b60e977d85fb82b776e9d3ff5d68cd4c.1920x1080.jpg?t=1673005536,https://cdn.akamai.steamstatic.com/steam/apps/2203540/ss_00a28d88053b73ad0797f44957bd41b58d66f0b2.1920x1080.jpg?t=1673005536,https://cdn.akamai.steamstatic.com/steam/apps/2203540/ss_61aa12ac6b1b3207630c61d0e3b98342d9b293ad.1920x1080.jpg?t=1673005536,https://cdn.akamai.steamstatic.com/steam/apps/2203540/ss_f626d137a6a3d922cb168e39015c9330afc088ad.1920x1080.jpg?t=1673005536,https://cdn.akamai.steamstatic.com/steam/apps/2203540/ss_8bda2f61feb87be835b9fc08addb1e0676cdaf9e.1920x1080.jpg?t=1673005536",
    "Slug": "escape-from-school-f-e-l-i-k",
    "Meta Title": "Escape From School : F.E.L.I.K: Jan 6, 2023, AXEL STUDIO ...",
    "Meta Description": "Looking for information on Escape From School : F.E.L.I.K? Check out the release date (Jan 6, 2023), developer insights from AXEL STUDIO, and a complete...",
    "Alt Text Image": "Official header image for Escape From School : F.E.L.I.K game - Steam 2203540",
    "Canonical URL": "https://gusku.site/game/escape-from-school-f-e-l-i-k",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Escape From School : F.E.L.I.K\", \"description\": \"Looking for information on Escape From School : F.E.L.I.K? Check out the release date (Jan 6, 2023), developer insights from AXEL STUDIO, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 6, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"AXEL STUDIO\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AXEL GAMES\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2203540/header.jpg?t=1673005536\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}