{
    "AppID": 1948540,
    "Name": "Exipelago",
    "Release date": "Jan 10, 2023",
    "About the game": "In Exipelago it's your turn to make your tribe into a bustling kingdom. Beside gathering food &amp; shelter to support the colony they also want to make themself a known entity by building the greatest structures. Exipelago is a sandbox village managment game, where everything you see is procedurally generated and customisable. Every tree you fell will give it's distinct type of wood, which can be processed into it's distinct type of plank to ultimately craft an item which has the optical style of the tree it was originally made out of. The same is true for every other ressource, like different types of rock and ore - both being found by digging down into the earth. Featuring a true voxel experience - everything you see can be broken down, placed elsewhere or get transformed into something else in a dynamically reacting world. Different types of shapes also give you more freedom to just build your imagination and let your tribe use it. Key Features: Procedurally - Every island is different and so is every tree and every plant Dynamic World - Everything can either be digged, chopped, mined, picked up, collected, stockpiled or crafted into something else Open Sandbox - Your tribe, your imagination. Survive and Thrive. Managment - Crafting, Queuing, Transporting, Trading, Stockpiling Villagers - The workforce of your village. They will need sleep, food, light and shelter Editors - Create your own trees, plants, items and materials. Share your creations via Steam Workshop Day/Night - Prepare for the darkness of the night and schedule villagers time Underground - Dig big mines to gather lots of ressources like all sorts of stone Time matters - Plants &amp; Trees will grow in realtime. Plant enough so you have a steady supply of materials. Materials - Whatever can be crafted will reassemble the ressource it was crafted with. As there are several types of trees, so is several types of logs, several types of planks and ultimately several types of furniture More than blocks - Exipelago features several block shapes like ramps to make your creations stand out.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1948540/header.jpg?t=1673368935",
    "Price": 19.99,
    "Developers": "reiti.net",
    "Publishers": "reiti.net",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1948540/ss_869d65d55058191633d974ae2993805f5861c6a7.1920x1080.jpg?t=1673368935,https://cdn.akamai.steamstatic.com/steam/apps/1948540/ss_f29414ac4a74d50dc51ab51ab9027f681b05038b.1920x1080.jpg?t=1673368935,https://cdn.akamai.steamstatic.com/steam/apps/1948540/ss_e92cc002932447273ad1c2bc92b387960e848f49.1920x1080.jpg?t=1673368935,https://cdn.akamai.steamstatic.com/steam/apps/1948540/ss_ac1efca792e3953195f12d4b9627eea2c5d5fe97.1920x1080.jpg?t=1673368935,https://cdn.akamai.steamstatic.com/steam/apps/1948540/ss_a2e6cfd7b0f5a8c1f5eca5a63688fcc63b4dab72.1920x1080.jpg?t=1673368935",
    "Slug": "exipelago",
    "Meta Title": "Exipelago: Jan 10, 2023, reiti.net and Full Overview",
    "Meta Description": "Looking for information on Exipelago? Check out the release date (Jan 10, 2023), developer insights from reiti.net, and a complete game summary.",
    "Alt Text Image": "Official header image for Exipelago game - Steam 1948540",
    "Canonical URL": "https://gusku.site/game/exipelago",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Exipelago\", \"description\": \"Looking for information on Exipelago? Check out the release date (Jan 10, 2023), developer insights from reiti.net, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 10, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"reiti.net\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"reiti.net\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1948540/header.jpg?t=1673368935\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}