{
    "AppID": 2247270,
    "Name": "EXITOR",
    "Release date": "Jan 8, 2023",
    "About the game": "A UNIQUE, EPIC ACTION PACKED RTS Story In Exitor, you follow Quinn and his gang of outlaws after a heist goes horribly wrong, and they are stranded on the desert planet of Corvus II, attempting to stay hidden from the cruel Royalist authorities on the planet, while trying to rescue their friend. Gameplay In Exitor you control a few heroes each level as you lead them through firefights with enemies and must use strategy and multitasking to micro-manage your team in real time. The game is fundamentally an RTS but combines many aspects with turn-based strategy games, making a chaotic action packed game that requires both strategy and quick reflexes. Unlock Unique Characters As you complete levels, different characters will become available to unlock. You get to choose between 2 different characters (Do not worry, you will get the character you did not choose later) after some levels. There is a total of 8 different characters, each with a special attack, as well as 2 unique different abilities and their own skill tree in which the character's passives can be unlocked. Speaking of a skill tree... Skill Trees After a character kills an enemy, that characte gains XP. If a certain character gains enough XP, the XP will be converted into a skill point, which can be spent in the skill tree. The skill tree unlocks 2 different passives for each character as well us upgrades for every aspect of the character, including health upgrades, damage upgrades, ability upgrades and energy upgrades. Enemies There is a wide variety of enemies you will face throughout Exitor. In the first world, you will face many different royalists, however in the second world, you will get to face a variety of different gangs. At the end of each world, there is also a boss you will have to defeat with cool abilities and dangerous attacks. Different Worlds In Exitor, there are currently 2 different worlds you can explore. Each world comes with their own enemies, unique environments and a cool boss battle at the end of each world. Do not worry, as we move out of early access, there will be new worlds for players to complete and different ways for players to test out their skill.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2247270/header.jpg?t=1673245464",
    "Price": 9.99,
    "Developers": "Lvl26Devs",
    "Publishers": "Lvl26Devs",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2247270/ss_0291eae8c59491044f67e923ebb58090aa249330.1920x1080.jpg?t=1673245464,https://cdn.akamai.steamstatic.com/steam/apps/2247270/ss_0e129dca1045a7e12f3bcd121369bce4294a679c.1920x1080.jpg?t=1673245464,https://cdn.akamai.steamstatic.com/steam/apps/2247270/ss_9e51510c7921f5f92062f9ed2efe237a8a7c34a9.1920x1080.jpg?t=1673245464,https://cdn.akamai.steamstatic.com/steam/apps/2247270/ss_874d4c101dcd2457487e2d5a3898c39cb7444f23.1920x1080.jpg?t=1673245464,https://cdn.akamai.steamstatic.com/steam/apps/2247270/ss_8e7101b2e5ca51c31f36653904edde34126070cf.1920x1080.jpg?t=1673245464",
    "Slug": "exitor",
    "Meta Title": "EXITOR: Jan 8, 2023, Lvl26Devs and Full Overview",
    "Meta Description": "Looking for information on EXITOR? Check out the release date (Jan 8, 2023), developer insights from Lvl26Devs, and a complete game summary.",
    "Alt Text Image": "Official header image for EXITOR game - Steam 2247270",
    "Canonical URL": "https://gusku.site/game/exitor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"EXITOR\", \"description\": \"Looking for information on EXITOR? Check out the release date (Jan 8, 2023), developer insights from Lvl26Devs, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 8, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lvl26Devs\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lvl26Devs\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2247270/header.jpg?t=1673245464\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}