{
    "AppID": 1184250,
    "Name": "Finnish Army Simulator",
    "Release date": "Jan 13, 2023",
    "About the game": "The 1st Early Access version contains 4 weeks of military service, meaning over 20 hours of scripted gameplay content! The Purpose? To provide a realistic but humorous experience of the Finnish Military Service (conscription, 'intti') around the year 2011. We want you to feel nostalgic! RK-69 (pun intended), M05, hazing / bullying ('simputus'), NBC Alarms ('suojeluhälytys')… Training includes conscript favorites such as NBC gear leak testing with tear gas. And fire training with napalm, as well as the ever-present cooper test. The Catch? The player can relate to the content if she/he has been through the Finnish Army. Strong language, black humor, strict guidelines, repetitive tasks, simple core mechanics are the heart of the game. Spend your on-base days going to endless lectures, learning basic discipline and marching drill. The Mechanics? Remember those good old “track and field” type of games? How about “Tony Hawk” games? This game will feature a lot of mechanics that many will remember from their childhood. Furthermore, RPG elements like dialogues, inventory, player stats, free roaming, skill trees etc. will provide additional depth to the gameplay. Many facets of training are included as minigames. Orienteering, combat training ('taisteluammuntaharjoitus') and military drill ('sulkeisjärjestysharjoitus') among them. Marching in time with your fellows has been a staple of military training since Napoleonic times. By the 2000’s, this hasn’t changed in Finnish armed service. You’ll be surprised how little else has. The Story? The game will have a “meta plot”. The player will be able to reveal army secrets that shouldn’t be commonly known. The player also maintains connection to the outside world by watching TV news and participating in activities during the weekend holidays which both will affect the gameplay. Count how many precious days of service remain with an in-game morning comb. Other inseparable aspects of Finnish military service, such as tent stove duty, roundabout group punishment and “intti slang” are brought vividly to life. Kilometers of Finnish country roads are modeled in luscious detail. And terrain exercises are complete with, well, terrain. As well as defensive structures for training. It is a well-known aspect of Finnish military service that the shortest service of 180 days includes approximately 300 nights sleeping in the woods. Or more often than not, spent in the woods guarding the empty forest. The barracks area is free to roam during the day, but during the night, the military police do their best to make sure anyone moving about is only doing so on actual business. That may not stop you. If you play your cards right, you may get to shoot dozens of live rounds. Dozens! Hundreds of pieces of military kit and other items, from weapons, live and simulated, to protective equipment and clothes, camping implements and packs, all the way to candy and snacks, perhaps even contraband… Kit enters the player’s inventory as it does in actual service, through regular visits to the equipment warehouse ('varusvarasto'). That is not to say that extra items and special equipment isn’t possible to come by. Barracks housing is modeled after the bunks, stools and steel cupboards every Finnish conscript knows and loves. Cleaning service ('siivouspalvelus'), folding the soldier’s blanket ('pinkka') and making the bed are all in the game. The barracks grounds are complete with a soldier home ('sotilaskoti'), a distinctive Finnish breed of combined canteen and commissary. This is the closest you’re likely to get to civilization and normal life most evenings. The soldier home commissary offers small creature comforts such as videogames, petty gambling (slot machine, payazzo) and tasty treats. What little remnants of the outside world exists on the barracks are modeled after actual Finnish popular culture, tongue firmly in cheek. Outside events do, however, have an effect on your service, and the game has several storylines that may take several playthroughts to fully uncover. Even in the unlikely event that a Finn knows nothing else about military service, the two things they are likely to know are that the jam doughnuts in the canteen are delicious and cheap, and that the coffee is undrinkable. There are things that some conscripts cannot live without that cannot be bought in the soldier home. Tins of Swedish snus, for example, may be bought from platoon mates.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1184250/header.jpg?t=1673629245",
    "Price": 26.99,
    "Developers": "Please Be Patient",
    "Publishers": "Please Be Patient",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_07e26e327e12b89be31e5e4eb54d91ade2fdb7eb.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_17f44d530556505abfef1700299c23542ef9ccbf.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_ee7533de05cde0b17ffdb40108ab9cf97dc6359c.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_650d0ccda96aeab630b02b08557db74a193e08ec.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_cc2ff16383962724a024c244677bb3155a42aa3b.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_013ec9cc4696cb03877217a2dac5eb4f0c698781.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_012f7bac63dcd89da504d85b0b07fad33a93ae33.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_e2d740cecba173572f0408246d418213c495e9db.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_7d7839de16119ed1f9b2235d3c6cdcf652848bb9.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_36375470f7c3ed1833fc49b0ca4135783dd52ae2.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_fe3036d7827492c9f66d2a22cada09fa8c8c0f93.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_063f399438e73bcf9c271fa14f23e3cdcb828941.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_70293f53ec779493ca4e9ec86a1ec6495b8836ab.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_45660c7c2186a333bc363bc58ee2b08064773137.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_0919b266294b4534394d2a0ec7aa672b59d74f75.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_c0f2e7879a2cef2147ca971fcf5af1695bace255.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_0c4efd124b9c99dc2efcaf83d56c8b5eb921e725.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_ea5248fc6ed5ea0af4f739366bc2be35585c011d.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_ad5570693e6d0c0fe1f50acd62f8db5523009b1a.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_1f1105d25c79c110214b61a6a149897604b5193b.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_4b7329c51a07a532b222710952ac6076c3bb6b4f.1920x1080.jpg?t=1673629245,https://cdn.akamai.steamstatic.com/steam/apps/1184250/ss_24795d226971e6f934f5f81f442565121565f449.1920x1080.jpg?t=1673629245",
    "Slug": "finnish-army-simulator",
    "Meta Title": "Finnish Army Simulator: Jan 13, 2023, Please Be Patient a...",
    "Meta Description": "Looking for information on Finnish Army Simulator? Check out the release date (Jan 13, 2023), developer insights from Please Be Patient, and a complete ...",
    "Alt Text Image": "Official header image for Finnish Army Simulator game - Steam 1184250",
    "Canonical URL": "https://gusku.site/game/finnish-army-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Finnish Army Simulator\", \"description\": \"Looking for information on Finnish Army Simulator? Check out the release date (Jan 13, 2023), developer insights from Please Be Patient, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 13, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Please Be Patient\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Please Be Patient\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1184250/header.jpg?t=1673629245\", \"offers\": {\"@type\": \"Offer\", \"price\": 26.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}