{
    "AppID": 2070410,
    "Name": "Flightpath",
    "Release date": "Jan 26, 2023",
    "About the game": "Flightpath is a top-down shooter with a unique story driven mechanic. As you battle your way through waves of enemies, you will be presented with two possible paths to move forward. Depending which path you take, the story changes, and with it how the game itself unfolds, which missions follow up, who will you meet and how the ending changes. Welcome to Venaris, a small planetary system where an underground criminal organization known only as the Syndicate continuously terrorizes its citizens while corrupt planetary administrations and system forces are ineffectual at bringing the organization down. Three unrelated individuals have decided to take matters into their own hands: Katherine “Kath” McKenzie, a mechanical engineer who spends most of her time tinkering with spaceships; A.J., a disgraced ex-detective who was framed for a crime the Syndicate committed; and Maxine “Max” Speed, a professional aeroracer. After running into the Syndicate's dirty business, each vows to take down the organization and find their leader, a secretive and shady figure that goes by 'The Chairman', and bring him to justice. Our goal is for Flightpath to be a casual, story-driven experience with action elements. Flightpath is about the player making choices. In certain stages, you will be presented with two possible paths to take. The choices you make change the sequence of events from that point forward and tell a different story. You can choose to blow up a bunch of the Syndicate's stuff to hamper their schemes, or you can break off to chase down an escaping villain for information on The Chairman's plot. Or you could take on the big bad boss of the area and get one step closer to taking down the Syndicate, but this means not rescuing your kidnapped dearest friend! You will guide your choice of character on their quest to stop The Chairman, and your decisions will alter how the story unfolds through each stage, and each character has their own story. Different player choices change the flow of the story, what characters you meet and bosses you fight, and even the ending! Since each character's storyline has multiple paths, we know replayability is important. While Flightpath is a top-down shoot ’em up, it is not a bullet-hell shooter. Instead of predetermined, synchronized attacks, enemies spawn and attack patterns are procedurally generated to keep the mayhem unpredictable and fun. The stages are also built procedurally to keep things fresh whether it's your second or thirty-second run! And it's not just about shooting! In some stages you'll have a specific task, such as rescuing someone, blowing up the Syndicate's stuff, recovering important items from the Syndicate, or taking down a boss to really damage the Syndicate's schemes. Fight your way through ten unique stage locations and decide your path to victory!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2070410/header.jpg?t=1674768947",
    "Price": 14.99,
    "Developers": "Illogic Games",
    "Publishers": "Illogic Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2070410/ss_aec2129e140ff105b84c72e783bcf95f0bf198f6.1920x1080.jpg?t=1674768947,https://cdn.akamai.steamstatic.com/steam/apps/2070410/ss_543e325875f7f568b03edd998be341bc9ac3947d.1920x1080.jpg?t=1674768947,https://cdn.akamai.steamstatic.com/steam/apps/2070410/ss_90aec38461f041a9b8bef638bdf60732a8252d0b.1920x1080.jpg?t=1674768947,https://cdn.akamai.steamstatic.com/steam/apps/2070410/ss_b2960cb312f071cf53c03a3b717824249d03205c.1920x1080.jpg?t=1674768947,https://cdn.akamai.steamstatic.com/steam/apps/2070410/ss_028b8edbdde4cf71bfb333550145b1bebd1f4bb2.1920x1080.jpg?t=1674768947,https://cdn.akamai.steamstatic.com/steam/apps/2070410/ss_512381779286bac2a7500b327a784237dcb51f86.1920x1080.jpg?t=1674768947,https://cdn.akamai.steamstatic.com/steam/apps/2070410/ss_63f1eb5e58f30db36bf92463e4694bd6dcfe79e0.1920x1080.jpg?t=1674768947,https://cdn.akamai.steamstatic.com/steam/apps/2070410/ss_15722c665c073f96e96e9167302ffd784c687c56.1920x1080.jpg?t=1674768947",
    "Slug": "flightpath",
    "Meta Title": "Flightpath: Jan 26, 2023, Illogic Games and Full Overview",
    "Meta Description": "Looking for information on Flightpath? Check out the release date (Jan 26, 2023), developer insights from Illogic Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Flightpath game - Steam 2070410",
    "Canonical URL": "https://gusku.site/game/flightpath",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Flightpath\", \"description\": \"Looking for information on Flightpath? Check out the release date (Jan 26, 2023), developer insights from Illogic Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 26, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Illogic Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Illogic Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2070410/header.jpg?t=1674768947\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}