{
    "AppID": 2252550,
    "Name": "Hope",
    "Release date": "Jan 27, 2023",
    "About the game": "Do you want to learn from mistakes and use them as a basis for learning, regain hope and move towards victory? Hope is a puzzle and platform game which presents new ways of dealing with the problems that often make us give up halfway. A game developed with the aim of connecting people with their own emotions, teaching them to deal with everyday frustrations, benefiting from the mistakes made and using them as learning opportunities and motivation. Hope's goal is to instill more confidence in its users and help them to become better people, with possibly a better vision of the future; since the game acts not only on the emotional part, but also on the individual's cognitive abilities, both in relation to strategy and the speed of reaction to the spatial vision. Controlling a simple square in several puzzle levels, Hope is able to deliver multiple emotions to whoever is playing it, through motivational phrases, gameplay and fluid mechanics, sound effects, music and challenges. The character's main mechanic is something very simple, yet profound and unique, which boils down to just three steps. MISS The first part boils down to the player making a mistake on purpose and thus creating a block in the place where he made a mistake, but only if the object that killed him is marked with the color white, otherwise the first step is invalidated and it won’t skip straight to the second step. REPEAT After the player has made a mistake and a block has been created in the place where he made a mistake, the main character is spawned again to repeat the level, but this time with a block in the ideal place to be able to move to the next level. REMOVE The third part is an optional mechanic where the player can restore and delete the last block created. This option was designed in case the player creates a block in an unwanted location. ARE YOU STILL READING? What are you waiting for? Let's recharge our hope? Go learn from your mistakes and use them as motivation for victory! Based on the games Neon Depth and Geometry Dash .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2252550/header.jpg?t=1674909008",
    "Price": 3.19,
    "Developers": "Pedro Lima",
    "Publishers": "Pedro Lima's Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2252550/ss_fdd69097fd7aafba7a189619c0b59b348983d234.1920x1080.jpg?t=1674909008,https://cdn.akamai.steamstatic.com/steam/apps/2252550/ss_2d1184f97df203304a9fe43df502049feda069e9.1920x1080.jpg?t=1674909008,https://cdn.akamai.steamstatic.com/steam/apps/2252550/ss_f061c4e849ac54a0c4163ce8ec85d5b3c2a56e81.1920x1080.jpg?t=1674909008,https://cdn.akamai.steamstatic.com/steam/apps/2252550/ss_e586291b642b4601fd7d4243a4d0468a6017afea.1920x1080.jpg?t=1674909008,https://cdn.akamai.steamstatic.com/steam/apps/2252550/ss_0d72454f0d8253f795fff3b740af739a19a84e0f.1920x1080.jpg?t=1674909008,https://cdn.akamai.steamstatic.com/steam/apps/2252550/ss_5ad25d2393554dd3afa3e72bcc23562fe7b9930e.1920x1080.jpg?t=1674909008",
    "Slug": "hope",
    "Meta Title": "Hope: Jan 27, 2023, Pedro Lima and Full Overview",
    "Meta Description": "Looking for information on Hope? Check out the release date (Jan 27, 2023), developer insights from Pedro Lima, and a complete game summary.",
    "Alt Text Image": "Official header image for Hope game - Steam 2252550",
    "Canonical URL": "https://gusku.site/game/hope",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hope\", \"description\": \"Looking for information on Hope? Check out the release date (Jan 27, 2023), developer insights from Pedro Lima, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 27, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pedro Lima\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pedro Lima's Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2252550/header.jpg?t=1674909008\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}