{
    "AppID": 1816070,
    "Name": "ILLUMINATI",
    "Release date": "Jan 6, 2023",
    "About the game": "Battle for world domination in this darkly satirical, turn-based strategy game—based on the beautifully balanced deck-builder from Steve Jackson Games. Play against an AI, or dial up the full experience with cross-platform multiplayer! THREE ERAS OF GLOBE-SPANNING CONSPIRACY A long-time fan favorite, the first Illuminati video game pays homage to its history, leaning into the game's classic editions: the original cards from the ’80s and ’90s, alongside a new set of cards for the modern day. Each era follows the conspiracies and concerns of its time, showing how the world's greatest conspiracies echo forward into the future. Is there a connection between the three? You're not cleared for that. CONTROL, NEUTRALIZE, DESTROY Each group your Illuminati controls offers more power to fuel your schemes, and greater resistance to your enemies. Build your conspiracy from groups like the F.B.I. and Russia, or more like The Men in Black and The Evil Geniuses for a Better Tomorrow! The rabbit hole is deep, with over 275 groups across the eras. Controlling more groups grows your conspiracy—or destroy them, either to foil a rival or to feed your own dark goals. PLOT &amp; THE WORLD PLOTS WITH YOU Don’t like the rules? Break them! Each turn your minions deliver a new Plot, to speed your progress or trip your enemies—or why not both? World domination comes closer with each sinister Plot you play—and the basic game comes with 112 Plots across the eras. All 382 cards are illustrated, with more sinister details and cross-references than you could fit in Warehouse 23 where they keep the Ark of the Covenant. CHOOSE YOUR CONSPIRACY Choose from 6 different secret conspiracies, each with different strengths, different abilities, and different ways to win the game. Some are driven by raw power, or money. One just wants the world to be more weird…while another only wants to burn it all to the ground. Each Illuminati has a unique design, including custom music, effects, and visuals. ILLUMINATI is a full game experience for newcomers and for long-time fans. The game has been tested by hundreds of people so far, now we're excited to get the game into many more hands—but we're looking beyond making a complex game easy and fun to play. For the past nine months, we've been introducing new cards and new features every few weeks, and we are just getting started. Join the conspiracy!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1816070/header.jpg?t=1673059508",
    "Price": 21.24,
    "Developers": "Derek Pearcy,Matt Seifert",
    "Publishers": "RadioFree.Net",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1816070/ss_90d947db80f0f7e938a25e87e7e4e76ba1551db4.1920x1080.jpg?t=1673059508,https://cdn.akamai.steamstatic.com/steam/apps/1816070/ss_71dba63ede72dd8d56dde49e4870db8ef7c363a8.1920x1080.jpg?t=1673059508,https://cdn.akamai.steamstatic.com/steam/apps/1816070/ss_44789b70cd26a225305e9d32debd694617f2f58d.1920x1080.jpg?t=1673059508,https://cdn.akamai.steamstatic.com/steam/apps/1816070/ss_fa0832bd0804ffe9c44189130475d58c18ed87dd.1920x1080.jpg?t=1673059508,https://cdn.akamai.steamstatic.com/steam/apps/1816070/ss_0ac10791e2a5eec2d487bfe9cdec25ebf00da618.1920x1080.jpg?t=1673059508,https://cdn.akamai.steamstatic.com/steam/apps/1816070/ss_8754c8260e639656a2414e1593c306c1111c6875.1920x1080.jpg?t=1673059508,https://cdn.akamai.steamstatic.com/steam/apps/1816070/ss_271fdf11f4f9944931b8f7e2c9dac2f85bd5b21f.1920x1080.jpg?t=1673059508",
    "Slug": "illuminati",
    "Meta Title": "ILLUMINATI: Jan 6, 2023, Derek Pearcy,Matt Seifert and Fu...",
    "Meta Description": "Looking for information on ILLUMINATI? Check out the release date (Jan 6, 2023), developer insights from Derek Pearcy,Matt Seifert, and a complete game ...",
    "Alt Text Image": "Official header image for ILLUMINATI game - Steam 1816070",
    "Canonical URL": "https://gusku.site/game/illuminati",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ILLUMINATI\", \"description\": \"Looking for information on ILLUMINATI? Check out the release date (Jan 6, 2023), developer insights from Derek Pearcy,Matt Seifert, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 6, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Derek Pearcy,Matt Seifert\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"RadioFree.Net\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1816070/header.jpg?t=1673059508\", \"offers\": {\"@type\": \"Offer\", \"price\": 21.24, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}