{
    "AppID": 1817110,
    "Name": "Isaiah 188",
    "Release date": "Jan 6, 2023",
    "About the game": "GET ORBITAL 'What are those new lights in the sky?' Give new meaning to the phrase 'shooting stars' with unique orbital grids around many different planets and moons in our solar system. Every fleet is always moving! Speed them up, slow them down, flip their orbital direction, or transfer orbits. But be careful, every ship can run out of delta-V. (Supply ships can refuel them and their onboard matter labs create more fuel every turn, though.) 'Ceres won't always be a short ride out; she's moving too.' Send your fleets across the vast and lonely reaches to all the populated bodies in one game world. Crossing millions of miles takes time, though, and that means those reinforcements to Jupiter won't get there fast - no matter how hard the burn. With modeled celestial dynamics, planets may not be where you want them; plan accordingly. 'It's not speed that kills - it's the sudden railgun impact at the bottom that gets ya.' Space combat is 'fly by' newtonian combat, with relative velocities taken into account, and weapon ranges based on whether the other ships can dodge or intercept at that distance. Distances are measured in light milliseconds, many thousands of miles, and combat will be over in seconds. Your captains and crews do the fighting for you, but you must make key decisions before combat starts. GET TACTICAL With dozens of ground units across infantry, vehicles, and aircraft, and seven capital ship types, (not to mention massive defense and construction stations!) there's tons of room to build the armies you want and the fleets you need. 'Heavy battleships command space, peerless and fearless, and nimble corvettes chase fat transport ships like orcas on the hunt. It's a good time to be in the navy.' Ground combat on traditional hex grids requires cunning when planning maneuvers and attacking. Flank your enemies for large combat bonuses, and tailor your forces to counter the enemy to ensure victory. As units deal damage to the enemy, they can rank up with 'combat fervor,' and gain different bonuses for their allies. 'That spec ops squad giving you trouble? Surround it with killer drones!' Every planet and moon has a different terrain mix, so maybe don't truck three transports full of heavy tanks to icy, scarred Europa. Try mechs instead! 'We all know mechs are impractical, but who can say no to plasma swords and spider mechs and shoulder mounted cannons? Did I mention there are space penguins on Enceladus? Why not!' TWO WAYS TO PLAY Isaiah 188 has three campaigns, one for each of the factions. (At release into early access, only the UN campaign will be available.) The other main mode in Isaiah 188 is Solar Conquest , which starts in 2257 with realistic planetary orbits and positions. Choose a starting scenario and your faction, and secure the future of your people by any means necessary! THE FACTIONS The Martian Commonwealth, or more accurately, the MCVCM - their military. A laser focus on AI and cloning has given Mars a definite technologic edge over Earth. 'It means 'Martial Commonwealth Volume Control Military,' and I unabashedly made the acronym first and decided what it stood for second.' The United Nations Solar Expeditionary Force, or UN-SOLEXFOR. Earth's people are fractured and the planet is sick, but ten thousand years of warrior culture are not so easily ignored. 'It doesn't hurt that there are thirteen billion of them either, and the corporate council has a loOot of money.' A strange alien presence, calling themselves the 'Haptha Garden Song,' have appeared out in the farthest reaches past Neptune. 'The free colonies have gone dark, and their silence screams a declaration of war.' THE MUSIC Call me biased, but I think my composer did an absolutely stupendous job. His name is Pietro Frigerio (/) . The soundtrack is awesome, give it a listen and support independent music creators when you get a chance!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1817110/header.jpg?t=1673100282",
    "Price": 10.79,
    "Developers": "Sector Z Games",
    "Publishers": "Sector Z Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1817110/ss_ddd97205c20f107fad3b196cf3931e0fd2d709d4.1920x1080.jpg?t=1673100282,https://cdn.akamai.steamstatic.com/steam/apps/1817110/ss_0fd4ba6270e70d4621385d26c79366e6e8e3aaf2.1920x1080.jpg?t=1673100282,https://cdn.akamai.steamstatic.com/steam/apps/1817110/ss_24f271d396f8022601fec7b14007fdf837b45870.1920x1080.jpg?t=1673100282,https://cdn.akamai.steamstatic.com/steam/apps/1817110/ss_e3c067dd35e4127638581da162406e7f1c4899c8.1920x1080.jpg?t=1673100282,https://cdn.akamai.steamstatic.com/steam/apps/1817110/ss_28f9ecb954b69ab59a87322a432896cd325b4b0b.1920x1080.jpg?t=1673100282,https://cdn.akamai.steamstatic.com/steam/apps/1817110/ss_bccc90fda71ff6f28afa651dfca5c28259e7170d.1920x1080.jpg?t=1673100282,https://cdn.akamai.steamstatic.com/steam/apps/1817110/ss_3b8e1ffc9cb3301f11437f0f9d3c2eb7bdd5c90d.1920x1080.jpg?t=1673100282,https://cdn.akamai.steamstatic.com/steam/apps/1817110/ss_ffe4d1956f55d1a2e5a57bc0e94d851aa96f0207.1920x1080.jpg?t=1673100282,https://cdn.akamai.steamstatic.com/steam/apps/1817110/ss_87cb10841188fb131f4d3b20ef81b0d7cd15ee3d.1920x1080.jpg?t=1673100282,https://cdn.akamai.steamstatic.com/steam/apps/1817110/ss_119cfaf9dc7db90a69da4d50d038ca521adb4296.1920x1080.jpg?t=1673100282",
    "Slug": "isaiah-188",
    "Meta Title": "Isaiah 188: Jan 6, 2023, Sector Z Games and Full Overview",
    "Meta Description": "Looking for information on Isaiah 188? Check out the release date (Jan 6, 2023), developer insights from Sector Z Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Isaiah 188 game - Steam 1817110",
    "Canonical URL": "https://gusku.site/game/isaiah-188",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Isaiah 188\", \"description\": \"Looking for information on Isaiah 188? Check out the release date (Jan 6, 2023), developer insights from Sector Z Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 6, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sector Z Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sector Z Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1817110/header.jpg?t=1673100282\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}