{
    "AppID": 2269170,
    "Name": "Keyboard Warrior: Dreamstate Prologue",
    "Release date": "Jan 22, 2023",
    "About the game": "This band of elite hackers got warped into a computer world they never dreamed of. Their only chance of escape is to dig deeper into the machine's operating system. As they discover the mysteries of their capture, will they ever be the same? This is the free prologue of Keyboard Warrior: Dreamstate. Grab the full game here! AI Enemies that adapt to your movement patterns! Horde survival meets fast paced-movement and predictive AI. The AI gets more intelligent as you progress through the difficulty levels. Explore a wide variety of loadout and gameplay combos with primary/secondary weapons, elemental amulets, and in-game upgrades/powerful skill trees. There are two arenas. The first arena is an 8-minute timer, and the second is a 15-minute timer. Each has its own unique playstyle, visuals, and enemy roster. Also, certain meta-progression upgrades are arena specific. Meet the Crew Recruit - Basic, well rounded character Ghost - Reduced HP. Dash is replaced by a teleport. Low HP movement initiates a phase state that makes everything invulnerable. Scientist - Slow. Dash is replaced by a teleport. Moving creates an electrical field that damages nearby enemies. Tank - Slow. High HP. Comes with a built-in Steadfast passive that reduces consecutive damage. Mercenary - Fast. Reduced HP. Increased damage. Amulets Amulets come in 'common', 'rare', 'epic', and 'mystic' varieties. All of an amulet's stats are randomized when found. They can be discovered in battle after beating OSIRIS or Mini-bosses! Note: Primaries and secondaries also come in 'common', 'rare', 'epic', and 'mystic' varieties. Mystic weapons also come with a randomized bonus perk that can be stacked between both the primary and secondary. The strength and type of perk are random, but scale based on difficulty and change based on the arena! ------------------ Ruby - Attacks have a chance to burn enemies. Fire spreads from enemy to enemy Saphire - Haze enemies causing them to run away from you Emerald - Snare enemies, greatly slowing their movement Amethyst - Poison enemies, damaging them until they die Diamond - Implant enemies with shards that explode when they die. Shards spread from enemy to enemy Features Primary weapons each with their own unique primary fire and special ability Primary and secondary weapon combos (Slashing sword with homing rockets, Sniper Blackhole with explosive bouncing bombs, etc) Specials - Primary weapon-specific abilities that charge off of damage dealt (blackholes, freeze attacks, time slow, etc.) Dashing and teleporting tuned to be slick and responsive Dozens of in-match upgrades and skill tree combos (Autoattack boomerang, Rocket Frenzy's, Dashing leaves behind a black hole, etc) Fast runs (8-15 minutes) Find amulets in battle that trigger special elemental effects! Dozens of shop upgrades and abilities to choose from! 2 Arenas (4 Arena variations) with their own unique scaling and enemy style! 6 difficulty levels to progress through per arena! Control remapping, and a jukebox with over 33 songs/variations!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2269170/header.jpg?t=1674430008",
    "Price": 0.0,
    "Developers": "Cosmos",
    "Publishers": "Cosmos",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2269170/ss_2956240f36c1842c9f6e4a9e84e2ba5941cb10fb.1920x1080.jpg?t=1674430008,https://cdn.akamai.steamstatic.com/steam/apps/2269170/ss_409d927dd53ed48355752692a8689dec7099850c.1920x1080.jpg?t=1674430008,https://cdn.akamai.steamstatic.com/steam/apps/2269170/ss_e8d1410113114182ba06156d74df61471dfc4e6f.1920x1080.jpg?t=1674430008,https://cdn.akamai.steamstatic.com/steam/apps/2269170/ss_642fdf064baf4641db18c61ebdf113fad94ca900.1920x1080.jpg?t=1674430008,https://cdn.akamai.steamstatic.com/steam/apps/2269170/ss_132eb3b8320f2cfe62b0caf6223efc95d880377e.1920x1080.jpg?t=1674430008,https://cdn.akamai.steamstatic.com/steam/apps/2269170/ss_7ccdc4cd486cb42d4f0b761eb1f1b9bb9e939626.1920x1080.jpg?t=1674430008",
    "Slug": "keyboard-warrior-dreamstate-prologue",
    "Meta Title": "Keyboard Warrior: Dreamstate Prologue: Jan 22, 2023, Cosm...",
    "Meta Description": "Looking for information on Keyboard Warrior: Dreamstate Prologue? Check out the release date (Jan 22, 2023), developer insights from Cosmos, and a compl...",
    "Alt Text Image": "Official header image for Keyboard Warrior: Dreamstate Prologue game - Steam 2269170",
    "Canonical URL": "https://gusku.site/game/keyboard-warrior-dreamstate-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Keyboard Warrior: Dreamstate Prologue\", \"description\": \"Looking for information on Keyboard Warrior: Dreamstate Prologue? Check out the release date (Jan 22, 2023), developer insights from Cosmos, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 22, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cosmos\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cosmos\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2269170/header.jpg?t=1674430008\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}