{
    "AppID": 2238340,
    "Name": "Lendas do Pebol: Mythic Football",
    "Release date": "Jan 12, 2023",
    "About the game": "Frantic gameplay, streamlined controls, and characters you've never seen before in a football game make this a unique experience! Amazonian legends have existed for millennia, but today, few believe they exist. The disbelief of the population caused these mythical creatures to become weak and lose their powers. Boto, for example, known for being a beautiful young man with the ability to transform into a pink dolphin, lost the ability to transform and now has the appearance of a child! The Cobra Grande became the size of a normal Cobra! The Mapinguari, the terrible cyclops that inhabits the Amazon rainforest, has two eyes again and no longer scares anyone! However, everything changes when each of these legends receives an invitation to participate in a football tournament. The winner will receive the powers back as a prize! After this irresistible proposal, 8 Amazonian legends prepare for the big championship! Get ready for a 1-on-1 Football match with mystical players! Choose your favorite Amazonian legend and fight to score a goal! Who will do better? The Boto? The Uirapuru? The Big Cobra? The Boitata? The power is in your hands! Main features: - Various game modes! Play a Quick Match, or tackle the progressive difficulty level of Tournament Mode! Get to know the Amazonian legends better by playing the Story Mode! - Use special skills! Every character has a special skill that can give you a great advantage during the match! It takes some time to charge, but once it is ready, you will be able to turn into a giant, stun your opponent for a few seconds or even be able to charge a powerful kick that aims to the goal! - Deplete your opponents' stamina! Not every mythic player likes to play fair. Physical contact with your opponent will deplete his stamina bar. Once it reaches zero, your opponent will faint for a few seconds, giving you a chance to score a goal! The mythic snakes love to use this strategy! - Unlock new possibilities! Unlock new characters, cosmetics, and more! All this without spending a penny, only with in-game currency! - Constant updates! Did you like the game? Keep playing, because soon we will have news! -Get to know the Amazon! The game's scenarios are based on 5 cities in Amazonas, the largest state in Brazil, which houses much of the Amazon rainforest! Enjoy listening to original compositions based on the local rhythms! “This project was contemplated by the CULTURA CRIATIVA PROGRAM – 2020/LEI ALDIR BLANC – AWARD FELICIANO LANA” OF THE AMAZONAS STATE GOVERNMENT, with the support of the FEDERAL GOVERNMENT – MINISTRY OF TOURISM – SPECIAL SECRETARY OF CULTURE, NATIONAL CULTURE FUND'",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2238340/header.jpg?t=1673578578",
    "Price": 2.99,
    "Developers": "Sardinha Studios",
    "Publishers": "Sardinha Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2238340/ss_58fa3e385b853d1a232c1cd011a53b8106028af8.1920x1080.jpg?t=1673578578,https://cdn.akamai.steamstatic.com/steam/apps/2238340/ss_956029158ca507c1939937c55b6993fb4243b323.1920x1080.jpg?t=1673578578,https://cdn.akamai.steamstatic.com/steam/apps/2238340/ss_9df0f9895a345054a74577edfecbb8ad90389011.1920x1080.jpg?t=1673578578,https://cdn.akamai.steamstatic.com/steam/apps/2238340/ss_3d3d9d32e5cc1c530b565779a4c5dfb900a59a70.1920x1080.jpg?t=1673578578,https://cdn.akamai.steamstatic.com/steam/apps/2238340/ss_f18f3df19c4be6d9e1cee21ebd18fa3b5f3622c0.1920x1080.jpg?t=1673578578",
    "Slug": "lendas-do-pebol-mythic-football",
    "Meta Title": "Lendas do Pebol: Mythic Football: Jan 12, 2023, Sardinha ...",
    "Meta Description": "Looking for information on Lendas do Pebol: Mythic Football? Check out the release date (Jan 12, 2023), developer insights from Sardinha Studios, and a ...",
    "Alt Text Image": "Official header image for Lendas do Pebol: Mythic Football game - Steam 2238340",
    "Canonical URL": "https://gusku.site/game/lendas-do-pebol-mythic-football",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lendas do Pebol: Mythic Football\", \"description\": \"Looking for information on Lendas do Pebol: Mythic Football? Check out the release date (Jan 12, 2023), developer insights from Sardinha Studios, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 12, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sardinha Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sardinha Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2238340/header.jpg?t=1673578578\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}