{
    "AppID": 2269580,
    "Name": "Metal March: Beginner Experience",
    "Release date": "Jan 24, 2023",
    "About the game": "Metal March: Beginner Experience is a free playable preview game of Metal March . This version game is includes 1 race and 1 region, a total of 2-3 hours of playable time. You'll see the overall flow of the game, the initial strategy, etc. The full game includes the following! (Based on our current updates) Select your troops from 4 races Race-themed areas 7 types of unique troops and 11 types of unique cards per race More than 10 types of troops and 20 types of cards among troops More than 20 kinds of relics The world has turned into complete chaos. The cold atmosphere between the races has lost sustainability, and all the races are now preparing for an expedition to the World's Roof. As you prepare for the expedition to take over the powerful relics located at the World's Roof, a wandering wizard comes to help you fight the battles. Remember, with your troops, you must be the first to take over the World's Roof's relics before others. With the help of the Wizard, you can briefly monitor the battlefield and control your troops. You can identify each of your troops with tin dolls with different appearances. All troops have their own movement/attack patterns. In addition to the attributes and characteristics of the troop's powers, these movement and attack patterns are also essential factors that you need to consider in strategy. Thoroughly plan your strategy and win. Effectively win the battle by moving troops where the enemy can't counter-attack and quickly retreating to a position the enemy cannot follow. Strategies like this will matter. Magic Can Be A Key That Completes Your Strategy. With magic spells, you can either protect or strengthen your team. You can also choose a strategy that destroys enemies with magic attacks. Your magic combination also plays a vital role in the battle. Even within the same collaboration of troops, strategies vary depending on which magic spells you cast and in what order. There are 4 races that you can select for your troops. Each race has its own strengths and weaknesses. Make up for the shortcomings of the race with the skills and magics of other races. For some kinds of races, making use of their strengths first, or making up for their shortcomings first, may determine the success of the early stages of the expedition. There is another way to strengthen your troops and magic skills. RELICs provide special effects and synergies in ways that can't be obtained from other sources. With relics, you can increase your income during the expedition, add beneficial effects before starting a battle, strengthen certain types of troops &amp; magic powers, and weaken your enemies. You can only activate a limited number of relics, but they can be replaced at any time except during battles. Choose and use relics according to your needs and circumstances.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2269580/header.jpg?t=1674559076",
    "Price": 0.0,
    "Developers": "BlueTale",
    "Publishers": "BlueTale",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2269580/ss_23da8cb47680292a733d854c7801af49e6f8b294.1920x1080.jpg?t=1674559076,https://cdn.akamai.steamstatic.com/steam/apps/2269580/ss_6783f21d27b8ee8d163c012393ee056fdbc14ec3.1920x1080.jpg?t=1674559076,https://cdn.akamai.steamstatic.com/steam/apps/2269580/ss_62ff8c1f80d404fc624aa5c9e7dc14403dc774ff.1920x1080.jpg?t=1674559076,https://cdn.akamai.steamstatic.com/steam/apps/2269580/ss_d2745f087fd7cdcbe84756f0fafef534cb3f2c42.1920x1080.jpg?t=1674559076,https://cdn.akamai.steamstatic.com/steam/apps/2269580/ss_614cd80e6099b6a245d55952c3cc07198df8df22.1920x1080.jpg?t=1674559076,https://cdn.akamai.steamstatic.com/steam/apps/2269580/ss_260ecbea28db5bd086d5c3eebf01973ec6eb658c.1920x1080.jpg?t=1674559076,https://cdn.akamai.steamstatic.com/steam/apps/2269580/ss_5ee928fb45aa30147c28d935c2b2a5ca55a728ba.1920x1080.jpg?t=1674559076,https://cdn.akamai.steamstatic.com/steam/apps/2269580/ss_5bf4c98be01e5bdfa79b96693c9ae930ddfb70a9.1920x1080.jpg?t=1674559076,https://cdn.akamai.steamstatic.com/steam/apps/2269580/ss_ed8b6f05459ecece9ee6f1fc26878167fdc01754.1920x1080.jpg?t=1674559076,https://cdn.akamai.steamstatic.com/steam/apps/2269580/ss_a723df5718c499a72c3ed4c61d52b853936d16d4.1920x1080.jpg?t=1674559076,https://cdn.akamai.steamstatic.com/steam/apps/2269580/ss_dd322d0e7d4fc5a5f4ac8e74b0ccf0d84df91ede.1920x1080.jpg?t=1674559076,https://cdn.akamai.steamstatic.com/steam/apps/2269580/ss_34df1a5f7d8df7138dbd7d59ac2ca5e28d8f0a39.1920x1080.jpg?t=1674559076",
    "Slug": "metal-march-beginner-experience",
    "Meta Title": "Metal March: Beginner Experience: Jan 24, 2023, BlueTale ...",
    "Meta Description": "Looking for information on Metal March: Beginner Experience? Check out the release date (Jan 24, 2023), developer insights from BlueTale, and a complete...",
    "Alt Text Image": "Official header image for Metal March: Beginner Experience game - Steam 2269580",
    "Canonical URL": "https://gusku.site/game/metal-march-beginner-experience",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Metal March: Beginner Experience\", \"description\": \"Looking for information on Metal March: Beginner Experience? Check out the release date (Jan 24, 2023), developer insights from BlueTale, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 24, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"BlueTale\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BlueTale\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2269580/header.jpg?t=1674559076\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}