{
    "AppID": 2284640,
    "Name": "METEOR COMMANDER",
    "Release date": "Jan 26, 2023",
    "About the game": "Action-packed adventure awaits you, Commander! Hop in your space craft and defend against blazing meteors and aliens in this retro-style arcade shooter! You are the pilot of a small spaceship just outside Earth's orbit. Your mission is to defend Earth from incoming waves of burning meteors that will decimate our planet if you don't act quickly! Using your ship's tools - primary cannon, Übercannon, Pulsar and Magnetizer- your task is to break apart and destroy all incoming meteors with a vengeance! But beware, there are enemies lurking in space that seek to prevent you from defending Earth because they want to see Earth destroyed! Did they somehow manage to make this meteoric onslaught happen in the first place? Destroy them, before they destroy you! Weapons &amp; Tools During your space adventures you will discover that blasting enemy ships apart yields some helpful bounty! Importantly, this is how you pick up the parts your ship needs in order to equip it with upgraded tools: Primary Cannon - Your basic gun. Use against all meteors and enemies. Aim is important! Übercannon - Basically a bullet-spraying behemoth. Use tactically, however, as you only have a limited amount of Überammo. Watch the indicator on your HUD. Pulsar - In a pickle? Need to nuke the ever-lovin' dust out of a swarm of untenable enemies and meteors? Hit the Pulsar button to unleash the blue fury! Magnetizer - Tired of trying to catch all the good stuff? Just grab one of these (looks like a magnet) and metallic space stuff comes to you! Organic Matter Alien Corpses - That's right, you can collect enemy corpses, aka 'Samples,' for research and extra points! Pilots - When your ship is destroyed your pilot will eject and float around in space hoping to be rescued. On your next deployment, fly your ship over the wayward pilot to rescue them and get extra points! Be aware though that pilots can drift off into space, never to return again! Same is true for alien corpses, so pick them up while you can! Pilot Notes Check your Pilot's Guide (hit ESC in-game) for detailed info on ship controls. Two (2) players can play at the same time. Have a friend join the battle! Scientists finally figured out that the Quazarian Generator in your ship has an inherent problem: Over time it will accumulate a Gravitational Charge that ends up drawing massive iron-based objects toward your ship. They have not figured out any way to circumvent this problem, Commander, so you will have to deal with it and be prepared! Also note that some sectors may generate Gravitational Vortices which effect all non-organic objects in the sector. Use extreme caution! The Magnetizer does not work on organic matter. During your missions you will face strange and odd events that will challenge you like nothing else. Beware and be prepared! The time to save Earth is now, Commander. Put your space suit on, get in your ship, and defend humanity! APP NOTES Thank you for your interest in METEOR COMMANDER! It is our intent to provide ongoing support and updates with gameplay improvements, new enemies, new ways of playing with friends and lots more!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2284640/header.jpg?t=1674775710",
    "Price": 3.99,
    "Developers": "Propulsion Studios",
    "Publishers": "Propulsion Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2284640/ss_d0a3e631565f7973c52c794c12905aeba02b82d1.1920x1080.jpg?t=1674775710,https://cdn.akamai.steamstatic.com/steam/apps/2284640/ss_b175b7ba8a92a1b51c3cc697e9de6b5e35c80dfe.1920x1080.jpg?t=1674775710,https://cdn.akamai.steamstatic.com/steam/apps/2284640/ss_8a3c6d6063c1e2f14db34f92db52f4aac27388f8.1920x1080.jpg?t=1674775710,https://cdn.akamai.steamstatic.com/steam/apps/2284640/ss_87ab3a94395480e7bc95f9b62271b6862d90811f.1920x1080.jpg?t=1674775710,https://cdn.akamai.steamstatic.com/steam/apps/2284640/ss_0f86ef52a9618e33a679ab1c26f9f415a89dc9d1.1920x1080.jpg?t=1674775710,https://cdn.akamai.steamstatic.com/steam/apps/2284640/ss_10779c487be0f0ff6226013d8d547838ed4b9c69.1920x1080.jpg?t=1674775710,https://cdn.akamai.steamstatic.com/steam/apps/2284640/ss_b8703c0270293020d2b7ffdcf3b49df604799913.1920x1080.jpg?t=1674775710,https://cdn.akamai.steamstatic.com/steam/apps/2284640/ss_8724c74a828b37b86ca94eb781342e9ef55a82d9.1920x1080.jpg?t=1674775710",
    "Slug": "meteor-commander",
    "Meta Title": "METEOR COMMANDER: Jan 26, 2023, Propulsion Studios and Fu...",
    "Meta Description": "Looking for information on METEOR COMMANDER? Check out the release date (Jan 26, 2023), developer insights from Propulsion Studios, and a complete game ...",
    "Alt Text Image": "Official header image for METEOR COMMANDER game - Steam 2284640",
    "Canonical URL": "https://gusku.site/game/meteor-commander",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"METEOR COMMANDER\", \"description\": \"Looking for information on METEOR COMMANDER? Check out the release date (Jan 26, 2023), developer insights from Propulsion Studios, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 26, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Propulsion Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Propulsion Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2284640/header.jpg?t=1674775710\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}