{
    "AppID": 633150,
    "Name": "Mythlink",
    "Release date": "Jan 20, 2023",
    "About the game": "Mythlink is a VR-only monster battling game. Players can level up and battle with their Mythlink in hopes to form the best Mythlink Unity ever! So just what is a Mythlink? A Mythlink is a type of monster that players will select when the game begins. Once players have selected a Mythlink, a special bond begins to form between the player and their new friend. This link between player and Mythlink is called a 'Mythlink Unity' and is so powerful that as one of you improves, so does the other. Because of this, players themselves will take part in various strength, dexterity, and brain training exercises to improve both themselves and their Mythlink. Who will you choose? Minorod The rough and tough minotaur Mythlink who uses a mix of lightning and earth based abilities. Galest The goofy ghostly Mythlink, utilizes tricky wind and dark based abilities Urusagi The cute and cuddly rabbit Mythlink. Brings life to the party with sound and light abilities. Mythlinks have 3 stats which can be improved through playing the game. These stats are strength, brain, and speed. Picking the best way to improve your Mythlink stats is key to victory! Strength Helps your Mythlink deal more damage. Strength training includes games which involve punching and using force. Start sweating with training exercises like... Punching Bag : A no-holds-barred fanatic frenzy of you versus the bag! Pack as much of a wallop as you can in a short amount of time. Hit targets for bonus points and experience! Engine Buster : Some of the machines used to power the Mythlink training facility have started acting up! The best way to fix them? Punch them until they work or...at least until they stop spewing smoke. Punch Junction : The most diabolical game in the strength category, punch junction will test your focus, speed, and strength. Stay on your toes as you dodge machine attacks while attacking their weakpoints! Brain Helps your Mythlink learn more advanced moves. Test your quick thinking with... Pile Up : A VR twist on a classic block clearing game. Can you keep up? Don't let any pieces fall out of the box! Speed Helps your Mythlink move and react quicker. Speed training includes games which involve moving quickly. Baller Dodge : There's no fighting back in this 1-sided game of dodge ball! Last as long as you can as an onslaught of objects are thrown your way! Color Blitz : The strangest game of tag you'll ever play! Don't let any of the sporadically moving shapes slip by you. Once a Mythlink Unity is confident in their skills, they can join online and battle against other Mythlink Unities! Both players will be placed high on opposite ends of the arena where they can view all of the action. From that vantage point, players will control their Mythlink and utilize abilities in order to knock out the opposing Mythlink. These 1 on 1 battles will showcase the fruits of all efforts put into training. Each Mythlink has 30 abilities to choose from, most of which are completely unique to that Mythlink! Mythlink Unities can go into battle with up to 9 abilities equipped, so selecting your battle loadout wisely is key to victory. Will you go in with quick and low damaging basic attacks? Or come in swinging hard with big advanced moves? A mix of both? The choice is yours alone. Last Mythlink standing wins!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/633150/header.jpg?t=1674223235",
    "Price": 8.99,
    "Developers": "Home Point Games",
    "Publishers": "Home Point Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/633150/ss_9f1b08cfb221091d3bc029171594ee21c7cb5a67.1920x1080.jpg?t=1674223235,https://cdn.akamai.steamstatic.com/steam/apps/633150/ss_60aff47fae26f2011d1bf5aba4e8bb3649b31cda.1920x1080.jpg?t=1674223235,https://cdn.akamai.steamstatic.com/steam/apps/633150/ss_02c1088b9c6b92f14295534d21f02eabd0594bb7.1920x1080.jpg?t=1674223235,https://cdn.akamai.steamstatic.com/steam/apps/633150/ss_ce7c41c2715d74a317f543ec23fdcece1b3e9576.1920x1080.jpg?t=1674223235,https://cdn.akamai.steamstatic.com/steam/apps/633150/ss_95d7c3c63aa02cecc965ce8ba82508f7b5e2c05c.1920x1080.jpg?t=1674223235,https://cdn.akamai.steamstatic.com/steam/apps/633150/ss_12b0f74790b29e3dee9d4f72db55379791314ba7.1920x1080.jpg?t=1674223235,https://cdn.akamai.steamstatic.com/steam/apps/633150/ss_c239d427c4485bb191002cd9f855cd2f32368e50.1920x1080.jpg?t=1674223235,https://cdn.akamai.steamstatic.com/steam/apps/633150/ss_821d9fad33aaa03435bb44136602a58f3d1e6398.1920x1080.jpg?t=1674223235,https://cdn.akamai.steamstatic.com/steam/apps/633150/ss_43f2967fb2cbfa82b232fa5632312de9b6e4d732.1920x1080.jpg?t=1674223235,https://cdn.akamai.steamstatic.com/steam/apps/633150/ss_c639a6f8bc791ee04fbe678dba6c5f7a395a6b58.1920x1080.jpg?t=1674223235,https://cdn.akamai.steamstatic.com/steam/apps/633150/ss_1edac070957974d174a2ff9f91719ebc219caef2.1920x1080.jpg?t=1674223235",
    "Slug": "mythlink",
    "Meta Title": "Mythlink: Jan 20, 2023, Home Point Games and Full Overview",
    "Meta Description": "Looking for information on Mythlink? Check out the release date (Jan 20, 2023), developer insights from Home Point Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Mythlink game - Steam 633150",
    "Canonical URL": "https://gusku.site/game/mythlink",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mythlink\", \"description\": \"Looking for information on Mythlink? Check out the release date (Jan 20, 2023), developer insights from Home Point Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 20, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Home Point Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Home Point Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/633150/header.jpg?t=1674223235\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}