{
    "AppID": 1963370,
    "Name": "No One Survived",
    "Release date": "Jan 14, 2023",
    "About the game": "Game introduction: 'No One Survived' is a multiplayer survival sandbox game, always pay attention to your character status and those dangerous zombies. You need to explore and collect useful materials and build a shelter in the apocalypse. Learn the necessary knowledge, such as: medicine, electrical chemistry, tailoring, metallurgy, civil engineering, weapons manufacturing, etc. Use this knowledge to build more high-tech equipment to help you survive in this world. Game Features Explore: Open world map with multiple locations to explore. Make: More than 400 items, a variety of synthetic formulas, improve the level of technology, you can unlock more powerful formulas. Building: With nearly 150 buildables, design your own house and defend against the zombies' onslaught. Building load-bearing is based on a unique beam-column system, and you must plan your own beam-column structure reasonably to build a beautiful and beautiful house. Water and electricity system: Three kinds of power generation equipment, fuel power generation, thermal power generation, and solar power generation provide electricity for electrical equipment. Build a well, connect to a water storage station, a bathroom or sink to a water storage station, and take a shower at the end of the day. Tech Skills: Various skills to learn: medicine, electrification science, mechanics, tailoring, metallurgy, agriculture, cooking, civil engineering, weapons manufacturing. A variety of combat skills: blunt weapons, sharp weapons, firearms, physique. A technology tree that is gradually unlocked with skill improvement. Weaponry: A variety of available weapons, silent bows and arrows, powerful machetes to kill broken limbs, sledgehammers to knock down zombies, and a variety of firearms, which can be modified to shoot zombies from a distance. More than 100 kinds of wearable clothing, each clothing has its own attributes, you must choose the right clothing in different seasons. Survive: In a world where the four seasons change, each season will have different temperature changes and different weather changes. Certain resources disappear during certain seasons. In winter you need a greenhouse to grow crops. NPCs: Barter with merchants for resources. Make a good relationship with the businessman and learn skills from him. Character customization: The face pinching system can choose male and female characters, and the characteristics of random characters will directly affect all aspects of the characters' actions. Hunting: In the wild forest, there are many kinds of wild animals, including rabbits, deer, wild boars, wolves, bears, you can also attract zombies and animals to fight. Vehicle: Bring a trolley or drive a fuel truck to go out for doomsday search and resource collection. Real-time lighting system: Based on Lumen's real-time lighting system, for example, when you design a house, when the door or window is opened, the light will change in real time to get better lighting. (To use this system, Lumen global illumination needs to be turned on in the picture settings) Rich custom difficulty options: If you want more zombies, rich resources, etc., you can freely adjust to create your own zombie apocalypse.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1963370/header.jpg?t=1673693600",
    "Price": 15.29,
    "Developers": "Cat Play Studio",
    "Publishers": "Cat Play Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1963370/ss_2110fad0ad993808058cc0c7f3ffd28ec709c70a.1920x1080.jpg?t=1673693600,https://cdn.akamai.steamstatic.com/steam/apps/1963370/ss_58e7827a2318e40a84434602e4c9b1205bf9d640.1920x1080.jpg?t=1673693600,https://cdn.akamai.steamstatic.com/steam/apps/1963370/ss_4f0595a0f8b23d6b77490f55f18055d652cd8854.1920x1080.jpg?t=1673693600,https://cdn.akamai.steamstatic.com/steam/apps/1963370/ss_883223d5dcfcc78ddc2946ffb5070bde454c1bd8.1920x1080.jpg?t=1673693600,https://cdn.akamai.steamstatic.com/steam/apps/1963370/ss_da51e9cdf1e92fc0606de2fc5ffd3774b9ded032.1920x1080.jpg?t=1673693600,https://cdn.akamai.steamstatic.com/steam/apps/1963370/ss_30159642f93ceaedea11688e4a5a97e9abf147dc.1920x1080.jpg?t=1673693600,https://cdn.akamai.steamstatic.com/steam/apps/1963370/ss_68ffe6ed9e34babcc2c47af547100ffc8906286f.1920x1080.jpg?t=1673693600",
    "Slug": "no-one-survived",
    "Meta Title": "No One Survived: Jan 14, 2023, Cat Play Studio and Full O...",
    "Meta Description": "Looking for information on No One Survived? Check out the release date (Jan 14, 2023), developer insights from Cat Play Studio, and a complete game summ...",
    "Alt Text Image": "Official header image for No One Survived game - Steam 1963370",
    "Canonical URL": "https://gusku.site/game/no-one-survived",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"No One Survived\", \"description\": \"Looking for information on No One Survived? Check out the release date (Jan 14, 2023), developer insights from Cat Play Studio, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 14, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cat Play Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cat Play Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1963370/header.jpg?t=1673693600\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.29, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}