{
    "AppID": 2250820,
    "Name": "Party Party Time",
    "Release date": "Jan 11, 2023",
    "About the game": "A party game with simple controls anyone can enjoy! Play with up to six players! Experience a whole variety of intuitive, easy-to-play minigames. Shoot each other with water guns, work together to complete a picture, and enjoy a variety of games! Free Mode Choose the game you want to play! Party Mode Play your chosen games in order and compete for the most points! *Controllers are required for multiplayer play. Minigames: - Get Ball Push the ball to move it toward your goal. - Cannon Shot Move the crosshairs and hit the targets! - Block Wiper Use the wiper to move the blocks to your goal. - Bomb Roulette When you get a bomb, press the buttons to pass it to another player. - Cannon Defense Defeat robots to keep the castle walls safe. - Attack Ball Bump into other players to knock them off! - Bumper Tanks Attack other players to knock them off the screen. - Scroll Jump Move around without falling off of the floor! - Climb! Block Dodge the falling blocks while climbing. - Matching Dots Move the panels to complete the pixel art. - Timing Stamp Step on the line of light coming from the frame. - Mole Hammer Go after the mole and hit it with your hammer! - Water Shooter Shoot each other with your water guns and see who can drench the most people! - Spinning Cube Survive without falling off the rotating cube. - Everybody GO! Sync with your partner to reach the goal within the time limit. - Survival Reversi Aim for first place in turnless Reversi. - Jump and Dodge Jump to dodge the spinning bar! - Block Train Keep moving to avoid getting pushed off by the blocks. - Skydive Scramble Collect coins as you skydive! - Catch and Pong Catch the falling balls and put them in the box with the same color. - Shooting Ball Put balls in the basket and aim for the target number of points. - Everybody Calculate! Answer the set number of equations within the time limit. - Jumping without falling Jump onto the panel with the answer within the time limit. - Block Changer Change the blocks to get more blocks your own color! - Perfect fit! Dice Aim for the total value of the three die. - It's Thataway! Press the button indicated by the arrow! - Slope Jumping Jump to dodge the obstacles. - Perfect Timer Stop the timer at the displayed time.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2250820/header.jpg?t=1673482560",
    "Price": 3.49,
    "Developers": "SAT-BOX",
    "Publishers": "SAT-BOX",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2250820/ss_75ef270409c5bc498a04500653b6afc8c71f5cd7.1920x1080.jpg?t=1673482560,https://cdn.akamai.steamstatic.com/steam/apps/2250820/ss_d31e1ec821ae59dbe5b8c255dd1b8bf22cc5eda5.1920x1080.jpg?t=1673482560,https://cdn.akamai.steamstatic.com/steam/apps/2250820/ss_40a119ae4bc13e49050897d9721d4024aa20740a.1920x1080.jpg?t=1673482560,https://cdn.akamai.steamstatic.com/steam/apps/2250820/ss_eb3c8edc1448208c92cbbdf0e1a4e12b6c09c9a0.1920x1080.jpg?t=1673482560,https://cdn.akamai.steamstatic.com/steam/apps/2250820/ss_b38d343db3317152573c9f64159b2e638d33eb49.1920x1080.jpg?t=1673482560,https://cdn.akamai.steamstatic.com/steam/apps/2250820/ss_091676244f04804369e2dd082133118903b8b30c.1920x1080.jpg?t=1673482560",
    "Slug": "party-party-time",
    "Meta Title": "Party Party Time: Jan 11, 2023, SAT-BOX and Full Overview",
    "Meta Description": "Looking for information on Party Party Time? Check out the release date (Jan 11, 2023), developer insights from SAT-BOX, and a complete game summary.",
    "Alt Text Image": "Official header image for Party Party Time game - Steam 2250820",
    "Canonical URL": "https://gusku.site/game/party-party-time",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Party Party Time\", \"description\": \"Looking for information on Party Party Time? Check out the release date (Jan 11, 2023), developer insights from SAT-BOX, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 11, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"SAT-BOX\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SAT-BOX\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2250820/header.jpg?t=1673482560\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}