{
    "AppID": 2234720,
    "Name": "Project Sail",
    "Release date": "Jan 13, 2023",
    "About the game": "Project Sail is an open world naval combat game set in a fantastical pirate world. Project Sail is a top down third-person arcade shooter with RPG and rouge-like elements. The main story mode of Project Sail offers you the opportunity to discover unique locations, find hidden treasure, and battle against the pirate and royal navy factions. A separate arena mode also exists, challenging you to battle through enemy waves of increasing difficulty. Explore a vast and unique open world. In Project Sail you set out on expeditions to gain knowledge about the world and collect treasure. Each time you set out, your aim is to make it further than you ever have before. The open world of Project Sail includes many islands and points of interest, and contains clues for you to discover. Battle the enemy pirate and royal navy factions. Project Sail features top-down arcade combat, with point-and-click shooting mechanics. The open world is littered with enemy ship patrols, outposts, travelling ships, and navy forts. While exploring you will frequently face the choice of taking longer routes to avoid danger, or take your enemies head on. The arena mode also offers unlimited combat opportunities to test your pure ship-battling skills. Upgrade your ship. Both the story and arena modes allow you to incrementally upgrade your ship through four different stages - from a measly cog up to the mighty galleon. Ship upgrades offer you greater cargo capacity, greater durability, improved speed, and best of all, improved firepower. Ship upgrades are purchased using coins collected by selling treasure you collect on voyages. Manage your inventory. Your ship has a limited cargo capacity, so how you manage your goods is critical to optimizing expeditions. Your crew requires food that runs out over time - once it's gone, your voyage will come to a bitter end. You may also carry lumber, which is used to repair you ship in case it takes damage. Finally, you must also carry cannonballs - their use is self explanatory. Any treasure you collect also fills your cargo capacity, so excessive greed may cause you sacrifice on essential materials necessary to make it back to port. Uncover a unique story. The story mode in Project Sail sees you uncover mysteries by finding various clues and notes in bottles hidden around the world. As you find more information, you will start to learn that your destiny extends beyond just finding treasure. A secret plot is brewing in the seas, with factions seeking to gain absolute control over the region. In the final battle you may experience new dangers from the depths of the sea...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2234720/header.jpg?t=1673636781",
    "Price": 11.99,
    "Developers": "Lukas Kuppers",
    "Publishers": "Lukas Kuppers",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2234720/ss_bcd225f97467788da521d15e3d7f80db1fb3a823.1920x1080.jpg?t=1673636781,https://cdn.akamai.steamstatic.com/steam/apps/2234720/ss_162605a622ca38c7f4ff9b26c1c932f4bc536630.1920x1080.jpg?t=1673636781,https://cdn.akamai.steamstatic.com/steam/apps/2234720/ss_9e3b6f717bb8be06937a9f5fb31ec46b57f08c8b.1920x1080.jpg?t=1673636781,https://cdn.akamai.steamstatic.com/steam/apps/2234720/ss_c7a0cb85a83948845c678e9ed1a98203cab39b6f.1920x1080.jpg?t=1673636781,https://cdn.akamai.steamstatic.com/steam/apps/2234720/ss_c79acdba39c94539e87fa85433f9b4484830e120.1920x1080.jpg?t=1673636781,https://cdn.akamai.steamstatic.com/steam/apps/2234720/ss_89334257704677392746ad2933da50f44e9cb137.1920x1080.jpg?t=1673636781",
    "Slug": "project-sail",
    "Meta Title": "Project Sail: Jan 13, 2023, Lukas Kuppers and Full Overview",
    "Meta Description": "Looking for information on Project Sail? Check out the release date (Jan 13, 2023), developer insights from Lukas Kuppers, and a complete game summary.",
    "Alt Text Image": "Official header image for Project Sail game - Steam 2234720",
    "Canonical URL": "https://gusku.site/game/project-sail",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Project Sail\", \"description\": \"Looking for information on Project Sail? Check out the release date (Jan 13, 2023), developer insights from Lukas Kuppers, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 13, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lukas Kuppers\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lukas Kuppers\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2234720/header.jpg?t=1673636781\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}