{
    "AppID": 1808490,
    "Name": "Robo Maestro",
    "Release date": "Jan 20, 2023",
    "About the game": "Robo Maestro is a procedural music toy. It’s a revolutionary new way of creating and experiencing music! You tell it what you want, and then the Maestro automatically generates music that fits that. Playing Robo Maestro requires no music knowledge at all: just have fun and hear what happens! Guide the Maestro and create awesome music together with it! Maestro Mode Maestro Mode is a fun, relaxing experience where the music constantly evolves based on your choices. The Maestro generates random options that you can choose from to alter the music. Hear something you like? Store it as a chorus to come back to later, or save it for usage in the editors. Loop Editor Build your own loops and define details like instruments, layers, intensity and random seeds. Whatever you do, Robo Maestro makes sure it always fits with the rest of the music! Song Editor Combine your loops to create complete songs! Own your creations Share your music with friends, or open it in any other music software to continue editing there. Export as MIDI, WAV or each layer as a separate WAV. What you create with Robo Maestro is yours to use in any way you like! Optional deep tweaks You can also dive deeper and define the chords and time signatures yourself. You don’t have to though: Robo Maestro can figure everything out itself, so you don’t need to know any music theory to use it. But if you want, you can get more detailed control. Jam companion Jam along to Robo Maestro on your favourite instrument or vocals! This automatic mode will let Robo Maestro endlessly evolve the music, fully automatically, as a backing for your own improvisation. Or enable the full features and just sit back and be surprised by what Robo Maestro can generate! Advanced music AI Robo Maestro is powered by an advanced procedural music generator. Dozens of algorithms work together to create each aspect of a song: drums, bass, melody, chords, rhythm, notes and much, much more. You can control each step individually, or just let Robo Maestro generate a complete loop and make tweaks from there. Features Highly advanced procedural music algorithms 5 modes, including Loop Editor, Song Editor and the Step-By-Step loop wizard 60+ instruments Several musical styles, including chiptune, acoustic and synths 8 layer types, each with their own procedural algorithm Control intensity, pitch, volume, instrument and seed of each layer 50+ different actions in Maestro Mode Export as MIDI, as WAV or each layer to a separate WAV Build loops yourself, or have them generated fully automatically Jam Companion: play along to endless new music",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1808490/header.jpg?t=1674248205",
    "Price": 0.0,
    "Developers": "Joost van Dongen",
    "Publishers": "Joost van Dongen",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1808490/ss_85dadcb67408e761a813e59115d03f6e7acae13c.1920x1080.jpg?t=1674248205,https://cdn.akamai.steamstatic.com/steam/apps/1808490/ss_975a295c23f2e6d1f7af91c1a4223254a1d53c96.1920x1080.jpg?t=1674248205,https://cdn.akamai.steamstatic.com/steam/apps/1808490/ss_58166ca711d03e3d60b3a0fb2f430d604ee49814.1920x1080.jpg?t=1674248205,https://cdn.akamai.steamstatic.com/steam/apps/1808490/ss_59cae75e97db8ccf6a6114656df42d58be6eab61.1920x1080.jpg?t=1674248205,https://cdn.akamai.steamstatic.com/steam/apps/1808490/ss_57238edab2df06adf8fa733e91391310d71ab56b.1920x1080.jpg?t=1674248205",
    "Slug": "robo-maestro",
    "Meta Title": "Robo Maestro: Jan 20, 2023, Joost van Dongen and Full Ove...",
    "Meta Description": "Looking for information on Robo Maestro? Check out the release date (Jan 20, 2023), developer insights from Joost van Dongen, and a complete game summary.",
    "Alt Text Image": "Official header image for Robo Maestro game - Steam 1808490",
    "Canonical URL": "https://gusku.site/game/robo-maestro",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Robo Maestro\", \"description\": \"Looking for information on Robo Maestro? Check out the release date (Jan 20, 2023), developer insights from Joost van Dongen, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 20, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Joost van Dongen\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Joost van Dongen\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1808490/header.jpg?t=1674248205\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}