{
    "AppID": 2158670,
    "Name": "RPG Architect",
    "Release date": "Jan 20, 2023",
    "About the game": "Ready to build your next great adventure? RPG Architect is a next-generation game maker with all of the limitations removed. It is designed to be simple enough for a newcomer and advanced enough for a veteran of game making engines. Take your vision and rapidly build it into something playable! Design without limitations. One of the guiding principles of RPG Architect is to remove arbitrary limitations and templates that are generally imposed by other game maker engines. You have control of literally everything: user interface design, unlimited layers in maps, 2D or 3D visualization, pixel or tile movement, battle system, controls/inputs, statistics, and so much more. With the freedom to stack multiple layers, decorative doodads, lighting and shaped terrain, you are in control of each step of the design process. Simple enough for a newcomer; advanced enough for a veteran. Converting a map from 2D to 3D is as simple as drawing a 'height' on top of a tile. Our powerful map editor lets you visualize your scene from a birds eye view, as with most traditional RPGs, and transforms it in game. Set shapes on tiles to adjust how they render and react in 2D and 3D. The editor supports effectively infinite layers. Build your world from the ground up using the Layers panel, optionally onion-skin the layers to focus on a few at a time or hide layers you don’t need to see in the moment. Built by makers for makers. Our core team has been playing with various makers for over two decades. We want to help address many of the concerns we've had, as well as members of the community. There's no reason that it shouldn't be simple to configure and adjust everything in an engine. Our goal is to work with the community and grow RPG Architect to fit the needs of all of the talented and creative visionaries out there. With a robust User Interface designer, create your own message boxes, menus, screen overlays, battle menus and build templates that you can use throughout your game! For party characters, customize their look by using the built-in sprite layering system. Build and change character appearances. The sprite system supports 8-directional movement and can customize both the number of frames in a cycle and the time between separated frames. Unconfined to a genre. Despite the fact that 'RPG' is in our name, you can build more than RPGs -- RPG Architect is powerful enough to build action/adventure games, platformers, shooters, and more! Several different display modes and movement options are included -- 2D,3D, Orthographic or First Person, alongside grid or pixel-based movement schemes -- giving you several options to build the look and feel that you want. Many different genres are possible with RPG Architect, and the only real limit is your imagination. Resources galore! Remember how we're makers too? We're leveraging our connections to build a diverse amount of resources. In addition, many of the resources from your other engines are already compatible! So, take what you already have and use it again. Contributors: 42 songs and 200+ sound effects from Bit By Bit Sound Open RPG Fantasy Tilesets from Final Boss Blues Low and High Resolution Character Sprites from Jason Martin",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2158670/header.jpg?t=1674320055",
    "Price": 29.74,
    "Developers": "Monster and Robot L.L.C.",
    "Publishers": "Monster and Robot L.L.C.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2158670/ss_3cced9bd58878ac3ac2a8f49a19441b177557af7.1920x1080.jpg?t=1674320055,https://cdn.akamai.steamstatic.com/steam/apps/2158670/ss_98de16970df9b3a77d4eeeba3247d4e56e7dff42.1920x1080.jpg?t=1674320055,https://cdn.akamai.steamstatic.com/steam/apps/2158670/ss_e7a5476a0908209075efb05cb1c988140334d0d8.1920x1080.jpg?t=1674320055,https://cdn.akamai.steamstatic.com/steam/apps/2158670/ss_cefc0d6c0eef2e5a177f1deefec5768e0dbad342.1920x1080.jpg?t=1674320055,https://cdn.akamai.steamstatic.com/steam/apps/2158670/ss_fb4a443fc7edba85f5abb6c9d9ebf6a0dd058884.1920x1080.jpg?t=1674320055,https://cdn.akamai.steamstatic.com/steam/apps/2158670/ss_7be1c5ba3c652f3583e2d7c708ac0b375b0efb78.1920x1080.jpg?t=1674320055,https://cdn.akamai.steamstatic.com/steam/apps/2158670/ss_00ba39d7b4b9b53473e976b44d6bc4eb9f0641ef.1920x1080.jpg?t=1674320055,https://cdn.akamai.steamstatic.com/steam/apps/2158670/ss_d19eb94fec067548e4f0a72dc3237975571cfb5b.1920x1080.jpg?t=1674320055",
    "Slug": "rpg-architect",
    "Meta Title": "RPG Architect: Jan 20, 2023, Monster and Robot L.L.C. and...",
    "Meta Description": "Looking for information on RPG Architect? Check out the release date (Jan 20, 2023), developer insights from Monster and Robot L.L.C., and a complete ga...",
    "Alt Text Image": "Official header image for RPG Architect game - Steam 2158670",
    "Canonical URL": "https://gusku.site/game/rpg-architect",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RPG Architect\", \"description\": \"Looking for information on RPG Architect? Check out the release date (Jan 20, 2023), developer insights from Monster and Robot L.L.C., and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 20, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Monster and Robot L.L.C.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Monster and Robot L.L.C.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2158670/header.jpg?t=1674320055\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.74, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}