{
    "AppID": 2271300,
    "Name": "Safehouse",
    "Release date": "Jan 22, 2023",
    "About the game": "Safehouse In Safehouse , the thrilling social deduction game where you and up to 4 other friends will become members of a notorious criminal crew, holed up in a Safehouse. But beware! Among your ranks lurks a traitor, secretly working with the enemy to bring you all down. It's a race against time as you try to uncover the traitor's identity and eliminate them before they can betray the crew. Inspired by the iconic style of Quentin Tarantino, this game is full of deception, betrayal, and high-stakes action. Can you outmaneuver your opponents and emerge victorious, or will you be betrayed and brought down? Gameplay In this cutthroat game of deception, you'll need to use all of your cunning and strategic skills to outmaneuver your opponents. Talk to other players, form alliances, and gather information through the security camera to try and sniff out the traitor in your midst. But watch your back, because the traitor will stop at nothing to throw you off their scent, including pretending to be loyal and misleading you with false information. And if all else fails, they can always resort to drastic measures like blowing open the safe and arming themselves with a Semi-Automatic Weapon to take out the crew. Do you have what it takes to survive in the game of deception and betrayal? Customization As a player, you have the opportunity to customize your very own Safehouse, selecting from up to three different floor plans for each floor. By earning enough money, you can even build businesses inside your Safehouse, such as a Poker Racket, Drug Lab, or Bar. Plus, you can upgrade your shabby bedroom into a luxurious criminal office worthy of an underworld boss. The game takes place within this Safehouse, so make sure to upgrade it to impress your friends and intimidate your enemies. In this game, you have the ability to customize your very own criminal character. Choose from a variety of customization options to make them look tough, menacing, or whatever you desire. The characters in this game are stylized and inspired by graphic novels, with a gritty, crime-filled aesthetic. Make your character stand out in the seedy underworld of this game world. Features Play with 3-5 players online. Victory can be achieved by eliminating the traitorous Rats, or by surviving as a Rat and taking out the rest of the crew. Monitor the security cameras to keep an eye on the other members of the criminal crew. If you are the traitorous Rat, you can retrieve an SMG from one of the safes to use against the unsuspecting members of the crew. Upgrade your Safehouse to build businesses and earn multipliers for your reward.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2271300/header.jpg?t=1674374510",
    "Price": 5.39,
    "Developers": "Gecco Studio Games",
    "Publishers": "Gecco Studio Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2271300/ss_c64651f4509191055c718a6882c94d8d871e8497.1920x1080.jpg?t=1674374510,https://cdn.akamai.steamstatic.com/steam/apps/2271300/ss_b35087bd3500b6a3d1b91a3c4e59b6a83f407338.1920x1080.jpg?t=1674374510,https://cdn.akamai.steamstatic.com/steam/apps/2271300/ss_a9c343a3bd58db32cd6170d2db9886bc95432717.1920x1080.jpg?t=1674374510,https://cdn.akamai.steamstatic.com/steam/apps/2271300/ss_26ca52b175bd5137464a91912a03d8e2973d3624.1920x1080.jpg?t=1674374510,https://cdn.akamai.steamstatic.com/steam/apps/2271300/ss_4e812a932c1661267accb36332ea5b3612fd3b60.1920x1080.jpg?t=1674374510,https://cdn.akamai.steamstatic.com/steam/apps/2271300/ss_d837468130a75d990c50d58f5d33dc1480c185d3.1920x1080.jpg?t=1674374510,https://cdn.akamai.steamstatic.com/steam/apps/2271300/ss_221a3e76ad854b45a82634dceb1714a1698fc7b1.1920x1080.jpg?t=1674374510,https://cdn.akamai.steamstatic.com/steam/apps/2271300/ss_59381c7f9ebc9ee8ae8a0160129b0a8ac664483a.1920x1080.jpg?t=1674374510,https://cdn.akamai.steamstatic.com/steam/apps/2271300/ss_86011b0040ebd2bda685766bff93c60cc3d32e54.1920x1080.jpg?t=1674374510,https://cdn.akamai.steamstatic.com/steam/apps/2271300/ss_05884058a32188bfee0f35919848796cd995062c.1920x1080.jpg?t=1674374510",
    "Slug": "safehouse",
    "Meta Title": "Safehouse: Jan 22, 2023, Gecco Studio Games and Full Over...",
    "Meta Description": "Looking for information on Safehouse? Check out the release date (Jan 22, 2023), developer insights from Gecco Studio Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Safehouse game - Steam 2271300",
    "Canonical URL": "https://gusku.site/game/safehouse",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Safehouse\", \"description\": \"Looking for information on Safehouse? Check out the release date (Jan 22, 2023), developer insights from Gecco Studio Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 22, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gecco Studio Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gecco Studio Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2271300/header.jpg?t=1674374510\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}