{
    "AppID": 2058200,
    "Name": "Showrunner",
    "Release date": "Jan 17, 2023",
    "About the game": "Create your show Name your show then pick a genre (options include drama, comedy, procedural, thriller or mystery) and a theme (for example sci-fi, fantasy, medical, office or historical). Score a lucrative contract with a television or streaming company as long as you can meet the goals they set for you! Craft scripts Lay out episode scripts by playing scene cards, defining the overall story structure. Each card will increase the score of the script in various categories (plot, characters, visuals, comedy, drama, action) with smart selections and powerful combinations earning special bonuses. Unlock new and more powerful cards over time. Gradually define themes for each season that pair well with your scripts and characters. Make characters and select actors Pick an archetype for each character then try to find an actor that fits the bill. Define the character’s appearance from extensive customisation options then develop them over time to be more nuanced and unique by picking perks that further characterise them and provide major boosts. Hire and manage staff Hire writers to complete scripts, directors and crew to handle filming and editors to bring together the final cut. Staff have varying stats and classes which tend towards specific strengths and weaknesses and they gain experience over time. Rotate and rest your team to manage their energy and keep everyone working at their best. Design and manage your studio Buy items and furniture to personalise and improve your studio, gaining staff boosts in the process. Build new rooms, upgrade existing ones and increase your studio's reputation. Manage this while trying to balance your finances and keep your studio in the black! Make episodes and gain fans With the outline for a script ready the writing team will work their magic from there. Have your actors, directors and crew film the scenes then the editors wrap things up. Build a dedicated following for your show and grow interest with good reviews and popular characters.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2058200/header.jpg?t=1673959332",
    "Price": 8.09,
    "Developers": "Inexplicable Games",
    "Publishers": "Inexplicable Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2058200/ss_592a7b415283c0976131f712db4377524fc30cd5.1920x1080.jpg?t=1673959332,https://cdn.akamai.steamstatic.com/steam/apps/2058200/ss_62968901e83847a3585d9b064eadb1e74e89520c.1920x1080.jpg?t=1673959332,https://cdn.akamai.steamstatic.com/steam/apps/2058200/ss_6aca7344c4336f3fa8e37303813e5a1d79456bef.1920x1080.jpg?t=1673959332,https://cdn.akamai.steamstatic.com/steam/apps/2058200/ss_f6cbeb10f48ff19605c4cbf954c818ec25ee124e.1920x1080.jpg?t=1673959332,https://cdn.akamai.steamstatic.com/steam/apps/2058200/ss_5378b056ad4be4a4113215a5fedbf8fcf26b72ea.1920x1080.jpg?t=1673959332",
    "Slug": "showrunner",
    "Meta Title": "Showrunner: Jan 17, 2023, Inexplicable Games and Full Ove...",
    "Meta Description": "Looking for information on Showrunner? Check out the release date (Jan 17, 2023), developer insights from Inexplicable Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Showrunner game - Steam 2058200",
    "Canonical URL": "https://gusku.site/game/showrunner",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Showrunner\", \"description\": \"Looking for information on Showrunner? Check out the release date (Jan 17, 2023), developer insights from Inexplicable Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 17, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Inexplicable Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Inexplicable Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2058200/header.jpg?t=1673959332\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.09, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}