{
    "AppID": 2228150,
    "Name": "The Soul's Choice",
    "Release date": "Jan 27, 2023",
    "About the game": "Story First of all, you should know that a perilous mission is waiting for you. I think there are some things you should know before starting this mission. A boy who lived in this house many years ago invites his friends to the house. Adventure-seeking children want to talk to a deceased relative using the ouija board. But things don't go well. Unfortunately, the person who came with the established connection was not the person they expected. A malevolent soul came to this world with the connection established. The first thing he did as soon as he arrived was to kill those who summoned him. The common views of the psychics who came to examine the house after this event caused this house to be abandoned. The psychics said that an evil soul possessed this house and that he had divided his soul into objects so as not to be destroyed. So this soul is very smart and very dangerous. Now you know the story of this house. Let me give you a few more tips. If you enter the house with your team to destroy this soul, this soul will take over the body of the one you. And it will try to prevent you from destroying it by killing you. I told you he was smart and dangerous. In this case, the person you think is from your team can become a soul and kill you. Or you can become a soul and kill your team. The last clue I can give you is that the psychics have determined that the evil soul is dividing its soul into the voodoo dolls in the house. What you need to do is to pay attention to those around you while collecting the voodoo dolls at home. Don't be distracted by the corpses you can see while you're trying to complete your quest. Once all the voodoo dolls have been captured, the spirit will perish And one last thing. Don't worry about what will happen if you are the chosen one. Remember it wasn't you! Be careful!... Single Player Mode Compete against the clock in single-player mode. There are 10 voodoo dolls that you must collect in order to destroy the soul entity within the specified time. Speed through the house without fear and collect voodoo dolls to destroy the soul entity. Multiplayer Mode (4-10 players) Reach heights of fun and tension by playing with your friends in multiplayer mode. Specify how many players there will be at most during the game setup phase and how many of them will be soul entities. And start the tension-filled minutes by inviting your friends to the game. Roles The game has 2 roles: Soul entity and human. And according to the role you have, here are the things you should do; Soul Entity Role Remember, your whole soul is divided into voodoo dolls. If all the voodoo dolls are gone, you're gone too. That's why you have to kill all the people without revealing yourself. Sometimes in the game, there may be different spirits like you. But you will not know that they are spirits. So you really have to make sure you're trying to kill a person. Because you don't kill souls and you don't want to waste time. Note: You must remember that you cannot kill people in a row. You can kill another human after a certain amount of time, so you have to strategize accordingly. Human Role The goal is to destroy the soul entity and the only way is to have all the voodoo dolls in the game collected. While collecting voodoo dolls, you have to stand by them for a certain period of time. That's why you have to be very careful. Because you will not know who is a human and who is a soul entity. You still have to collect and destroy the voodoo dolls if you die. Remember, the only way for the soul entity to die is for all the voodoo dolls to perish. So even if you are a dead person, you have to help the living people. Try to play without fear because tension-filled moments are waiting for you. Common Characteristics of Roles Flashlights are available in both roles and they need to use their flashlights correctly while performing their duties. The playground is a very dark environment and you will not want to reveal your places. Don't forget to use the dark well...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2228150/header.jpg?t=1674836233",
    "Price": 4.99,
    "Developers": "IV Games",
    "Publishers": "IV Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2228150/ss_a21a01dc1da0107cd25d6d9576bf1920b40dc292.1920x1080.jpg?t=1674836233,https://cdn.akamai.steamstatic.com/steam/apps/2228150/ss_1866f42385250b30577e30e6e96b8147c124e4d2.1920x1080.jpg?t=1674836233,https://cdn.akamai.steamstatic.com/steam/apps/2228150/ss_ec565443df00b7017ef4cbb64d67720e00aa4855.1920x1080.jpg?t=1674836233,https://cdn.akamai.steamstatic.com/steam/apps/2228150/ss_ae9e760efa91bedc21372ebd9fffea2c390d88f2.1920x1080.jpg?t=1674836233,https://cdn.akamai.steamstatic.com/steam/apps/2228150/ss_666acdab182dfe7b2d2f26323fa4b7c718307f70.1920x1080.jpg?t=1674836233,https://cdn.akamai.steamstatic.com/steam/apps/2228150/ss_486ef809d45989d5a1f790aa139867fcc0a26ddf.1920x1080.jpg?t=1674836233",
    "Slug": "the-soul-s-choice",
    "Meta Title": "The Soul's Choice: Jan 27, 2023, IV Games and Full Overview",
    "Meta Description": "Looking for information on The Soul's Choice? Check out the release date (Jan 27, 2023), developer insights from IV Games, and a complete game summary.",
    "Alt Text Image": "Official header image for The Soul's Choice game - Steam 2228150",
    "Canonical URL": "https://gusku.site/game/the-soul-s-choice",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Soul's Choice\", \"description\": \"Looking for information on The Soul's Choice? Check out the release date (Jan 27, 2023), developer insights from IV Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 27, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"IV Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"IV Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2228150/header.jpg?t=1674836233\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}