{
    "AppID": 2239000,
    "Name": "The Forgotten Tapes: Analog Nightmares",
    "Release date": "Jan 23, 2023",
    "About the game": "The Forgotten Tapes: Analog Nightmares is a collection of 9 games from various developers all focusing on a central theme. The game allows the player to choose from a series of VHS tapes &amp; play a story based on said theme. Forgotten Tapes is the first collection in a new series from up &amp; coming developers, from a community of multi-talented individuals with varying degrees of experience. Forgotten Tapes: Analog Nightmares will spook, scare &amp; make you question what you just saw out of the corner of your eye. The theme for this collection is Analog Horror. We understand that Analog Horror can be many things. A Radio, a TV, or even a Camera. But we have 9 carefully curated stories to tell that you may not have seen before, with some surprising twists along the way. Analog Horror has been a staple in the Horror genre for many years, &amp; now we want to bring our stories to life. So grab your floppy disks, load up &amp; get ready for an exciting trip down Analog lane! The Other One: Directed by TobiasM An innocent trip to an abandoned house ended with the discovery of worlds and secrets that he would rather never learn about. A seemingly ordinary camera playing seemingly ordinary recordings will reveal a reality that will change his perception of the world forever. UV Goggles: Directed by Lachlan Shelton Gretchen Toys has released their ALL NEW pair of UV Goggles! View secret messages and drawings with the most advanced ultra-violet vision goggles your kids will ever use! **DISCLAIMER** Gretchen Toys is not liable for any disappearances or damage done to consumers when in use of the product. Consume: Directed by Aaron Wise An eerie emergency broadcast echoes through the house but all is quiet. Where did everyone go? Reports of violence &amp; strange behavior among individuals are affecting your local area. Not everything is as it seems. The Door: Directed by Luke Van Zandt Explore a mysterious facility while satiating strange forces. Whatever you do, do not open the door that knocks. Garrison Broadcast: Directed by Vidas Salavejus There is no world. There's no one out there for you. TV screen is Garrison. Don't go outside. Never go outside. Bobo's Quest: Directed by D. Zenith After finding an old tape recording of an unfinished game your grandfather used to work on before his mysterious disappearance, you decide to take a peek at 'Bobo's Quest'. Though you soon find out that things aren't what they seem. Night Sight: Directed by VoltzGamez Control footage of a person's day-to-day life as you watch strange occurrences unfold. Funhouse of Blood: Directed by Sulfer Old documentary footage that was lost shortly after it was broadcasted in the late 70s is found &amp; harbors a dark secret. The Mineshaft: Directed by Elegant Crow During a hunting trip on a snowy day, you and your friend split up and someone else starts talking through your walkie-talkie, this mysterious stranger needs help and takes you to an abandoned mineshaft. - 9 games to play through each with its own unique vision, story &amp; style. - A hub world to walk around at your own pace, and discover VHS tapes to play! - All games are available from the start, with no complex puzzles or hoops to jump through. We got you! - Scares, atmosphere &amp; a great time. - Up-and-coming developers who have great imaginations &amp; no restrictions on their stories.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2239000/header.jpg?t=1674484062",
    "Price": 6.29,
    "Developers": "Aaron Wise,Vidas Salavejus,Lachlan Shelton,TobiasM,VoltzGamez,Luke Van Zandt,Elegant Crow,Sulfer,D. Zenith",
    "Publishers": "Bloody Vulpine",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2239000/ss_173ad960f12485c23ea18cfc0e35876d83b476ff.1920x1080.jpg?t=1674484062,https://cdn.akamai.steamstatic.com/steam/apps/2239000/ss_9f8b17c1b2de3e033605ca00a78d7a70ac1f935c.1920x1080.jpg?t=1674484062,https://cdn.akamai.steamstatic.com/steam/apps/2239000/ss_2e29a4ac27d2cceecb90760a23c053e4a2dbce01.1920x1080.jpg?t=1674484062,https://cdn.akamai.steamstatic.com/steam/apps/2239000/ss_4af6a3d61ad340fde0eb1932915fef9de98feee7.1920x1080.jpg?t=1674484062,https://cdn.akamai.steamstatic.com/steam/apps/2239000/ss_ad5b2b6fa5c93e9a8fb8180bc285eaeda2c4dcb4.1920x1080.jpg?t=1674484062,https://cdn.akamai.steamstatic.com/steam/apps/2239000/ss_c51f77f7cc1bcef3ae21339c51921bb4faa7f9e7.1920x1080.jpg?t=1674484062,https://cdn.akamai.steamstatic.com/steam/apps/2239000/ss_f95e080998438604bfb26b227852c8251466a351.1920x1080.jpg?t=1674484062,https://cdn.akamai.steamstatic.com/steam/apps/2239000/ss_28e2ea7d6365877c507e6e845b53de2841f9df84.1920x1080.jpg?t=1674484062,https://cdn.akamai.steamstatic.com/steam/apps/2239000/ss_6a62cd1de491a396e74c7e1e263a98a381a908ef.1920x1080.jpg?t=1674484062",
    "Slug": "the-forgotten-tapes-analog-nightmares",
    "Meta Title": "The Forgotten Tapes: Analog Nightmares: Jan 23, 2023, Aar...",
    "Meta Description": "Looking for information on The Forgotten Tapes: Analog Nightmares? Check out the release date (Jan 23, 2023), developer insights from Aaron Wise,Vidas S...",
    "Alt Text Image": "Official header image for The Forgotten Tapes: Analog Nightmares game - Steam 2239000",
    "Canonical URL": "https://gusku.site/game/the-forgotten-tapes-analog-nightmares",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Forgotten Tapes: Analog Nightmares\", \"description\": \"Looking for information on The Forgotten Tapes: Analog Nightmares? Check out the release date (Jan 23, 2023), developer insights from Aaron Wise,Vidas S...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 23, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aaron Wise,Vidas Salavejus,Lachlan Shelton,TobiasM,VoltzGamez,Luke Van Zandt,Elegant Crow,Sulfer,D. Zenith\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bloody Vulpine\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2239000/header.jpg?t=1674484062\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.29, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}