{
    "AppID": 2248880,
    "Name": "The Cullfield Ritual",
    "Release date": "Jan 5, 2023",
    "About the game": "The Cullfield Ritual places right in the middle of a dangerous ritual game. Travel between reality and the 'Spiritual Realm' in order to solve puzzles, collect all the remaining soul fragments, and bring your loved one back to life. In order to prepare the 'Spiritual Realm' for human passage, you'll have to send through a sacrifice first, referred to as a pilgrim. Beware though, the Pilgrim will remain in the 'Spiritual Realm' for the duration and seek vengeance. HOW TO PERFORM THE RITUAL The ritual was first discovered in the year of 1872 by a group of self proclaimed spiritualists from the rural village of Cullfield. This ritual is performed by traversing both reality and the spirit realm. Should you succeed in the ritual, a loved one can be brought back from the dead. However, should you fail, your soul will be absorbed by the spirit realm once and for all. The ritual is complicated, so read the following carefully. Firstly, a form of life must be transferred into the spirit realm to prepare it for the safe passage of the living, hereafter referred to as the pilgrim. The pilgrim you choose will also affect you adversely, so choose wisely. You must end the life of your pilgrim, consume a portion of its blood, and go to sleep right away. You'll now wake up and your house will be altered drastically. In order to conquer the ritual, you must gather 5 spirit remains of the loved one you're attempting to bring back, placing them in the corners of the pentagram. Some puzzles and items are only visible in the Spirit Realm, and you'll need to alternate between both realms in order to gather all the spirit remains. In order to enter the spirit realm, you'll need to follow these steps. PREPARATION: 1. Obtain the spirit candle. 2. Obtain chalk and draw a pentagram in a room. 3. Open all the doors in the house to allow the pilgrim to traverse freely. Accidentally blocking it's path will have detrimental effects. ENTERING THE SPIRIT REALM: 1. Turn off all the lights in your home via the distribution board 2. Hold the candle in your left hand. 3. Light the candle. You have now entered the spiritual realm, but beware, you're not the only one there. The pilgrim will be wandering, looking for a chance to take revenge. Should the pilgrim spot you, you may enter into hiding or exit the spirit realm before getting caught. Your stay in the spiritual realm is limited, and if your candle gets blown out you'll only have a few seconds to exit the spirit realm. Should you get caught or fail to leave the spirit realm in time, you'll normally be taken. However, you’ll notice that there are three crucifixes on your wall. Each time you get caught a crucifix is consumed. If you get caught with no crucifixes left there will be no protection. LEAVING THE SPIRIT REALM: In order to exit the spirit realm, you'll need to turn the lights back on and put the candle out.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2248880/header.jpg?t=1672951434",
    "Price": 3.99,
    "Developers": "TheDollarGameStore",
    "Publishers": "TheDollarGameStore",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2248880/ss_e8c57050774bac8642e410543637545d56122239.1920x1080.jpg?t=1672951434,https://cdn.akamai.steamstatic.com/steam/apps/2248880/ss_5592bb31b2c151f66e5d2c1dd87fcf41e6ebd1ef.1920x1080.jpg?t=1672951434,https://cdn.akamai.steamstatic.com/steam/apps/2248880/ss_4c4809ec8f759dd32c3012ea2aee3736883893d6.1920x1080.jpg?t=1672951434,https://cdn.akamai.steamstatic.com/steam/apps/2248880/ss_72c60c98d3a2cc2b243a13e4e23dea1fd9acb654.1920x1080.jpg?t=1672951434,https://cdn.akamai.steamstatic.com/steam/apps/2248880/ss_1941abba182a284b2799ca81ee0a0f03891da45a.1920x1080.jpg?t=1672951434,https://cdn.akamai.steamstatic.com/steam/apps/2248880/ss_042b320260f0396d89939dfc7bf29dd2bbd362cd.1920x1080.jpg?t=1672951434",
    "Slug": "the-cullfield-ritual",
    "Meta Title": "The Cullfield Ritual: Jan 5, 2023, TheDollarGameStore and...",
    "Meta Description": "Looking for information on The Cullfield Ritual? Check out the release date (Jan 5, 2023), developer insights from TheDollarGameStore, and a complete ga...",
    "Alt Text Image": "Official header image for The Cullfield Ritual game - Steam 2248880",
    "Canonical URL": "https://gusku.site/game/the-cullfield-ritual",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Cullfield Ritual\", \"description\": \"Looking for information on The Cullfield Ritual? Check out the release date (Jan 5, 2023), developer insights from TheDollarGameStore, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 5, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"TheDollarGameStore\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TheDollarGameStore\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2248880/header.jpg?t=1672951434\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}