{
    "AppID": 2230170,
    "Name": "The Cenozoic Era",
    "Release date": "Jan 20, 2023",
    "About the game": "Welcome to The Cenozoic Era The Cenozoic Era is built on the principle of being a realistic open world animal survival game, where the player takes control of a creature and fights to survive within their environment. Discover everything and uncover mysteries along the way. Explore vast and beautiful landscapes: from the rocky regions, to lakes, valleys, mountains and even the sky! Make the gameplay your own. There is nothing stopping you from personalizing your creature's survival journey each time you step into The Cenozoic's naturalistic world, an open and limitless experience. Be conscious that if you die, your game will start all over again, Or choose a new animal from the 4 game slots, This multiplayer adventure offers a brutality that will teach you how to hunt, survive and thrive in this untamed world. Your creatures survival story, their fights and struggles, will be told through the visible wounds and tattered conditions. Online Open World Survival When logging into one of our servers you will be given options of what creature you can start a survival journey on. Our servers will offer 100+ online player's with the intentions of surviving. As a predatory creature you will need to learn how to hunt in order to survive, which entails taking on other players with their own personal set of skills in self defense or hunting. You never know which hunt or step will be your last. The option to scavenge from the remains of a left behind animal either kill by successful hunters or natural disasters is also a dangerous path, as you never know where another predator may be lurking. Trusting other players may get you killed and turned into dinner. Winter and temperature The game will feature a complex temperature system and seasonal changes, This will require the player to play with strategy when facing these seasonal changes, during the fall season players will need to start storing body fat to prepare for the harsh winter ahead, this is done by over eating a player corpse and for herbivores by eating certain fatty plants or fruits to gain fat. Be careful to not fall into sub minus waters or you will fall into hypothermia and possibly die as a result, during the summertime you can experience heat waves that will require you to stick close to water sources to keep cool, temperature will affect how your character moves around it's environment so pay caution to your characters temperature or you could wind up as someones meal. Gamemodes Prior to joining a server you will see which game mode they are hosting. These include: sandbox and survival. Sandbox offers you a punish free zone to practice your fighting, get used to the feeling of each animal and meet new players without the concern of losing hours of survival time. Select your desired animal and spawn into the sandbox world, have some risk-free fun! Survival gives you the chance to survive as the desired animal of choice, pick from several species, spawn in and grow, you can also be invited by other players to be raised from young to adult, this gives you the true survival experience as you fight to grow into something more capable while investing time and developing your own story along the way. Creature Customization Prior to spawning into the world you can fully customize your skin color and patterns, You can change 3 variations of the fur, The nose and Eyes. The color choices can be your own unique look to stand out among the rest! Our future Here's a list of planned things to be introduced into The Cenozoic Era, but keep in mind things are always subject to change as the project develops. The addition of extinct prehistoric animals through out the Cenozoic Era (This is not limited to mammals only) Scientifically based eco systems and sounds Seamless growth system Broken bones and sickness Aging Grappling/Take downs Climbing Trees and other various things This is the list of planned items to come in, these are the more major items but there is a ton of other detailed things that will also be added that enhances gameplay and the overall experience, this game is still in development so expect drastic changes to take course over it's time of development, but keep in mind things are always subjected to changing, until it's fully finalized.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2230170/header.jpg?t=1674234349",
    "Price": 0.0,
    "Developers": "OpendixStudios, LLC",
    "Publishers": "OpendixStudios, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2230170/ss_2b979d9de4c99d6a69bfc575dc5c71459d589410.1920x1080.jpg?t=1674234349,https://cdn.akamai.steamstatic.com/steam/apps/2230170/ss_7848f020c16b8b91537d25d420d83b689388da0c.1920x1080.jpg?t=1674234349,https://cdn.akamai.steamstatic.com/steam/apps/2230170/ss_951f02c6dc02b3eeac8cd06070db486ee2987661.1920x1080.jpg?t=1674234349,https://cdn.akamai.steamstatic.com/steam/apps/2230170/ss_26bfa31781bcc4c38e768871135a808e19fc3975.1920x1080.jpg?t=1674234349,https://cdn.akamai.steamstatic.com/steam/apps/2230170/ss_e7863c6afea3aed2a3099ca284b6e408e29b4968.1920x1080.jpg?t=1674234349,https://cdn.akamai.steamstatic.com/steam/apps/2230170/ss_468b0b05fb9ace1d2ccaf5f5de987c90a081b6be.1920x1080.jpg?t=1674234349,https://cdn.akamai.steamstatic.com/steam/apps/2230170/ss_2eca1188691ab5352232b8fbbd453e50ab3c3feb.1920x1080.jpg?t=1674234349,https://cdn.akamai.steamstatic.com/steam/apps/2230170/ss_6cb87f381ffde8970cbe7b6f7f4e0fc0be6a8936.1920x1080.jpg?t=1674234349,https://cdn.akamai.steamstatic.com/steam/apps/2230170/ss_807381d631a841ea0e83b1466719a32047f658c1.1920x1080.jpg?t=1674234349,https://cdn.akamai.steamstatic.com/steam/apps/2230170/ss_2878807547696308ebffeca347b501224e902d5f.1920x1080.jpg?t=1674234349",
    "Slug": "the-cenozoic-era",
    "Meta Title": "The Cenozoic Era: Jan 20, 2023, OpendixStudios, LLC and F...",
    "Meta Description": "Looking for information on The Cenozoic Era? Check out the release date (Jan 20, 2023), developer insights from OpendixStudios, LLC, and a complete game...",
    "Alt Text Image": "Official header image for The Cenozoic Era game - Steam 2230170",
    "Canonical URL": "https://gusku.site/game/the-cenozoic-era",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Cenozoic Era\", \"description\": \"Looking for information on The Cenozoic Era? Check out the release date (Jan 20, 2023), developer insights from OpendixStudios, LLC, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 20, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"OpendixStudios, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OpendixStudios, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2230170/header.jpg?t=1674234349\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}