{
    "AppID": 2202430,
    "Name": "Uncharted Ocean 2",
    "Release date": "Jan 12, 2023",
    "About the game": "Time to set sail! This is destined to be a journey full of opportunities. Open new trade routes, accumulate fortunes, and establish a maritime empire of your own! It is also a dangerous journey, you must defeat the evil pirates and other mystical dangers the ocean offers to a captain. Each ship can be further transformed, from the stern, auxiliary sail, bow, armor, and cargo warehouse, all can be processed to meet your need. Wanna war? Then fit more cannons. More money? Build a larger warehouse. You will also meet interesting characters from all over the world, not only can you learn their backstories, but also recruit them to form a team with unique abilities and personalities. All of your partners will be responsible for the corresponding work on the ship, according to their expertise. To achieve the best outcome, you need to put everyone in their appropriate places. As the captain, you have a wide range of choices of professions and skills, as well as more powerful equipment, characters, and warships. Constantly strengthen yourself, and challenge harsh enemies in the deep sea. Once encountering pirates, you must move your fleet flexibly, avoid deadly blows, and defeat enemies through reasonable 'skills' . You can have a MOBA-like experience. As the adventure progresses, your fleet will enter into one instance after another, facing more powerful and special challenges. You can also play your captain as and dive into the heat of hand-to-hand combats, on both sea and land. The land instances are full of surprises too, with powerful bosses and treasures waiting for you! Making money en route is a major source of fun when sailing. In Uncharted Ocean 2, the prices of goods are dynamically changing according to the real supply and demand of goods. You must keep an eye on the market to make a profit. Ships are not only tools to conquer faraway places, but also cozy homes. You can carry out various activities such as planting, breeding and forging on your ship, which would give you rich profits. Based on the real world, Uncharted Ocean 2 builds an extremely large open world, with real land and sea terrain, as well as real coordinates and current systems. This open world is full of amazing details, the latest version has over 200 cities for you to explore each with its own unique flavor. In Tianjin, China, you will encounter storytellers and monkey players on the streets. You can see cherry blossoms and torii in Japan. In Vietnam, you will find the golden temples of Southeast Asia. In Europe, the spectacular churches and castles are a must to see. You're not the only adventurer, there are countless fleets traveling around you, sometimes competing against each other for treasures! Sometimes you will work together to form a powerful combined fleet to face challenging enemies, such as pirates’ dens or giant monsters in the deep sea. It is fascinating and full of depth and fun, and is sure to bring you a colorful and exciting sea adventure!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2202430/header.jpg?t=1673604265",
    "Price": 0.0,
    "Developers": "海兔工作室",
    "Publishers": "Gamersky Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2202430/ss_fbeb4b51419285c451cbe79bdb64bf271bb86b3e.1920x1080.jpg?t=1673604265,https://cdn.akamai.steamstatic.com/steam/apps/2202430/ss_ade53bce68d2d8b165bc3c1f691a44869a7666bd.1920x1080.jpg?t=1673604265,https://cdn.akamai.steamstatic.com/steam/apps/2202430/ss_1cb287c9e8a014c2fa7142a9bb5f3b9081944ab1.1920x1080.jpg?t=1673604265,https://cdn.akamai.steamstatic.com/steam/apps/2202430/ss_2d8b9873b08c6a00c155ea4061715688d76cd568.1920x1080.jpg?t=1673604265,https://cdn.akamai.steamstatic.com/steam/apps/2202430/ss_a329dd2f55e41e27320f26bbc6192e44589fe1eb.1920x1080.jpg?t=1673604265,https://cdn.akamai.steamstatic.com/steam/apps/2202430/ss_a1701ace47563843c46110f0455821504a912b35.1920x1080.jpg?t=1673604265",
    "Slug": "uncharted-ocean-2",
    "Meta Title": "Uncharted Ocean 2: Jan 12, 2023, 海兔工作室 and Full Overview",
    "Meta Description": "Looking for information on Uncharted Ocean 2? Check out the release date (Jan 12, 2023), developer insights from 海兔工作室, and a complete game summary.",
    "Alt Text Image": "Official header image for Uncharted Ocean 2 game - Steam 2202430",
    "Canonical URL": "https://gusku.site/game/uncharted-ocean-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Uncharted Ocean 2\", \"description\": \"Looking for information on Uncharted Ocean 2? Check out the release date (Jan 12, 2023), developer insights from \\u6d77\\u5154\\u5de5\\u4f5c\\u5ba4, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 12, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6d77\\u5154\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gamersky Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2202430/header.jpg?t=1673604265\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}