{
    "AppID": 1903970,
    "Name": "World Championship Boxing Manager™ 2",
    "Release date": "Jan 17, 2023",
    "About the game": "The boxing world is at your fingertips in this deeply detailed and outrageously entertaining sports management simulation. Enlist competitive fighters, recruit top-notch staff, and ride the hype train all the way to endorsement city! Watch it all play out in the ring as your fighter takes the throne…or gets KO’d. An official sequel to 1991’s highly-applauded World Championship Boxing Manager™, this iteration captures the essence of the original and expands upon it. Offering updated visuals, deeper gameplay, and new characters that extend the World Championship Boxing Manager™ franchise, WCBM2 provides fun for grizzled veterans and lightweight fans. Go toe to toe with fantasy characters, or take the main stage with historical boxing legends including Rocky Marciano™, Sugar Ray Robinson™, and more! Define your boxing legacy Build your fighters from the ground up and lead them to glory. Manage their training schedules, rest days, strength conditioning, and cardio sessions to create the best balance for your roster. Recruit promising amateurs, hire staff, gain sponsors, and hype your promotions. Keep your stable of fighters in top shape and they'll take you to the top —but mismanage them and you'll both be eating canvas! All in a day's work for the best boxing manager in the world. It's more than just the fight Behind every fighter is a story, and it’s their unique and individual experiences that keep them punching and help them get up, one more time. Put on the gloves of a scrappy newcomer or relive the unforgettable careers of heavyweight legends. World Championship Boxing Manager ™ 2 brings these tales to life with visual novel-like depth of detail in Story Mode. Are you ready to step into the ring? Features: Hand-drawn, 32-bit visuals with modern features and fight cams to watch your fighter duke it out in real-time. Story Mode takes you beyond the fight and into narrative-driven scenarios and autobiographical tales. Play as a has-been promoter making a comeback, a trainer that’s bitten off more than he can chew, and even world-renowned legends like licensed characters Rocky Marciano™ and Sugar Ray Robinson™, and more! Career Mode brings this classic sim world to the next level—make use of an awesome roster and staff, and watch boxing matches come to life as you witness your fighters duke it out in real time through the cinematic Fight Camera. Enhanced customization adds replayability and encourages players to take on the challenge in their own way. Earn gear and improve your facilities for your boxers and staff—each playthrough offers something new! An extensive experience system allows players to build a hard-hitting ring king, a one-punch wonder, or a super-stamina warrior of the knock-down-drag-out fight. It’s up to you to create the best training path to victory.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1903970/header.jpg?t=1673999066",
    "Price": 12.99,
    "Developers": "Mega Cat Studios",
    "Publishers": "Ziggurat",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1903970/ss_2041b88e1738ca8ca9d54b40c0285c6e581755fd.1920x1080.jpg?t=1673999066,https://cdn.akamai.steamstatic.com/steam/apps/1903970/ss_877cb1b4dc89e9fc8016922dc88a607ce8c06d62.1920x1080.jpg?t=1673999066,https://cdn.akamai.steamstatic.com/steam/apps/1903970/ss_cfdbf14191ebc677f0f1dc296acdcda668864bc7.1920x1080.jpg?t=1673999066,https://cdn.akamai.steamstatic.com/steam/apps/1903970/ss_62b53b30a5ed36a8b761f2de6003f1b6fc919776.1920x1080.jpg?t=1673999066,https://cdn.akamai.steamstatic.com/steam/apps/1903970/ss_007f036d98030665365ce7ca27fe8cafa73aee43.1920x1080.jpg?t=1673999066,https://cdn.akamai.steamstatic.com/steam/apps/1903970/ss_bdf3296e7ca4c35f7842234bb56719e515e0125b.1920x1080.jpg?t=1673999066,https://cdn.akamai.steamstatic.com/steam/apps/1903970/ss_cbd305b6e22ae81319c420b1229f0d3fac28f5a5.1920x1080.jpg?t=1673999066,https://cdn.akamai.steamstatic.com/steam/apps/1903970/ss_f8f427cf49a71c1159f7868d7872ff28de671fee.1920x1080.jpg?t=1673999066",
    "Slug": "world-championship-boxing-manager-2",
    "Meta Title": "World Championship Boxing Manager™ 2: Jan 17, 2023, Mega ...",
    "Meta Description": "Looking for information on World Championship Boxing Manager™ 2? Check out the release date (Jan 17, 2023), developer insights from Mega Cat Studios, an...",
    "Alt Text Image": "Official header image for World Championship Boxing Manager™ 2 game - Steam 1903970",
    "Canonical URL": "https://gusku.site/game/world-championship-boxing-manager-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"World Championship Boxing Manager\\u2122 2\", \"description\": \"Looking for information on World Championship Boxing Manager\\u2122 2? Check out the release date (Jan 17, 2023), developer insights from Mega Cat Studios, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 17, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mega Cat Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ziggurat\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1903970/header.jpg?t=1673999066\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}