{
    "AppID": 1653060,
    "Name": "孤胆惊魂2：消失的207（Fear 2: The Disappeared 207）",
    "Release date": "Jun 28, 2021",
    "About the game": "Background story description: In the future, there will be an outbreak of epidemics all over the world, and almost all humans and animals will be infected by the virus, which will turn into walking corpses. In a mysterious research institute, Yang Tian, who had lost his memory, woke up and discovered that there were hidden secrets in this research institute. After escaping from the research institute after all the hardships, he had to go to a deserted school again to find the truth about his identity, but waiting for him will be endless darkness. . . Gameplay description:          I’m PYSL, I’m the author of this game. This is a puzzle-solving, survival, adventure, survival, and horror shooting game I made. The viewing angle of the game is from a bird's-eye view, and you will control Yang Tian (the protagonist) Continue to survive the monster's attacks and seek the truth. There are various types of monsters in the game, their attack methods are different, and their own attributes are also different. Players need to use the existing weapon resources in their hands to deal with them flexibly, otherwise it will be very difficult to clear the customs. There are different types of guns in the game, and each has its own characteristics, please switch according to your needs. Weapon accessories have various functions, I wish you crazy kills. In battle, you can also use skills to help you not die in a dangerous environment. As the plot clears, you can unlock multi-week games, as well as powerful equipment and convenient items. In order to facilitate the operation of the player, a touch screen operation is made on the screen, which can be used if necessary. In addition to keyboard operations, the same game also supports handle linking, and the handle button functions can be customized. Author's message:           This is the first game I made, so there are many flaws in all aspects. For example, music, art, etc. are not satisfactory, and there may even be some bugs that cannot be solved by yourself. I hope you can bear with me. If there is a BUG, I will solve it as soon as possible, if I will solve the BUG. Because I was the only one who made the game. Of course, I also hope that you will like this game. If you like it, I will continue to make a sequel to the game. The sequel supports multiple characters and has more guns, props, and skills. I even conceived a combo system. Of course these are all things to do. Finally, I hope you all have a good time. Instruction manual: Instructional video: If the archive is damaged, I am very sorry for that. Game Cheats : Enter the following codes in order in the game. money: get 9999999 gold coins. pysl: Obtain all hidden weapons, equipment and portable shops. Fear1:Rebirth ： PC version（cloud gaming）： Download the Android version：",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1653060/header.jpg?t=1653230905",
    "Price": 1.99,
    "Developers": "PYSL",
    "Publishers": "Wolf Game",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1653060/ss_c140b3795fb905ab30f87ac5a03737e8ff5c29f1.1920x1080.jpg?t=1653230905,https://cdn.akamai.steamstatic.com/steam/apps/1653060/ss_19042772ed5efde87070b0e7cf1140ac28571263.1920x1080.jpg?t=1653230905,https://cdn.akamai.steamstatic.com/steam/apps/1653060/ss_16874ca19b8e92e56eeae62b6c8a84734da4d38e.1920x1080.jpg?t=1653230905,https://cdn.akamai.steamstatic.com/steam/apps/1653060/ss_bfc6fa6cb3e6cfefa97b8dbf105b723dd2ed9a97.1920x1080.jpg?t=1653230905,https://cdn.akamai.steamstatic.com/steam/apps/1653060/ss_05f9bcae3e646cf3446b489b5a8edbe2e9096c68.1920x1080.jpg?t=1653230905,https://cdn.akamai.steamstatic.com/steam/apps/1653060/ss_cc60b1e493e48ca5e5e87ededa5eb0bd9e4b14d4.1920x1080.jpg?t=1653230905,https://cdn.akamai.steamstatic.com/steam/apps/1653060/ss_95df48595db9b79572ebc4e3191ac022848dea3f.1920x1080.jpg?t=1653230905",
    "Slug": "2207fear-2-the-disappeared-207",
    "Meta Title": "孤胆惊魂2：消失的207（Fear 2: The Disappeared 207）: Jun 28, 2021, ...",
    "Meta Description": "Looking for information on 孤胆惊魂2：消失的207（Fear 2: The Disappeared 207）? Check out the release date (Jun 28, 2021), developer insights from PYSL, and a com...",
    "Alt Text Image": "Official header image for 孤胆惊魂2：消失的207（Fear 2: The Disappeared 207） game - Steam 1653060",
    "Canonical URL": "https://gusku.site/game/2207fear-2-the-disappeared-207",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5b64\\u80c6\\u60ca\\u9b422\\uff1a\\u6d88\\u5931\\u7684207\\uff08Fear 2: The Disappeared 207\\uff09\", \"description\": \"Looking for information on \\u5b64\\u80c6\\u60ca\\u9b422\\uff1a\\u6d88\\u5931\\u7684207\\uff08Fear 2: The Disappeared 207\\uff09? Check out the release date (Jun 28, 2021), developer insights from PYSL, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"PYSL\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wolf Game\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1653060/header.jpg?t=1653230905\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}