{
    "AppID": 955870,
    "Name": "Battlecruisers",
    "Release date": "Feb 4, 2021",
    "About the game": "Battlecruisers is a hand-drawn, 2D sidescroller set in the 28th century, when Earth is flooded by rising sea levels and foes compete for receding spits of land. Build, strategize, attack, and defend to conquer your military enemies and harvest their warships and weaponry. Humans are long gone, and our robot descendants are reckless, trash-talking, and power-hungry. You play Charlie, an opportunistic utility robot who takes an unattended Trident-class battleship for a quick spin around the harbor. The only problem: it belongs to the world’s greatest superpower. Arm and defend your cruiser or be sunk to the watery depths. Grow your arsenal with each victory, accruing frigates, artillery, bombers, lasers, stealth generators, and more. Reinforce your defense with shields and boosters, and enhance your production speed with an army of builder drones. Wreak havoc with napalm, nuke launchers, and experimental ultra-weapons, including the Death Star Satellite, the Ultralisk Rapid Fabrication Facility, and the Kamikaze Signal. As a self-appointed battlecruiser captain, you’re in charge of the design, building, resourcing, and strategic approach in real time battles. Meet the diabolical AI enemy head-on with cunning tactics or face certain death at the hands of murderous military robots like Huntress, Destruktor, and Karen. Unlock 30+ buildings and units as you become a master battleship commander, culminating in a showdown with Presidentron, the leader of the ultimate military superpower. Select the best weapons from your deadly arsenal and deploy them with skill to win the game. Key Features Build the ultimate battlecruiser to strategically attack and destroy enemy warships. Start with the essentials and unlock new and surprising technology as your skills evolve. Develop your own unique strategy to take down the robot enemies. You’ll have to be devious to beat the highest levels on hardest difficulty. Explore a post-apocalyptic world where rising oceans have submerged the land. Battles take place against a backdrop of floating metal cities; homages to humanity’s great landmarks. Fall in love with the stunning hand-drawn art. Designed by an explosion-obsessed artist, the particle system generation means you’ll never see the same blast twice. Get hooked on the addictive soundtrack. The mood-dynamic music seamlessly matches the action and lulls of each battle to create intensive gameplay. About Mecha Weka We’re a two-man team from Auckland, New Zealand. We created Battlecruisers in our spare time for the love of explosive RTS with a minimalist twist. We’d love to expand the game someday with new levels and DLC, so please support our first release and we’ll give you everything we’ve got.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/955870/header.jpg?t=1655417327",
    "Price": 9.99,
    "Developers": "Mecha Weka",
    "Publishers": "Mecha Weka",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/955870/ss_24c421ea87ca0a54ee97c661059a3c5b0c39d460.1920x1080.jpg?t=1655417327,https://cdn.akamai.steamstatic.com/steam/apps/955870/ss_be1c722c0dcdc4502dc543a2eeecac2dd543c44a.1920x1080.jpg?t=1655417327,https://cdn.akamai.steamstatic.com/steam/apps/955870/ss_61076777b2e14142bbded7e32ec69908508a2ce9.1920x1080.jpg?t=1655417327,https://cdn.akamai.steamstatic.com/steam/apps/955870/ss_e5d30ee29ca88c90a7e3722e077286ea64b6e970.1920x1080.jpg?t=1655417327,https://cdn.akamai.steamstatic.com/steam/apps/955870/ss_2b36eba3e37880a1f26ca634da083d1449650438.1920x1080.jpg?t=1655417327,https://cdn.akamai.steamstatic.com/steam/apps/955870/ss_b19b3199586f4b6607fbf782d4d435bf8fc60d45.1920x1080.jpg?t=1655417327,https://cdn.akamai.steamstatic.com/steam/apps/955870/ss_64ac03c4fdf39112f771d697aaef228709e1ab74.1920x1080.jpg?t=1655417327,https://cdn.akamai.steamstatic.com/steam/apps/955870/ss_ae0de64979952d3df9190b04cb8d66c7d1588556.1920x1080.jpg?t=1655417327,https://cdn.akamai.steamstatic.com/steam/apps/955870/ss_bae43bcfa551ec3d2a27f2d1d9814cd14a595446.1920x1080.jpg?t=1655417327,https://cdn.akamai.steamstatic.com/steam/apps/955870/ss_13c0f42e8ce4e2a4b0d908dcb3cc2bb6771390a6.1920x1080.jpg?t=1655417327,https://cdn.akamai.steamstatic.com/steam/apps/955870/ss_3e56c41bdde0632cfd31abfada44b72317df986e.1920x1080.jpg?t=1655417327",
    "Slug": "battlecruisers",
    "Meta Title": "Battlecruisers: Feb 4, 2021, Mecha Weka and Full Overview",
    "Meta Description": "Looking for information on Battlecruisers? Check out the release date (Feb 4, 2021), developer insights from Mecha Weka, and a complete game summary.",
    "Alt Text Image": "Official header image for Battlecruisers game - Steam 955870",
    "Canonical URL": "https://gusku.site/game/battlecruisers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Battlecruisers\", \"description\": \"Looking for information on Battlecruisers? Check out the release date (Feb 4, 2021), developer insights from Mecha Weka, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mecha Weka\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mecha Weka\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/955870/header.jpg?t=1655417327\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}