{
    "AppID": 460750,
    "Name": "Blade Ballet",
    "Release date": "Aug 9, 2016",
    "About the game": "Blade Ballet is a whirling dance of multiplayer robot destruction. Each character possesses a unique personality and special abilities - use them to claim victory as you spin from one challenging arena to the next, battling for dominance in this action-packed fighting game. Blade Ballet is simple enough for anyone to pick up a controller and jump into the fray, but players must master the timing and unique abilities of each bot to come out on top. This makes the game easily accessible to new players, while allowing for a high skill ceiling to truly compete with your friends. Much of the Blade Ballet gameplay revolves around the innovative “blade spin” mechanic – players control their rotation to sneak past their opponents’ defenses and secure the kill. Each arena also introduces new game mechanics that players must incorporate into their strategies. Frantic duels to the death between two, three, or four players Spinning and stabbing combat system that encourages simultaneously hectic and skillful clashes Ten robots with unique mechanics and abilities Nine battle arenas with challenging hazards to overcome - or use against your enemies Three exciting modes to choose from - Robomination, Overclocked, and Blade Ball - customizable for endless replayability A good part of the flexibility of gameplay in Blade Ballet comes from the unique abilities of the bots. Players can choose to master their skills with one bot by continually fine-tuning their abilities. Alternately, they can keep things fresh and chaotic by switching up their bot picks for every match. Catbot: No bot is safe with this adorable deviant on the loose. Don't let that cute face fool you - she'll slice through your shields without a second thought. Torque: Yes, it will blend. Torque has no shields, but spins so fast in 'Blender Mode' that any bot would be crazy to get within his slicing range. Syphon: How many swords is too many swords? Syphon steals the shields off other bots. Then he turns them into a ring of slicing death. Riot: This solid and imposing maneuverable bludgeon of a bot makes up for her lack of swords with spiked shields that regenerate quickly over time. Nix: Uses teleportation to effortlessly and mysteriously phase through enemies and line up the perfect attack. Commits fully to each new location - if he goes off a ledge, there's no turning back. Trigger: Hectic and unstable. Lives for mayhem. She loves nothing better than to sling powerful bombs across the stage, wrecking everything in sight. Is not immune to self-destruction. Ruckus: Powerful wrecking ball sweeps away all opposition. She uses a mace to reposition other bots at will. A mace-punch to another bot's face is particularly effective in combat. Vanguard: This chivalrous, noble bot has strong ties to a bodyguard origin. Armored and heavy, with a blazing charge. Slow-turning, but he makes up for it with a long reach. DropJaw: Don't get too close to this bot unless you want to be laid low by a stunningly disruptive shockwave. His typical combo includes jump into Ground Pound, finishing off with the stab of a sword. STEVe: STEVe was never meant to battle in the Blade Ballet arena, but he gives it a good shot. The difficulty of mastering the strafe and powerful lunge makes every landed hit worth celebrating. Want to learn more? Check out the Meet the Bots page on our site. Our goal is to keep gameplay interesting by having players navigate hazardous stages while dueling to the death. We've come up with a variety of artistically, mechanically, and thematically interesting arenas for bots to battle across. Thanks for checking out the game. Love to hear what you think!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/460750/header.jpg?t=1505338881",
    "Price": 14.99,
    "Developers": "DreamSail Games",
    "Publishers": "DreamSail Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/460750/ss_bbe643a610350df3854425014f9e90a38a48ad17.1920x1080.jpg?t=1505338881,https://cdn.akamai.steamstatic.com/steam/apps/460750/ss_f522ed7e010cd77021cc8435d00e74b035e4d2b0.1920x1080.jpg?t=1505338881,https://cdn.akamai.steamstatic.com/steam/apps/460750/ss_37bc4616422493a4697fe763d70850f320987020.1920x1080.jpg?t=1505338881,https://cdn.akamai.steamstatic.com/steam/apps/460750/ss_998b23a6aef9e2d18ae842f3d656ad13266fcf59.1920x1080.jpg?t=1505338881,https://cdn.akamai.steamstatic.com/steam/apps/460750/ss_a7c3157854066d231c36dc64f77133246daf3ccf.1920x1080.jpg?t=1505338881,https://cdn.akamai.steamstatic.com/steam/apps/460750/ss_b11438f7be38e4ba9d87b07a375984a6b3199ece.1920x1080.jpg?t=1505338881",
    "Slug": "blade-ballet",
    "Meta Title": "Blade Ballet: Aug 9, 2016, DreamSail Games and Full Overview",
    "Meta Description": "Looking for information on Blade Ballet? Check out the release date (Aug 9, 2016), developer insights from DreamSail Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Blade Ballet game - Steam 460750",
    "Canonical URL": "https://gusku.site/game/blade-ballet",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Blade Ballet\", \"description\": \"Looking for information on Blade Ballet? Check out the release date (Aug 9, 2016), developer insights from DreamSail Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"DreamSail Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DreamSail Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/460750/header.jpg?t=1505338881\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}