{
    "AppID": 1288030,
    "Name": "BoxxyQuest: The Gathering Storm",
    "Release date": "May 8, 2020",
    "About the game": "Sign on to the Internet – a vast, full-immersion virtual world. Here, users live their ideal lives, willfully blind to the fragile structure of their reality… Catie's days are carefree, spent leading a small forum in a quiet corner of the Web. But when a mysterious firewall begins consuming the northern wilderness, the Internet's leaders are called together to assess the threat. Soon, Catie will find herself plunged into the thick of a wild adventure, alongside a group of unlikely new allies. Together, they must reassemble the code of an ancient hacking tool, while being pursued by a mysterious new enemy, and the unrelenting shadows of the past... A vast, virtual land to explore - See the Internet in a way you've never imagined it before – as an immersive fantasy world! Each town and dungeon is based on a site you may be familiar with, and they’re all just bursting with their own unique flavor! A rich, 30+ hour story - Meet vibrant new characters, and join them on a quest filled with both humor and heart. Who knows, maybe you'll even find a few unexpected plot twists along the way? And when you’re done, there’s a very extensive postgame to explore, too! Tons of customization – Style up your party members with unique accessories! These baubles are hidden everywhere, and they all have unique and unpredictable effects. From a tiny ghost that turns you intangible, to a compass that seeks out hidden treasure. There’s something fun to wear for just about everyone! So many Paper Mario references - Maybe even too many? The Paper Mario series, and especially TTYD, was a huge inspiration to us. How many shout-outs can YOU find? Plenty of replayability - This game is jam-packed with secrets; you’ll never be able to find them all during your first trip through! Luckily, a certain postgame area can give you hints to find the things you missed. Exclusive Boxxy content – If you’re a fan of Catie’s classic videos, then you may be in luck, because this game has a very special Easter Egg for you to find! The perfect pie recipe? - Will you learn how to make a truly fabulous dessert? Maybe not, but you'll never know for sure unless you play! The Shrimp – Concept, writing, map design, sprite artwork, programming Catie Wayne – Concept, writing, narration voiceover Sightshade – Writing, editing, map design, “special secret flair” SeltiSnow – Sprite artwork, testing Intangibility Drive – Misc. artwork Tang – Writing, positivity enforcement Shai – Testing and debug Polish Vodka – Testing and debug KK20 - Debug Custom scripts by: Blizzard, Tigerseye, ForeverZer0, Kelessdee, Ccoa, DerVVulfman, Lambchops, RM-RF, Moghunter, Modern Algebra, Leon, MGCaladtogel, Corbaque, XRXS, Gameface, Gabriel Winchester, Trickster, Cogwheel, KK20, Nathmatt, Xelias, Seriel, Uncle Lanzer, Gerkat, Game_Guy, Chaucer, Heretic, Zecomeia, Kotfire, Asfz Kakarotto, Mad.Array, Koen Lemmen, and A-Moonless-Night. Full art and music credits can be found in the game itself!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1288030/header.jpg?t=1588930927",
    "Price": 0.0,
    "Developers": "SpherianGames",
    "Publishers": "SpherianGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1288030/ss_f03b563e26d9fe5f573442efac8b495380b21770.1920x1080.jpg?t=1588930927,https://cdn.akamai.steamstatic.com/steam/apps/1288030/ss_9fc7b7c501eaa2bd5bc71ac1bf628ac118de9a2f.1920x1080.jpg?t=1588930927,https://cdn.akamai.steamstatic.com/steam/apps/1288030/ss_7be59bab1f81208eb865b48a77fa97732cbad2e9.1920x1080.jpg?t=1588930927,https://cdn.akamai.steamstatic.com/steam/apps/1288030/ss_ba010c7df731b848ec3e65d61ba86613ae120a45.1920x1080.jpg?t=1588930927,https://cdn.akamai.steamstatic.com/steam/apps/1288030/ss_5283232f30669319e54c588643eda62b23955149.1920x1080.jpg?t=1588930927,https://cdn.akamai.steamstatic.com/steam/apps/1288030/ss_858701966bd82e23191aef4f85aa7e2d8454b1b6.1920x1080.jpg?t=1588930927,https://cdn.akamai.steamstatic.com/steam/apps/1288030/ss_a6cc1503f8a1852599e8c48d470b29fe63482d77.1920x1080.jpg?t=1588930927,https://cdn.akamai.steamstatic.com/steam/apps/1288030/ss_2a4c82783dffbba700becaa5d17c2af129be41ed.1920x1080.jpg?t=1588930927,https://cdn.akamai.steamstatic.com/steam/apps/1288030/ss_d92dee2dc40e08540a2135a5a99fb97bcdad5f02.1920x1080.jpg?t=1588930927,https://cdn.akamai.steamstatic.com/steam/apps/1288030/ss_f2b8d6b0800f9742a82b53a83ac79ece4ded51b1.1920x1080.jpg?t=1588930927,https://cdn.akamai.steamstatic.com/steam/apps/1288030/ss_f9add84d09616f2e9abd5db5d9700d97001031b7.1920x1080.jpg?t=1588930927",
    "Slug": "boxxyquest-the-gathering-storm",
    "Meta Title": "BoxxyQuest: The Gathering Storm: May 8, 2020, SpherianGam...",
    "Meta Description": "Looking for information on BoxxyQuest: The Gathering Storm? Check out the release date (May 8, 2020), developer insights from SpherianGames, and a compl...",
    "Alt Text Image": "Official header image for BoxxyQuest: The Gathering Storm game - Steam 1288030",
    "Canonical URL": "https://gusku.site/game/boxxyquest-the-gathering-storm",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BoxxyQuest: The Gathering Storm\", \"description\": \"Looking for information on BoxxyQuest: The Gathering Storm? Check out the release date (May 8, 2020), developer insights from SpherianGames, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 8, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"SpherianGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SpherianGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1288030/header.jpg?t=1588930927\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}