{
    "AppID": 1462190,
    "Name": "Corpse Mansion",
    "Release date": "Oct 29, 2021",
    "About the game": "Synopsis Cole Woods, a seasoned detective working for the Hell City Police Department, finds himself in a predicament with an unlikely ally, the Commissioners' daughter, Elena Morgan. Together they fight through hordes of the dead, and Cole must keep Elena alive if he has any hope of finding the Commissioner before it's too late. Unravel the mystery of the Z-virus and uncover the conspiracies that lie within it. The decisions Cole makes can impact the story or even an NPC's fate. The dead are not the only threat to Cole. He needs to eat, rest, and drink just to stay alive. Survive this cruel world in this action-horror survival game with over 32+ weapons to find and hundreds of items to loot throughout the game. Current Features Fully interactable environment : Use weapons that have the 'Tool' trait to do more than just attack or use a rope to climb up a ledge. Search everything from vehicles to houses, drawers, boxes, cupboards, fridges, stoves, shelves and much more. Impressive arsenal of weapons to obtain. Light enemies on fire with a flamethrower or blow them to pieces with an RPG, you choose how you want to fight this epidemic. Crisp and accurate sound effects for everything in the game. For example, when you move, store, sell or drop an item, it plays its own unique corresponding sound effect. Decisions impact the flow of the story and ultimately the ending too. Save the citizens from their demise to gain access to more resources. You can keep track of who you have managed to save on your portable data system. (must have unlocked data in main menu by obtaining the HPD Scanner) Slot based limited inventory system for you to manage, with containers for you to store your rare items in (must own a safe house for storage containers). Realistic Shops : Shop owners don't have unlimited stock; items Sold to them will remain in that person's shop stock for sale indefinitely until it's sold again. Shop owners will also get a new stock or re-stock of items for sale as the story expands. Doing missions for them can also change what they sell. Survival system where players have to manage Cole's Hunger, Thirst and Rest. You can obtain food and water from various sources in the game. Players will also be required to find a bed to sleep in to restore their Rest stat or risk passing out from exhaustion. Become your own Gunsmith! You'll need a special item called a 'Blueprint' first which teaches you how to repair and attach gun parts to a particular weapon. Then you can attach gun parts at any Gunsmithing Workbench to upgrade a weapon's traits. Such as but not limited to Headshot Chance, Capacity, Damage, Durability, Knockback, Stun, ect. Complex and unique dialogue selection system. Players will be able to know which things they have already said to an NPC to avoid unnecessary repeated dialogue (faded out grey). When options have a permanent effect on the game they will be highlighted in red to indicate this to the player. The same is true for green but in addition always satisfies the conditions of something. You can also repair a weapons durability but beware of it costing more material (Aluminum) to repair the better your gun's upgrades are. Finally, you can create ammunition with gunpowder at a Gunsmith Workbench once you have learned the associated blueprint. Planned Features With enough support we can consider adding weather to the game world based on what time of year it is. So in the winter the streets of Hell City would be covered in snow ect. Make the shops even more dynamic and change the Sale/Sell price of weapons based on their current upgrades attached. Right now weapons cannot be sold back to vendors because of their complexity. Parts can be sold normally. A completely different mode of gameplay where you would select challenges to complete. More stages and challenges would get unlocked as you progressed through the games story mode. A massive city to explore and loot items from. Suburbs, slums and downtown areas should all be covered. Having trouble with the game? If you are have any issues with proceeding through the story, you can contact support@corpsemansion.com or post in the community here -&gt; / where someone will be able to assist you (most likely the same day even). While we strive to fix all bugs and make sure everything is perfect, we are still in Early Access so please report it to us and we'll do our best to fix it. Thank you for your understanding. We are constantly adding more content to the game so we appreciate your patience here.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1462190/header.jpg?t=1657725005",
    "Price": 8.39,
    "Developers": "Fundthemental Games",
    "Publishers": "Fundthemental Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1462190/ss_0a09248baeb764bdc6df9a7bfd04617bfe82ad3e.1920x1080.jpg?t=1657725005,https://cdn.akamai.steamstatic.com/steam/apps/1462190/ss_dffd9fec6a0aca0e42e24e545926f05d1eadbcc9.1920x1080.jpg?t=1657725005,https://cdn.akamai.steamstatic.com/steam/apps/1462190/ss_3392d70f44eb04a1148f126fb248efa3c10bd83b.1920x1080.jpg?t=1657725005,https://cdn.akamai.steamstatic.com/steam/apps/1462190/ss_638f3808c2fb961845c071f5153ac42048de073c.1920x1080.jpg?t=1657725005,https://cdn.akamai.steamstatic.com/steam/apps/1462190/ss_7b280da109efe59bc63aa4238f440accec445791.1920x1080.jpg?t=1657725005,https://cdn.akamai.steamstatic.com/steam/apps/1462190/ss_948d4b0334ec38d6e4345cb6e496f6c4de4b0f18.1920x1080.jpg?t=1657725005,https://cdn.akamai.steamstatic.com/steam/apps/1462190/ss_567b5309f1d11c78b0989a94e4d86a66791dd2fa.1920x1080.jpg?t=1657725005,https://cdn.akamai.steamstatic.com/steam/apps/1462190/ss_d73cec25139ddf50866410057d0efea38827a38e.1920x1080.jpg?t=1657725005,https://cdn.akamai.steamstatic.com/steam/apps/1462190/ss_a582e3a20888694106050af3da0547d7832ddb66.1920x1080.jpg?t=1657725005,https://cdn.akamai.steamstatic.com/steam/apps/1462190/ss_ce4a94f6b4c8514183b4c962c67a8c34d138bc78.1920x1080.jpg?t=1657725005",
    "Slug": "corpse-mansion",
    "Meta Title": "Corpse Mansion: Oct 29, 2021, Fundthemental Games and Ful...",
    "Meta Description": "Looking for information on Corpse Mansion? Check out the release date (Oct 29, 2021), developer insights from Fundthemental Games, and a complete game s...",
    "Alt Text Image": "Official header image for Corpse Mansion game - Steam 1462190",
    "Canonical URL": "https://gusku.site/game/corpse-mansion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Corpse Mansion\", \"description\": \"Looking for information on Corpse Mansion? Check out the release date (Oct 29, 2021), developer insights from Fundthemental Games, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 29, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fundthemental Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fundthemental Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1462190/header.jpg?t=1657725005\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}