{
    "AppID": 382310,
    "Name": "Eco",
    "Release date": "Feb 6, 2018",
    "About the game": "Enter the world of Eco, a fully simulated ecosystem bustling with thousands of growing plants and animals living their lives. Build, harvest, and take resources from an environment where your every action affects the world around you. An imminent meteor strike threatens global destruction. Can you save the world without destroying it in the process? Construct buildings and towns, tend to your farm, hunt wildlife, build infrastructure and transportation, craft clothing, build power plants, and research new technologies. Specialize in a craft and trade your goods to other players. Develop your civilization and sculpt your planet. As your civilization grows, you’ll need to analyze data from the simulation; evaluating the impact you have on your world. Use this data as evidence in proposed laws, restricting harmful activities without disrupting the advancement of technology. Balance your individual needs with the needs of community, all while maintaining the state of the ecosystem. The future of your world is in your hands. Every organism in Eco exists as part of a detailed simulation; a disruption in one species can have cascading effects across the planet. Chop down all the trees, and habitats for creatures will be destroyed. Pollute the rivers with mining waste, and your farms will become poisoned and die. The ecosystem supplies the resources you and your community will need to stop the meteor. Manage your pollution, mining waste, hunting, and resource collection to balance your effect on this system. Eco is built on a rich ecological simulation. All the data generated from the interaction of plants, animals, climate, and players can be searched and analyzed using in-game graphs and heat-maps. Use the collected information as scientific evidence support to proposed laws. The ability to successfully debate using scientific evidence is your greatest weapon against the destruction of your world. Establish and maintain your own set of laws and government, which are enforced automatically by the game. Draft a proposal to limit clear-cutting in a protected forest, incentivize green energy solutions over fossil fuels by providing tax subsidies and penalties. Participate in elections for world leadership, allowing you to set tax rates and allocate community money. Use a programmable law system to make dynamic and flexible rules for the community, passing them by vote. Construct a wide variety of governments; from tightly-regulated dictator-states, to tax-and-spend subsidy programs, or even lawless communities relying on trust. Your skills increase based on your food and shelter. By consuming a highly nutritious variety of food and building an elaborate home you will rapidly increase your skill points. Skill points can be spent on skills like farming, hunting, trade, engineering, research, and more. Contribute to the greater good while increasing your own personal success. In the player-run economy, you achieve the most when you specialize and trade both goods and services. Create stores to buy and sell goods you need asynchronously with other players. Setup contracts within the game’s quest-like labor market, soliciting other players to perform specialized work for you in exchange for payment. Build complex crafting machines and charge a fee for players to use them. A thriving economy in Eco can be both a powerful tool for progress, or a dangerous threat to the environment. To grease the wheels of commerce, you can create your own currencies, backed by fiat or by resources. Manage the value of your currency relative to others by setting exchange rates at asynchronous currency exchanges. Sell items at stores and collect credit from other players. Eco is designed for rich asynchronous play, allowing many players of many disciplines to contribute to one another’s goals at separate or simultaneous times. All of the world’s resources originate from its environment, which is affected by your actions. While a meteor looms over head — set to strike the planet in thirty days — a more subtle threat grows from player-interaction with the environment. Without careful attention, ecological destruction can destroy civilization before the meteor even strikes. To ultimately succeed, you and your community will need to use the tools of government and economy to find a balance between progress and protection. Included Features Online Multiplayer - Collaborate online with a community of players. Local Singleplayer - Build your own world, with the option to invite friends. Dedicated Server Included - Host your own Eco worlds. Over 30 different craft tables, with hundreds of recipes. Hundreds of items, skills, craft tables, and building blocks. A simulated ecosystem with dozens of unique species. With limited carrying capacity, players must create vehicles and networks of roads to transport materials. Create your own backed or fiat currencies, using them as a means of exchange in the economy. Build stores where you can sell your excess items for a profit. Eat varied and nutritious food and build ever larger homes to increase your skills. Create contracts for jobs that you would like players with different skill-specialties to accomplish for you. Take on contracts from other players that need the skills you possess. Design laws using programmable template system to protect your world or increase your profits, enforced by the game if ratified by the population. Run for election and make decisions that affect the globe. View and compile rich data from the simulation and use it to argue for group decisions. Claim land as your own property, and share access rights. Give and remove reputation from other players. Find a balance between progress and protection, between individual needs and those of the group, succeeding or failing together. Eco is our forever project. We plan to keep growing, expanding, and improving it with the support of the community. Follow our plans and progress through the Eco Tree, which displays in-depth details on current and future features. The Eco Tree can be found on Eco's official website.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/382310/header.jpg?t=1656424007",
    "Price": 29.99,
    "Developers": "Strange Loop Games",
    "Publishers": "Strange Loop Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_0eb620bc52197e0c41f9e679c801762e66992806.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_a917a1c88b48d85c65479262f4a153b2c0d1d6c0.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_fad0cd07783f5211b74d2d2a17c0878aa67f7610.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_a2317f43a582dab794ae630b15c3a393864c8f2b.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_39c54824d4f6e5a28d2bffbeb29cbc135a67e815.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_f6ca3fa7e4fd443198c231867cc2af3ad7d7cb83.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_82f138468cc1f573e392bcaa8e4e842c9f876425.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_839ad83fad5b06a118483dc73c4f40e8a6efaeb2.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_792f457cf1502e2d8dda0518186ea65dae44c443.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_fd8c487b43c32c898722d53c435d575236e90d84.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_7f5c01a1dea55d7c9ddb21f14d0a6d1e1d63f80f.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_96e31d3a6bdc29f88d8c715347c8fd67d4bac527.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_c06162bfc95b09084a1f6d84df1d07f8cf7e57d4.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_63e2e22e1aa9f7959c0bb59eebdbb0b7b8893ea5.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_21f6eed152c0df88c7bbd2b3e1aef24a8c7a7e3c.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_494216fe4fca69d1dba77f90e20a797cad2f0e2f.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_a4b78c97ff70e0f5c559f96f632ef5dd7a5aa72e.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_e5086880f5f82e5ec6dbc4742ca022bca42ce068.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_014720a6c075be4ac7105aecafdf1f07bc0a04c5.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_9a0718b1abb45c0c09888f9fe4694eef41d612d9.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_7f1dcb53eb0d90ed8563395659ef30207c9c92ac.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_433a5643574e6f5b1137d9de0d9511f19e1745f1.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_cb695aabaf98c8c5f986af6ffa4dc64e60f619d3.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_8c2c2d92d08ce0d40ef3b4832afcb7df054a2cdf.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_7b7ccc1fb82845cc57b4d62f4301620cc9173997.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_edeb76b5f06db936167ce6639408645824f09908.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_dd64e96cecd4bab2b83c2aace86b09f2ad58eda7.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_451a1696407f243b7d77d5207a9f5490b61df0f4.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_1ab9d5ba17b91d7005fcd1b803d61511bf4c3319.1920x1080.jpg?t=1656424007,https://cdn.akamai.steamstatic.com/steam/apps/382310/ss_3598acb0dd9df4a283abacb436b5327f04d51c37.1920x1080.jpg?t=1656424007",
    "Slug": "eco",
    "Meta Title": "Eco: Feb 6, 2018, Strange Loop Games and Full Overview",
    "Meta Description": "Looking for information on Eco? Check out the release date (Feb 6, 2018), developer insights from Strange Loop Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Eco game - Steam 382310",
    "Canonical URL": "https://gusku.site/game/eco",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Eco\", \"description\": \"Looking for information on Eco? Check out the release date (Feb 6, 2018), developer insights from Strange Loop Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 6, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Strange Loop Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Strange Loop Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/382310/header.jpg?t=1656424007\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}