{
    "AppID": 576800,
    "Name": "Final Bravely",
    "Release date": "Jan 5, 2017",
    "About the game": "\\!/ For english version , launch the game directly with steam don't use shortcut \\!/ In a prosperous magic world, a powerful creature: 'The Reaper' reigns supreme. This terrible creature want to establish its dominance by drawning the Earth’s mana. Even the souls of the departed are disturbed by the chaos ensued. Explore the world of Nilume and discover the tragic story of N’Orzielle Follow the dark and destructive path she took to save her from her terrible fate. Discover the true identity of 'The Reaper” and be the witnesses of the desolation caused by the “Gods”. During your adventure, you will face many perilous tasks. Find your way into temples filled with riddles and face some terrible dangers in order to eradicate the roots of this corruption. Why did the “Gods” destroyed an entire village? How could the legend became true? Find out the parts of this story scattered across the game to answer all these questions and uncover the truth. Gameplay: Experience an old school RPG; develop your strategies by combining abilitys and magic spells to defeat the most fearsome monsters as you're mastering Final Bravely’s combat system. Personalize your adventure with 8 differents character classes. Use Alchemy to create powerful enchants for your equipement , develop new spells. A Casino with many mini-games An Arena Classes: The Reaper: Capable of unleashing devastating combos, the Reaper can absorb the strength of his allies to improve his own and deal large amounts of damage while enduring the fiercest assaults. At the end of a fight, he can siphon the remaining energy of his foes to regenerate himself. The Paladin: strong in both healing spells and offensive magic, the Paladin has a high defense and can use a wide range of useful skills. The Electrokinesist: A class using lighting magic to strike down its opponents. The Electrokinesist can summon powerful lightning storms and paralyze his targets. The Engineer: A class with several unique features: several gun spells to inflict direct damage, and a “trap system” which uses capacitors to set powerful traps causing large amounts of damage or various status effects when activated. The Dark Knight: A very sturdy class, capable of inflicting devastating status effect while protecting the group. The Berserker: The colossal strength of the Berserker turns most basic attacks into deadly blows. The Lancer: His piercing attacks can get through the strongest armor. The Lancer has no problems damaging even the toughest enemies. The Monk: He can adapt to any combat situations. Whether he needs strength or protection, the Monk can improve his characteristics to use powerful combos.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/576800/header.jpg?t=1618209772",
    "Price": 3.99,
    "Developers": "Windam",
    "Publishers": "Windam",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/576800/ss_7d589fd8080eb0bddc66400233f2df4af590e3d8.1920x1080.jpg?t=1618209772,https://cdn.akamai.steamstatic.com/steam/apps/576800/ss_0ff01c8eec86abeeb5b01ea90240714d19fce520.1920x1080.jpg?t=1618209772,https://cdn.akamai.steamstatic.com/steam/apps/576800/ss_96995aa59d19a3c3b202e9e40d1f1ea750d67db5.1920x1080.jpg?t=1618209772,https://cdn.akamai.steamstatic.com/steam/apps/576800/ss_ee422fe2467b5dc510904e1f2027d070a3a136f3.1920x1080.jpg?t=1618209772,https://cdn.akamai.steamstatic.com/steam/apps/576800/ss_3966b9933592963f62aa97fe7440f1653c806075.1920x1080.jpg?t=1618209772,https://cdn.akamai.steamstatic.com/steam/apps/576800/ss_4fa421eea0612897c623d85bc99c13c420aab720.1920x1080.jpg?t=1618209772",
    "Slug": "final-bravely",
    "Meta Title": "Final Bravely: Jan 5, 2017, Windam and Full Overview",
    "Meta Description": "Looking for information on Final Bravely? Check out the release date (Jan 5, 2017), developer insights from Windam, and a complete game summary.",
    "Alt Text Image": "Official header image for Final Bravely game - Steam 576800",
    "Canonical URL": "https://gusku.site/game/final-bravely",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Final Bravely\", \"description\": \"Looking for information on Final Bravely? Check out the release date (Jan 5, 2017), developer insights from Windam, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 5, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Windam\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Windam\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/576800/header.jpg?t=1618209772\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}