{
    "AppID": 1154360,
    "Name": "For Inco",
    "Release date": "Oct 23, 2019",
    "About the game": "This is a RPG game that grows through killing monsters to raise levels and create various items. Magic Stone : Every 2 hours, in the dark dungeon, Daemon's men comes in for 12 minutes to destroy the Magic Stones in the village. The game ends when the Magic Stone is destroyed, so you must protect the Magic Stone by helping the Guard to secure the Magic Stone. You must grow your guards and heroes as soon as possible to stop the daemon's men from getting stronger over time. Dark Dungeon : You can enter the Dark Dungeon once every 2 hours. There are five floors and this ends when defeating the daemon on the 5th floor. Dark Dungeon monsters are too much strong, so you have to raise and challenge your hero's level and items. Item and Skill : You can learn the creating items and hero skills through the materials obtained by defeating monsters. Item level : There are Normal, Advanced, Rare, Hero, Legend levels. Strengthen Items : All items have a 66% chance if you can do 9 enhancements, and will disappear if the enhancement fails. Item collection : If register your itemafter strengthen it, the item will be disappeared and improve your hero's capability. Guard collection : Purchasing Guards of Magic Stones will increase your hero's capability. Achievement collection : Killing a certain number of monsters will increase the hero's stats.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1154360/header.jpg?t=1573819221",
    "Price": 1.99,
    "Developers": "MoonlightGames",
    "Publishers": "MoonlightGames",
    "Screenshots": NaN,
    "Slug": "for-inco",
    "Meta Title": "For Inco: Oct 23, 2019, MoonlightGames and Full Overview",
    "Meta Description": "Looking for information on For Inco? Check out the release date (Oct 23, 2019), developer insights from MoonlightGames, and a complete game summary.",
    "Alt Text Image": "Official header image for For Inco game - Steam 1154360",
    "Canonical URL": "https://gusku.site/game/for-inco",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"For Inco\", \"description\": \"Looking for information on For Inco? Check out the release date (Oct 23, 2019), developer insights from MoonlightGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 23, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"MoonlightGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MoonlightGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1154360/header.jpg?t=1573819221\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}