{
    "AppID": 622370,
    "Name": "Freaky Awesome",
    "Release date": "Oct 18, 2017",
    "About the game": "When you found out that your missing dog was being held at the old factory, your past as an action hero kicked in and you didn’t hesitate: you grabbed your keys, jumped in your car and drove all the way there. Yeah, there are toxic wastes, weird creepy monsters and deadly traps there, and it’s very likely that you will mutate into horrendous shapes and even die a lot, but you would do anything for your four-legged friend – even becoming a four-legged hairy beast yourself! Fight, mutate, die, repeat: this is Freaky Awesome! Freaky Awesome is a hectic action rogue-lite where you have to fight your way out of an old factory, full of mutated monsters and traps; the general layout of the factory and its rooms are procedurally generated. Every enemy leaves behind a poodle of mutagen that can heal you, but also mutates you eventually – even if you are in the middle of a fight! In order to survive, you will need to adapt quickly to the powers and specific mechanics of every mutation. Tearing off your head to throw it at an enemy? Sure! Laying eggs and seeing tiny copies of you hatching and fighting for you? Why not! And on top of that, you can use objects in combat and develop your character to unlock new powerful skills, as well as play in co-op with up to 4 players! KEY FEATURES Fight against weird mutants in this fast-paced rogue-lite Mutate to survive: mutagens replenish your health but also changes you into wild forms – each with different mechanics and powers! Gain new mutations! Slay bosses to unlock their forms as a newly available mutation Explore a mutating world: the game itself mutates! The map is randomly generated, but the game itself changes every successful run with new unlocked locations and enemies, bigger levels, stronger bosses and new mechanics Avoid traps… or use them to your advantage: explosives, flying barrels, moving saws, flames and even flying pig heads are as deadly to you as to your enemies! Use items to help you in combat! Rogue-lite with permadeath: death is permanent, but your advancements too. You can keep your unlocked items, skills and mutations Play solo or with friends with an up to 4 players co-op. You can keep the progress earned while playing multi!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/622370/header.jpg?t=1648453808",
    "Price": 9.99,
    "Developers": "Mandragora",
    "Publishers": "Mandragora",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/622370/ss_d729f457bce79f4fe36baa1702d0d28194725849.1920x1080.jpg?t=1648453808,https://cdn.akamai.steamstatic.com/steam/apps/622370/ss_ec1351fb10ee84d2192bcdefb09146b8e210a479.1920x1080.jpg?t=1648453808,https://cdn.akamai.steamstatic.com/steam/apps/622370/ss_ad6291bf980afe83d95c5bd0e51ca0d973b4bc20.1920x1080.jpg?t=1648453808,https://cdn.akamai.steamstatic.com/steam/apps/622370/ss_4d1f5fa6434a88cd0d735dbdc9683b91a942e981.1920x1080.jpg?t=1648453808,https://cdn.akamai.steamstatic.com/steam/apps/622370/ss_c68c03e627a4865ae93da289789f96c83dd37fc1.1920x1080.jpg?t=1648453808,https://cdn.akamai.steamstatic.com/steam/apps/622370/ss_2aebc01e4123d145983bd05629cabe07ee52bf8c.1920x1080.jpg?t=1648453808",
    "Slug": "freaky-awesome",
    "Meta Title": "Freaky Awesome: Oct 18, 2017, Mandragora and Full Overview",
    "Meta Description": "Looking for information on Freaky Awesome? Check out the release date (Oct 18, 2017), developer insights from Mandragora, and a complete game summary.",
    "Alt Text Image": "Official header image for Freaky Awesome game - Steam 622370",
    "Canonical URL": "https://gusku.site/game/freaky-awesome",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Freaky Awesome\", \"description\": \"Looking for information on Freaky Awesome? Check out the release date (Oct 18, 2017), developer insights from Mandragora, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 18, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mandragora\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mandragora\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/622370/header.jpg?t=1648453808\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}