{
    "AppID": 1189850,
    "Name": "鶴鄉戀旅",
    "Release date": "Feb 27, 2020",
    "About the game": "Introduction: Love Across Izumi is an AVG love game based on Izumi City of Kagoshima (Kyushu) Japan, via this particular media, we wish to let more people know the charm of this city. As the game proceeds, players can perceive the stunning nature, culture, and humanities of Izumi, such as the Izumi-Fumoto Samurai residences, Village of Shinonome, Izumi Municipal Crane Museum, etc . Players can choose their schedule of travel of their free will, and have the chance of encountering different characters. The story describes a newly university graduate who is at lost about his future. To find himself, he had decided to go on a journey in Izumi, not only finding 'love across Izumi' but also the meaning of life. Our game includes location shooting of views of the city and a relaxing, happy story, building the beauty and wonders of this land. Origin: In October 2016, teacher Mr. Lai came to Izumi to participate in the marathon event and had a nice experience during the tour, while also noticing the issue of local advertisement and promotion. Thinking deeply over how to promote and raise recognition of this place, Mr.Lai came across the former president of our Game Creator Club, Cheng Tsung Han, and had come up with the idea of introducing Izumi through computer games. Game Creator Club then issued an Izumi local promoting game program with the support of NCU university and the assistance of the locals and Ms. Nagano Reiko from the Tourism department of the municipal office. We hope that by providing a customized, Izumi-featured, educational local promoting game, we can attract more people to recognize this fascinating city. Game features: -Based on real scenery The story happened in the city of Izumi, so the game is abundant with retouched photos of the city, letting players 'visit' a variety of Izumi's attractions along with the proceeding of the story. -Developing relationships with three female characters During the Journey, our protagonist will encounter three main female characters (and a hidden character): Misaki Ikeda--Our protagonist's high school's schoolmate. A warm and cheerful, energetic, sport-loving girl. Rena Koizumi--A junior of Misaki, has a passion for history. A professional in history. She has a sharp tongue but also a heart of gold. Hasegawa Haru--A gentle, warm-hearted art enthusiast. She is devoted to becoming a novelist. The three main female characters will travel with our main protagonist. As the story goes, the nature, culture, and histories of Izumi will slowly reveal in front of the players' eyes. -Free Choices of travel places During the trip to Izumi, players can decide which attraction they wanted to visit. Whether you want to visit the Hakozaki Hachiman Shrine or learn about the history of Izumi Fumoto History Museum, or even harvest the sweet and juicy mandarins with the farmers, you are free to choose anyone you like. -Write down your trip on your blog Our main protagonist will record the memories of our journey on our blog, giving a real-traveling vibe and not just ordinary gameplay. Post the photos taken during the trip and share our stories with friends! Taiwan-Japan collaboration: Our team had visited Izumi, Kagoshima in 2017 for resources research to create Love Across Izumi, and was greeted with warm welcomes from the locals. We also had given interviews to the press in Japan. Besides being in the newspaper, this program was also broadcast on the news. About us: -NCU Game Creator(NCUGC) NCU Game Creator serves as a game-making exchange platform for students at NCU university and is one of the student community of IDEA NCU, with a membership of 70 people from all departments of NCU. Not only provides courses for game making, but it also contributes to Taiwan's game creation through organizing various activities. To strengthen communications between Taiwan's student game-creating teams, it had held the TSGDF events twice. It holds the goal to combine the power of industry, official, and university, and work together for the development of the Taiwan Game Industry. -Team of Love Across Izumi The production team of Love Across Izumi is composed of 7 NCUGC members and 2 external school partners. We work as a team for the cooperation of local promoting project between NCUGC and Izumi City Hall. Members: Producer/ Game Planner: Boss Game Script: Haox, Fukuyama Masaharu Programmer: 尬廣 Illustrator: Arme, Amo, Sean Motion Graphic: OwO Music: UMI Tempest Digital Ltd.: Tempest Digital Ltd. is a new startup by former NCUGC club leader Cheng Tsunhan and other partners who graduated from NCU. Engaged in computer games, mobile games, digital products, extended reality, creative curation, and gamification design. It hopes that starting from games, it can create more possibilities for digital content, and make a contribution to the game industry in Taiwan.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1189850/header.jpg?t=1602729096",
    "Price": 0.0,
    "Developers": "中央創遊_NCUGameCreator,鶴鄉戀旅製作團隊",
    "Publishers": "Tempest Digital Ltd.  暴風數位服務有限公司",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1189850/ss_1b887292c9e832381dbf09eb227998209d99acda.1920x1080.jpg?t=1602729096,https://cdn.akamai.steamstatic.com/steam/apps/1189850/ss_ea9cada65a75d411ce3a1fe6c7226a4e5035bcc9.1920x1080.jpg?t=1602729096,https://cdn.akamai.steamstatic.com/steam/apps/1189850/ss_4c9d64105c7a0c800c8952e15e25341c9a3fdf15.1920x1080.jpg?t=1602729096,https://cdn.akamai.steamstatic.com/steam/apps/1189850/ss_fa449f78d9deb6c046eb0f6dfd66f65f87f03980.1920x1080.jpg?t=1602729096,https://cdn.akamai.steamstatic.com/steam/apps/1189850/ss_b37ff1942729fde83b6861a7bf17e75f5b3ee7a3.1920x1080.jpg?t=1602729096,https://cdn.akamai.steamstatic.com/steam/apps/1189850/ss_b1b721a089c9cf1d72d35a3243455e71ad22cb7d.1920x1080.jpg?t=1602729096,https://cdn.akamai.steamstatic.com/steam/apps/1189850/ss_8f1775b6dbcc2c867bc89bffc25d6e44809f625b.1920x1080.jpg?t=1602729096",
    "Slug": "",
    "Meta Title": "鶴鄉戀旅: Feb 27, 2020, 中央創遊_NCUGameCreator,鶴鄉戀旅製作團隊 and Full...",
    "Meta Description": "Looking for information on 鶴鄉戀旅? Check out the release date (Feb 27, 2020), developer insights from 中央創遊_NCUGameCreator,鶴鄉戀旅製作團隊, and a complete game su...",
    "Alt Text Image": "Official header image for 鶴鄉戀旅 game - Steam 1189850",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u9db4\\u9109\\u6200\\u65c5\", \"description\": \"Looking for information on \\u9db4\\u9109\\u6200\\u65c5? Check out the release date (Feb 27, 2020), developer insights from \\u4e2d\\u592e\\u5275\\u904a_NCUGameCreator,\\u9db4\\u9109\\u6200\\u65c5\\u88fd\\u4f5c\\u5718\\u968a, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 27, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4e2d\\u592e\\u5275\\u904a_NCUGameCreator,\\u9db4\\u9109\\u6200\\u65c5\\u88fd\\u4f5c\\u5718\\u968a\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tempest Digital Ltd.  \\u66b4\\u98a8\\u6578\\u4f4d\\u670d\\u52d9\\u6709\\u9650\\u516c\\u53f8\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1189850/header.jpg?t=1602729096\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}