{
    "AppID": 1394400,
    "Name": "Gump",
    "Release date": "Sep 9, 2020",
    "About the game": "Well then. this is a game about doobie. he is a boy genius and he invents his gadgets in his lab. doobie makes a flying jet and fly accroass the lands. he meets the quibbles and the land of Gump. This is. action adventure arcade style platformer like game. meaning you can have the feel of the arcade shootout yet have the puzzling progression when flying like the platformer and the enemies are in platform like placement as well. the Flying path of the player object is almost the same as the open world and the maps are long. the enemies don't just die with one shots. neither they just go out and vanish. there is a interaction between the enemies and the player as well as the over all game. theres been some mixed feelings with the menu. try to see it as a click icon type of menu. and the gameplay's has been added to clarify how you can quickly be more effective and win the stage. it'll probably take 2-3 hours to beat the first stage. long gameplay... Game Play the Gameplay is simple yet complex. its reaction based rather that dodge the slow incoming fire. you will get hit, but you get to upload weapons and you have to, like all platformer avoid the traps. such as thunderbolts or tall trees with trap. you get to fly around a open world 2d game and mingle with the quibbles and the bosses. the ammunitions are not so serious as starting off with a time bomb you start the attack. the quibbles can avoid your attack or run frantically here and there when hit. the over all game play is not a walking simulator or a factory scenario neither it is a arcade just keep on shooting till everything blows up. rather you need to concentrate how you are flying and the quibbles are not a one hit dead proposition. as you start to enjoy the characters you will find the game much more enjoyable. the Custom Game maker The Custom game maker is there for you to explore and practice all of the options you want to try out. may be the gun or the Ammo's or the technique of flying across. you can however just hover and do nothing and keep on dropping Ammo's on top of the quibbles or go head on shooting head to head. fly. drop ammo shoot 'em with your guns. get a charger fly fast and power-up defeat the bosses and go to the next land of Gump. the doobies lab The Doobies lab is a secret addition to the upgrade console. here the upgrade is a game as well. you get to experiment with elements and research your own upgrades and unlock them. there are upgrades in the levels as well. but that is a secret. the menus the menus in this game are bit different than normal text based ui, rather you have to use the buttons and the icons to operate with. And thats about it. this game has plenty of stages for your disposal. enjoy doobie and the quibles. Guns and Ammos The guns and the ammo's are a bit on the comical side as it is not a game to go war on countries. or you are not fighting the cia with a 9 mm reload reload. but a array of funny type of guns and the bombs are like that as well such as the following dynamite character or the alien drones with laser vision. Technical : The levels are sprite heavy. so they need a bit of time to load. sorry about that. noway to workaround to that. but with a 4th generation computer you should be good to go. the game is a co- op mission as well where two players can play with two controllers. it's been configured for x-box controllers. may function well with playstation controllers as well. the save game only works for score-points and unlocked stages. it does not save the progress of the game. To go to next level oyu have to beat the boss at the end of the stage. and you'd be given a choice to engage or not to engage with the boss so you can choose your time to engage with the boss. at the end the next level will be unlocked when oyu are victorious ad the dialogues disappear. at the lab. there are substances and the buttons that control temperature and the four buttons of clock settings and the bulb to start the experiment when the setting is done. such as left 1 and 3 choose. right 1 and 3 choose temp 20 clock 40 unlocks the first upgrade. Hope that helps. Whatever you do do not frantically keep on stabbing at the key board without breathing so intensely. try to set the refresh rate of your computer on a reasonable speed. the refresh rate is directly connected to the game engines time frame. if any more bugs appear that is major. it will be fixed. the game is a finished product and well care has been taken are of in all departments. See the gameplay examples that may help ease your mind a little. About the UI, it is a introduction to Icon based Cartoony UI rather than Text based UI's. it's experimental, Never was a UX operation. **dont ask for keys and if you dont know how to play this game you are basically an idiot. dont try to free review buy this game or play. your rubbish shooter box games.if the competetion is low lower class can compete. go avenge.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1394400/header.jpg?t=1627054558",
    "Price": 5.99,
    "Developers": "Workshop-alternatum",
    "Publishers": "Workshop-alternatum",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1394400/ss_3e4093b30a6d67f52d3e18c6a21d8840cb16edad.1920x1080.jpg?t=1627054558,https://cdn.akamai.steamstatic.com/steam/apps/1394400/ss_122d3ceb0464296181da473103918d2e4bf3b81e.1920x1080.jpg?t=1627054558,https://cdn.akamai.steamstatic.com/steam/apps/1394400/ss_d67f307fff32b33dd40cdb865f8b858c118ebb43.1920x1080.jpg?t=1627054558,https://cdn.akamai.steamstatic.com/steam/apps/1394400/ss_9981228d72e840d43d346e3a2ba117e015e0bf9c.1920x1080.jpg?t=1627054558,https://cdn.akamai.steamstatic.com/steam/apps/1394400/ss_ca17a5a1c7015a24b44716c5cbd1b1265e4c96b3.1920x1080.jpg?t=1627054558",
    "Slug": "gump",
    "Meta Title": "Gump: Sep 9, 2020, Workshop-alternatum and Full Overview",
    "Meta Description": "Looking for information on Gump? Check out the release date (Sep 9, 2020), developer insights from Workshop-alternatum, and a complete game summary.",
    "Alt Text Image": "Official header image for Gump game - Steam 1394400",
    "Canonical URL": "https://gusku.site/game/gump",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gump\", \"description\": \"Looking for information on Gump? Check out the release date (Sep 9, 2020), developer insights from Workshop-alternatum, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Workshop-alternatum\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Workshop-alternatum\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1394400/header.jpg?t=1627054558\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}