{
    "AppID": 1848080,
    "Name": "Incursion",
    "Release date": "Jun 9, 2022",
    "About the game": "Incursion is an indie FPS that aims for a unique wave survival experience with class-based combat for both co-op and singleplayer. Fight alongside strangers or friends and take advantage of unique team compositions, upgrade choices, and strategies to win in this solo-developed indie title. About Incursion brings a new twist on wave survival, heavily inspired by Team Fortress 2 and Call of Duty. Utilize unique weapons, abilities, classes, and map knowledge in this intense shooter. Incursion is also primarily developed by one person, which means you know your feedback is going to be heard. BUILD DEFENSES FIGHT AGAINST WAVES Game Features • Online Co-Op: Fight alongside strangers or friends. Unique team compositions, upgrade choices, and strategies can change how a game is played entirely! • Singleplayer: Why make The Republic spend money hiring more soldiers when you're all that's necessary to do the job? A true one man army! Gameplay Mechanics • Unique Classes: Whether you prefer full-auto, explosions, sniping, or building there's something for you to do! When combined with others your team composition can completely change how you play the game. • Sub-Classes &amp; Loadouts: Not only does what class you choose matter, but so does your loadout! Every class has multiple different weapons or equipment you can start the battle with, and different combinations can play completely different. • In-Game Upgrades: You can upgrade your equipment mid-game to change its focus. That means using the same weapon you can tailor your upgrades toward offense, defense, or other play styles. Is this game for you? It's in my best interest to make sure you're happy with your purchase as I want to keep the reviews on this game as positive as possible. So, are any of these deal breakers? If not, this game is perfect for you! First person shooter Reflex-based combat Building defenses Fighting waves of enemies on a map 20~40 minute matches Working toward alternative weapons Classes that change what weapons you have Est. 2~4 hours of gameplay More An alien civilization has launched a infectious virus on Earth in an event known as The Incursion . You're a member of the Republic Defense Force (RDF) whose day-to-day job is clearing infected from strategic locations or defending high value areas. Fight as your favorite class in this online wave-based zombie survival game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1848080/header.jpg?t=1654783232",
    "Price": 13.99,
    "Developers": "Blake Gillman,Whiteout Studios",
    "Publishers": "Whiteout Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1848080/ss_f79bac82ef469084b86a99b56efebef51b149387.1920x1080.jpg?t=1654783232,https://cdn.akamai.steamstatic.com/steam/apps/1848080/ss_8ed05c9f7be4791008f7d49998dd5482e1fb2bae.1920x1080.jpg?t=1654783232,https://cdn.akamai.steamstatic.com/steam/apps/1848080/ss_4bfe2c87a0586db276a85d250f31e5853f11c49a.1920x1080.jpg?t=1654783232,https://cdn.akamai.steamstatic.com/steam/apps/1848080/ss_aa39f27454b6148e6719547f3eaabd4a8e0307a3.1920x1080.jpg?t=1654783232,https://cdn.akamai.steamstatic.com/steam/apps/1848080/ss_8b2e2c6879668849fab87e7fb721ab52a9826f4a.1920x1080.jpg?t=1654783232,https://cdn.akamai.steamstatic.com/steam/apps/1848080/ss_d9f8042ac4dab22d1be0114f42c9d160e3b14585.1920x1080.jpg?t=1654783232",
    "Slug": "incursion",
    "Meta Title": "Incursion: Jun 9, 2022, Blake Gillman,Whiteout Studios an...",
    "Meta Description": "Looking for information on Incursion? Check out the release date (Jun 9, 2022), developer insights from Blake Gillman,Whiteout Studios, and a complete g...",
    "Alt Text Image": "Official header image for Incursion game - Steam 1848080",
    "Canonical URL": "https://gusku.site/game/incursion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Incursion\", \"description\": \"Looking for information on Incursion? Check out the release date (Jun 9, 2022), developer insights from Blake Gillman,Whiteout Studios, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blake Gillman,Whiteout Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Whiteout Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1848080/header.jpg?t=1654783232\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}