{
    "AppID": 1085930,
    "Name": "Light Tracer 2 ~The Two Worlds~",
    "Release date": "Jul 30, 2020",
    "About the game": "20+ hours of gameplay, non-repetitively journey. The mini team spent 3 years, showing a small open-world with freedom to explore. ★Meet our Princess, on her journey to return... While her homeland &amp; kingdom are facing impending doom, the World Gods chose to take her to a realm seemingly outside of time and space. Not one to leave her world and her loved ones behind, she goes on a thriling and grand adventure to rescue them. In Light Tracer 2 you control both the Princess and the floating Hands of the Light, you will explore 4 different Great Isles as well as her kingdom. Long abandoned ruins, rock-ridden fire coasts, a mysterious underworld…only thru beating challenges, lighting up lanterns, using both brains and might can the princess return home…and unveil a great secret. ★Explore! Take your boat and become free to explore both the lands and the ocean at any time and in any way. Traverse the rich nature of Wind Isle, get lost in the ancient Water Peninsula or defy the laws of physics in the Great Underground. ★Solve! By controlling both the Princess and the Hands of Light, the princess can direct a different perspective and different powers to solve these brainy challenges. Sometimes speed makes the difference or a well-timed switch between the princess and her companion, while other times you need to take a step back to figure it all out. ★Fight! Our princess needs to take both sword and magic to get past those trying to stop here, as well as rhytmic QTE-events. The battle of Light Tracer 2 has a bit of “SOULS” style, emphasizing the timing of attack and dodge. Generally, it is quite hard-core and difficult. It is an important part of the CHALLENGING design concept of the entire game. But if you feel strenuous, you can also click the simple mode and enjoy the thrill of solving puzzles and adventure! ★Of Truth How is the strange realm connected to the princess’own world? What is the disaster that the kingdom is facing? How come the World Gods know everything before it has happened? To all these questions only the princess can find an anwer. ★...And of Splendor The strangely alive ruins of Wind Island, the scorching earth-structures of Fire Land, ancient riddles and eastern wisdom in the Water Peninsula, the sublimely wild and vast Desert Lands, the all encompassing Zarkanian Ocean and the Great Halls beneath the Kingdom, LT2 shows a graphic splendor and diverisity worthy of an epic tale.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1085930/header.jpg?t=1636091970",
    "Price": 19.99,
    "Developers": "Void Dimensions",
    "Publishers": "Chuyan Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1085930/ss_e9e672c0af2a147b4a1769044fd88b121baa422f.1920x1080.jpg?t=1636091970,https://cdn.akamai.steamstatic.com/steam/apps/1085930/ss_c8b44a0db87dcc136a5d3da79cbb65b4572d641b.1920x1080.jpg?t=1636091970,https://cdn.akamai.steamstatic.com/steam/apps/1085930/ss_7f8c67c8b218052620272eeff43e68695f52f830.1920x1080.jpg?t=1636091970,https://cdn.akamai.steamstatic.com/steam/apps/1085930/ss_7f2f8f723513e1443186ebf5effe08bf548a348b.1920x1080.jpg?t=1636091970",
    "Slug": "light-tracer-2-the-two-worlds",
    "Meta Title": "Light Tracer 2 ~The Two Worlds~: Jul 30, 2020, Void Dimen...",
    "Meta Description": "Looking for information on Light Tracer 2 ~The Two Worlds~? Check out the release date (Jul 30, 2020), developer insights from Void Dimensions, and a co...",
    "Alt Text Image": "Official header image for Light Tracer 2 ~The Two Worlds~ game - Steam 1085930",
    "Canonical URL": "https://gusku.site/game/light-tracer-2-the-two-worlds",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Light Tracer 2 ~The Two Worlds~\", \"description\": \"Looking for information on Light Tracer 2 ~The Two Worlds~? Check out the release date (Jul 30, 2020), developer insights from Void Dimensions, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Void Dimensions\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Chuyan Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1085930/header.jpg?t=1636091970\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}