{
    "AppID": 1831050,
    "Name": "LIP! Lewd Idol Project Vol. 1 - Hot Springs and Beach Episodes",
    "Release date": "Dec 15, 2021",
    "About the game": "The ultimate fanservice experience is here! A 2-in-1 yuri lewd adventure for the cultured people! Are you ready for it? Important: This release contains two fanservice episodes that complement the main story of LIP! Lewd Idol Project and take place during Vol. 1 itself. Both of them can be played without any previous knowledge of the series, but be sure to also check the main story for the complete experience! LIP! Lewd Idol Project is a yur i Visual Novel series about a girl's adventure to becoming an Akihabara Lewd Idol! Join Kairi in her adventure and explore the city, meet new friends, and try to form a group overcoming all the odds while having a lot of girl-on-girl action ! Kairi has been on the brink of giving up on her dreams after being rejected by over fifteen different idol agencies. Not long after that, she meets Ranko , a mature and experienced woman who refers to herself as a Lewd Producer . With more questions than answers, and nothing left to lose, Kairi decides to join Ranko's weird but ambitious idea… Lewd Idol Project . Shortly after starting their lewd journey with an innocent and inexperienced Kairi as the first member of the group, Ranko decides to take her for an unforgettable trip: A relaxing hot springs where they will spend a day together in order to get a little bit more intimate, and a hot beach , where the first ever PLOT Queen Contest - a swimsuit event that promises to be the hottest of the summer - is being held. As expected, the experienced Ranko won’t miss this golden chance of being alone with her beloved Kairi-chan . They will spend two unforgettable days together , sharing some of the funniest, most unexpected, and hottest moments of their recently started career in the lewd idol industry... Are you gonna miss it? High quality anime-style artwork Fully uncensored yuri 18+ CGs Multiple Endings Unlockable CG Gallery to view erotic scenes and character sprites Alternative Costumes to unlock in Wardrobe Mode Relationship Meter between the girls Photo Mode Jukebox Mode Partial Japanese voice acting Select your favorite episode! Which one are you gonna play first? Unlock and enjoy both wholesome and erotic yuri CG scenes in Gallery Mode! Kairi and Ranko will have multiple alternative costumes you can unlock and enjoy along the adventure! After getting a new costume, you'll get unlimited access to them in Wardrobe Mode. Try to unlock them all! Our heroines will have a relationship meter that will increase or decrease each time you take an action or dialogue decision while interacting with each other. Build your meters up to 100% and unlock extra lewd scenes and endings ! Create your own scene with your favorite girls and costumes and take a picture to save on your device ! Discover and unlock multiple endings depending on your choices!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1831050/header.jpg?t=1639598074",
    "Price": 3.99,
    "Developers": "Toffer Team",
    "Publishers": "Denpasoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1831050/ss_1895324df27899750d51ebc8d49fab263ba65f4e.1920x1080.jpg?t=1639598074,https://cdn.akamai.steamstatic.com/steam/apps/1831050/ss_c1520414ae3c47f0a375ceff071147d06a4282a1.1920x1080.jpg?t=1639598074,https://cdn.akamai.steamstatic.com/steam/apps/1831050/ss_916e8611e9faa861972f8b30045595450278a20b.1920x1080.jpg?t=1639598074,https://cdn.akamai.steamstatic.com/steam/apps/1831050/ss_dfb93e0b04f1a66281c1c32372538bcda4ab9832.1920x1080.jpg?t=1639598074,https://cdn.akamai.steamstatic.com/steam/apps/1831050/ss_2af16376f7c2723381dcc3882042fff17f8afbc0.1920x1080.jpg?t=1639598074,https://cdn.akamai.steamstatic.com/steam/apps/1831050/ss_261869787523aee0f2554b651d9682a51ae2fec2.1920x1080.jpg?t=1639598074,https://cdn.akamai.steamstatic.com/steam/apps/1831050/ss_96038baf109132e05b9af52f578f8d854603565f.1920x1080.jpg?t=1639598074,https://cdn.akamai.steamstatic.com/steam/apps/1831050/ss_e808a8bc23d21add56c8b1aea1f163effa832ac0.1920x1080.jpg?t=1639598074",
    "Slug": "lip-lewd-idol-project-vol-1-hot-springs-and-beach-episodes",
    "Meta Title": "LIP! Lewd Idol Project Vol. 1 - Hot Springs and Beach Epi...",
    "Meta Description": "Looking for information on LIP! Lewd Idol Project Vol. 1 - Hot Springs and Beach Episodes? Check out the release date (Dec 15, 2021), developer insights...",
    "Alt Text Image": "Official header image for LIP! Lewd Idol Project Vol. 1 - Hot Springs and Beach Episodes game - Steam 1831050",
    "Canonical URL": "https://gusku.site/game/lip-lewd-idol-project-vol-1-hot-springs-and-beach-episodes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LIP! Lewd Idol Project Vol. 1 - Hot Springs and Beach Episodes\", \"description\": \"Looking for information on LIP! Lewd Idol Project Vol. 1 - Hot Springs and Beach Episodes? Check out the release date (Dec 15, 2021), developer insights...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Toffer Team\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Denpasoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1831050/header.jpg?t=1639598074\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}