{
    "AppID": 1879560,
    "Name": "Lucky Tlhalerwa - Super Incursion",
    "Release date": "Feb 4, 2022",
    "About the game": "- Game Description Super Incursion is a linear third-person story adventure, it takes 7~8 hours on average to beat the 10 chapter linear story, there are checkpoints, you can save and load your progress and replay chapters from chapter selection after completing them. - Story Plot Super Incursion takes place after the Global Terrorism Confederation's first genocide attack in which the world lost 90% of the human population, all of the worlds super powers were crippled by this attack, the U.S. and Russia kept their SPYING operations going, and focused them on the Global Terrorism Confederation and uncovered a new protocol, which G.T.C simply nicknames Protocol 87, The U.S. with no army of its own anymore works with IMS (Incursion Military Service) and the Gemstone Ministry of defence to create Operation Winter Strike which serves to send 3 teams of IMS Special Forces which include 2 Protagonists Captain John Jason(YOU) &amp; Lieutenant Marcelene Grimes(TEAMMATE) to Gemstone Island's Advanced City which is where G.T.C Protocol 87 is based to uncover more details of it and find ways to take it down before it succeeds on what its meant to do. - Setting Up Your Character's Gender, Attributes, Cosmetics And Skills Main Character John Jason can be Male or Female, Before starting the story your asked to setup your character by selecting gender: male or female, and cosmetics including hair color, bag color, skin color. Then you set up your 3 different perks, select your story difficulty (Easy, Difficult, Veteran), choose to play with PERMANENT DEATH or disable it, and finally distribute your attribute points across 5 different skills 1.Looting 2.Technical 3.Enginuity 4.Trading 5.Talking. All of these elements affect the gameplay tremendously, If you intend to use guns throughout the story pre-dominantly spend more attribute points towards Looting attribute, melee &amp; shield players should spend more attribute points towards Technical attribute, Players who will relay heavily on crafting (Eg: medikits, bandages, pipebombs and molotovs etc) should spend more points towards Enginuity attribute (For Example: which reduces the amount of crafting components consumed by making each item and shows hidden craftable items in the crafting list). Players can choose to be a Rifle man and spend more skill points towards upgrading the Rifle, pistol &amp; crossbow skill tree, increasing weapon damage, clip size, total ammo carry capacity and enable Perfected Mastered Recoil Control which allows John to fire any gun in the story with minimal recoil... Melee &amp; Shield players should spend more skill points upgrading the melee and shield skill tree to increase melee combat stamina, melee damage, jump height, enable the ability to take a melee weapon from the hands of an enemy after you defeat it in combat and enable Perfected Mastered Dodging which allows John to automatically dodge all enemy melee attacks as long as you have stamina... - Dodging Enemy Melee Attacks John Jason can dodge in-coming enemy melee attacks when you press (E) before the attack hits you, John will dodge the entire attack and sustain no damage at all, You can dodge attacks while holding a gun, if your a melee player you can use dodging to your advantage to takedown enemies without sustaining alot or no damage at all. You must time when to press the button during the attack to dodge it entirely. - Hiding In Tall Grass From Enemy Sight You can prone and crawl in tall grass to be completely hidden from enemy sight, you can break chases by running away from enemies and laying down in tall grass. You can also break and reset chases by running away and hiding behind cover, causing enemies to search for you not knowing where you are. -Listening To Enemy Movement To Spot Them John can focus and listen to enemy movement to spot nearby enemies, the ability is great for spotting enemies behind walls or in dark areas. -Weapon Gameplay You will pick up weapons in the environment and more can be purchased with money you'll collect throughout the story in the post-apocalyptic world, you can enhance your rifles by adding sights, fore grips and extended magazines, same goes for your pistols. in the rifle skill tree you can increase weapon rate of fire and damage, crossbow can be upgraded on the skill tree, increasing reload speed and arrow carry capacity. Melee weapons are found in buildings, out door spaces and can be dropped by enemies you've defeated. You can fix your melee weapons with melee repair kits you find in the world or buy from the weapon bench. If your technical attribute points are high you can repair broken melee weapons with less melee repair kits. -Exploration Exploration in the world of Super Incursion can be very rewarding as you can lock pick doors to restricted areas and find precious loot, when you search the environment you will find crafting components (to craft new items), money, gold, lockpicks, medikits, pipebombs, flashbangs, smokebombs, ammo etc. Exploration is part of the gameplay. If your technical attribute points are high, you can hack doors to locked store rooms and hardware stores, If your looting attribute points are high, ammo pickups will reward you more bullets than normal and you can unlock doors to other restricted areas with loot.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1879560/header.jpg?t=1658498165",
    "Price": 1.03,
    "Developers": "Lucky Tlhalerwa",
    "Publishers": "Lucky Tlhalerwa",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_912ce62945a834464b04120d9117659d51b06b7a.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_5fcc3142b39a53b3486c62140cc62e8e44c33663.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_b70969370814c0a366d1c293c061ae6132f19559.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_6f3d69f561260f6ed4afe6d00b5a2b87b8fea84c.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_f058a53846bab455a0df80075aae62796b5d6d5d.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_9b27d80dc2e9b43c5a37a78592e9ad8ae0c90402.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_e246d3163255888497b2ec74baed047957fa51ff.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_339528cd7e82e328dc27c941e8abf08e4cafac21.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_a0940014efa1edb1b677fc5aa8ea12eba2c06e39.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_76677f5d280f46492c1dd77e736dcfca8b297954.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_cafb067719afa90a6f28b5958e9e12a65f9433d1.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_fff64a7d5c0b36c33cd2713b0f10386bd8a237eb.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_a161582fe382ec42bfbf9e0d7f372ccb7ff9d73b.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_bbb09ebb04cf9f728d45812e4d8a19ac13e9eb6f.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_a02f8ee203d6487f96d0f54654fbdf2b6add439b.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_6a0e7cf257b8145af0892b47a4c6e9f3470c12c7.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_00af91d49f2dfe9c69ea16e46269bcf3f5d0d648.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_b5321d5acaafca487e4c66fba94c3169eb0cb8f5.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_889471da3bf53a82af17d4029ffdf3628a3534f6.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_4c5d5114599ca0b78d71b4b4009c1a8b5bc9b099.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_b290d2d9498d7b0914328fac62037c9e0bbb853f.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_a5a567a03f2e9cf5644095d52944358c1722dfab.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_0db15e7487740c1b5838197139784c9a9ea1117f.1920x1080.jpg?t=1658498165,https://cdn.akamai.steamstatic.com/steam/apps/1879560/ss_ecefb824b9c0d8227d39832534541321b940764a.1920x1080.jpg?t=1658498165",
    "Slug": "lucky-tlhalerwa-super-incursion",
    "Meta Title": "Lucky Tlhalerwa - Super Incursion: Feb 4, 2022, Lucky Tlh...",
    "Meta Description": "Looking for information on Lucky Tlhalerwa - Super Incursion? Check out the release date (Feb 4, 2022), developer insights from Lucky Tlhalerwa, and a c...",
    "Alt Text Image": "Official header image for Lucky Tlhalerwa - Super Incursion game - Steam 1879560",
    "Canonical URL": "https://gusku.site/game/lucky-tlhalerwa-super-incursion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lucky Tlhalerwa - Super Incursion\", \"description\": \"Looking for information on Lucky Tlhalerwa - Super Incursion? Check out the release date (Feb 4, 2022), developer insights from Lucky Tlhalerwa, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lucky Tlhalerwa\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lucky Tlhalerwa\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1879560/header.jpg?t=1658498165\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.03, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}