{
    "AppID": 1615920,
    "Name": "ORO",
    "Release date": "May 22, 2021",
    "About the game": "ORO takes you into the story of the legendary retired demon 'Oro', who must stop an evil force that arises to destroy the world. He must recruit allies to stop it once and for all and his time is limited! However, who says he can't have some fun while doing so? ORO is a former 'Divine warrior' with a bad attitude and an unusual sex appeal, also a strong demon. Hated by many and feared by others, he tries to do the right thing, but his destiny will not allow him to fulfill this without taking everything he loves till he is broken, now it is up to you to help him become a great demon or a superhero and also get as many ladies on your bed as you can. How to Play: ORO is an RPG type game where you will have to fight or have sex to improve both your fighting and sexual skills. GENERAL: Use the arrow keys or left-click with the mouse to move around the map or to select the different options in the dialogues. ENTER, z or left click: accept, select or move around the map. ESC, X or right click: exit actions, hide text box or enter to main menu 'Shift + enter: when you are in front of a game character or NPC you can bring up a special menu where you can kill, insult or ask for a date. JOB: Next to the bed, in your room, there is a glowing icon that when you press ENTER or interact with the mouse directly you will go to a screen where you will be able to choose between different types of jobs, work to get special food, money or improvements in your skills. Level up and you will receive better items or money. COOKING: In the course of the game you will find items to generate different effects such as recovering your health if you are low on energy because of a fight or cure the effect of a poison, etc.. Next to the glowing work icon, you will see another glowing icon in the kitchen. So, interact with it to enter the cooking screen that will allow you to mix seasonings with meats to make dishes that enhance their effect powers. DATES: You may notice that at the bottom there are a series of icons of girls you will be able to meet. First you must search and find the different characters and once you unlock them, use SHIFT + ENTER to ask her for an APPOINTMENT, answer correctly what she wants and buy objects that can increase her interest in you, you will see it reflected in the number at the bottom of the main screen. SEX: If you have completed the appointments correctly and she loves you enough, she will visit you at your house where you will have more intimate dates if everything goes well you will have the option to have a sexual adventure and after that you can invite her to stay at your house to have sex RPG. RPG SEX: This is the main proposal of the game and that you may not have seen it elsewhere, it is about playing, as if it were a battle, a sex event where the important thing is that she finishes first to gain more experience, more techniques and important improvements in your level so that each time you finish slower and you can make any of them finish first than you. Play and have a lot of fun, unlock all the characters and complete this great adventure!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1615920/header.jpg?t=1621700692",
    "Price": 9.99,
    "Developers": "Kitoro Games",
    "Publishers": "ImagineVR",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1615920/ss_0668d44ebede898e9059d7ae9c51745fb8ecaa07.1920x1080.jpg?t=1621700692,https://cdn.akamai.steamstatic.com/steam/apps/1615920/ss_dade8a2e63292eda873eeaf7a43659701dc28c2d.1920x1080.jpg?t=1621700692,https://cdn.akamai.steamstatic.com/steam/apps/1615920/ss_bf550fada193bae7662381ce5c79c1a3a84f8072.1920x1080.jpg?t=1621700692,https://cdn.akamai.steamstatic.com/steam/apps/1615920/ss_ffa6b31c165489a50250d89ec4937cfc87a7a653.1920x1080.jpg?t=1621700692,https://cdn.akamai.steamstatic.com/steam/apps/1615920/ss_96fa473794cde5483dd279e276bcbf5772a0fed7.1920x1080.jpg?t=1621700692,https://cdn.akamai.steamstatic.com/steam/apps/1615920/ss_c33e840bcc00f7d1399b6a4ae0bf5c36c97ca9b4.1920x1080.jpg?t=1621700692",
    "Slug": "oro",
    "Meta Title": "ORO: May 22, 2021, Kitoro Games and Full Overview",
    "Meta Description": "Looking for information on ORO? Check out the release date (May 22, 2021), developer insights from Kitoro Games, and a complete game summary.",
    "Alt Text Image": "Official header image for ORO game - Steam 1615920",
    "Canonical URL": "https://gusku.site/game/oro",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ORO\", \"description\": \"Looking for information on ORO? Check out the release date (May 22, 2021), developer insights from Kitoro Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kitoro Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ImagineVR\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1615920/header.jpg?t=1621700692\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}