{
    "AppID": 367450,
    "Name": "Poly Bridge",
    "Release date": "Jul 12, 2016",
    "About the game": "Unleash your engineering creativity with an engaging and fresh bridge-building simulator with all the bells and whistles. Enjoy hours of physics-based puzzle solving in the Campaign and then jump in the Sandbox to create your own bridge designs and puzzles. Challenge friends and the rest of the Steam Workshop community to solve your puzzles and download more levels submitted by other players. Check out the Online Gallery at ! Enjoy hours of bridge-building fun with loads of levels to solve, ranging from simple light car bridges to multi-deck draw-bridges and jumps, just to name a few! Levels get increasingly challenging from the engineering aspect and restrictions are also imposed on the resources you can use to build your bridge. What would an awesome bridge-builder game be without an equally awesome Sandbox? Go wild and create the most complex bridge the world has ever seen, or just an absurd creation that pushes the mechanics of the game in a new direction, and if you're feeling like it publish your design online as a puzzle level on the Workshop for everyone to try and solve! Download hundreds of extra levels from the Workshop! We'll also be featuring the most original and fun bridge designs that are submitted, making it easier for you to find the ones that are worth the challenge. One of our favorite features of the game! Save a super cool looking animated GIF of your bridge in all its glory (or failure!) and save it locally, upload it to the Poly Bridge Online Gallery and/or share it Twitter, Facebook, Reddit or Tumblr without ever leaving the game! Check out the Online Gallery at ! Unleash your true engineer using the advanced building and level designing tools in-game, such as: Advanced Hydraulics Multi-phase Hydraulics Controller (control which hydraulic piston activates when) Node-base event system Multiple types of checkpoints Copy &amp; Paste tools Line Tracer tools (draw perfect arcs or straight lines and fill them in with your material of choice) And much more...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/367450/header.jpg?t=1567634023",
    "Price": 9.99,
    "Developers": "Dry Cactus",
    "Publishers": "Dry Cactus",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/367450/ss_b3dce890393c16349a1af732e27637ca265d5f82.1920x1080.jpg?t=1567634023,https://cdn.akamai.steamstatic.com/steam/apps/367450/ss_41be75d110af3553a634db07d3d670c175e3a86f.1920x1080.jpg?t=1567634023,https://cdn.akamai.steamstatic.com/steam/apps/367450/ss_dbb885ba96575538c64e21e9d53cf321c07b237c.1920x1080.jpg?t=1567634023,https://cdn.akamai.steamstatic.com/steam/apps/367450/ss_86ffa5d4abbcf063547a3a6aeee61dcc6e701624.1920x1080.jpg?t=1567634023,https://cdn.akamai.steamstatic.com/steam/apps/367450/ss_54c237cd4a018028fbb97742ac0c012da46b4f24.1920x1080.jpg?t=1567634023,https://cdn.akamai.steamstatic.com/steam/apps/367450/ss_aabb845a9d8c0106d7cdbf45cea94626662e59a8.1920x1080.jpg?t=1567634023",
    "Slug": "poly-bridge",
    "Meta Title": "Poly Bridge: Jul 12, 2016, Dry Cactus and Full Overview",
    "Meta Description": "Looking for information on Poly Bridge? Check out the release date (Jul 12, 2016), developer insights from Dry Cactus, and a complete game summary.",
    "Alt Text Image": "Official header image for Poly Bridge game - Steam 367450",
    "Canonical URL": "https://gusku.site/game/poly-bridge",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Poly Bridge\", \"description\": \"Looking for information on Poly Bridge? Check out the release date (Jul 12, 2016), developer insights from Dry Cactus, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 12, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dry Cactus\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dry Cactus\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/367450/header.jpg?t=1567634023\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}