{
    "AppID": 339340,
    "Name": "Resident Evil 0",
    "Release date": "Jan 19, 2016",
    "About the game": "Be prepared to relive the first nightmare in Resident Evil 0, a remastered version of the popular prequel to the original Resident Evil game. This remastered version takes the fear-inducing atmosphere from the original 2002 release and transforms it with stunning new HD visuals, improved sound, widescreen support and an optional modernized control system and more. It’s the best way to experience the story of what really happened before the iconic mansion incident that was the catalyst for the entire Resident Evil saga. The story of Resident Evil 0 takes players back to 1998. Reports have been mounting about unusual murders on the outskirts of Raccoon City. The city’s Special Forces division, S.T.A.R.S., sends their Bravo Team - including rookie cop member Rebecca Chambers - to investigate. On route, the team’s helicopter suffers engine trouble and is forced to make a crash landing, where they find an overturned prisoner transport vehicle. Splitting up to search the area, Rebecca discovers the Ecliptic Express, a train stopped dead on the tracks. Inside, she meets death row convict and ex-Navy lieutenant Billy Coen. Throughout the game, you will take control of both Rebecca and Billy, at times switching between both characters in order to proceed. Learning the advantages of each character is the key to solving puzzles and surviving the nightmares that lie ahead. Features Return to the series origins – Discover the truth behind what led to the horrors at the Mansion in Resident Evil in this fan-favorite and popular prequel title to the series. Completely enhanced visuals – New high-resolution textures have been created from scratch, including 1080p support on next-gen consoles, while still preserving the classic appearance of the original release. Fully remastered sound effects – 5.1 surround support provides a more experiential gaming atmosphere that best matches players’ listening environments. Experience the horror in the classic 4:3 ratio or newly added 16:9 widescreen mode. Play with the classic control scheme, or enjoy a new alternative scheme where the character moves in the direction of an analogue stick. Fan-favorite Resident Evil characters – Rookie S.T.A.R.S. member Rebecca Chambers and wanted criminal Billy Coen combine skills and buddy up to survive the undead and infected nightmares that await them. Wesker Mode - After completing the main storyline, you will be able to take control of series antagonist Albert Wesker, and use his superhuman abilities to power through the missions.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/339340/header.jpg?t=1650860095",
    "Price": 19.99,
    "Developers": "CAPCOM Co., Ltd.",
    "Publishers": "CAPCOM Co., Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/339340/ss_d5a3942f55ef3740038f47b3cba060d8f7c30796.1920x1080.jpg?t=1650860095,https://cdn.akamai.steamstatic.com/steam/apps/339340/ss_b0199743726c2c5a2ce61069dce8e106a80add04.1920x1080.jpg?t=1650860095,https://cdn.akamai.steamstatic.com/steam/apps/339340/ss_07f1cd2e785c0fc107727d7d3a87c6bfa8a2a14f.1920x1080.jpg?t=1650860095,https://cdn.akamai.steamstatic.com/steam/apps/339340/ss_118273fd3c8aec4e98fc90e257cc01e30a133687.1920x1080.jpg?t=1650860095,https://cdn.akamai.steamstatic.com/steam/apps/339340/ss_fdcfae4e8f5205673ce70b04c50890a3efe0bc95.1920x1080.jpg?t=1650860095,https://cdn.akamai.steamstatic.com/steam/apps/339340/ss_828ec43ddc35054f07f86c26d3f7bce2a1a0a618.1920x1080.jpg?t=1650860095,https://cdn.akamai.steamstatic.com/steam/apps/339340/ss_bb0c7e991eb99cbbae1b88f7cf7ac591944d3acb.1920x1080.jpg?t=1650860095,https://cdn.akamai.steamstatic.com/steam/apps/339340/ss_6acfba70b11e17510275814e54b15053caf08984.1920x1080.jpg?t=1650860095",
    "Slug": "resident-evil-0",
    "Meta Title": "Resident Evil 0: Jan 19, 2016, CAPCOM Co., Ltd. and Full ...",
    "Meta Description": "Looking for information on Resident Evil 0? Check out the release date (Jan 19, 2016), developer insights from CAPCOM Co., Ltd., and a complete game sum...",
    "Alt Text Image": "Official header image for Resident Evil 0 game - Steam 339340",
    "Canonical URL": "https://gusku.site/game/resident-evil-0",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Resident Evil 0\", \"description\": \"Looking for information on Resident Evil 0? Check out the release date (Jan 19, 2016), developer insights from CAPCOM Co., Ltd., and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 19, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"CAPCOM Co., Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CAPCOM Co., Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/339340/header.jpg?t=1650860095\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}