{
    "AppID": 1980490,
    "Name": "Speedway Challenge 2022",
    "Release date": "Jun 8, 2022",
    "About the game": "Are you speedway fan? Were you ever thinking about speedway career? Would you like you lead your favourite team to the championship? Or maybe you would like to compete with your friends in a tournament? If you answered 'yes' at least once, Speedway Challenge 2022 is for you! Thanks to new riding model and animation you will feel like a real speedway rider. Show off your reflex at the start, choose the best lines at the track and rush for the glory in one out of 5 game modes: - MULTIPLAYER - get togheter with friends and ride in online tournament, - CAREER - get a license, fight for a spot in the team lineup, earn money, upgrade your gear and become a speedway legend, - LEAGUE - select your favourite team, choose your line-up, buy new riders and compete in Country Championship, - CHALLENGES - accept the challenge, play the competition and accomplish stated goals, - QUICK GAME - relax in a friendly match between 2 teams. Muliplayer mode's key features: - cross-platform - compete with friends no matter which device do you play - phone or PC, - opponents selection - invite your friends to the game or compete with random players, - many rider and bike skins to wear, - spot for spectator - any problem with decision who should be excluded from the re-run? invite fifth person, who will be a spectator, Career mode's key features: - creating your own rider, - license exam - pass it to sign your first contract, - many rider and bike skins to wear, - rider's equipment - complete and upgrade yours, - bike parts - invest in your bike to gain advantage over rivals, - transport - take care of logistics and upgrade your transport to take more parts for matches, - contracts - hire managers, to receive new contract offers, - rider's budget - grow your income step by step, but never spend all of your funds if you don't want to finish your career too quickly, - riding in a few leagues - choose the best offers and start in many leagues at one time (senior leagues available - Polish, Swedish, British, Danish, German, Czech, French and junior leagues - Polish, Swedish, British), - individual championships - become a junior or senior country champion, - individual world championships - qualify to the championship and fight for a speedway world champion title, - injuries - different types of injuries with variable recovery time, - complex statistics - monitor your results in comparison to the other riders, - varaiable riders performance during the season. League mode's key features: - team line-up - select your team's line-up for senior and junior competitions and lead them to victory, - club's budget - control your finances or you will be relegated to the lowest division, - transfers - negotiate contracts with your current riders and the ones you want to buy, - rider's morale - take care of mood among your team, - injuries - different types of injuries with variable recovery time, - complex statistics - monitor your results in comparison to the other teams, - varaiable riders performance during the season. Game's key features: - realistic riding model, including contact between riders, - real eWinner 1. Liga and 2. Liga Żużlowa player and team names, - extended starting procedure, - configurable camera view (horizontal, from behind, first person and vertical, zoom in and zoom out) - referee decisions, - 3 difficulty levels, - game rules based on real leagues rules, - changing weather conditions, - over 90 teams (league and national), - almost 1000 riders with diversified skills, - over 40 tracks with different riding characteristics.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1980490/header.jpg?t=1654673789",
    "Price": 9.99,
    "Developers": "Artur Berkowski Berobasket",
    "Publishers": "Artur Berkowski Berobasket",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1980490/ss_d85e8dda1d8434d10a42cbbc412b320229c296d7.1920x1080.jpg?t=1654673789,https://cdn.akamai.steamstatic.com/steam/apps/1980490/ss_091d0822f935e892e37d189fefbfab3ac559e610.1920x1080.jpg?t=1654673789,https://cdn.akamai.steamstatic.com/steam/apps/1980490/ss_b48f68a3e03fc67a56426a2651d5ad5e38c7af22.1920x1080.jpg?t=1654673789,https://cdn.akamai.steamstatic.com/steam/apps/1980490/ss_f454043d24167b2c2edeb24351f97a44ea848d1a.1920x1080.jpg?t=1654673789,https://cdn.akamai.steamstatic.com/steam/apps/1980490/ss_46211d19e979676b26ef09b399bd202c8d147909.1920x1080.jpg?t=1654673789,https://cdn.akamai.steamstatic.com/steam/apps/1980490/ss_85df977bcb0536cccda892d207fd301bcfb74fad.1920x1080.jpg?t=1654673789,https://cdn.akamai.steamstatic.com/steam/apps/1980490/ss_9406b41c00056a2999c3cabdabf469ed2355455f.1920x1080.jpg?t=1654673789,https://cdn.akamai.steamstatic.com/steam/apps/1980490/ss_70c91b56ea9a2e94fb6023195df522a4ceea75c0.1920x1080.jpg?t=1654673789,https://cdn.akamai.steamstatic.com/steam/apps/1980490/ss_c5f585d170902e81544e0681817e170a0776e437.1920x1080.jpg?t=1654673789,https://cdn.akamai.steamstatic.com/steam/apps/1980490/ss_65e199771e88216bf2e430d8fa9c6d7ac64d31a9.1920x1080.jpg?t=1654673789,https://cdn.akamai.steamstatic.com/steam/apps/1980490/ss_d20c3eac051af3b00d08c32438548a12a5066f6f.1920x1080.jpg?t=1654673789,https://cdn.akamai.steamstatic.com/steam/apps/1980490/ss_83b143299a78f3fe6d1dff2763db60dbc0cf8fc4.1920x1080.jpg?t=1654673789,https://cdn.akamai.steamstatic.com/steam/apps/1980490/ss_27514c9586784794b3b49e0384059531e05f8ef0.1920x1080.jpg?t=1654673789",
    "Slug": "speedway-challenge-2022",
    "Meta Title": "Speedway Challenge 2022: Jun 8, 2022, Artur Berkowski Ber...",
    "Meta Description": "Looking for information on Speedway Challenge 2022? Check out the release date (Jun 8, 2022), developer insights from Artur Berkowski Berobasket, and a ...",
    "Alt Text Image": "Official header image for Speedway Challenge 2022 game - Steam 1980490",
    "Canonical URL": "https://gusku.site/game/speedway-challenge-2022",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Speedway Challenge 2022\", \"description\": \"Looking for information on Speedway Challenge 2022? Check out the release date (Jun 8, 2022), developer insights from Artur Berkowski Berobasket, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Artur Berkowski Berobasket\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Artur Berkowski Berobasket\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1980490/header.jpg?t=1654673789\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}