{
    "AppID": 900370,
    "Name": "Stockpile",
    "Release date": "Sep 21, 2018",
    "About the game": "About the game -------------------------------------------------------- Stockpile is an economic board game that combines the traditional stockholding strategy of buy low, sell high with several additional mechanisms to create a fast-paced, engaging and interactive experience. In Stockpile, players act as stock market investors at the end of the 20th century hoping to strike it rich, and the investor with the most money at the end of the game is the winner. Stockpile centers on the idea that nobody knows everything about the stock market, but everyone does know something. In the game, this philosophy manifests in two ways: insider information and the stockpile. Both of these mechanisms are combined with some stock market elements to make players consider multiple factors when selling a stock. Do you hold onto a stock in hopes of catching a lucrative stock split or do you sell now to avoid the potential company bankruptcy? Can you hold onto your stock until the end of the game to become the majority shareholder, or do you need the liquidity now for future bidding? Do you risk it all by investing heavily into one company, or do you mitigate your risk by diversifying your portfolio? In the end, everyone knows something about the stock market, so it all comes down to strategy execution. Will you be able to navigate the movements of the stock market with certainty? Or will your investments go under from poor predictions? Stockpile: Continuing Corruption -------------------------------------------------------- The first expansion for Stockpile contains four expansion modules that can be played separately or used all together for more strategic game play. Module 1: Forecast Dice — Six custom dice offer more excitement by changing the market forecast round-to-round. Roll the dice at the beginning of the round. The dice cause the market to rise or fall on any given turn and ensures that no two games will ever be the same. Module 2: Bonds — Bond present a new, safe investment option for players. Purchasing bonds can provide a steady stream of interest payments every round. However, it comes at a price. The original money used to purchase bonds cannot be recovered until the end of the game. Be careful not to overspend or you might lose out on valuable stockpiles. Module 3: Commodities &amp; Taxes — Commodities &amp; Taxes create much more tension during the game. Each round, players add Commodities or Taxes to the stockpiles. Collect different types of commodities and dodge taxes to earn substantial end-game bonuses. Module 4: More Investors — Stockpile: Continuing Corruption adds six new investors from around the world who have heard about massive profits being made, and they want in on the action. Each investor possesses a unique ability that opens up more ways to win. The addon is included for free in the base game. Features -------------------------------------------------------- - The easy to follow tutorial guides you through the rules - cross-platform play with all opponents - ranked and casual games - world ladder with GLICKO rating - 6 optional combinable rulesets for unlimited replayability - 3 AI opponents (easy, medium and hard) - scalable game complexity - play offline alone or with your friends/spouse - asynchronous game with notifications - fast ranked games for live experience - 10 new quality avatars for your DIGIDICED collection - Languages: English, German, French, Spanish, Korean, Chinese (simplified), Japanese, Russian and Italian Awards of the physical game -------------------------------------------------------- 2015 Cardboard Republic Socializer Laurel Nominee",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/900370/header.jpg?t=1578673852",
    "Price": 6.99,
    "Developers": "DIGIDICED",
    "Publishers": "DIGIDICED",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/900370/ss_feb2ad4bf1c01881c6837ba79ba16d1cef397925.1920x1080.jpg?t=1578673852,https://cdn.akamai.steamstatic.com/steam/apps/900370/ss_e671e2ad0b2c0ddfc9298fc0e196538aff0447c3.1920x1080.jpg?t=1578673852,https://cdn.akamai.steamstatic.com/steam/apps/900370/ss_6436fe47f7b6f0973f72f33e9b5f1d8fe6e0a689.1920x1080.jpg?t=1578673852,https://cdn.akamai.steamstatic.com/steam/apps/900370/ss_094765154ae1b9ab57f6aa0cd801e616cf4291a5.1920x1080.jpg?t=1578673852,https://cdn.akamai.steamstatic.com/steam/apps/900370/ss_7ecece22af2b906f74f0f890fdee20a627f81be1.1920x1080.jpg?t=1578673852",
    "Slug": "stockpile",
    "Meta Title": "Stockpile: Sep 21, 2018, DIGIDICED and Full Overview",
    "Meta Description": "Looking for information on Stockpile? Check out the release date (Sep 21, 2018), developer insights from DIGIDICED, and a complete game summary.",
    "Alt Text Image": "Official header image for Stockpile game - Steam 900370",
    "Canonical URL": "https://gusku.site/game/stockpile",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Stockpile\", \"description\": \"Looking for information on Stockpile? Check out the release date (Sep 21, 2018), developer insights from DIGIDICED, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 21, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"DIGIDICED\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DIGIDICED\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/900370/header.jpg?t=1578673852\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}