{
    "AppID": 1397030,
    "Name": "Survive or Thrive",
    "Release date": "Sep 7, 2020",
    "About the game": "(This game, as well as many others in our bundle, is FANTASTIC for Youtubers &amp; Streamers to create content, engage with their audience, &amp; allow their audience to better get to know them through answering a series of questions about the content creator! This creates a unique experience for all parties involved, and players playing the game themselves can enjoy the solo experience tremendously all on their own as well!) Survive or Thrive Crikey, mate! You shouldn't be out here all on your own! There's big MONSTAS' out here! Do you really think you've got what it takes to survive? Or do you think you're cut out for much more than that... You don't think you could actually... THRIVE... do you? Besides... It's not always the big, scary beasts that you should be afraid of... Beasts are easy to predict. They just want to kill and eat ya! Humans are much harder... They pretend to be your friend first... What is Survive, or Thrive? Well, in essence, Survive or Thrive is a survival simulator. It's our way of reading the feedback players have left for us on our previous titles such as The Test, The Horrorscope, and The Confession, taking their words into heavy consideration, and creating new experiences that players want! Everyone imagines being trapped in a zombie apocalypse... Everyone thinks about surviving on a desert island at one point or another... But how many people would actually cut it? How many people would actually survive, how many would die, and how many would thrive? Well, this simulator asks you a series of questions, and through your answers, will let you know what survival situation it believes you'd excel in! Would you survive being kidnapped by a serial killer? What if you were stuck in the caveman days, would your bloodline continue on? Stranded in the ocean? Earth overrun by robots? Would you Survive, or would you Thrive? Features: Short and sweet Be a part of history with Player - Developer interaction The only game with this theme of its kind Very atmospheric and psychological Sit back, relax, and answer in-depth questions to reveal survival scenarios Super affordable for a unique experience A little bit funny. (Just a tiny bit.) Like, a smidgen... ;)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1397030/header.jpg?t=1646499073",
    "Price": 1.99,
    "Developers": "Randumb Studios",
    "Publishers": "Randumb Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1397030/ss_2a3b15ee538e33a8049907098ca5ac69d9e31539.1920x1080.jpg?t=1646499073,https://cdn.akamai.steamstatic.com/steam/apps/1397030/ss_12422be156fa141e0da71f3f76780933f5c45640.1920x1080.jpg?t=1646499073,https://cdn.akamai.steamstatic.com/steam/apps/1397030/ss_b191b4746683867e8f6f1536a9a1060640ac3f59.1920x1080.jpg?t=1646499073,https://cdn.akamai.steamstatic.com/steam/apps/1397030/ss_087bec3380499a508731b3f0ac050a04dde79a07.1920x1080.jpg?t=1646499073,https://cdn.akamai.steamstatic.com/steam/apps/1397030/ss_b6ae732a338cd9c1d72ebd1388840de0f198f331.1920x1080.jpg?t=1646499073,https://cdn.akamai.steamstatic.com/steam/apps/1397030/ss_0a15175abdb27b967d8dcfa64bfdf21cea92bbae.1920x1080.jpg?t=1646499073,https://cdn.akamai.steamstatic.com/steam/apps/1397030/ss_2355a37be59eef8fa5c12fdaf36e09dc826f0880.1920x1080.jpg?t=1646499073",
    "Slug": "survive-or-thrive",
    "Meta Title": "Survive or Thrive: Sep 7, 2020, Randumb Studios and Full ...",
    "Meta Description": "Looking for information on Survive or Thrive? Check out the release date (Sep 7, 2020), developer insights from Randumb Studios, and a complete game sum...",
    "Alt Text Image": "Official header image for Survive or Thrive game - Steam 1397030",
    "Canonical URL": "https://gusku.site/game/survive-or-thrive",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Survive or Thrive\", \"description\": \"Looking for information on Survive or Thrive? Check out the release date (Sep 7, 2020), developer insights from Randumb Studios, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 7, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Randumb Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Randumb Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1397030/header.jpg?t=1646499073\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}