{
    "AppID": 1396150,
    "Name": "Sutekina kanojo no tsukurikata",
    "Release date": "Apr 23, 2021",
    "About the game": "Warning: This game contains sick and bizarre expressions that some players may find offensive and may cause mental overload, so please do not purchase if you are not comfortable with it. ★ About the game★ This title has built-in English, Japanese, Simplified Chinese and Traditional Chinese. It also supports Steam Cloud. This is a brand new title launches on STEAM. Sutekina kanojo no tsukurikata is a story between a yandere antisocial girl and a wellborn young lady, produced by the Japanese Bishōjo game brand Sushi soft. The popular illustrator 緜のまくら is responsible for the original picture and character design, and the well-known voice actor あじ秋刀魚 is the dubbing for the leading lady, also the Emotional Motion Technology is used for the performance. Interaction occurs at several points where choices are given to the player, which may change the storyline and eventually leads to 8 various endings. If you are not careful, it will trigger the female lead’s nervous yandere. ★About the plot★ Sumire Ashiya, a yandere social anxious girl who is addicted to the online world, luring others by posting selfies and wrist cutting picture. One day, when she met the finally got beautiful girl Riichan, she didn’t expect that Riichan was actually a few frivolous men. When she was about to be assaulted, the beautiful female college student Nazuna Koga with an angelic face appeared and rescued her in trouble. She was deeply moved and about to talk to Nazuna, while it turned out she was too excited to throw up breakfast... 'Ah, I am so good for nothing, but loser also has dreams!!' In order to save the bad first impression, Sumire turned to an internet friend 'Teacher' for help, and used various methods to approach Nazuna. 'I must make her the best girlfriend.' Sumire showed a meaningful smile. ★About the character★ Sumire Ashiya （芦屋　菫）20 years old Sophomore. Height: 162 cm Weight: 48 kg Measurements: B75/W55/H77 A live alone college student, sometimes social anxious, sometimes sick and delicate, addicted to internet, and lesbian, who likes posting selfies for luring others on the Internet. In the incident of almost being assaulted when meeting a netizen, she was rescued by Nazuna Koga and thought Nazuna was the one for her. In order to get close to Nazuna, she turned to an internet friend 'teacher' for help. Can't resist the girl like Nazuna, who owns beautiful appearance and is also good at dealing with people. Like a big sister. I wanna be her a very important person. “I’m so into Nazuna, and wanna make her my girlfriend who only belong to me” Nazuna Koga （古賀　なずな）21 years old 　Junior student. Height: 162 cm Weight: 50 kg Measurements: B86/W57/H84 The unrequited lover of Sumire Ashiya, a wellborn lady, pretty, very nice to people around her, especially to the Kawaii junior Sumire. On the other hand, she was often seen sleeping at different houses only with her luggage, it seems that she has an ulterior secret. “She might … not live without me. I’ll try my best to make you happy.” ★About the game characteristics ★ Multiple choices The leading lady is often hesitant, please help her make decisions and create a 'cute' girlfriend together! Be careful with the choices, they may lead you to the very different plot flows. Diversified endings The process of creating a 'cute girlfriend' may not go smoothly. A little carelessness will cause the leading lady go crazy, and the girl also may not be willing to be controlled and resist from time to time. There are 8 different endings. At the end, you can experience a variety of completely different endings. ★ Staff ★ Producer: Saemonsaburo ikura Director: Sho Kannaduki Graphic: wata no makura Scenario: watapi（C-Garden) Music: Angel Note",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1396150/header.jpg?t=1637777906",
    "Price": 9.99,
    "Developers": "Sushi_soft",
    "Publishers": "Sushi_soft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1396150/ss_e0a204b8af7358c2b77076303ae93bee69505234.1920x1080.jpg?t=1637777906,https://cdn.akamai.steamstatic.com/steam/apps/1396150/ss_003879d537fcfbe11e2b88dac945c7e2a1abc929.1920x1080.jpg?t=1637777906,https://cdn.akamai.steamstatic.com/steam/apps/1396150/ss_11a7878d3f4cb0c3f076cdc53c7bc16233f0d793.1920x1080.jpg?t=1637777906,https://cdn.akamai.steamstatic.com/steam/apps/1396150/ss_194ef34d3f47bfa23b36a6e6240b03cc5339a463.1920x1080.jpg?t=1637777906,https://cdn.akamai.steamstatic.com/steam/apps/1396150/ss_4c41d7248c04c8b718257fa5e2cdb6c99450a4f6.1920x1080.jpg?t=1637777906",
    "Slug": "sutekina-kanojo-no-tsukurikata",
    "Meta Title": "Sutekina kanojo no tsukurikata: Apr 23, 2021, Sushi_soft ...",
    "Meta Description": "Looking for information on Sutekina kanojo no tsukurikata? Check out the release date (Apr 23, 2021), developer insights from Sushi_soft, and a complete...",
    "Alt Text Image": "Official header image for Sutekina kanojo no tsukurikata game - Steam 1396150",
    "Canonical URL": "https://gusku.site/game/sutekina-kanojo-no-tsukurikata",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sutekina kanojo no tsukurikata\", \"description\": \"Looking for information on Sutekina kanojo no tsukurikata? Check out the release date (Apr 23, 2021), developer insights from Sushi_soft, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 23, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sushi_soft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sushi_soft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1396150/header.jpg?t=1637777906\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}