{
    "AppID": 1196030,
    "Name": "The Mystic",
    "Release date": "Mar 8, 2022",
    "About the game": "Mystic is fast paced 4x Turn based strategy game with fantasy theme. Play as follower of First Human Gods earn their favours and defeat Everking. Make use of innovative combat and magic systems. Transform land and life of empire citizens.Set in an original universe, Mystic follows prophet of the first human gods in a war for domination of falling empire. with focus on world transforming magic and position based warfare. Chose one of 5 different goods each with number of special units. A story full of difficult decisions, struggles and intrigue takes place in these fields. You have awakened a fivesome of forgotten ancient gods worshipped by the first humans in times long gone. Together with them, you embark on a war campaign against the High King and his declining empire. Your task is to defeat the High King's troops, gain followers from the ranks of the people and persuade the gods to repay you generously. However, it will not be easy, the gods are too much like humans. You will become entangled in the web of politicking and old wrongs you have awakened along with the gods. Each of the deities has its advantages and drawbacks. Which of their goals are the closest to yours? Whose favour will you seek to achieve your own goals? A unique magic and turn-based combat system with no RNG. Carefully position your units, each with their AOE attacks. Make use of carefully-planned battle formations. Use powerful magic to change the terrain to your advantage. Curse and destroy enemy units. Corrupt and spoil the land to put your enemies at a disadvantage. Summon special units for each of the 5 factions. The Mystic offers several unique story lines each with original quests and multiple possible endings. The game will awaken your tactical and strategic skills and test your ingenuity, with which you will embark on the battle for the city, but also on the cultivation or devastation of the game landscape. So you can look forward to hours of high-quality entertainment. Teneb God of knowledge, information and secrets. Gave man the means to record their gathered wisdom and share with others, but also the means to withhold such precious things from your enemies. Gather an army of shadows and powerful orators to take control, and use spells to obfuscate and weaken your enemies. Nergal Goddess of justice, order and balance. Few escape from her powers, even after death. She employs the power of undead warriors to help her in her cause by bringing them back to life to fulfil their duties and debts to her. Lanciences God of inspiration, imagination and invention. His influence helps inspire individuals to go beyond the plains of current understanding and bring new ideas to the fold. But do not be fooled, as his reign has strong loyal slaves and powerful mystical creatures to aid in his ambitions. Darval God of family, strength and unity. His followers are considered to be brothers and sisters, much like a single organism united together into Darvals mystical “body”; devotees working alongside his berserker warriors, blood monsters and aggressive spells. His victory is not far away. Pallanti Goddess of nature, growth and home. As a caring mother to her children, she protects those who seek her blessings. While her deep primordial forests hide strong beasts, she may also bless her followers with mutations that can give an edge over her enemies. The game includes a map and story generation tools. Use the intuitive story tool to create your custom campaigns, create your custom maps or experiment with the random generation of terrain and include it in your story. You have the freedom to make multi-layered epic campaigns on your own, or short-and-sweet single player mission maps for you and your friends.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1196030/header.jpg?t=1646751738",
    "Price": 18.99,
    "Developers": "PipeDream",
    "Publishers": "PipeDream",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_5864e8486f1df4ce6526abb570e2495f9f2e832c.1920x1080.jpg?t=1646751738,https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_57a0a219adaf421a876b89d04c0da2ce14005772.1920x1080.jpg?t=1646751738,https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_e2efaf6189477bc79183c260fd61b8f27380d238.1920x1080.jpg?t=1646751738,https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_5b46ce3685433a649d78b580b8582e7818ccb798.1920x1080.jpg?t=1646751738,https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_86d858ab83ce5e1328cd0a7338fa85d1eabab6c3.1920x1080.jpg?t=1646751738,https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_1c43f436440835174dbf13c625a69fff79d156c7.1920x1080.jpg?t=1646751738,https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_d82c639877d2c7043878c51a6733899b4e1f149f.1920x1080.jpg?t=1646751738,https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_b3e887378d237c0572b9d9f2c2f9a0b5ff82a68a.1920x1080.jpg?t=1646751738,https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_16eed7f8f9a7f9ff9eba08b7160f6f55642587a5.1920x1080.jpg?t=1646751738,https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_aa72aa3dfee67393d78ad4f6947c7638391ca5bb.1920x1080.jpg?t=1646751738,https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_3fbae729fb66064b11427de06da5f5890fa001a8.1920x1080.jpg?t=1646751738,https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_f85a9b2b12afb47b298e01a81b5b32828e4cc8ee.1920x1080.jpg?t=1646751738,https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_48d9b1e29a3a94f777a8cd737652a249844ad956.1920x1080.jpg?t=1646751738,https://cdn.akamai.steamstatic.com/steam/apps/1196030/ss_8a8482e4380f3af909f641c349c78b2fc9f15746.1920x1080.jpg?t=1646751738",
    "Slug": "the-mystic",
    "Meta Title": "The Mystic: Mar 8, 2022, PipeDream and Full Overview",
    "Meta Description": "Looking for information on The Mystic? Check out the release date (Mar 8, 2022), developer insights from PipeDream, and a complete game summary.",
    "Alt Text Image": "Official header image for The Mystic game - Steam 1196030",
    "Canonical URL": "https://gusku.site/game/the-mystic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Mystic\", \"description\": \"Looking for information on The Mystic? Check out the release date (Mar 8, 2022), developer insights from PipeDream, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"PipeDream\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PipeDream\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1196030/header.jpg?t=1646751738\", \"offers\": {\"@type\": \"Offer\", \"price\": 18.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}