{
    "AppID": 1771730,
    "Name": "The City Must Grow",
    "Release date": "Dec 8, 2021",
    "About the game": "What This Game Offers Fun way to kill some time It is a challenging, puzzle-like, minimal city building game It is turn-based, you make your move and proceed to the next cycle It is fast phased, but no time limitation, you can play slowly for relaxing You will probably see the game over screen a lot but it is a part of the game Has some objectives that unlock more advanced utilities and features Information messages and warnings will lead you what to do Your game state is saved each turn It supports steam leaderboard Optimization high priority, you don't need a high spec hardware What This Game Does Not Offer You May Expect No storyline No traffic simulation Almost no animation Description A new city will be established on a flat plain and its administration has been given to you. In order to keep the administration in your hands, the city needs to develop continuously. Your role in this game is to determine where the buildings and structures in the city can be built. Time and moves in the game are turn-based. Each move is given a random zoning type to mark on the map. After you mark zones, you move on to the next cycle and observe the developments in the city. You can unlock more advanced types of buildings and structures by completing in-game objectives. Completing objectives also allows you to use different map view tools that will make management easier. There are five main types of zones you manage; residential, agricultural, commercial, offices, and industrial. You need to constantly try to manage the distance between the zones, the density, and the balance between them correctly. Otherwise, escapes from the city may begin, unused buildings may collapse on their own, and the city may collapse with a chain effect. The main aim of the game is to keep the administration in your hands as long as possible by ensuring the continuous development of the city and to reach a high population. Losing control of the city is part of the game and it's up to you to try again to find the best way to keep the city constantly growing.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1771730/header.jpg?t=1643211730",
    "Price": 4.99,
    "Developers": "Tunaic Games",
    "Publishers": "Tunaic Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1771730/ss_41af3441e0062e29bb0fb01fa0847be078194881.1920x1080.jpg?t=1643211730,https://cdn.akamai.steamstatic.com/steam/apps/1771730/ss_355d0c4309da1a06e03de5dde5a8a62c4b071792.1920x1080.jpg?t=1643211730,https://cdn.akamai.steamstatic.com/steam/apps/1771730/ss_404d4be7bdac26e33f92b3f83433668838011089.1920x1080.jpg?t=1643211730,https://cdn.akamai.steamstatic.com/steam/apps/1771730/ss_94754fbfa1733fdef207f4ce5e44119de25d957a.1920x1080.jpg?t=1643211730,https://cdn.akamai.steamstatic.com/steam/apps/1771730/ss_27eaa03e8effe4aa130d0dcb1802051c6fb3f95e.1920x1080.jpg?t=1643211730",
    "Slug": "the-city-must-grow",
    "Meta Title": "The City Must Grow: Dec 8, 2021, Tunaic Games and Full Ov...",
    "Meta Description": "Looking for information on The City Must Grow? Check out the release date (Dec 8, 2021), developer insights from Tunaic Games, and a complete game summary.",
    "Alt Text Image": "Official header image for The City Must Grow game - Steam 1771730",
    "Canonical URL": "https://gusku.site/game/the-city-must-grow",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The City Must Grow\", \"description\": \"Looking for information on The City Must Grow? Check out the release date (Dec 8, 2021), developer insights from Tunaic Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 8, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tunaic Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tunaic Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1771730/header.jpg?t=1643211730\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}