{
    "AppID": 334230,
    "Name": "Town of Salem",
    "Release date": "Dec 15, 2014",
    "About the game": "Purchase comes with the exclusive SteamBot3000 Character Skin with unique death animation, 2,000 Town Points ($8 Value) and you will earn double Merit Points forever! Town of Salem is a fresh innovation on the classic party games Mafia and Werewolf. It is a game of murder, accusations, deceit and mob hysteria. How To Play The game ranges from 7 to 15 players. These players are randomly divided into alignments - Town, Mafia, Serial Killers, Arsonists and Neutrals. If you are a Town member (the good guys) you must track down the Mafia and other villains before they kill you. The catch? You don't know who is a Town member and who is a villain. If you are an evil role, such as a Serial Killer, you secretly murder town members in the veil of night and try to avoid getting caught. Roles Town of Salem has 33 unique roles ensuring a different experience each time you play. Before a game starts, players are put into a lobby where the host can select what roles will be in the game. Players are then assigned roles at random from the list of chosen roles. Players have an in-game role card that explains their role's abilities and alignments. For an in-depth look at the abilities of each role please visit: www.blankmediagames.com/roles Game Phases Night The night phase is when most roles use their abilities. For example, Serial Killers stealthily murder people, Doctors heal people who are attacked, and Sheriffs interrogate people for suspicious activity. Day The day phase allows the Town members to discuss who they suspect of being an evil role. Once the voting phase starts a majority vote from the town will put someone on trial. Defense The defense phase is when you plead your innocence to the town. Have a convincing story or find yourself facing the gallows! Judgement During this phase the town will vote on the fate of the defendant. Players can vote guilty, innocent or abstain. If there are more guilty votes than innocent votes the defendant is sentenced to death by hanging! Customization Players are able to choose their own map (town setting), character, pet, lobby icon, death animation, house and a custom name. The other players in the game will see your selections. There are currently 10 maps, 29 characters, 20 pets, 5 death animations and 20 houses to choose from. Achievements There are currently over 220 unique achievements in the game. Earning achievements will grant various in-game items (however the items for donation rewards are exclusive to Kickstarter).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/334230/header.jpg?t=1581052242",
    "Price": 4.99,
    "Developers": "BlankMediaGames",
    "Publishers": "BlankMediaGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/334230/ss_778670cccc45b87960696135c5a6b90d27df418b.1920x1080.jpg?t=1581052242,https://cdn.akamai.steamstatic.com/steam/apps/334230/ss_2407cec854de5c815f9d16ab56ecd6365f0c43d9.1920x1080.jpg?t=1581052242,https://cdn.akamai.steamstatic.com/steam/apps/334230/ss_18e88c8fb4dab8d621aabe85b12ed9606a4e230a.1920x1080.jpg?t=1581052242,https://cdn.akamai.steamstatic.com/steam/apps/334230/ss_72f99064a47459e4fa62934f1fbb1b68290fbcbf.1920x1080.jpg?t=1581052242,https://cdn.akamai.steamstatic.com/steam/apps/334230/ss_d312893db2edc1ed482dd55dc1210a4620712dec.1920x1080.jpg?t=1581052242",
    "Slug": "town-of-salem",
    "Meta Title": "Town of Salem: Dec 15, 2014, BlankMediaGames and Full Ove...",
    "Meta Description": "Looking for information on Town of Salem? Check out the release date (Dec 15, 2014), developer insights from BlankMediaGames, and a complete game summary.",
    "Alt Text Image": "Official header image for Town of Salem game - Steam 334230",
    "Canonical URL": "https://gusku.site/game/town-of-salem",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Town of Salem\", \"description\": \"Looking for information on Town of Salem? Check out the release date (Dec 15, 2014), developer insights from BlankMediaGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 15, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"BlankMediaGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BlankMediaGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/334230/header.jpg?t=1581052242\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}