{
    "AppID": 1102580,
    "Name": "Traffix",
    "Release date": "Jul 8, 2019",
    "About the game": "Based on simple rules and minimalist features, Traffix will amaze you in no time! The highway is a place where chaos, stress and rage are always present, mainly in big cities like Paris, Tokyo, Istanbul or Las Vegas. Aware of this, you must control the traffic light to keep the drivers safe and maintain peace. Start fighting chaos all over the world! Features: Simple rules: Click the traffic light on the right time to change its color and manage the highway. It works just as a normal traffic light with green, yellow and red colors. Minimalist: You will find cars, a bus or a van in almost every city. There are cities featuring a truck, a train and even a plane. Your job? Make sure they don’t crash. Calming: Traffix will not force you to think too hard. Each new city will amaze your senses and help you to relax. Tricky levels: The visual features of Traffix are very simple and minimalist, but some cities can turn very tricky! The slightest distraction can cause a big crash. Everybody hates traffic. Even when it is minimalist, like on Traffix. Now there is a way to control chaos and spread some peace to the streets. On Traffix you are the highway manager. Each city will deliver a different dose of stress and chaos. By clicking on the traffic lights on the right time, you can control the flow and avoid raging drivers. It’s very important that you do not make drivers wait or they will get mad. On the other side, do not rush or they will crash! You have to wait for the right time to click on the traffic lights and guide the cars to their destination. The lights are red by default. Wait for the right time to turn the yellow light on and let one car go. When the road is empty, double click to activate the green traffic light! You will quickly understand how Traffix works, thanks to the minimalist and evocative elements. The rules are simple: Red: All the vehicles will stop. The red traffic light will get everybody angry after a while. Yellow: It will allow one car to pass. After that, becomes automatically red. The yellow traffic light is the safest play. Green: Click twice to make the light turn green. This will open the traffic light and allow all the cars to advance. Most of the accidents occur within the green traffic light. Chaos Mode: There is a second game mode available. The Chaos Mode is just for pros and it will amaze you by its simplicity. As you understand by its name, it features extra stress and madness. You need to guide the police cars to their destination safely. One crash and you lose. Do you think you can complete all the cities? This is your time to prove it. Play all over the world! Traffix features the busiest cities in the world. Places where stress is rooted and peace is a distant mirage. As you progress, the highway will get more and more chaotic. On that point, one of two things will happen: or you overcome the challenges or you become one of the raging drivers. See you on the highway!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1102580/header.jpg?t=1562752800",
    "Price": 4.99,
    "Developers": "Infinity Games",
    "Publishers": "Infinity Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1102580/ss_98b7f614562c9790ac6f5de7b41db76d6e5c3084.1920x1080.jpg?t=1562752800,https://cdn.akamai.steamstatic.com/steam/apps/1102580/ss_3a306603e6801e963ae3ec3650635edab71513a1.1920x1080.jpg?t=1562752800,https://cdn.akamai.steamstatic.com/steam/apps/1102580/ss_1ae0368027e33bfdb2ccfb72454d923d033bb640.1920x1080.jpg?t=1562752800,https://cdn.akamai.steamstatic.com/steam/apps/1102580/ss_35546a2e3384e176b77c99d019425879a61c3423.1920x1080.jpg?t=1562752800,https://cdn.akamai.steamstatic.com/steam/apps/1102580/ss_8523f2fdfc6deca6128e2c4599ba0c101d2e10fa.1920x1080.jpg?t=1562752800,https://cdn.akamai.steamstatic.com/steam/apps/1102580/ss_0c42071b44f79ac2224946b59ac1bbd4a2ff3b9e.1920x1080.jpg?t=1562752800,https://cdn.akamai.steamstatic.com/steam/apps/1102580/ss_4b823910131c71b5b6a907818cace16b31e00be7.1920x1080.jpg?t=1562752800,https://cdn.akamai.steamstatic.com/steam/apps/1102580/ss_9642f550b411a41da515ff84b2abba8da6e46ede.1920x1080.jpg?t=1562752800",
    "Slug": "traffix",
    "Meta Title": "Traffix: Jul 8, 2019, Infinity Games and Full Overview",
    "Meta Description": "Looking for information on Traffix? Check out the release date (Jul 8, 2019), developer insights from Infinity Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Traffix game - Steam 1102580",
    "Canonical URL": "https://gusku.site/game/traffix",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Traffix\", \"description\": \"Looking for information on Traffix? Check out the release date (Jul 8, 2019), developer insights from Infinity Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 8, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Infinity Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Infinity Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1102580/header.jpg?t=1562752800\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}