{
    "AppID": 739800,
    "Name": "Verzaken! VR Adventure",
    "Release date": "Nov 6, 2017",
    "About the game": "'You awaken in a strange place, empty of any noticeably intelligent life. Surrounded by zombie robots, aimless and chaotic. The world around you seems to be an endless string of 'islands' floating in a void. Fight your way through the unique procedurally generated levels, collect valuable artifacts and try to find a way to that distant tower in hopes of finding a way out of the chaos.' Verzaken! is the first full game from American indie game development company, interFusion Games (based in Michigan, USA). Verzaken! is now a full-blown room scale VR game with motion controls! The way it was truly meant to be played...! Verzaken! is a 3D action adventure set in a mysterious world. Guide your nameless, amnesiac protagonist through island after island, each unique, each one in a million spread amongst the Void. Face off against an enigmatic enemy, as you seek to discover what drives them, what they did to this world and it's people, and how you fit into the picture.... Lite RPG elements, upgrade your stats as you level up! Procedurally-generated overworld 800+ randomized weapon variations! 10+ unique weapon types! Collect artifacts, unlock secrets! Dozens of enemy variations! Unique storyline with multiple endings! Did we mention ZOMBIE ROBOTS?!? 6 dungeon levels! Secrets, surprises, and nerd-only inside jokes! 2 unique playmodes! Original soundtrack! Remember the dawning of the age of 3D gaming? When 16-bit consoles were starting to age, and the world was itching for 3D and excited for the possibilities that 3D graphics would bring? The graphical style of Verzaken! will bring back that retro-3d optimism, that 32-bit enthusiasm... Now take that retro-32 bit graphical style and imagine what an 8-bit action adventure would be like, forcibly evolved to early 32-bit glory...and you have 'VERZAKEN!' The 1990s came and went, and the 32 and 64 bit consoles with them. If you want to re-experience the early days of 3D, 32-bit retro deliciousness...... Verzaken! is for you. Verzaken! features two play modes. In Classic mode, you play through 30 levels, will encounter 3 boss fights and are given a save option. In this story-driven 'campaign' mode, you will uncover the mystery of who you are, and more importantly where you are, as you stand against legions of Zombie Robots and unlock one of multiple endings. In Arcade mode, you will advance through infinite levels, fighting off 'waves' of enemies that become increasingly more numerous and more difficult with each level. Arcade mode features permadeath and a score system. Both modes feature melee style combat, tons of loot and limited elements of puzzle solving. Verzaken! takes advantage of procedural generation of levels, enemies and weapons, making each playthrough a truly unique experience. How to describe Verzaken!? 'VERZAKEN!' could be described as a 3D rogue-like action adventure with infinite possibilities. It could be described as the lonely journey of a mysterious character, lost and isolated in an endless world seemingly without meaning or logic. It could possibly be described as an attempt to bring 2d classic action-adventures into the 3rd dimension while adding inspiration from roguelites as well as treasure-hunting and collecting elements. It's art style could even be described as a love-letter to the 32 and 64-bit era of gaming. It could be described in those ways, but describing it in any of those ways would be limiting ourselves! Whether you play Classic Mode to get a grip on the enigmatic background of the unseen character and this mysterious, endless world and try to witness all endings... or if you prefer to fight your way through wave after wave of mindless 'zombie robots' to see how far you can make it and how long you can survive, collecting infinitely variable loot along the way.... we hope you'll be equally surprised and entertained by 'VERZAKEN!'.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/739800/header.jpg?t=1532237483",
    "Price": 1.99,
    "Developers": "interFusion Games LLC",
    "Publishers": "interFusion Games LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_34e34d494243ed5c0e0a08b22314030379867a33.1920x1080.jpg?t=1532237483,https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_7f05959233854f9cf8f469cad6022df5c40a5a9e.1920x1080.jpg?t=1532237483,https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_84453143d5a995f8723f77babca3d542f52afab6.1920x1080.jpg?t=1532237483,https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_0079ca27782be625c11aa7534a76908176fb736b.1920x1080.jpg?t=1532237483,https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_ecf188b19683a733da07417fbbabf8ed13b6eac9.1920x1080.jpg?t=1532237483,https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_d15eec168614e970f94c1dee265f638e70dbd304.1920x1080.jpg?t=1532237483,https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_c363df6412722e3b42fb09a6f7028bbbea183030.1920x1080.jpg?t=1532237483,https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_58ed1c6c4677717e46b3dcdfc3e9dbe9578404a7.1920x1080.jpg?t=1532237483,https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_86ed970700b64926cdc94a9529048cb10fce4d4c.1920x1080.jpg?t=1532237483,https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_6a371d70189a0c7540bcbe5bcc4fa975fc4e8fcd.1920x1080.jpg?t=1532237483,https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_47cda340bd436de8bd47125939e8453e49236491.1920x1080.jpg?t=1532237483,https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_8c52142b18d7ce625812c15b2d3775f6d89bce08.1920x1080.jpg?t=1532237483,https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_90946c29d45cc9c1bcb2791c6001bd57d6378f6f.1920x1080.jpg?t=1532237483,https://cdn.akamai.steamstatic.com/steam/apps/739800/ss_9a41043586f683de55ddd83b5a723946c08a37fc.1920x1080.jpg?t=1532237483",
    "Slug": "verzaken-vr-adventure",
    "Meta Title": "Verzaken! VR Adventure: Nov 6, 2017, interFusion Games LL...",
    "Meta Description": "Looking for information on Verzaken! VR Adventure? Check out the release date (Nov 6, 2017), developer insights from interFusion Games LLC, and a comple...",
    "Alt Text Image": "Official header image for Verzaken! VR Adventure game - Steam 739800",
    "Canonical URL": "https://gusku.site/game/verzaken-vr-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Verzaken! VR Adventure\", \"description\": \"Looking for information on Verzaken! VR Adventure? Check out the release date (Nov 6, 2017), developer insights from interFusion Games LLC, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 6, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"interFusion Games LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"interFusion Games LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/739800/header.jpg?t=1532237483\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}