{
    "AppID": 1196880,
    "Name": "World Of Conquerors - Origins",
    "Release date": "Feb 18, 2020",
    "About the game": "100% free, all items bought in-game are purchased with earned game currency only! World of Conquerors - Origins is the second release from Darkness Development, carrying on from the original game, Origins offers more in-depth game-play, enhanced visuals and quality of life Improvements. Construct cities, manage resources, train soldiers and fight for supremacy in a vast world with other player controlled empires. Races World of conquers has three play-able races, each race has it's own unique building style and set of units. * Humans Great mineral collectors, balanced armies, strong cavalry units * Elves Seekers of knowledge, highly defensive cities and superior archery units * Orcs Aggressive raiders, brilliant at constructing massive armies, superior Infantry units City Construction Each race has it's own unique building styles, construct your cities in a style to help your empire reign supreme over all of your enemies. Up to 10 cities can be built per player on each world, unlocking technologies will Improve your cities production rates and defend-ability. Battles Battles are fought in the traditional real-time strategy format with individual unit control, unit micro-management and an in-depth countering system. Players are able to attack AI controlled lands in order to train generals, win rewards and plunder resources, player owned cities can also be plundered if you are able to beat their defense. Alliances Form or join an alliance of empires and assist one another in conquering the game world, alliance members are able to easily communicate with one another and send each other resources. If an alliance member is under attack there are also options for ways in-which to assist your alliance member. Large player controlled, or famous cities may require multiple attacks to conquer, making alliance coordination extremely important. Features Persistent game-play (game still runs while not opened) 36 different playable units, including Infantry, archers and cavalry units Many different enemy units including Dark elves, Outlawed men, Trolls, Giants, Spiders and Dire Wolves just to name a few Over 150 technology that can be studied in any order that your play style can take advantage of Alliance system (communicate and work together with other players from all over the world) Generals that you can apply special abilities to and level up and they gain battle experience Global market for trading resources with other players Mail system to communicate with other players Chat system to communicate with other players on your world, or in your alliance Tactical soldier countering system where each unit type has a weakness that can be exploited In-depth ranking/stats system to compare your progress against other players 20 famous cities (4 state capitals and 16 regional capitals) that can be captured by players, offering powers that can be used over nearby cities Quest system for great rewards including rare items and game coins",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1196880/header.jpg?t=1600120615",
    "Price": 0.0,
    "Developers": "Huntah",
    "Publishers": "Darkness Development",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1196880/ss_1d41d2b652537c62d4eb838bbf24950dfeeb3595.1920x1080.jpg?t=1600120615,https://cdn.akamai.steamstatic.com/steam/apps/1196880/ss_517464c1234497fc54081e628c0faa634e3b2315.1920x1080.jpg?t=1600120615,https://cdn.akamai.steamstatic.com/steam/apps/1196880/ss_26ad22fa2e943f7c13dbc116a392d40a4c37c20f.1920x1080.jpg?t=1600120615,https://cdn.akamai.steamstatic.com/steam/apps/1196880/ss_28f228cae88ac30f08acbc7c80cda136e78013a9.1920x1080.jpg?t=1600120615,https://cdn.akamai.steamstatic.com/steam/apps/1196880/ss_04b9a8462a90d9685db2f5628b85be38bb2f2876.1920x1080.jpg?t=1600120615,https://cdn.akamai.steamstatic.com/steam/apps/1196880/ss_60e23239da8262a131798999794a309cc122c8f9.1920x1080.jpg?t=1600120615",
    "Slug": "world-of-conquerors-origins",
    "Meta Title": "World Of Conquerors - Origins: Feb 18, 2020, Huntah and F...",
    "Meta Description": "Looking for information on World Of Conquerors - Origins? Check out the release date (Feb 18, 2020), developer insights from Huntah, and a complete game...",
    "Alt Text Image": "Official header image for World Of Conquerors - Origins game - Steam 1196880",
    "Canonical URL": "https://gusku.site/game/world-of-conquerors-origins",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"World Of Conquerors - Origins\", \"description\": \"Looking for information on World Of Conquerors - Origins? Check out the release date (Feb 18, 2020), developer insights from Huntah, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Huntah\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Darkness Development\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1196880/header.jpg?t=1600120615\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}