{
    "AppID": 543980,
    "Name": "Zombie Exodus: Safe Haven",
    "Release date": "Oct 28, 2016",
    "About the game": "Zombies rise again at the dawn of Apocalypse! In this companion to the smash-hit Zombie Exodus, can you survive the first few days of the zombie outbreak as the dead rise, society collapses, and the living struggle to survive? Zombie Exodus: Safe Haven is a series of thrilling interactive survival-horror novels by Jim Dattilo, where your choices control the story. It's entirely text-based—without animation or sound effects—and fueled by the vast, unstoppable power of your imagination. Customize a character using a variety of professions, backgrounds, special challenges, and skills to survive in a brutal and chaotic city as the Zeta virus spreads. Will you be an honorable soldier, searching through neighborhoods to aid survivors? Or will you be a ruthless bandit who loots and robs others for needed supplies? How about a paranoid hacker, psychopathic con artist, pragmatic scientist, or idealistic teenager? Dozens of options allow you to play the character of your choice. Set in the Zombie Exodus world, the first part of Safe Haven focuses on the first few days of a viral outbreak which changes the infected into mindless zombies. Explore the changes to society at the start of the pandemic. Board your house, gather supplies, meet over a dozen other characters, and survive encounters with the living dead and even other survivors. Scavenge numerous locations, craft items, and use a variety of skills to survive the many challenges of the apocalypse. Part Two: Out Now! With three brand new chapters and another 310,000 words, 'Zombie Exodus: Safe Haven' is now more than than 900,000 in total! That's more than 72,000 each time you play. Given the number of paths from beginning to end, you can have a unique story every time and still never see all there is in 'Zombie Exodus: Safe Haven!' The Zombie Exodus: Safe Haven series will continue with future stories in new locations in the coming years. Play as male or female, gay, straight, bi, or asexual. Nineteen backgrounds/professions including Soldier, Teenager, Professional Wrestler, Bank Robber, and Doctor. Or create your own custom class. Choose your skill levels in eighteen different apocalyptic skills such as Stealth, Ranged Weapons, Scavenging, and Survival. Level up your skills after each chapter and choose from hobbies to round out your character. Select optional challenges for your survivor. Take care of a dependent child or a pet, or deal with a phobia, compulsion, addiction, or affliction. Meet other survivors each with their own personalities, motivations, desires, and flaws. Even form romantic relationships with those you meet.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/543980/header.jpg?t=1644241035",
    "Price": 4.99,
    "Developers": "Hosted Games",
    "Publishers": "Hosted Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/543980/ss_0ebe47f4532e5347d89168ffe353407b01e100d2.1920x1080.jpg?t=1644241035,https://cdn.akamai.steamstatic.com/steam/apps/543980/ss_9ddb51645ebe43f3268b766c6656751daf14e59a.1920x1080.jpg?t=1644241035,https://cdn.akamai.steamstatic.com/steam/apps/543980/ss_c840cee605974fc36aaddf7d757007701169fcc2.1920x1080.jpg?t=1644241035,https://cdn.akamai.steamstatic.com/steam/apps/543980/ss_6bc649aeebe36a69f71f33f389a630947e72fed8.1920x1080.jpg?t=1644241035,https://cdn.akamai.steamstatic.com/steam/apps/543980/ss_7e854040c1a683202b5abab999547da42544c69c.1920x1080.jpg?t=1644241035",
    "Slug": "zombie-exodus-safe-haven",
    "Meta Title": "Zombie Exodus: Safe Haven: Oct 28, 2016, Hosted Games and...",
    "Meta Description": "Looking for information on Zombie Exodus: Safe Haven? Check out the release date (Oct 28, 2016), developer insights from Hosted Games, and a complete ga...",
    "Alt Text Image": "Official header image for Zombie Exodus: Safe Haven game - Steam 543980",
    "Canonical URL": "https://gusku.site/game/zombie-exodus-safe-haven",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zombie Exodus: Safe Haven\", \"description\": \"Looking for information on Zombie Exodus: Safe Haven? Check out the release date (Oct 28, 2016), developer insights from Hosted Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 28, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hosted Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hosted Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/543980/header.jpg?t=1644241035\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}