{
    "AppID": 1603920,
    "Name": "暴れん坊天狗 & ZOMBIE NATION",
    "Release date": "Oct 27, 2021",
    "About the game": "In it, an evil alien creature uses strange magnetic rays to turn a helpless nation into zombies. These rays have given him control over a certain giant statue and other deadly weapons. Namakubi, head of the samurai, sets off to save the people and reclaim the legendary sword that has fallen into the hands of evil. This set also comes with Zombie Nation, the North American edition of Abarenbo Tengu released in 1991. Select either Abarenbo Tengu or Zombie Nation from the title screen There are two modes to choose from in both Abarenbo Tengu and Zombie Nation. You can choose between PETENGU Mode and EXCITENGU Mode in Abarembo Tengu, and ZOMBIE Mode and SAMURAI Mode in Zombie Nation. ※Default will be set with PETENGU and ZOMBIE Mode PETENGU Mode / ZOMBIE Mode In this mode, you can play with useful functions such as Rewind, Quick Save, Quick Load, and Rapid-Fire. Clearing all rounds unlocks the Special mode. EXCITENGU Mode / SAMURAI Mode This is a mode that allows you to play in the same way as the original. Although you can only use Accessories for useful features, you can challenge for achievements. You can test the results of your practice in PETENGU Mode and ZOMBIE Mode, clear all rounds, and unlock achievements. ※This mode cannot the used in the Special mode You can rewind to the desired point in the gameplay by pressing the rewind button You can save and load at any part of the game. Abarenbo Tengu and Zombie Nation each have 3 save slots. You can set ON/OFF of the Rapid-Fire function in Abarenbo Tengu in the options screen. ※ Zombie Nation included this function in the original game You can show the mode, difficulty（EASY / HARD), scores and also high scores on the screen. In the EXCITENGU and SAMURAI modes, you can check your achievements as well. You can view this from the title screen. You can view original designs such as packaging and posters ※You can view the manual for each game through the menu You can view achievements from the title screen. You can see achievements you can challenge in the EXCITENGU and SAMURAI modes. By using the Accessory function, you can check what you have obtained during gameplay. Special unlocks when you clear all rounds in the PETENGU or ZOMBIE modes and you will be able to select it from the menu for each game. You'll be able to play 'that mode' where you can play with the hidden command.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1603920/header.jpg?t=1635745463",
    "Price": 11.99,
    "Developers": "CITY CONNECTION",
    "Publishers": "CITY CONNECTION",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1603920/ss_d4f6e49b233b3e66ab8d27d0ae95cdeb4ddc327a.1920x1080.jpg?t=1635745463,https://cdn.akamai.steamstatic.com/steam/apps/1603920/ss_5dff4ad60cd4d38def2bb03d89f1c8e232322d44.1920x1080.jpg?t=1635745463,https://cdn.akamai.steamstatic.com/steam/apps/1603920/ss_f6e03e0edfcb7e61ca5dc2c8e2d7cce64e12a047.1920x1080.jpg?t=1635745463,https://cdn.akamai.steamstatic.com/steam/apps/1603920/ss_a177359bbd5b16c1850579fe4c31ecc109912e0d.1920x1080.jpg?t=1635745463,https://cdn.akamai.steamstatic.com/steam/apps/1603920/ss_fbc866cdc703721a05673db88c97e161ffd0b40c.1920x1080.jpg?t=1635745463",
    "Slug": "zombie-nation",
    "Meta Title": "暴れん坊天狗 & ZOMBIE NATION: Oct 27, 2021, CITY CONNECTION and...",
    "Meta Description": "Looking for information on 暴れん坊天狗 & ZOMBIE NATION? Check out the release date (Oct 27, 2021), developer insights from CITY CONNECTION, and a complete ga...",
    "Alt Text Image": "Official header image for 暴れん坊天狗 & ZOMBIE NATION game - Steam 1603920",
    "Canonical URL": "https://gusku.site/game/zombie-nation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u66b4\\u308c\\u3093\\u574a\\u5929\\u72d7 & ZOMBIE NATION\", \"description\": \"Looking for information on \\u66b4\\u308c\\u3093\\u574a\\u5929\\u72d7 & ZOMBIE NATION? Check out the release date (Oct 27, 2021), developer insights from CITY CONNECTION, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"CITY CONNECTION\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CITY CONNECTION\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1603920/header.jpg?t=1635745463\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}