{
    "AppID": 955900,
    "Name": "Amazing Cultivation Simulator",
    "Release date": "Nov 24, 2020",
    "About the game": "In a world of myth and magic, those who aspire to immortality devote their lives to the sacred path of cultivation. They gather around sects, institutions which train their bodies, minds and souls to be worth eternal life. But in return for such great power, you must be willing to guard the balance between good and evil -- no matter the cost. Unfortunately, greed is inherent to human nature, so it also blinds cultivators. Your master didn’t realize until it was too late, and the Taiyi Sect burnt to the ground for his mistake. Your brothers and sisters will never come back, but the Taiyi Sect can still be reborn from its ashes. Its seeds are scattered around Tiancang, waiting for you to find them. This is what your grandmaster would have wanted. You must do it for him ─ and for all those we sworn to protect. Set in the fictional Tiancang era, Amazing Cultivation Simulator brings to you the magic of Asian mythology through a strategy game with strong xianxia nuances, a Chinese literary genre which is deeply influenced by Taoist and Buddhist concepts, as well as folklore and traditional knowledge on medicine and martial arts. Its gameplay is inspired by famous games like Rimworld and Dwarf Fortress, as well as The Legend of Shushan Swordsman and Martial Kingdoms. As a grandmaster, you’ll bring the Taiyi Sect back to its glory days by training new apprentices, gathering knowledge and expand your domain through commerce and political alliances to gain influence over other sects. Also, you must protect people from supernatural dangers such as bad spirits, monsters and enchanted artifacts. KEY FEATURES Design your own Cultivation sect  from scratch until it becomes a huge spiritual center. Manage your school and students  so they are happy and productive for you. Expand your domain s and meet new allies to become more powerful than other sects. Commerce and interact with other NPCs , but be careful – your actions will impact their behavior! Keep the balance  between good and evil. Research and fill your library  with more and more sources of mystic knowledge, martial arts, medicine… Search for the most powerful relics  and artifacts. Hunt evil beasts and demons  that want to destroy the world you want to protect. Live  unique playthroughs every time : maps are randomly generated for each run. Learn about  Chinese myths and legends , as well as spiritual traditions which draw from Taoism and Buddhism. Update Yaoguai Awakening: As Qi energies resurge across the lands, the Yaoguai finally return to the mortal realm. Enlightened beasts start cultivation of their own, craving a longer life, but they still can't escape the Creed of Heaven or the Heavenly Tribulation. Taoist Animism: Even the most base of existences have the chance to attain spirituality as they subsist throughout the mists of time. If fortunate enough, some might even be enlightened by a master and turned into sentient spirits. After acquiring a human body through Body Genesis, they are all set to begin their cultivation. Physical Cultivation: Ancient Yaoguai never bothered to become enlightened or to meditate on the Creed of Heaven. They domineered the realm with their brutal physical strength. They follow their instincts and burn their own vital energy to refine their bodies with nature's essence, until they can even block flying swords and survive the Heavenly Tribulation with mere mortal bodies. Pet Training: Spiritual pets are special creatures with mighty forms and profound potential. They are also manifestations of the rules of nature. Learn to train your sect's pet, and have them serve your needs. More Plotlines: As the ancient Yaoguai return, the realm of cultivators will witness an unprecedented upheaval that shall spare no creature. But is it a blessing or a curse? Updated Tutorial: In the Yaoguai Uprising update, we made a complete, step-by-step tutorial to help new players learn all the controls and game systems so that everyone can experience the fun of cultivation. Encyclopedia: All kinds of items, laws and monsters are recorded here. You can reflect on your journey and also anticipate new adventures. Beast Siege: The Phoenix, Jiao-dragon and Torch Dragon have all awoken. Threatened by the invasion of the three mighty ancient beasts, will your sect be able to survive the trials that await? Roaming Sages: To hunt ancient beasts, one must become a true cultivation champion. Myriad mysterious sages from different sects start roaming the world far and wide. To your sect, this shall be both an opportunity and a brand-new challenge. Elemental Medicines: The planting methods of dozens of powerful elemental herbs have been found. A storeroom full of potent elemental medicines is a dream no longer! Building Rotation: Build your sect as you like. Animal Farming: You can now feed paralyzed animals, using their favorite food as bait to try and tame them. Feng Shui Relic: Regular items may have stats that make them a Feng Shui Relic. Explore the World: Almost the entire world is yours to explore. Cultivators can travel the lands over to find hidden treasures and face secret challenges. Sect War: Except for the Daemonia Temple, all the sects now have their own bases. Countless treasures, ancient formation diagrams, forgotten rare artifacts and magnificent buildings can all be found within. Interactive World: NPC sects now interact with each other, with consequences for their power and influence which constantly shift to create an ever-changing world of cultivators. Formation: A complete Formation consists of one cultivator acting as the Pillar and several others as Auxiliaries. By searching for manuals and meditating on the Creed of Heaven, cultivators can learn to become new types of Pillars and Auxiliaries that connect with each other to create Formations. Sub-Spirits: Cultivators that have achieved the Primordial Spirit state or above can train, study secret moves, take elixirs, meditate on the Creed of Heaven and challenge the Heavenly Tribulation to obtain sub-spirits. Sub-spirits can help cultivators with Primordial Spirits make great progress in their practice. Various Tribulations: Once their attainment and lifespan limits are reached, cultivators can take on the corresponding Heavenly Tribulations to break through and earn themselves new realms of progress. Cultivation Laws: Thousands of laws have been discovered in the realm of cultivators, each law worth studying and learning if only for its uniqueness alone. Learn the best of all the cultivation laws and push yourself to a higher state of existence! Path of Shendao: Collect beliefs from mortals to increase your power. Build a divine realm in the void to become your own god. Channel power from all the heavenly guards to craft your own sacred artifact. Mini Universe: A Bounded Universe created with elemental forces. Most regular items can be contained within it. You needn’t leave all your items on the floor any more. Just store them in the Mini Universe! Expand Your Sect: Send outer disciples out into the mortal world to create an agency for your sect. Help mortals solve their problems, earn their trust and loyalty and obtain local products. Commerce: As sects interact with each other, immortals will begin to trade more often. Obtain specialties exclusive to each sect, and meet mysterious merchants travelling around the world; even Ye Xuan the Gambler has opened an auction house. Each to Their Own: Disciples from all sects now have their own names with secrets, hobbies and stories to tell. Make friends around the world and uncover all kinds of interesting information. Cultivation Over 10 cultivation laws, waiting to be discovered and practiced. Over 40 miracles, presenting you with loads of different cultivation experiences. Over 40 elixirs and 30 talismans, each with their own interesting effects. Everything can be crafted into artifacts. Achieve a higher cultivation state and collect amazing treasures to prolong your lifespan. Increase your cultivation in all aspects to prepare for the Heavenly Tribulation. Battle Master your artifacts and use them to battle against enemies. Each character comes with a realistic physical body, meaning there’s countless possibilities within each and every battle. Use powerful secret laws to their fullest extents to turn the tide of battle. Adventure Send disciples on adventures to encounter fortuitous events, investigate secrets and collect treasures. It's your decision whether to do good or torment others around you. Hundreds of event chains are waiting for you to explore Survival Collect resources like food and wood and survive in strange forests. Build houses and grow crops to expand your sect. Store resources to prepare for challenging and harsh weather. Prepare to face opportunities and challenges brought by mythical beasts such as Lushu, Fei.. Crafting There’s hundreds of different kinds of food, weapons, clothing and accessories. Your finished product will inherit the traits of the original materials used each time you craft. Building Adhere to Feng Shui according to the interactions between the Five Elements, and create your very own Earthly Paradise. The right layout will increase the efficiency and aesthetics of your sect. Socializing Parents, lovers, friends and enemies. Through tactics and strategy, you must handle the relationships of your disciples. Thousands of social events await, providing you with a rich and interesting sect life. Challenges: Obtain achievements in Hardcore mode, and accept the challenge of a life where if you die, that’s it. Mods: Mod development will be implemented steadily. We can’t wait to build a world of cultivation with you all! Crossover: We have plans to collaborate with various other excellent games. Remember to support the developers you love! DLC: We will continue to develop new and exciting content in the days to come: Pet keeping, Yaoguai Uprising and sect wars are all coming soon!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/955900/header.jpg?t=1656299765",
    "Price": 24.99,
    "Developers": "GSQ Games",
    "Publishers": "Gamera Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_eef855e6416b58cb2392e44046109b4d3903075e.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_840ae1b7fcb5f7e12c1f8f083f69df17e343a71a.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_8b688c7a7d8b10e0d207e5673b6d505d0ec09d8e.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_fde8f4d1edbd78e4d2bb7b510d2c2bd585203104.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_b2fea57ddf84272c35c0e4537e426ed927b71724.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_e33a457a12f0f24e997fc283aa08b9df8756e0aa.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_40a8c2f29a7628ea0a111ce51ec0d405a8a2c1b8.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_fed838e98f2c73f0a2986227e8b4bd35be526827.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_6eb6f86c2412473f962f57ef1f1c073196c217a4.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_5f139c252c5e17d1038890e434696971ec2a8571.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_4ed6aff20ef62a38abbdf1388898e6eb995e2e3c.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_147a1cf4cc28b59c95f50d4837548996b0904a8e.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_242ddc6cf1a24fbe0dc949a9600a03d41523ec30.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_62c79b2801b9109d629870ca48285ad89413e10d.1920x1080.jpg?t=1656299765,https://cdn.akamai.steamstatic.com/steam/apps/955900/ss_da22fecf59f670fd728bd1f2c734e0b3057b643f.1920x1080.jpg?t=1656299765",
    "Slug": "amazing-cultivation-simulator",
    "Meta Title": "Amazing Cultivation Simulator: Nov 24, 2020, GSQ Games an...",
    "Meta Description": "Looking for information on Amazing Cultivation Simulator? Check out the release date (Nov 24, 2020), developer insights from GSQ Games, and a complete g...",
    "Alt Text Image": "Official header image for Amazing Cultivation Simulator game - Steam 955900",
    "Canonical URL": "https://gusku.site/game/amazing-cultivation-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Amazing Cultivation Simulator\", \"description\": \"Looking for information on Amazing Cultivation Simulator? Check out the release date (Nov 24, 2020), developer insights from GSQ Games, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"GSQ Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gamera Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/955900/header.jpg?t=1656299765\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}