{
    "AppID": 878810,
    "Name": "Ashes of the Ark",
    "Release date": "Jun 27, 2018",
    "About the game": "Ashes of the Ark Virtual reality meets zombies in space! Ashes of the Ark is a first-person shooter built exclusively for VR that immerses you in an end of humanity scenario on the Ark - one of the last bastions of hope as humanity flees a zombie-apocalypse. When you are awoken from your cryo-station - the realization sets in that you must save the rest of the sleepers. Alone and armed with the weapons and scarce ammo you find, you will need to solve puzzles and fight in order to navigate through the remnants of the Ark Developed from the ground up for HTC Vive and Oculus, Ashes of the Ark inserts you into a universe where you must survive against zombies who have taken over the failing space station. Handle realistic weapons with real-life movements, freely explore the immersive Ark, and solve puzzles all in the realm of VR. Can you stop the Flood before they reach the cryo-sector and finish off humanity? Play your own way: Built form the ground up, Ashes of the Ark allows you to choose the movement controls that are best for you. You can choose between the default walking mode for full immersion or the various teleportation modes for maximum comfort. Real-life weapon handling: Using VR motion controls, you can handle weapons with real-life movements. Anticipate attacks, load weapons, manage ammo and aim down the sights to survive on the Ark. Ashes of the Ark showcases some of the most realistic weapons available in video games today. Full-size campaign: Built from the ground up so that you can play through the whole story in one go or choose unlocked levels at any time from the fully interactive player HUB. Survival Mode: Unlimited zombies - unlimited ammo. How long can you survive? Ashes of the Ark has a main HUB area featuring a shooting range for you to relax, test weapons and choose your missions. Free exploration: Search the remnants of the Ark for fellow awoken sleepers. Free exploration: Search the remnants of the Ark for fellow awoken sleepers. Immersive zombie survival: Scavenge what is left, and manage ammo and consumables in a battle for survival more immersive than ever before in this once-in-a-lifetime VR experience. Unprecedented VR realism: Ashes of the Ark brings unprecedented realism to VR gaming with zombie mutilation, destructible environments, and an overall cinematic and immersive experience. Only in VR: Ashes of the Ark is a VR shooter exclusively built for VR. Step into the Ark and take down zombies in a journey that is guaranteed to feel more real than ever before.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/878810/header.jpg?t=1573069615",
    "Price": 0.0,
    "Developers": "SuperSecret",
    "Publishers": "SuperSecret",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/878810/ss_871b2d84091577b88d0c07557ee787b577608ef3.1920x1080.jpg?t=1573069615,https://cdn.akamai.steamstatic.com/steam/apps/878810/ss_e3c838c360a9e0d390ecf60a3fe2547c61b9f909.1920x1080.jpg?t=1573069615,https://cdn.akamai.steamstatic.com/steam/apps/878810/ss_30457402714cd3afe9b8d718dc2fd6a76a0d8680.1920x1080.jpg?t=1573069615,https://cdn.akamai.steamstatic.com/steam/apps/878810/ss_25a1e6ca746e2c0fcac4d162611db537862b0bbd.1920x1080.jpg?t=1573069615,https://cdn.akamai.steamstatic.com/steam/apps/878810/ss_eb46f18229d8918bff1f64f0f73d21b8d50bad8c.1920x1080.jpg?t=1573069615,https://cdn.akamai.steamstatic.com/steam/apps/878810/ss_78694aa3853bb84e3e9afe2850b678001f5cffc9.1920x1080.jpg?t=1573069615,https://cdn.akamai.steamstatic.com/steam/apps/878810/ss_388bce955770171d17a203acc64e32f1d98b5584.1920x1080.jpg?t=1573069615,https://cdn.akamai.steamstatic.com/steam/apps/878810/ss_e27fedded29859db3d70db6b8dce2e91c17e4848.1920x1080.jpg?t=1573069615,https://cdn.akamai.steamstatic.com/steam/apps/878810/ss_31734bf35074a10db6a72dafb1402ff5f6cb9338.1920x1080.jpg?t=1573069615",
    "Slug": "ashes-of-the-ark",
    "Meta Title": "Ashes of the Ark: Jun 27, 2018, SuperSecret and Full Over...",
    "Meta Description": "Looking for information on Ashes of the Ark? Check out the release date (Jun 27, 2018), developer insights from SuperSecret, and a complete game summary.",
    "Alt Text Image": "Official header image for Ashes of the Ark game - Steam 878810",
    "Canonical URL": "https://gusku.site/game/ashes-of-the-ark",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ashes of the Ark\", \"description\": \"Looking for information on Ashes of the Ark? Check out the release date (Jun 27, 2018), developer insights from SuperSecret, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"SuperSecret\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SuperSecret\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/878810/header.jpg?t=1573069615\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}