{
    "AppID": 524640,
    "Name": "Asura: Vengeance Edition",
    "Release date": "Apr 13, 2017",
    "About the game": "The Rakshasa is back... The Vengeance Edition is a free update for Asura which adds new features and content to the game. The expansion is now available and is accessable to those who own Asura! Vengeance Mode: Introducing an endless mode with a brand new level wherein you resist the invading hordes of the Daeva empire. Eliminate as many waves of enemies as possible and compete on the leaderboard with your friends. Chakra System: A new persistent system wherein defeating the bosses will unlock unique perks which can be equipped during battle. Mahasura Difficulty: A new difficulty mode for the hardcore who are looking for a challenge. In Mahasura Difficulty, any enemy, boss or champion can spawn regardless of the fortress. Oh yes! Your weapon will get destroyed when you get burnt. Shamshan: Save your Asura at Shamshan ( Crypt ) and show off the epic gear and ultimate skills you acquired during your invasion. New Items: New artifacts and drops items have been added to the roster and will drop to boost your stats while in combat. New Rooms: Sacrifice your blood in the goblet of Amrut for rewards or test your luck at the dice game called Passa. New rooms have been introduced to the procedural fortresses (levels) in the game. Several other general improvements and the above features have been introduced with the update. Asura is an indie, top-down, Hack 'n' Slash game set in a fantasy world inspired by the richness of Indian mythology. It features heavy rogue-like elements and a unique procedural skill tree which changes on every play-through. Reincarnated as a demon, use your new-found powers and hatred to invade the 'Pancha Dvora'- the five fortresses of the Daeva empire. Embark on a journey to exact your vengeance against Hasirama - The God-King, Maharaja, and Slayer of Innocents. Asura is inspired by rogue-like genre and is brutally difficult but FAIR… Note: Asura is best experienced with a controller! Procedural Skill tree: Craft your Demon using a Skill tree which changes every time you die. Absorb or Scavenge: Asura can either Absorb enemies for experience points or Scavenge their corpse for loot. Unique Combat system: Engage the enemies with a variety of Melee, Range, and Magic weapons. Melee attacks will deal reduced damage to range enemies, Magic enemies will resist spells, and the Stamina system will always require you to strategies and adapt during battle. Unique Loot: Every item in Asura is unique by itself. Slash your enemies with Claw weapon or batter them with a Mighty Hammer. Shoot your enemies with your bow or ignite them with your Magic weapon. There are tons of loot to be discovered in Asura which synergies with your skills. Brutal Mechanics: When you get burnt, a random equipment will get destroyed from your inventory. When the enemies or traps poison you, you can't heal. When your health is low, it does not regenerate automatically. When you die, you don't get to save your progress. Perma-Death: Inspired by Rogue-like genre, on death you lose all progress. Procedurally Generated Skill Tree Mold your character using the unique, procedurally-generated 'Shastra' tree (with over 80 skills!) for near-infinite replayability. Randomly Generated Levels Rampage through the 'Pancha Dvora' - 5 randomly generated fortresses, each with its particular aesthetics, enemies, and challenges Unlock New Demon Characters Unlock 3 different Demon variants with unique alignments to each of the core Shastras. Maximize the return on your choices to surpass your previous personal best. Unique Weapons &amp; Armour Find epic loot with each play through and adapt your play to make the most of what you’ve scavenged from the corpses of your enemies. Enemies Inspired by Indian myths Battle hordes of enemies, each with their unique characteristics and abilities, inspired from Indian Mythos! Indian Inspired Lore Immerse yourself in a fantasy setting based on Indian mythology and discover a whole new take on the battle between good and evil Perma-Death When you die, you start all over again from the very beginning with a new skill tree. (May contain spoilers) A procedurally generated skill tree which changes on every play through (82 skills) 4 Enemy Races - Daeva, Naga, Vanara, and Hathira. 12 Bosses. 9 Champions. 50 Unique enemies. 41 Armors. 82 Weapons. 5 Randomly generated fortress. 3 Unlockable Demon variants to enhance your customization options. Features a fantastical lore inspired by Indian Mythology. Ogre Head Studio Ogre Head Studio an Indie Game Company founded by Zainuddeen Fahadh based in Hyderabad, India. We make amazing games inpired by Indian Mythos and aspire to bring a change in the Indian Game Industry. Support For any issues or feedback with the game, join our discord HERE! or contact us at support(at)ogrehead(dot)com",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/524640/header.jpg?t=1572373714",
    "Price": 9.99,
    "Developers": "Ogre Head Studio",
    "Publishers": "Ogre Head Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_4c4cb90103233a0ba10df2c70d7059a8ccc1de3f.1920x1080.jpg?t=1572373714,https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_067ce33bc8d9054baea52fe83fb1405ff8ac4aa6.1920x1080.jpg?t=1572373714,https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_4183d8ad15a78b669404e5a03364a7d6ce921a4a.1920x1080.jpg?t=1572373714,https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_23d5ff1ae49654082b3ee378ea761da8274465b8.1920x1080.jpg?t=1572373714,https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_f3a814d44b898eef4528850a655ed235037d9712.1920x1080.jpg?t=1572373714,https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_882241d3a68731410780b3f74785ac9452fc522d.1920x1080.jpg?t=1572373714,https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_895a2c3f2935fd936acf79064fdfa8e8313b26dd.1920x1080.jpg?t=1572373714,https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_ad05186ef2d0f0d966f3bb4a9daa8438bf2cf6f4.1920x1080.jpg?t=1572373714,https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_2b911fd1bc215c86d709de44a8e5f249e096eb4e.1920x1080.jpg?t=1572373714,https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_abd13f14b0bbdc02da8ce9619a9aa40345f3bbef.1920x1080.jpg?t=1572373714,https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_b07740ff016af1305cf45d466f72c19927613379.1920x1080.jpg?t=1572373714,https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_beb3cb61a762d0663fb8af2aee134b17846de0e8.1920x1080.jpg?t=1572373714,https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_65c3a93ceaa8cf51165b5e39ef48844ea16a5aa2.1920x1080.jpg?t=1572373714,https://cdn.akamai.steamstatic.com/steam/apps/524640/ss_71515d0ce4ec1320d71dbd53dd1a5633011d4613.1920x1080.jpg?t=1572373714",
    "Slug": "asura-vengeance-edition",
    "Meta Title": "Asura: Vengeance Edition: Apr 13, 2017, Ogre Head Studio ...",
    "Meta Description": "Looking for information on Asura: Vengeance Edition? Check out the release date (Apr 13, 2017), developer insights from Ogre Head Studio, and a complete...",
    "Alt Text Image": "Official header image for Asura: Vengeance Edition game - Steam 524640",
    "Canonical URL": "https://gusku.site/game/asura-vengeance-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Asura: Vengeance Edition\", \"description\": \"Looking for information on Asura: Vengeance Edition? Check out the release date (Apr 13, 2017), developer insights from Ogre Head Studio, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 13, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ogre Head Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ogre Head Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/524640/header.jpg?t=1572373714\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}