{
    "AppID": 625830,
    "Name": "BattleSky VR",
    "Release date": "Jan 19, 2018",
    "About the game": "Available for Arcades on SpringboardVR Multiplayer VR flying FPS game BattleSky VR is a Multiplayer VR shooter game , bringing Overwatch style gameplay to the VR platform. Each player picks a Hero with vastly different size, powers and gameplay style to engage in fast-paced aerial combats against other players. Play online against other players with classic Team Deathmatch, Team Escort, Free For All, Attack and Defend, and other team based modes of up to 4v4 players! Pick your Heroes wisely, your unique powers will determine gameplay strategies as you team up to defeat the opponents! Viveport Developer Award 2018 BattleSky VR is the winner of the Viveport Developer Award 2018, placing second under the Arcade category. Which Hero do you want to be? Currently, 3 Heroes are available for use: Draco , Jet-9 and Lady V . Will you flap your wings to soar through the sky and shoot fireballs as Draco ? Or, zoom through the sky with the hand thrusters as Jet-9 ? Or 'Blink' Teleport around the sky and summon black Hole with Lady V's Gravity Gun? As we develop the game further during Early Access, we look forward to YOUR feedback and suggestions as we add more Heroes, each with unique flying and battle capabilities. Single Player Mission Mode Each Hero will have a single player mission mode where you'll learn the back story about the Heroes, and get familiar with the controls and the unique Flying Locomotion. Co-op missions We are adding new co-op missions that allow 1-4 players to team up against A.I. Our first Co-op mission is Co-op escort. Players team up to escort an airship to the destination while fighting off A.I. We will be adding more co-op modes as we develop the game. Unique VR Locomotion The game’s unique hyper-speed flying locomotion mechanisms had been tested by over 1300 testers, and has been fine-tuned to allow nausea-free extreme high speed flying (imagine flying at 200 km/h). Less than 5% of our testers and players have experienced motion sickness with our locomotion systems. With 3 heroes currently, and 1 more planned for the game by the time we exit Early Access, players will be sure to find a hero that matches their play style. Depending on the community's response, we will look to add more Heroes based on the community's input. Early Access We want to engage the gaming community during Early Access and continue to add more Heroes, Maps, and Gameplay Modes as we develop the game continuously. We look forward to your feedback and help us shape this unique VR game. Please see the 'Early Access' section for what content will be available at launch of Early Access. Our Ultimate Goal Our goal is to create a Multiplayer VR FPS game that will define a new generation of e-Sport. We hope to co-create with YOU a game that has depth, encourages strategic gameplay, and is just awesome and unlike any other experiences on VR. Please see the 'Early Access' section for what content we plan to complete by the time we exit Early Access. VR This game requires a VR system. The game will initially only support HTC Vive when we start Early Access. The game works with Oculus, we have implemented a swipe-to-turn feature to rotate the view. WMR: playable but may lose hand tracking when certain hand motions go beyond the field of view.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/625830/header.jpg?t=1528212572",
    "Price": 12.99,
    "Developers": "Oh!WHATif Inc.",
    "Publishers": "Oh!WHATif Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/625830/ss_3e663825ed0b63461ec7d8ee471dde0a04db11f3.1920x1080.jpg?t=1528212572,https://cdn.akamai.steamstatic.com/steam/apps/625830/ss_533e6a75721ab44aaed4e7d857bfab1332c7b9bf.1920x1080.jpg?t=1528212572,https://cdn.akamai.steamstatic.com/steam/apps/625830/ss_312fdd8c323da51c68f633f139ec1c13e767379e.1920x1080.jpg?t=1528212572,https://cdn.akamai.steamstatic.com/steam/apps/625830/ss_4c9b45826a39ecdbddbc6e60ebf70f867b75f815.1920x1080.jpg?t=1528212572,https://cdn.akamai.steamstatic.com/steam/apps/625830/ss_bda89c2a8369e7cdabb202362b2d09dd7e22e9f4.1920x1080.jpg?t=1528212572,https://cdn.akamai.steamstatic.com/steam/apps/625830/ss_a2bfc516154e777ec18fed0ec6d857a0d1abb6b3.1920x1080.jpg?t=1528212572,https://cdn.akamai.steamstatic.com/steam/apps/625830/ss_5afec206a7388d5bf24f0d63ed5ce9947669c89e.1920x1080.jpg?t=1528212572,https://cdn.akamai.steamstatic.com/steam/apps/625830/ss_e8d7448464c79737103e8edcf62611a5b37f485d.1920x1080.jpg?t=1528212572,https://cdn.akamai.steamstatic.com/steam/apps/625830/ss_0e3413c4a4352a159cb7c3b893f1e140d25e50ec.1920x1080.jpg?t=1528212572,https://cdn.akamai.steamstatic.com/steam/apps/625830/ss_2892c6c0b5d6c15ed2d34766341f25ba89c4cff4.1920x1080.jpg?t=1528212572,https://cdn.akamai.steamstatic.com/steam/apps/625830/ss_b9846bb2d15cab8a5b9aa1e11a12135117944168.1920x1080.jpg?t=1528212572,https://cdn.akamai.steamstatic.com/steam/apps/625830/ss_2e31f98a92adfcb7e80c64b58c6f3e078ac8b6e3.1920x1080.jpg?t=1528212572",
    "Slug": "battlesky-vr",
    "Meta Title": "BattleSky VR: Jan 19, 2018, Oh!WHATif Inc. and Full Overview",
    "Meta Description": "Looking for information on BattleSky VR? Check out the release date (Jan 19, 2018), developer insights from Oh!WHATif Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for BattleSky VR game - Steam 625830",
    "Canonical URL": "https://gusku.site/game/battlesky-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BattleSky VR\", \"description\": \"Looking for information on BattleSky VR? Check out the release date (Jan 19, 2018), developer insights from Oh!WHATif Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 19, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Oh!WHATif Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Oh!WHATif Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/625830/header.jpg?t=1528212572\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}