{
    "AppID": 1009180,
    "Name": "Block of Rum",
    "Release date": "Feb 5, 2019",
    "About the game": "Block of Rum is a sandbox dedicated to building sailing ships and piracy. Voyage the procedurally generated world on a ship of your own construction, you have to fight with other ships and capture towns - all in order to get more resources and make your ship more cool. Building Create your ship from a variety of blocks with different characteristics. Think over the appearance. Hone the design of the ship. Find your balance between speed, strength and firepower. Experiment as you like, the main thing is that your creation could keep afloat and move at least a little! However, remember that the ship is not only a combat unit, it's also a transport. The blocks located in the inventory do not move in the place with you - they are in the area where you purchased them and will disappear as soon as they are left without your supervision. Only blocks that which is loaded on the ship always remains with you! Unless, of course, will not be destroyed in the next battle. But you can always sell the extra load in one of the cities. World Around the world, on the islands and continents scattered dozens of cities, they all trade with each other, and at the same time constantly feuding. Sometimes some cities manage to capture others and form whole empires. Of course, cities do not tolerate pirates, and no one guarantees that your ship will not be attacked while you are busy, but only in cities you can buy the missing blocks, replenish your crew and, on occasion, find some dubious job. Sea battles Attack other ships and cities to take away all that remains of them when the battle is over. Shoot the cores or grapeshot, without any sight, simply turning the ship with cannons in the direction of the enemy. Use the strengths of your ship to win. But remember that damage affects the characteristics of ships and any accidental hit can drastically change the course of the battle. Boarding But the battle is not only artillery fire. Often you will have to arrange a boarding to finish the battle or get an enemy ship in the best condition. During boarding, you will command the crew of your ship in step by step mode. Hand-to-hand skirmishes and musket volleys are break by calms when you have the opportunity to assess the situation and give the next orders to the crew. Isn't it a bit like card games? That's just the moves are made simultaneously with the enemy, and the 'decks' may be disparate sizes ...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1009180/header.jpg?t=1611258019",
    "Price": 1.99,
    "Developers": "Obi-Wanya",
    "Publishers": "Obi-Wanya",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1009180/ss_0680f62ba62efa61e2d9a2952e4ee1a8a2ba93f2.1920x1080.jpg?t=1611258019,https://cdn.akamai.steamstatic.com/steam/apps/1009180/ss_8244afe5eea7aace2919840fc0d2e655bb8076e8.1920x1080.jpg?t=1611258019,https://cdn.akamai.steamstatic.com/steam/apps/1009180/ss_ea5855103264be91e1129afd58a5211fb518aeda.1920x1080.jpg?t=1611258019,https://cdn.akamai.steamstatic.com/steam/apps/1009180/ss_99663361260d5068496f1a781b1287e4ec1c3a43.1920x1080.jpg?t=1611258019,https://cdn.akamai.steamstatic.com/steam/apps/1009180/ss_d35bdb7dca457c9589827ca57694b6f9693317fc.1920x1080.jpg?t=1611258019,https://cdn.akamai.steamstatic.com/steam/apps/1009180/ss_05f3025fc3b74100172d487071f0ea315a991bde.1920x1080.jpg?t=1611258019,https://cdn.akamai.steamstatic.com/steam/apps/1009180/ss_1fc4b68dec84c7a61a8cc8825e78a795b0c5d54f.1920x1080.jpg?t=1611258019,https://cdn.akamai.steamstatic.com/steam/apps/1009180/ss_e9735889d0ba8fdba18f55db133bea73b037ac36.1920x1080.jpg?t=1611258019,https://cdn.akamai.steamstatic.com/steam/apps/1009180/ss_5cc44393d8693794e7ca0f888b94e7cb09ca15b1.1920x1080.jpg?t=1611258019",
    "Slug": "block-of-rum",
    "Meta Title": "Block of Rum: Feb 5, 2019, Obi-Wanya and Full Overview",
    "Meta Description": "Looking for information on Block of Rum? Check out the release date (Feb 5, 2019), developer insights from Obi-Wanya, and a complete game summary.",
    "Alt Text Image": "Official header image for Block of Rum game - Steam 1009180",
    "Canonical URL": "https://gusku.site/game/block-of-rum",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Block of Rum\", \"description\": \"Looking for information on Block of Rum? Check out the release date (Feb 5, 2019), developer insights from Obi-Wanya, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 5, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Obi-Wanya\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Obi-Wanya\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1009180/header.jpg?t=1611258019\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}