{
    "AppID": 1147850,
    "Name": "Brother Brother",
    "Release date": "Nov 7, 2019",
    "About the game": "Brother Brother You awake in a small world, in the small house that you share with your brother. His bed is cold and empty, and there’s no sign of his whereabouts. Something doesn’t feel right. Explore the land and gear up, finding your brother is going to be no walk in the park. See a playthrough here! ;t=0s Brother Brother is a nostalgic journey through a small land. Venture out and enjoy all the small details about the game. The satisfying sound of slashing through grass, the scared frogs fleeing to the safety of the water, the small birds who fly away because they don't want to meet you. Find the hidden bosses of the Forest and gear up to rescue your brother! What can you expect? Get ready to spend a few hours immersed in this tiny world. You'll explore caves, dungeons, defeat bosses, help people around town, and more. This pint sized action RPG is reminiscent of the classic console days, and weekends spent sitting on the floor in front of the big tube TV. The gameplay is simple, gather your gear and talk to the townsfolk to figure out where your brother is. Use your sword to hack away at enemies, and find upgrades - like the Fire Ring, and the Shield - to prepare yourself for what's to come. 8 Unique Bosses 9 Unique enemies Steam achievements Lots of people and items to collect and interact with Fishing! Classic RPG Soundtrack and sounds Optimized for QWERTY Keyboard or Gamepad Explore a small, vast land - with plenty of hidden places and enemies waiting for you. It will take everything you can muster to overcome your challenges. Explore and Find: Hidden caves Hidden Dire Wolf Bosses The Bosses holding the Key Stones Hidden equipment to help you get your brother back Get ready to defend yourself! Finding your brother will be no easy task, there are enemies around every corner waiting to end you quest! Use your sword to tear enemies apart, and possibly find the a magic Fire Ring to light up enemies from a distance. Defeat: Skeletons Bats Slimes Skeletons &amp; More! Get out there and gear up! Turn over every rock, open every door, and delve into every cave. Finding your brother won't be a simple task, gearing up will be crucial! The castle is locked so you'll need everything you can get to find the Key-Stones and save the day! Find: Hearts Sword upgrades Shield Fire Ring What else is neat? Full Controller Support Nostalgia factor Satisfying sound effects A peaceful soundtrack Proceeds go to feeding my kids",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1147850/header.jpg?t=1573420754",
    "Price": 1.99,
    "Developers": "Patrick VanMackelberg",
    "Publishers": NaN,
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1147850/ss_e21681eee783929a243a0edb82ab65df402dd281.1920x1080.jpg?t=1573420754,https://cdn.akamai.steamstatic.com/steam/apps/1147850/ss_a45cc7aad6726573e1c3fcf005a48921dab9622f.1920x1080.jpg?t=1573420754,https://cdn.akamai.steamstatic.com/steam/apps/1147850/ss_5f018fcf38669dcd890ce1d49a73f2ea88f544f3.1920x1080.jpg?t=1573420754,https://cdn.akamai.steamstatic.com/steam/apps/1147850/ss_d33260dc4ff5588d91eab715af9362aa4a26eb51.1920x1080.jpg?t=1573420754,https://cdn.akamai.steamstatic.com/steam/apps/1147850/ss_a66f66977a4abc66758799c118e4b7e0ac953a91.1920x1080.jpg?t=1573420754,https://cdn.akamai.steamstatic.com/steam/apps/1147850/ss_d4a5ff0f46d3c8c85b71dd13f24b56066761f313.1920x1080.jpg?t=1573420754,https://cdn.akamai.steamstatic.com/steam/apps/1147850/ss_389b96fa294cbfbadf776d242f0ecee88ce829d1.1920x1080.jpg?t=1573420754",
    "Slug": "brother-brother",
    "Meta Title": "Brother Brother: Nov 7, 2019, Patrick VanMackelberg and F...",
    "Meta Description": "Looking for information on Brother Brother? Check out the release date (Nov 7, 2019), developer insights from Patrick VanMackelberg, and a complete game...",
    "Alt Text Image": "Official header image for Brother Brother game - Steam 1147850",
    "Canonical URL": "https://gusku.site/game/brother-brother",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Brother Brother\", \"description\": \"Looking for information on Brother Brother? Check out the release date (Nov 7, 2019), developer insights from Patrick VanMackelberg, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 7, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Patrick VanMackelberg\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": NaN}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1147850/header.jpg?t=1573420754\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}