{
    "AppID": 790700,
    "Name": "BugOut",
    "Release date": "Sep 14, 2018",
    "About the game": "WARNING: THIS GAME IS EARLY ACCESS ALPHA. PLEASE DO NOT PURCHASE IT UNLESS YOU WANT TO ACTIVELY SUPPORT DEVELOPMENT OF THE GAME AND ARE PREPARED TO HANDLE WITH SERIOUS ISSUES AND POSSIBLE INTERRUPTIONS OF GAME FUNCTIONING. Short Description The year is 2019, the news is crawling with fear-mongering stories of things to come, the end is near, climate change, WW3, Asteroids, Civil Unrest, and anything else they can think of, but in the background, you can see the government prepping for something, but what. You decide it's time to go off the grid and prepare for the worst. In this Modern Day Survival Simulator, you will be faced with surviving in the Appalachian mountains while you prepare for an apocalyptic event. Hunt gather, build, explore and trade to get what you need to survive, but keep up with what's going on, it's about to get really bad in the world, will you be prepared, Come and experience BugOut. The fear of something major coming soon has taken its effect on you. You feel like you need to do something to prepare yourself to survive the unknown catastrophe. You sell all of your personal belongings and head off to the mountains to start a new life leaving this old one behind. With only a backpack and a few things to eat you really don't have much to start with, saying goodbye to your home, you head up into the mountains to start a new life. As you start your journey, you realize you are not the only one leaving this nightmare, many are leaving town in hopes to survive the coming events. in the distance you hear the officials through the loudspeaker telling you to stay in your home, but it's too late you are already gone. Can you survive BugOut? Prepare as much as you can, an event can happen at random times.  Increase your skills in hunting, fishing, herbalism, building, and much more. The better your skill level, the easier it will be to survive when a disaster strikes. When a world disaster strikes you will need to use all you have learned to survive the event.  ( Example: If a nuclear war was to happen, you would have to be in a sealed living area, with enough food, water, and other resources you would need to survive the fallout, and then enough to use after the event until you can acquire more, plus you would need gear to test for radiation and explore infected areas) This is only one example, other events may affect you in an opposite way.  After the main event has happened and you come out of your home or bunker, you will be faced with lots of new challenges and a huge open world to explore. Stay in the mountains if you can still sustain, or explore the towns and cities, travel around and gather more resources to survive. Depending on the event you may have to deal with AI players, or different types of animals, you just don't know, that's why it is best to prepare all you can before the event.  Game Features Crafting Hunting Fishing Gathering Building Exploring Surviving AI Quest and Task System More to come",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/790700/header.jpg?t=1638696564",
    "Price": 14.99,
    "Developers": "A2G Studios",
    "Publishers": "A2G Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/790700/ss_63e8e6828b96e93773287b752da1245605da7806.1920x1080.jpg?t=1638696564,https://cdn.akamai.steamstatic.com/steam/apps/790700/ss_bced8c76b50179ba1cded0896d6240bb9a39b925.1920x1080.jpg?t=1638696564,https://cdn.akamai.steamstatic.com/steam/apps/790700/ss_75cabe3c85f9236a1d7449abd9693aec67b769d1.1920x1080.jpg?t=1638696564,https://cdn.akamai.steamstatic.com/steam/apps/790700/ss_b6a92e19c63a1794130da1dac2a48bda2d0ee4c2.1920x1080.jpg?t=1638696564,https://cdn.akamai.steamstatic.com/steam/apps/790700/ss_a28554e5d026b5f9378e7e0f8decb5ad054a7940.1920x1080.jpg?t=1638696564,https://cdn.akamai.steamstatic.com/steam/apps/790700/ss_c98bd1660ce3c1cb232a3a253567894d5ac1d0c3.1920x1080.jpg?t=1638696564,https://cdn.akamai.steamstatic.com/steam/apps/790700/ss_d37617a571bfedba7616ae756d5322ed7ac52dd2.1920x1080.jpg?t=1638696564,https://cdn.akamai.steamstatic.com/steam/apps/790700/ss_b680db6999688d781e27a634b74a902bb246bbce.1920x1080.jpg?t=1638696564,https://cdn.akamai.steamstatic.com/steam/apps/790700/ss_ade093600371e3be90776f37bcdac720ad87a74b.1920x1080.jpg?t=1638696564,https://cdn.akamai.steamstatic.com/steam/apps/790700/ss_2d5e256a1d11d9a11972ea0ce45cb2d4af1a21aa.1920x1080.jpg?t=1638696564,https://cdn.akamai.steamstatic.com/steam/apps/790700/ss_8dbc1128ce1a829a0eca256b369fc6687bbdb61c.1920x1080.jpg?t=1638696564,https://cdn.akamai.steamstatic.com/steam/apps/790700/ss_6b342db6f28ce2e19dda99ddc1f207b311f4eb99.1920x1080.jpg?t=1638696564,https://cdn.akamai.steamstatic.com/steam/apps/790700/ss_b85a4fce114d6e457458106800651f3d465dc321.1920x1080.jpg?t=1638696564",
    "Slug": "bugout",
    "Meta Title": "BugOut: Sep 14, 2018, A2G Studios and Full Overview",
    "Meta Description": "Looking for information on BugOut? Check out the release date (Sep 14, 2018), developer insights from A2G Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for BugOut game - Steam 790700",
    "Canonical URL": "https://gusku.site/game/bugout",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BugOut\", \"description\": \"Looking for information on BugOut? Check out the release date (Sep 14, 2018), developer insights from A2G Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 14, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"A2G Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"A2G Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/790700/header.jpg?t=1638696564\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}