{
    "AppID": 752470,
    "Name": "CINERIS SOMNIA",
    "Release date": "Oct 9, 2018",
    "About the game": "About CINERIS SOMNIA CINERIS SOMNIA is a 3D adventure through a beautifully strange and mesmerizing world. STORY A young girl awakens on the seashore. All that remain are her sister’s yellow bucket and the sand castle they had just made together. Her mother is nowhere to be seen. Blinded by the dazzling sunlight, the young girl takes her first step on a strange, mysterious journey... CHARACTERS The Girl An innocent and curious girl. Wearing her favorite blue sundress, she came to the seashore for a picnic together with her mother and little sister. But upon awakening from her nap, she realizes that she is now all alone. Charlotte A young confined to a sanatorium, her body rife with illness. She is very quiet and has an air of maturity far beyond most children of her age. She waits longingly for promises made long ago with someone very special to be fulfilled. Marie Marie is a cheerful, pure, and active girl. She whimsically runs around the dark depths of the forest, wearing her pajamas and a cape. But there is an important reason she came to this forest. Ophelia Daughter of a prestigious family owning vast lands and an extravagant mansion. She is plagued by intense self-loathing due to her belief that she is ugly and plain. Raised by cold and unloving parents, she spends her days in loneliness and despair, following the orders of her mother and father. The Tall Man A mysterious tall man with black clothes, blue hair, and golden eyes. SYSTEM ●Autosave While you can save your game anytime, an autosave feature is also included. However, it is recommended that you to save your game often. ●Map Once you acquire the map, you can check it anytime. You'll need to work out your location on your own, but you will receive many hints as well, such as what to check and where to go. ●Destination Guidance This can be used to check your current destination or purpose at any given time. However, you are not required to follow this guide at all times. You may even make some new and interesting discoveries by stopping at different places along the way. ●Controls SOUNDTRACK The original soundtrack is available as DLC. However, the radio music 'Luna' was used specially in the game with permission from Maou Damashii, and is not included in the soundtrack. DEVELOPER'S COMMENTS We started developing this game based on a few simple ideas: 'Let's make a 3D game,' and 'Can we portray the stories and world we've imagined as a video game?' And finally, the game is here. We hope you have a wonderful experience traversing this strange world and unraveling the story, as well as taking a deeper look into concepts such as purity, ugliness, joy, and anxiety - some of the complex and constantly moving parts that make up the human psyche.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/752470/header.jpg?t=1573792455",
    "Price": 14.99,
    "Developers": "NAYUTA STUDIO",
    "Publishers": "PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/752470/ss_9af1c82b06082153c77662c926ca63ddb7838d2f.1920x1080.jpg?t=1573792455,https://cdn.akamai.steamstatic.com/steam/apps/752470/ss_5370b96fad29fafd58c446d8b69c335e4bc6b7a4.1920x1080.jpg?t=1573792455,https://cdn.akamai.steamstatic.com/steam/apps/752470/ss_f6b0e7be7ceba4c8708ed8b626392fa51200d18e.1920x1080.jpg?t=1573792455,https://cdn.akamai.steamstatic.com/steam/apps/752470/ss_1c0012dd6547ef199c29d9af19dbfd60f82001d5.1920x1080.jpg?t=1573792455,https://cdn.akamai.steamstatic.com/steam/apps/752470/ss_985fb58f4cfdc53383fc42318d3513a3550e815b.1920x1080.jpg?t=1573792455,https://cdn.akamai.steamstatic.com/steam/apps/752470/ss_c81bb38561fbb35b78ec4dbd9022509ef102482c.1920x1080.jpg?t=1573792455,https://cdn.akamai.steamstatic.com/steam/apps/752470/ss_a0fb0f2afb932d41304532c88e65a214637cfebf.1920x1080.jpg?t=1573792455,https://cdn.akamai.steamstatic.com/steam/apps/752470/ss_435ff89dd7d1cd9f5e3b0333367067481e3b51f4.1920x1080.jpg?t=1573792455,https://cdn.akamai.steamstatic.com/steam/apps/752470/ss_e41ddcf4fd3048973cf20a4d335800af6a29ed2e.1920x1080.jpg?t=1573792455,https://cdn.akamai.steamstatic.com/steam/apps/752470/ss_bb66be5f76fb6ac4654dd70aa96405f8cdd6e3b0.1920x1080.jpg?t=1573792455",
    "Slug": "cineris-somnia",
    "Meta Title": "CINERIS SOMNIA: Oct 9, 2018, NAYUTA STUDIO and Full Overview",
    "Meta Description": "Looking for information on CINERIS SOMNIA? Check out the release date (Oct 9, 2018), developer insights from NAYUTA STUDIO, and a complete game summary.",
    "Alt Text Image": "Official header image for CINERIS SOMNIA game - Steam 752470",
    "Canonical URL": "https://gusku.site/game/cineris-somnia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CINERIS SOMNIA\", \"description\": \"Looking for information on CINERIS SOMNIA? Check out the release date (Oct 9, 2018), developer insights from NAYUTA STUDIO, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"NAYUTA STUDIO\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/752470/header.jpg?t=1573792455\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}