{
    "AppID": 1060180,
    "Name": "Cyber Driver",
    "Release date": "Aug 15, 2019",
    "About the game": "Hello, I am a personal developer who develops the games I want to achieve by continually learning programming knowledge. When I noticed that there were many games of infinite flight type, I suddenly thought: 'Hey! This type of game is very suitable for Cyberpunk!' So this game was born. In 'Cyber Driver' you will play as a taxi driver, flying and picking up guests in an infinite city full of cyber atmosphere. Please expect 'Cyber Driver' to be a small, cyber-style arcade flight game that can switch from the first person perspective. It's fast, easy, tight, and repeatable, with elements of collection and challenges. Your only goal in the game is to constantly break the scores you have created before in the unique cyber atmosphere. I am very grateful for the feedback and bug report. Thank you for taking a moment to read this, I really hope you enjoy this game. The taxi will always drive forward automatically, and the player controls the taxi to shuttle through the full 3D cyber city to pick up and drop off passengers. Collect as much as possible of soda water, holographic billboards and other reward items, while preventing cars from colliding with buildings. Free or timed switching of the first and third person perspectives. Earn higher points and unlock new car paints. Immersive 3D sound. An arcade-style casual game full of cyberpunk atmosphere. Easy to learn and smooth game control experience, you can choose to control with keyboard or gamepad. The rhythm of the game is fast, and the constant challenge of past scores in the cyber world is addictive. Unlock more car paints. Let your high scores pay off in appearance. Endless play mode, only you can stop yourself from playing. Steam achievements, leaderboard support! Steam cloud support, unlocked spacecraft, special effects badges will not be lost. Now available in Chinese, English, Russian, German, French, Portuguese, Spanish, Polish and Korean. Provides free and timed modes to provide a shortcut for technical players seeking high scores.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1060180/header.jpg?t=1580608925",
    "Price": 0.49,
    "Developers": "Meng Games",
    "Publishers": "Meng Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1060180/ss_8b0aa7b117b38f55d9359899377cc0168930fc87.1920x1080.jpg?t=1580608925,https://cdn.akamai.steamstatic.com/steam/apps/1060180/ss_0726cf98370b2b45c3f59d73f7c5d23960481237.1920x1080.jpg?t=1580608925,https://cdn.akamai.steamstatic.com/steam/apps/1060180/ss_af9d9f60da2076e8ee702448296b0c9547102546.1920x1080.jpg?t=1580608925,https://cdn.akamai.steamstatic.com/steam/apps/1060180/ss_e3dd3b95c452b92645788175752290c038898536.1920x1080.jpg?t=1580608925,https://cdn.akamai.steamstatic.com/steam/apps/1060180/ss_759c1aa25be6f67948bb74a605194c8eb49caede.1920x1080.jpg?t=1580608925",
    "Slug": "cyber-driver",
    "Meta Title": "Cyber Driver: Aug 15, 2019, Meng Games and Full Overview",
    "Meta Description": "Looking for information on Cyber Driver? Check out the release date (Aug 15, 2019), developer insights from Meng Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Cyber Driver game - Steam 1060180",
    "Canonical URL": "https://gusku.site/game/cyber-driver",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cyber Driver\", \"description\": \"Looking for information on Cyber Driver? Check out the release date (Aug 15, 2019), developer insights from Meng Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 15, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Meng Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Meng Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1060180/header.jpg?t=1580608925\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}