{
    "AppID": 1752090,
    "Name": "Echoed Memories",
    "Release date": "Nov 5, 2021",
    "About the game": "The second game in the 'Gaia's Melody' series. Echoed Memories deals with heavily emotional themes and topics (including trauma, anxiety, love, trust, despair, fear, and the value of life). It holds a balance of bright and cheerful to fearful and depressing, and follows the protagonists as they come to terms with themselves while uncovering the story. Story~ Echoed Memories is a dark psychological love story, with development, understanding and acceptance at its core. Characters~ Follows a group of 13; while working through the plot, they learn to deal with one another. Each character has their own intertwined segments exploring and overcoming their past traumas, personal failures and shortcomings. Animated Cutscenes~ The game contains many anime-styled cutscenes, used to emphasize smaller details and actions of the scene. These are voice-acted, with subtitles available. Dialogue~ In-game cutscenes utilize face graphics, anime art, and expressive character sprites. Features such as BreakTimes, INS and Tents allow you to connect further with the characters by viewing extra scenes and dialogue. Voice-acted cutscenes are also included at various points. World Building~ The citizens of Gaia pay attention to your progress through the game, and have lots to tell you about everything but the plot! In fact, your party is more likely to take over the conversation! OH NO! The fourth wall! Come back! Areas and Dungeons~ There are plenty of towns, castles, cities, forests, mountains, caves, flying castles, underwater ruins, secret labs, hideouts, and more to explore. Dungeons are designed with many winding passages, switches, towers, puzzles, treasures - and straight forward enough that they aren't just a big pain in the butt to cross. Costumes~ If you like playing dress up with your characters, this feature is for you. Characters wear a variety of costumes throughout the story, and become unlocked for your personal use. These affect your overworld sprites and character art. In all, there are 100 to collect! Dynamic Scenes~ There are many types of scenes in Echoed Memories. While the main game is primarily 2d, there are several pseudo-3d segments, including two 'Mode-7 Theaters'; 30 minute theatrical performances within the game, as well as all world maps, and various important scenes along the way! Art Gallery Collection~ 'Bromides' as we call them, are collectable images within the story. These include Hero Bio Cards that help introduce you to the main characters, and various artworks and photos, ranging from cute, to funny, to sad, to swimsuits. There are 42 in total , as well as 4 extra 'photographs' to collect. Battle~ Characters and Enemies move around the battle field to attack. The camera follows them, adding more dynamic action to a turn-based battle system. In addition to some... very quirky skill descriptions, there are many nifty items and equipment to take your party from 'just ok' to 'godmode' if you're clever. As the story unfolds, various characters will unlock MultiTechs , which allow two or more characters to use a special skill together. There are difficulty settings ready to use; a 'Boost Mode' which boosts stats and EXP gain, normal, and a Hard Mode. Customization~ There are an abundance of options to customize your playthrough, from difficulty, quick-button binding, different window themes, to randomizing your loading screen image, and unlocking randomized costumes, the mode7 camera, and the Epilogue Summer Maps. You can even turn off anime-cutscenes, facegraphics, and voices completely! There are settings available for Performance , and a FAQ linked within the game to go over them. Fluff~ Entangled within the game's emotional, painful, romantic, distressing and heartwarming plot, there is also fluff. Lots of fluff. Inside of the game's dark story lives a world of comedic characters that like to joke, reference memes, and PDA. Lots of that. The game keeps a balance of lighthearted character fluff and its darker tones. The game has a series of 'Epilogue Quests', which get unlocked when completing the game proper. Please note, this segment contains a negligible amount of nudity, and discusses suggestive/sensitive themes. Echoed Memories is a direct sequel to Gaia's Melody: Echoed Melodies. While playing it isn't required, EM2 allows you to input EM1's save data, so you can customize your story further.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1752090/header.jpg?t=1644813681",
    "Price": 7.99,
    "Developers": "Echo607",
    "Publishers": "Echo607",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_0fc3829ea52981c231106899c17e4f602e42c0ec.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_fbe69690c7182688db107922c05f548bea19d519.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_f7c830ec7e9520c1b924eaf8521025280779b982.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_3845ad95a603ed5754efe4917f8f73a13e6570aa.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_74d49729b6303f3681baa7b5a84d60293dc0e7aa.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_1da78056e6e0eb21a3ebfd81766ea1d508dd066d.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_8edf256b3a44d1b0b3a47c166a68b27424bbd7fd.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_f67f12c137d8b6367e367136799ca03e0719ccf3.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_dc4bd1db2c5d7c3714a2d98ab870fb268dd38a6c.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_8257a29f2a959fdb6a4ac38e1fb3ca423eb844ee.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_fd18786898a63edf3a44c808a910fa7f2f00cb0e.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_ad510ab8cc14b298e2eec84a58b49205b4975525.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_e79b48916d35945589f84b89745cb0a596dbea67.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_89cf49e26ad842889d40df6ace73149b191864f2.1920x1080.jpg?t=1644813681,https://cdn.akamai.steamstatic.com/steam/apps/1752090/ss_17d18c7a6a5c401fcb1c1c4530235e063906a7d0.1920x1080.jpg?t=1644813681",
    "Slug": "echoed-memories",
    "Meta Title": "Echoed Memories: Nov 5, 2021, Echo607 and Full Overview",
    "Meta Description": "Looking for information on Echoed Memories? Check out the release date (Nov 5, 2021), developer insights from Echo607, and a complete game summary.",
    "Alt Text Image": "Official header image for Echoed Memories game - Steam 1752090",
    "Canonical URL": "https://gusku.site/game/echoed-memories",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Echoed Memories\", \"description\": \"Looking for information on Echoed Memories? Check out the release date (Nov 5, 2021), developer insights from Echo607, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Echo607\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Echo607\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1752090/header.jpg?t=1644813681\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}