{
    "AppID": 1779550,
    "Name": "Galactic Federation",
    "Release date": "Oct 22, 2021",
    "About the game": "This is a remaster of a 2004 game. Both then and now the game engine is made entirely from scratch by only one man. This remaster have completely reinvented and overhauled destruction physics making it fully stable and scalable for future games that will have great level of detail. Veterans of the space sim genre will get familiar straight away as the feel and controls in Galactic Federation resemble classics such as XWing and Freespace. Unlike in similar games, destruction in Galactic Federation introduces new depth of game-play and immersion. Ship is not destroyed by hit-points like in other games. Your aiming skill means everything here. Exactly where you hit enemy ship, it will burn a hole in it's hull, which may result for ship pieces to be realistically torn away or ship sub-systems engulfed in the melted volume. If you destroy target's cockpit it is dead in the water. If you destroy it's shield it will run for life. If you blow up it's power generator it will spend remaining energy and then rotate helplessly. If you hit it's engine it will maneuver slower. Same can happen to you, so don't let enemy deplete your shield. You can move in 6 degrees of freedom, and you will experience high thrust newtonian physics, adjusted for intense combat dynamic. Your power management skill will play a big role when you get targeted by enemy. You are able to set energy recharge priority or to redistribute energy between blasters, shield and engines. Missiles get lock and then can be fired on target but if inertial vector difference is too large, missile will miss. You will get better with experience. You can strafe and you can also enable free vector mode where your ship will keep going on sides or backward. There is plenty of controls, most of the keys on keyboard have function, and everything is reconfigurable. Game controllers are not supported at this time. For best aiming joystick is recommended but not required, as keyboard arrows will do just fine. HOTAS is supported but I would like some testing feedback by the audience. This game does not have aiming assist. Mouse flight is not supported. Keep in mind that unique flight mechanic here require good aiming skill. If you liked XWing or Freespace, then you will like this too. New players may play on lower difficulty which will make them more resistant to enemy fire. Early Access Features: - 15 dogfight only missions (exact as shown in the trailer), each last about 10 minutes and each having over 100 fighters fighting at once. - Choose one of 10 fighter craft models to pilot. Features in development: Full game will have campaigns totaling over 80 missions of different styles and you will be able to attack capital ships and burn through their hulls exposing their decks and machinery. Some missions will have 300 ships fighting at once. There will be 20 flyable fighter or bomber models to choose from, each having different strength and maneuverability. Full game will have modding tools such as mission editor, ship editor and weapon editor. For modding you will be able to import your own solid meshes of ships and see how they get burned through by blasters. In full game the story will be rich and interesting, and you will have in game encyclopedia that even include secrets of holographic physics, because theoretical physics is my passion and I developed my own theory from scratch. Also my next project is underway and in 2022 there will be early release of my second simulation game with same destruction engine that will feature Mech combat on a terrain.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1779550/header.jpg?t=1634887505",
    "Price": 17.99,
    "Developers": "Radivoj Radivojevic",
    "Publishers": "Radivoj Radivojevic",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1779550/ss_4c047778b00f1d99b6009ccf71dd2ccc79796803.1920x1080.jpg?t=1634887505,https://cdn.akamai.steamstatic.com/steam/apps/1779550/ss_1178a8dc8646057ad93d7e3812c9c61a6a244c34.1920x1080.jpg?t=1634887505,https://cdn.akamai.steamstatic.com/steam/apps/1779550/ss_1b87bae4e78354198e9ae030b8c3412a722c7242.1920x1080.jpg?t=1634887505,https://cdn.akamai.steamstatic.com/steam/apps/1779550/ss_f73b44592cadbefeeaab4d4691dde8e418da5421.1920x1080.jpg?t=1634887505,https://cdn.akamai.steamstatic.com/steam/apps/1779550/ss_b93f069e0c7c84451aeb822c40c47ed99b74248e.1920x1080.jpg?t=1634887505,https://cdn.akamai.steamstatic.com/steam/apps/1779550/ss_d4aa4e013e65801a951c1d4bf405b385b8326cef.1920x1080.jpg?t=1634887505,https://cdn.akamai.steamstatic.com/steam/apps/1779550/ss_702dc12fd50fc53d7824867e66af35a4a8873cdd.1920x1080.jpg?t=1634887505,https://cdn.akamai.steamstatic.com/steam/apps/1779550/ss_421ab6f23cc92e8e0250e0ea00ae8834fabc116e.1920x1080.jpg?t=1634887505,https://cdn.akamai.steamstatic.com/steam/apps/1779550/ss_9578bc7b7ed31aef66877982b0f485bb74a7ba1c.1920x1080.jpg?t=1634887505,https://cdn.akamai.steamstatic.com/steam/apps/1779550/ss_cd78204bceaf738d2f4fa3f35af58296fb50b8e4.1920x1080.jpg?t=1634887505,https://cdn.akamai.steamstatic.com/steam/apps/1779550/ss_c97d949d65a0eae67cfb36cf2305cf6cf4988460.1920x1080.jpg?t=1634887505,https://cdn.akamai.steamstatic.com/steam/apps/1779550/ss_cbc8b794780faf304794318d89980797a31f6370.1920x1080.jpg?t=1634887505",
    "Slug": "galactic-federation",
    "Meta Title": "Galactic Federation: Oct 22, 2021, Radivoj Radivojevic an...",
    "Meta Description": "Looking for information on Galactic Federation? Check out the release date (Oct 22, 2021), developer insights from Radivoj Radivojevic, and a complete g...",
    "Alt Text Image": "Official header image for Galactic Federation game - Steam 1779550",
    "Canonical URL": "https://gusku.site/game/galactic-federation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Galactic Federation\", \"description\": \"Looking for information on Galactic Federation? Check out the release date (Oct 22, 2021), developer insights from Radivoj Radivojevic, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Radivoj Radivojevic\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Radivoj Radivojevic\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1779550/header.jpg?t=1634887505\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}