{
    "AppID": 1982990,
    "Name": "纷争之世",
    "Release date": "Jun 25, 2022",
    "About the game": "If you encounter a bug, please add QQ group: 478706364 battle Eliminate the corresponding chess pieces to gain mana or combo points, and then release the skills to attack your enemies! The enemy's next action will be informed in advance. Once the action cools down to zero, it will start immediately. Pay special attention to the enemy's spells. Adjust the position of the follower. The durable follower is placed in the front to absorb damage, and the fragile output and auxiliary follower are placed in the rear for protection. adventure Fight on the big map of the hexagonal grid. Plan your route freely. Straight line may not be the best choice. Circling the long way can further strengthen your army. Unique events and buildings can bring special enhancement to you and your army. Don't ignore them when planning routes. Of course, money should be prepared in advance. Capture cities to plunder more resources. Of course, you can also visit other forces peacefully. Every choice has consequences. occupation Choose your profession. There are many job transfers in different professions. Each transfer will bring unique active and passive skills. Transfer requires special ritual conditions. Buy your transfer contract carefully. Some rituals may be difficult to complete, but after completion, you can gain more power! Different classes have more choices in the face of adventure events. Even if you are not in battle, your class can contribute to your victory. equipment Acquire equipment to strengthen you and your army during the campaign. Powerful equipment can change your game mode, and appropriate equipment can make your battle easier. Think about your fighting style. Some equipment effects may not be suitable for you, but the combat effectiveness will be reduced after equipment. Only the equipment equipped on the body can be effective. You can exchange the appropriate equipment before fighting to deal with different battles. cards Different attendants have different effects, and the linkage between some attendants' effects has unexpected power. Elite soldiers may enable you to form linkage faster, but many people have greater fault tolerance. It all depends on your choice. Each army can strengthen specific attributes according to your needs, strengthen the attack of soldiers and the magic of mages, or directly raise the rank of followers to comprehensively improve their attributes",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1982990/header.jpg?t=1656670972",
    "Price": 10.99,
    "Developers": "琅顾工作室",
    "Publishers": "琅顾工作室",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1982990/ss_8316ee359bacd3dc199f95e177daf092c5fc6016.1920x1080.jpg?t=1656670972,https://cdn.akamai.steamstatic.com/steam/apps/1982990/ss_2b529b060b9719a870f0f46ca800ee66a22e5fd6.1920x1080.jpg?t=1656670972,https://cdn.akamai.steamstatic.com/steam/apps/1982990/ss_7ed8bc27f4a407f0cafb72e5f12a2837fdf5db9c.1920x1080.jpg?t=1656670972,https://cdn.akamai.steamstatic.com/steam/apps/1982990/ss_996b800fae7693f19fbd1791fd27f59a866b4ef4.1920x1080.jpg?t=1656670972,https://cdn.akamai.steamstatic.com/steam/apps/1982990/ss_c7d7c0c4c88d62208cc6402a56e6fdfe75a57f3e.1920x1080.jpg?t=1656670972",
    "Slug": "",
    "Meta Title": "纷争之世: Jun 25, 2022, 琅顾工作室 and Full Overview",
    "Meta Description": "Looking for information on 纷争之世? Check out the release date (Jun 25, 2022), developer insights from 琅顾工作室, and a complete game summary.",
    "Alt Text Image": "Official header image for 纷争之世 game - Steam 1982990",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u7eb7\\u4e89\\u4e4b\\u4e16\", \"description\": \"Looking for information on \\u7eb7\\u4e89\\u4e4b\\u4e16? Check out the release date (Jun 25, 2022), developer insights from \\u7405\\u987e\\u5de5\\u4f5c\\u5ba4, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u7405\\u987e\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u7405\\u987e\\u5de5\\u4f5c\\u5ba4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1982990/header.jpg?t=1656670972\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}