{
    "AppID": 1229310,
    "Name": "Godking: Master of Rituals",
    "Release date": "Sep 16, 2020",
    "About the game": "Godking: Master of Rituals is a fantasy strategy game inspired by 25 years of classics, while bringing a host of new features and innovations to the table. Pick your faction and your god-like incarnation, build your empire and crush all enemies. Play as the Blackbog Goblins - who rely on cheap slaves and dark magic, the Scaleborne - lizardmen clans who can swim across the seas, Mercia - the once great human kingdom who can field huge armies of armored knights, United Tribes - the human barbarian brotherhood of freefolk, the Returned - skeletal armies of undead warriors and necromantic mages, Khaoset - the chaos entity able to reproduce itself into a whole faction of mind linked mutated chaos creatures, Alfendor - the first elven kingdom reforged, or play as Imperatus - a faction of scavenging ratlings that specialize in plaguecraft and necromancy. Pick one faction to lead. The rest you will have to destroy... Key Features A new 4X experience, with a rich fantasy universe to explore and powerful enemies to destroy Eight unique playable factions, all with their own set of units, spells and even mechanics and how to play them Ten unique god-like incarnations - the representation of you the player in the world, each with their own set of passive abilities, combat stats, spells and strategies. They combine and mix with all factions, for added replayability and experience differentiation Visually beautiful automatic combat - with knights, arrows, flying spells and terrifying monsters - you plan your army compositions to effectively beat the next enemy, then you lean back and watch as your brilliant plans unfold Rogue-like elements, with randomly generated maps, randomly placed holdings, randomized holding defenses, randomly placed magical artifacts and randomly placed world treasure chests and wandering monsters - this gives the game enormous replayability. Always a new experience and sometimes with almost hilarious results Will you take form as the Blazing Invoker, a master of fire? Or the ghostly Banshee Queen that can only be damaged with magic? The Bonerat Emperor, a skeletal ratling back from the dead. The elven Lightmaid on her sacred Jaden mount? Will you be the Older Earthmother, who protects and heals? Will you play the High Shaman, a barbarian incarnation able to summon wolves and shapeshift into wereform? Maybe you pick the Wraith Lord, an ancient undead mage? Or are you at heart the Harbinger of Chaos, a creature able to summon mutated forms from the plane of chaos? Or play as the Godwyrm, a fire dragon so powerful it can win almost without help from its faction. A new world awaits you - so awaken as Godking. Claim your throne.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1229310/header.jpg?t=1601319805",
    "Price": 29.99,
    "Developers": "Sensiga",
    "Publishers": "Sensiga",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1229310/ss_700de056b1cd31f51274c532d775dc3f4d47da61.1920x1080.jpg?t=1601319805,https://cdn.akamai.steamstatic.com/steam/apps/1229310/ss_701e7fbb0856affd693bbe9dd8391eeec756b031.1920x1080.jpg?t=1601319805,https://cdn.akamai.steamstatic.com/steam/apps/1229310/ss_00bf35b0ffbc643493810d4c3e5bfda032ef3160.1920x1080.jpg?t=1601319805,https://cdn.akamai.steamstatic.com/steam/apps/1229310/ss_2634fa47a64e24016563a118604834c6649bb3a6.1920x1080.jpg?t=1601319805,https://cdn.akamai.steamstatic.com/steam/apps/1229310/ss_29657c0d918b2e1cf1154e8113c261582129b857.1920x1080.jpg?t=1601319805,https://cdn.akamai.steamstatic.com/steam/apps/1229310/ss_7461964936735c6763c4611d9a2a18ce919620ca.1920x1080.jpg?t=1601319805,https://cdn.akamai.steamstatic.com/steam/apps/1229310/ss_507c841f7ead7754cdbe8b55304006c91e8af585.1920x1080.jpg?t=1601319805,https://cdn.akamai.steamstatic.com/steam/apps/1229310/ss_f95db3e3b0762cbfeae1b1ff9ccf13409791f6ba.1920x1080.jpg?t=1601319805,https://cdn.akamai.steamstatic.com/steam/apps/1229310/ss_94a8f530cb107eb103607d07b32e790fd48ae0bb.1920x1080.jpg?t=1601319805,https://cdn.akamai.steamstatic.com/steam/apps/1229310/ss_2fa6e45a1338c2b9635b1af65f23afacbd845aa6.1920x1080.jpg?t=1601319805",
    "Slug": "godking-master-of-rituals",
    "Meta Title": "Godking: Master of Rituals: Sep 16, 2020, Sensiga and Ful...",
    "Meta Description": "Looking for information on Godking: Master of Rituals? Check out the release date (Sep 16, 2020), developer insights from Sensiga, and a complete game s...",
    "Alt Text Image": "Official header image for Godking: Master of Rituals game - Steam 1229310",
    "Canonical URL": "https://gusku.site/game/godking-master-of-rituals",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Godking: Master of Rituals\", \"description\": \"Looking for information on Godking: Master of Rituals? Check out the release date (Sep 16, 2020), developer insights from Sensiga, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 16, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sensiga\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sensiga\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1229310/header.jpg?t=1601319805\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}