{
    "AppID": 1384320,
    "Name": "Grapple Tournament",
    "Release date": "Nov 5, 2020",
    "About the game": "VIRTUAL REALITY ARCADE SHOOTER Built from the ground up for virtual reality, Grapple Tournament is a thrilling VR arcade shooter where you can enjoy movement freedom using your 3D maneuver abilities and your grappling hook while fighting with a wide variety of multifunctional weapons (even dual wielding) in various multiplayer game modes and co-op challenges through an alluring stylized world. Grapple. Shoot. Score. Master the vertical combat. 3D MOVEMENT FREEDOM Run, jump and double jump to get yourself into position, wall jump to evade incoming harm, pull yourself up with the grappling hook to get the high ground or grapple-swing around corners to surprise your enemies. Learn how to chain these abilities with your 3D maneuvering gear to perform untraceable movement combos and outsmart your enemies like never before in a VR game! Maps are specifically designed with vertically in mind to get the most out of it. MULTIFUNCTIONAL WEAPONS More than 12 weapons eagerly await to get into battle under your command. From the common mechanical guns through the plasma pistols to the energy rifles, single-fire or automatic, instant shot or projectile based, you can have everything. Target-following laser? Shotguns and grenade launchers? You got them. Rockets? Let them rain! Your VR dream is to become a turret with massive firepower? Go with dual miniguns! Double handed weapons have both primary and secondary fire modes letting you choose the perfect reaction for any situation. By the way you always have your melee weapon - the energy blade - on your side. You know, for slicing cake. Play the game any way you like, use the grappling hook with a weapon or dual wield any weapon combination. Mobility versus firepower. Your call. Did we mention that you can also summon an energy bow and shoot an arrow any time? MULTIPLAYER Multiplayer is the heart of the Tournament. Starting individually or with your friends, matchmaking will find you worthy opponents and let you fight in various game modes on engaging, stylized maps which were created with verticality in mind. The currently available game modes are: Deathmatch: Everyone against everyone, up to 6 players. It can be messy and chaotic but you just can’t stop until you win. Can you be the very best on your own? Team Deathmatch: Fast-paced, frantic 3v3 combat. Get your weapons and defeat the enemy team with pure skill or finesse. Teamwork is essential here: shield your allies, assist in attacks and if all is critical, heal your teammates. Capture Point: Strategic point capture mode to spice up 3v3 team battles. Stay in the point areas to capture them and utilize all your arsenal to keep them at all cost. The team with the most points wins. Mutant: Eliminate the mutant to become the Mutant. When being the mutant you are stronger but everyone is hunting you. During multiplayer you will visit a plethora of carefully crafted arenas, both outdoors and closed space maps for your all-terrain grapple experience. From sci-fi factories through cave excavations to japanese temples or greek monuments and more. You'll certainly find some maps to your liking. Bots: Feel free to play with bots to master your skills or have some light-hearted fun. PRACTICE RANGE Yeah, we have this too for 3D training purposes. With drones... with hats. You can try all the weapons in sandbox mode here. CUSTOMIZATIONS Customize your character to your liking with crazy hats and accessories.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1384320/header.jpg?t=1635868585",
    "Price": 14.99,
    "Developers": "Tomorrow Games",
    "Publishers": "Tomorrow Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1384320/ss_7239cedad6256a6bc705345a61847e720c0c3886.1920x1080.jpg?t=1635868585,https://cdn.akamai.steamstatic.com/steam/apps/1384320/ss_1f12e7083c798824740d5cdd2168248629bd5caa.1920x1080.jpg?t=1635868585,https://cdn.akamai.steamstatic.com/steam/apps/1384320/ss_d74a35ba550e2d01710ef48a5433287e52c31649.1920x1080.jpg?t=1635868585,https://cdn.akamai.steamstatic.com/steam/apps/1384320/ss_0a73dc7673ee51dd8bf0f9718f67879955691609.1920x1080.jpg?t=1635868585,https://cdn.akamai.steamstatic.com/steam/apps/1384320/ss_084730636d3e5e6bbc66c90f5b7aff018d5cb81a.1920x1080.jpg?t=1635868585",
    "Slug": "grapple-tournament",
    "Meta Title": "Grapple Tournament: Nov 5, 2020, Tomorrow Games and Full ...",
    "Meta Description": "Looking for information on Grapple Tournament? Check out the release date (Nov 5, 2020), developer insights from Tomorrow Games, and a complete game sum...",
    "Alt Text Image": "Official header image for Grapple Tournament game - Steam 1384320",
    "Canonical URL": "https://gusku.site/game/grapple-tournament",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Grapple Tournament\", \"description\": \"Looking for information on Grapple Tournament? Check out the release date (Nov 5, 2020), developer insights from Tomorrow Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tomorrow Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tomorrow Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1384320/header.jpg?t=1635868585\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}