{
    "AppID": 598550,
    "Name": "HUNTDOWN",
    "Release date": "May 12, 2021",
    "About the game": "In the mayhem-filled streets of the future where criminal gangs rule and cops fear to tread, only the bounty hunters can free the city from the corrupt fist of felony. Lay waste to the criminal underworld and make a killing in this hard boiled action comedy arcade shooter. KICK-ASS CO-OP, FROM NEAR AND FAR Hunt solo or give suppressive fire and advance on the enemy together as you run, jump, and take cover in the mayhem-filled streets of the future. Whether your buddy is in the same room or on the other side of the planet, wreak havoc as a team through couch co-op or Steam Remote Play. NEW ACTION-PACKED ARCADE MODE It’s you versus the world as you’re pitted against players from all corners of the globe in a brutal battle to pummel your way up the leaderboards. Innovate and invent new ways to pulverize your foes to rack up your score, whether you make use of combo-kills, quickdraw weapon-swap bonuses, or just hurl criminals off the rooftops. In this nail-biting race against the clock, collect as many bounties as you can while you watch the numbers roll and strive to be the apex bounty hunter. PLAY AS THREE LEGENDARY BOUNTY HUNTERS Anna Conda: Ex-commando, firearms expert, and full-time loose-cannon, Anna will assassinate without question or mercy, as long as you don’t mind the collateral damage. John Sawyer: Once a Special Forces cop who left the law behind. This scarred veteran has lost so many limbs in combat he’s practically half robot. Mow Man: Modified recon droid, stolen and empowered with banned software. Trades bodies for cold hard cash. Don’t expect to be taken alive if Mow Man’s on your six. OLD SCHOOL MODERNIZED Hand painted 16-bit pixel art graphics and hand-drawn animations combined with fluid 60-FPS gameplay and an epic synthesized soundtrack. 20 LEVELS Gritty, neon soaked, graffiti strewn 80s cityscapes to clear, each with their own infamous gang boss to terminate and bounty to collect. FOUR UNIQUE GANGS TO DISMANTLE Hoodlum Dolls: Violent feral punks winning the gang war with the toothless authorities Misconducts: Organised hockey hooligans, experts in robbery and extortion with a penchant for explosives The Heatseekers: Murderous motorcycle club. These rockabilly villains style themselves on the centurions of Ancient Rome NO.1 Suspects: Masters of discipline and organised crime. Martial arts experts, these slick psychopaths control the night through their casinos and nightclubs CHOOSE YOUR WEAPON Confiscate machine guns, laser weapons, katanas, grenades and more, and turn them on their owners. Stab, shoot and explode your way through swathes of gangs and bosses and collect your bounty.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/598550/header.jpg?t=1654253443",
    "Price": 19.99,
    "Developers": "Easy Trigger Games",
    "Publishers": "Coffee Stain Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/598550/ss_4317056a3f90399e6d18242a0beeebedd6ecd912.1920x1080.jpg?t=1654253443,https://cdn.akamai.steamstatic.com/steam/apps/598550/ss_c60dfaf2a92e46320354bce0d7fdf3a40da2c796.1920x1080.jpg?t=1654253443,https://cdn.akamai.steamstatic.com/steam/apps/598550/ss_5033816517e9eb719822640eca1154f057bf7cff.1920x1080.jpg?t=1654253443,https://cdn.akamai.steamstatic.com/steam/apps/598550/ss_b836dbb88f792236dda46fc8b232894b4c8c6c17.1920x1080.jpg?t=1654253443,https://cdn.akamai.steamstatic.com/steam/apps/598550/ss_89b66386fd56972be4876faca4f0e961cd5bfc17.1920x1080.jpg?t=1654253443,https://cdn.akamai.steamstatic.com/steam/apps/598550/ss_16c83194406a52d364dc16e1b3e59028221a511e.1920x1080.jpg?t=1654253443,https://cdn.akamai.steamstatic.com/steam/apps/598550/ss_0bd723ecc1bbf5057d3ad119e6b01197fe55a2f4.1920x1080.jpg?t=1654253443,https://cdn.akamai.steamstatic.com/steam/apps/598550/ss_f47604f84efb9883f7112cff3e5ad574b56d0bae.1920x1080.jpg?t=1654253443,https://cdn.akamai.steamstatic.com/steam/apps/598550/ss_658a4b47048104b62ea2bdc457957bc26268f3f0.1920x1080.jpg?t=1654253443,https://cdn.akamai.steamstatic.com/steam/apps/598550/ss_ef0310a8ef316302a545bd238d85cf3bfcd288b9.1920x1080.jpg?t=1654253443",
    "Slug": "huntdown",
    "Meta Title": "HUNTDOWN: May 12, 2021, Easy Trigger Games and Full Overview",
    "Meta Description": "Looking for information on HUNTDOWN? Check out the release date (May 12, 2021), developer insights from Easy Trigger Games, and a complete game summary.",
    "Alt Text Image": "Official header image for HUNTDOWN game - Steam 598550",
    "Canonical URL": "https://gusku.site/game/huntdown",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"HUNTDOWN\", \"description\": \"Looking for information on HUNTDOWN? Check out the release date (May 12, 2021), developer insights from Easy Trigger Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Easy Trigger Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Coffee Stain Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/598550/header.jpg?t=1654253443\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}