{
    "AppID": 656130,
    "Name": "King Erik",
    "Release date": "Dec 24, 2018",
    "About the game": "King Erik is a Medieval 2D side-scrolling platformer game where you battle Saxon forces throughout the fortresses of Eromott in order to regain control of your kingdom. You play as King Erik, a young man who has acquired the Scepter of Might and will use it to single-handedly destroy his Uncle Lukion Duke of Warchester. Fight your way through tricky passages and deadly contraptions to regain your kingdom from the clutches of your Uncles Saxon armies! Main Features: Simple combat system, attack, block and unleash your scepters power. 7 different enemy types that become progressively harder. 15 fortress levels filled with enemies, loot, contraptions and obstacles. Enchantment system to buy healing, extra lives, extra hit points and scepter infusions. Stylized 3D to 2D pixel art rendering. Autosave. Continue your games with just one click. Main story line. Achievements. Gameplay Using the keyboard and mouse or a controller to control King Erik, you will engage opponents in one-on-one combat all the while jumping, climbing, dropping, shimmying and outwitting your way through 15 fortress levels as you battle Duke Lukion at each turn. Collect the souls of your vanquished enemies into the scepter to unleash with a devastating blow. The Realm of King Erik I Somewhere in Europe At the age of 16, Erik inherited the throne from his father, King Erold of Eromott. King Erold's brother, Duke Lukion of Warchester, was outraged that his nephew, a boy, would become King over that of himself. The Duke insisted that if he did not become King, then he shall at least become Regent until Erik came to the age of 18. But the ad hoc regent council refused and Erik was made King of Eromott regardless of his young age. The Duke, in a fury, mustered an army of 10,000 men, consisting mostly of Saxons, then set forth to take the kingdom by force. Two years later, Duke Lukion had conquered most of Eromott and vanquished most of King Erik's armies. Victory was surely in the Dukes hands. One night, a mysterious old man appeared before Erik in his chambers and bestowed upon him a beautiful golden scepter crowned with the largest ruby he'd ever seen. The man claimed that the scepter had mystical powers as it was imbued with the souls of his ancestors... Erik's royal line. The old man added, that the scepter could only be used at night. With this mighty weapon in hand, King Erik set forth to vanquish his uncles armies and restore peace to the kingdom once and for all. By himself.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/656130/header.jpg?t=1546316463",
    "Price": 0.99,
    "Developers": "Battle Crafters LLC",
    "Publishers": "Battle Crafters LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/656130/ss_7f831ca8ff254b8a05dc0fc22d7b8788025b4f64.1920x1080.jpg?t=1546316463,https://cdn.akamai.steamstatic.com/steam/apps/656130/ss_ef6653f7ff1cfb42904f876253406462d3501058.1920x1080.jpg?t=1546316463,https://cdn.akamai.steamstatic.com/steam/apps/656130/ss_d609502ddd6844b1cf9359e054fb2d0375c541a2.1920x1080.jpg?t=1546316463,https://cdn.akamai.steamstatic.com/steam/apps/656130/ss_0699494c9748fb6e5c07eda6ea3baeb971626cc4.1920x1080.jpg?t=1546316463,https://cdn.akamai.steamstatic.com/steam/apps/656130/ss_5863d1801f73b0762ff6d2ddc787c12bca50b29e.1920x1080.jpg?t=1546316463,https://cdn.akamai.steamstatic.com/steam/apps/656130/ss_91f6ad1877b4201d735a1ed4e0df71ca3aa50809.1920x1080.jpg?t=1546316463,https://cdn.akamai.steamstatic.com/steam/apps/656130/ss_87538d3d5a02ebb25459abb433b54241b706d8ae.1920x1080.jpg?t=1546316463",
    "Slug": "king-erik",
    "Meta Title": "King Erik: Dec 24, 2018, Battle Crafters LLC and Full Ove...",
    "Meta Description": "Looking for information on King Erik? Check out the release date (Dec 24, 2018), developer insights from Battle Crafters LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for King Erik game - Steam 656130",
    "Canonical URL": "https://gusku.site/game/king-erik",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"King Erik\", \"description\": \"Looking for information on King Erik? Check out the release date (Dec 24, 2018), developer insights from Battle Crafters LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 24, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Battle Crafters LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Battle Crafters LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/656130/header.jpg?t=1546316463\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}