{
    "AppID": 1827940,
    "Name": "Last Lovers 绿洲之爱",
    "Release date": "Mar 3, 2022",
    "About the game": "This is a Chinese game，a visual novel game with doomsday theme. If you want to know more information about Last Lovers , you can join Last Lovers QQ group 532157072 to participate in related discussions. STORY： Twenty eight years ago, zombie virus broke out on the planet where human beings live, showing an apocalyptic state. The surviving human beings huddled together for warmth, and large refuge areas - oases have been established all over the world. Overlooking the metal city, human survivors hide in the shadow. The new social component - 'mercenary regiment' - replaced the original social order maintainer. I am a member of the black bear mercenary regiment, an ordinary search team mercenary, who travels between the oasis and the wilderness every day. The boring life makes me numb and lonely. I transformed an intelligent robot exactly like my late sister-Alice. The ideal is very plump, but the reality is that the difference between Alice and her sister is so big that I have more and more headaches. People around us also cast friendly or malicious eyes on us. The life under the last world continues. What else can I pursue except living and working? SYSTEM： Players click the mouse to read the plot text and make branch choices to continue the development of the story. The text box is accompanied by a function button for auxiliary reading. You can save and read progress at any time, automatically read articles and quickly skip chapters. Players can also watch the plot record repeatedly through the mouse wheel, which is convenient for reading. {STEAM_APP_IMAGE}/extras/jietu2.jpg You can modify the function settings at any time to make them conform to your reading habits. CHARACTER： Azo Hsiang A gray haired baby faced youth. The appearance looks old-fashioned and gloomy, the eyes are deep and indifferent, and the mind is active inside. Calm and steady, strong action force and many cruel words. In terms of emotion, I am casual, but I live my duty freely. Alice Hsiang (CV Feng Cha Ruo dance) The maid robot based on the transformation of domestic robot is close to azo's late sister in appearance and character. A little clumsy. The language ability is rigid, and the thinking logic is different from human beings. Take care of azo's daily life with due diligence every day, and have no complaints about the daily work arranged by the mercenary regiment base. In theory, cooking is very good, but what I'm good at is running and fighting. Cheerful female mercenaries are usually careless and even demonic. A little virgin, love to educate people, actually very timid and weak . Love reading and have a deep longing for cultural knowledge. Collect printed matter from time to time. The original oasis was captured by zombies and fled to the oasis where azo was located. A gentle and determined female mercenary, belonging to the flying dragon mercenary regiment. Open and straightforward, naive, fond of fantasy, not good at lying. Abandoned by his teammates, he became depressed and had a slight hostility to azzo who broke into his territory.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1827940/header.jpg?t=1646366201",
    "Price": 8.99,
    "Developers": "P. G. 制作组,V.P. TEAM",
    "Publishers": "V.P. TEAM,WindField Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1827940/ss_1869b1ed7b797d108bcde2c49a6e65b32c6428ec.1920x1080.jpg?t=1646366201,https://cdn.akamai.steamstatic.com/steam/apps/1827940/ss_9fa01437f2f07558ce7ea3c34fed9cb0f04a1b75.1920x1080.jpg?t=1646366201,https://cdn.akamai.steamstatic.com/steam/apps/1827940/ss_8ca8867d85aadd8871feb221da80b6891da7bee0.1920x1080.jpg?t=1646366201,https://cdn.akamai.steamstatic.com/steam/apps/1827940/ss_1d2e438a9c91f9c4959debd854ea06dd367c65d5.1920x1080.jpg?t=1646366201,https://cdn.akamai.steamstatic.com/steam/apps/1827940/ss_0c1e6180bd7770364faa4aa04d69b0a2dfb78a93.1920x1080.jpg?t=1646366201",
    "Slug": "last-lovers",
    "Meta Title": "Last Lovers 绿洲之爱: Mar 3, 2022, P. G. 制作组,V.P. TEAM and Fu...",
    "Meta Description": "Looking for information on Last Lovers 绿洲之爱? Check out the release date (Mar 3, 2022), developer insights from P. G. 制作组,V.P. TEAM, and a complete game ...",
    "Alt Text Image": "Official header image for Last Lovers 绿洲之爱 game - Steam 1827940",
    "Canonical URL": "https://gusku.site/game/last-lovers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Last Lovers \\u7eff\\u6d32\\u4e4b\\u7231\", \"description\": \"Looking for information on Last Lovers \\u7eff\\u6d32\\u4e4b\\u7231? Check out the release date (Mar 3, 2022), developer insights from P. G. \\u5236\\u4f5c\\u7ec4,V.P. TEAM, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"P. G. \\u5236\\u4f5c\\u7ec4,V.P. TEAM\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"V.P. TEAM,WindField Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1827940/header.jpg?t=1646366201\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}