{
    "AppID": 693650,
    "Name": "LOGistICAL: Italy",
    "Release date": "Aug 22, 2017",
    "About the game": "LOGistICAL: Italy brings you all the fun and puzzling of LOGistICAL with even more towns, more puzzles and much more to do. - You start with a small trucking company in Sicily, and a big work opportunity in Agrigento is about to change the future of your business forever. Cooperate with industries in the North to make the South flourish! - NEW! Logistical: Italy features many important Italian landmarks, like the Colosseum in Roma and the Milan Cathedral! A brand new, sightseeing improvement, never before seen in the series. - Build the bridge on the Strait of Messina! Help Italy finally bring to reality one of the most talked about, but never brought to completion, public works in the history of the continent! - Have you ever tasted Italian pizza? No? Then you're in for a treat! Explore the Campania area and set up a supply chain to deliver this delight in every Italian region! - More than 1400 cities to complete! This is the first videogame ever to include all of the Italian 'Comuni' with more than 10.000 citizens! Lots of smaller cities are included, like some of the wonderful towns in Trentino or some very famous production sites (like the Onions in Tropea!). All of the industries present in the game reflect some real life counterparts, or even historical ones! Do you know there were Iron Mines in Italy? Now you can discover where some of them were located! Improve your Italian geography knowledge while having fun! - The 'quarantine' mechanic is used to great effect to make sure the player will have lots to think about even in the mid-endgame. - Complete the largest Italian towns to get new Speed multipliers! LOGistICAL: Italy is co-designed by Marco Calcaterra (desangre). ... LOGistICAL: Italy game covers the mainland of Italy as well as the many islands, including many towns throughout Sicily and Sardinia. LOGistICAL: Italy also includes the BONUS countries of Malta, San Marino and Vatican City. There are many new obstacles and deliveries to make. ... LOGistICAL: Italy is an independent, standalone game independent from the main LOGistICAL game (and other add-ons). It has its own money, trucks and of course, challenges. ... LOGistICAL is a large open-world, strategy, puzzle game where you transport different cargoes to complete all the towns throughout the country. The whole game is a huge puzzle while each town is its own little piece of puzzling. There are over 1,000 towns to complete. Plenty of towns are easy enough. Some take complex planning. Do them in your own order. Get bonuses for completing regions and contracts. Some cargoes are easy to get. Others you have to create in industries. Use existing industries and build your own. The further you get from the start the more strategies you have to use. Pimp up your trucks with bonuses. Last truck delivering gets the bonus. The towns and map are to scale. Current or historical industry placement. You could even say that playing is educational. There is plenty more to keep you on your toes. Towns consume the cargoes you are trying to get to completion. Big trucks are great for moving lots of stuff, but can't travel everywhere. There are lots of broken roads that need deliveries. Upgrade the industries for better exponential throughput. Cargo stores can sure come in handy. What! I can't take my big trucks across the water on a ferry. ... and what is with those quarantine checkpoints? Complete towns, roads, industries, contracts, regions and states for lots of in-game and Steam achievements.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/693650/header.jpg?t=1560214686",
    "Price": 9.99,
    "Developers": "Sacada",
    "Publishers": "Sacada",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_d29270257a4976341b78d1aa675f3ae88dbea0cc.1920x1080.jpg?t=1560214686,https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_73c719cc8fb3ffd04ed0f6b95241da5e5b72737d.1920x1080.jpg?t=1560214686,https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_ecab4f56255ae3affb6f67ac8f85c8152dc79109.1920x1080.jpg?t=1560214686,https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_2a40ca100db755204d8974cf1cdbd377e84d54b9.1920x1080.jpg?t=1560214686,https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_abf45937cf36fcc4312b600cec721813137963df.1920x1080.jpg?t=1560214686,https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_f737012e9b645edfebae09c5f8af8bbc9354e25b.1920x1080.jpg?t=1560214686,https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_9dd2eb01ee17c97a22873819b5c10c010434071a.1920x1080.jpg?t=1560214686,https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_b5b2c9ecf8423b75afe3fb8347bcf1c0f1785156.1920x1080.jpg?t=1560214686,https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_c4992f4be4980ead4ee8e850a44aceb8f30421cc.1920x1080.jpg?t=1560214686,https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_e30398707456239f1ad99cc6737e29102141b436.1920x1080.jpg?t=1560214686,https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_0dc5963fb1b07ec1dfe804641d98f36f0b078a44.1920x1080.jpg?t=1560214686,https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_7bb32f5544e91d4d80f468d91cda56fc26165b79.1920x1080.jpg?t=1560214686,https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_286078b6f06ef20175489ed1645f9fdda480e10f.1920x1080.jpg?t=1560214686,https://cdn.akamai.steamstatic.com/steam/apps/693650/ss_0644121e52ea0208877784318d38792e9dbdb3fa.1920x1080.jpg?t=1560214686",
    "Slug": "logistical-italy",
    "Meta Title": "LOGistICAL: Italy: Aug 22, 2017, Sacada and Full Overview",
    "Meta Description": "Looking for information on LOGistICAL: Italy? Check out the release date (Aug 22, 2017), developer insights from Sacada, and a complete game summary.",
    "Alt Text Image": "Official header image for LOGistICAL: Italy game - Steam 693650",
    "Canonical URL": "https://gusku.site/game/logistical-italy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LOGistICAL: Italy\", \"description\": \"Looking for information on LOGistICAL: Italy? Check out the release date (Aug 22, 2017), developer insights from Sacada, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 22, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/693650/header.jpg?t=1560214686\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}