{
    "AppID": 1713810,
    "Name": "Lumencraft",
    "Release date": "Apr 13, 2022",
    "About the game": "Lumencraft is a top-down action shooter with tower defense elements. Emerge into a fully destructible environment where light and shadow play key roles. Build your base, dig some tunnels and find lumen - humanity's only chance for survival. KEY FEATURES BECOME SAVIOUR OF MANKIND The year 2221: More than two centuries ago, the surface of the planet became uninhabitable. The remnants of humanity struggle to survive without electricity and light. Dreams of a better future died long ago, but a recently discovered mineral has brought a spark of hope. Lumen, a crystal with high energy potency, may be the last chance for a struggling civilization. Scouts, brave miners, have been sent underground to a settlement near the Lumen deposits. New scouts continue to join this mission, but so far, no one has returned. It seems that the darkness of the underground holds more than just natural riches... DRILL YOUR WAY TO VICTORY Fight for your survival. Enemies are going to raid your base so be careful and leave some turrets on the watch. Defending the underground settlement by direct combat and the use of diversified turrets. Highly efficient and satisfying digging mechanics. Explosive weapons. Yes, we have dynamite. EXPLORE FULLY DESTRUCTIBLE ENVIRONMENT With a lot of effort and a set of original algorithms, 2Dynamic Games have transformed the open-source Godot Engine into a completely new tool. This allows every bit of terrain (pixel, as we used to call them) to be destroyed, and maps can be painted as if in a drawing program. What’s more? Dynamic lights and pixel-perfect interaction with the fully destructible terrain. Dread atmosphere created through the impactful sound design and a unique 2Dynamic lighting system. Realistic simulations. Just look at the lava! Play with your friends in co-op mode either using Steam Remote Play or locally on shared screen :) MAP EDITOR Easily create stunning maps with moldable terrain and many of objects to choose from. Then, invite your friends to play in your custom map! Map editor allows to create many game types (e.g. tower defense, action, survival or mix of them), define starting technologies/upgrades and of course the goals. We hope that the community will fill in the Steam Workshop with many great maps. EARLY ACCESS The game already allows for tens of hours of gameplay with first maps provided (grouped in sandbox, adventure and challenge categories) with all of the core features complete. Lumencraft is now in the Early Access stage, which means we are still adding new features and polishing already implemented ideas. Early Access offers multiple maps without progression between them and a map editor allowing to create own levels. The full version will offer a progression system through nonlinear missions (campaign mode), which is not available yet. For the full release we are also considering procedural maps and other multiplayer options. Please look at the DEVELOPMENT ROADMAP section above to check our plans for the next months. AND MORE TO COME Please join our Discord and stay tuned!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1713810/header.jpg?t=1658749685",
    "Price": 11.99,
    "Developers": "2Dynamic Games",
    "Publishers": "Star Drifters,Surefire.Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1713810/ss_1b71bd57fdace5ef1c8707cd7e1bb32b428f7f49.1920x1080.jpg?t=1658749685,https://cdn.akamai.steamstatic.com/steam/apps/1713810/ss_29a7b346da85d8a3465b5cb8f904e9e4e4881db6.1920x1080.jpg?t=1658749685,https://cdn.akamai.steamstatic.com/steam/apps/1713810/ss_affabd438a659f5de4d9c1fb4b4e6b9d94384ed7.1920x1080.jpg?t=1658749685,https://cdn.akamai.steamstatic.com/steam/apps/1713810/ss_e8512e5b71999013f2f7fd0b1bd84cd912b1bae2.1920x1080.jpg?t=1658749685,https://cdn.akamai.steamstatic.com/steam/apps/1713810/ss_5b715e9c9cc356e14efe70dc78d25e4500aaca62.1920x1080.jpg?t=1658749685,https://cdn.akamai.steamstatic.com/steam/apps/1713810/ss_8f14ba33cfd2ed77f5ed3a273c06835ec512883b.1920x1080.jpg?t=1658749685,https://cdn.akamai.steamstatic.com/steam/apps/1713810/ss_545b9a997e16db363a399cda78f54f5bcd8972b5.1920x1080.jpg?t=1658749685,https://cdn.akamai.steamstatic.com/steam/apps/1713810/ss_198e23ea793ba614c82591738220b141e13f8724.1920x1080.jpg?t=1658749685,https://cdn.akamai.steamstatic.com/steam/apps/1713810/ss_37f0447cf2cd91bb80d2154a63a4c909dd4aa4e3.1920x1080.jpg?t=1658749685",
    "Slug": "lumencraft",
    "Meta Title": "Lumencraft: Apr 13, 2022, 2Dynamic Games and Full Overview",
    "Meta Description": "Looking for information on Lumencraft? Check out the release date (Apr 13, 2022), developer insights from 2Dynamic Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Lumencraft game - Steam 1713810",
    "Canonical URL": "https://gusku.site/game/lumencraft",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lumencraft\", \"description\": \"Looking for information on Lumencraft? Check out the release date (Apr 13, 2022), developer insights from 2Dynamic Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"2Dynamic Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Star Drifters,Surefire.Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1713810/header.jpg?t=1658749685\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}