{
    "AppID": 1310390,
    "Name": "Mine Trap Reborn",
    "Release date": "Oct 27, 2020",
    "About the game": "Mine Trap Reborn takes place in an old abandoned mine. As the miner, you must clear each level and progress- but be sure to watch out for the blobs! Play through 130 levels, 30 in classic mode and 100 in arcade mode. Classic mode sticks close to the game's namesake; Minetrap , a game which existed in the 90's (it does not exist anymore). Arcade mode is the new, flashy version, complete with earthquakes, lava, dark levels, wind, coins, overly dramatic music, alternative objectives, crumbling levels, bosses, and more! While in theory the game is simple, it is quite easy to end up in a bad position and die- there are death messages designed to enhance the user experience and provide encouragement for level progression. There is also word of a hidden minigame, maybe you should hang out on the main menu... How-To It is recommended one plays Classic mode before attempting Arcade mode. Arcade mode is much more difficult. Kill blobs by digging traps, getting them to fall into traps, and then filling the traps in. Different blobs must fall different distances to be killed, or you can auto-kill them by dropping blobs on other blobs! Generally speaking, the blobs must fall the following number of 'levels'. Green, 1 Light Blue, 2 Red, 3 Yellow, 1 Light Purple, 2 Dark Purple, 3 Objectives Include: Clear all enemies, collect coins, mine amounts of gold, FFA, and survive a certain amount of time. Featuring: The world's most interesting main menu (can't really claim this, but it is rather mesmerizing) Steam Achievements Steam Leaderboards Steam Stats Large amounts of splats Large amounts of sass, in the form of over 125 different motivational messages Shaders Gameplay modifiers Overly-dramatic awesome music (looking at you, levels 49, 50, 99 and 100!) Controls: Keyboard and mouse is best, but can support most controllers Movement: WASD Dig: J Fill: K Throw dynamite (only works on dark levels): space Pause/Unpause: Escape Classic Controls (can be found in options) set the game to use the old control scheme from the now non-existant game. Movement: Arrow Keys Dig: D Fill: F Throw dynamite: space Pause/Unpause: Escape",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1310390/header.jpg?t=1616543089",
    "Price": 1.99,
    "Developers": "Steven Bower",
    "Publishers": "Thundermagnet",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1310390/ss_6d59d0d16c59a87842a24dc3b3450d8104d4ddf7.1920x1080.jpg?t=1616543089,https://cdn.akamai.steamstatic.com/steam/apps/1310390/ss_2e9de667a02cce959b619e641d44b479a8568107.1920x1080.jpg?t=1616543089,https://cdn.akamai.steamstatic.com/steam/apps/1310390/ss_d6742fdeb21660961da9a3d4a5e7ff525d926290.1920x1080.jpg?t=1616543089,https://cdn.akamai.steamstatic.com/steam/apps/1310390/ss_73959a4fe17a2dfafe475a4595ae0f3dc5a911c8.1920x1080.jpg?t=1616543089,https://cdn.akamai.steamstatic.com/steam/apps/1310390/ss_fdcd388bd301e644457db91ce6ced299be0e6633.1920x1080.jpg?t=1616543089",
    "Slug": "mine-trap-reborn",
    "Meta Title": "Mine Trap Reborn: Oct 27, 2020, Steven Bower and Full Ove...",
    "Meta Description": "Looking for information on Mine Trap Reborn? Check out the release date (Oct 27, 2020), developer insights from Steven Bower, and a complete game summary.",
    "Alt Text Image": "Official header image for Mine Trap Reborn game - Steam 1310390",
    "Canonical URL": "https://gusku.site/game/mine-trap-reborn",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mine Trap Reborn\", \"description\": \"Looking for information on Mine Trap Reborn? Check out the release date (Oct 27, 2020), developer insights from Steven Bower, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Steven Bower\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Thundermagnet\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1310390/header.jpg?t=1616543089\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}