{
    "AppID": 1698030,
    "Name": "NinNinDays2",
    "Release date": "Jan 20, 2022",
    "About the game": "※All characters involved in sexual content are over the age of 18. About This romance adventure game is set in Akihabara, where you'll enjoy your new, slightly naughty roommate life with laughter, tears, and the friendship of two female ninja. STORY A young man is dazing off while working the night shift at a convenience store, when a girl stops in to ask for a meat bun. The one next to her appears to be her boyfriend, and after doing their shopping, the two of them link arms affectionately and take off. Just when the young man is thinking how nice it would be to have a girlfriend, a pair of girls in ninja cosplay show up. The girls just stare at the shop goods without buying anything in particular. Even worse, they're even chatting about ninja techniques or something along those lines. When he calls out to them to prevent theft, it becomes apparent that they have no money. Despite suspecting that they might try to steal something, he gives in and buys a bento for the two desperately pleading girls. The life of that young man is turned upside down from the moment of his encounter with the two young women. CHARACTER Suzuran CV:Suzu Sazanami Suzuran came to Akihabara with Kikyō in order to carry out a certain mission. Suzuran is a ninja who suffers from a typical Chuunibyō's delusions of grandeur. She claims that one of her eyes is a different color because it's her 'evil eye,' but she simply has a color contact put in. The truth behind the bandage she has wrapped around one arm, which she insists is 'the black dragon from the demon world that I sealed away,' is actually... Even though Suzuran likes to make fun of the airheaded Kikyō, her jokes tend to miss the mark, and she often ends up being made fun of by the main character instead. Kikyō CV:Rin Mitaka A female ninja from the same village as Suzuran. Innocent, ditzy, and erotic, Kikyō is a ninja who acts like an older sister. Although Kikyō has a little more common sense than Suzuran, she's an airhead, and not exactly the brightest girl. She's admired as if she were an older sister to Suzuran, however, she gets a lot of flack from Suzuran due to her clumsiness. When it comes to Suzuran's Chuunibyō antics, Kikyō regards her with warmth and understanding. She may be a ditz, but she's a first-rate ninja. For some reason, there are a lot of cases when she ends up the victim of the main character's accidental groping. She's practically a machine for creating sexual situations out of thin air. Feature ・Smooth character animation via the E-mote system ・Different routes and ED ・High quality event CG ・Story set in an actual Japanese town STAFF ・Illustration : AkasaAi ・Scenario :Linkedbrain Inc. ・Producer/Planner :Yujiro Usuda",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1698030/header.jpg?t=1642702039",
    "Price": 14.99,
    "Developers": "iMel,qureate",
    "Publishers": "qureate",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1698030/ss_7bf8a39c4e8181bc8f7d31d5fab8ea84d83d4ac6.1920x1080.jpg?t=1642702039,https://cdn.akamai.steamstatic.com/steam/apps/1698030/ss_286e6bfd8c404f49dd0c1d215937a031fb064b78.1920x1080.jpg?t=1642702039,https://cdn.akamai.steamstatic.com/steam/apps/1698030/ss_ffd5141b223b2132e295e22df74892c042696394.1920x1080.jpg?t=1642702039,https://cdn.akamai.steamstatic.com/steam/apps/1698030/ss_b1b0d544beb653fee3cd327e3fb42dfb424f4e65.1920x1080.jpg?t=1642702039,https://cdn.akamai.steamstatic.com/steam/apps/1698030/ss_9a2487f7f83820f459da0287706d7746de5b149d.1920x1080.jpg?t=1642702039,https://cdn.akamai.steamstatic.com/steam/apps/1698030/ss_f06231eb0042fb6c5fc5307f6dfc2d06678d638d.1920x1080.jpg?t=1642702039,https://cdn.akamai.steamstatic.com/steam/apps/1698030/ss_485a5b99ced25993548e8da487fa7a21a4828f89.1920x1080.jpg?t=1642702039,https://cdn.akamai.steamstatic.com/steam/apps/1698030/ss_46b4f644987fcc43d41742b46f316d5247c4338b.1920x1080.jpg?t=1642702039",
    "Slug": "ninnindays2",
    "Meta Title": "NinNinDays2: Jan 20, 2022, iMel,qureate and Full Overview",
    "Meta Description": "Looking for information on NinNinDays2? Check out the release date (Jan 20, 2022), developer insights from iMel,qureate, and a complete game summary.",
    "Alt Text Image": "Official header image for NinNinDays2 game - Steam 1698030",
    "Canonical URL": "https://gusku.site/game/ninnindays2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NinNinDays2\", \"description\": \"Looking for information on NinNinDays2? Check out the release date (Jan 20, 2022), developer insights from iMel,qureate, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"iMel,qureate\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"qureate\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1698030/header.jpg?t=1642702039\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}