{
    "AppID": 540900,
    "Name": "Nuclear Contingency",
    "Release date": "Jan 2, 2017",
    "About the game": "It is the year 1959, the world is drastically changing in the aftermath of the Korean War and the death of the Soviet Dictator Joseph Stalin. The power balance of the world is forever altered by the discovery of the destructive A-bomb. From former British colonies in the South East Asia, US spies came back with the disturbing news of communist insurgents creating nuclear weapons. Nobody knows how they got their hands on uranium to fuel such a weapon and the required knowledge to make it. Faced with the dangers that communist terrorists could pose to the US and it's allies, the CIA Directors have decided to send their top man, Jack MacArthur to investigate the rumors and if they are proven true, to sabotage the nuclear capabilities of the terrorists. Still haunted by the horrors of the Korean War, Jack sets forth to eliminate the threat not only to the US, but to the whole world. Nuclear Contingency is a stealth game inspired by the old school top down spy titles (such as the Metal Gear series). A deep and compelling story line spread across a period of 4 years will constantly keep you on your toes while you travel across exotic locations of Vietnam, Kongo, Cuba, Afganistan and more. Be prepared for an intriguing political thriller filled with unforeseeable twists and turns. Playing as a top field operative, players will be tasked with completing various missions by using stealth or confronting enemy soldiers head on. However, if alerted, the guards will prove to be a great challenge as a single bullet is enough to send Jack to an early grave. Only with a stealthy, smart approach, cool head and steady aim will the player be able to complete the mission and put an end to a nuclear threat, bringing back peace to the world. Whats next' We still wish to work on the game and improve certain ai mechanics. For now we still have not figured out why the AI sometimes breaks. Please let us know about everything you would like to see improved so we can put it in the upcoming patch! Final note- During beta testing we have come across one weird but fun bug. The map is for some unknown reason filled with blood like someone before played the level... We found this interesting and we have no idea what causes the bug so if someone sees this please let us know so we can maybe figure out what causes the Massacre bug.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/540900/header.jpg?t=1483406542",
    "Price": 0.99,
    "Developers": "Amaterasu Software",
    "Publishers": "Amaterasu Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/540900/ss_60d10d255f19f9481e1240b0dbb2beee259843b9.1920x1080.jpg?t=1483406542,https://cdn.akamai.steamstatic.com/steam/apps/540900/ss_74d69d58c82f39e474ee3181bc504971286ad874.1920x1080.jpg?t=1483406542,https://cdn.akamai.steamstatic.com/steam/apps/540900/ss_570dc46d773b5933dd948fd889395d155ed21d02.1920x1080.jpg?t=1483406542,https://cdn.akamai.steamstatic.com/steam/apps/540900/ss_483941c2ab6aee395ac2e4588473c9b375e79d2d.1920x1080.jpg?t=1483406542,https://cdn.akamai.steamstatic.com/steam/apps/540900/ss_408976fb91dac09d6eeb3e8a9bdfdcc9be0423f0.1920x1080.jpg?t=1483406542",
    "Slug": "nuclear-contingency",
    "Meta Title": "Nuclear Contingency: Jan 2, 2017, Amaterasu Software and ...",
    "Meta Description": "Looking for information on Nuclear Contingency? Check out the release date (Jan 2, 2017), developer insights from Amaterasu Software, and a complete gam...",
    "Alt Text Image": "Official header image for Nuclear Contingency game - Steam 540900",
    "Canonical URL": "https://gusku.site/game/nuclear-contingency",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nuclear Contingency\", \"description\": \"Looking for information on Nuclear Contingency? Check out the release date (Jan 2, 2017), developer insights from Amaterasu Software, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 2, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Amaterasu Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Amaterasu Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/540900/header.jpg?t=1483406542\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}