{
    "AppID": 1554750,
    "Name": "Occultism Limbo: The ritual of little nightmares",
    "Release date": "Mar 10, 2021",
    "About the game": "Are you Innocent or Guilty? A story of sinister magic, play and makes decisions in this evil adventure, a dark game with scary storie where you will have to prove your innocence, or you will be condemned guilty in hell. Can you prove your INNOCENCE?. in this mystifying INTERROGATION game? Where you will find an esoteric and dystopian world where you will have to demonstrate your INNOCENCE. Or will you perish in a dark, OCCULT INTERROGATION? WHAT MAKES Occultism:Interrogation SO INTERESTING? You’ve certainly never played an INTERROGATION game like this before. Will you even be able to figure it out? Every step you take reveals a new member of the occultist sect. They have a dystopian, esoteric appearance that is both terrifying and unimaginable. You can choose to fear them or not, but you must answer their questions correctly. You must prove your innocence by choosing esoteric answers. If you do not respond quickly or your memory fails you, you will be found guilty and you will be severely punished. These esoteric interrogators are stealthily trained to detect your weak lies. They will know you are not innocent! - Do you choose to fight for your innocence? - Do you give up, plead guilty and become one with this occult sect? - How long can you endure this agony? Only you know the answers to these questions. THE BEGINING? The occult sect stole something from you… something that you value above all else. Enter this mystifying, esoteric sect and see if you are worthy of proving your innocence or can reveal the dark conspiracy that lies at the core of the occult sect. Each interrogation that you survive will bring you a step closer to your goal. The goal of recovering that which you value most! Are you ready? Are you brave enough to handle this dark challenge? GAMEPLAY? More than 20 esoteric and occult questions. Multiple ends as you prove your innocence. Think fast, time runs out according to your guilt level. A new interrogator each time you enter the occult sect. Enjoy this game of occult, esoteric and dystopian interrogation.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1554750/header.jpg?t=1632470404",
    "Price": 4.99,
    "Developers": "Trigger the Monster",
    "Publishers": "Cooking and Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1554750/ss_3cbe66fb9c86ddcd650416569a100882fe3580b5.1920x1080.jpg?t=1632470404,https://cdn.akamai.steamstatic.com/steam/apps/1554750/ss_03479d35c280e227e8ddb9ff4e25695f694fe0c1.1920x1080.jpg?t=1632470404,https://cdn.akamai.steamstatic.com/steam/apps/1554750/ss_18e06d8787c71d70f43e06004504f87af7f2b40f.1920x1080.jpg?t=1632470404,https://cdn.akamai.steamstatic.com/steam/apps/1554750/ss_fc3f859215cbb4c6689e363840540c394154a662.1920x1080.jpg?t=1632470404,https://cdn.akamai.steamstatic.com/steam/apps/1554750/ss_c97f3573c7bbdc67d4b786d6a30d40c540b73015.1920x1080.jpg?t=1632470404",
    "Slug": "occultism-limbo-the-ritual-of-little-nightmares",
    "Meta Title": "Occultism Limbo: The ritual of little nightmares: Mar 10,...",
    "Meta Description": "Looking for information on Occultism Limbo: The ritual of little nightmares? Check out the release date (Mar 10, 2021), developer insights from Trigger ...",
    "Alt Text Image": "Official header image for Occultism Limbo: The ritual of little nightmares game - Steam 1554750",
    "Canonical URL": "https://gusku.site/game/occultism-limbo-the-ritual-of-little-nightmares",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Occultism Limbo: The ritual of little nightmares\", \"description\": \"Looking for information on Occultism Limbo: The ritual of little nightmares? Check out the release date (Mar 10, 2021), developer insights from Trigger ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Trigger the Monster\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cooking and Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1554750/header.jpg?t=1632470404\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}