{
    "AppID": 618970,
    "Name": "Outcast - Second Contact",
    "Release date": "Nov 14, 2017",
    "About the game": "Take the role Cutter Slade, a tried and tested elite soldier, and explore the planet Adelpha with complete freedom. As you journey in this magnificent world, where magic and science mix, discover exotic cities, face fierce enemies and attempt to learn the secrets of an advanced civilization. Make the correct choices in this systemic, living world, because the destiny of these two universes depends on your success. Through hundreds of quests, the vast open world of Outcast – Second Contact offers epic-scale adventure. Start your adventure in complete freedom in this vast open world. Progress at your own pace through different quests available at any time. Face the Talans head-on in daring combat or play the infiltration card. Master an arsenal of evolving weapons and high-tech gadgets, adapt your strategy to fit your situation. Change the balance of the forces on Adelpha. Outcast – Second Contact takes place on a living world where your actions have direct and visible consequences on the ecosystem. Take off on a fantastic voyage to Adelpha, a bewitching world populated by extraordinary creatures and the home planet of the Talans, an advanced alien civilization. Explore 6 different continents on foot or on the shoulders of a Twôn-Ha, and penetrate into wild lands unknown to humans. As you initiate yourself into the culture of an alien civilization, you are brought into the heart of Talan society: negotiate with the merchants of Riss, parley with rebel forces or follow the mystic path of the grand Shamaz. Each encounter, each event is an invitation to adventure in this thrilling world. In the near future, humanity has discovered that it is not alone in the universe – or rather universes . Alas, the first contact with intelligent beings turns disastrous when a probe sent by the US government is destroyed by the natives of a world called Adelpha. The incident creates an energy cataclysm which threatens to destroy the Earth. You are Cutter Slade, a Navy SEAL sent on a mission to Adelpha to find and repair the probe, in order to prevent this catastrophe. Welcomed by natives as the “Ulukai” – a messiah of an ancient prophecy – you will discover that the futures of Adelpha and the Earth are now linked. More than 50 hours of adventure within a dynamic and fast-paced story. Confront bloodthirsty tyrants and deliver freedom to a people under the yoke of oppression. Take the role of Cutter Slade, a charismatic and bluntly spoken hero. Outcast – Second Contact is the complete remake of the cult title Outcast . As the first 3D open world in the history of video games and pioneer in the modern action-adventure genre, the 1999 release won over 100 awards including adventure game of the year. The Outcast universe completely redone with modern graphics. Combat even more dynamic with new moves: dodges, rolls, sprint and cover system. New hidden areas divulging some of the most hotly debated mysteries of Adelpha by the fans of the original game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/618970/header.jpg?t=1592387155",
    "Price": 14.99,
    "Developers": "Appeal",
    "Publishers": "Nacon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/618970/ss_51dabec78134fe335de206c5b4f02be4d1ef9372.1920x1080.jpg?t=1592387155,https://cdn.akamai.steamstatic.com/steam/apps/618970/ss_eb5703e556815cbc7b2cf815207c399feeb5439c.1920x1080.jpg?t=1592387155,https://cdn.akamai.steamstatic.com/steam/apps/618970/ss_99c705089bbf3f3d1e5400bfdadc33afb086abad.1920x1080.jpg?t=1592387155,https://cdn.akamai.steamstatic.com/steam/apps/618970/ss_d9d9134c83d557ed253d3071027cefca8e01acf5.1920x1080.jpg?t=1592387155,https://cdn.akamai.steamstatic.com/steam/apps/618970/ss_3e472b1c0dbd69c881a86d72e8ecd2f60bf1b668.1920x1080.jpg?t=1592387155,https://cdn.akamai.steamstatic.com/steam/apps/618970/ss_a626d11e40ae9bce051a08ed7a25a1f509bf4415.1920x1080.jpg?t=1592387155,https://cdn.akamai.steamstatic.com/steam/apps/618970/ss_d4d7462700ba95c05f565144581f510763e8770d.1920x1080.jpg?t=1592387155,https://cdn.akamai.steamstatic.com/steam/apps/618970/ss_261af1e5d7d43968c971eec0d08fec5f98593a2d.1920x1080.jpg?t=1592387155,https://cdn.akamai.steamstatic.com/steam/apps/618970/ss_38b91b3dd13c92cb6b9a8bd22366f7889b85b847.1920x1080.jpg?t=1592387155,https://cdn.akamai.steamstatic.com/steam/apps/618970/ss_bcc0116a6aa614b126a73661fbed6625890e5c14.1920x1080.jpg?t=1592387155",
    "Slug": "outcast-second-contact",
    "Meta Title": "Outcast - Second Contact: Nov 14, 2017, Appeal and Full O...",
    "Meta Description": "Looking for information on Outcast - Second Contact? Check out the release date (Nov 14, 2017), developer insights from Appeal, and a complete game summ...",
    "Alt Text Image": "Official header image for Outcast - Second Contact game - Steam 618970",
    "Canonical URL": "https://gusku.site/game/outcast-second-contact",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Outcast - Second Contact\", \"description\": \"Looking for information on Outcast - Second Contact? Check out the release date (Nov 14, 2017), developer insights from Appeal, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Appeal\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nacon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/618970/header.jpg?t=1592387155\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}