{
    "AppID": 814300,
    "Name": "Pigeons Attack",
    "Release date": "Feb 21, 2019",
    "About the game": "Pigeons Attack is a top-down shooter with combat elements whose goal is to survive the pigeons hordes for as long as possible. For this propose, you will count on upgrades and weapons placed around the level. Collect coins to unlock new characters, maps and magic runes. The game has a lot of humor too. The world is being dominated by pigeons, why not make fun of this situation? Help fight this invasion, alone or with your friends! What happened? Is this war? You must have already realized that pigeons are getting more and more loose, right? They sit on our table in an open-air cafeteria, calmly cross a busy street, enter the most unusual places… Not to mention what they do when they see our newly washed car. Of course pigeons want to rule us! We humans are still free, but in Almerath, a faraway kingdom, the invasion has already begun. In the first contact with the creatures of the Kingdom of Pruuzharia, the people of Almerath believed that pigeons were peaceful beings, besides that was the message transmitted by them at the capital of the kingdom. But after seeing a small popcorn sack, they revealed their evil nature. Well, I got to go now. I feel they are watching me… Before that, I am going to leave the pictures and information I was able to gather. Oh no! Pigeons just got in through my window! Survive! Many pigeons addicted to popcorn are going to chase you down, each one with a particular behavior. Unlock new paths of the level to find better weapons and upgrades as to fight back! Play with friends! You can play alone or with your friends in the online co-op mode for up to four players! Be careful, explosive weapons will kill you both (I know you’ll try that now that you know it). You can also play the local co-op mode if you have at least one joystick. Features Survive for as long as possible; Local and online co-op mode for up to four players; Beautiful 3D cartoon art style; 3 playable characters, each one with a special ability and gameplay; Different classes of enemy pigeons to challenge you; 4 different maps to survive; Different upgrades and weapons to fight back; More than 15 magic runes with improvements to help you during this war; Many pigeons; Seriously, a lot of pigeons; Imagine a park full of pigeons after someone has dropped some popcorn. There are more of them in this game than at that park; Leaderboard; Achievements; A lot of humor.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/814300/header.jpg?t=1614728471",
    "Price": 4.99,
    "Developers": "Nixtor Game Studio",
    "Publishers": "Nixtor Game Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/814300/ss_b3cfbb48e47194c4d2dd386892abb86afb43370f.1920x1080.jpg?t=1614728471,https://cdn.akamai.steamstatic.com/steam/apps/814300/ss_54ee5affcf60ca4bc78779fefdce1b05c654d494.1920x1080.jpg?t=1614728471,https://cdn.akamai.steamstatic.com/steam/apps/814300/ss_98291a07af7005e88c55dbd2f68bf4f6ab5b1067.1920x1080.jpg?t=1614728471,https://cdn.akamai.steamstatic.com/steam/apps/814300/ss_05d31f94223fb3a80b31bb1061f16712453bdbe5.1920x1080.jpg?t=1614728471,https://cdn.akamai.steamstatic.com/steam/apps/814300/ss_2dd2fc1dd7bdef57595487d97a1b39e69e3b74e8.1920x1080.jpg?t=1614728471,https://cdn.akamai.steamstatic.com/steam/apps/814300/ss_b7c50b6c2bf7ca41e5365f4967fc15e8f33d6b2d.1920x1080.jpg?t=1614728471,https://cdn.akamai.steamstatic.com/steam/apps/814300/ss_d4e7fd84fd6451af15490a06bc17b0e3adbaa7c2.1920x1080.jpg?t=1614728471,https://cdn.akamai.steamstatic.com/steam/apps/814300/ss_ca55a534fb47435156d37185eaff5a8560ac1ace.1920x1080.jpg?t=1614728471",
    "Slug": "pigeons-attack",
    "Meta Title": "Pigeons Attack: Feb 21, 2019, Nixtor Game Studio and Full...",
    "Meta Description": "Looking for information on Pigeons Attack? Check out the release date (Feb 21, 2019), developer insights from Nixtor Game Studio, and a complete game su...",
    "Alt Text Image": "Official header image for Pigeons Attack game - Steam 814300",
    "Canonical URL": "https://gusku.site/game/pigeons-attack",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pigeons Attack\", \"description\": \"Looking for information on Pigeons Attack? Check out the release date (Feb 21, 2019), developer insights from Nixtor Game Studio, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 21, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nixtor Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nixtor Game Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/814300/header.jpg?t=1614728471\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}