{
    "AppID": 806910,
    "Name": "Posthuman: Sanctuary",
    "Release date": "Jul 27, 2018",
    "About the game": "'A bitter-tasting rain washes over the raw wreckage of human civilization. With only a heavy pipe to defend you, you forge out of your threadbare shelter, desperate for food. At first, you think you must be imagining the strains of an old favorite song rising above the sound of wind and leaves, but you follow the pounding heartbeat of familiar music until you’re sure you're not dreaming. It leads you to a dilapidated house lying among the trees. The curtains are drawn, but there’s light inside. The front door is ajar. Inside, a figure in a brittle, wrinkled suit sits on a sofa, listening to a record deck. You haven't seen another living thing in so very long. Only when she turns slowly to face you do you notice that her head is much too large, grotesquely misshapen. Your hand tightens on the pipe. You need to decide what to do ... and the others are watching .' Posthuman: Sanctuary is a digital game set in the world of the successful Posthuman and Posthuman Saga board games. In Posthuman: Sanctuary you are a survivor in a near-future Europe that has collapsed under the weight of its own political errors, in the chilling wake of a bloody class war fueled by genetic modifications and radical technology. If you can only reach the sanctuary of the Fortress, you may learn more - and ensure your own survival. But to forge across a crumbled land where resources are spare and mutants roam the ruined mansions and markets alike, you’ll need a team behind you. Carefully balancing risk and reward, you and your team quest into the unknown, gradually unveiling a map of terrain and encounters that you shape to your liking every time you play. In classic turn-based encounters, aggressors who have lost their humanity to mutations - or lost their good sense to the terror - will challenge you to make the most of your group's skills and to use your best judgment about their safety. And you're in danger, too - some wounds might cause you to take on mutations of your own. If you mutate, your followers may begin to fear and distrust you, but the world of Posthuman: Sanctuary just might offer you paths and powers that just aren’t available to mere humans. The game draws on elements from tabletop games and blends them into a unique single-player RPG with a strong narrative focus. It's about surviving the end of the world - and keeping your humanity. Posthuman: Sanctuary is part rogue-lite, with combat, team management and exploration elements, and part interactive fiction, where the choices you make will weigh on your chances and shape your experience. With branching narrative encounters and a rich network of weather, health, location and other conditions affecting them, Posthuman: Sanctuary exists to be discovered and rediscovered. And just when you think you know it all, more mysteries rustle in the shadows at the world's edges.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/806910/header.jpg?t=1589187258",
    "Price": 15.99,
    "Developers": "Mighty Box",
    "Publishers": "Mighty Box",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/806910/ss_72e5c8480e5b8b37e2c4d17ca3ad6563a42d601c.1920x1080.jpg?t=1589187258,https://cdn.akamai.steamstatic.com/steam/apps/806910/ss_2849417ad7e236929ec83b62d72509584fa8d4fb.1920x1080.jpg?t=1589187258,https://cdn.akamai.steamstatic.com/steam/apps/806910/ss_470375428a0ef0c3f501e5593e239d10edc7bca1.1920x1080.jpg?t=1589187258,https://cdn.akamai.steamstatic.com/steam/apps/806910/ss_db210ee2bbb525779d56f61f1220553d8910a537.1920x1080.jpg?t=1589187258,https://cdn.akamai.steamstatic.com/steam/apps/806910/ss_a8bbaa74b911b4a20d1186d37005506c3e687d7f.1920x1080.jpg?t=1589187258,https://cdn.akamai.steamstatic.com/steam/apps/806910/ss_a036d8b417c2b02623656b575ed4585fd2e96e45.1920x1080.jpg?t=1589187258,https://cdn.akamai.steamstatic.com/steam/apps/806910/ss_849639a00926b0d63474f765e5ac72ae1a7d7f57.1920x1080.jpg?t=1589187258,https://cdn.akamai.steamstatic.com/steam/apps/806910/ss_53092c66cb4cc91c9ada3c3a54da8c4dffb1945f.1920x1080.jpg?t=1589187258",
    "Slug": "posthuman-sanctuary",
    "Meta Title": "Posthuman: Sanctuary: Jul 27, 2018, Mighty Box and Full O...",
    "Meta Description": "Looking for information on Posthuman: Sanctuary? Check out the release date (Jul 27, 2018), developer insights from Mighty Box, and a complete game summ...",
    "Alt Text Image": "Official header image for Posthuman: Sanctuary game - Steam 806910",
    "Canonical URL": "https://gusku.site/game/posthuman-sanctuary",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Posthuman: Sanctuary\", \"description\": \"Looking for information on Posthuman: Sanctuary? Check out the release date (Jul 27, 2018), developer insights from Mighty Box, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mighty Box\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mighty Box\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/806910/header.jpg?t=1589187258\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}