{
    "AppID": 736220,
    "Name": "Post Scriptum",
    "Release date": "Aug 9, 2018",
    "About the game": "Post Scriptum is a WW2 themed tactical first-person shooter game, focusing on historical accuracy, large scale battles, a difficult learning curve and an intense need for cohesion, communication and teamwork. Experience the intense campaigns that were Operation Market Garden, Plan Jaune (Fall Gelb) or Operation Overlord which stretched across farms, woods, villages and city areas of the Netherlands, Mountains and rivers of Belgium and shores of France. Whether you’re jumping out of a plane, arriving in a landing craft by sea, resupplying friendlies or operating a tank, you will find multiple reasons to drop back into the battlefield in this grand scaled representation of a WW2 setting never explored in a large multiplayer environment. Post Scriptum will cover multiple theatres in the form of chapters, with the 1st Chapter “The Bloody Seventh” being the original setting in Operation Market Garden, it covers the 1st Airborne, 82nd and 101st Airborne, the 9th Waffen SS and the Wehrmacht, with over 40 vehicles, 9 maps. The 2nd Chapter “Plan Jaune” covers the Invasion of France in 1940 and features the French Army as well as the Wehrmacht of 1940, dozens of new vehicles, 2 new maps with a 3rd still coming. The 3rd Chapter 'Day of Days' which will cover the Invasion of Normandy in 1944, features new factions like the German Fallschirmjägers and US 4th Infantry, each with new vehicles and a few new weapons, and with 2 new maps and a 3rd coming later, which adds to the already large selections of maps. Included in this new Chapter is a new game mode 'Invasion' which puts a twist on the original game mode 'Offensive'. Factions Fight in historically recreated WW2 battlefields with up to 80 players and choose between the British 1st Airborne Division, British XXX Corps, US 101st and 82nd Airborne Division, 4th Infantry, French Army or several branches of the German Army such as the Wehrmacht, the Waffen SS or Fallschirmjägers. _ Teamwork In Post Scriptum, teamwork is paramount to achieve victory. Enrol as the commander and order gun runs or artillery to support your team, play as one of the many infantry roles, join a logistics section and fortify the battlefield with fortifications and emplacements and resupply the frontline or be one of the armoured crew members and crew a tank. Communicate with our in-game VoIP with your squad or use the local proximity fade to talk to players nearby to help the flow of battle. _ Armored Combat Armoured vehicles played a tremendous role in WW2 and were feared due to their destructive nature. Join a tank section with 3 other players and crew multiple accurately modelled steel beasts as the driver, gunner or commander. Every vehicle features realistic values such as turret speed, armour thickness and type of rounds. Calculate the range of an enemy vehicle and shoot at its internal components to disable or destroy them. _ Tactical, Immersive &amp; Authentic Immersion is one of the fundamental key elements in Post Scriptum. Experience the authentic reproduction of an incoming Stuka siren or artillery cannons firing from afar. The piercing sound of an incoming heavy round cutting through the air past you. The cracks of bullets and shrapnel. Any kind of caliber, any kind of damage to body and steel, the soundscape and visual fx were thought out to the tiniest detail to make you fully immersed in the battlefield. Key Features Communicate using our built-in Voice Over IP system with the best codecs available to allow positional voice chat with local friendlies, between squadmates and section leaders. 4 Major factions including the United Kingdom, United States, France and Germany, each with their own sub-factions like the 1st Airborne, 101st Airborne, 4th Infantry &amp; Waffen SS. Pick between a huge variety of roles and classes such as medic, machine gunner or anti-tank to help your team in the struggle for victory. Play several different game modes like Offensive, Invasion, Armoured, KOTH and many more. All requiring teamwork and coordination to be victorious. Using our advanced tank mechanics with realistic armour penetration simulation and authentic sounds. Roll into battle using some of the most famous heavy tanks ranging from the Tiger &amp; King Tiger tank, Panthers, Shermans and Churchills to the smallest armoured cars like the Puma or Daimler. Lead your section to victory as a section leader or command the entire team as a commander with various types of support assets like dive bombers, fighters and artillery. Over 200km² of playable area. Experience over 14 huge and historically accurate maps based on archives, maps and aerial pictures. Large scale battles with 40 versus 40 player battles stretching across these massive battlefields. Huge variety of more than 50 different and highly detailed vehicles for players to use to traverse the battlefield. Use over 80 authentic weapons in battle including the infamous American M1 Garand, German MG42, the British Lee Enfield, the French Lebel as well as many more. Play as logistics with an in-depth base building system, build fortifications, barricades, weapons and support infrastructure to assist your team or deliver important supplies to rearm the frontline. Workshop integrated into the game allowing for community-driven content to be created and played using our Software Development Kit, available for free from the Epic Launcher. Host your very own Post Scriptum server using our dedicated server tools or rent one from one of our many partners!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/736220/header.jpg?t=1643990765",
    "Price": 29.99,
    "Developers": "Periscope Games",
    "Publishers": "Offworld Industries",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/736220/ss_a9cedd6bc3bec3c207a47257768313fdbbf686e0.1920x1080.jpg?t=1643990765,https://cdn.akamai.steamstatic.com/steam/apps/736220/ss_a73fd6a6d271fda755f954f217f1e524bb362d6c.1920x1080.jpg?t=1643990765,https://cdn.akamai.steamstatic.com/steam/apps/736220/ss_19010c039cb7a137f856c617c6387f3ce03a787a.1920x1080.jpg?t=1643990765,https://cdn.akamai.steamstatic.com/steam/apps/736220/ss_7d8225420302fdebc3feb32098d0f7e9431944c4.1920x1080.jpg?t=1643990765,https://cdn.akamai.steamstatic.com/steam/apps/736220/ss_b0dea7ba10bc77237a6b80024070f387ff5a0d6d.1920x1080.jpg?t=1643990765,https://cdn.akamai.steamstatic.com/steam/apps/736220/ss_e56634613d42e879f6253d5294a4c5e8a7daaf9d.1920x1080.jpg?t=1643990765,https://cdn.akamai.steamstatic.com/steam/apps/736220/ss_f90c118f8f8bf99588f360f53c766abcb04cb919.1920x1080.jpg?t=1643990765,https://cdn.akamai.steamstatic.com/steam/apps/736220/ss_9431917fb9878bdb35d70a3e07f384552d54118d.1920x1080.jpg?t=1643990765,https://cdn.akamai.steamstatic.com/steam/apps/736220/ss_8406fbac4182bc6e47fc7b32d74b17a378ac6914.1920x1080.jpg?t=1643990765,https://cdn.akamai.steamstatic.com/steam/apps/736220/ss_c982771fb3fd934f1b24bd9a4553fc3db2f07ce6.1920x1080.jpg?t=1643990765,https://cdn.akamai.steamstatic.com/steam/apps/736220/ss_1657647ffbb153be926f2ad6e9831af6254d2702.1920x1080.jpg?t=1643990765",
    "Slug": "post-scriptum",
    "Meta Title": "Post Scriptum: Aug 9, 2018, Periscope Games and Full Over...",
    "Meta Description": "Looking for information on Post Scriptum? Check out the release date (Aug 9, 2018), developer insights from Periscope Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Post Scriptum game - Steam 736220",
    "Canonical URL": "https://gusku.site/game/post-scriptum",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Post Scriptum\", \"description\": \"Looking for information on Post Scriptum? Check out the release date (Aug 9, 2018), developer insights from Periscope Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Periscope Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Offworld Industries\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/736220/header.jpg?t=1643990765\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}