{
    "AppID": 1806120,
    "Name": "Serena: Dark confessions",
    "Release date": "Mar 2, 2022",
    "About the game": "An erotic visual novel full of meaningful choices mixed with adventure game elements, non-linear story resulting in 9 diverse endings. Multiple narrators and characters you care about. All with 4k visuals, sex animations and awesome cumshots. Julian and Serena, a happy couple, engaged and soon to be married, ready for a picture-perfect ever after. It was a heartwarming tale of clumsy mistakes flowering into solid romance and the promise of something greater. But promises can be broken, and this one was shattered by Julian, who strayed from his fiancée, and by Nicole, Serena’s best friend, who took her husband to be. And Serena left, and Julian… drifted. It… wasn’t easy, being the bad guy. Nicole stood by his side, cheerful, vibrating with life and energy as always. He worked in his beloved car workshop, the place where he could feel his skills were worth something. But every day, knowing all that he had, he couldn’t stop thinking about what he no longer did. Self-respect was quite high on that list. And not knowing what Serena was doing, or with whom? That wasn’t easy. Not even Jade, the girl who should have been his sister-in-law, knew. Julian’s ex was now a mystery, and as much as he missed her sometimes, as much as he wished he could somehow make things better… But this is all the past, part of a story that’s already been told, that you know. And this game? No, this is the part yet to come. This is the part of the story where lingering embers blaze, where we meet the characters we thought we knew and see new ones step into the limelight. This is where we learn about Serena’s past, the secrets she now guards. This is where Julian chooses. And you with him. MULTIPLE NARRATORS Everyone is the hero of their own story, and so, for the first time, we will allow you to see all the different stories hidden in a single game. You will step into Julian’s shoes and choose his actions, yes, but you will also do so with Serena, Jade, and other characters, so that you may experience their tales as they unfold and as they touch one another. Follow all the threads, and step back to look at the tapestry. VISUAL NOVEL GAMEPLAY In the past, Julian and Serena’s story has been told as a dating-sim, where you raised the appropriate stats and repeated the available actions till you achieved the desired combination. This time around? No grinding. The game will play as an alternating mix of visual novel, with interactive scenes whose choices will be felt further down the line, and classic adventure, interacting with the environment until you decide to trigger the next section of the narrative. This doesn’t mean there won’t be room for fun asides: having Nicole model her outfits for no reason whatsoever during an adventure segment is not only possible, but highly recommended. CHARACTERS YOU CARE ABOUT Serena, Jade, Nicole… Names you have known for quite a while, stories to continue from old memories - but that is just the tip of the iceberg. There will be new characters, new gorgeous faces and intriguing personalities that will allow you a glimpse into their life. You will have control of all of them, and, once you take the wheel, you will discover… Well, that would be telling, wouldn’t it? LIVING ORGANISM There is so much about these characters we want to tell that we couldn’t fit it all into the game - and so we will keep updating it with everything we came up with, for months to come. The new structure we are implementing will allow us to easily add content without disturbing the flow of the original game, so, as long as you want there to be more, there will be. KEY FEATURES - stunning 4K visuals with one of the most adorable characters we've ever designed - over 1500 static images plus almost 50 cumshot sequences, 5 juicy images each - passionately rendered 118 sex animations with 30 frames each - beautiful story written with almost 300 000 words - non-linear story with smart choices leading to 10 different endings - 100% uncensored and complete experience",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1806120/header.jpg?t=1654762338",
    "Price": 11.99,
    "Developers": "Lesson of Passion",
    "Publishers": "Lesson of Passion",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1806120/ss_ff59d147b58c310512e2fff5a37baa5595b23c73.1920x1080.jpg?t=1654762338,https://cdn.akamai.steamstatic.com/steam/apps/1806120/ss_fdf1d77c0af25dae7b168b7c7bc9e79ef7494587.1920x1080.jpg?t=1654762338,https://cdn.akamai.steamstatic.com/steam/apps/1806120/ss_111127102f8d9dd3265b0be57261c6296994c535.1920x1080.jpg?t=1654762338,https://cdn.akamai.steamstatic.com/steam/apps/1806120/ss_f7dee66b1d0b427d27960161c7a302e6ecace09a.1920x1080.jpg?t=1654762338,https://cdn.akamai.steamstatic.com/steam/apps/1806120/ss_7af061290db18cc1e59a67249c1a6e4668c6e0d9.1920x1080.jpg?t=1654762338,https://cdn.akamai.steamstatic.com/steam/apps/1806120/ss_d98c4375a8ec7298b3a66a2b948e1b5b4fb02582.1920x1080.jpg?t=1654762338,https://cdn.akamai.steamstatic.com/steam/apps/1806120/ss_80796d848ba613cef370c8894342baee46064eb5.1920x1080.jpg?t=1654762338,https://cdn.akamai.steamstatic.com/steam/apps/1806120/ss_9fccd6f42cbf8aa75075c22c1c86284221f2a116.1920x1080.jpg?t=1654762338,https://cdn.akamai.steamstatic.com/steam/apps/1806120/ss_b713876d205f22cedf888142a533b075fe13fa96.1920x1080.jpg?t=1654762338,https://cdn.akamai.steamstatic.com/steam/apps/1806120/ss_0d8b4bbee49d66fb3e9ba1b762fbc22b32642357.1920x1080.jpg?t=1654762338,https://cdn.akamai.steamstatic.com/steam/apps/1806120/ss_7a1ad71d3349078805e8b5efc33bd49cfa242949.1920x1080.jpg?t=1654762338,https://cdn.akamai.steamstatic.com/steam/apps/1806120/ss_a5fa89aeba3bc923d60fcde062715e8d8e18de84.1920x1080.jpg?t=1654762338,https://cdn.akamai.steamstatic.com/steam/apps/1806120/ss_c3f7ef6d7a995c400514ffab36add2b9876cc32d.1920x1080.jpg?t=1654762338",
    "Slug": "serena-dark-confessions",
    "Meta Title": "Serena: Dark confessions: Mar 2, 2022, Lesson of Passion ...",
    "Meta Description": "Looking for information on Serena: Dark confessions? Check out the release date (Mar 2, 2022), developer insights from Lesson of Passion, and a complete...",
    "Alt Text Image": "Official header image for Serena: Dark confessions game - Steam 1806120",
    "Canonical URL": "https://gusku.site/game/serena-dark-confessions",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Serena: Dark confessions\", \"description\": \"Looking for information on Serena: Dark confessions? Check out the release date (Mar 2, 2022), developer insights from Lesson of Passion, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lesson of Passion\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lesson of Passion\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1806120/header.jpg?t=1654762338\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}