{
    "AppID": 405340,
    "Name": "Siegecraft Commander",
    "Release date": "Jan 16, 2017",
    "About the game": "Real-time or Turn-Based Strategy Siegecraft Commander offers a real-time strategy (RTS) single-player campaign, while providing both turn-based and RTS options for high-stakes multiplayer matches! In turn-based matches, plan the location of the towers, units and walls in your fortress to outmaneuver your foes, then tactically think and precisely aim when starting your attack! In real-time, quickly construct a base that can win the war and start an all-out offensive. Both offer easy-to-learn strategic elements combined in subtle ways to yield a rich tactical experience! Web of Control Siegecraft Commander hosts two-sided battles where each faction must destroy the other’s central base, known as a Keep. Players build a network by aiming and launching new towers from existing structures, advancing toward an enemy’s Keep while bolstering their own defenses. Let the Dominos Fall When a tower is destroyed, any descendant structures it helped create fall like dominoes. Precise aim is vital when launching TNT barrels, cluster mines and other projectiles at ground units and opposing structures; one well-placed shot can take out the majority of an opponent’s towers or units! Tower Tech Trees Every tower boasts a distinct advantage; a Barracks generates foot soldiers that advance into enemy lines, while Ballistas act as passive defenders against air-based units. Learn the pros and cons of each unit as you send them into battle and master the art of war! A Story of Intertwined Destinies Play through the stories of the Knights of Freemoi and the tribal Lizardmen. The Knights are greedy treasure hunters and the Lizardmen are led by a psychotic Shaman, yet their stories are connected in ways you might not expect. Learn the secrets of the medieval world of Siegecraft and uncover the true evil that hides within! Single-Player Campaigns Play as the Knights of Freemoi or the tribal Lizardmen. Penetrate the puzzle-like defenses of pre-designed enemy fortresses. Defend against waves of enemies using Tower Defense-like strategies, while expanding your base and destroying the unit-spawning structures. Multiplayer Matches Engage in local hot-seat or online internet multiplayer, with a selection of different optional game rules, maps, and game modes and AI bots to choose from.. Siegecraft Commander has a match-making system which groups you with 1-3 other players quickly and across compatible platforms.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/405340/header.jpg?t=1595458204",
    "Price": 19.99,
    "Developers": "Blowfish Studios",
    "Publishers": "Blowfish Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/405340/ss_4b78f7ba364e68b93389ce77f7a020036e60c93c.1920x1080.jpg?t=1595458204,https://cdn.akamai.steamstatic.com/steam/apps/405340/ss_40754d5042f1c65aa8270c86e0e3fbb18a5dd39a.1920x1080.jpg?t=1595458204,https://cdn.akamai.steamstatic.com/steam/apps/405340/ss_e89bfbe26cd3fbcb5ca4de59e1c8eb55db1cd964.1920x1080.jpg?t=1595458204,https://cdn.akamai.steamstatic.com/steam/apps/405340/ss_1d29941c0a4dcf8775490b0b3a477d44e5e9141d.1920x1080.jpg?t=1595458204,https://cdn.akamai.steamstatic.com/steam/apps/405340/ss_50a4f9eb3a97354fe65f3b96cfeabaf294bfdf24.1920x1080.jpg?t=1595458204,https://cdn.akamai.steamstatic.com/steam/apps/405340/ss_50ce66add2fd4637d3fcaf34dda530d3a5c81492.1920x1080.jpg?t=1595458204,https://cdn.akamai.steamstatic.com/steam/apps/405340/ss_45ee1a2e82e096447877b96dad244af907e9a853.1920x1080.jpg?t=1595458204,https://cdn.akamai.steamstatic.com/steam/apps/405340/ss_0bbba8ac7b90f411a6b654057fd462d280835b3b.1920x1080.jpg?t=1595458204,https://cdn.akamai.steamstatic.com/steam/apps/405340/ss_7727d3c41821a929f8f96a4ab9a3f8c2d3d1f13c.1920x1080.jpg?t=1595458204",
    "Slug": "siegecraft-commander",
    "Meta Title": "Siegecraft Commander: Jan 16, 2017, Blowfish Studios and ...",
    "Meta Description": "Looking for information on Siegecraft Commander? Check out the release date (Jan 16, 2017), developer insights from Blowfish Studios, and a complete gam...",
    "Alt Text Image": "Official header image for Siegecraft Commander game - Steam 405340",
    "Canonical URL": "https://gusku.site/game/siegecraft-commander",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Siegecraft Commander\", \"description\": \"Looking for information on Siegecraft Commander? Check out the release date (Jan 16, 2017), developer insights from Blowfish Studios, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 16, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blowfish Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blowfish Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/405340/header.jpg?t=1595458204\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}