{
    "AppID": 780390,
    "Name": "Space Bob vs. The Replicons",
    "Release date": "Sep 28, 2018",
    "About the game": "Space Bob vs. The Replicons is a procedurally generated gravity simulator that tasks the clueless Bob with figuring out how to recover loot and resources from the heart of hostile planets and haul them back into space where they can be salvaged into essential materials used for crafting and survival. As if that weren't enough, an army of replicating robot bug things have chosen this day, of all days, to start a full scale invasion, and poor old Bob is the only one who can save the day. Well he can't, because he's clueless, but we haven't got much choice. Gameplay The core gameplay mechanic, other than shooting bugs and running around in panic, revolves around the use of a multi-functional grappling gun that can stick anything to anything. It can stick loot to Bob, loot to loot, loot to Bob's lander, loot to the ceiling, loot to enemies, enemies to walls, enemies to enemies, enemies to bombs....well you get the idea. It can stick random stuff to other random stuff in so many endless ways that you'll never stop figuring out new ways to solve the torrent of emergent gameplay situations. Oh, and if you think Bob is a stupid name for a game hero, well that's just rude, and it's no worse than the name of his AI companion or better yet the mysterious all powerful being behind all the multiverse and time travelling shenanigans. Oh yeah, time travelling is a thing too; we forgot to mention that. Hmmm, never mind, you've already got enough to worry about. Rogue-like or Survival? There are two distinct game modes to choose from. Both are completely open-world and both have a combination of Rogue-like and survival elements. With that said, the game is neither a Rogue-like nor a survival game. It's a little bit of both and a whole lot of something completely new. Invasion Mode: First there's 'Invasion Mode' which is the original story driven game mode with permadeath and a few other Rogue-lite elements. Games generally last from one to three hours on average but the entire story line will take multiple games to complete. This game mode can be a serious challenge and is infinitely replayable by design. Everything seems to be out to kill Bob in one way or another and that's because, well, it is. Death comes frequently but, with a little experience, you'll soon be cranking up the difficulty slider (which increases the score multiplier) in order to get the top spots on the leaderboards. Survival Mode: Then we have 'Survival Mode'. In most games, survival mode is the hardcore mode but in this one it's the easier of the two options. Here the name of the game is surviving for as long as possible and everything in the game is tweaked to make things more survivable than in Invasion mode. For example, the Replicons invade much more slowly and in smaller numbers, loot respawns over time, it's far more sandboxey in nature with a single overall goal - that can be achieved however you like - and, although it's still permadeath, there's a teleporter that can automatically save Bob from death as long as he has enough resources to power it. Survival mode can potentially last for tens of hours and is geared more towards players who like to explore, relax, test things out, and not worry too much about objectives or time constraints. It's still a challenge, especially at the higher difficulty settings, but it's a much more laid back experience overall. Leaderboards: Both game modes have two score based leaderboards. One for the highest score achieved in a single game, and one for the highest combined score achieved over multiple consecutive games without dying. The May 2022 update brought with it two brand new leaderboards for speedrunning. There's a quick and easy one that most players can get involved with, and another for those who manage to complete the entire game. Technology The game may initially appear to use traditional 2D sprites, or vectors, but instead uses polygons to model every object, planet, and blade of grass. This allows for incredible performance, even on low end hardware, but also the ability to seamlessly zoom from viewing an entire planet down to those individual blades of grass without any visible pixelation. At the start of each game a new system of planets is generated, each remixed and respawned with different resources and loot to create an open-world experience where no two games are ever alike. Good luck, Bob. You've got this! ____________________________ Trailer Music by Antti Luode. Full game soundtrack by Antii Luode.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/780390/header.jpg?t=1656490655",
    "Price": 14.99,
    "Developers": "Intravenous Software",
    "Publishers": "Independent",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_ea20676a49750f4b7d6152eb2308f9c3fb08300f.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_8419e09af0d3e70bfb17b075cf2cdf9e1d99b3d7.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_a76cb5a2a8146c16fc6ca8d955ae08fa6fbebbcf.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_b6f63c4dc2e75852bf57cb02d37e19ae310aefa0.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_d239e57da9146c4a3b001de1dd713854e73e648e.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_9eaf61df3edbf8e79cbd3db210b73225199369c0.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_c64f7ec8baf0aa0c0154760e38a573059bdcff5a.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_3df650007e44231c24ce89d6dca7f7e41b40e085.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_7699354575c50e7028b3be72f259c92d0f8e3e00.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_5b303d103e2ce03034d01bb82785a58527185f03.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_8d23a3de80591301f5f8686a1babaafdaad51d11.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_c73365fcb40b499d5cefed68a75140e89514557a.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_2469e180fae449c71ed5256e8d20c303333e49b7.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_54ef2620e9ac29edae403c9a0b8206eaf6e0effb.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_e4cdb14ffbc9ea22f4d99e6d91229522de345885.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_e819d1e9ac805829a879373c04d07e2cf92546fb.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_8ae823cd5a077cf006b2c29819215c3c7c30560f.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_4a931f4ffa24e8817dcd9bbe3a649dd2601f8f89.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_0e8fea3e216f27b36f93e396691a37438cd2c1e1.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_40c27fa7fa3be1a626ca17ef99c695e88d7f0c32.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_46a39a8e3db92ec02385a608d9891ad29f2e076e.1920x1080.jpg?t=1656490655,https://cdn.akamai.steamstatic.com/steam/apps/780390/ss_241662c20539f633452640a4569a2f53e9fd53b9.1920x1080.jpg?t=1656490655",
    "Slug": "space-bob-vs-the-replicons",
    "Meta Title": "Space Bob vs. The Replicons: Sep 28, 2018, Intravenous So...",
    "Meta Description": "Looking for information on Space Bob vs. The Replicons? Check out the release date (Sep 28, 2018), developer insights from Intravenous Software, and a c...",
    "Alt Text Image": "Official header image for Space Bob vs. The Replicons game - Steam 780390",
    "Canonical URL": "https://gusku.site/game/space-bob-vs-the-replicons",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Space Bob vs. The Replicons\", \"description\": \"Looking for information on Space Bob vs. The Replicons? Check out the release date (Sep 28, 2018), developer insights from Intravenous Software, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 28, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Intravenous Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Independent\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/780390/header.jpg?t=1656490655\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}