{
    "AppID": 1298010,
    "Name": "Tactical Combat Department",
    "Release date": "Apr 28, 2022",
    "About the game": "Tactical Combat Department is a tactical turn-based strategy game inspired by Swat games. You command a special intervention squad that intervenes in various situations and environments. Features • The game is inspired by Swat games with turn based tactics • Turn base action with classic action points • Random generated position of enemies • You can arrest suspects or civilians • Psychology and morale • Realistic fog of war based on unit's field of view • Support for monitors with ultrawide screen Top down or 3D View Psychology Civilians and armed suspects have certain morale and react to the stimuli around them. With the help of voice pressure, it is possible to force the opponent to cooperate. However, this may not be enough for long distances. Some give up easily; some do not. In case of failure, it is possible to use other options such as Pepper spray or blinding grenade. Fight tactics and breaking the door Choose from an intense dynamic action such as blasting the door or kicking them in. In this case, however, you can face opponents from the outside but also the inside. In many situations, therefore, a quiet action is more appropriate, like a slow opening of the door using a handle, the use of silent variants of weapons, etc. Before entering the room, it is recommended to use a camera to check the number and location of suspects. The door can be opened in many ways, such as slowly opening the door, kicking it out or using explosives, etc. Some doors may be locked. Then it is necessary to use a unique multifunction tool to open it. It is a good idea to be safe using a Flashbang grenade before entering. It is advisable to continually guard access to the room and cover the space and corners as well. It is also advisable not to shatter the team too much and rely on yourself more. It is ideal for moving forward considering the protection of the lives of civilians, armed suspects and, of course, members of your team. Fog of war You only see what your team members see. You have to proceed carefully from door to door, covering corners and unprotected places to prevent a surprise attack of the enemy. Because the design of the levels is not predictable or not know in advance, surveying the area goes step by step. Set up the rules It is essential to set up the rules as soon as possible and to secure all suspects and civilians. An unsecured opponent is still a threat, and if one does not pay attention, he may try to escape or attack suddenly. Chaos on the battlefield increases the risk of injury to team members or civilians. Civilians can panic and scatter around. Shooting system The shooting system is based on the trajectory of the projectiles, considering the experience of the unit and the accuracy of the weapon. The higher the distance, the greater the chance that the enemy or your unit will also hit people around. These risks have to be considered based on the unit's experience. Some materials can be shot through. Ragdoll physics and animations from motion capture All characters has implemented Ragdoll physics. Animations are combined with data from motion capturing. Ai Opponents move around the area based on their judgment. At the beginning of each level, their position is randomly generated, so it is necessary to proceed carefully and tactically each time. They respond to loud sounds and follow what they see. If a threat occurs, they also let their colleagues know the information for being cautious and within a specific range. If attacked, they then try to hide behind the nearest obstacles.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1298010/header.jpg?t=1651153470",
    "Price": 9.74,
    "Developers": "LukasH",
    "Publishers": "Render System",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_c425194bfad6d39fbbcec7317f2a67f07efb7381.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_908bf679ba1aafae3453c173250e68d603c84fca.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_7f1d3129cc60c3ee88a1b9c2204067ea7afe615a.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_ca22d5a97b2011f4eb0146a8d17d5d45aa306e0b.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_9ebf8db82a2d1ae21d9c5c7e383e9f1927a3081b.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_6fe3fa951fb666af2e637e25220ef16f96ae5f61.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_c2e6524b60756b992211ea4d402653b548ba9f72.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_76c59ce4ae1e6b0427ae0e68aeaa92f9242b6265.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_be27da4287c0a650cc164a84c617ef2227bc4aa8.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_c488c96cf0e0e649d5ad4fac204c152456df6ac8.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_56b7c00fbd2a47a63976184318fe2a5ecea7eb7d.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_94bfffaeb350a41e770a13c1eaf05f227fa48e70.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_e81bb0137a0dd874ccde029d621dfcc26e71b989.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_091acfa35f116c8ee98b839ddefc7c1a9a687bb7.1920x1080.jpg?t=1651153470,https://cdn.akamai.steamstatic.com/steam/apps/1298010/ss_3cadc20134112e4f272ba9d3732d19de2add6084.1920x1080.jpg?t=1651153470",
    "Slug": "tactical-combat-department",
    "Meta Title": "Tactical Combat Department: Apr 28, 2022, LukasH and Full...",
    "Meta Description": "Looking for information on Tactical Combat Department? Check out the release date (Apr 28, 2022), developer insights from LukasH, and a complete game su...",
    "Alt Text Image": "Official header image for Tactical Combat Department game - Steam 1298010",
    "Canonical URL": "https://gusku.site/game/tactical-combat-department",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tactical Combat Department\", \"description\": \"Looking for information on Tactical Combat Department? Check out the release date (Apr 28, 2022), developer insights from LukasH, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"LukasH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Render System\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1298010/header.jpg?t=1651153470\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.74, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}