{
    "AppID": 1207210,
    "Name": "The foreigner",
    "Release date": "Feb 5, 2020",
    "About the game": "* this description is taken from the translation machine. Please understand if the translation is not accurate This game story is pure fiction, and in reality any countries, regions, groups, individuals, organizations have no relationship, please do not match The English version now available If the game interface is unnormal, please quit the game and restart the game click “设置” botton and select 'English' [About] * this is an AVG type electronic novel game * the full text is about 30,000 words * full time is about one hour * full character dubbing * single story * just one mouse * no need for full Internet access -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- [Story] 'Is there really a heaven on this earth?' Anyone who can ask that question must be hopelessly stupid Young people suffering from displacement and fewer are traveling abroad. The encounter of a female accident, let the heart of the teenager that shakes originally again ripples Is there really a heaven, will the youth's heart get his answer -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- [Cast] Jade Ye: 雪姨 Fang shuyang: 菊花花 Stone Ye: 清水L浊流 dad：wing羽潇 mom：紫苏九月 and：闲踏梧桐 　　　叮当凤儿 　　　喵杏仁 　　　鹿喑kana 　　　考拉桑（deceased） 　　　苹果酱 　　　子晰 　　　北村 　　　小火柴 　　　赤岩 　　　DK 　　　黄小邪 　　　小荼 　　　GavinCosmo about the late singer 考拉桑: The production team had already identified a role for 考拉桑 and assigned him tasks, but soon after the news came that 考拉桑 had died. The production team intended to use the received material to remedy the problem, but the received material was watermarked and could not be used. Therefore, there was no actual performance of 考拉桑 in this work. However, in order to pray for the blessing and leave a place for it, the position of 考拉桑 in the voice actor list was reserved, and the agreement of the voice actor was obtained later. I hope all players and fans of 考拉桑 understand. [Staff] Producer: 囧Z Co-Producer: 囧Z, 白银奔雷, 闲踏梧桐 Director: 囧Z Original story: 囧Z Script: 囧Z, 白银奔雷, 伍狗狗 Program: 囧Z Program support : Sliots character design: 千 Scene design: KiTA, 白银奔雷, 阿团 UI design: dills Dubbing contact: 闲踏梧桐 Audio director: 囧Z Voice editor: 囧Z Original music: 跟弃 Hardcore police: 白银奔雷, RusherJe Source: Mr. X, who did not wish to be named multifunctional peon: 囧Z Warning: This game is not suitable for children or those who are easily disturbed. this game contains vulgar language, violence, blood, nudity and sexual content Thanks to all the members involved in the production of this game for their support Special thanks to 祈Inory and sanae樣 the 2 dalaos for helping us out when the game production was in crisis about us Hi, everyone, we are poor enough to wear pants, but we don't expect this thing to make any money. HCGstudio This is our first work, there may be a lot of unsatisfactory, but with the efforts of all members of the production team and god's favor, we finally present the finished product in front of you I hope you will enjoy it and give us your valuable comments and Suggestions weibo : @HCGstudio-我们真的是做黄油的 Game communication, BUG feedback, online game， multifunctional QQ group: 9906270",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1207210/header.jpg?t=1588772827",
    "Price": 0.99,
    "Developers": "HCGstudio",
    "Publishers": "HCGstudio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1207210/ss_1786251b9da85dff2617f8b4ec32ccb885b2ec53.1920x1080.jpg?t=1588772827,https://cdn.akamai.steamstatic.com/steam/apps/1207210/ss_6e7fa264d4ff51f6801ef702af771a39ed0ba8ee.1920x1080.jpg?t=1588772827,https://cdn.akamai.steamstatic.com/steam/apps/1207210/ss_839e02ab157e88a26568d51695cb28c52c99f9bb.1920x1080.jpg?t=1588772827,https://cdn.akamai.steamstatic.com/steam/apps/1207210/ss_a89c1d4693f8ee81be7c91ba92d3f8b905fb9081.1920x1080.jpg?t=1588772827,https://cdn.akamai.steamstatic.com/steam/apps/1207210/ss_e3b462cbfe20292b430d1c7fc481c1d52e38fd75.1920x1080.jpg?t=1588772827,https://cdn.akamai.steamstatic.com/steam/apps/1207210/ss_9329d0c8c0d5b0868661e2e40df779361d75ea4e.1920x1080.jpg?t=1588772827",
    "Slug": "the-foreigner",
    "Meta Title": "The foreigner: Feb 5, 2020, HCGstudio and Full Overview",
    "Meta Description": "Looking for information on The foreigner? Check out the release date (Feb 5, 2020), developer insights from HCGstudio, and a complete game summary.",
    "Alt Text Image": "Official header image for The foreigner game - Steam 1207210",
    "Canonical URL": "https://gusku.site/game/the-foreigner",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The foreigner\", \"description\": \"Looking for information on The foreigner? Check out the release date (Feb 5, 2020), developer insights from HCGstudio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"HCGstudio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HCGstudio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1207210/header.jpg?t=1588772827\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}