{
    "AppID": 1762840,
    "Name": "The Last Cell",
    "Release date": "Nov 12, 2021",
    "About the game": "Everything was gone ... I was the last cell left in the world, all the joys and goodness we knew had been forgotten. Of all our possessions, all that was left was the hope of good days. The Last Cell is a 2D Platformer game set in apocalyptic space. You control a cell that is a rare species born of the white blood cell generation. Dangerous diseases have invaded the world and all the white blood cells and the vaccines made against them have failed, and the only hope left is the last green white blood cell, which was ridiculed every day for being different from the others and making it useless. they knew How to tell a story At the beginning of the game you do not read, hear or see any story You are the creator of the events and story of the game and with the decisions and circumstances that determine the fate of the game world and based on your choices during the adventure game that you started will end. Gameplay There are various enemies in the game environment that you have to act quickly to eliminate them, and the attack speed of the game's enemies may cause you to lose your focus in dealing with other obstacles and lose. There are also various weapons in the game that you can destroy your enemies with more power, of course, you have limited arrows in your weapons ... but as a different cell within you have arrows that you can shoot without restrictions. Shoot your enemies Batteries have been installed in the game environment that, if you get them, will prevent you from running out of energy. If you run out of energy completely, it will return to the last point where the game is saved. At the end of each stage, there is a gate for your teleportation to the next stage, to open it, you must find the five diamonds in the same stage to open the entrance gate to the next stage. Of course, it is not very difficult to find batteries and diamonds in the early stages, but it is not easy to find them in the later stages, and if you cannot find them, you will be imprisoned there. The game is automatically saved in different locations and if you lose, the game is loaded from the last saved location. Graphics and game design The design of the elements of the environment and the general atmosphere of each season will be completely different from the previous season. In the first season, you are on the outskirts of the city, and this is the last point of hope. Give back because everyone hopes for you and you should not disappoint the city. Of course, this is not the end of the game, because viruses are always thinking of taking revenge on you in the coming seasons, and you must destroy all their families by teleporting them to strange and unknown places in order to succeed in this threat from the beautiful world forever. Keep away",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1762840/header.jpg?t=1636741509",
    "Price": 10.99,
    "Developers": "Igame",
    "Publishers": "Igame",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1762840/ss_242c28d69d7c7a89cfe592140450827070fe8543.1920x1080.jpg?t=1636741509,https://cdn.akamai.steamstatic.com/steam/apps/1762840/ss_fb18ed30401e7a3ad5a0a0c17b764d85abd2cf73.1920x1080.jpg?t=1636741509,https://cdn.akamai.steamstatic.com/steam/apps/1762840/ss_ea35421602d05b38fcdca683ce0ac37e483163ad.1920x1080.jpg?t=1636741509,https://cdn.akamai.steamstatic.com/steam/apps/1762840/ss_089b77b93d1a7470310adda01e8ec2fe48df4831.1920x1080.jpg?t=1636741509,https://cdn.akamai.steamstatic.com/steam/apps/1762840/ss_3e7f6faa42a9d7461477f8e276bf8966fe795baf.1920x1080.jpg?t=1636741509",
    "Slug": "the-last-cell",
    "Meta Title": "The Last Cell: Nov 12, 2021, Igame and Full Overview",
    "Meta Description": "Looking for information on The Last Cell? Check out the release date (Nov 12, 2021), developer insights from Igame, and a complete game summary.",
    "Alt Text Image": "Official header image for The Last Cell game - Steam 1762840",
    "Canonical URL": "https://gusku.site/game/the-last-cell",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Last Cell\", \"description\": \"Looking for information on The Last Cell? Check out the release date (Nov 12, 2021), developer insights from Igame, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Igame\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Igame\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1762840/header.jpg?t=1636741509\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}