{
    "AppID": 1073790,
    "Name": "The Astrolarix",
    "Release date": "May 16, 2019",
    "About the game": "The Astrolarix is a solitary starship that navigates in the vacuum of space, you must survive at all costs, gather resources, face adversity avoiding the dangers and overcome the obstacles to progress in the story. This is an isometric adventure with survival elements: Water, food, oxygen and HP. Keeping optimum levels at all costs is a priority if you want to get out safe. Search for containers as well as the different devices on the ship to get supply and useful items. Finding the route in the darkness will not be a problem if you have a good sense of direction, once you understand the areas you will become an expert. The ship's resources are finite so you must administer them well, at all costs. Special Features * This game allows you to change languages while playing and instantly, without having to restart the game, you can do it from the main menu or in the title screen menu. * It Has An Extra Mini Game: Survival. This mini game is all about evading asteroids and beat your previous record, then you can receive something useful for the main campaign. This mode will be automatically unlocked while you progress on the story. * The game comes in three modalities of challenge: Normal, Difficult and Expert. * It has narrative elements, especially in the cut scenes and the final documents that tell the story of the ship. About the Gameplay The gameplay is based on interfaces and getting items to survive while you go moving through maps by dodging what might be called a maze game, all in an isometric view with an original pixel art style. The duration of the game is variable depending on how good you are: an average of 3 to 5 hours in the Normal difficulty is expected for the first try, and you can SpeedRun it to approach your best time (that is showcased in the general data on the title menu). Audience Due to the complexity of some terms as well as certain dramatic situations, the estimated age rating is +12. For Gamers who want an indie and retro adventure game on a mysterious spacecraft with pixel-by-pixel graphics, simple gameplay and a different approach style, discover and survive aboard the Astrolarix. Defining Considerations * The Game Is Dedicated to A Linear Progress. * There is no combat system as such; it is more dedicated to going around evading obstacles and solving riddles to scape certain areas. * Is a game made in RPG MAKER MV but is completely personalized, music, ambient sounds, interfaces, characters and everything else. * It does not have replayability, once you finish the main story and you have unlocked the documents of the game there is nothing more to do. Except if you want to try it again in a greater difficulty, in that case, you will have fewer resources and the enemies will do more damage. You can use the Delete data section to restart your progress from the title menu.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1073790/header.jpg?t=1605593980",
    "Price": 2.99,
    "Developers": "Artificer Creator",
    "Publishers": "Artificer Creator",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1073790/ss_48641576a5c3518dcc47acab26f07fbcc60712c5.1920x1080.jpg?t=1605593980,https://cdn.akamai.steamstatic.com/steam/apps/1073790/ss_10eb2f92c17f2230295de1940b262e44d1cfe26b.1920x1080.jpg?t=1605593980,https://cdn.akamai.steamstatic.com/steam/apps/1073790/ss_df935d90005597967dde8093305eb6f3d4cb0949.1920x1080.jpg?t=1605593980,https://cdn.akamai.steamstatic.com/steam/apps/1073790/ss_3e8aec306751907e1083cffbad227d4aa77f69ba.1920x1080.jpg?t=1605593980,https://cdn.akamai.steamstatic.com/steam/apps/1073790/ss_9904c07da237f906de0443b052eeb825cf9256b0.1920x1080.jpg?t=1605593980,https://cdn.akamai.steamstatic.com/steam/apps/1073790/ss_023ce004780a153d261353bef20d7684cc205d91.1920x1080.jpg?t=1605593980,https://cdn.akamai.steamstatic.com/steam/apps/1073790/ss_51d78348415ab2947b0758746904713f689db9e2.1920x1080.jpg?t=1605593980,https://cdn.akamai.steamstatic.com/steam/apps/1073790/ss_f14ba92a7f5624140a5eb921f7236ce6200e3fb4.1920x1080.jpg?t=1605593980",
    "Slug": "the-astrolarix",
    "Meta Title": "The Astrolarix: May 16, 2019, Artificer Creator and Full ...",
    "Meta Description": "Looking for information on The Astrolarix? Check out the release date (May 16, 2019), developer insights from Artificer Creator, and a complete game sum...",
    "Alt Text Image": "Official header image for The Astrolarix game - Steam 1073790",
    "Canonical URL": "https://gusku.site/game/the-astrolarix",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Astrolarix\", \"description\": \"Looking for information on The Astrolarix? Check out the release date (May 16, 2019), developer insights from Artificer Creator, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 16, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Artificer Creator\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Artificer Creator\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1073790/header.jpg?t=1605593980\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}