{
    "AppID": 1603300,
    "Name": "Timothy Leary's Mind Mirror",
    "Release date": "Sep 2, 2021",
    "About the game": "Timothy Leary Wants to Take You on a Mind Adventure From the mind of Dr. Timothy Leary comes Mind Mirror, a trippy journey through your own mind. Mind Mirror is not just a game, it is a valuable tool to help you explore your own mind, make decisions, and to envision your ideal self. Play it by yourself or with a group of people to learn more about yourself and others. Mind Mirror is a fun and nostalgic blast from the 80s, while still serving as a useful tool for self-reflection and exploring your own personality! No matter what, we guarantee that Mind Mirror will be unlike any game you have ever played! About Dr. Timothy Leary Dr. Timothy Leary was a legendary and controversial psychologist, author, revolutionary thinker, and pop icon mostly known for his experimentation with LSD and other psychedelic drugs. What many people don't know is that Dr. Leary was a serious researcher, educator, and thinker. In the 80s, Dr. Leary had moved on to exploring cyberculture and the potential of computers and digital technology for the examination of personality and to expand the mind. Out of the many ideas Dr. Leary had for software, Mind Mirror is the only completed product. 'I think of this game as a thought processor, headware for the computer generation. It allows you to interface with virtually any concept of personality, and helps put your thoughts into digital form. Try playing with your friends or loved ones. Gather around the firelight of the computer, and the chances are that you'll learn more about them in 5 minutes than you ever thought would be possible in a lifetime' --Dr. Timothy Leary From the Original Mind Mirror Packaging Tune In, Turn On, Boot Up Mind Mirror is an innovative, dynamic game bringing a whole concept to 'personality' software. Written by Dr. Timothy Leary, famous Harvard psychologist, author, and lecturer, Mind Mirror combines the science of Leary's psychometric studies with his own inimitable wit and charm. Part tool, part game, and part philosopher on a disk, Mind Mirror is a provocative game perfect for parties or social gatherings. The Rating Games Rate any person, place, or concept with the numeric rating scales. Mind Mirror evaluates your ratings, gives you a brief text analysis, and plots your input on comparison charts called Mind Maps. You can even use the ratings scales to create your own characters and personalities. Try comparing yourself to your ideal self, yourself to a friend or loved one, even Reagan to Gorbachev. Be creative, have a partner rate you while you rate yourself ... you'll be surprised at the differences. Mind Play &amp; Mind Tools You can play the game using either Mind Play or Mind Tools. In Mind Play, applications are ligh-hearted, allowing you to explore topics and celebrities from areas like T.V., films, athletics, and more. In Mind Tools, applications are somewhat more serious, focusing on Psychological Insight, Career Productivity, and Education. Life Simulations Life Simulations gives you the opportunity to take any of the subjects of personalities used in the rating games on humorous, interactive text odysseys written by Dr. Leary. You can play dozens of different life simulations in any of four psychological realms. For example, enter the realm of emotional insight and go back to kindergarten to face the class bully. Or try the realm of social interaction and spend an evening in a punk rock bar or a snooty bankers club.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1603300/header.jpg?t=1630588929",
    "Price": 5.99,
    "Developers": "Futique, Inc.",
    "Publishers": "Moon Books LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1603300/ss_4e0ddaeb874aefd037c23ed4cc9b0e839d3f2c39.1920x1080.jpg?t=1630588929,https://cdn.akamai.steamstatic.com/steam/apps/1603300/ss_7e22617f439f71fccc616cffe07da074e365d835.1920x1080.jpg?t=1630588929,https://cdn.akamai.steamstatic.com/steam/apps/1603300/ss_162565d1a8f22190a403542ea4fc8251a0014cfd.1920x1080.jpg?t=1630588929,https://cdn.akamai.steamstatic.com/steam/apps/1603300/ss_8f958f114980553e3d05d4b315436b58c7b337f1.1920x1080.jpg?t=1630588929,https://cdn.akamai.steamstatic.com/steam/apps/1603300/ss_4182ef69ae5ef086d5a1d8918b61b2d3cd6c1044.1920x1080.jpg?t=1630588929",
    "Slug": "timothy-leary-s-mind-mirror",
    "Meta Title": "Timothy Leary's Mind Mirror: Sep 2, 2021, Futique, Inc. a...",
    "Meta Description": "Looking for information on Timothy Leary's Mind Mirror? Check out the release date (Sep 2, 2021), developer insights from Futique, Inc., and a complete ...",
    "Alt Text Image": "Official header image for Timothy Leary's Mind Mirror game - Steam 1603300",
    "Canonical URL": "https://gusku.site/game/timothy-leary-s-mind-mirror",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Timothy Leary's Mind Mirror\", \"description\": \"Looking for information on Timothy Leary's Mind Mirror? Check out the release date (Sep 2, 2021), developer insights from Futique, Inc., and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Futique, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Moon Books LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1603300/header.jpg?t=1630588929\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}