{
    "AppID": 1148810,
    "Name": "Tip of the Spear: Task Force Elite",
    "Release date": "Dec 18, 2019",
    "About the game": "No kill streaks. No pay to win. No random spawns. No BS. Just FPS. Competitive, objective-oriented gameplay, featuring three layers of anti-cheat including EQU8 Tip of the Spear: Task Force Elite is an online multiplayer shooter with competitive gameplay inspired by military FPS titles from the late 1990s and early 2000s. Nostalgic gameplay upgraded to 2021, featuring an unique blend of run-and-gun gameplay and a fast time to kill, players wage war across Middle Eastern streets, Arctic bases, underground tunnels and rolling terrains up to 6 square miles (16 square kilometers) Storm a casino, raid tunnels, siege a bank, and secure an abandoned airfield. Join one of the clans already on the game and play competitive matches or casually with your friends, in one of the many public servers, in your own clan server or start your own! Clan matches are played every weekend and the first tournament, community organized, is ongoing. 22 Maps available and more on the way: Levels feature designated enemy spawn points, ensuring the opposing team never randomly spawns behind players. Re-enlist for classic game modes, including Team King of the Hill (TKOTH), Team Deathmatch (TDM), Capture the Flag (CTF), and Deathmatch (DM), with additional game modes (including PvE/coop) in active development. Engage in close quarters urban combat, or rain fire from above in AI-controlled helicopters that you can command! Team King of the Hill (TKOTH): In TKOTH, two teams spawn at opposite ends of the map and capture Outposts along the way to the center objective. Control the zone in the objective area to crown your team as the King of the Hill! Capture the Flag (CTF): Venture into enemy territory in CTF to pick up an enemy flag and return it to the flag bay at your team's base. Some flags may even be in the enemy team's camp! Can your team survive the trip the lion's den and make it out to tell the tale? Team Deathmatch (TDM): The iconic TDM game mode features a unique twist with Outposts, which are spread across the map to enable your team new locations to spawn on. Capture all Outposts to control the map and rack up more kills than the enemy team! Deathmatch/Free-for-All (DM): It's a free-for-all in the classic Deathmatch game mode! Tip of the Spear's classic FPS gameplay shines bright in this purist FPS environment. Fight your way into the top 3! Notable Features: Run-and-gun infantry FPS gameplay Proprietary netcode for low ping action. (ie: American players can play versus European players with very acceptable speed and vice-versa) Board AI-controlled helicopters with preset paths and command the AI pilot: rain bullets from above, or attempt a daring rooftop insertion Gameplay inspired by classic military FPS titles from the late 1990s and early 2000s upgraded to 2021 standards. Designated bases prevent enemies from randomly spawning behind players Four game modes: Team Deathmach, Team King of the Hill, Capture the Flag, and Deathmatch (more in development, including coop/PvE) 22 maps featuring a mix of close quarters combat and terrain-based warfare (more maps and a community map editor in development) No Gated Content Free Support &amp; Updates Competitive gameplay designed for clan battles Host your own server with your own rules, favorite maps and weapon selections through a proprietary server manager tool available on Steam Tools or through official server partner 4NETPlayers.com Planned support for Steam Workshop for community levels and Mod Support Features in development for Early Access are subject to change. Weapons available Available on Steam Library &gt; Tools (for free) Host your own server(s) with your own rules. Ban weapons, select maps, force map rotation or allow map vote. Set banned words, ban or kick players, start a match, host a private password-protected server, and much more through our Proprietary server tool. Join our official discord server: ====================== PATCH NOTES ====================== See / for a historical list of patch notes.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1148810/header.jpg?t=1621061809",
    "Price": 9.99,
    "Developers": "Red Jake Studios, LLC",
    "Publishers": "Red Jake Studios, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_7a8e5a532b5950060a826960469a23da3bf9c74c.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_09f43d75b584aed892094331ac8d05fea58be368.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_8e99b39f18042b5487092f7fe050811a1faa4ef9.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_867aeb6983c942a52f8716c4b0a93ed6c3ced15e.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_306bfac04f4a42650002cd7c79a8b30c6a113ed4.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_7e5307fbc22cd9fdbccb57a8d68957ac548d859e.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_cfe311e0b69120e261f000ee0c58dd4a3ce3a720.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_97f68aad57a40e40bfb77c396dd5044fdf2d5bc9.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_a8f53faea64194897be78432569a3dc7ff37eedc.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_57164517b9a96787c11c41ab0523dbc0ad666ae2.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_eb15a17b07ad7e5821ccbc4d17efb2579a7051cb.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_2b0c688cfddd13b6c34d4ee10d1477e12af9e311.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_0d2a9e589e5d141d6e9a7cbb042983ed336c1bbd.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_dd5f5a7777265f2e5ddc505a02eca649ad3c90fa.1920x1080.jpg?t=1621061809,https://cdn.akamai.steamstatic.com/steam/apps/1148810/ss_00d4b64257881b59f6106b53ee968478e5fe0edf.1920x1080.jpg?t=1621061809",
    "Slug": "tip-of-the-spear-task-force-elite",
    "Meta Title": "Tip of the Spear: Task Force Elite: Dec 18, 2019, Red Jak...",
    "Meta Description": "Looking for information on Tip of the Spear: Task Force Elite? Check out the release date (Dec 18, 2019), developer insights from Red Jake Studios, LLC,...",
    "Alt Text Image": "Official header image for Tip of the Spear: Task Force Elite game - Steam 1148810",
    "Canonical URL": "https://gusku.site/game/tip-of-the-spear-task-force-elite",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tip of the Spear: Task Force Elite\", \"description\": \"Looking for information on Tip of the Spear: Task Force Elite? Check out the release date (Dec 18, 2019), developer insights from Red Jake Studios, LLC,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 18, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Red Jake Studios, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Red Jake Studios, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1148810/header.jpg?t=1621061809\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}