{
    "AppID": 1369390,
    "Name": "Tome Rush",
    "Release date": "Oct 5, 2020",
    "About the game": "After decades of study and practice, you've shed your mortal body to become an eternal guiding voice for other wizards. With a cataclysmic threat on the horizon, grow and guide a team to collect powerful tomes before they fall in the hands of an evil organization! Grow your team! Tome Rush is about building an effective team of wizards capable of taking on any randomly generated mission. You start with a team of three wizards without any magic specialty, but wizards can grow in three meaningful ways: Type of Magic: Wizards decide on three types of magic they're interested in, you choose one of those three for them. All spells they learn will be from this type of magic. Spell Choice: Each time a wizard levels up, they will decide four spells they're interested in, you choose one for them. Compatibility Choice: At levels two, four, and six, a wizard gains compatibility with other wizards of a certain magic type. Compatibility unlocks the ability to go on missions with other wizards! As with choosing their own specialty, they will decide on three types, you choose the one that works best for your team! As you complete missions, you'll recruit more wizards capable of the same methods of growth! Send the right wizard for the job! Mission sites can have varying objectives that require certain strengths. Sometimes you'll need a wizard to wipe out enemies. Sometimes you'll need a wizard that can explore a dungeon and collect artifacts with ease. As your wizards gain experience, learn spells, and learn to team up with other wizards, make sure you recognize their strengths and weaknesses! Every mission is a risk! Missions can be unpredictable. If ill-prepared, wizards will die. There's no way to bring them back. Only by building a well balanced and cooperative team can you maximize your chances of success! Once a mission starts, the result is out of your control so make sure the wizard or wizards you send are up to the task! Collect powerful Tomes! Forces of evil are collecting tomes that will assist them in dominating the world. If you can secure these tomes, you'll drastically weaken them! Sometimes these tomes will show up at mission sites, send your best and brightest wizards to retrieve them. Once you or your enemy collect all five tomes, be prepared for a challenging final mission! Discover more spells as you play! Tome Rush features seven types of magic each with over 25 spells, but each wizard can only only learn seven spells! Carefully consider what each of your wizards can accomplish and choose their spells accordingly! With proper planning, strategy, and a little bit of luck, this simple wizard management game turns into a challenging blend of Solitaire and deck building! Can you form a capable and cohesive team of experienced wizards in time before a final showdown?!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1369390/header.jpg?t=1601916266",
    "Price": 1.99,
    "Developers": "JC Tinkers",
    "Publishers": "JC Tinkers",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1369390/ss_80b0bdc8a7dea56fa82d79e21f09f155dc98ca94.1920x1080.jpg?t=1601916266,https://cdn.akamai.steamstatic.com/steam/apps/1369390/ss_78dc07e4464dd703debcf5b868ff7e01daa9c2b0.1920x1080.jpg?t=1601916266,https://cdn.akamai.steamstatic.com/steam/apps/1369390/ss_3f9153e6a852749274a171359ae0639fe550c010.1920x1080.jpg?t=1601916266,https://cdn.akamai.steamstatic.com/steam/apps/1369390/ss_74559c7304222e6a4b6df46a614166b3e07f56c6.1920x1080.jpg?t=1601916266,https://cdn.akamai.steamstatic.com/steam/apps/1369390/ss_c4261e1035a99619aa9595e4efbfa614f3705bd0.1920x1080.jpg?t=1601916266",
    "Slug": "tome-rush",
    "Meta Title": "Tome Rush: Oct 5, 2020, JC Tinkers and Full Overview",
    "Meta Description": "Looking for information on Tome Rush? Check out the release date (Oct 5, 2020), developer insights from JC Tinkers, and a complete game summary.",
    "Alt Text Image": "Official header image for Tome Rush game - Steam 1369390",
    "Canonical URL": "https://gusku.site/game/tome-rush",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tome Rush\", \"description\": \"Looking for information on Tome Rush? Check out the release date (Oct 5, 2020), developer insights from JC Tinkers, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"JC Tinkers\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JC Tinkers\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1369390/header.jpg?t=1601916266\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}