{
    "AppID": 222606,
    "Name": "Train Simulator: Pacific Surfliner® LA - San Diego Route",
    "Release date": "Oct 17, 2013",
    "About the game": "It’s not all beaches and surfing in California – the stunning Pacific Surfliner® LA – San Diego route for Train Simulator takes you through some of the US state’s most stunning scenery, past golden beaches and into sprawling cityscapes. The 128 mile route between California’s two largest cities first saw Pacific Surfliner® services in 2000, and today carries more than 2.8 million passengers annually. Amtrak, Metrolink and Coaster services can be seen regularly on the route, which also hosts a varied mix of passenger and freight operations. Starting out in downtown Los Angeles, Pacific Surfliner® services depart the art deco Union Station before heading into the city’s commercial district and extensive freight yards, heavy with intermodal traffic both day and night. After Fullerton (a well-known spot for railfans), the line passes the imposing Angel Stadium, home to Major League Baseball’s Los Angeles Angels of Anaheim. Many of the stations along the route are unique in style, including San Juan Capistrano, most notable for its central basilica forming part of the station building and level crossing that traverses the platform itself. Heading south, the route runs single track from San Clemente Pier, and at the same time hits the golden coast of California - the stunning beaches and spectacular sunsets are just a small part of the appeal of this beautiful route. As the route heads inland at Sorrento Valley, trains climb the challenging Miramar Hill, famed for its long incline and a serious trial for even the most powerful of locomotives. At the peak of the hill, the track divides and passenger services begin their approach to California’s second largest city and Union Station, nestled between the city’s grand skyscrapers and the southern terminus of Pacific Surfliner® services. Included with this route is the full Pacific Surfliner® consist, headed by the EMD F59PHI diesel locomotive in Amtrak livery. The F59PHI class was built between 1994 and 2001, and are a popular sight at the head of many US passenger trains. A driveable Cab Car also allows authentic operation of the Pacific Surfliner®, as the train runs as a push-pull service due to there being no turning facilities at either end of the route. The interesting mix of lazy Southern California shore towns and oceanside single-track railroading, semi-mountainous regions and busy suburban junctions, spectacular scenery and atmospheric night lighting make the Pacific Surfliner® LA – San Diego route the perfect challenge for budding Train Engineers. Note: Pacific Surfliner® LA - San Diego includes the Train Simulator core technology. To play Pacific Surfliner® LA - San Diego, launch Train Simulator 2014 from your Steam library after purchase. Alternatively, if you already own Train Simulator 2014 you can add Pacific Surfliner® LA - San Diego to your existing collection. Scenarios Nine scenarios for the route: Training: F59PHI – Simple Controls Training: F59PHI and Surfliner® Introduction Riding the Surf, Part 1 Riding the Surf, Part 2 Riding the Surf, Part 3 Night Train to LA Get Out the Umbrella... …and Put On the Waders Big Bay Boom More scenarios are available on Steam Workshop online and in-game. Train Simulator’s Steam Workshop scenarios are free and easy to download, adding many more hours of exciting gameplay. With scenarios being added daily, why don’t you check it out now! Click here for Steam Workshop scenarios. Key Features 128 mile Pacific Surfliner® route from Los Angeles to San Diego Accurate route features, including Downtown Los Angeles, Los Angeles Union Station, Fullerton Transportation Centre, Angel Stadium, San Juan Capistrano Station, San Clemente Pier, Oceanside Transit Centre and Downtown San Diego EMD F59PHI in Amtrak Pacific Surfliner® livery with flashing ditch lights Pacific Surfliner® passengers cars with passenger view, including Business Class Car, Café Car, Passenger Cars and driveable Cab Car Scenarios for the route Quick Drive compatible Download size: 1,805mb",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/222606/header.jpg?t=1493807009",
    "Price": 19.99,
    "Developers": "Dovetail Games",
    "Publishers": "Dovetail Games - Trains",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/222606/ss_dada5720337d9473d21daf73af2d7a67b2599449.1920x1080.jpg?t=1493807009,https://cdn.akamai.steamstatic.com/steam/apps/222606/ss_0e5ead903544c536adb00724615b6969f6a98317.1920x1080.jpg?t=1493807009,https://cdn.akamai.steamstatic.com/steam/apps/222606/ss_c65c817d16ef836d2beb112ccbc8d9d9b1bd7fd4.1920x1080.jpg?t=1493807009,https://cdn.akamai.steamstatic.com/steam/apps/222606/ss_65396a34233d357a42efeac23a01cdba8d6c5389.1920x1080.jpg?t=1493807009,https://cdn.akamai.steamstatic.com/steam/apps/222606/ss_588edd12eea51ace001cfb805eb4dda409d6f99b.1920x1080.jpg?t=1493807009,https://cdn.akamai.steamstatic.com/steam/apps/222606/ss_2b02f144d5a7feae468fd78f8c8529e2c8fd8dc9.1920x1080.jpg?t=1493807009,https://cdn.akamai.steamstatic.com/steam/apps/222606/ss_1227624a9c853a579ea029778711f20107fb27b8.1920x1080.jpg?t=1493807009,https://cdn.akamai.steamstatic.com/steam/apps/222606/ss_16a256b082f310b07bc92d83d33314c019d80d1a.1920x1080.jpg?t=1493807009,https://cdn.akamai.steamstatic.com/steam/apps/222606/ss_52fde7f0621dffad1cbdea935eb513cfb466b47c.1920x1080.jpg?t=1493807009,https://cdn.akamai.steamstatic.com/steam/apps/222606/ss_f2a6f6a2fdb566094f3470aea94c7f14aeab1df2.1920x1080.jpg?t=1493807009",
    "Slug": "train-simulator-pacific-surfliner-la-san-diego-route",
    "Meta Title": "Train Simulator: Pacific Surfliner® LA - San Diego Route:...",
    "Meta Description": "Looking for information on Train Simulator: Pacific Surfliner® LA - San Diego Route? Check out the release date (Oct 17, 2013), developer insights from ...",
    "Alt Text Image": "Official header image for Train Simulator: Pacific Surfliner® LA - San Diego Route game - Steam 222606",
    "Canonical URL": "https://gusku.site/game/train-simulator-pacific-surfliner-la-san-diego-route",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Train Simulator: Pacific Surfliner\\u00ae LA - San Diego Route\", \"description\": \"Looking for information on Train Simulator: Pacific Surfliner\\u00ae LA - San Diego Route? Check out the release date (Oct 17, 2013), developer insights from ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 17, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games - Trains\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/222606/header.jpg?t=1493807009\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}