{
    "AppID": 1144170,
    "Name": "Warhammer: Chaos And Conquest",
    "Release date": "Nov 18, 2019",
    "About the game": "Spread Chaos across the Old World! Command a horde as you build a fortress capable of conquering the Empire of Man – and any other Chaos warbands that stand in your way. With enough power, you will prove your worth to the Chaos Gods by conquering Altdorf and becoming the Everchosen! Set in the Warhammer Fantasy universe, Warhammer: Chaos &amp; Conquest is real-time massively multiplayer strategy game where players compete for the resources of the Old World and battle for control of the Old World. Collect Warlords to be your most powerful soldiers in the war against the Empire Over 20 Daemons of Chaos &amp; 10 Warriors of Chaos to collect Use your strategy to assemble a diverse warband capable of smashing the defenses of your foes Daily challenges to complete with guaranteed rewards &amp; bonuses based on leaderboards! Raise a Champion worthy of the title of Everchosen Research Skills to expand your military, battle, &amp; unholy might Increase your power by building structures including the Chaos Temple, Sorcerer’s Citadel, Fortress Walls, Watchtower, Warlord Conclave, Workshop, Daemonic Forge, Hell Cannons, Dungeons, Training Grounds, &amp; more. Collect more resources by upgrading your Lumber Mill, Slaughter Pens, Blast Furnace, &amp; Quarry Vanquish roaming beasts to send them to their final resting place Send your warriors on marches throughout the realm to pillage goods from the land Siege other players fortresses to muck up their plans of conquest in favour of your own World chat for discussing the battle results with your enemies! Join an alliance to coordinate the conquest of landmarks important to the Empire Share the spoils with your alliance! As your alliance collects resources, your allies automatically earn additional spoils Assist your allies by speeding up their construction of their Chaos Fortress Send your troops to assist your alliance in defense, or receive warriors from your allies to make your fortress unbeatable Complete Trials, both solo &amp; with your alliance, to make your army more powerful Gather with your Alliance to take over the major landmarks of the Old World Pledge your alliance to the Chaos Gods – Khorne, Nurgle, Tzeentch, &amp; Slaanesh! Bring the chaos they desire to the Old World! Build a temple to Nurgle, the Plague Lord and god of disease, decay, and death! Build a Temple to the Dark Prince Slaanesh, the God of lust, pride, and decadence! Build a temple to the changer of Ways, Tzeentch, the god of magic, change, and sorcery! Construct a temple to the blood God Khorne! The god of violence, carnage, and anger is eager for the spill of blood. Special events to conquer roaming warbands of other Warhammer Fantasy factions, including greenskins, beastmen, &amp; dwarfs! Iconic Warhammer Fantasy locations, including: Chaos Wastes, Norsca, Troll Country, &amp; the Empire of Man Iconic Warhammer creatures to housing in your dungeons, including Chaos Spawn, Slaughter Brutes, mutalith vortex beasts, &amp; dragon ogres! Iconic Warhammer infantry available for training, including Marauders, Forsaken, Chaos Warriors, &amp; Chaos Chosen Iconic Warhammer beasts to corral, including: Warhounds, Chimera, Gorebeasts Collect warpstone through daily quests Carve your own legend in the Warhammer Fantasy Old World. The legions of the Empire of Man stand in your way – march your warband right through them &amp; cement your legacy as the Everchosen of Chaos that brought down the Empire of Man!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1144170/header.jpg?t=1654786420",
    "Price": 0.0,
    "Developers": "Hunted Cow Studios",
    "Publishers": "Tilting Point",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1144170/ss_c20e6dd76d23043988a52b7cb5e060b91d341f84.1920x1080.jpg?t=1654786420,https://cdn.akamai.steamstatic.com/steam/apps/1144170/ss_4761a0fd0ba6e18c047ede364f8d0d79facbf821.1920x1080.jpg?t=1654786420,https://cdn.akamai.steamstatic.com/steam/apps/1144170/ss_bb27c16bff0d4cfc842d564ef439a2feda35d73a.1920x1080.jpg?t=1654786420,https://cdn.akamai.steamstatic.com/steam/apps/1144170/ss_8c4944924c889178548c622c9859f621b6ff6f66.1920x1080.jpg?t=1654786420,https://cdn.akamai.steamstatic.com/steam/apps/1144170/ss_c94843d3edc207f919c9c6baf459b20c38135926.1920x1080.jpg?t=1654786420,https://cdn.akamai.steamstatic.com/steam/apps/1144170/ss_f0e2fcf7738ade72c747703840613333221ac510.1920x1080.jpg?t=1654786420,https://cdn.akamai.steamstatic.com/steam/apps/1144170/ss_6fab411a5d4023a8dd49304f5682efb1613bb97a.1920x1080.jpg?t=1654786420,https://cdn.akamai.steamstatic.com/steam/apps/1144170/ss_c8002021559d04c6fd7869204e7db085a665f4a0.1920x1080.jpg?t=1654786420,https://cdn.akamai.steamstatic.com/steam/apps/1144170/ss_7985ea614ea7ef99b2cd4b3a293546c9c3b9a5fc.1920x1080.jpg?t=1654786420,https://cdn.akamai.steamstatic.com/steam/apps/1144170/ss_146c053d24b2897b2d798127d27ebbc33f205b4d.1920x1080.jpg?t=1654786420,https://cdn.akamai.steamstatic.com/steam/apps/1144170/ss_e222c3aa4e6ef615293906f0e35cea48573a7add.1920x1080.jpg?t=1654786420,https://cdn.akamai.steamstatic.com/steam/apps/1144170/ss_2a7c2f7c0d21617517f6e69516fb03905fceafee.1920x1080.jpg?t=1654786420,https://cdn.akamai.steamstatic.com/steam/apps/1144170/ss_315ca71fd615a98e45a381a609587ae6eae3d37c.1920x1080.jpg?t=1654786420",
    "Slug": "warhammer-chaos-and-conquest",
    "Meta Title": "Warhammer: Chaos And Conquest: Nov 18, 2019, Hunted Cow S...",
    "Meta Description": "Looking for information on Warhammer: Chaos And Conquest? Check out the release date (Nov 18, 2019), developer insights from Hunted Cow Studios, and a c...",
    "Alt Text Image": "Official header image for Warhammer: Chaos And Conquest game - Steam 1144170",
    "Canonical URL": "https://gusku.site/game/warhammer-chaos-and-conquest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Warhammer: Chaos And Conquest\", \"description\": \"Looking for information on Warhammer: Chaos And Conquest? Check out the release date (Nov 18, 2019), developer insights from Hunted Cow Studios, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 18, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hunted Cow Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tilting Point\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1144170/header.jpg?t=1654786420\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}