{
    "AppID": 739820,
    "Name": "Wraithmind",
    "Release date": "Nov 12, 2020",
    "About the game": "Follow the story of Maia, a young woman who awakens with strange abilities. Journey through laboratories, forests and city ruins as you discover the mysteries and origins of her powers. Setting In the year 2118, mankind developed the technology of interstellar travel. Following this discovery, missions were planned to explore Alpha Centauri, the nearest solar system. Over the next several decades, a mining station was built on Tauria, the moon of a planet in Alpha Centauri which is habitable. 60 years later, starships routinely travel between Earth and Tauria. On Earth, the majority of Europe has unified into a single nation known as The Union. This nation is governed by the GCA, the Government Control Agency. A branch of this organization is responsible for all research on Tauria. They have labs on Tauria as well as on Earth where many secret studies are undertaken. Characters The story of Wraithmind features many characters, three of which are playable. When you start the game you will only control one character, but as you progress through the story, other characters will join your journey. Gameplay Wraithmind is a turn-based science fiction RPG. Featuring four to five hours of gameplay, the game will take you through several different areas each with their own story, enemies and characters. You control one character as you progress through the different areas. When you encounter characters or objects, you can interact with them and in some cases you can pick up items. Battles As you progress through the story, you will encounter various kinds of enemies. When you collide with an enemy on the map, the game will change to another scene where you can see all of your characters and all of the enemies you must fight. Every character and enemy performs an action one at a time. When it is the turn of a character to perform an action, you must select which action to perform and the target for that action. Enemies select their action and target automatically. Once all enemies have been defeated, you are taken back outside the battle scene. Progression When you defeat enemies in battle, your characters will gain skill points. These points can then be used to increase talents of each character. Talents allow you to decide how your characters will become stronger.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/739820/header.jpg?t=1605540398",
    "Price": 1.99,
    "Developers": "TEKO,Alex Timbro",
    "Publishers": "TEKO",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/739820/ss_5867bc169cc7e54bd4f4457fab9cd49f3c283327.1920x1080.jpg?t=1605540398,https://cdn.akamai.steamstatic.com/steam/apps/739820/ss_995d92b447efba2bfa235baffecf8bb1ed80b358.1920x1080.jpg?t=1605540398,https://cdn.akamai.steamstatic.com/steam/apps/739820/ss_cf474fa8544ffc02e85e0f925b2e308c29778fd0.1920x1080.jpg?t=1605540398,https://cdn.akamai.steamstatic.com/steam/apps/739820/ss_a5dbba8708989eb36d865b6a79f68cf085921f96.1920x1080.jpg?t=1605540398,https://cdn.akamai.steamstatic.com/steam/apps/739820/ss_349d4392a064aa6ded154493fb3570548b6308a4.1920x1080.jpg?t=1605540398,https://cdn.akamai.steamstatic.com/steam/apps/739820/ss_973dbecbd2e9bba9e27095560b9cda4d40a05173.1920x1080.jpg?t=1605540398",
    "Slug": "wraithmind",
    "Meta Title": "Wraithmind: Nov 12, 2020, TEKO,Alex Timbro and Full Overview",
    "Meta Description": "Looking for information on Wraithmind? Check out the release date (Nov 12, 2020), developer insights from TEKO,Alex Timbro, and a complete game summary.",
    "Alt Text Image": "Official header image for Wraithmind game - Steam 739820",
    "Canonical URL": "https://gusku.site/game/wraithmind",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wraithmind\", \"description\": \"Looking for information on Wraithmind? Check out the release date (Nov 12, 2020), developer insights from TEKO,Alex Timbro, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 12, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"TEKO,Alex Timbro\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TEKO\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/739820/header.jpg?t=1605540398\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}