{
    "AppID": 1290790,
    "Name": "Yardlings",
    "Release date": "May 4, 2020",
    "About the game": "Yardlings is a local multiplayer battle arena about vegetables in a garden! About In this game your goal is to gain control over the entire yard and you are competing against others. You play as a hero, like a tomato - a strong unit - you can easily take out 2 or 3 small mushrooms, but you won't stand a chance against bigger groups of enemies. That's why the key to win is to gather your own forces and tactically place your troops at the right places at the right times. Features Free-4-all and 2v2 modes AI controlled opponents in 3 different level (easy/medium/hard) A short campaign mode 30 minutes to 1 hour gameplay 2 different maps types over 10 different units 9 different special abilities 8 different player characters Strategy You have a few options. attack potted plants to claim them. pots will spawn units over time! this is the fastest way to gain a following attack flowers in flower gardens to claim those gardens. flowers heal and help evolve units in range. they also shoot seeds at enemies that are in range. flowers will also grow petals over time and become stronger with them. when a flower is fully grown it'll spawn very strong units! the flowers grow faster when there are more units guarding it, so consider stationing some units in a garden once in a while. you can either decide to run around picking up troops and stationing them, but from time to time you'll also want to help out in a fight. don't worry, you'll respawn at your base garden if you get defeated, unless your base got taken over.. when helping out, you might want to use your special ability. dealing damage will fill your special meter. once it's full use your special ability! there are different types of specials and they can make a real difference if used right. to get these special abilities, pick them up at special ability plants! How to win there are 2 ways to win 1. control enough flower gardens to take full control 2. destroy and claim the base gardens of your opponent(s). if you do so, you'll be the only one left standing! Controls spacebar (keyboard) or A (gamepad) to attack Z (keyboard) or X (gamepad) to call units to follow you X (keyboard) or B (gamepad) to dismiss units that follow you C (keyboard) or Y (gamepad) to use your special ability",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1290790/header.jpg?t=1639497245",
    "Price": 2.99,
    "Developers": "Sokpop Collective",
    "Publishers": "Sokpop Collective",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1290790/ss_d7cbd9b11d7bec5d0b26ebb5783521159c5c0597.1920x1080.jpg?t=1639497245,https://cdn.akamai.steamstatic.com/steam/apps/1290790/ss_0d2ad695382bbdea6d7de312765dece57a37101a.1920x1080.jpg?t=1639497245,https://cdn.akamai.steamstatic.com/steam/apps/1290790/ss_3693209e5ef647443b225ac0752f7e6a431387ba.1920x1080.jpg?t=1639497245,https://cdn.akamai.steamstatic.com/steam/apps/1290790/ss_69fd43e2e9e8e4c81ddb5646c87b550adad8250a.1920x1080.jpg?t=1639497245,https://cdn.akamai.steamstatic.com/steam/apps/1290790/ss_2b99d515552b2e4bd8017ae5a2a311f8764fe71c.1920x1080.jpg?t=1639497245",
    "Slug": "yardlings",
    "Meta Title": "Yardlings: May 4, 2020, Sokpop Collective and Full Overview",
    "Meta Description": "Looking for information on Yardlings? Check out the release date (May 4, 2020), developer insights from Sokpop Collective, and a complete game summary.",
    "Alt Text Image": "Official header image for Yardlings game - Steam 1290790",
    "Canonical URL": "https://gusku.site/game/yardlings",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Yardlings\", \"description\": \"Looking for information on Yardlings? Check out the release date (May 4, 2020), developer insights from Sokpop Collective, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sokpop Collective\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sokpop Collective\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1290790/header.jpg?t=1639497245\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}