{
    "AppID": 1382320,
    "Name": "Antonball Deluxe",
    "Release date": "Mar 5, 2021",
    "About the game": "The breakout title from Summitsphere, Antonball Deluxe is a retro, high-octane smorgasbord of ballbusting arcade action! Starring a little red man named Anton - Boiler City’s top exterminator - Antonball Deluxe quite literally turns the breakout genre on its head, blending traditional brick-breaking gameplay with tight, intense platforming. 'Working on Antonball Deluxe has been a dream come true for the studio. Personally, I'm very excited to be working with Proponent toward the goal of making it acceptable for everyone to play with their balls,” says Tony Grayson, Studio Head at Summitsphere. No slouch on content, Antonball Deluxe truly lives up to its name in including three separate games: ANTONBALL is an enhanced low-definition remake of Summitsphere’s legendary game jam title! After a long night on the town, Anton , Boiler City's resident exterminator and overconsumer of fizzy libation, is struggling to find his way back home from Brulo's Casino. Using his trusty Antonball, Anton decides to take the most direct path home after an unfortunate trip into the sewers: breaking straight through every single wall between the sewers and the city he calls home in 30 stages of brick-smashing fun! PUNCHBALL is the tale of Anton's building-mate Annie , and her indefatigable need to be the absolute best. When Annie discovers the Punchball Tourney being held at Brulo's Casino, with the grand prize being a lifetime supply of Ballble Tea, she sets out to win first place! You'll need to help her defeat all of the trickster beasts that have volunteered to take part in Brulo's wild game. Use the Punchball to slam enemies, then kick 'em off the stage! Do you have what it takes to be the Punchball Champion? VS. ANTONBALL is Antonball but competitive! Each team has their own brick wall and aims to break the other team's wall first. Defeat the other team by destroying their wall! Play 1v1, 2v2, or even 2v1 (if you're into that)! Many power-ups are in play, with some twists and turns depending on which arena you're having your ball-based blitz in! You can even pick some up and throw them! Brick-breakin', ball-bustin' gameplay with a platformin' twist! Includes THREE games: Antonball, Punchball, and VS. Antonball! 69 levels of stimulating mole-mashin' action! 21 different characters to unlock and play as! Share your balls with friends or foes online and offline with up to four players! (Gamepad required for local multiplayer) Online leaderboards for Antonball and Punchball! A ballin', 100% original retro soundtrack! 18 baller Steam Achievements to show off to your friends!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1382320/header.jpg?t=1652481867",
    "Price": 14.99,
    "Developers": "Summitsphere",
    "Publishers": "Proponent Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1382320/ss_5d66dda03f8169cf4a4a0b3267318f4dfabf9591.1920x1080.jpg?t=1652481867,https://cdn.akamai.steamstatic.com/steam/apps/1382320/ss_eaffa5e9026aa97fbdde968b66d270200931dddf.1920x1080.jpg?t=1652481867,https://cdn.akamai.steamstatic.com/steam/apps/1382320/ss_86d5685e07e703750a20d42170d3bd205e8f6757.1920x1080.jpg?t=1652481867,https://cdn.akamai.steamstatic.com/steam/apps/1382320/ss_8c9fe25a139a64db54beb998f8183498e03078ed.1920x1080.jpg?t=1652481867,https://cdn.akamai.steamstatic.com/steam/apps/1382320/ss_37563c665d89bba35acf193dd18ca75f343d868a.1920x1080.jpg?t=1652481867,https://cdn.akamai.steamstatic.com/steam/apps/1382320/ss_9dd690b24f9eb3f22e1480d3aa381acfd3227ee8.1920x1080.jpg?t=1652481867,https://cdn.akamai.steamstatic.com/steam/apps/1382320/ss_d8e7dda72d56bb07124d6cbbecf64c69216681f5.1920x1080.jpg?t=1652481867,https://cdn.akamai.steamstatic.com/steam/apps/1382320/ss_7418d3a457ac6e57e385595690f8ab0c4c4910a5.1920x1080.jpg?t=1652481867,https://cdn.akamai.steamstatic.com/steam/apps/1382320/ss_9dcec748b481e5fe707ea0d59c84339e4b400251.1920x1080.jpg?t=1652481867,https://cdn.akamai.steamstatic.com/steam/apps/1382320/ss_2e8ab447c4e7361978781706cc0cbd9856568e7e.1920x1080.jpg?t=1652481867",
    "Slug": "antonball-deluxe",
    "Meta Title": "Antonball Deluxe: Mar 5, 2021, Summitsphere and Full Over...",
    "Meta Description": "Looking for information on Antonball Deluxe? Check out the release date (Mar 5, 2021), developer insights from Summitsphere, and a complete game summary.",
    "Alt Text Image": "Official header image for Antonball Deluxe game - Steam 1382320",
    "Canonical URL": "https://gusku.site/game/antonball-deluxe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Antonball Deluxe\", \"description\": \"Looking for information on Antonball Deluxe? Check out the release date (Mar 5, 2021), developer insights from Summitsphere, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Summitsphere\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Proponent Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1382320/header.jpg?t=1652481867\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}