{
    "AppID": 727020,
    "Name": "Arcade Moonlander",
    "Release date": "Oct 25, 2017",
    "About the game": "Arcade Moonlander is a challenge of precision and timing. Maneuver the craft to the landing pad before the fuel runs out. Be sure to land gently and vertically. And look out for satellites and space-worms! They will get you. Arcade Mode has no time limit or lives, and the game saves progress automatically upon level completion. There are best times saved out for each level, as well as an overall best time for completing the 20 levels. Follow the radar toward your goal and access the tutorial at any time during play. Adventure Mode encompasses a MUCH larger map and utilizes teleport pads to provide the player with a means of progression, as well as a checkpoint. You will encounter many more dynamic obstacles such as gravity wells, space worms, falling stalactites and more! There are also several paths through the level allowing players of all skill levels a rewarding experience. By discovering Fuel Tanks, it is also possible to complete all paths in one run for the die-hard fans. Use the mini-map to explore, locate and obtain your goals. Procedural mode introduces a procedural level generator capable of providing an infinite number of levels. There are currently 3 different play modes. Quest, Time Trial and Practice. There is a leader board for Quest mode progress, and for Time Trial. Each game has a seed that can be used to replay those exact levels, or a random seed can be used for exploration. The procedural map generator is still in development and can currently only generate one style of map at varying difficulties. Future updates will see other map styles added to the generation capabilities. Arcade Moonlander was designed for speed runs from the start and features a robust timing and score system. While secrets and hidden fuel tanks provide casual replay-ability. Features: 30 exciting, fast-paced 'Arcade' levels. Expansive 'Adventure' level that focus on exploration and more dynamic fun. Procedural level generator with multiple play modes. Robust collision and timing to ensure reliable speed runs. Retro Sci-Fi art style and soundtrack. 40+ Steam Achievements. Leader Boards for fastest times.. Highly refined controller support (recommended for best experience). Keyboard and mouse support.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/727020/header.jpg?t=1594188302",
    "Price": 0.99,
    "Developers": "Daniel Paul Griffin",
    "Publishers": "Back Of Nowhere Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/727020/ss_4dec9255b23e12d1087012487905fc8515e4046b.1920x1080.jpg?t=1594188302,https://cdn.akamai.steamstatic.com/steam/apps/727020/ss_32f5cc9a5fd446f16f20e16f03335daf440b84c9.1920x1080.jpg?t=1594188302,https://cdn.akamai.steamstatic.com/steam/apps/727020/ss_653780b0b4818de61b68053a770e3d52412e43b3.1920x1080.jpg?t=1594188302,https://cdn.akamai.steamstatic.com/steam/apps/727020/ss_a9b9923104acd7a7e0d3b5b32cdd9cfb284c6098.1920x1080.jpg?t=1594188302,https://cdn.akamai.steamstatic.com/steam/apps/727020/ss_278aed4fcb664c3f03428681a11a29adffdcea84.1920x1080.jpg?t=1594188302",
    "Slug": "arcade-moonlander",
    "Meta Title": "Arcade Moonlander: Oct 25, 2017, Daniel Paul Griffin and ...",
    "Meta Description": "Looking for information on Arcade Moonlander? Check out the release date (Oct 25, 2017), developer insights from Daniel Paul Griffin, and a complete gam...",
    "Alt Text Image": "Official header image for Arcade Moonlander game - Steam 727020",
    "Canonical URL": "https://gusku.site/game/arcade-moonlander",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Arcade Moonlander\", \"description\": \"Looking for information on Arcade Moonlander? Check out the release date (Oct 25, 2017), developer insights from Daniel Paul Griffin, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 25, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Daniel Paul Griffin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Back Of Nowhere Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/727020/header.jpg?t=1594188302\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}