{
    "AppID": 1160020,
    "Name": "AshenForest",
    "Release date": "Jun 4, 2020",
    "About the game": "AshenForest is an action roguelite focused on boss-rush. To purify the ashen forest that is causing the plague, you must fight against all the monsters lurking in the forest. Through the hazy mist, search and eliminate those which worsens the forest! Even if you end up being swallowed by the forest, you can use the 'Salvation' score to strengthen your character and challenge the forest again at any time. 　 SYNOPSIS The forest, with a giant tree, was always warm and peaceful. Until ' it' fell down from the sky. The plague started to consume its surroundings, the giant tree being the first. A lot of people died, crazed and turned into a monster... 　 CHARACTERS Agave is a strong warrior who utilizes heavy attacks. The charged attack after shield parrying makes any enemy to stumble. The Church dispatched the most dependable one person, to solve the plague. Agave the Inquisitor. He was a mercenary. He, who splattered a lot of blood with his mercenary job, was admitted by church with penitence. He is ready to judge anything, if it is against the will of church. To heal the chaotic order of the forest, he took his way to destroy the cause of the plague. Lycoris is a crow-fused magician who can control mind and flame. Is able to transform to a crow demon by using special ability to a knocked-down enemy. Among the ones who lived, they needed a sacrificial lamb to take the blame for their pain. Lycoris, who was a daughter of the alchemist, was judged as a witch and was kicked out to the contaminated forest with both of her arm tied. A staggering crow with a hurt wing flew to her, who was dying by the mist of the forest. They both understood each others' situation, so they combined their power to overcome the crisis. The Crow talked. 'In this forest, you will survive and I will be the apex of this ecosystem.' They took their way to the forest, to earn their own goal. Nagne is a hunting specialist who is armed with a dagger and a gun. Enemies have no chance against his fast attack speed and ranged attacks. Nagne, who was caught by the plague of the Ashen Forest, became a monster with a human sanity. Rejected by mankind, and a good prey for the monsters. Then, he met the old man who had the same disaster as him. Nagne learnt a lot of things like surviving in the forest and hunting, from the old man. However, the old man didn't have enough lifespan, so he left the last word to Nagne. That there must be no more victim in this forest like Nagne and himself, who are pitiful. Nagne took a path to the Ashen Forest, to make his small hope true.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1160020/header.jpg?t=1610733196",
    "Price": 2.3,
    "Developers": "GentleRaven Games",
    "Publishers": "PsychoFlux Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1160020/ss_71c6bb23139cf51a9a39b081e2bec1a20844302c.1920x1080.jpg?t=1610733196,https://cdn.akamai.steamstatic.com/steam/apps/1160020/ss_0ee26571aa0655412b548619f606244880ee397d.1920x1080.jpg?t=1610733196,https://cdn.akamai.steamstatic.com/steam/apps/1160020/ss_92d16875c4c2a1dd1e3c79b5b56ee718930bf529.1920x1080.jpg?t=1610733196,https://cdn.akamai.steamstatic.com/steam/apps/1160020/ss_5aabb9513464ad60e353f693971a6717cc1bacc5.1920x1080.jpg?t=1610733196",
    "Slug": "ashenforest",
    "Meta Title": "AshenForest: Jun 4, 2020, GentleRaven Games and Full Over...",
    "Meta Description": "Looking for information on AshenForest? Check out the release date (Jun 4, 2020), developer insights from GentleRaven Games, and a complete game summary.",
    "Alt Text Image": "Official header image for AshenForest game - Steam 1160020",
    "Canonical URL": "https://gusku.site/game/ashenforest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"AshenForest\", \"description\": \"Looking for information on AshenForest? Check out the release date (Jun 4, 2020), developer insights from GentleRaven Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"GentleRaven Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PsychoFlux Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1160020/header.jpg?t=1610733196\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.3, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}