{
    "AppID": 1513090,
    "Name": "Blimps",
    "Release date": "Jan 25, 2021",
    "About the game": "BLIMPS is a retro indie adventure RPG that puts you in the captain's chair of your own blimp cargo company. Armed with water, fire, ice cannons, and a couple of hanger Robots to help you on your way. Can you learn to make it in this world of BLIMPS only to escape it? With a bit of perseverance, you might be the one to escape from this world of multiplying BLIMPS ! So take to the skies and safely deliver cargo or try to pirate cargo from another blimp if you dare. This rogue-lite puzzle game involves flying around, exploring, crafting, hacking, harvesting, smuggling, and racing to be the first to find the Moon Crystal. And don't forget about the elusive Mars Rock! GAME FEATURES: BUILD A FORTUNE WITH A BLIMP CARGO COMPANY: LOAD, EQUIP, AND REPAIR: Load up your BLIMP, equip it with upgrades, and repair it from damages. EXPLORE A VAST UPSIDE-DOWN WORLD FULL OF SECRETS, TREASURES, AND MULTIPLYING BLIMPS: Fly around discovering all the ports, stores, missions, and secrets in the wrapped open world of Blimps. RACE AGAINST SPACE Y, NILE X, AND SIR SPACE TO FIND THE MOON CRYSTAL: Be the first to find the elusive Moon Crystal and win $1,000,000. (And don't forget about the Mars Rock as well!) CHOOSE YOUR OWN ADVENTURE STORY EVENTS: The choice is yours. Three new CYOA story events are included in version 1.8.4. (More are currently being written and will be added to future game updates.) ENCOUNTER RANDOM WEATHER EVENTS: How do you fly your Blimp when encountering rough weather? EDUCATE AND TRAIN VERY IMPORTANT PEOPLE: Find your expedition team and get them together to help you prepare for your escape. PIRATE BATTLES: Shoot enemy Blimps 'twin-stick shooter style,' flying worldwide or in close combat skirmishes for their loot. MAKE ITEMS: Make items from floppy disks for your BLIMP and other stuff... EARN A PROFIT: Safely deliver cargo with your BLIMP to trading stork ports. Smugglers beware; you may get busted at Eagle Eye Customs... EXTRACTING ELEMENTS: Use your hanger's lab to separate elements from saltwater. MINING AND DRILLING: Visit mining operations and drilling rigs to inspect and purchase minerals. BUILD SOLAR TOWNS: Build four different themed solar towns to receive a rental income. PNEUMATIC TUBE MAIL: Send and receive incoming pneumatic tube mail. Pay the bills, receive rental income, get paid, collect stamps, and recycle junk mail. FLY AIMLESSLY AROUND: collecting lots of water, fire, and ice! EARN 11 ACHIEVEMENT STAMPS IN YOUR PASSPORT: BLIMPS features 11x unique achievement stamps that players can earn in their passports through dedicated gameplay. DAFFODIL 'MEDAL OF HONOR' STAMP: Retainers of this passport achievement stamp can complete the game in about 2 hours if they know what they are doing and are awarded a lower score bonus for doing so. Ed says, 'BLIMPS can be almost completely finished in about 13 minutes if you are a good hacker and know what you are doing, but you won't get the Daffodil 'No Cheat Codes' Stamp bonus.' 77 TASKS TO COMPLETE: What are the 77 tasks? Great question. They are a mystery... BLIMPS also features unique sound fx and an instrumental soundtrack performed by the band Ashtronaut. BLIMPS can be played on a tablet/finger/pencil or keyboard/mouse device. In addition, it features partial gamepad controller support (if you want to fly around the world of BLIMPS 'twin-stick shooter style.') Pay once to get the whole BLIMPS experience. There are no ads, no F2P mechanics, no in-app purchases, and no in-game data collection. Instead, it is just an old-school stand-alone offline family-friendly video game. Rated E for 'Everyone.' 'We hope you enjoy the game. Thanks for playing!' -Corinne &amp; Ed (co-creators of BLIMPS)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1513090/header.jpg?t=1655589262",
    "Price": 6.99,
    "Developers": "Paint Can Games LLC",
    "Publishers": "Paint Can Games LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1513090/ss_82da54a2f983f11cb05513361ee8cb87e2729320.1920x1080.jpg?t=1655589262,https://cdn.akamai.steamstatic.com/steam/apps/1513090/ss_c05902e31a98accb7133740d2f453e9fa1ca8912.1920x1080.jpg?t=1655589262,https://cdn.akamai.steamstatic.com/steam/apps/1513090/ss_052c045053516a0cd7910cf58c118a71cd5d66c4.1920x1080.jpg?t=1655589262,https://cdn.akamai.steamstatic.com/steam/apps/1513090/ss_b150c9ba9924494703866d9264988ad8862577ba.1920x1080.jpg?t=1655589262,https://cdn.akamai.steamstatic.com/steam/apps/1513090/ss_bda6751244d45547f6417c815c26bda60cc9f438.1920x1080.jpg?t=1655589262,https://cdn.akamai.steamstatic.com/steam/apps/1513090/ss_f0cccaa63ed40401e92c7c6ba286a6b8aa497809.1920x1080.jpg?t=1655589262,https://cdn.akamai.steamstatic.com/steam/apps/1513090/ss_1ba24d0f5e222dd7ad217afd11b78c603e38e00b.1920x1080.jpg?t=1655589262,https://cdn.akamai.steamstatic.com/steam/apps/1513090/ss_a9407f173eff199fb9cb08e8b6d6fac7df68b4c0.1920x1080.jpg?t=1655589262,https://cdn.akamai.steamstatic.com/steam/apps/1513090/ss_503e4caf617c5bb6816e714352d31d35e358229d.1920x1080.jpg?t=1655589262,https://cdn.akamai.steamstatic.com/steam/apps/1513090/ss_c0145ac221ef8ee6de7645fd86cda2208593ca42.1920x1080.jpg?t=1655589262,https://cdn.akamai.steamstatic.com/steam/apps/1513090/ss_9b594fd82c8937d43820cf9b43c30ac27363502a.1920x1080.jpg?t=1655589262,https://cdn.akamai.steamstatic.com/steam/apps/1513090/ss_c8302d1469d9d2dd4a2e2e97d61abfe97a0f05a4.1920x1080.jpg?t=1655589262",
    "Slug": "blimps",
    "Meta Title": "Blimps: Jan 25, 2021, Paint Can Games LLC and Full Overview",
    "Meta Description": "Looking for information on Blimps? Check out the release date (Jan 25, 2021), developer insights from Paint Can Games LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Blimps game - Steam 1513090",
    "Canonical URL": "https://gusku.site/game/blimps",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Blimps\", \"description\": \"Looking for information on Blimps? Check out the release date (Jan 25, 2021), developer insights from Paint Can Games LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Paint Can Games LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Paint Can Games LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1513090/header.jpg?t=1655589262\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}