{
    "AppID": 1296280,
    "Name": "Car Trader Simulator - Welcome to the Business",
    "Release date": "Jun 23, 2020",
    "About the game": "Car Trader Simulator - Welcome to the Business is a prologue to the full version of the game 'Car Trader Simulator' Do you know how to profit from trading cars while maintaining a good reputation? Car Trader Simulator lets you play the role of an American car dealer. Your goal is to get rich. How you do it depends entirely on you. It is your choice whether you will sell efficient and original cars, or whether you will use the black market and stolen vehicles to dabble in the illegal. The difficulty of the game. Which one do you choose? You can choose one of 3 difficulty levels. The easy and medium ones are the best choice for people starting their adventure with games of this type, and the highest level has been designed for economic simulators veterans. The latter is distinguished by a complete lack of hints, which leaves the player to depend on his instinct and experience alone. The dream employee. How do you find one? While your company grows, you will also need new people to work. An extensive system of employment and staffing will facilitate your work and accelerate the company's growth. Employees differ based on their experience, specialization and employment cost. The story. Who will you become? The story of the game is very extensive and allows you to go through the campaign in various ways. You can be a law-abiding and responsible dealer who, using the experience gained while working with his uncle in his youth, will dynamically expand the business and ensure the satisfaction of his customers. The opposite choice will allow you to use the cheapest solutions when repairing and selling cars to deceive your customers and earn large amounts of cash as soon as possible. There will also be the possibility of stealing a vehicle at the request of shady customers. Economy and marketing. What will you invest in? There are many economic choices ahead of you. Invest in new employees, repair some cars for additional profit, or maybe advertise? This system will allow you to feel like a real business owner, one that in many situations has difficult choices to make on how to invest his earned fortune to double it in the future. Or you just might lose it all as well. Map handling system and personnel management. Car Trader Simulator has a map and an employee management system. You can specify exactly which streets our employees can travel, who will transport and repair purchased (or stolen) cars, etc. In addition, the events system will allow you to diversify the game with unexpected events or activities taking place in the city. To make it easier to navigate the map, it has been divided into distinctive sections which offer various game mechanics (and refer to the names of widely known districts of the USA). Auctions Each car in the game will be negotiable for the right price on one of the three available markets. Every few minutes new cars will appear on auction alongside a group of people willing to pay for the best models. Not only will you need to have cash, but you will also have to bid wisely to get the most from the auctioned vehicle. Direct sales Having a good car for sale is only half the battle, the other half is dealing with the customer and meeting his expectations. With each conversation, you will get guidelines on what the customer expects from you. Your task is not only to sell the car but also to make the buyer happy so that he becomes a returning customer. Real car photos The game has a giant library of real car photos. Each set of photos is a complete set with vintages and models of a given car, additionally available in any color combination.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1296280/header.jpg?t=1658237276",
    "Price": 0.0,
    "Developers": "Live Motion Games",
    "Publishers": "Live Motion Games,PlayWay S.A.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_2a6f6ad156e4667a0e43bf255699a3114cfb7cef.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_ff8fa7ab1b86ba2dad549b573dd4caaf35323c69.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_f6b2bbd95b97fe9f3bacdde19973a9f7b175bb6c.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_cbe43828c026e1197e23d81444345b3e1b02e7c0.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_b669f2cf6ca6bfe5337880fa2f3a0f7e5b2b8a39.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_7199449e07852311dcc0f3483c28d039fb632e7a.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_c33a3755b6d010ae5535846f4327d8f19b73c38f.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_60456ab0baaa03db82de93be2d21929b1d0c1340.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_d9780b50ad8c4f6ffa386cf3313e0bb9d424f8d3.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_c2342c52b03f956bda7c05c053015f32d2ca8f4d.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_56a9b61eb0fd7a2d9bc7c69d6218e9ce766096d4.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_57c60e85c12fc196b9eb908dd2eb28f3e373e4be.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_c6279783e8d230dee5caa7e99f1e6ac8978c0ee2.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_5d5971a5c38f30add51c98c211f9e3f0e600c938.1920x1080.jpg?t=1658237276,https://cdn.akamai.steamstatic.com/steam/apps/1296280/ss_3fab0818879e7b373b91e67f8c9ec8ed7baaabe5.1920x1080.jpg?t=1658237276",
    "Slug": "car-trader-simulator-welcome-to-the-business",
    "Meta Title": "Car Trader Simulator - Welcome to the Business: Jun 23, 2...",
    "Meta Description": "Looking for information on Car Trader Simulator - Welcome to the Business? Check out the release date (Jun 23, 2020), developer insights from Live Motio...",
    "Alt Text Image": "Official header image for Car Trader Simulator - Welcome to the Business game - Steam 1296280",
    "Canonical URL": "https://gusku.site/game/car-trader-simulator-welcome-to-the-business",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Car Trader Simulator - Welcome to the Business\", \"description\": \"Looking for information on Car Trader Simulator - Welcome to the Business? Check out the release date (Jun 23, 2020), developer insights from Live Motio...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 23, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Live Motion Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Live Motion Games,PlayWay S.A.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1296280/header.jpg?t=1658237276\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}