{
    "AppID": 370060,
    "Name": "Coffee Shop Tycoon",
    "Release date": "Dec 5, 2016",
    "About the game": "Coffee Shop Tycoon is a management game in which you take control of your own coffee shop – a game for business sharks and coffee enthusiasts alike! Will you thrive and become the most popular coffee shop in town, or die trying? Everything lies in your hands. The day-to-day life of a cafeteria is a whirlwind, and you’ll have to make choices constantly; every decision will bring more customers… or make you lose money! From hiring the best staff you can afford and managing them, to designing the style of your place, planning marketing campaigns, balancing the ledgers and deciding how to tackle your competition, and of course, choosing and roasting your own beans to produce the best coffee in town for your customers; Coffee Shop Tycoon is a deep management game where customization and planning are vital to the survival of your business! What’s the first thing you want in the morning? Yes, a good, hot coffee – and so do your customers! At the end of the day, the product is the heart and core; how good your coffee is what it’s all about in a cafeteria. You will make your customers love you… or really, really hate you. Get your beans, grind them with love and brew them with passion, and hopefully, you will touch someone's heart with your barista skills. Have a crazy coffee idea? Go wild, your options are endless! More sugar? Of course. Whipped cream -- why not? Bacon—alright buddy, don’t get too carried away... Create your own seasonal beverages, and build a reputation for your shop. Take it to the origin and control your product from its source, picking from over 1000 unique, green coffee beans to create your own unique flavors. Roast your blend, pack it up and design a fantastic bag to showcase your miracle beans. Based on real varieties of coffee from all over the world, each with real tasting notes and different responses to the process of roasting so you can customize your flavors to the very last detail. Create roasting profiles for your staff to follow, unlock new bean varieties, and complete roasting challenges to hone your skills. Designed by real coffee enthusiasts with hundreds of hours of research, the roasting feature of Coffee Shop Tycoon allows you to learn more and dive deep into the fascinating world of coffee production, with its many varieties and subtleties! Regardless of how good your coffee is, a cup of coffee can’t be the only cornerstone of a true business empire. Sharpen your management skills, because it will take you all your business savviness to get to the top! Hire and train the best baristas, but keep your income and expenses balanced or you will go broke. Need to invest some extra cash to grow? Get a loan! Need more customers! Spread the word through clever marketing campaigns! Become the ultimate tycoon and conquer the world from your company’s headquarters. But you’re not alone in the world: there are other coffee shops just like yours that compete for the same clients, and they know how to make good coffee too… You can outcompete them, of course – but if you get powerful enough you can also act like a real shark, buying them out to become the ultimate legal coffee monopoly in the world, unlocking unique perks and logos. Everything counts when it comes to charming your clients, and the looks of your store can be part of the experience. Delight your customers with your unique style, buy new furniture and decorations to create a vibrant atmosphere. Industrial, modern, maybe classic? It is up to you! Paint the walls and change the floors. Immerse yourself in your own store. Explore new locations and find new challenges. Become the best coffee shop in the world! Brew your coffee and create your own drinks Choose from over 1,000 real green coffee beans from all over the world… …and roast your own coffee, deciding roasting profiles to create unique flavors Hire and train your staff, and unlock specializations for your employees Design marketing campaigns to promote your business Place your shops in unique locations with different styles Build a reputation with specialty drinks and exquisite food Choose and customize your coffee shop logo and bag of coffee Buy furniture and decoration for your coffee shop. Paint your walls and customize your floors Research and add services to your store (Wifi, rewards, and more) Manage your business from your headquarters, from a single store to a powerful franchise Build an empire: buy and sell stocks from other companies and become the ultimate coffee monopoly in the world Manage key resources to keep your business afloat Prepare special drinks for seasonal events to boost your reputation and increase your income",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/370060/header.jpg?t=1656756728",
    "Price": 7.99,
    "Developers": "Riff Studios",
    "Publishers": "Riff Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/370060/ss_c8d92d3cce165bfb9174e6d43c6a786bd1b4bcf1.1920x1080.jpg?t=1656756728,https://cdn.akamai.steamstatic.com/steam/apps/370060/ss_15de5939a6757ff7149d39592e802020a3c54b2e.1920x1080.jpg?t=1656756728,https://cdn.akamai.steamstatic.com/steam/apps/370060/ss_1c2e6a8177bed7fe2de00a900466b00c47e95738.1920x1080.jpg?t=1656756728,https://cdn.akamai.steamstatic.com/steam/apps/370060/ss_ee5bf640303b31e4ed53da6a7724cf3520fbe347.1920x1080.jpg?t=1656756728,https://cdn.akamai.steamstatic.com/steam/apps/370060/ss_b9435973d7d7630783291389ed57ed641e581969.1920x1080.jpg?t=1656756728,https://cdn.akamai.steamstatic.com/steam/apps/370060/ss_f6fd6d58837405e0c672ffb11f8477c685ec62bf.1920x1080.jpg?t=1656756728,https://cdn.akamai.steamstatic.com/steam/apps/370060/ss_0e8b6a98e0efa44013bf303ff1aef8c83c24b2c0.1920x1080.jpg?t=1656756728,https://cdn.akamai.steamstatic.com/steam/apps/370060/ss_79587a72b95e5592dc178b358ec73d44abb2327b.1920x1080.jpg?t=1656756728,https://cdn.akamai.steamstatic.com/steam/apps/370060/ss_1e40c9869d059c8fb60e017bcea5fd212b39ab4c.1920x1080.jpg?t=1656756728,https://cdn.akamai.steamstatic.com/steam/apps/370060/ss_0f241423a0607b22c04b65951ca4b7121a458d5a.1920x1080.jpg?t=1656756728,https://cdn.akamai.steamstatic.com/steam/apps/370060/ss_6cae64ca8b9cb104664a267853a5372cbbb0b5e3.1920x1080.jpg?t=1656756728,https://cdn.akamai.steamstatic.com/steam/apps/370060/ss_c3c4d20aed648d74b14438d726ba14a1f006c216.1920x1080.jpg?t=1656756728,https://cdn.akamai.steamstatic.com/steam/apps/370060/ss_86e0befe64fb0278c6ab59f20e89ebe15915920e.1920x1080.jpg?t=1656756728",
    "Slug": "coffee-shop-tycoon",
    "Meta Title": "Coffee Shop Tycoon: Dec 5, 2016, Riff Studios and Full Ov...",
    "Meta Description": "Looking for information on Coffee Shop Tycoon? Check out the release date (Dec 5, 2016), developer insights from Riff Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Coffee Shop Tycoon game - Steam 370060",
    "Canonical URL": "https://gusku.site/game/coffee-shop-tycoon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Coffee Shop Tycoon\", \"description\": \"Looking for information on Coffee Shop Tycoon? Check out the release date (Dec 5, 2016), developer insights from Riff Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 5, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Riff Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Riff Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/370060/header.jpg?t=1656756728\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}