{
    "AppID": 1369370,
    "Name": "Combat Mission Shock Force 2",
    "Release date": "Aug 31, 2020",
    "About the game": "The latest title in the famous Combat Mission franchise of wargames, now on Steam. Shock Force 2 brings you to a hypothetical conflict in Syria between the forces of NATO and the Syrian Army. Take command of US Stryker Brigade Combat Teams (SBCT) and Heavy Brigade Combat Teams (HBCT) to fight against Syrian Army Infantry, Mechanized and Armored units in an arid setting. Experience the full range of modern threats to conventional military forces, including irregular combat forces, terrorists, spies, suicide bombers, IED's and other deadly tools employed in the asymmetric warfare of the modern day. Play the Task Force Thunder campaign, more than a dozen carefully crafted battles, or unlimited Quick Battles. HOW THE GAME IS PLAYED Players are assigned detailed missions to accomplish based on a richly diverse set of Objectives. Missions can be played in either Real Time or our WeGo hybrid turn based mode introduced with the first Combat Mission game 20 years ago. WeGo allows each player to plan out 60 seconds of combat and then watch as both sides' commands are carried out simultaneously. The WeGo system also allows for re-watching turn action and playing against another player by email (PBEM) or 'hotseat' on a single computer. RealTime and WeGo head to head play can also use TCP/IP on a LAN or over the Internet. Massive replayability comes from a unique Quick Battle system which allows players to purchase their own custom force and fight over the battlefield of their choice from a wide array of different maps. A powerful map and scenario Editor allows you to create battles or campaigns for yourself and others. HOW UNITS ARE PORTRAYED All units are portrayed one for one in 1:1 scale in high resolution polygon 3D models with articulated suspensions, animated hatches, and other features that make them feel real. Unlike other 3D tactical wargames, Combat Mission combines real world physics with a thoroughly researched portrayal of forces, right down to what the individual soldiers cary into battle. Advanced vehicle damage modeling allows for tracking of each sub-system, including the most realistic ballistics, armor and post-armor effects available in any game. Unlike other games that claim this level of realism, Combat Mission actually delivers it across the whole spectrum of warfare, including the interaction of weather, lighting, and terrain on how units and their weapons function.  Perhaps the most important feature of Combat Mission is its detailed and innovative portrayal of 'soft factors'. Experience, Morale, Leadership, and other elements operate at the individual soldier level and collectively transform how units behave. As important as these battlefield concerns are, most other games give them short shrift or don't bother covering them at all. In the real world having the best weapons means nothing if the soldiers crewing them are balled up in fear or are too distracted to see what's going on around them. HOW THINGS WORK BEHIND THE SCENES Weapon penetration values and armor protection are based on extremely detailed real life data and scientific algorithms that are specific to exactly what is seen in the game. There are no arbitrary values (hitpoints) or precalculated resolution tables (CRTs) that so often produce frustratingly inaccurate results. The advanced Tactical AI (TacAI) models the psychological state and inherent qualities of every soldier on the battlefield, allowing for genuine battlefield behavior from every soldier as if they were their own free thinking individual.  The simulation of independent soldiers is important in another regard because it allows Combat Mission to have what we call Relative Spotting. This is a system which ensures that each soldier has their own unique view of the battlefield, avoiding the 'Borg' issue seen in many games where once one person has spotted an enemy, automatically everyone else has spotted it and can fire on it as well. Any wargamer worth his weight in gunpowder knows that Fog of War is one of the most important battlefield elements. An unprecedented simulation of Command and Control (C2) combines with Relative Spotting to realistically portray the flow of information and responsibility between soldiers as they share information with each other on what they can see on the battlefield  All of these elements, and many more, seamlessly fit together to create the most realistic battlefield experience out there. The realism level isn't pushed in your face with lots of data and obscure references. Instead players experience all of this with the 3D graphical environment. Combat Mission's visceral game environment is what attracts players, the richness of the gameplay is what keeps them playing for years on end. Features: - Tactical warfare at battalion and below scale in a true 3D environment - Command individual vehicles, teams, and squads - Expansive simulation of 'soft factors' such as Morale, Experience, and Leadership - Innovative systems portraying Fog of War, Spotting, Line of Sight, Command &amp; Control, and Objectives - Unmatched realistic physics, ballistics, and battlefield effects - Fight in a wide range of weather and lighting conditions, all of which realistically impact fighting abilities - Unique hybrid system for RealTime or WeGo (turn based) play - Full featured Editor for maps, scenarios, and campaigns - Quick Battle system sets up deliberate or randomized battles based on player specifications - Single player and head to head play, including Play By Email (PBEM) - Detailed and realistic combat formation for the United States Army and Syrian Army - Two types of Syrian Unconventional Forces, Spies, IEDs, and VIEDs - One large campaign, a small training campaign, 20 standalone scenarios, and numerous Quick Battle maps. - On map mortars, mortar vehicles, drones, anti-aircraft fire, and other modern warfare features - Expanded arid combat environment, now including waterways, bridges, and other new terrain - Intricately detailed and highly realistic combat equipment for the United States Army and Syrian Army, including 41 vehicles and 35 assorted small arms and crew weapons. - Expansive maps with 1m x 1m resolution allow for short and long range action across complex terrain - Buildings have explicitly simulated doors, windows, and floors - Weather and ground condition modelling systems allow for everything from dry sunny days to muddy stormy nights, with visibility and mobility dynamically affected by the conditions. Some Combat Mission games include the full range of Winter, Spring, and Fall weather as well - Line of Sight and Line of Fire are separately calculated, which means sometimes you can see something you can't shoot and sometimes you can shoot at things you can't see - Soldier posture (prone, kneeling, standing) affects everything including spotting, cover, and ability to engage enemies - Line of Sight is calculated from the 'eyeballs' or 'sensor' point, not a generic value - Much of Combat Mission's realism comes from correctly simulating important low level details, such as crew responsibilities, vehicle vision blocks, high tech sensors, etc. A 3 man tank with a few cloudy vision blocks doesn't have to be artificially made inferior to a 5 man tank with a commander's cupola and separate vision blocks for the gunner and loader because in Combat Mission it happens naturally - The way a nation organizes its units has a huge impact on how they perform in combat, therefore great pains are taken to accurately portray formations as they are in real life for a particular point in time - Lighting affects combat in no small way in real life as well as in the game. The correct lighting conditions are simulated based on time of day, time of year, and weather",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1369370/header.jpg?t=1615392986",
    "Price": 59.99,
    "Developers": "Battlefront",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1369370/ss_69ca4a82413674e53996cb91ccb38e818f82bb7d.1920x1080.jpg?t=1615392986,https://cdn.akamai.steamstatic.com/steam/apps/1369370/ss_4ced8eea7a9060c8026f5db419c8b9444027e194.1920x1080.jpg?t=1615392986,https://cdn.akamai.steamstatic.com/steam/apps/1369370/ss_33cafd38a6055f598e232e1497b18ef1a1b31b0a.1920x1080.jpg?t=1615392986,https://cdn.akamai.steamstatic.com/steam/apps/1369370/ss_53dcbee28207a04fe10e20a627b7993afe7ced30.1920x1080.jpg?t=1615392986,https://cdn.akamai.steamstatic.com/steam/apps/1369370/ss_606e5f864ed09839466c8020e103a3e57eee5f7f.1920x1080.jpg?t=1615392986",
    "Slug": "combat-mission-shock-force-2",
    "Meta Title": "Combat Mission Shock Force 2: Aug 31, 2020, Battlefront a...",
    "Meta Description": "Looking for information on Combat Mission Shock Force 2? Check out the release date (Aug 31, 2020), developer insights from Battlefront, and a complete ...",
    "Alt Text Image": "Official header image for Combat Mission Shock Force 2 game - Steam 1369370",
    "Canonical URL": "https://gusku.site/game/combat-mission-shock-force-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Combat Mission Shock Force 2\", \"description\": \"Looking for information on Combat Mission Shock Force 2? Check out the release date (Aug 31, 2020), developer insights from Battlefront, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 31, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Battlefront\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1369370/header.jpg?t=1615392986\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}