{
    "AppID": 274480,
    "Name": "Drox Operative",
    "Release date": "Feb 18, 2014",
    "About the game": "Drox Operative is a starship action RPG with warring alien races, fierce space battles, a dynamic, evolving galaxy, and co-op multiplayer for Windows and Mac. Eons ago the Drox ruled the galaxy through their mighty Operatives. These elite starship captains were trained to accomplish the impossible at whatever cost necessary. Whether employing stealth or brute force, they were always deadly. Using these Operatives, the Drox built a starlane system for quick travel amongst the stars, colonized and conquered millions of planets, and ruled the galaxy with an iron grip for over 100,000 years. Eventually realizing their Operatives were a threat, they attempted to assassinate all of them. They failed. The following Galactic Civil War was devastating. Thousands of years later, the Drox are extinct, but the secretive Drox Operative guild lives on. They have learned their lesson though: loyalty to any one race is foolish. They now work for whoever can pay. And pay they do! Empires might span hundreds of planets and thousands of ships, but when a critical task arises, they still turn to an Operative. In the new space race, the major races are scouting, colonizing, and expanding, trying to take over the galaxy by diplomacy, technology, war, or any other means their scheming minds can contemplate. As a Drox Operative it's NOT your job to manage all of those annoying people, build thousands of buildings, play nice with your enemies, or balance the budget. It IS your job to pick the winning side and maybe even help them conquer the galaxy if you're being nice, more importantly though is to rake in as many credits as possible, well that and build the coolest, deadliest ship in the known universe. Not many screw with an Operative captaining a Dreadnaught! Explore a dynamic and evolving galaxy Explore a unique sector of the galaxy in every game, with different 'monsters', ship components, quests, and even races Fight in the galactic war between the various alien races Battle hundreds of different enemy starships Build the coolest and deadliest starship in the galaxy Outfit your ship with thousands of components and crew Adventure with your friends with co-op multiplayer",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/274480/header.jpg?t=1536792013",
    "Price": 19.99,
    "Developers": "Soldak Entertainment",
    "Publishers": "Soldak Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/274480/ss_3e48ce98f0fa24e4626fde9272c59a7a04628552.1920x1080.jpg?t=1536792013,https://cdn.akamai.steamstatic.com/steam/apps/274480/ss_8c53ec15283824832bcabe500800f2ffbf870008.1920x1080.jpg?t=1536792013,https://cdn.akamai.steamstatic.com/steam/apps/274480/ss_755097b923352b4f7e4824db0b3d2e205d93962e.1920x1080.jpg?t=1536792013,https://cdn.akamai.steamstatic.com/steam/apps/274480/ss_2c9d3837dd25fc3b38874adfa684b978aabfbf69.1920x1080.jpg?t=1536792013,https://cdn.akamai.steamstatic.com/steam/apps/274480/ss_fe4bd77fe9352b37384c740a919aa2518a419519.1920x1080.jpg?t=1536792013,https://cdn.akamai.steamstatic.com/steam/apps/274480/ss_2c743457b13efbcd37f8641a1bdfd46805300829.1920x1080.jpg?t=1536792013",
    "Slug": "drox-operative",
    "Meta Title": "Drox Operative: Feb 18, 2014, Soldak Entertainment and Fu...",
    "Meta Description": "Looking for information on Drox Operative? Check out the release date (Feb 18, 2014), developer insights from Soldak Entertainment, and a complete game ...",
    "Alt Text Image": "Official header image for Drox Operative game - Steam 274480",
    "Canonical URL": "https://gusku.site/game/drox-operative",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Drox Operative\", \"description\": \"Looking for information on Drox Operative? Check out the release date (Feb 18, 2014), developer insights from Soldak Entertainment, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 18, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Soldak Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Soldak Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/274480/header.jpg?t=1536792013\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}