{
    "AppID": 1531780,
    "Name": "废土黄昏 Dusk of the wasteland age",
    "Release date": "Feb 18, 2021",
    "About the game": "What kind of game is this? This is a zombie simulation of the end of the environment to survive the game. The background of the game is one year after the zombie outbreak. Players will play three different roles, searching for supplies in an abandoned hospital building to survive. Each character has its own strengths and weaknesses, which will affect their chances of survival. The materials in the game are displayed in the form of cards, which are mainly divided into weapons and consumables. When fighting, random moves will be generated according to the characteristics of weapons to deal with the enemy. Weapons are durable, remember to maximize the use of weapons unique moves to win. Players will lose their health, physical strength and spirit after fighting, moving and strengthening the room for rest. After fighting in an empty room, remember to supplement your own state, otherwise the depressed state will bring serious negative buffs. Finally, in addition to zombies, there may be a small number of survivors in abandoned hospitals. They will be your companions or... Powerful and terrible enemies. (developer's Note 1: because the game mechanism is slightly complicated, I hope you can open the second column of the main menu interface 'survivor log' before playing, in which you will record the detailed game playing methods.) (developer's Note 2: This is the first game developed by the author. We plan to upgrade this game to a multiplayer game in the future. Please include the existing shortcomings. We will continue to polish the game according to the comments and suggestions in the future.) (developer note 3: game communication QQ group: 171849189) (developer note 4: the game will be unpacked and remade on the day of release, and it is expected to be completed within 2 to 3 months. The playing method will be greatly changed. If you like the current version, after the new version goes online, you can send me a private message in QQ group or email to get the original version. Suggestions and requirements for the new version are also welcome.)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1531780/header.jpg?t=1617621238",
    "Price": 0.99,
    "Developers": "香蜂草",
    "Publishers": "香蜂草",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1531780/ss_f971e649cc9aef26c7d7090d164e980368e3d3bf.1920x1080.jpg?t=1617621238,https://cdn.akamai.steamstatic.com/steam/apps/1531780/ss_0a9579f20e16f17934cbed285a1cf4d79c7137af.1920x1080.jpg?t=1617621238,https://cdn.akamai.steamstatic.com/steam/apps/1531780/ss_b3610b9dcb8a806a663f7cf480e1d2558f3fc758.1920x1080.jpg?t=1617621238,https://cdn.akamai.steamstatic.com/steam/apps/1531780/ss_187959a702d92f456fd13a606847ac6582bfcc5f.1920x1080.jpg?t=1617621238,https://cdn.akamai.steamstatic.com/steam/apps/1531780/ss_c3ede62846f1cd4bf4bf22ebe70ab675242357a9.1920x1080.jpg?t=1617621238",
    "Slug": "dusk-of-the-wasteland-age",
    "Meta Title": "废土黄昏 Dusk of the wasteland age: Feb 18, 2021, 香蜂草 and Ful...",
    "Meta Description": "Looking for information on 废土黄昏 Dusk of the wasteland age? Check out the release date (Feb 18, 2021), developer insights from 香蜂草, and a complete game s...",
    "Alt Text Image": "Official header image for 废土黄昏 Dusk of the wasteland age game - Steam 1531780",
    "Canonical URL": "https://gusku.site/game/dusk-of-the-wasteland-age",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5e9f\\u571f\\u9ec4\\u660f Dusk of the wasteland age\", \"description\": \"Looking for information on \\u5e9f\\u571f\\u9ec4\\u660f Dusk of the wasteland age? Check out the release date (Feb 18, 2021), developer insights from \\u9999\\u8702\\u8349, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 18, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u9999\\u8702\\u8349\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u9999\\u8702\\u8349\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1531780/header.jpg?t=1617621238\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}