{
    "AppID": 1268380,
    "Name": "Endless RPG: Random Dungeon Map Generator for D&D 5e",
    "Release date": "Apr 15, 2020",
    "About the game": "Endless RPG is a random dungeon and map generator for 5th Edition Dungeons and Dragons. The Random Dungeon Generator is not a game. It is is a tool for playing D&amp;D 5e alone, in a small group without a dungeon master, or with a dungeon master as either a standalone adventure or an easy way to get into the game. The tool can even be used for running full campaigns as an easy way to fill a tower with gobins or some ruins with the undead. Endless RPG is also available for mobile platforms, but on Windows you get the benefits of a big screen. *** PLAY SOLO OR IN A GROUP WITHOUT A DM *** The Random Dungeon Generator allows you to explore a randomly-generated dungeon through a fog-of-war discovery system with encounters, traps, tricks and treasures shown as you encounter them and roll your own dice to determine the outcome. This is perfect for solo play or groups without a dedicated dungeon master. Learn more about playing D&amp;D alone or in a group without a DM . ***USE AS A DM TOOL *** Custom Dungeons allow you to pick the CR level, environment (dungeon, cave, etc.) and enemy (orcs, undead, demons, etc.) and can generate a single level or multiple level dungeons. This is a great way to quickly build a side adventure or do some of the heavy lifting for your campaign. You can easily get at the map images for importing into different software. *** CUSTOMIZE YOUR MAPS! *** As a DM, you have a variety of tools to customize the maps. This includes editing encounters, adding or deleting monsters, editing treasure, adding items, moving traps or setting custom messages for your players, which can allow you to add custom events or traps. Endless RPG isn't a full map editor, but these customization options can ensure that encounters and treasures are found where you want them to be found. *** MULTIPLE DUNGEON TYPES AND MULTI-LEVELS *** The missions created by Endless RPG can encompass different types of 'dungeons' including caves, ruins, strongholds or the classic dungeon. The missions can also be on a single level or multiple levels mixing and matching the dungeon types, so you can explore a cave that leads to ruins or a stronghold with a dungeon below it. *** QUICK BATTLE AND BATTLE MAPS FOR COMBAT MANAGEMENT*** The app aids in keeping track of hit points with characters on the screen while exploring. When encountering creatures, the player has a choice of simply clearing the encounter (the monsters will be considered defeated), utilizing a Quick Combat mode, which is great for small battles with just a few creatures, or a full Battle Map, which allows a more tactical way of resolving combat. *** SUPPORTS UP TO 8 CHARACTERS *** Players can run through the dungeon as a single character or a party of up to eight characters. A 'character' can also include guard dogs, guard bears, or other non-standard creatures. *** EXPERIENCE AND LOOT TABLES *** The app will keep track of the monsters you have killed, including the over experience points and experience points by character. It will also track the treasure (magic items, coins, etc.) you have looted on your adventure.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1268380/header.jpg?t=1587059091",
    "Price": 2.99,
    "Developers": "Nations Software",
    "Publishers": "Nations Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1268380/ss_ff3e66979a4c485e28a838bc5c76cb7f58d3e723.1920x1080.jpg?t=1587059091,https://cdn.akamai.steamstatic.com/steam/apps/1268380/ss_6732474de69f93844f9df88b42e9890486f38b22.1920x1080.jpg?t=1587059091,https://cdn.akamai.steamstatic.com/steam/apps/1268380/ss_a4e6e1820d91104658a79b3fca35644bd6832e56.1920x1080.jpg?t=1587059091,https://cdn.akamai.steamstatic.com/steam/apps/1268380/ss_65f589e31a39163a2cbe8e25fba9d2406fd2dc18.1920x1080.jpg?t=1587059091,https://cdn.akamai.steamstatic.com/steam/apps/1268380/ss_90ebd7e76b91c4f913e8f957c42bc2e75da2af72.1920x1080.jpg?t=1587059091,https://cdn.akamai.steamstatic.com/steam/apps/1268380/ss_73803428c81a7d28017d0056988cf9ad70365fa4.1920x1080.jpg?t=1587059091",
    "Slug": "endless-rpg-random-dungeon-map-generator-for-d-d-5e",
    "Meta Title": "Endless RPG: Random Dungeon Map Generator for D&D 5e: Apr...",
    "Meta Description": "Looking for information on Endless RPG: Random Dungeon Map Generator for D&D 5e? Check out the release date (Apr 15, 2020), developer insights from Nati...",
    "Alt Text Image": "Official header image for Endless RPG: Random Dungeon Map Generator for D&D 5e game - Steam 1268380",
    "Canonical URL": "https://gusku.site/game/endless-rpg-random-dungeon-map-generator-for-d-d-5e",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Endless RPG: Random Dungeon Map Generator for D&D 5e\", \"description\": \"Looking for information on Endless RPG: Random Dungeon Map Generator for D&D 5e? Check out the release date (Apr 15, 2020), developer insights from Nati...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 15, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nations Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nations Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1268380/header.jpg?t=1587059091\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}