{
    "AppID": 1148730,
    "Name": "Errant Kingdom (Chapters 0-5)",
    "Release date": "Jan 24, 2020",
    "About the game": "Errant Kingdom is a queer, high-fantasy episodic visual novel (releasing in chapters on a bi-monthly basis throughout 2020) for PC, Mac &amp; Linux, brought to you by Lunaris Games, a tiny team of five indie developers. Our first game, supernatural murder mystery When The Night Comes . is currently #3 on itch.io's top-rated games! Errant Kingdom is our first Unity release. The Kingdom of Novus has been thrown into disarray, and it's up to you to decide if you’ll help to bring peace, or if you’ll stoke the fires of chaos. Enter a high fantasy world steeped in political intrigue; where magic touches the land and blood turns the wheels unseen. Dishonor &amp; betrayal. Hope &amp; despair. Pick a side, and meet your match. Errant Kingdom is a story with darker elements at play. As a denizen of the kingdom of Novus, you're at the heart of watching history unfold before your eyes. Whether you see its rise or fall, however, is up to you. There are those who will help you in your endeavors along the way, and might even find themselves enamoured with you. Though, it is also possible to earn their ire should your plans be devious. Only you will influence how the story evolves, and the most important moves to make are yours, and yours alone. Errant Kingdom features three playable protagonists (with no fixed protagonist portrait, leaving players free to imagine their character as they see fit) and eight potential romance routes (six individual, two polyamorous). You can also play the game without romancing anyone and it will not affect your experience in any way. The game will be released in volumes on a bi-monthly (once every two months) basis. We plan for there to be a minimum of 5 volumes, each totalling a minimum of 2 hours of playtime across all three routes. Your purchase will give you access to the download of the Prologue and all subsequent Volume updates after this throughout 2020 will be free updates. We have no in-game purchases, and this one-off cost will give you access to a potential 240+ hours of gameplay when taking into account our 8 romance routes, our no romance play-through, and our three different MC roles. Each play-through has the potential to be vastly different, depending on your choices, your actions, and the way you interact with those around you! This game is made with Unity. Features Three unique character routes; The Knight, The Ambassador and The Nomad Six individual romances &amp; two polyamorous romances LGBTQA+ cast Choose your own pronouns Minimum of 12 unlockable CGs per chapter Option to pursue romances without sexual content, or to play without romancing anyone at all Role-specific stats Mini-games Love Interests Errant Kingdom has a LGBTQA+ cast of love interests, each with their own unique backgrounds and intertwining stories. You will begin the game as merely an acquaintance, but as the story progresses you will have the chance to spend time with each of them. Eventually, if you choose a romance route, you will become exclusive with one (or two, if polyamorous options are selected) of our love interests, and will gain access to special scenes, CGs, and conversations. All six love interests are romanceable individually, and our polyamorous relationships are Lucien &amp; Raiden, and Maja &amp; Erik. Roux is asexual, and Livia is demisexual. Our story is linear, so once a romance is selected, you will still interact with all of our other cast members! We're trying to bring an RPG style of gameplay to the Visual Novel world, and this is one of the elements we're most passionate about executing well.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1148730/header.jpg?t=1614558979",
    "Price": 19.99,
    "Developers": "Lunaris Games",
    "Publishers": "Lunaris Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1148730/ss_06c07ab16cb2a09fdc8b85c52fe98aeefead9d54.1920x1080.jpg?t=1614558979,https://cdn.akamai.steamstatic.com/steam/apps/1148730/ss_14bc17fdd03a28484f175b2e6630c87edd64923f.1920x1080.jpg?t=1614558979,https://cdn.akamai.steamstatic.com/steam/apps/1148730/ss_7d38d7c81e9bb016fc3f2d084068eb45ba5d9f9b.1920x1080.jpg?t=1614558979,https://cdn.akamai.steamstatic.com/steam/apps/1148730/ss_31d02effec9ff693b1758bc3370991c28ff0c4ef.1920x1080.jpg?t=1614558979,https://cdn.akamai.steamstatic.com/steam/apps/1148730/ss_1b47eb524e4d98029481edc4f5dc4f50b28711bd.1920x1080.jpg?t=1614558979,https://cdn.akamai.steamstatic.com/steam/apps/1148730/ss_3a7b3f1d8ee7ff263b2af9f22189fbeff08c6c99.1920x1080.jpg?t=1614558979,https://cdn.akamai.steamstatic.com/steam/apps/1148730/ss_9bcc0dfa27be7b2ec3a0a765b77a99095b0d251a.1920x1080.jpg?t=1614558979,https://cdn.akamai.steamstatic.com/steam/apps/1148730/ss_eefb4bcdb34447f01c72466251081f2a4ab8184f.1920x1080.jpg?t=1614558979,https://cdn.akamai.steamstatic.com/steam/apps/1148730/ss_2ce36c54e2313dadce2ca1c8bed40d6459c8b2bd.1920x1080.jpg?t=1614558979,https://cdn.akamai.steamstatic.com/steam/apps/1148730/ss_50e40873ceac4dcd0dfbf9677283cb634c31af5d.1920x1080.jpg?t=1614558979,https://cdn.akamai.steamstatic.com/steam/apps/1148730/ss_fc5a02e141199c86257395e7ad08da62ea7b640f.1920x1080.jpg?t=1614558979",
    "Slug": "errant-kingdom-chapters-0-5",
    "Meta Title": "Errant Kingdom (Chapters 0-5): Jan 24, 2020, Lunaris Game...",
    "Meta Description": "Looking for information on Errant Kingdom (Chapters 0-5)? Check out the release date (Jan 24, 2020), developer insights from Lunaris Games, and a comple...",
    "Alt Text Image": "Official header image for Errant Kingdom (Chapters 0-5) game - Steam 1148730",
    "Canonical URL": "https://gusku.site/game/errant-kingdom-chapters-0-5",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Errant Kingdom (Chapters 0-5)\", \"description\": \"Looking for information on Errant Kingdom (Chapters 0-5)? Check out the release date (Jan 24, 2020), developer insights from Lunaris Games, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lunaris Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lunaris Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1148730/header.jpg?t=1614558979\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}