{
    "AppID": 1046790,
    "Name": "Eternal Threads",
    "Release date": "Mar 19, 2022",
    "About the game": "Eternal Threads is a single-player, first-person story-driven puzzle game of time manipulation, choice and consequence. As an operative tasked with fixing corruption in the timestream, you have been sent to the North of England in May 2015, where six people died in a house fire. Prohibited from simply stopping the fire, you must instead manipulate the choices made by the housemates in the week leading up to it so that they all survive the event. From the outset, you have free and complete reign to explore the seven day timeline before the fire. You can watch and alter the significant events from the entire week as many times as you like and in whatever order you wish. Some decisions will have only minor effects on the timeline, moving objects around the house or revealing deeper stories and secrets. Major changes however, rewrite the timeline by changing existing events, adding new events and even replacing other events entirely. You must traverse up and down this timeline, changing decisions at different moments throughout the week so that their effects interact and combine together to save all six housemates. However, it is not just the housemates who have choices. Each of them can be saved from the fire in multiple ways, with each outcome having a profound effect on their lives in the future. Will you just search for the quickest and easiest solution, or can you find the best possible outcome for everyone? Ultimately, everything is about choices and consequences. Features Choose how you want to follow the game’s story The complete narrative follows the six main characters through multiple decisions across multiple timelines and you can experience these in any way you choose. You can concentrate on just one particular character’s storyline at a time, following their choices across the timelines and then go back to the start and follow another character. You can approach the story like a forensic detective, observe the final outcomes of the story and then work backwards along the timeline – essentially observing the effects and then determining their cause. Or you can just watch things in chronological order, experiencing the timeline unfold as you observe and change the decisions that the characters face as the week progresses. Watch and change things as many times as you like Can’t remember exactly what happened in an event? Changed a decision and you’re not sure you like the consequences? That’s fine. Just pop back along the timeline and watch and change whatever you like, whenever you like, as many times as you like. Change the past to affect the future Setting up temporary base in the house mere hours after the fire, provides a unique perspective on events. As you look back through the timeline, past events play out in front of you in ghostly form, with the smoke and fire damaged house a constant reminder of what is to come. In addition, as you manipulate the past, the environment can be reset around you to match the changes taking place. Some new objects will appear, others will move around the house and the contents of rooms can change substantially as you change the past.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1046790/header.jpg?t=1656678939",
    "Price": 19.99,
    "Developers": "Cosmonaut Studios",
    "Publishers": "Secret Mode",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1046790/ss_0c64bab2e48a3e38725b2270f3866c23cc9bf533.1920x1080.jpg?t=1656678939,https://cdn.akamai.steamstatic.com/steam/apps/1046790/ss_97c6b0d1586165d373ab759c13e2d730ad0d3f83.1920x1080.jpg?t=1656678939,https://cdn.akamai.steamstatic.com/steam/apps/1046790/ss_86f920d4e28d672cf20c2e69edb7a005ab3999ea.1920x1080.jpg?t=1656678939,https://cdn.akamai.steamstatic.com/steam/apps/1046790/ss_8b839bc2a128aecb7e21c47888af2c70dcd67aa3.1920x1080.jpg?t=1656678939,https://cdn.akamai.steamstatic.com/steam/apps/1046790/ss_4a03156b6ee66ff8f96bdae4304a75952bbf8b37.1920x1080.jpg?t=1656678939,https://cdn.akamai.steamstatic.com/steam/apps/1046790/ss_e4174f7ecf06a442219bb7a695670160e136077c.1920x1080.jpg?t=1656678939,https://cdn.akamai.steamstatic.com/steam/apps/1046790/ss_c360d49fe892b7ad91cc3783a66dffc9b56ad1bd.1920x1080.jpg?t=1656678939,https://cdn.akamai.steamstatic.com/steam/apps/1046790/ss_7dfc79d5bae1b08230d73fbc0ea597adc4907a47.1920x1080.jpg?t=1656678939,https://cdn.akamai.steamstatic.com/steam/apps/1046790/ss_426894fc613edabfa4a753ff94d1374c902d18ce.1920x1080.jpg?t=1656678939,https://cdn.akamai.steamstatic.com/steam/apps/1046790/ss_0e50a19864023f48e32aee9756fcecf0f5daea79.1920x1080.jpg?t=1656678939,https://cdn.akamai.steamstatic.com/steam/apps/1046790/ss_e74cbe5e71f21063e322ffda4120edc8e52ca890.1920x1080.jpg?t=1656678939,https://cdn.akamai.steamstatic.com/steam/apps/1046790/ss_ee986ea937797304c22700ff3502e63fcba9307e.1920x1080.jpg?t=1656678939",
    "Slug": "eternal-threads",
    "Meta Title": "Eternal Threads: Mar 19, 2022, Cosmonaut Studios and Full...",
    "Meta Description": "Looking for information on Eternal Threads? Check out the release date (Mar 19, 2022), developer insights from Cosmonaut Studios, and a complete game su...",
    "Alt Text Image": "Official header image for Eternal Threads game - Steam 1046790",
    "Canonical URL": "https://gusku.site/game/eternal-threads",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Eternal Threads\", \"description\": \"Looking for information on Eternal Threads? Check out the release date (Mar 19, 2022), developer insights from Cosmonaut Studios, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cosmonaut Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Secret Mode\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1046790/header.jpg?t=1656678939\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}