{
    "AppID": 1246320,
    "Name": "Euler Wars",
    "Release date": "Feb 29, 2020",
    "About the game": "THIS GAME IS BRUTALLY HARD!!! If you're looking for a fresh new approach to space combat with lots of customization that will seriously challenge your flight capabilities while also supporting an indie developer, this game is for you! As with any in depth space sim game, there's a lot to learn. If you've never heard of this game before, you should probably check out the intro video by searching Euler Wars by Benderite Games on YouTube. Euler Wars lets you take control of ships based on Platonic and Archimedean solids. Any direction of the ship can be made the front. Can you not see through the broken modules? Rotate yourself within the ship and keep those weapons pointed at the enemy! Each face on the ship can be customized with various modules and weapons to fit your play style. With full 6 axis controls this game will challenge your 3D spatial abilities and test your hand-eye coordination. I'm a huge fan of space sims but have always had issues with various aspects of the games. Unfair progression systems, boring unlock systems, bad ship designs, and unrealistic movements have always annoyed me. Being a software developer I thought 'I'll make my own game!' which is what I've now done. Here's what sets Euler Wars apart from other space sims: Progression System -Your progress is linked to both your abilities as a pilot as well as how much you've played the game. -If you're a skilled pilot, you won't need to grind experience to unlock new ships. -If you're a beginner pilot, you can grind experience to make up for your lack of skill. Unlock System -All weapons and modules in the game are unlocked at the start. -You'll never have to feel underpowered just because you're starting out. Even the starter ship can be as strong as it ever will be. -All arena locations are unlocked at the start. -You can play wherever you'd like to fit your play style. Do you like to hide? Enter the asteroid field. Want a challenge? Enter the hyperdimensional solids. -Ships will be unlocked based on the progression system described above. Grinding experience isn't necessarily when you're a very skilled pilot but it can help you progress if you're unskilled. Ship Designs -All ships are based on regular polyhedra. You won't see any wings or wheels on these ships designed specifically for space combat. -You'll be able to fly all 5 Platonic solids and all 13 Archimedean solids. Movement -You have full 6 axis control of your ship. -Each rotation direction is equally strong meaning you can look up as fast as you can look right or rotate clockwise. -Each movement direction is equally strong meaning you can move forward as fast as you can move right or up. Note: These controls can take a while to get used to. Once you do, though, you can fly around things unlike any other game. Spherical Ships Possibly the biggest differentiator between Euler Wars and other games is the ship design. Being based on regular polyhedra means that as the ships get larger they become more spherical. This means there isn't really a 'front' of your ship. That's why I've create 'rotation lock'. -When a side of your ship gets destroyed and modules no longer work, you can rotate yourself relative to the ship to make a new side the 'front'. -This mechanic encourages you to design your ship uniformly so any direction can be effectively the front. -If you want to play more riskily you can design your ship with all weapons on one side. This gives the benefit of higher burst damage but is harder to recover from if you lose modules.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1246320/header.jpg?t=1583367816",
    "Price": 0.99,
    "Developers": "Benderite Games",
    "Publishers": "Benderite Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1246320/ss_aa2d7fe1418b2261405bb481ac44cf4bb3593ba8.1920x1080.jpg?t=1583367816,https://cdn.akamai.steamstatic.com/steam/apps/1246320/ss_608e84c761b403cdaef00a8c3e98f2121704b668.1920x1080.jpg?t=1583367816,https://cdn.akamai.steamstatic.com/steam/apps/1246320/ss_1ce9ff3cadad7af7614052fd254d9c3b8da95968.1920x1080.jpg?t=1583367816,https://cdn.akamai.steamstatic.com/steam/apps/1246320/ss_547beb516d23b4d955b4591cb00d76aebac97dac.1920x1080.jpg?t=1583367816,https://cdn.akamai.steamstatic.com/steam/apps/1246320/ss_cbf04a014828fa53d5049bc4db38e11d93ab4943.1920x1080.jpg?t=1583367816,https://cdn.akamai.steamstatic.com/steam/apps/1246320/ss_acd0f250a1ec9c558f4466af5f3d8da90a189c3b.1920x1080.jpg?t=1583367816,https://cdn.akamai.steamstatic.com/steam/apps/1246320/ss_6912b76f4d39275e60f41b93f033d7a0d4264a29.1920x1080.jpg?t=1583367816",
    "Slug": "euler-wars",
    "Meta Title": "Euler Wars: Feb 29, 2020, Benderite Games and Full Overview",
    "Meta Description": "Looking for information on Euler Wars? Check out the release date (Feb 29, 2020), developer insights from Benderite Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Euler Wars game - Steam 1246320",
    "Canonical URL": "https://gusku.site/game/euler-wars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Euler Wars\", \"description\": \"Looking for information on Euler Wars? Check out the release date (Feb 29, 2020), developer insights from Benderite Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Benderite Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Benderite Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1246320/header.jpg?t=1583367816\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}