{
    "AppID": 390560,
    "Name": "Fantasy Strike",
    "Release date": "Jul 25, 2019",
    "About the game": "Free-to-play , the good kind like DOTA2: Play all our characters online for free without any grinding or unlocks! Free Modes: Online Casual Play, Online Ranked Play, Practice Mode, Single Match vs. AI Be an archer with fiery arrows, a colorful painter, a martial arts master who can transform into a dragon, and more! Fantasy meets martial arts in this vibrant world. If You’re New To Fighting Games Designed to work great on keyboard, no need for a special controller. We’ve streamlined the genre to get you to the fun decision-making part as soon as possible. All moves are just a single button press, combos are easy, move lists are concise. We’ve cut the chaff to focus on the heart of the genre so we can show you why fighting games are awesome. If You’re a Veteran This game is designed by an ex-Street Fighter dev and hardcore player for play in tournaments. Mixups, rushdown, zoning, and the grapplers seeming too powerful on day 1. It’s got all that. And you can play it with pretty much anyone in the fighting game community, no matter what other fighting game they play, because you can all reach basic competency in Fantasy Strike in minutes and start playing for real. Plus you can play with a joystick, gamepad, Guitar Hero controller, or whatever else you want. Stuff You Get For Free • Excellent online play + cross-platform play. We are not aware of better networking tech in any other fighting game, and we're sorry about how that sounds. Custom implementation of GGPO networking technology. Cross-platform with both Nintendo Switch and PlayStation 4 version. • Online quick match. Just pick a character, click ready, and you're playing online. • Online ranked play. Pick a team of 3 characters in this team battle mode. You'll play a series best 3 out of 5 games where you get to play each of your characters in separate games, for maximum variety. This mode uses built-on-the-fly tournaments. • One-click spectating. Click on any friend in your in-game friends list to watch them play and automatically follow them as they play more online games. That’s it! • Daily Challenge. An endless survival mode that you can only play ONCE per day. See how you do compared everyone else that day. • Practice mode. Includes dynamic frame data and frame-step features. • Tutorial. A quick, 5-minute tutorial teaches you the basics of how the game works. • Single Match vs AI. Pick your character and the AI's, then play a game. As much as you want! • Spotlight Videos. Every character has their own spotlight video, a narrated tour by game director David Sirlin. Each video goes though that character's moves and what their general gameplan and strategy is about. • Unique throw escape. To escape (normal) throws, simply let go of all your controls! You'll automatically 'yomi' counter any throw attempt. • Simple controls. All moves are done with a single button press so you can play with any controller. Core Pack If you're looking for even more, get the Core Pack for these additional modes: • Boss Rush mode. Build a deck of powerups in this very crazy roguelike mode. Can you defeat all 8 of the increasingly powerful bosses? • Arcade mode. With illustrated, voiced story intros and endings. • Survival modes. How long can you last in these four sub-modes? Each is a rapid-fire series of opponents with no loading times between them. Opponents get stronger as you go and include Shadow Bosses. • Local versus. Play standard 1v1 and also 3v3 team battle (each player picks 3 characters and plays a special best 3 out of 5 series). • Friend Challenge. Directly challenge friends online to either standard 1v1 or 3v3 team battles. To play a friend, go to your in-game friends list and click on the crossed swords by any name to challenge them. (Or click on the eyeball to watch them play.) That’s it!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/390560/header.jpg?t=1625622084",
    "Price": 0.0,
    "Developers": "Sirlin Games",
    "Publishers": "Sirlin Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_4bc0f43c2f3e9afa683574e18af7c5133dc4db27.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_c5109e36381674d3e35a29ebd71611a7d91bae9a.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_b8b1a6f4530d9bafd7719c7b0d7ecdc3aee692e4.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_c96ef37f70c88f2f087614f59303cd19cc476dcb.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_1a6c581da353f1d1dc3214b19af96d70e08914e0.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_466e672d00c1482aa4e1d2016d2cbdc84e82edd3.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_be03d3ecebb55590e351c98b6f2769817f012183.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_d2f9f6e9e6467736dda519157214743c05a1dec6.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_79d0d9517e1cf66d1db7fd41a62d64e4cf668c55.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_729a81ca1eece3050100aaf3297813353bf2bd73.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_6597c8fad6a65023e8aebbd497ecd9f4d4104894.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_442db23ae73d44f0a53cfc9603bd233bdd09c2cd.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_0c831cf354c62dab03af91c4c835367b0ee38c33.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_81c47972471aa62c34fd59fbdba276f4bdc45ec1.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_9d98e50399ffbcdef7e483b8e13c9580bc4b1127.1920x1080.jpg?t=1625622084,https://cdn.akamai.steamstatic.com/steam/apps/390560/ss_7a48c9547aa79b56f8eab66e3bbfef7670e4e7af.1920x1080.jpg?t=1625622084",
    "Slug": "fantasy-strike",
    "Meta Title": "Fantasy Strike: Jul 25, 2019, Sirlin Games and Full Overview",
    "Meta Description": "Looking for information on Fantasy Strike? Check out the release date (Jul 25, 2019), developer insights from Sirlin Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Fantasy Strike game - Steam 390560",
    "Canonical URL": "https://gusku.site/game/fantasy-strike",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fantasy Strike\", \"description\": \"Looking for information on Fantasy Strike? Check out the release date (Jul 25, 2019), developer insights from Sirlin Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 25, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sirlin Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sirlin Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/390560/header.jpg?t=1625622084\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}