{
    "AppID": 1473540,
    "Name": "Gondola's Adventure",
    "Release date": "Feb 24, 2021",
    "About the game": "Climb. Fall. Climb back again. Gondola's Adventure is a difficult procedurally generated precision platformer that includes a Story Mode and a Local Multiplayer Mode. Local Multiplayer Mode Challenge up to 3 of your friends or frenemies to a climbing race! Choose from 4 different default game modes, or create your own custom game mode! Normal Mode - With Fall Damage disabled, the first one to reach the end of the level wins! Lava Mode (RECOMMENDED) - Rising lava is introduced to enable quick matches. The lava starts moving after one minute and will completely fill the level after another 4 minutes. Avoid the lava at all cost and be the first one to reach the top, or be the Gondola that reached the highest point! One Life Climb - With Fall Damage enabled, either be the first one to reach the top or be the Gondola that reached the highest point! Last Gondola Standing - With Lava and Fall Damage enabled, this mode is all about surviving the longest. Either be the first one to reach the top or survive longer than your opponents! Custom - Use the available advanced settings to fully customize the climbing match. Faster rising lava? shorter climbing distance? longer or smaller platforms? It is all up to you! Story Mode Starting your adventure from The Cursed Mines, can you persevere and reach the Queen's Castle in the Sky? Choose from 5 different difficulties. Casual - Suitable for players unfamiliar or new to the game genre. Unlimited number of lives where the player can respawn at checkpoints set throughout the game. Each jump is partially projected with a trajectory. The fastest way to complete the story mode. Normal - Similar to the Casual difficulty, but without the jump trajectory, making it slightly more difficult. Classic - The standard difficulty in the genre: no checkpoints or life/respawn system. One mistake can cost most of your progression. Hard - Suitable for players seeking a challenge. Can you complete the story mode with only three lives? Hardcore - A challenge for the best of the best. Attempt to complete the story mode without once falling to your demise. Additional Features Includes 4 different levels with each their own unique obstacles and platforms to overcome! The levels are procedurally generated - over 900 million possible variations. Leaderboards for each difficulty ranked on fastest game completion - Compete against your friends or strangers around the world! Replayability - Continue to challenge yourself to complete the story mode on the harder difficulties. Perhaps you will be the first one to complete the game on Hardcore difficulty?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1473540/header.jpg?t=1620062482",
    "Price": 7.99,
    "Developers": "IceBear's Untold Tales",
    "Publishers": "IceBear's Untold Tales",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1473540/ss_abf8f2b76c3d80f0b0e38a2f547ecdbce1e4aa36.1920x1080.jpg?t=1620062482,https://cdn.akamai.steamstatic.com/steam/apps/1473540/ss_625eaf976899e0372c6b659818105f767da40c44.1920x1080.jpg?t=1620062482,https://cdn.akamai.steamstatic.com/steam/apps/1473540/ss_c48ba7f68aa0bbbbcd0e5fe0113e9322fe845419.1920x1080.jpg?t=1620062482,https://cdn.akamai.steamstatic.com/steam/apps/1473540/ss_2d7a358556edd0ab4eef28d62a647d6235d356ec.1920x1080.jpg?t=1620062482,https://cdn.akamai.steamstatic.com/steam/apps/1473540/ss_44db424bebb3fd7abda6181a27b8773e9d212226.1920x1080.jpg?t=1620062482,https://cdn.akamai.steamstatic.com/steam/apps/1473540/ss_2a4278492a367cd766577828c4c20545a3f87e6b.1920x1080.jpg?t=1620062482,https://cdn.akamai.steamstatic.com/steam/apps/1473540/ss_50683ac3f5c67dddb2933b7d8956dc5b97383197.1920x1080.jpg?t=1620062482",
    "Slug": "gondola-s-adventure",
    "Meta Title": "Gondola's Adventure: Feb 24, 2021, IceBear's Untold Tales...",
    "Meta Description": "Looking for information on Gondola's Adventure? Check out the release date (Feb 24, 2021), developer insights from IceBear's Untold Tales, and a complet...",
    "Alt Text Image": "Official header image for Gondola's Adventure game - Steam 1473540",
    "Canonical URL": "https://gusku.site/game/gondola-s-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gondola's Adventure\", \"description\": \"Looking for information on Gondola's Adventure? Check out the release date (Feb 24, 2021), developer insights from IceBear's Untold Tales, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 24, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"IceBear's Untold Tales\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"IceBear's Untold Tales\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1473540/header.jpg?t=1620062482\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}