{
    "AppID": 1287850,
    "Name": "Guilded",
    "Release date": "May 26, 2020",
    "About the game": "Guilded is a single player strategy game about characters, groups, and their stories. You play as the leader of an Adventurers Guild, where you send adventurers on quests, accounting for how well they work together based on their skills, personalities, and relationships with one another. With procedurally generated characters, narrative, quests, and items, every play through of Guilded is different from the last, and every ridiculous conflict will have varying outcomes. This unique strategy game is as much about progression as it is about the stories you create by playing. ONLY THE FIRST TWO MONTHS ARE PLAYABLE. THE GAME WILL NOT PROGRESS PAST MARCH 4TH. Send Adventurers on Quests No two quests will be exactly the same. Generating with different objectives, difficulties, rewards, and durations, a variety of skill sets and dispositions are needed to successfully run the guild. All adventurers- from cowardly brawlers to saintly chefs- will be perfectly suited to some quests, and wholly unqualified for others. Oversee Unique Characters Every adventure has their own unique, procedurally generated personality. Different mixes of bravery, empathy, and motivation will affect their behavior on quests, while generated likes, dislikes, and reactions to in-game events create an emergent story. As they develop in their career, adventurers level up, improve their skills, and gain better equipment to face the challenges ahead. Foster Relationships As with any job, every adventurer will have an opinion of their fellow adventurers- sometimes good, and sometimes not. These relationships develop as adventurers spend time together on quests and converse in town. Adventurers will judge their fellow party members based on their behavior, and they form relationships with each other that affect their performance on quests. Guild members that get along will work together and boost quest performance, while those that hate one another will go so far as to sabotage a quest out of spite for the other. Don’t worry too much if a pair hates each other’s guts- you can always send them to a few days of therapy to encourage an understanding between them. Keep Your Guild Members Happy If your adventurers don’t like their job, they will quit, and there are a number of ways to upset your adventurers. Sending them on quests with people they hate, failing quests over and over, or outright not paying them their salaries may just upset them enough to make them leave the guild altogether. Keeping your adventurers happy may while balancing the monetary needs of the business is critical to running the guild successfully.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1287850/header.jpg?t=1590606779",
    "Price": 0.0,
    "Developers": "Adjective Noun",
    "Publishers": "Adjective Noun",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1287850/ss_aa9a4fab6922c924fb8f812acb52fab400b14714.1920x1080.jpg?t=1590606779,https://cdn.akamai.steamstatic.com/steam/apps/1287850/ss_58bb587baa9b7db1eae590254af16e62fa559f32.1920x1080.jpg?t=1590606779,https://cdn.akamai.steamstatic.com/steam/apps/1287850/ss_ef1bd9a808c9d5fcfc3b2c8db6c051c2718d3c20.1920x1080.jpg?t=1590606779,https://cdn.akamai.steamstatic.com/steam/apps/1287850/ss_89b6177db078fb6b83082ee8212248c9098a9e3b.1920x1080.jpg?t=1590606779,https://cdn.akamai.steamstatic.com/steam/apps/1287850/ss_bc28b455b8e192ba2f5779282ade2d8178c6f761.1920x1080.jpg?t=1590606779,https://cdn.akamai.steamstatic.com/steam/apps/1287850/ss_043f7d80975a0f07627d229ca85c5b63d82ae9fa.1920x1080.jpg?t=1590606779",
    "Slug": "guilded",
    "Meta Title": "Guilded: May 26, 2020, Adjective Noun and Full Overview",
    "Meta Description": "Looking for information on Guilded? Check out the release date (May 26, 2020), developer insights from Adjective Noun, and a complete game summary.",
    "Alt Text Image": "Official header image for Guilded game - Steam 1287850",
    "Canonical URL": "https://gusku.site/game/guilded",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Guilded\", \"description\": \"Looking for information on Guilded? Check out the release date (May 26, 2020), developer insights from Adjective Noun, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Adjective Noun\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Adjective Noun\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1287850/header.jpg?t=1590606779\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}