{
    "AppID": 567160,
    "Name": "Katy and Bob: Safari Cafe",
    "Release date": "Jun 17, 2018",
    "About the game": "Katy and Bob arrived home from their adventures, made up with their dad and started planning a new journey. “Want to go to the Vikings Village park in Norway, huh Katy? Their yearly restaurant games are on now.” “All that village life isn’t for us, Bob! Especially since we’ve been planning a tour around Asia for ages. Just imagine it, we’ll see the Great Wall! It’s an entire stronghold built to protect against tribal raids!” “Katy, the last tribe that saw those walls was long before we were born. HG, the Emperor of China had all the insights into how to stop the raids and protect his kingdom, and also his settlers.” “You’re so dull, Bob! Then let’s go to Singapore! They say it’s the best town to live in, and also handy. We’ll have a cookout on the beach.” “I’d want to drink coffee, as in Roma, you remember? Best coffee I ever had! Are there coffee shops in Singapore?” “I don’t even know, Bob. Our realtor lives there, we should get in touch and find out! I remember he had some kind of cooking craze.” “I always thought he paints figurines. Once I saw him painting a family of gnomes. Or were they brownies?” “They were orcs, Bob! An orc and his tribe. They wrote about those figurines in the Evening Chronicle. His orc took first place in a miniatures competition, and he won a Traeger grill.” “That’s a great grill! Did I imagine it, Katie, or was that the doorbell?” “It must be the postman!” It really was the postman, with a letter from their friends on the island. Our heroes have been invited to open a cafe in the local safari park. Not wanting to miss such an exciting chance, the whole happy family set off on a journey to open a new business. The island adventures continue! Brace yourself for colorful locations, exciting levels, fun characters, bonus tasks on every level, an upgradable team, all types of trophies, simple gameplay for any age, pleasant music and a captivating plot. You’ll never say: 'Gamestop!' while playing this game. Prepare to be enthralled! Sick of zombie castaways? Then take on amazing cooking fever and let the zombies wait, sadly groaning off to the side. Abandon your iPad for Katie and Bob! Katy and Bob: onwards to safari cafes! - Kitchen games will never look the same! - 3 colorful locations - 60 exciting levels - Over 10 happy characters and even a supremacy assistant! - bonus tasks on every level - upgradable team - tons of trophies - simple gameplay for any age - fun music",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/567160/header.jpg?t=1529305134",
    "Price": 4.99,
    "Developers": "Creobit,Workroom7",
    "Publishers": "8Floor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/567160/ss_3fb8b62c11bb1f54b409dbee65d5c53364851446.1920x1080.jpg?t=1529305134,https://cdn.akamai.steamstatic.com/steam/apps/567160/ss_5b04d5669774204e63061116cd1ed4962abb6fea.1920x1080.jpg?t=1529305134,https://cdn.akamai.steamstatic.com/steam/apps/567160/ss_75cde28f338e052825d9d4c18655a7ecf89a08bf.1920x1080.jpg?t=1529305134,https://cdn.akamai.steamstatic.com/steam/apps/567160/ss_f4c7476efb65150f11deea7d6240193332fd8f6c.1920x1080.jpg?t=1529305134,https://cdn.akamai.steamstatic.com/steam/apps/567160/ss_f6117ca5b46b27a1bad74c01345075c52e3ace2a.1920x1080.jpg?t=1529305134,https://cdn.akamai.steamstatic.com/steam/apps/567160/ss_513cd3b85cbd6927a68072e4c0ebbd262dc00f3d.1920x1080.jpg?t=1529305134",
    "Slug": "katy-and-bob-safari-cafe",
    "Meta Title": "Katy and Bob: Safari Cafe: Jun 17, 2018, Creobit,Workroom...",
    "Meta Description": "Looking for information on Katy and Bob: Safari Cafe? Check out the release date (Jun 17, 2018), developer insights from Creobit,Workroom7, and a comple...",
    "Alt Text Image": "Official header image for Katy and Bob: Safari Cafe game - Steam 567160",
    "Canonical URL": "https://gusku.site/game/katy-and-bob-safari-cafe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Katy and Bob: Safari Cafe\", \"description\": \"Looking for information on Katy and Bob: Safari Cafe? Check out the release date (Jun 17, 2018), developer insights from Creobit,Workroom7, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Creobit,Workroom7\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8Floor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/567160/header.jpg?t=1529305134\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}