{
    "AppID": 679780,
    "Name": "Lemuria: Lost in Space - VR Edition",
    "Release date": "Aug 4, 2017",
    "About the game": "Lemuria: Lost in Space is a unique adventure, full of mysteries, puzzles and shocking discoveries. It's a combination of point 'n click adventure, RPG and survival game. Play VR edition - with free first-person movement and full HTC Vive support! Explore over 100 rooms of the spaceship, solve dozens of puzzles, find valuable resources and fight with security turrets and other enemies patrolling the ship; Uncover the story of the lost crew of Lemuria 7. The ship has been missing for over 70 years - find out what exactly happened to them; Acquire new skills allowing you to hack computer terminals or even the spaceship network to avoid fighting with patrolling robots; Challenge yourself in demanding mini-games that will test your logical thinking and maths skills; Feel the unique atmosphere of the abandoned spaceship with the original soundtrack, composed by Ree-D. Play now - free demo available. The Lemuria 7 spaceship has been missing for over 70 years. Now it is back in the Solar System, however there are no crew members on it. It's also unclear how the Lemuria 7 has returned and why it has been seriously damaged. In Lemuria: Lost in Space, you play as Abrix - the robot with AI that may operate in extreme temperatures, high levels of radiation and that yields weapon and hacking modules in order to explore the whole ship. Abrix has an ability to overrun security systems. The unique hacking mini-game will challenge your math, geographic and logical thinking skills. There is no time to check Wikipedia - every mistake costs you valuable resources! Abrix has a special software that allows him to upgrade himself during the mission. You need to be very careful - if you run out of batteries or an anti-radiation cloak, the mission is aborted and the game is over. In order to explore over 100 rooms of the spaceship, you'll need to solve dozens of puzzles, find valuable resources for the robot and fight with security turrets and other enemies patrolling the ship. Solving puzzles not only rewards you with priceless resources, but also uncovers the story of the lost crew of Lemuria 7. The level of challenge depends on difficulty - so choose wisely or you'll need to start from scratch. The game demo is available now! FAQ Q - What is the diffrence between this game and original 'Lemuria: Lost in Space'? A - VR edition is remastered in many ways and now it contains: - Free first person movement with WASD and controller support, - Full HTC Vive VR support with intuitive GUI, smart teleportation system, very easy and ready to play fighting system - Easier to use items - Bug fixes Q - My HTC Vive controllers are not working. A - Turn off the game, go to SteamVR and make sure that controllers are on. Then start the game again. Q - I can't start the game, Steam tells that it's already running. A - Restart SteamVR, Steam client, and try to start the game again. Q - Can I play without VR hardware? A - You can play on any monitor, without VR hardware - using a mouse and keyboard or a controller. Q - Do you plan to support diffrent VR hardware than HTC Vive? A - We are working on porting the game to the next platforms and systems, but we can not promise at this time any specific date. Q - What are hardware requirements for playing with HTC Vive A - Graphic: GeForce GTX 970 (AMD Radeon R9 290) or better CPU: Intel® i5-4590, AMD FX 8350, or better More: see HTC Vive Steam store page",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/679780/header.jpg?t=1572345806",
    "Price": 14.99,
    "Developers": "EJRGames",
    "Publishers": "EJRGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/679780/ss_aa17f059897116b873e4248cce69817954d47e51.1920x1080.jpg?t=1572345806,https://cdn.akamai.steamstatic.com/steam/apps/679780/ss_a25624871bc613c2abcd76887ed4ba2ab9eae600.1920x1080.jpg?t=1572345806,https://cdn.akamai.steamstatic.com/steam/apps/679780/ss_e6935106ab19297111b41da4611fb8d2a2317d15.1920x1080.jpg?t=1572345806,https://cdn.akamai.steamstatic.com/steam/apps/679780/ss_217c3427484a0346c3f28adb3eddcff479d6dca4.1920x1080.jpg?t=1572345806,https://cdn.akamai.steamstatic.com/steam/apps/679780/ss_90e87bba334ad62cbe507412a9a33741ba9cb8f9.1920x1080.jpg?t=1572345806,https://cdn.akamai.steamstatic.com/steam/apps/679780/ss_f01b003a66318eb0cd117c0f32bebbb5bef3cc26.1920x1080.jpg?t=1572345806,https://cdn.akamai.steamstatic.com/steam/apps/679780/ss_1b4ea0683688fbca8fb4c4c8958163248c89edc8.1920x1080.jpg?t=1572345806",
    "Slug": "lemuria-lost-in-space-vr-edition",
    "Meta Title": "Lemuria: Lost in Space - VR Edition: Aug 4, 2017, EJRGame...",
    "Meta Description": "Looking for information on Lemuria: Lost in Space - VR Edition? Check out the release date (Aug 4, 2017), developer insights from EJRGames, and a comple...",
    "Alt Text Image": "Official header image for Lemuria: Lost in Space - VR Edition game - Steam 679780",
    "Canonical URL": "https://gusku.site/game/lemuria-lost-in-space-vr-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lemuria: Lost in Space - VR Edition\", \"description\": \"Looking for information on Lemuria: Lost in Space - VR Edition? Check out the release date (Aug 4, 2017), developer insights from EJRGames, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 4, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"EJRGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"EJRGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/679780/header.jpg?t=1572345806\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}