{
    "AppID": 1065890,
    "Name": "LOGistICAL 2: France",
    "Release date": "Apr 29, 2019",
    "About the game": "LOGistICAL 2: France is a large open-world, strategy, puzzle game where you transport different cargoes to complete all the towns throughout the country. Package includes: LOGistICAL 2: France LOGistICAL 2: Tuvalu (FREE L2 tutorial) LOGistICAL 2: Suriname (FREE) LOGistICAL: Tutorial LOGistICAL: Isle of Man (FREE) LOGistICAL: Xmas 2017 (FREE) LOGistICAL: ABC Islands (FREE) LOGistICAL 2: France has a strong focus on the puzzling aspects of LOGistICAL and takes you back to the non-business town-only playing strategies of LOGistICAL 1 while retaining the high resolution road systems of LOGistICAL 2. Over 3500 towns and 50 businesses to complete. Each LOGistICAL module has many unique things to do. In LOGistICAL 2: France you can: Fix roads to towns throughout the complex road system. Most trucks sizes fit on all the roads, even with cargo. There are lots of quarantine zones. Some regions don't allow building any industries. Complex LOGistICAL puzzle solving around the quarantines. Roads to towns are all of the highest quality, so don't need upgrading. Find some of the industries throughout the map. Upgrade them so you can build your own. 13 new industries and 13 new resources. Over 150 industries from over 180 industry types. Truck boosts include a super speed multiplier. Module includes contracts to complete for those not knowing just where to start. Businesses don't consume resources. Businesses have a static score this is not based on trucks sizes or amounts. NEW: Information button to show details about any town. NEW: Information button to show details some of the businesses. Pre-rendering of the maps (35km and greater) to bitmap to speed up the game play when zoomed out. LOGistICAL 2 brings you all the fun and puzzling of LOGistICAL with even more towns, more puzzles and much more to do. This LOGistICAL 2: France module brings you over 3500 towns to complete. LOGistICAL 2: France game covers the country of France including cities like Paris, Marseille, Lyon, Toulouse and many, many more. There are many new obstacles and deliveries to make. LOGistICAL Summary The whole game is a huge puzzle while each town is its own little piece of puzzling. There are thousands of town and businesses to complete. Plenty of towns are easy enough. Some take complex planning. Do them in your own order. Get bonuses for completing regions and contracts. Some cargoes are easy to get. Others you have to create in industries. Use existing industries and build your own. The further you get from the start the more strategies you have to use. Boost up your trucks with bonuses. Last truck delivering gets the bonus. The towns, roads and map are to scale. Current or historical industry placement. It is very educational as well as entertaining. There Is Plenty More to Keep You On Your toes. Towns consume the cargoes you are trying to get to completion. Big trucks are great for moving lots of stuff, but can't travel everywhere. There are lots of broken roads that need deliveries. Upgrade the industries for better exponential throughput. Cargo stores can sure come in handy. What! I can't take my big trucks across the water on a ferry. ... and what is with those quarantine checkpoints? Complete towns, roads, industries, contracts, regions and states for lots of in-game and Steam achievements.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1065890/header.jpg?t=1563834159",
    "Price": 9.99,
    "Developers": "Sacada",
    "Publishers": "Sacada",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1065890/ss_3854ae258a8f9f4815ef130f8c2dc8a999ed12db.1920x1080.jpg?t=1563834159,https://cdn.akamai.steamstatic.com/steam/apps/1065890/ss_283a0e2fc269c70727a5003b52982d935f131be7.1920x1080.jpg?t=1563834159,https://cdn.akamai.steamstatic.com/steam/apps/1065890/ss_30e8481391e9b81e75646899b6d99f2d892bf566.1920x1080.jpg?t=1563834159,https://cdn.akamai.steamstatic.com/steam/apps/1065890/ss_2d9b411eb4c75924135e4341f1d8443f0cf08fcb.1920x1080.jpg?t=1563834159,https://cdn.akamai.steamstatic.com/steam/apps/1065890/ss_8c3dafdede47c8bde2a250d2c2da835f229328c5.1920x1080.jpg?t=1563834159,https://cdn.akamai.steamstatic.com/steam/apps/1065890/ss_ef1d694deed21e18ed9ead643500a900cf674f5e.1920x1080.jpg?t=1563834159,https://cdn.akamai.steamstatic.com/steam/apps/1065890/ss_e970d6f5a84658a020989535c527772bc2758312.1920x1080.jpg?t=1563834159,https://cdn.akamai.steamstatic.com/steam/apps/1065890/ss_767d48d626ae3640d939f193e77decd6f5ecfd14.1920x1080.jpg?t=1563834159,https://cdn.akamai.steamstatic.com/steam/apps/1065890/ss_447ce1ba6023cd141940eb8bdf4564896861ef9b.1920x1080.jpg?t=1563834159",
    "Slug": "logistical-2-france",
    "Meta Title": "LOGistICAL 2: France: Apr 29, 2019, Sacada and Full Overview",
    "Meta Description": "Looking for information on LOGistICAL 2: France? Check out the release date (Apr 29, 2019), developer insights from Sacada, and a complete game summary.",
    "Alt Text Image": "Official header image for LOGistICAL 2: France game - Steam 1065890",
    "Canonical URL": "https://gusku.site/game/logistical-2-france",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LOGistICAL 2: France\", \"description\": \"Looking for information on LOGistICAL 2: France? Check out the release date (Apr 29, 2019), developer insights from Sacada, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 29, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1065890/header.jpg?t=1563834159\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}