{
    "AppID": 1005340,
    "Name": "Myths and Legends - Card Game",
    "Release date": "Aug 9, 2019",
    "About the game": "Myths &amp; Legends Online With over 17 years on the market, the real-life Trading Card Game Mitos y Leyendas has been a solid alternative to play with friends. Gameplay In simple steps: Select a Demo Deck Wait for another player to join you Play your cards Destroy their Castle Currently with 260 unique cards in just a few (for now) Demo Decks, you can play with anyone else connected in real time. Careful with what damage you choose to take, because your Castle is your deck; each point of damage you take is a card that goes straight to your Graveyard. Features 260 cards at the moment, with more than 6000 in development (see IRL cards). 4 Demo Decks for you to try a small portion of the archetypes you will be able to play in M&amp;L. Build your own deck and strategy.** Customize your battlefield; be an European medieval Queen/King, an Egyptian Pharaoh… or a Viking? You can customize the look of your battlefield as you wish.** Transmute your cards to create new ones and experience more exciting abilities.** **: Feature still on development Card Types Allies are warrior cards used to defend your Castle-Deck or to attack your opponent's Castle. An Ally cannot attack unless it has been in play for at least one turn. However, you can always use it to either block or activate its abilities. Totems are cards that grant specific abilities. The card's abilities can usually be activated as long as the Totem remains in the battlefield. Talismans are one-time use cards with specific effects. Weapons are equipped by Allies already in play. Only one Weapon may be attached to an Ally at any time, and once attached to an Ally, a Weapon cannot be removed or transferred to another Ally. They usually provide a Strength bonus and/or an effect. Gold cards are the resource used by players to play cards. Players begin the game with one Gold Card in play, and can add a gold card to their Gold Reserve each turn. ----- Battle other Guardians online leading your favorite mythological, historical and literary characters in this adaptation of the popular TCG game Myths and Legends. Collect the cards, build the perfect strategy and crush your enemies, share your triumphs and win amazing prices. Myths and Legends Online.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1005340/header.jpg?t=1615831527",
    "Price": 0.0,
    "Developers": "Salo",
    "Publishers": "Salo",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1005340/ss_bdf768d0b8c55b3aeee7e5f4fa3dd7c4d9b6df5c.1920x1080.jpg?t=1615831527,https://cdn.akamai.steamstatic.com/steam/apps/1005340/ss_371cc41019e2d47011b9e1c81b74e665236600d0.1920x1080.jpg?t=1615831527,https://cdn.akamai.steamstatic.com/steam/apps/1005340/ss_bc66d1a42b872e560dd95db96b7e32a6b9e9ebd3.1920x1080.jpg?t=1615831527,https://cdn.akamai.steamstatic.com/steam/apps/1005340/ss_4921c9906df59e33f8b22067b4b876a118a5a7f2.1920x1080.jpg?t=1615831527,https://cdn.akamai.steamstatic.com/steam/apps/1005340/ss_63e25615a9d5ec32a90ed7cd05b31c692d3dba89.1920x1080.jpg?t=1615831527,https://cdn.akamai.steamstatic.com/steam/apps/1005340/ss_fc8f80122501436f016aa9d22e7cc04130655ae3.1920x1080.jpg?t=1615831527,https://cdn.akamai.steamstatic.com/steam/apps/1005340/ss_a5be96f405c8f4d6b8074a0b06a1f8e53b33cf84.1920x1080.jpg?t=1615831527",
    "Slug": "myths-and-legends-card-game",
    "Meta Title": "Myths and Legends - Card Game: Aug 9, 2019, Salo and Full...",
    "Meta Description": "Looking for information on Myths and Legends - Card Game? Check out the release date (Aug 9, 2019), developer insights from Salo, and a complete game su...",
    "Alt Text Image": "Official header image for Myths and Legends - Card Game game - Steam 1005340",
    "Canonical URL": "https://gusku.site/game/myths-and-legends-card-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Myths and Legends - Card Game\", \"description\": \"Looking for information on Myths and Legends - Card Game? Check out the release date (Aug 9, 2019), developer insights from Salo, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Salo\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Salo\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1005340/header.jpg?t=1615831527\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}