{
    "AppID": 327090,
    "Name": "Out of Reach",
    "Release date": "Jul 13, 2018",
    "About the game": "The one who said that a combination of thunder storms and sea rocks is the worst thing that can happen to sailors, clearly didn't have to survive one. The real deal starts the morning after, and this is the exact time when you, dear player enter the cruel world of Out of Reach . Although the archipelago was considered deserted before ships started to crash into sea rocks nearby, every kind of area on the island has its natural inhabitants who just don't give a warm welcome. Thinking twice every time before moving ahead could be one of the smartest things to do. Staying on a beach after crushing your boat allows you to hunt for slowly moving animals and gives the ability to see at long distances. Disadvantage - you can be seen from exactly the same distance and there's always someone to call you his own slow-moving food. In order to stay on the top of the food chain, you need to work harder than others. Everything starts from finding certain resources. Chop trees, mine stone, gather flax and food. Equip yourself and start searching for more sophisticated materials like copper and tin to produce bronze and other alloys. Use a variety of workshops, furnaces and tools to craft armour and weapons. Check which combination of gear has better performance and suits your game style best. Upgrade equipment using new resources or items obtained in battle. Store, collect or trade your stuff with other players! Looking for a place to store your timber or a quiet and cosy room to forge a sword and tan a skin of an elephant? Build your own stronghold! Use dozens of building elements like walls, stairs and floors to assemble the house of your dreams in an environment of your choice... or just take control of one. The best solutions to problems are most often invented during battles. Everyday life on islands full of castaways is not an exception. To successfully protect your territory or gain control of a new one, you will need the advantage. Ballista The greater the distance, the safer you are. Ballista may be slow to load and unable to move but the ability to pierce a target with a 1,5m dart few hundred meters away in no time shouldn't be underestimated. Trebuchet Unusual situations require extraordinary solutions. When an axe doesn't help or doors are just too thick it's time for a trebuchet. Construction costs both time and resources but nothing surprises like a forced entry through a wall. Traps Well, there's actually one thing that surprises more - a tricky and deadly trap! Use trip wires at the doors, stairs or wherever you want, connect them with ballistae or boulder throwers, place a bait and wait for the unwelcome guests. Glider When everything fails, you might consider an attack from above. Construct a tower, install a launcher ramp and take off on a glider to bomb enemies' bases, get through walls or just take a look from a different perspective.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/327090/header.jpg?t=1657108902",
    "Price": 14.99,
    "Developers": "Space Boat Studios",
    "Publishers": "Space Boat Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/327090/ss_a201475393e7fb8dfdf618b733776253ae89bfcb.1920x1080.jpg?t=1657108902,https://cdn.akamai.steamstatic.com/steam/apps/327090/ss_4f8ec2f7c6748b494c9a305317c455642c479810.1920x1080.jpg?t=1657108902,https://cdn.akamai.steamstatic.com/steam/apps/327090/ss_d31fc57e647cc8fa90a0ab61470c0e0be9ac7ac8.1920x1080.jpg?t=1657108902,https://cdn.akamai.steamstatic.com/steam/apps/327090/ss_55ed7bae68a0247ab72bc389ef94fb16870a875f.1920x1080.jpg?t=1657108902,https://cdn.akamai.steamstatic.com/steam/apps/327090/ss_f1d8be3bfe744b765293b4082ab1811ca91b6f6b.1920x1080.jpg?t=1657108902,https://cdn.akamai.steamstatic.com/steam/apps/327090/ss_85d262b04e4efa48156eb767dafdefe1adb64d16.1920x1080.jpg?t=1657108902,https://cdn.akamai.steamstatic.com/steam/apps/327090/ss_d1584d4922e2a011c5c98db913564e4ade958f90.1920x1080.jpg?t=1657108902,https://cdn.akamai.steamstatic.com/steam/apps/327090/ss_aab63a7e892d58c10262d84fcb4ae2229087c5ec.1920x1080.jpg?t=1657108902",
    "Slug": "out-of-reach",
    "Meta Title": "Out of Reach: Jul 13, 2018, Space Boat Studios and Full O...",
    "Meta Description": "Looking for information on Out of Reach? Check out the release date (Jul 13, 2018), developer insights from Space Boat Studios, and a complete game summ...",
    "Alt Text Image": "Official header image for Out of Reach game - Steam 327090",
    "Canonical URL": "https://gusku.site/game/out-of-reach",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Out of Reach\", \"description\": \"Looking for information on Out of Reach? Check out the release date (Jul 13, 2018), developer insights from Space Boat Studios, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Space Boat Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Space Boat Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/327090/header.jpg?t=1657108902\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}