{
    "AppID": 1831530,
    "Name": "PC Creator - PC Building Simulator",
    "Release date": "Dec 14, 2021",
    "About the game": "PC Creator is a simulator game, where you can try yourself as a PC builder! Complete different PC building and PC repair orders to upgrade your business: build a PC from nothing, install popular OS, upgrade computers, install different programs and games, fix PC parts, and much more. In addition to this, you have a special opportunity to create your mining farm to mine the cryptocurrency and to set up your own computer shop. User-friendly interface Despite the fact that our gaming setup has a lot of functions, we made our best to develop a stylish, modern, and comfortable interface for managing all game's processes: ★ animated controls ★ tip pop-ups ★ user-friendly and plain positioning of buttons All, mentioned above, you can see in the virtual world of the PC Creator! Build your PC from zero You can build the PC of your dream in our game. In the shop, you can choose and buy a motherboard, a processor, a video card and other parts. Then you have to install the operating system, drivers, favorite programs, and games. And all these you can do in one game! Wide choice of accessories There are a lot of modern PC parts in the game: motherboards, processors, video cards (PS express, etc.), random access memory, power units for all tastes, CPU, GPU. Moreover, you can boost these parts to the top and enjoy their productivity even more. How to improve your repair service center By finishing clients' orders, you receive the experience points and the virtual coins. You can purchase a new room for your service center with earned money. Moreover, there is an opportunity to replace the equipment with a more powerful and modern one. Learn how to improve your PC You will learn how to fix up personal computers while playing our game, replacing or repairing parts with better ones. In addition to this, you will notice that not all parts comply with other ones of your PC. Our simulator will teach you, how to choose details correctly, in case to make the most of your computer for gamers, stores, or individual orders. You'll have to make different construction sets to improve your professional skills! Install popular operating systems PC Creator gives you an opportunity to install virtual operating system simulations: Linux, macOS, Windows. The process of installing is very close to realistic, so it is a good time to learn how to install or fix different OS. Apps Simulation There is the built-in PC simulator, with help of which you can install different programs, apps, games and test them without leaving the game. Play your favorite games right here! What could be better? Community Things don't work out? Ask for some advice in the official chat of the game in discord, where players share their knowledge, experience and just communicate with each other on different topics. There are contests and promotions there too. You will be pleasantly surprised because the job of our community is to make simulator games better!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1831530/header.jpg?t=1639504647",
    "Price": 3.99,
    "Developers": "CREATY",
    "Publishers": "CREATY",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1831530/ss_35fdeb312bd268aa9e6ed3f1840b48a78fb034af.1920x1080.jpg?t=1639504647,https://cdn.akamai.steamstatic.com/steam/apps/1831530/ss_12823b17f18ecb2f99f006e38cecbc28fa52cd27.1920x1080.jpg?t=1639504647,https://cdn.akamai.steamstatic.com/steam/apps/1831530/ss_2fab0c666ede8d85ce2ef277e4a5d724dfbe2a1d.1920x1080.jpg?t=1639504647,https://cdn.akamai.steamstatic.com/steam/apps/1831530/ss_9738e05ada2cc892fe979bdf12e37e66766564d1.1920x1080.jpg?t=1639504647,https://cdn.akamai.steamstatic.com/steam/apps/1831530/ss_b7ad05faaaf8429fdae14521e3193c4cdd38afca.1920x1080.jpg?t=1639504647,https://cdn.akamai.steamstatic.com/steam/apps/1831530/ss_c854f8f768995e8649dc22232d1e442fc678cb53.1920x1080.jpg?t=1639504647,https://cdn.akamai.steamstatic.com/steam/apps/1831530/ss_b2d1690bdc7c9d77cb2239f29d4cea923b5e81f0.1920x1080.jpg?t=1639504647,https://cdn.akamai.steamstatic.com/steam/apps/1831530/ss_0bee96ce634ec4ec2d61ffc672c80715b6822c5c.1920x1080.jpg?t=1639504647,https://cdn.akamai.steamstatic.com/steam/apps/1831530/ss_f141e41c1bd1503588b4a168bfac210d3d534d00.1920x1080.jpg?t=1639504647,https://cdn.akamai.steamstatic.com/steam/apps/1831530/ss_2dca94f53b9deee0cbd5a3863967b3ff549d0e16.1920x1080.jpg?t=1639504647,https://cdn.akamai.steamstatic.com/steam/apps/1831530/ss_64e358f6c50788a2027adf3356243815412d6de1.1920x1080.jpg?t=1639504647,https://cdn.akamai.steamstatic.com/steam/apps/1831530/ss_03ace17a91591119b136c70a394561d14cf0185a.1920x1080.jpg?t=1639504647",
    "Slug": "pc-creator-pc-building-simulator",
    "Meta Title": "PC Creator - PC Building Simulator: Dec 14, 2021, CREATY ...",
    "Meta Description": "Looking for information on PC Creator - PC Building Simulator? Check out the release date (Dec 14, 2021), developer insights from CREATY, and a complete...",
    "Alt Text Image": "Official header image for PC Creator - PC Building Simulator game - Steam 1831530",
    "Canonical URL": "https://gusku.site/game/pc-creator-pc-building-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"PC Creator - PC Building Simulator\", \"description\": \"Looking for information on PC Creator - PC Building Simulator? Check out the release date (Dec 14, 2021), developer insights from CREATY, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"CREATY\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CREATY\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1831530/header.jpg?t=1639504647\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}