{
    "AppID": 946610,
    "Name": "Pocket Rogues",
    "Release date": "Oct 25, 2018",
    "About the game": "Pocket Rogues brings old school Action-RPG flavor to the Roguelike genre. Here you must fight your way through hordes of monsters, explore unique and randomly generated locations, upgrade your guild fortress, and develop heroes of ever-increasing might if you hope to discover the lost secrets of a mysterious dungeon. Pocket Rogues contains many different dungeons , each with its own unique loot and monsters . A wide variety of classes and dozens of specializations allow you to take alternative approaches to the game’s numerous boss battles , and each will test your skill in a new way. Add in Pocket Rogue’s traditional RPG components, such as character progression and exploration, and you will never feel bored! “For many centuries, a dark dungeon has called to hapless travelers, whispering secrets and promising priceless treasure. None who enter have ever returned, and rumor says that each met an unspeakable fate at the hands of a true Evil. These gloomy legends, of course, only entice new adventurers to try their luck in the depths, eager for glory, fame, and riches beyond imagination. What are you waiting for? It’s time to become one of them!” FEATURES: The game is played entirely in real time! Move, dodge, avoid obstacles, outmaneuver and outflank! Enjoy an elaborate combat system focused on character control and player skill. Try your luck as one of many hero classes , each with unique skills, specific equipment, and their own progression tree. Every descent is special! From locations and monsters to loot and chance encounters, everything is generated during the game. You will never see two identical dungeons! The game includes unique locations , each with its own visual style, distinctive enemies, traps, and interactive objects. Once discovered, you can move freely between them all. Construct and improve buildings in the territory of your very own Guild Fortress. Unlock new hero classes, strengthen existing ones, and gain access to an arsenal of fierce techniques. Regular updates! The game has been supported and actively developed for a long period of time. The game’s creator works in close contact with the community and dedicated players to ensure a high-quality experience for everyone.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/946610/header.jpg?t=1639771685",
    "Price": 7.99,
    "Developers": "EtherGaming",
    "Publishers": "EtherGaming",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/946610/ss_f6a67d0eb5535fcb163aabc7e8c33a9c8e934cb7.1920x1080.jpg?t=1639771685,https://cdn.akamai.steamstatic.com/steam/apps/946610/ss_a967ea8d2b69990a2ae12bcfdae52f4e2481a9eb.1920x1080.jpg?t=1639771685,https://cdn.akamai.steamstatic.com/steam/apps/946610/ss_0af6fe99cc84f1f462f29a209a9e059b136eec55.1920x1080.jpg?t=1639771685,https://cdn.akamai.steamstatic.com/steam/apps/946610/ss_f546845996c6c6a29460b5878f1f9e1b39f54ea8.1920x1080.jpg?t=1639771685,https://cdn.akamai.steamstatic.com/steam/apps/946610/ss_148a9d896575b7bc45a8a6b71c93d5beb54bc185.1920x1080.jpg?t=1639771685",
    "Slug": "pocket-rogues",
    "Meta Title": "Pocket Rogues: Oct 25, 2018, EtherGaming and Full Overview",
    "Meta Description": "Looking for information on Pocket Rogues? Check out the release date (Oct 25, 2018), developer insights from EtherGaming, and a complete game summary.",
    "Alt Text Image": "Official header image for Pocket Rogues game - Steam 946610",
    "Canonical URL": "https://gusku.site/game/pocket-rogues",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pocket Rogues\", \"description\": \"Looking for information on Pocket Rogues? Check out the release date (Oct 25, 2018), developer insights from EtherGaming, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 25, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"EtherGaming\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"EtherGaming\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/946610/header.jpg?t=1639771685\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}