{
    "AppID": 1101400,
    "Name": "Rune Knights",
    "Release date": "Nov 7, 2020",
    "About the game": "COMMUNITY-MADE OVERVIEW Information: - 8 Classes, can be mixed (10 now) - Unique awesome abilities - Looting game like Torchlight or Grim Dawn with a great looting system - Max lvl 30 (needs 4-5 hours) - Endgame looting still rewarding (lvl 30 items with +1/2/3 and gold rarity with unique skills possible) - Like 20 hours per char and you really want to make more than one lvl 30 - Weapons like dual something, sword, hammer, staff, shield, bow (+ dmg by headshots, very confusing but funny) and much more... Pros: - No story - Fast third person gameplay - Fast travel and quick matches - Endless arena - Strong co-op synergies - Great skills - Great interest in testing builds - Co-op works fine (everything can be played together) - Devs are working on updates - Not that complex and low time invest to understand everything 4-PLAYER ONLINE CO-OP Character building and gameplay gains new depth when working with a squad to build synergy and overcome increasingly difficult enemies. Rune Knights offers MANY ways for squads of up to 4 to work together and theorycraft. AN AVALANCHE OF CUSTOMIZATION 10 Skill Trees, over 100 unique talents, more than 100 unique skills , 10 Super Abilities, and many legendary items let you build characters and playstyles that other games can't offer with their restricted progression systems. Invest in any skill tree at any time as you level up, and quickly respec your character if you decide to try something new or take advantage of particularly lucky loot. YOUR GEAR SUPPLIES YOUR ABILITIES Gear isn't just about stats. Each piece of gear has a random ability assigned to it, which you can use once you equip it. Experimentation and improvisation are key to survival until you can afford to put the perfect build together. GEAR CRAFTING You're in control of every aspect of your gear. Special crafting items drop from enemies and can be purchased in Town. These items allow you to upgrade your items, change their skills, and reroll their mods (sometimes to powerful Legendary mods). SUPER ABILITIES Investing heavily in a skill tree can reward you with special Super abilities. These abilities charge up as you kill enemies, and allow you short windows of massive power once activated. Each skill tree has its own unique Super. LEGENDARIES Legendary items can drop at any time, and provide unique and powerful ways to play and build your character. Certain Legendaries are only dropped from the most powerful enemies in the game. There are currently more than 15 legendaries to find and experiment with. Good luck collecting them all! POWERFUL, INTERESTING ENEMIES Over 20 different enemies including 5 unique Bosses and 8 powerful Elite enemies will require you to improvise and react quickly and tactically to overcome them. TRADING Trade your items and currency with allies in game. RAIDS Raid content is designed to challenge 4-player parties of top-tier characters working together. 'I WAS TOLD I COULD DUAL WIELD SHIELDS?' Yes. 'CAN I PLAY AS A SUMMONER?' Yes. MAKE YOUR VOICE HEARD Many of RK's skills, talents, weapons, and features originated as suggestions by players like you. Join our Discord to suggest your own ideas for the game, report bugs, discuss character builds and synergies, and share memes. HARDCORE MODE For the masochists. Hardcore characters are permanently deleted on death, have a separate gold collection and stash that can be accessed by other Hardcore characters, and can only trade with other Hardcore characters. PLAY OFFLINE, TOO Rune Knights does not require an internet connection for solo play, because that's ridiculous. (Use Steam Offline Mode). BORING INFO SECTION Rune Knights is a cooperative, third-person, hack-and-slash action RPG focused on customization, crafting, and combat. Level up by killing monsters, collect loot, craft your own weapons and armor, and choose from over 120 unique talents and 60 different powerful abilities. Customize your character's aesthetics, stats, and gameplay as you battle through procedurally generated and hand-crafted levels with a variety of enemies and bosses. Rune Knights is still early in development and I intend to let the community determine the future direction of the game. Please provide feedback about what you would like to see changed or added to the game. No suggestion is too big or too small.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1101400/header.jpg?t=1633358287",
    "Price": 14.99,
    "Developers": "Superhero Games",
    "Publishers": "Superhero Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1101400/ss_4b3fc839df6a03080d846db5ace0187db5566493.1920x1080.jpg?t=1633358287,https://cdn.akamai.steamstatic.com/steam/apps/1101400/ss_08d2ba2efc0eec7a5e02139f8f7bf98f6c5869bf.1920x1080.jpg?t=1633358287,https://cdn.akamai.steamstatic.com/steam/apps/1101400/ss_ccc1e832431439c7f8e4c63bf89b46fc4d4fa278.1920x1080.jpg?t=1633358287,https://cdn.akamai.steamstatic.com/steam/apps/1101400/ss_623634c12a9886971a629eee0e2b9cbe41f3795b.1920x1080.jpg?t=1633358287,https://cdn.akamai.steamstatic.com/steam/apps/1101400/ss_1b48a7ebe1eedd562d1065d8d666275759974eb5.1920x1080.jpg?t=1633358287,https://cdn.akamai.steamstatic.com/steam/apps/1101400/ss_110cf5e00bc55acd59d1a64e0526800f2456dcaf.1920x1080.jpg?t=1633358287,https://cdn.akamai.steamstatic.com/steam/apps/1101400/ss_9736500ed93f2fcd5e1c9493de1c2196998977ea.1920x1080.jpg?t=1633358287,https://cdn.akamai.steamstatic.com/steam/apps/1101400/ss_61bee62f1ca1714728f697f8fc1a4e61cf52ef9c.1920x1080.jpg?t=1633358287",
    "Slug": "rune-knights",
    "Meta Title": "Rune Knights: Nov 7, 2020, Superhero Games and Full Overview",
    "Meta Description": "Looking for information on Rune Knights? Check out the release date (Nov 7, 2020), developer insights from Superhero Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Rune Knights game - Steam 1101400",
    "Canonical URL": "https://gusku.site/game/rune-knights",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rune Knights\", \"description\": \"Looking for information on Rune Knights? Check out the release date (Nov 7, 2020), developer insights from Superhero Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 7, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Superhero Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Superhero Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1101400/header.jpg?t=1633358287\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}