{
    "AppID": 766010,
    "Name": "Slime-san: Sheeple’s Sequel",
    "Release date": "Feb 5, 2018",
    "About the game": "Disclaimer: If you own Slime-san, you will NOT need to purchase Slime-san: Sheeple's Sequel separately. This title is included in Slime-san via an automatic update. Synopsis Sheeple's finally lost it! He is convinced that everything's just part of a giant videogame and that he was coded to simply be a side-character. Which is why he decided to recode himself to become the villain instead... Can you defeat his nefarious levels and come out of it unscathed? Good luck! Features 20 normal and 20 NG+ levels made by the insane Sheeple! Dozens of unique hazards to tackle head-on! Three special play styles: Slime-san, Shadow &amp; Marble mode! A utterly unique boss fight, can you defeat Sheeple's machinations? A brand new, rather bizarre... Target mode? Rhythm mode? Speedrunning mode for DLC levels, compete in leaderboards! 70 [BUGS] to collect and spend in an art gallery! An expansive hub world: Sheeple's Headquarters! Don't get too weirded out! A special mini-game... Tons of customization options like a HUE slider! Unique cutscenes and story elements! Secret indie stars to discover and talk to! Music by Meganeko &amp; Mischa Perella! Art by Del (Miimows)! Slime-san This version only contains the downloadable content 'Sheeple's Sequel'. If you want to experience the main storyline, head on over to Slime-san's page! History Slime-san is the fourth major game developed by Fabraz . The three previous titles being Planet Diver , Cannon Crasha and Wild Wild Pixel . Slime-san is a game that is fun down to its very core. A silly story, with an unlikely character and gameplay that is addictively fast. It features hours of single player content yet is tailored for speed runners as well. The very core mechanics and level design lend themselves to be played competitively online. It is a visually unique adventure using a carefully crafted, 5 color palette world that is filled with fun and goofy Japanese references. It also has a soundtrack that is worth the price alone, featuring some of the most popular chiptune composers in the world! Published by Headup Games .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/766010/header.jpg?t=1649751854",
    "Price": 1.35,
    "Developers": "Fabraz",
    "Publishers": "Headup",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/766010/ss_cadfcbe0d2e8ab6f8d773762a36087574083584e.1920x1080.jpg?t=1649751854,https://cdn.akamai.steamstatic.com/steam/apps/766010/ss_538fec948381d76d1df47c879445784554f5d2b6.1920x1080.jpg?t=1649751854,https://cdn.akamai.steamstatic.com/steam/apps/766010/ss_d782315011d6bdc199a6019333991487e95b63f3.1920x1080.jpg?t=1649751854,https://cdn.akamai.steamstatic.com/steam/apps/766010/ss_a4542f30df149a7016bad2f654aa884b5ac1eddb.1920x1080.jpg?t=1649751854,https://cdn.akamai.steamstatic.com/steam/apps/766010/ss_f62697986457d90256b5d63654d6122c1e7cf05d.1920x1080.jpg?t=1649751854",
    "Slug": "slime-san-sheeples-sequel",
    "Meta Title": "Slime-san: Sheeple’s Sequel: Feb 5, 2018, Fabraz and Full...",
    "Meta Description": "Looking for information on Slime-san: Sheeple’s Sequel? Check out the release date (Feb 5, 2018), developer insights from Fabraz, and a complete game su...",
    "Alt Text Image": "Official header image for Slime-san: Sheeple’s Sequel game - Steam 766010",
    "Canonical URL": "https://gusku.site/game/slime-san-sheeples-sequel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Slime-san: Sheeple\\u2019s Sequel\", \"description\": \"Looking for information on Slime-san: Sheeple\\u2019s Sequel? Check out the release date (Feb 5, 2018), developer insights from Fabraz, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 5, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fabraz\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Headup\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/766010/header.jpg?t=1649751854\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.35, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}