{
    "AppID": 1623210,
    "Name": "Soulash",
    "Release date": "Mar 4, 2022",
    "About the game": "Bored of playing the protagonist that saves the world? Remember the times when it was good to be evil? In Soulash you'll be able to unleash your Berserker rage at annoying NPC characters and butcher them for meat. You will torture mortals with fire and electricity as a powerful Warlock. Summon an unlimited army of zombies and skeletons and rot everything in your path as a Lich Necromancer. And if you prefer the unexpected, you can't go wrong with a Goblin Inquisitor! This world is yours for the taking A forgotten god versus the whole world. A dark being, ready to regain his might using souls ripped from hundreds of enemies. Soulash is a turn-based combat-heavy roguelike told from the villain's point of view, where an open world exists only for the pleasure of complete destruction. From gnome villages, through dwarven keeps, into the hot deserts, with massive Capital City and the Black Pyramid - everything is to conquer, destroy and cover in blood. And the rivers will run red Kill other gods and change the landscape of the entire world. Rivers will turn into blood, winter will come, the world will cover in darkness as the sun dies. Consume the souls of gods and change the world on a massive scale! Your souls are mine Every soul you take will not come back to life. You can kill everyone in the world and do as you please with what's left. Soulash tells a story of a long-forgotten god that escaped his prison to reign in destruction and terror. Everything was born from you and will die because of you. Fight to the death Use over 100 different abilities to intimidate, corrupt or exterminate everything in your path in tactical, turn-based combat affected by weather conditions and terrain. Oh sweet, sweet loot You have no idea how Big Bertha got her hands on the Ring of Invisibility - but it's your precious artifact! Enemies are created with different sets of magic items during every playthrough, just watch out for the peasants casting Armageddon! Nice day for fishin' ain't it? Even gods need to rest on Sundays. How about growing some cabbages, milking cows, gathering honey, or cooking some elves, while chilling at the village you cleared of pests. Soulash has multiple crafting and item production skills available, like woodcutting, mining, harvesting, gathering, threshing, fishing, butchering, skinning, and more. Unlimited power! With in-game editors and configuration files, you can quickly mod a lot of new content into the game. Design your own maps, create your own abilities, professions, races, items, or weather conditions. You can even make a total conversion mod and create your favorite fantasy world to conquer. We plan to integrate Steam Workshop to leverage the power of your godly creativity. Features &amp; content Huge open world made out of 350 alternative regions, with multiple starting positions, alternative routes to victory, 8 professions, and 15 races, making the game replayable with lots of interesting locations to discover, and character builds to try. Tactical turn-based combat with more than 150 abilities available, against hundreds of different enemies, including over 50 powerful unique enemies, bosses, and gods to beat. Destructible terrain and different weather effects that affect combat situations, the world is changed by your actions forever. Interesting story told through character monologues, dialogues, and location descriptions during encounters. Tons of useful loot , everything used by your opponents is dropped when they die, including powerful artifacts and magic items. In-game modding tools with Steam Workshop integration - for even more content! Steam leaderboards and achievements integration for competitive players. No limits to summon count for necromancers!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1623210/header.jpg?t=1647878671",
    "Price": 14.99,
    "Developers": "Artur Smiarowski",
    "Publishers": "Artur Smiarowski",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1623210/ss_f45a90c8e29bb8806671657a59b311317da567ff.1920x1080.jpg?t=1647878671,https://cdn.akamai.steamstatic.com/steam/apps/1623210/ss_92271b2ebbdc91dbe308745daedaf836d73b8a1e.1920x1080.jpg?t=1647878671,https://cdn.akamai.steamstatic.com/steam/apps/1623210/ss_d9d4bee4ecf6d54c27553abf2bd797df513ed2ea.1920x1080.jpg?t=1647878671,https://cdn.akamai.steamstatic.com/steam/apps/1623210/ss_7e5963f012420ea95e0b43a742770005f98c4e62.1920x1080.jpg?t=1647878671,https://cdn.akamai.steamstatic.com/steam/apps/1623210/ss_885dd3cef9e35b0ebb83121154ab6bb4a0ca87da.1920x1080.jpg?t=1647878671,https://cdn.akamai.steamstatic.com/steam/apps/1623210/ss_78cd1fd972063e61be0b6dbe22a8ca711e7ab539.1920x1080.jpg?t=1647878671,https://cdn.akamai.steamstatic.com/steam/apps/1623210/ss_f9bddca647832e9dfde054cd4d0d09a4fb9cea6c.1920x1080.jpg?t=1647878671,https://cdn.akamai.steamstatic.com/steam/apps/1623210/ss_c85f571ca7d6d76c600661520c4aa11f07e6e476.1920x1080.jpg?t=1647878671",
    "Slug": "soulash",
    "Meta Title": "Soulash: Mar 4, 2022, Artur Smiarowski and Full Overview",
    "Meta Description": "Looking for information on Soulash? Check out the release date (Mar 4, 2022), developer insights from Artur Smiarowski, and a complete game summary.",
    "Alt Text Image": "Official header image for Soulash game - Steam 1623210",
    "Canonical URL": "https://gusku.site/game/soulash",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Soulash\", \"description\": \"Looking for information on Soulash? Check out the release date (Mar 4, 2022), developer insights from Artur Smiarowski, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Artur Smiarowski\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Artur Smiarowski\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1623210/header.jpg?t=1647878671\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}