{
    "AppID": 1426570,
    "Name": "Space Station 51",
    "Release date": "Nov 30, 2021",
    "About the game": "'Space Station 51' is an FPS zombie shooting game developed using Unreal Engine 5's early version. It uses cartoon-style modeling, but you can also experience the thrill of shooting. The background of the game is on the space station. An unknown zombie virus appeared in space station 51, infecting all members. You need to complete the operation according to the game's task prompts. You also need to search for weapons, ammunition, etc., shoot and kill the zombies in the 51st space station, and then restart the space station according to the instructions. Weapons are automatic rifles and pistols. You can also use melee knives, grenades, etc. About hardware requirements (Very important: you need to use the latest graphics card driver and support DirectX 11/12) The game uses Unreal Engine 5 Early Access Edition for development. Although they are all low poly models, they still use Nanite and Lumen . This is an attempt to new technology, but it also brings some computer hardware requirements. Because it is a low-mode model, it doesn't matter whether your computer supports Nanite or not. The key is Lumen's requirement: a graphics card that supports DirectX 11 and Shader Model 5 is required. The requirement for Lumen in the official document is that NVIDIA GeForce GTX-1070 or higher is required. So I set the required graphics card to 1070 in the minimum configuration. The requirements for the CPU are small and there are no special requirements. There may be more low-end graphics card support in future updates, but I can't give a guarantee for now. Will multiplayer mode be added? if I want to ensure the quality of online games, it requires a lot of cost to set up independent game servers, which is a big burden for me personally. But if many people want to be able to be online, then I will definitely increase the multiplayer online part, but this will take at least one to two months. Because I am alone making indie games and the development time is tight, there is only this version. But if there are feedback from most players that everyone needs a version that can run in a lower configuration, then I will definitely change a version that does not use Nanite and Lumen in a short time for the players who have purchased it to download directly.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1426570/header.jpg?t=1646460389",
    "Price": 0.99,
    "Developers": "YZ",
    "Publishers": "YZ",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1426570/ss_a3c514345b386ff49d71f809b0db964536f9555f.1920x1080.jpg?t=1646460389,https://cdn.akamai.steamstatic.com/steam/apps/1426570/ss_493a13907e78e52d017ee5e6c85b9b2a4ba276d0.1920x1080.jpg?t=1646460389,https://cdn.akamai.steamstatic.com/steam/apps/1426570/ss_b77f90d912057199672001d0b9b2302256c36c1a.1920x1080.jpg?t=1646460389,https://cdn.akamai.steamstatic.com/steam/apps/1426570/ss_93b23c2a5eedf62284b17a8bd26debf9ffe36559.1920x1080.jpg?t=1646460389,https://cdn.akamai.steamstatic.com/steam/apps/1426570/ss_5509f38d248565f3f921482d0c5fc2e057b17197.1920x1080.jpg?t=1646460389",
    "Slug": "space-station-51",
    "Meta Title": "Space Station 51: Nov 30, 2021, YZ and Full Overview",
    "Meta Description": "Looking for information on Space Station 51? Check out the release date (Nov 30, 2021), developer insights from YZ, and a complete game summary.",
    "Alt Text Image": "Official header image for Space Station 51 game - Steam 1426570",
    "Canonical URL": "https://gusku.site/game/space-station-51",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Space Station 51\", \"description\": \"Looking for information on Space Station 51? Check out the release date (Nov 30, 2021), developer insights from YZ, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"YZ\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"YZ\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1426570/header.jpg?t=1646460389\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}