{
    "AppID": 418530,
    "Name": "Spelunky 2",
    "Release date": "Sep 29, 2020",
    "About the game": "Spelunky returns in this greatly-expanded sequel to the original roguelike platformer! Meet the next generation of explorers as they find themselves on the Moon, searching for treasure and missing family. Spelunky 2 builds upon the unique, randomized challenges that made the original a classic, offering a huge adventure designed to satisfy players old and new. A Bigger and More Dynamic World, with So Much to See and Do Spelunky 2's world is even denser than the one in the original game, offering many more areas, characters, traps, and items, as well as new ways to interact with them (and for them to interact with each other). The world has expanded in other ways, too, with branching paths and multi-layered levels adding a third dimension to the classic 2d platforming. Animals can also be tamed and ridden. And dynamic liquid physics create new challenges and make the world feel extra reactive and alive. Build a Community, Make Friends Back in Base Camp, characters you unlock will mill about and relax between runs, offering encouragement and advice. As you explore, your camp will expand and develop into a thriving little community to welcome you whenever you need a break from exploring. While there, you can also access shortcuts and practice your moves in safety. The Game is Yours to Explore Spelunky 2 is not just about 'getting good and beating the game' - more than that, it's an endlessly replayable playground to experiment in and find your own way, creating stories against the backdrop of an expansive, deeply-interactive world filled with secrets. The more you play, the more the game becomes yours! Key Features, Summarized: A Bigger World with all new areas, monsters, traps, and items! An Extra Dimension is added by allowing players to access a second layer behind the normal playfield. The second layer might contain treasure rooms, hidden passages, and other special places. Multiple Routes Through the Game will add variety and give players more ways to personalize a run. Find and Ride Mounts (like turkeys!) that have special abilities. Enemies may ride mounts, as well! New NPCs that you can help, hurt, or ignore… to make each run feel even more like a unique story. Variations and Changes to Classic Spelunky Concepts like shops and ghosts that will make veteran players rethink their strategies. Improved Liquid Physics allow water and lava to move and pour realistically, which drastically affects the playfield (and looks cool) Deadly Poison and Curses can be inflicted on players and enemies alike. Build a Permanent Home at Base Camp as you do runs and explore the caves. Improved Lighting and Special Effects are paired with richer visual and audio design. Deeper Mysteries that may require a community effort to unravel. Possibly More Eggplants",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/418530/header.jpg?t=1632912845",
    "Price": 19.99,
    "Developers": "Mossmouth,BlitWorks",
    "Publishers": "Mossmouth",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/418530/ss_bf20692e69cfef2da4b6b4096f42823a5283701c.1920x1080.jpg?t=1632912845,https://cdn.akamai.steamstatic.com/steam/apps/418530/ss_e92a2f46bb81fc745684204858ecc1284b3eeae4.1920x1080.jpg?t=1632912845,https://cdn.akamai.steamstatic.com/steam/apps/418530/ss_3f2ba63b195e3b6739faf812d7e31dbe6c9295fd.1920x1080.jpg?t=1632912845,https://cdn.akamai.steamstatic.com/steam/apps/418530/ss_69755bc2679253aa132928f261bdd059f215d342.1920x1080.jpg?t=1632912845,https://cdn.akamai.steamstatic.com/steam/apps/418530/ss_b04a6809f69c842e1cb4f8192c8488839733f405.1920x1080.jpg?t=1632912845,https://cdn.akamai.steamstatic.com/steam/apps/418530/ss_5fa3946203b6f225541847b1c04158f5c5abeb46.1920x1080.jpg?t=1632912845,https://cdn.akamai.steamstatic.com/steam/apps/418530/ss_5540fdb0ba2ff59b5838f090d8a2cb8642c5903e.1920x1080.jpg?t=1632912845,https://cdn.akamai.steamstatic.com/steam/apps/418530/ss_dbe6ac2ef9ece6ed50ea91d90aea181cdeb81a28.1920x1080.jpg?t=1632912845,https://cdn.akamai.steamstatic.com/steam/apps/418530/ss_3f4786eca55bd077c0e9b346f5b4eab2157fc57a.1920x1080.jpg?t=1632912845,https://cdn.akamai.steamstatic.com/steam/apps/418530/ss_34c5c9a71904e2ae8e6547ad022fcf329107a28e.1920x1080.jpg?t=1632912845",
    "Slug": "spelunky-2",
    "Meta Title": "Spelunky 2: Sep 29, 2020, Mossmouth,BlitWorks and Full Ov...",
    "Meta Description": "Looking for information on Spelunky 2? Check out the release date (Sep 29, 2020), developer insights from Mossmouth,BlitWorks, and a complete game summary.",
    "Alt Text Image": "Official header image for Spelunky 2 game - Steam 418530",
    "Canonical URL": "https://gusku.site/game/spelunky-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spelunky 2\", \"description\": \"Looking for information on Spelunky 2? Check out the release date (Sep 29, 2020), developer insights from Mossmouth,BlitWorks, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mossmouth,BlitWorks\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mossmouth\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/418530/header.jpg?t=1632912845\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}