{
    "AppID": 493410,
    "Name": "Steampuff: Phinnegan's Factory",
    "Release date": "Aug 29, 2017",
    "About the game": "Origins Phinnegan's Factory is set in an original universe, The Sky-High City of Steampuff – first created by Steelehouse. We are a small studio of artists, animators and gamers working in Tulsa, OK and we've been making content for other folks for the last 17 years. For a very long time, we'd wanted to make an animated series – in 2012, we did. We created the Sky-High City of Steampuff and in doing so, created a lot of artwork and lore. When we decided to make our first game, we knew our universe and its unique aesthetic would be a fantastic VR experience – so Phinnegan's Factory was born. Features • BEAUTIFULLY CRAFTED - You'll experience an immersive world that is wholly unique, both in tone and style. Every detail has been painted and placed for you to explore.  • FRANTICALLY FUN GAMEPLAY - This isn't a game you can win by standing or sitting still. You'll need to duck, dodge, shimmy and leap out of danger.  • BREATH-TAKING LOCALES - Fight back the devious mechanical hordes in the sweltering Furnace Room, the moonlit Trainyard, and in the cavernous belfry of the Clocktower!   • DUAL DISASSEMBLY - Experience twice the fabulous firepower with a Farraday Model 53 in each hand! Focus your fire or split your salvo while you expertly pace the perimeter … otherwise you are just doubling the danger of being a bad shot.   • COVER SYSTEM - As decorated Rear Admiral Alexi Asminov famously said, “The best defense is a good sturdy something to hide behind.” Well now YOU can experience that maxim first hand with your very own “something' to cower behind. Trigger the hiding hole with a single shot. Enjoy your cowardice while it lasts.  • LOCAL LEADERBOARDS - Everything is more fun with friends, especially winning.  • IMAGINATIVE ENEMIES - You will face waves of mechanized monstrosities. Every robot is unique in design and function – each enemy has its own attacks and weaknesses.  • POWER-UPS - Ever wished for a little more oomph? Perhaps you’ve lamented the loss of health! The new power-up system gives you the flexibility and longevity necessary to face the factory and live longer … perhaps.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/493410/header.jpg?t=1504046242",
    "Price": 4.99,
    "Developers": "Mister Anderson",
    "Publishers": "Steelehouse",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/493410/ss_193cc955ff7d01e01ccdd2fb46f0bdce99bb54eb.1920x1080.jpg?t=1504046242,https://cdn.akamai.steamstatic.com/steam/apps/493410/ss_aa259ca515afbfb9190d015c8c27f04a3649edf3.1920x1080.jpg?t=1504046242,https://cdn.akamai.steamstatic.com/steam/apps/493410/ss_6fb1c1fea37771e7483b938b7b222eec09d5cc61.1920x1080.jpg?t=1504046242,https://cdn.akamai.steamstatic.com/steam/apps/493410/ss_29c86425df223350e677dfd5d7031eec14ca292d.1920x1080.jpg?t=1504046242,https://cdn.akamai.steamstatic.com/steam/apps/493410/ss_14f0bcb689916e729ccf52b034f6de1bbb6cb4ab.1920x1080.jpg?t=1504046242",
    "Slug": "steampuff-phinnegan-s-factory",
    "Meta Title": "Steampuff: Phinnegan's Factory: Aug 29, 2017, Mister Ande...",
    "Meta Description": "Looking for information on Steampuff: Phinnegan's Factory? Check out the release date (Aug 29, 2017), developer insights from Mister Anderson, and a com...",
    "Alt Text Image": "Official header image for Steampuff: Phinnegan's Factory game - Steam 493410",
    "Canonical URL": "https://gusku.site/game/steampuff-phinnegan-s-factory",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Steampuff: Phinnegan's Factory\", \"description\": \"Looking for information on Steampuff: Phinnegan's Factory? Check out the release date (Aug 29, 2017), developer insights from Mister Anderson, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 29, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mister Anderson\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Steelehouse\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/493410/header.jpg?t=1504046242\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}