{
    "AppID": 386700,
    "Name": "The Oil Blue: Steam Legacy Edition",
    "Release date": "Aug 6, 2015",
    "About the game": "The Oil Blue is an indie action-sim that has you drilling for oil in the world’s oceans, selling barrels of oil on the market, and exploring new islands once you completed objectives set by your employer, the United Oil of Oceania company. Set in the oceans in the future, the world’s dependency on oil has grown to an even larger amount. It’s up to you and a crew of men to travel the ocean, find abandoned oil drilling islands, and reclaim them for the United Oil of Oceana company. Once you land on an island, you have a set amount of days and oil barrels to make during your stay. Fire up those old drilling machines and start making oil underwater, watch the oil barrel market and sell at the highest price, repair machines and do it all within the time you’re given, or the UOO will boot you off the island for a better crew. Sell more barrels to achieve higher ranks and perks, upgrade your machines, and conquer the ocean! The Oil Blue was released in 2010 to enthusiastic reviews and acclaim, including being a part of the '250 Indie Games You Must Play' book by Mike Rose. This Steam release contains all new extras, including: Original Windows release of the Oil Blue, patched to 1.041. This patch was never officially released until now, which contains fixes that help improve gameplay input. Steam Trading Card support, with all new HD art by Camille Kuo. Steam Achievements, unlocked using the included Oil Blue Achievement Unlocker/Helper App. Simply boot up this program and it will scan your save files for achievement unlocks, including old game saves you can transfer from previous releases! Includes the original game's soundtrack in MP3 and FLAC file formats by Jonathan Geer. ----- Note: This is a legacy release. The game's original source code was corrupted years back, to where I can no longer patch the game. However this game release contains all of the patches made up to this point, which fixed numerous bugs, added new features, etc. This game was tested on Windows XP, 7, 8.1 and 10, and while it works great on the machines we tested it on, there is a possibility of it not running correctly on your machine. Please view the official troubleshooting guide before purchasing for more information. Thank you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/386700/header.jpg?t=1597210204",
    "Price": 4.99,
    "Developers": "Vertigo Gaming Inc.",
    "Publishers": "Vertigo Gaming Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/386700/ss_723bb643acec479d79d365bc35d7c2045bfe712d.1920x1080.jpg?t=1597210204,https://cdn.akamai.steamstatic.com/steam/apps/386700/ss_bdbe6e12497a08c2733c844986b06e2088bfabc5.1920x1080.jpg?t=1597210204,https://cdn.akamai.steamstatic.com/steam/apps/386700/ss_9564e60cda1997c72076006bc2d19593c72c88a2.1920x1080.jpg?t=1597210204,https://cdn.akamai.steamstatic.com/steam/apps/386700/ss_09fc056eb9f1746b98e3e2fea05b9d46ed9f2404.1920x1080.jpg?t=1597210204,https://cdn.akamai.steamstatic.com/steam/apps/386700/ss_ca5cad464e9c40f16cb7956dcea51a4ca4d5120d.1920x1080.jpg?t=1597210204,https://cdn.akamai.steamstatic.com/steam/apps/386700/ss_b63dc2f5bdac5163e252d4785bf70ba72662af53.1920x1080.jpg?t=1597210204,https://cdn.akamai.steamstatic.com/steam/apps/386700/ss_1147da3713e21fa20d2dc19c3f6eb0146427c410.1920x1080.jpg?t=1597210204",
    "Slug": "the-oil-blue-steam-legacy-edition",
    "Meta Title": "The Oil Blue: Steam Legacy Edition: Aug 6, 2015, Vertigo ...",
    "Meta Description": "Looking for information on The Oil Blue: Steam Legacy Edition? Check out the release date (Aug 6, 2015), developer insights from Vertigo Gaming Inc., an...",
    "Alt Text Image": "Official header image for The Oil Blue: Steam Legacy Edition game - Steam 386700",
    "Canonical URL": "https://gusku.site/game/the-oil-blue-steam-legacy-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Oil Blue: Steam Legacy Edition\", \"description\": \"Looking for information on The Oil Blue: Steam Legacy Edition? Check out the release date (Aug 6, 2015), developer insights from Vertigo Gaming Inc., an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 6, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Vertigo Gaming Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vertigo Gaming Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/386700/header.jpg?t=1597210204\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}