{
    "AppID": 1293160,
    "Name": "The Medium",
    "Release date": "Jan 2021",
    "About the game": "Discover a dark mystery only a medium can solve. Explore the real world and the spirit world at the same time. Use your psychic abilities to solve puzzles spanning both worlds, uncover deeply disturbing secrets, and survive encounters with The Maw - a monster born from an unspeakable tragedy.. The Medium is a third-person psychological horror game that features patented dual-reality gameplay and an original soundtrack co-composed by Arkadiusz Reikowski and Akira Yamaoka. Wield unique psychic abilities reserved for those with the gift. Travel between the realities or explore them both at the very same time. Use the Out of Body experience to investigate places where your real-world self can’t go. Create energy shields and deliver powerful spirit blasts to survive the spirit world and its otherworldly dangers. Delve deep into a mature and morally ambiguous story, where nothing is what it seems and everything has another side. As a medium you see, hear and experience more than others, and with every new perspective you will change your perception on what happened at the Niwa resort. Never-seen-before and officially patented gameplay that plays out across two worlds displayed at the same time. Explore the physical world and the spirit world simultaneously, and use the interactions between them to solve dual-reality puzzles, unlock new paths, and awaken memories of past events. The Medium’s spirit world is a dark mirror reflection of our reality, a grim and unsettling place where our unpunished deeds, evil urges, and vile secrets manifest themselves and can take on a form. This world has been invented and designed under the inspiration of Zdzisław Beksiński’s paintings, Polish dystopian surrealist internationally recognized for his distinctive and strikingly ominous style. Immerse yourself in the disturbing and oppressive atmosphere of the game thanks to the original ‘dual’ soundtrack co-created by Akira Yamaoka and Arkadiusz Reikowski. Yamaoka-san is a legendary Japanese composer best known for his work on the Silent Hill series; Reikowski is a Hollywood Music in Media Awards nominee who worked on such acclaimed horror games as Blair Witch, Layers of Fear, and Observer. Now they join their creative forces for the music and songs of The Medium.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1293160/header.jpg?t=1646423615",
    "Price": 49.99,
    "Developers": "Bloober Team",
    "Publishers": "Bloober Team SA,NA PUBLISHING INC.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1293160/ss_2657526af9b2e103f6ff83107e74027c511d3312.1920x1080.jpg?t=1646423615,https://cdn.akamai.steamstatic.com/steam/apps/1293160/ss_18691ba5407fefeb5b101df6226f65e74a8f1787.1920x1080.jpg?t=1646423615,https://cdn.akamai.steamstatic.com/steam/apps/1293160/ss_db52e6f3258fc38048210d4009cb07809fbf510c.1920x1080.jpg?t=1646423615,https://cdn.akamai.steamstatic.com/steam/apps/1293160/ss_28baf2a944cbebe3fae197280c88aff6162b69c9.1920x1080.jpg?t=1646423615,https://cdn.akamai.steamstatic.com/steam/apps/1293160/ss_0024a4a9301ca0fa2f7973ea679ac97a97473993.1920x1080.jpg?t=1646423615,https://cdn.akamai.steamstatic.com/steam/apps/1293160/ss_3078af7227a11037d25c893fbdf56054bb38200b.1920x1080.jpg?t=1646423615",
    "Slug": "the-medium",
    "Meta Title": "The Medium: Jan 2021, Bloober Team and Full Overview",
    "Meta Description": "Looking for information on The Medium? Check out the release date (Jan 2021), developer insights from Bloober Team, and a complete game summary.",
    "Alt Text Image": "Official header image for The Medium game - Steam 1293160",
    "Canonical URL": "https://gusku.site/game/the-medium",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Medium\", \"description\": \"Looking for information on The Medium? Check out the release date (Jan 2021), developer insights from Bloober Team, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bloober Team\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bloober Team SA,NA PUBLISHING INC.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1293160/header.jpg?t=1646423615\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}