{
    "AppID": 305500,
    "Name": "Trapped Dead: Lockdown",
    "Release date": "Mar 20, 2015",
    "About the game": "A small American town is overrun by the living dead! You manage to enter the town just before the military locks it down and now you must slice and shoot your way through thousands of zombies in order complete your mission in this action-packed Hack &amp; Slash RPG. In Trapped Dead: Lockdown, you fight your way through an interactive horror story as one of five different characters: The marine, the butcher, the assassin, the marshal and the exorcist. Every class comes with their own custom storyline, as well as individual strengths and abilities – the assassin is an expert in firearms, the butcher slaughters his enemies in melee combat and the exorcist fries zombies with his spiritual abilities. Each of the characters features his own individual skill tree, where you can unlock new defensive abilities and attacking moves to aid you in combat. In Trapped Dead: Lockdown, you’ll have to choose between wielding two weapons at the same time or equipping one powerful two-handed one. The huge number of weapons keeps the gameplay interesting by letting you experiment with new combinations all the time: Would you like to send a concussion shot with the pistol first, then grab your hammer for a double blow, or rely on the mystical powers of the magic cross to set the zombies on fire? Clubs, axes, knives, revolvers, tasers, rifles, shotguns, bows, grenades, spell books, etc. There are hundreds of different weapons with which to kill the living dead - you can even use vehicles to run them over! While discovering the huge game world, you’ll encounter many different types of rotting enemies and menacing boss monsters whose different strategies and abilities will require you to think fast and hit hard if you want to live. The monsters thirst for blood and move in quickly from all sides, so make sure not to be surrounded! Friendly NPCs may ask you for help or fight alongside you, but in the end, there’s only one rule in this world: kill or be killed! Features: Zombie-Action in a rich horror atmosphere Five different classes with individual storylines Complex Skill tree to level up your abilities and attributes makes for an individual RPG experience Hundreds of weapons and items Diverse enemies and boss monsters Dialogue spoken by professional voice actors and fully subtitled",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/305500/header.jpg?t=1649420552",
    "Price": 0.99,
    "Developers": "Bigmoon Studios",
    "Publishers": "Headup Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/305500/ss_2dd2780404143f4c7e48458e1a2e0c456d01f272.1920x1080.jpg?t=1649420552,https://cdn.akamai.steamstatic.com/steam/apps/305500/ss_626a4d41f89569973b021f593c97dbf65690a6cc.1920x1080.jpg?t=1649420552,https://cdn.akamai.steamstatic.com/steam/apps/305500/ss_7c5b530f5125e7ca5b2663e0911f7058e529c7c6.1920x1080.jpg?t=1649420552,https://cdn.akamai.steamstatic.com/steam/apps/305500/ss_22cc8131879f1656599b63e8c0dabbfe0ea1888e.1920x1080.jpg?t=1649420552,https://cdn.akamai.steamstatic.com/steam/apps/305500/ss_c897a388eabe0b915b914500975e83bb6d0c071c.1920x1080.jpg?t=1649420552,https://cdn.akamai.steamstatic.com/steam/apps/305500/ss_108dab3b7218b9f9ff1408c891f025d3398b53f1.1920x1080.jpg?t=1649420552,https://cdn.akamai.steamstatic.com/steam/apps/305500/ss_939ba3a5d4b8d1f745b6c9f68646de7860fe4840.1920x1080.jpg?t=1649420552",
    "Slug": "trapped-dead-lockdown",
    "Meta Title": "Trapped Dead: Lockdown: Mar 20, 2015, Bigmoon Studios and...",
    "Meta Description": "Looking for information on Trapped Dead: Lockdown? Check out the release date (Mar 20, 2015), developer insights from Bigmoon Studios, and a complete ga...",
    "Alt Text Image": "Official header image for Trapped Dead: Lockdown game - Steam 305500",
    "Canonical URL": "https://gusku.site/game/trapped-dead-lockdown",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trapped Dead: Lockdown\", \"description\": \"Looking for information on Trapped Dead: Lockdown? Check out the release date (Mar 20, 2015), developer insights from Bigmoon Studios, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 20, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bigmoon Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Headup Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/305500/header.jpg?t=1649420552\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}