{
    "AppID": 858820,
    "Name": "Tribes of Midgard",
    "Release date": "Jul 27, 2021",
    "About the game": "Season 2: Serpent Saga is now live, pitting you and your Tribe against the perils of the uncharted seas! Sail across the previously unexplored seas to discover new islands and battle their fierce inhabitants. But beware… a new Saga Boss awaits you if you can uncover the secrets of its lair. Equip powerful new runes, dazzle in new weapons and armors, and put your new-found swimming skills to use to take on these new challenges and earn new season rewards! Tribes of Midgard is a co-op game with a unique blend of action, survival, and roguelite elements. Players must defend their village from hordes of invaders—deadly spirits and gigantic brutes—that every night threaten to destroy the Seed of Yggdrasil, the sacred tree you’re sworn to protect. Only by protecting the Seed, you and your tribe can stop Ragnarök—the end of the world! Venture with your tribe into the untamed wilds of Midgard to gather precious resources, hunt mythical beasts, defeat mighty foes, topple giants, and claim treasures. The further from the village you explore, the greater the challenge and greater the rewards—which you’ll need to stand against the ever-strengthening minions of the apocalypse. But you must return before the sun sets so you can bolster your defenses, craft powerful equipment, and fend off the nightly assaults. Roguelite Meets Survival Action: Each gameplay session begins with your tribe being dropped into a fresh, procedurally generated world, equipped with nothing but the loincloth on their backsides and an eternal oath to save the world. Gain knowledge, meta experience, and account unlocks each session to aid you in your quest to hold off Ragnarök for as long as you can. The longer you and your tribe survive, the greater the rewards! Face Colossal Game-Changers: Protect the Seed of Yggdrasil from a nightly invasion of Helthings and work together with your tribe to withstand the ever-looming threat of the Jötnar—epic giants hellbent on smashing both the Seed and your surrounding village to bits. The world (and the game) ends when the Seed is destroyed. Forge Your Viking Legend: Level up your character each session by choosing a class and taking the battle into the wilds as you seek resources to craft epic armor and mighty weaponry. Discover and equip powerful runes to complement your playstyle in surprising ways. Then, unleash destruction and prepare clever village defenses to give your enemies some nasty surprises. Rally the Tribe: When the giants arrive, it takes a village to bring them down! Adventure through Midgard solo or form a tribe of up to 10 players in online PvE co-op. Test your Viking skills against the seasonal challenges of Saga Mode or tailor the experience to your liking and see how long you can “surthrive” in the highly customizable Survival mode. We recommend taking on Ragnarök with a tribe of four or more. Explore a Bright Norse Realm: Gather resources, slay legendary beasts, delve through caves, claim treasure, and build anywhere as you explore formidable, procedurally generated lands on your quest to take on Ragnarök. Keep Up the Fight: Free, limited time seasonal events will bring bigger challenges and even mightier treasures to the endgame of Midgard throughout the year, including new ways to play and new rewards to earn through the season’s unlockable progression track.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/858820/header.jpg?t=1657656556",
    "Price": 19.99,
    "Developers": "Norsfell",
    "Publishers": "Gearbox Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/858820/ss_13989b205814a97a60b3257dc00882749d04a202.1920x1080.jpg?t=1657656556,https://cdn.akamai.steamstatic.com/steam/apps/858820/ss_8bb8c904036b6c5de7deb554272af9bb1dacd116.1920x1080.jpg?t=1657656556,https://cdn.akamai.steamstatic.com/steam/apps/858820/ss_9da09cdd897678588a63104a3caa37a4bf108659.1920x1080.jpg?t=1657656556,https://cdn.akamai.steamstatic.com/steam/apps/858820/ss_fda5c3bceb31e21a82ee35e634f7718a371b0a04.1920x1080.jpg?t=1657656556,https://cdn.akamai.steamstatic.com/steam/apps/858820/ss_e78d61230f04c0ce3db9548ff47d498b695b303a.1920x1080.jpg?t=1657656556,https://cdn.akamai.steamstatic.com/steam/apps/858820/ss_f4fc189a91dc1d14c42cfb04c662ea90fe7f3df9.1920x1080.jpg?t=1657656556,https://cdn.akamai.steamstatic.com/steam/apps/858820/ss_892d66d045a9b69a6629c96df6b909114748793e.1920x1080.jpg?t=1657656556,https://cdn.akamai.steamstatic.com/steam/apps/858820/ss_cf148ca49cd4c62ea865a3584e1c18194f6c9078.1920x1080.jpg?t=1657656556,https://cdn.akamai.steamstatic.com/steam/apps/858820/ss_c6240b04c8e1c109d5c81c9cb58fe414d982ce9a.1920x1080.jpg?t=1657656556,https://cdn.akamai.steamstatic.com/steam/apps/858820/ss_32644738072cb70f6955f87a4e84df878ab305e1.1920x1080.jpg?t=1657656556",
    "Slug": "tribes-of-midgard",
    "Meta Title": "Tribes of Midgard: Jul 27, 2021, Norsfell and Full Overview",
    "Meta Description": "Looking for information on Tribes of Midgard? Check out the release date (Jul 27, 2021), developer insights from Norsfell, and a complete game summary.",
    "Alt Text Image": "Official header image for Tribes of Midgard game - Steam 858820",
    "Canonical URL": "https://gusku.site/game/tribes-of-midgard",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tribes of Midgard\", \"description\": \"Looking for information on Tribes of Midgard? Check out the release date (Jul 27, 2021), developer insights from Norsfell, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Norsfell\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gearbox Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/858820/header.jpg?t=1657656556\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}