{
    "AppID": 448710,
    "Name": "VirZOOM Arcade",
    "Release date": "Jun 30, 2016",
    "About the game": "VIRZOOM VR GAMING SYSTEM Virtual Reality Sports “Play VR. Get Fit.” That’s what VirZOOM does. We make virtual reality games for an active motion controller where your pedaling and leaning propel you through race tracks, battlegrounds, soaring skies, and pictorial countrysides in the forms of an F1 pilot, a tank commander, a Pegasus, a cyclist, and more. Other online players automatically drop in and drop out of your games to provide competition and cooperation in matches up to 8 players. Make friends and challenge them to ghost competitions over a period of time, winner take all! Or choose your own workout and goals, collecting coins along the way to upgrade your avatars. Outside the game you can manage your challenges, tune your workouts, and track your stats on MyVirZOOM and link them to Fitbit and Strava. VirZOOM Arcade Games “VirZOOM Arcade” is our free collection of sport arcade games, available on Steam and the PlayStation Store. Our game controls and physics provide maximum VR comfort to play in large virtual worlds. No teleporting—your virtual movement reflects your actual movement. And though the games are designed for our bike controller for sport and exercise, you can also play them for free with a regular controller. More players means more fun for everyone, step up to a bike when you’re ready! Beyond our games, use the Gamepad Emulator (only available on PC) to turn your bike into a virtual joystick, keyboard, and mouse to play popular games. Configure your own mappings or use the ones we’ve made for Project Cars, EVE Valkyrie, and Radial-G. If you’re a developer, from homebrew to AAA, add VirZOOM bike and motion controls to your games for free with our Unity SDK. The VirZOOM Bike Actively experience virtual reality with the VirZOOM Bike Controller, priced and sized for home use by the whole family. Now try it with a 30-day money-back guarantee. Integrated sensors in the bike track your pedaling speed forward and backward. Not just cadence but the responsiveness you require for high performance gaming. Triggers and buttons are built into the grips to take air, get bursts of speed, and blast away obstacles. Lean on the bike to steer naturally using your VR system’s position tracking—our extra wide base keeps you planted! Choose the pedaling resistance that suits you to increase your score or speed or difficulty in our games. Heartrate sensors in the grips determine the calories you burn on every ride. The bike operates silently to be able to hear your games, and folds up easily to move in and out of your play area. 2 AA batteries power it for months to communicate wirelessly to your VR system without cords. VR System Not Included You must have your own VR system to play VirZOOM, but luckily it is compatible with all major systems having position tracking: Oculus Rift (with acceptable PC) HTC Vive (with acceptable PC) Windows Mixed Reality (with acceptable PC) PlayStation VR (with PS4)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/448710/header.jpg?t=1524845862",
    "Price": 0.0,
    "Developers": "VirZOOM",
    "Publishers": "VirZOOM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/448710/ss_1c0f5c58595c999b5d537fd95490e9db0384dae7.1920x1080.jpg?t=1524845862,https://cdn.akamai.steamstatic.com/steam/apps/448710/ss_eeb2fff06d1ecd4fd275b3b2999b43f3205009b3.1920x1080.jpg?t=1524845862,https://cdn.akamai.steamstatic.com/steam/apps/448710/ss_9113d1a26fda39e2ab6f76806e52a6c82b03266a.1920x1080.jpg?t=1524845862,https://cdn.akamai.steamstatic.com/steam/apps/448710/ss_99b0199e5166e3745e8457825da779f94614c2dc.1920x1080.jpg?t=1524845862,https://cdn.akamai.steamstatic.com/steam/apps/448710/ss_83718e77dfca0105779fc41c0aec5bbc7f892ab4.1920x1080.jpg?t=1524845862,https://cdn.akamai.steamstatic.com/steam/apps/448710/ss_9b0a0e2aa20fb5005f23505bb6ffb95cecda31aa.1920x1080.jpg?t=1524845862",
    "Slug": "virzoom-arcade",
    "Meta Title": "VirZOOM Arcade: Jun 30, 2016, VirZOOM and Full Overview",
    "Meta Description": "Looking for information on VirZOOM Arcade? Check out the release date (Jun 30, 2016), developer insights from VirZOOM, and a complete game summary.",
    "Alt Text Image": "Official header image for VirZOOM Arcade game - Steam 448710",
    "Canonical URL": "https://gusku.site/game/virzoom-arcade",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VirZOOM Arcade\", \"description\": \"Looking for information on VirZOOM Arcade? Check out the release date (Jun 30, 2016), developer insights from VirZOOM, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 30, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"VirZOOM\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VirZOOM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/448710/header.jpg?t=1524845862\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}