{
    "AppID": 736280,
    "Name": "VJmachine",
    "Release date": "Nov 24, 2017",
    "About the game": "VJmachine is the plug &amp; play Full HD VJ software music visualizer and music video creator e.g. YouTube for everyone and everywhere. The developers are looking back on more than fourteen years of know-how and experience gained from live appearances and the creation of so-called 3D real-time demos under the Demo and VJ-label einklang[dot]net , which has become nationally and internationally renowned. VJmachine comes with more than hundred 3D real-time scenarios and styles, all video effects and full automatic synchronization to any kind of music. In combination with your custom video and picture content you create a unique experience for every event. Simply connect your PC/Notebook to any sound source as well as to one or several projectors, displays or LED walls and VJmachine will create a symbiosis of image and sound. To celebrate with your friends and family you can integrate your own videos &amp; pictures as logo, flyers or slideshows such as party images of your friends or family celebration movies. Live video integration is as well possible. Musicians and creatives can create their own music videos with just a few clicks, for example for YouTube or other video portals. USER INTERFACE VJmachine comes with a user-friendly and intuitive interface. The guiding design principle was: all functions are always displayed at the same position on the monitor and are accessible with two klicks/touches, whereby the system status always remains within visual range. Apart from basic operating elements such as 3d scenario and video selection, the user is provided with elaborate visual functions and effects with which the animations can be influenced live. Via Auto FX the VJmachine automatically uses all effects in sync to the music. Slideshow, Logo and Flyer function animate pictures of your friends, family or the party crowd fully automatically to the music. VIDEOS You can integrate your own videos in different ways into animations. All standard formats (avi, mov and mp4) are supported. No limits are set on creativity, regardless of whether it's VJ videos, party videos or advertising videos. Just press the Movie button, select a directory with your videos and take the ones you want to be integrate in the visualization. VJmachine fully automatically takes care about the synchronization to the music. PICTURES Logos, Flyers and Slideshow are three different ways to integrate pictures. No time-consuming content preparation or conversion is required beforehand. Just choose one of the options Logos, Flyers or Slideshow, select a directory with your pictures (jpg, bmp, png, pic) and press Active. You can easily integrate photos from your friends and family, previous events/parties or logos in real time into the animations. VJmachine automatically scale them to correct sizes and cool styles in sync to the music. Logos and Flyers are not configurable in the Demo Version instead the VJmachine logo is regularly shown, please buy the full version of VJmachine to use own pictures for logos and flyers. DMX AND MIDI MIXER For professional or advances use cases also DMX or Midi controle is supported. The DMX or MIDI mixer not only controls basic features such as brightness and color adjustment, but also many other effects such as stroboscope, kaleidoscope, complex light shows and programs. Simply connect your MIDI or DMX controller into a USB port and configure it under CONFIG à MIDI or DMX. For DMX an Enttec DMX USB Pro adapter is required.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/736280/header.jpg?t=1550770137",
    "Price": 49.99,
    "Developers": "einklang.VISUALS GmbH",
    "Publishers": "einklang.VISUALS GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_3ef1615bff2c3fe2f7fdbebf20831bdc790f8c9a.1920x1080.jpg?t=1550770137,https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_308b30fb7f50545d86d2b8e73b0b3b1614824be7.1920x1080.jpg?t=1550770137,https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_b1f398d06ee5674ea54ed869109cce0441d2115d.1920x1080.jpg?t=1550770137,https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_84ea34071b657fee71ddc20add70438c2f593d94.1920x1080.jpg?t=1550770137,https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_cffa8dea239325286e33940404db8f87a0f6ee74.1920x1080.jpg?t=1550770137,https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_40f0996f923dee8de2c43264e80efd29326d38ce.1920x1080.jpg?t=1550770137,https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_176d0eb98ec2db72bb799141362b263be8236e3b.1920x1080.jpg?t=1550770137,https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_03a3fd7ccf189c82b98ed0bc65feaad4dff70edd.1920x1080.jpg?t=1550770137,https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_901e908b3a5d2852ac3755111a752e67251b1689.1920x1080.jpg?t=1550770137,https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_f86c894547f464045cc6cc2a8c035128a0b9c01f.1920x1080.jpg?t=1550770137,https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_dc708f7b11e73f37c3697ff4020b4fd20dcf2978.1920x1080.jpg?t=1550770137,https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_7af95f247aa935c2514c6c2f06f3e5f80d9fefc6.1920x1080.jpg?t=1550770137,https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_8bc5d85ff4e93e43f8f046652575f49b7cede3d4.1920x1080.jpg?t=1550770137,https://cdn.akamai.steamstatic.com/steam/apps/736280/ss_85935b97f6043757fde483f174bdfcd485a85652.1920x1080.jpg?t=1550770137",
    "Slug": "vjmachine",
    "Meta Title": "VJmachine: Nov 24, 2017, einklang.VISUALS GmbH and Full O...",
    "Meta Description": "Looking for information on VJmachine? Check out the release date (Nov 24, 2017), developer insights from einklang.VISUALS GmbH, and a complete game summ...",
    "Alt Text Image": "Official header image for VJmachine game - Steam 736280",
    "Canonical URL": "https://gusku.site/game/vjmachine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VJmachine\", \"description\": \"Looking for information on VJmachine? Check out the release date (Nov 24, 2017), developer insights from einklang.VISUALS GmbH, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 24, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"einklang.VISUALS GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"einklang.VISUALS GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/736280/header.jpg?t=1550770137\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}