{
    "AppID": 438100,
    "Name": "VRChat",
    "Release date": "Feb 1, 2017",
    "About the game": "Imagine a world where anything is possible. Join a game of capture the flag in outer space. Share stories around a campfire while roasting marshmallows, then moments later experience a retro game of bowling with an alien and robot. In VRChat there is something around every corner that will delight, thanks to the power of true user generated content. Jump into hundreds of awe inspiring environments and meet unique avatars every day. Watch a movie on the moon. Ride the Titanic. Step into a new world every time you come online. In VRChat, you are one of us. Enjoy your stay. Chat using full spatialized 3-d audio in a wide variety of environments. Use emotes, emoji, and hand gestures to communicate fully with your entire body. We have avatars with incredible technology, including mouths that realistically match your speech and eyes that actually look at you. Our full IK system tracks when you lean or crouch. All in all, VRChat has the most expressive avatars around! Feeling active? Jump into a match of Capture the Flag or enter the old west and rob a bank in Steel n’ Gold. Go head-to-head in Battle Discs or bowl out a few frames with friends. Feeling more creative? Put on some Bob Ross and bring out your inner artist in Sculpt Studio or enjoy a night of VR Karaoke. Whatever your mood, we’ve got something for you. Want to watch YouTube videos in a space station with friends? Check. How about catching a show in a jazz bar? Check. Feel like brainstorming your next million-dollar concept in our presentation room? Double check. With hundreds of unique worlds and more opening up weekly, there is always a different place to chill and socialize with others. Join our community of builders using Unity and our SDK to create worlds and avatars in VRChat! Our Unity SDK lets you create a wide variety of VR experiences. Build a new world from your own imagination. Create an avatar that expresses your unique personality. Don’t want to stop with avatars and worlds? Start your own event! VRChat is home to Gunter's Universe, the first ever talk show in VR. Host your own show, teach a class on how to build in VRChat, create a musical performance, or start your own VR acting studio! The possibilities are endless! Show off your latest creations to your friends, our entire community and the whole world! Snap a Polaroid with our in-game cameras. Pass the photo around in VR or share your desktop version anywhere. You can even snap and share a 3-D 360° panorama anytime in VRChat. Thanks to our integration with VRChive, no matter where you are in VRChat, you can easily take 360° panos. Snap away! CONSIDERATIONS Let’s keep it loose and friendly. No hateful speech, excessive profanity, explicit sexual behavior, self-promotion or solicitation. By entering VRChat, you are agreeing to our Code of Conduct, complete version found on our website. We wish you a pleasant journey on your trip down the rabbit hole. WANT MORE INFO? Join our Discord community chat at to get involved sharing ideas, get or offer help, join our beta tests and more. Contact us at support@vrchat.com .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/438100/header.jpg?t=1648777811",
    "Price": 0.0,
    "Developers": "VRChat Inc.",
    "Publishers": "VRChat Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/438100/ss_1577335ddadd96c338c16a747758290b4214eb85.1920x1080.jpg?t=1648777811,https://cdn.akamai.steamstatic.com/steam/apps/438100/ss_31f674ab2a2cdf3d72ff7e8155100f4539a65a72.1920x1080.jpg?t=1648777811,https://cdn.akamai.steamstatic.com/steam/apps/438100/ss_869211a61f76ff08db693092b43678278c396249.1920x1080.jpg?t=1648777811,https://cdn.akamai.steamstatic.com/steam/apps/438100/ss_9f66a537db246bbf8fa0aa9c6681a37f65307ac2.1920x1080.jpg?t=1648777811,https://cdn.akamai.steamstatic.com/steam/apps/438100/ss_b0c252d8f3c07478ec4001c995f4f6c75afb16a1.1920x1080.jpg?t=1648777811,https://cdn.akamai.steamstatic.com/steam/apps/438100/ss_38db30a76b354606cf8583565179e69c1054b23c.1920x1080.jpg?t=1648777811,https://cdn.akamai.steamstatic.com/steam/apps/438100/ss_c52a57f7f15d49d0d3ccd1743858a94c0dcc1ef1.1920x1080.jpg?t=1648777811,https://cdn.akamai.steamstatic.com/steam/apps/438100/ss_d4351d713e0dc6210d5c275060f611c6adb13df2.1920x1080.jpg?t=1648777811",
    "Slug": "vrchat",
    "Meta Title": "VRChat: Feb 1, 2017, VRChat Inc. and Full Overview",
    "Meta Description": "Looking for information on VRChat? Check out the release date (Feb 1, 2017), developer insights from VRChat Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for VRChat game - Steam 438100",
    "Canonical URL": "https://gusku.site/game/vrchat",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VRChat\", \"description\": \"Looking for information on VRChat? Check out the release date (Feb 1, 2017), developer insights from VRChat Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 1, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"VRChat Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VRChat Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/438100/header.jpg?t=1648777811\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}