{
    "AppID": 1233040,
    "Name": "Wardens",
    "Release date": "Oct 15, 2021",
    "About the game": "A turn-based tactical board game with card battler elements One of the biggest issues with current card battlers is that you have to spend a lot of money to stay competitive by frequently purchasing new packs and cards. We believe that this should be free/included once you own the game and so, all future packs containing new official cards, decks and game rules will be available to you at no additional cost. In the future we hope to make it easy to share user generated content within the game so that you always have new and exciting decks to try out. In future versions, and only if needed, we might introduce purchasable cosmetics to cover our maintenance costs. What is a pack? A pack contains cards (the actual units on the board), game rules such as win conditions, and pre-made decks so that you can jump right in and get a feel for what the pack offers in terms of abilities and synergies. Game modes These are the currently available game modes: Online: Play online against other players, either in public or private matches. Hotseat: Play local matches against another player. Supports Steam Remote Play! Practice: Play local matches against the AI. Campaign: Not available yet but will feature challenges and boss fights! What can be created? You can create units and customize their name, movement patterns, portrait, power level and abilities. Abilities are created with our unique in-game editor and allows you to create both passive and active abilities. Passive abilities triggers automatically based on its conditions/requirements. Active abilities are triggered by the player and on its own turn. Here are a few examples: Trample units and freeze them for x turns. Spend x mana to self detonate at the end of the turn, destroying all nearby units. Charge for x turns and then unleash a storm of magic missiles, destroying all units in a forward line. When your unit is overtaken, stun its attacker for x turns. Spend x mana to unfreeze your allies and destroy all frozen enemy units. When overtaking an enemy, become immune to magic attacks for x turns. Poison all undead opponents wielding a weapon for x turns. Win conditions You can also create custom win conditions, currently following a chess style format, such as: Capture the king: Take out the opponent king to win. Four Pawns To Victory: Take out 4 or more opponent pawns to win. Rush: Get your opponent down to 10 units or less to win.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1233040/header.jpg?t=1656275657",
    "Price": 17.99,
    "Developers": "Thorian Games",
    "Publishers": "Thorian Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1233040/ss_90447b2ba54222a3e974066235b86b7517e11143.1920x1080.jpg?t=1656275657,https://cdn.akamai.steamstatic.com/steam/apps/1233040/ss_8452cc67a0728e4415ac61848939064df5845c79.1920x1080.jpg?t=1656275657,https://cdn.akamai.steamstatic.com/steam/apps/1233040/ss_a7310d9d332d97497b24c1fcd00fd50c9f2916c7.1920x1080.jpg?t=1656275657,https://cdn.akamai.steamstatic.com/steam/apps/1233040/ss_3604e421d1ccbd4b102859eb549512084595deb7.1920x1080.jpg?t=1656275657,https://cdn.akamai.steamstatic.com/steam/apps/1233040/ss_76a91b9dece7caf429f1275b1d4903424593b7a3.1920x1080.jpg?t=1656275657,https://cdn.akamai.steamstatic.com/steam/apps/1233040/ss_e1f79428db19f16093b0349bb6055d26c46ec96b.1920x1080.jpg?t=1656275657,https://cdn.akamai.steamstatic.com/steam/apps/1233040/ss_e7e70f15eeee753e23ef6767561b0fba2421a9b1.1920x1080.jpg?t=1656275657",
    "Slug": "wardens",
    "Meta Title": "Wardens: Oct 15, 2021, Thorian Games and Full Overview",
    "Meta Description": "Looking for information on Wardens? Check out the release date (Oct 15, 2021), developer insights from Thorian Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Wardens game - Steam 1233040",
    "Canonical URL": "https://gusku.site/game/wardens",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wardens\", \"description\": \"Looking for information on Wardens? Check out the release date (Oct 15, 2021), developer insights from Thorian Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Thorian Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Thorian Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1233040/header.jpg?t=1656275657\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}