{
    "AppID": 1898790,
    "Name": "A Crown of Sorcery and Steel",
    "Release date": "Oct 27, 2022",
    "About the game": "Swing a sword, delve dungeons, and lead a resistance against the tyrannical queen of a war-torn fantasy realm. Will you be an elf, orc, dwarf, or human? “Crown of Sorcery and Steel” is a 300-thousand word interactive novel by Josh Labelle. It’s entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. For centuries, the kingdom of Kanda has been at war with Queen Nidana and her infernal machines. Each day, further reaches of the kingdom fall under her boot, overwhelmed by her enchanted army of iron constructs. You’re an adventurer, caught in the middle of a war that began before you were born. Perhaps you’re an elf from the Sanctuaries to the west... which the queen’s machines long ago burned to the ground. Maybe you come from Ridgebank, one of the last human strongholds. Wherever you’re from, now you make your living helping people, plundering dungeons, or following the coin wherever it leads you. It’s not long before you’re invited to join the resistance and battle back against the dark empress. But will you rally the resistance... or ally with the queen and snuff it Out? Play as male, female, nonbinary; gay, straight, bi, asexual, or poly. Or choose among the genders of the elven, dwarven, and orc cultures. Wield a sword, master magic, or disarm traps as you travel Kanda, a teeming fantasy kingdom struggling against a brutal occupation. Engage in epic fantasy combat and turn the tide of the war as you battle side by side with a party full of fighters, spellslingers, and rogues. Explore the realm as a human, elf, dwarf, or orc, with four distinct backgrounds that change your adventure. Broker peace between the human cities and the dwarven mining colonies or side with the dwarves and take control of the mountains. Delve lost ruins to uncover ancient elven artifacts, and restore the elves to their former glory... or sell the artifacts off to the highest bidders. Navigate palace intrigue in the orc empire, and decide who should take the throne. Turn against the resistance and become the queen's best-loved spy to experience another side of the story. Romance a human resistance leader, an elven Scribe, a dwarven bard, an exiled orc prince, a halfling thief... or the dark queen herself. Will you unite the realm and end the queen’s reign of terror... or join her and rule by her side?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1898790/header.jpg?t=1666873822",
    "Price": 5.39,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1898790/ss_bccebfa034513447b008258c08cdf226ae5ce730.1920x1080.jpg?t=1666873822,https://cdn.akamai.steamstatic.com/steam/apps/1898790/ss_950854dfbe5d5c21184ffbad030f53132c5c134d.1920x1080.jpg?t=1666873822,https://cdn.akamai.steamstatic.com/steam/apps/1898790/ss_7dec8739109c2dfdaf4c9a1689a087c92506b8dd.1920x1080.jpg?t=1666873822,https://cdn.akamai.steamstatic.com/steam/apps/1898790/ss_a946e93808d184a4e719e111f216a9a6391eee19.1920x1080.jpg?t=1666873822,https://cdn.akamai.steamstatic.com/steam/apps/1898790/ss_28e70c9b2e491faab60de7498686286ec984b69a.1920x1080.jpg?t=1666873822",
    "Slug": "a-crown-of-sorcery-and-steel",
    "Meta Title": "A Crown of Sorcery and Steel: Oct 27, 2022, Choice of Gam...",
    "Meta Description": "Looking for information on A Crown of Sorcery and Steel? Check out the release date (Oct 27, 2022), developer insights from Choice of Games, and a compl...",
    "Alt Text Image": "Official header image for A Crown of Sorcery and Steel game - Steam 1898790",
    "Canonical URL": "https://gusku.site/game/a-crown-of-sorcery-and-steel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"A Crown of Sorcery and Steel\", \"description\": \"Looking for information on A Crown of Sorcery and Steel? Check out the release date (Oct 27, 2022), developer insights from Choice of Games, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1898790/header.jpg?t=1666873822\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}