{
    "AppID": 2163710,
    "Name": "Aevumblade Chronicles",
    "Release date": "Oct 31, 2022",
    "About the game": "Aevumblade Chronicles is an Action RPG that is currently in the process of development and is slowly expanding into a fully developed game. Currently, the project is at the Alpha stage. Our goal is to create an enjoyable and playable demo that users can experience! We hope to construct it into a complete game. Players will be able to explore a large terrain called Primordium (and soon will be able to travel to other available islands in future updates). Inspired by great role-playing games The Aevumblade Chronicles is our take on an Action role-playing game. The main goal is to make the gameplay fun and accompany it with an interesting and amazing story. This demo offers up to 5 characters to play. We took inspiration on existing franchises and implemented some ideas we thought would result in a fun and unique experience! Give it a try and tell us what you think! We will continue on adding more improvements and features on future updates for the game! Thank you for taking the time to read about this project, hope to deliver an experience that will be great! Alpha Build 4.5.0 features: 5 playable main characters to choose from A level system to increase stats A real-time strategic combat system An open world to explore along with some platforming and puzzles to solve Enemies to encounter and fight! Experimental and Future features: Experimental Stage Controller support (Still in development) More to be added soon... (Sea travel, story quests, side quests, hunting, upgrading, and much more!!) Main Characters Choose from the 5 heroes in this game and experiment on the one you think best fits your playstyle. Marcus, a hunter and merchant trying to earn a living to help out his foster mother - Class: Attack Clementine, The princess of a fallen country on a mission to restore her parents and kingdom - Class: Heal Lucette, an engineer and thief looking to become wealthy- Class: Flank Azura, an Ex-Prasidian guard striving to protect the ones she cares for - Class: Support Deante, a Blacksmith longing an opportunity to be a hero - Class: Tank Exploration In this game, players will be encouraged to explore the vast and beautiful areas. Explore from large field plains, caves, high mountains, and much more. Each place will offer a different aesthetic and who knows you may run into a secret or two hiding within each area. Future updates will only expand these possibilities to the sea and skies offering countless of breathless views and adventures! (More features will be added as the game continues to get updated) Combat Style In this game you will be able to choose to play as one of the 5 main characters, each having their unique sets of attacks and special abilities. Execute from a range of 5-7 arts per character at your disposal and chain these arts to form powerful combos. However, be cautious on your attack positioning, guarding and the attack's effects. These are vital and may impact on the outcome of the battle ( Mechanics and specific combat details are provided within the game's manual ). DISCLAIMER: Aevumblade Chronicles is still in the process of development. The requirements may subject to change. Additionally, the Alpha demo is subject to change and does not reflect on the final product. We apologize if you experience any issues during gameplay but ask for your understanding as we put our best effort to fix and address the issues. We want to build a game that everyone can enjoy. Be sure to report any issues/bugs/glitches if you can! This will help speed up the development process.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2163710/header.jpg?t=1667334157",
    "Price": 0.0,
    "Developers": "Nexus Entertainment Software",
    "Publishers": "Nexus Entertainment Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2163710/ss_47ffe7c2314bbb8db458bde68cae2af1a45473d5.1920x1080.jpg?t=1667334157,https://cdn.akamai.steamstatic.com/steam/apps/2163710/ss_ac2f940f51f07c216a085119f993fcc0a4fa4e1f.1920x1080.jpg?t=1667334157,https://cdn.akamai.steamstatic.com/steam/apps/2163710/ss_675567524bd4e18b091487b0fda8a61492a0d9df.1920x1080.jpg?t=1667334157,https://cdn.akamai.steamstatic.com/steam/apps/2163710/ss_37e6bc94ab459925430520b9992a39ae599d994f.1920x1080.jpg?t=1667334157,https://cdn.akamai.steamstatic.com/steam/apps/2163710/ss_9913d3a5ab6d75c97e9ee27e21407b4bf4c8208f.1920x1080.jpg?t=1667334157,https://cdn.akamai.steamstatic.com/steam/apps/2163710/ss_4f313f738e587b087cd63006dc1ecaf5ac40d378.1920x1080.jpg?t=1667334157,https://cdn.akamai.steamstatic.com/steam/apps/2163710/ss_e5985af3f2a0259cd1dc84bc40b3a704f99c520d.1920x1080.jpg?t=1667334157,https://cdn.akamai.steamstatic.com/steam/apps/2163710/ss_4121866945fdb414295a4eb602b5958f9bda2178.1920x1080.jpg?t=1667334157,https://cdn.akamai.steamstatic.com/steam/apps/2163710/ss_d6714505fa607afb10593b77ae90ea09ede160fa.1920x1080.jpg?t=1667334157,https://cdn.akamai.steamstatic.com/steam/apps/2163710/ss_0663acf1efa0896d45418494f8b56a6b41578ae9.1920x1080.jpg?t=1667334157",
    "Slug": "aevumblade-chronicles",
    "Meta Title": "Aevumblade Chronicles: Oct 31, 2022, Nexus Entertainment ...",
    "Meta Description": "Looking for information on Aevumblade Chronicles? Check out the release date (Oct 31, 2022), developer insights from Nexus Entertainment Software, and a...",
    "Alt Text Image": "Official header image for Aevumblade Chronicles game - Steam 2163710",
    "Canonical URL": "https://gusku.site/game/aevumblade-chronicles",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Aevumblade Chronicles\", \"description\": \"Looking for information on Aevumblade Chronicles? Check out the release date (Oct 31, 2022), developer insights from Nexus Entertainment Software, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nexus Entertainment Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nexus Entertainment Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2163710/header.jpg?t=1667334157\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}