{
    "AppID": 1336490,
    "Name": "Against the Storm",
    "Release date": "Nov 1, 2022",
    "About the game": "You are the Viceroy – a leader charged by the Scorched Queen to reclaim the wilderness and discover lost riches for the Smoldering City, civilization’s last bastion against the Blightstorm that destroyed the old world. Unlike most survival city builders where your focus is on a single city, in Against the Storm you must build a vast, prosperous network of settlements populated by diverse fantasy races, each with their own specializations and needs. But the wilderness holds many hidden dangers, and never-ending storms will batter your population into submission. If your settlements should fall, then the expedition may end – but not the game. Against the Storm is a roguelite city builder, meaning you will carry forward the resources, upgrades, and experience of your past expeditions each time you set off for a new journey into the wild. Beavers and lizards stand alongside humans and harpies in the struggle to survive. Utilize each group’s strengths as you balance varying needs, from housing and culinary preferences to taste in luxuries and recreation. Manufacture raincoats, brew ale, and bake pies to boost morale in the face of the oppressive hostility of the forest. Experience core city builder gameplay enhanced by roguelite replayability. Build new settlements and collect valuable meta-progression resources to upgrade the Smoldering City. Recurring Blightstorms pose an inevitable threat to settlements, but they also reshape the world and open new opportunities for growth. With hundreds of gameplay modifiers and 5 distinct biomes, every city location presents unique challenges for even the most resourceful Viceroy. Adjust your strategy to changing weather conditions and experiment with settlement “builds” — rosters of building blueprints and perks that can help your society thrive or bring it to ruins. Mix and match ingredients to take advantage of the resources at hand. You never know what wares the Trader will bring next year, and the forest hold treasures, resources… and ancient threats. Laying the foundations for a new city is one of the most exciting moments in a city builder game. In Against the Storm, you’ll have the opportunity to repeatedly create new settlements, while still interacting and trading with previously established cities in a growing world.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1336490/header.jpg?t=1667709883",
    "Price": 16.99,
    "Developers": "Eremite Games",
    "Publishers": "Hooded Horse",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1336490/ss_c5e7f55444d87f26921736f2d228c092f4dda5f2.1920x1080.jpg?t=1667709883,https://cdn.akamai.steamstatic.com/steam/apps/1336490/ss_c7a8ad6065ddaa4789935d28d99e24c940c2181c.1920x1080.jpg?t=1667709883,https://cdn.akamai.steamstatic.com/steam/apps/1336490/ss_c72741bd63e61c8d952fed96bd0ba6c554a665b1.1920x1080.jpg?t=1667709883,https://cdn.akamai.steamstatic.com/steam/apps/1336490/ss_60abf591b2639f3c3a3f11fcb131a5b69ebf230c.1920x1080.jpg?t=1667709883,https://cdn.akamai.steamstatic.com/steam/apps/1336490/ss_08bcd9f1f384f0a81d45efe410890f38cf682ada.1920x1080.jpg?t=1667709883,https://cdn.akamai.steamstatic.com/steam/apps/1336490/ss_1acb8473698a8801a83d5830c1dab3fde13dd781.1920x1080.jpg?t=1667709883,https://cdn.akamai.steamstatic.com/steam/apps/1336490/ss_ba28ffba273c41a5b7df8aeb57bdb4f4cd41c3b5.1920x1080.jpg?t=1667709883,https://cdn.akamai.steamstatic.com/steam/apps/1336490/ss_49466e66dbf5150586d2821a7e65efcfbb6725fe.1920x1080.jpg?t=1667709883",
    "Slug": "against-the-storm",
    "Meta Title": "Against the Storm: Nov 1, 2022, Eremite Games and Full Ov...",
    "Meta Description": "Looking for information on Against the Storm? Check out the release date (Nov 1, 2022), developer insights from Eremite Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Against the Storm game - Steam 1336490",
    "Canonical URL": "https://gusku.site/game/against-the-storm",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Against the Storm\", \"description\": \"Looking for information on Against the Storm? Check out the release date (Nov 1, 2022), developer insights from Eremite Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eremite Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hooded Horse\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1336490/header.jpg?t=1667709883\", \"offers\": {\"@type\": \"Offer\", \"price\": 16.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}