{
    "AppID": 1717270,
    "Name": "Arkanoid - Eternal Battle",
    "Release date": "Oct 27, 2022",
    "About the game": "Discover or re-discover, the emblematic block breaker game in a fully modernized version! Classic elements from the franchise will definitely make a comeback, with a brand-new look, new rules, as well as new effects, bonuses and features! Including, for the very first time, a Battle Royale mode called 'Eternal Battle'. Guaranteed to take veteran players by surprise! Arkanoid is an iconic arcade game, developed by TAITO Corporation in 1986. When the mother ship ARKANOID comes under attack, the small spacecraft VAUS manages to escape but ends up warped into another dimension. Wandering in an inter-dimensional labyrinth, VAUS must destroy blocks called ''spacewalls'' in order to defeat ''DOH'', the creator of the maze responsible for ARKANOID’s destruction. Arkanoid – Eternal Battle, developed by the talented French studio Pastagames marks the return of the iconic block breaker game. A brand-new artistic direction and new surprising features, items and powers. For the first time ever, players will be able to compete against each other, offering an online experience thanks to the Eternal Battle mode, the main new feature of this game, brining the arcade experience to a whole new level. This Battle Royale mode offers the possibility to compete among 24 players online. Arkanoid is one of the most accessible, if not, the most accessible game in the history. The concept remains simple, but you'll will face level after level an increase of progressive difficulty. including: 2 single-player modes (Neo &amp; Retro) and 2 multiplayer modes, Local Versus and Eternal Battle NEO (1-player): A new game mode. Same Gameplay as the classic Arkanoid Game with new power-ups and new spacewalls RETRO (1-player): Discover a part of History through a vintage Arcade Cabinet VERSUS (2-4 players): Players competing on the same screen (split-screen) based on the Neo mode gameplay. Please note that a controller is required for local multiplayer. ETERNAL BATTLE (25-player): Players competing online, the last player standing wins the game. Champions can use special powers to take the advantage during the game. High Replay-Value, thanks to the new ''Eternal Battle'' mode, play online and face opponents around the world Adaptative and progressive original soundtrack, composed by Xavier Thiry Cross-play feature, enable players being able to use each different hardware/console to play with each other Dedicated online leaderboard in the 3 main modes (Neo, Retro, Battle Royale) will be available at launch, highlight the players' highest scores'",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1717270/header.jpg?t=1666945754",
    "Price": 26.99,
    "Developers": "Pastagames",
    "Publishers": "Microids",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1717270/ss_bb9b24f4dc10b73ec5b1b2bd101e6651eea0e8e3.1920x1080.jpg?t=1666945754,https://cdn.akamai.steamstatic.com/steam/apps/1717270/ss_4e33b58a62136e6f3eb4c45732d6b881dbb09670.1920x1080.jpg?t=1666945754,https://cdn.akamai.steamstatic.com/steam/apps/1717270/ss_d65a6716d653b5da1c586b42f0a5f3bcdfa8af24.1920x1080.jpg?t=1666945754,https://cdn.akamai.steamstatic.com/steam/apps/1717270/ss_083fba3e14035bebac96efce0ddde6b2bd498d34.1920x1080.jpg?t=1666945754,https://cdn.akamai.steamstatic.com/steam/apps/1717270/ss_e3696884045b79598b471e51a16d1c8f58220540.1920x1080.jpg?t=1666945754,https://cdn.akamai.steamstatic.com/steam/apps/1717270/ss_8f111e340ae45f2d8224e2b2f99166d7175163a3.1920x1080.jpg?t=1666945754,https://cdn.akamai.steamstatic.com/steam/apps/1717270/ss_bb3b1642512cd005ea498d23af533247aac73c1f.1920x1080.jpg?t=1666945754",
    "Slug": "arkanoid-eternal-battle",
    "Meta Title": "Arkanoid - Eternal Battle: Oct 27, 2022, Pastagames and F...",
    "Meta Description": "Looking for information on Arkanoid - Eternal Battle? Check out the release date (Oct 27, 2022), developer insights from Pastagames, and a complete game...",
    "Alt Text Image": "Official header image for Arkanoid - Eternal Battle game - Steam 1717270",
    "Canonical URL": "https://gusku.site/game/arkanoid-eternal-battle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Arkanoid - Eternal Battle\", \"description\": \"Looking for information on Arkanoid - Eternal Battle? Check out the release date (Oct 27, 2022), developer insights from Pastagames, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pastagames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Microids\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1717270/header.jpg?t=1666945754\", \"offers\": {\"@type\": \"Offer\", \"price\": 26.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}