{
    "AppID": 2096790,
    "Name": "Assassin's Vol.",
    "Release date": "Oct 26, 2022",
    "About the game": "Game Introduction Background of the game The frequent bullying of women, especially the bullying of beautiful women, by the Bishop of the Church of Pine Creek has become a matter of common knowledge. Although the people have repeatedly sent letters to the prosecutor's office, but the starting point of the law management under the 'three capitals' system is in the capital of the law called 'Kangyi', not to mention whether there will be an ombudsman to investigate and verify this matter, on the town of Songxi, which is a small place on the map, you have to zoom in three times to find. The town of Pine Creek, a small place that you have to zoom in three times to find, will be waiting in line for a long time for the report letters to be checked. As the bishop of the local church naturally understands this than anyone else, so do things more recklessly. Gameplay The player needs to control the female assassin in various scenes in the battle, is to help the assassin lady 'escape from the room' or 'face the danger', all in your choice. Game features In the game, you will experience. - A fun and casual gaming experience - A futuristic science fiction world view - A gorgeous realistic game style - One click to skip There are many beautiful CGs, achievements and backgrounds to get, so come and have a romantic and exciting date with Ms. Assassin~ Character List Character: Lu Wu interjection (female lead) Profession: Assassin Setting: A serpentine beauty, agile, persistent and daring, she travels alone to investigate the events of the church in Songxi Town. About Us Hello, we are Lovely Game, desire, throbbing, we are eager to give you the purest romance. Because we want to provide you with a more convenient gaming experience, we have now launched the official Lovely Games website, so you can get our latest information anytime, anywhere, and if you encounter any problems in the game, you can also choose to raise them in the community F&amp;Q discussion or the official steam group ~ Thanks for liking.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2096790/header.jpg?t=1667069684",
    "Price": 1.79,
    "Developers": "Lovely Games",
    "Publishers": "Lovely Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2096790/ss_c1229c8987471cbb8c2a0d0bffbfb8730fb0efd6.1920x1080.jpg?t=1667069684,https://cdn.akamai.steamstatic.com/steam/apps/2096790/ss_a6cfeff3878c5fb56bb6eab764e10339e6a235b4.1920x1080.jpg?t=1667069684,https://cdn.akamai.steamstatic.com/steam/apps/2096790/ss_e92fc0195e67b6a6d7dbd464ba1b183d7fac817b.1920x1080.jpg?t=1667069684,https://cdn.akamai.steamstatic.com/steam/apps/2096790/ss_d6fb55b5c24df071a16441aac7915df5cf72b51d.1920x1080.jpg?t=1667069684,https://cdn.akamai.steamstatic.com/steam/apps/2096790/ss_195acff88bbcd8b2879a2903394785ec89712fc4.1920x1080.jpg?t=1667069684",
    "Slug": "assassin-s-vol",
    "Meta Title": "Assassin's Vol.: Oct 26, 2022, Lovely Games and Full Over...",
    "Meta Description": "Looking for information on Assassin's Vol.? Check out the release date (Oct 26, 2022), developer insights from Lovely Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Assassin's Vol. game - Steam 2096790",
    "Canonical URL": "https://gusku.site/game/assassin-s-vol",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Assassin's Vol.\", \"description\": \"Looking for information on Assassin's Vol.? Check out the release date (Oct 26, 2022), developer insights from Lovely Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lovely Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lovely Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2096790/header.jpg?t=1667069684\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}