{
    "AppID": 1918440,
    "Name": "Championship Wrestling Promoter",
    "Release date": "Nov 9, 2022",
    "About the game": "Have you ever wanted to run your own professional wrestling promotion, trying to win the TV ratings war against your rivals by putting on great shows? Championship Wrestling Promoter is the game you've been waiting for! In Championship Wrestling Promoter you run the show from behind the scenes without directly controlling the wrestlers. You'll put together TV shows and pay-per-view events by booking matches and promos to try to get audiences to go wild. But booking shows isn't enough to run a successful promotion, because you'll also have to manage the contracts, morale, and expectations of your wrestlers while making sure the company earns enough revenue to continue operating. Book shows Each month you'll book four episodes of TV and one pay-per-view with a wide variety of match types and promos. Every segment is simulated based on the statistics and unique traits of the wrestlers involved, and your goal is to book segments that get the crowd as excited as possible so that you can win the TV ratings war against your rivals. Roster management Every wrestler wants to be on TV, but there's only a limited amount of screen time available. You'll have to balance keeping all your wrestlers happy by giving them screen time while trying to get your TV ratings as high as possible. Negotiate contracts, keep your wrestlers happy, and make sure you've got some young talent ready to take over when the veterans start to decline. Financial management The owner of the company you work for will set financial goals for you each year. Sign wrestlers within your budget, earn a big new TV contract, and boost your revenue with well-timed investments in marketing. Highly customizable Change the appearance of any wrestler on your roster in the simple but flexible character editor, design championship belts, and make the ring look just the way you want. Easy to modify All of the save files for Championship Wrestling Promoter are stored as editable JSON files which can be modified in any text editor. Want to play with the same roster as your friends? Importing the roster from one game to another is as simple as pointing the game to the right JSON file. A randomly generated world Every game of Championship Wrestling Promoter is unique, with randomly generated wrestlers, random events, and a simulation engine that will keep you on your toes.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1918440/header.jpg?t=1668011783",
    "Price": 17.99,
    "Developers": "Pykrete Games",
    "Publishers": "Pykrete Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1918440/ss_5591ac702171148dd9a9e01916ec28008cd8522c.1920x1080.jpg?t=1668011783,https://cdn.akamai.steamstatic.com/steam/apps/1918440/ss_f7fc5b6a5603f6b11c140128b0d3f08eaaad9edc.1920x1080.jpg?t=1668011783,https://cdn.akamai.steamstatic.com/steam/apps/1918440/ss_ff95150cb178db118a295fe0fa1af33b053680f3.1920x1080.jpg?t=1668011783,https://cdn.akamai.steamstatic.com/steam/apps/1918440/ss_d41fdab73018ec1bb5da1c2bf2b2c9b386ab4579.1920x1080.jpg?t=1668011783,https://cdn.akamai.steamstatic.com/steam/apps/1918440/ss_34f51e23ac0f1c49ac6efc1a9a58723ff61c030a.1920x1080.jpg?t=1668011783,https://cdn.akamai.steamstatic.com/steam/apps/1918440/ss_1cc2bd17153a779d2ee6021defcda56351752a36.1920x1080.jpg?t=1668011783,https://cdn.akamai.steamstatic.com/steam/apps/1918440/ss_ea0ebd10ee7035134abde033cffed8bf1fdb5fca.1920x1080.jpg?t=1668011783,https://cdn.akamai.steamstatic.com/steam/apps/1918440/ss_6aeab8687654d601a9f5023c5ff897b338823f72.1920x1080.jpg?t=1668011783",
    "Slug": "championship-wrestling-promoter",
    "Meta Title": "Championship Wrestling Promoter: Nov 9, 2022, Pykrete Gam...",
    "Meta Description": "Looking for information on Championship Wrestling Promoter? Check out the release date (Nov 9, 2022), developer insights from Pykrete Games, and a compl...",
    "Alt Text Image": "Official header image for Championship Wrestling Promoter game - Steam 1918440",
    "Canonical URL": "https://gusku.site/game/championship-wrestling-promoter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Championship Wrestling Promoter\", \"description\": \"Looking for information on Championship Wrestling Promoter? Check out the release date (Nov 9, 2022), developer insights from Pykrete Games, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pykrete Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pykrete Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1918440/header.jpg?t=1668011783\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}