{
    "AppID": 2183200,
    "Name": "CHAQS",
    "Release date": "Nov 1, 2022",
    "About the game": "CHAQS is an instructive CTF (Capture The Flag) game that performs the basic functions of an operating system. While it meets your expectations from an operating system to a certain extent with the applications it contains, CHAQS progresses in the direction of more challenges in terms of gameplay. Therefore, it meets the visual needs of the user with its graphical interface, but the terminal creates the entire game aspect of CHAQS. Although all of the terminal commands are written to meet gaming needs, some of them can operate outside of these needs. The prepared challenges do not fully reflect real-world ethical hacking, they are similar. Terminal Terminal is a command-line interpreter that provides a command line user interface for CHAQS. The terminal, which was developed inspired by the Unix shell, is the most important part of the game with dozens of commands and command line utilities. Terminal commands and utilities : amorse, ascii, audiodecoder, base32, base58, base64, binary, brainfuck, calculate, cal, cat, cd, challenges, charon, clone, count, cp, cpdir, curl, df, diff, dig, dirbuster, disconnect, dtmf, du, echo, enum4chaqs, execute, exifsm, extract, file, find, free, grep, hash-identifier, head, hostname, imap, import, ip, logname, ls, mkdir, morse, mv, mvdir, nc, nevr, permutation, ping, pwd, pwsh+, qrsm, rename, renamedir, rm, rmdir, rot, service, sort, ssh, steg, stegoimage, strings, submit, sysinfo, tail, touch, traceroute, trash, tree, uname, unzip, upload, uptime, vigenere, wc, wget, whatis, whitespace, whoami, whois Challenges Challenges are missions tailored for the game. In order to move on to the next challenge, the answers to the current challenge must be provided. Beginner challenges offer insights that are designed to provide you with the necessary guidance, gracefully and intelligibly. Challenges allow you to interact with all terminal command and command line utilities. Runtime Compiler CHAQS has a runtime compiler that executes a code file of the C# programming language with the execute command. Embedded Browser The Browser+ application offers you a CEF-based in-game browser. Weather and Map Services If they are activated in the game settings, the exact location is determined with your IP address, and the weather information in your location is provided and your exact location is displayed on a map. This feature may or may not work dependent on the API provider. Functional Programs CHAQS has been prepared by deducting your expectations from an operating system. It has programs and widgets such as video player, music player, notepad, photo gallery. Bliss Speech Recognizer Bliss transforms the voice command into action according to predefined methods. Steganography CHAQS has a comprehensive set of steganography tools with the stegoimage program, which shows the different channel results of images with a graphical interface, and command-line programs such as amorse, audiodecoder, dtmf, steg, strings.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2183200/header.jpg?t=1667342700",
    "Price": 8.99,
    "Developers": "nomorevalid",
    "Publishers": "nomorevalid",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2183200/ss_e27a75aa682f46c526d2942bed3868822f42007b.1920x1080.jpg?t=1667342700,https://cdn.akamai.steamstatic.com/steam/apps/2183200/ss_531449336d7f0a2fe4cca8a2a64cfda2105a8346.1920x1080.jpg?t=1667342700,https://cdn.akamai.steamstatic.com/steam/apps/2183200/ss_6724e3c6c70df1d60657280876ccfc8d572db104.1920x1080.jpg?t=1667342700,https://cdn.akamai.steamstatic.com/steam/apps/2183200/ss_1366e82e301dc131cc4098101406f0332b351769.1920x1080.jpg?t=1667342700,https://cdn.akamai.steamstatic.com/steam/apps/2183200/ss_6f7bcbee17520c948532656bd97059c5c9d6c7ce.1920x1080.jpg?t=1667342700,https://cdn.akamai.steamstatic.com/steam/apps/2183200/ss_7517eff49520a34eb41181976063c79d517b6761.1920x1080.jpg?t=1667342700,https://cdn.akamai.steamstatic.com/steam/apps/2183200/ss_6eda0e6b29763a647e76fde9c9ccc16c8ef2b9ca.1920x1080.jpg?t=1667342700",
    "Slug": "chaqs",
    "Meta Title": "CHAQS: Nov 1, 2022, nomorevalid and Full Overview",
    "Meta Description": "Looking for information on CHAQS? Check out the release date (Nov 1, 2022), developer insights from nomorevalid, and a complete game summary.",
    "Alt Text Image": "Official header image for CHAQS game - Steam 2183200",
    "Canonical URL": "https://gusku.site/game/chaqs",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CHAQS\", \"description\": \"Looking for information on CHAQS? Check out the release date (Nov 1, 2022), developer insights from nomorevalid, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"nomorevalid\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"nomorevalid\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2183200/header.jpg?t=1667342700\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}