{
    "AppID": 2172920,
    "Name": "Christmas Wonderland 4",
    "Release date": "Nov 3, 2022",
    "About the game": "A Fab, Fun Christmas game for ALL the Family to Enjoy! Bill and Mary can’t wait to head down to Main Street to watch the Grand Christmas Parade and they are just in time to see the Switching on of the Christmas lights. Next, they go shopping for presents for Mom and Dad, Grandpa and Grandma at the town’s Christmas and General stores. This year’s Christmas Charity is Help the Homeless so the kids put a little change into the donation box. The kids head off home and wrap the presents with Mom before putting them under their beautiful Christmas tree. They couldn’t get everything they wanted in town, so they go on the computer and buy the rest online. Will the things arrive the next day? Mary isn’t sure but Bill sees their packages on a Webcam of the Courier’s warehouse ... it’s looking good! Next day, the 24/7 Courier’s truck pulls up and the kids run outside to see what has come. Meanwhile, at the North Pole, Santa is reading all the letters sent to him from children across the World and he gives his Elves a list of toys that need to be made in their exciting and busy workshops. The Elves have to work night and day to get the toys made in time. One of the Elves is sick in bed so Mrs Claus goes to look after him and then makes a magnificent Christmas Eve lunch to be sure everyone will have plenty of food for the long afternoon and night ahead. The elves load all the toys on to the sleigh while Santa checks out the Reindeer in the stables and then hitches them up. He takes off and visits everywhere in the World, form Australia to Africa, Asia to Europe and the USA. When he gets to the United States the first stop is New York where he remembers all the homeless kids and drops toy and food packages off for them in Central Park. Next stop it‘s the White House, then every State before landing at the West Coast. Back at home, Bill and Mary are now mega excited, as Christmas Day is only a few hours away. Next morning they throw on their clothes and clamber into the Living Room to see if Santa has brought them the toys that they had asked for.... and of course, as always ... they aren’t disappointed. Christmas Wonderland 4 is a great holiday fun game for players of all ages. It‘s crammed full of gorgeous graphics and HOG scenes, lots of hidden surprises, fun puzzles and engrossing mini games for ALL the family to enjoy. The mini games are easy, medium or hard to suit all players - and of course if a puzzle is too hard it can be skipped. The scoring system gives you points for all the things you collect and do throughout the game. Your best scores are kept on a high score table so you can show your family and friends. Whether you are a Kid or Adult, a Mom or Dad, Uncle or Aunt, Grandpa or Grandma ... Christmas Wonderland will be great fun to play, time and time ... and time again. Enjoy! Find objects in beautiful Hidden Object Scenes along with a wide range of puzzle games.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2172920/header.jpg?t=1667467850",
    "Price": 6.99,
    "Developers": "Casual Arts",
    "Publishers": "Casual Arts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2172920/ss_0cb7483e88fdf4e2072627bd101e29e1d64cb620.1920x1080.jpg?t=1667467850,https://cdn.akamai.steamstatic.com/steam/apps/2172920/ss_a532811343cbd6cb92c4f7bc06af9246e21442e4.1920x1080.jpg?t=1667467850,https://cdn.akamai.steamstatic.com/steam/apps/2172920/ss_89deadb53bb46374d32ca934c3dbfe9bff77d4be.1920x1080.jpg?t=1667467850,https://cdn.akamai.steamstatic.com/steam/apps/2172920/ss_b1af7ee4c62ca17458edd36c8221ae2a85fc4d14.1920x1080.jpg?t=1667467850,https://cdn.akamai.steamstatic.com/steam/apps/2172920/ss_277187a7adce2dd903990763e87cb0ee50a0a2a4.1920x1080.jpg?t=1667467850",
    "Slug": "christmas-wonderland-4",
    "Meta Title": "Christmas Wonderland 4: Nov 3, 2022, Casual Arts and Full...",
    "Meta Description": "Looking for information on Christmas Wonderland 4? Check out the release date (Nov 3, 2022), developer insights from Casual Arts, and a complete game su...",
    "Alt Text Image": "Official header image for Christmas Wonderland 4 game - Steam 2172920",
    "Canonical URL": "https://gusku.site/game/christmas-wonderland-4",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Christmas Wonderland 4\", \"description\": \"Looking for information on Christmas Wonderland 4? Check out the release date (Nov 3, 2022), developer insights from Casual Arts, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Casual Arts\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Casual Arts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2172920/header.jpg?t=1667467850\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}