{
    "AppID": 2057490,
    "Name": "Dancing Hime: Rhythm Matching",
    "Release date": "Oct 25, 2022",
    "About the game": "In a parallel time, a world called SINGULARITY has fallen into a cycle of destruction when the [String of Time] was played incorrectly. To restore the world, the three original elven girls summoned you from the parallel world. As a “Tuner”, you can collect various inspirations and musical instruments by eliminating inspiration gems through matching three same gems, thus creating magical [Divine Tune]. You can even synthesize special items to enter the magical realm of Time Strings. The [Divine Tune] you create will be the key to restoring the [Chord of Time], and the girls will use the Rhythms as a medium to dance for you. You will be the only one to enjoy the delicate dance of the young girls on the stage. Will you answer the call of the girls? The game level is a classical match-3 gameplay set. The basic element is the inspiration gem, which can be eliminated by connecting three inspiration gems of the same color in a straight line. There are also a series of special effects elements with different elimination conditions. Players need to reach the specified goal within a certain number of steps to complete the game. When the bombs synthesized in the game are lit, they can produce a three-dimensional gorgeous visual impact effect. The scene of the game will change instantly when specific props are used, giving players a wonderful experience in the realm of fantasy. As you go further, you can unlock many girls with different characters and costumes. Relax and enjoy their hot dance in VR panorama. ● No gold fingers, back to the purest form of match-3 play. ■ Unlock a dance every five stages, enjoy wonderful dance after a period of working, getting a sense of achievement while relaxing. ▲ Hot dance of ACGN girls, graceful posture, magnificent and splendid. ◆ After the gallery is unlocked, you can play your favorite girl dances at any time. ★ You can re-challenge the levels you've already cleared and enjoy the plot We expect that the next version will be updated in 3 month. The main contents of the update include: ·Add more match-3 levels ·Add a new dance which the girls dance together ·Some visual optimizations ·Performance and details updated Appearing elf: Original name: anelle rosafroedna AnellerosaFloedna Nickname: Aisha Elf properties: Melody Spirit, the prototype of Melody Height: 163 cm Weight: unknown CUP: D Hair color: blonde Pupil: pink Bouquet: sweet and creamy Meng point: double ponytail, small rabbit Original name: hilfield Wendy elverness HilfieldWendyElvis Nickname: Wendy Sprite properties: Tempo Spirit, the prototype of rhythm Height: 165 cm Weight: unknown CUP: E Hair color: brown and black Pupil: brownish pink Bouquet: Peach blossom fragrance Meng point: single ponytail, peach blossom Original name: Himanisiarty Ilnayaro Nickname: Hemami Spirit Properties: Harmony Spirit, the original Spirit of Harmony Height: 170 cm Weight: unknown CUP: F Hair color: silver white Pupil: purple Smell: Dream daphne Cute point: white fur, cat",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2057490/header.jpg?t=1666748960",
    "Price": 6.99,
    "Developers": "Youai Xiongdi Information Technology",
    "Publishers": "Youai Xiongdi Information Technology",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2057490/ss_57358c8c28464874e46e31f947e3615b7d54640e.1920x1080.jpg?t=1666748960,https://cdn.akamai.steamstatic.com/steam/apps/2057490/ss_3c8e1b003dd1eb9482b917c09ca355b7de281759.1920x1080.jpg?t=1666748960,https://cdn.akamai.steamstatic.com/steam/apps/2057490/ss_ae1720ab13947af24c13cc22c6016fb77eb29f5f.1920x1080.jpg?t=1666748960,https://cdn.akamai.steamstatic.com/steam/apps/2057490/ss_19b2c960d5d4c2e56a604e0e31b29a6f7cfb061a.1920x1080.jpg?t=1666748960,https://cdn.akamai.steamstatic.com/steam/apps/2057490/ss_dc5b37261e8a7a2d5f72938bb25882448a70e9be.1920x1080.jpg?t=1666748960,https://cdn.akamai.steamstatic.com/steam/apps/2057490/ss_6fb8a0ba5ddb136477f346c2ef74c0006d596a2a.1920x1080.jpg?t=1666748960,https://cdn.akamai.steamstatic.com/steam/apps/2057490/ss_46f6baef0704966851c54e4f6533a3eef361f999.1920x1080.jpg?t=1666748960,https://cdn.akamai.steamstatic.com/steam/apps/2057490/ss_433142375bff8f886df32422a40f4d2d33bbd7b3.1920x1080.jpg?t=1666748960",
    "Slug": "dancing-hime-rhythm-matching",
    "Meta Title": "Dancing Hime: Rhythm Matching: Oct 25, 2022, Youai Xiongd...",
    "Meta Description": "Looking for information on Dancing Hime: Rhythm Matching? Check out the release date (Oct 25, 2022), developer insights from Youai Xiongdi Information T...",
    "Alt Text Image": "Official header image for Dancing Hime: Rhythm Matching game - Steam 2057490",
    "Canonical URL": "https://gusku.site/game/dancing-hime-rhythm-matching",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dancing Hime: Rhythm Matching\", \"description\": \"Looking for information on Dancing Hime: Rhythm Matching? Check out the release date (Oct 25, 2022), developer insights from Youai Xiongdi Information T...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Youai Xiongdi Information Technology\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Youai Xiongdi Information Technology\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2057490/header.jpg?t=1666748960\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}