{
    "AppID": 1976240,
    "Name": "Dreams of Pain",
    "Release date": "Nov 11, 2022",
    "About the game": "WHAT IS DREAMS OF PAIN? Dreams of Pain is a highly experimental first-person mystery horror game with elements of horror in its atmosphere. The structure of the game is mostly linear. The game incorporates ARG-like elements into its storytelling. The game's art style was inspired by retro games from the late '90s. It doesn't hold your hand and there are no traditional tutorials for the player. Some of the puzzles in the game are types of puzzles not seen in any game before. INTERACTION &amp; PUZZLES Interacting with characters and objects in Dreams of Pain is vital to solving the puzzles. Though there may not be many things to interact with, make sure you treat the ones that do with curiosity. The people in Pain may not always tell you exactly what you need to do but they are there to help you. EXPLORATION AND STORY Exploring the changing town of Pain is important for the player. Try to look for unnatural patterns and oddities in the world. The player should be extraordinarily perceptive. Listen carefully and inspect everything. The story of Dreams of Pain will be told in a very unconventional way. SOLO DEVELOPER DISCLAIMER! This disclaimer's purpose is to set the expectation of the player accordingly. The vast majority of the game has been developed by just one person. All of the game's core design, ARG elements, and nearly all of the game's 3D art assets, music, and sound effects have been made by one person. There won't be 20 hours of gameplay. If the player is really quick to solve all the puzzles, then finishing the core game will approximately take 3-5 hours to finish. With the lack of resources, there has been very limited testing in this regard. DIFFICULTY DISCLAIMER! Dreams of Pain contains very odd puzzles that have not been tried in games before. The puzzles are difficult and might require extreme patience. It is recommended to play Dreams of Pain in short bursts as it might become increasingly frustrating due to the difficulty. There are no difficulty options! There is a core gameplay loop in Dreams of Pain but it might be hard to figure out at first. It is the player's job to figure out what to do in the game. ACCESSIBILITY DISCLAIMER! Due to the experimental puzzles Dreams of Pain may be impossible to playthrough if the player is relatively insensitive to differences in musical pitch or has hearing loss or is deaf.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1976240/header.jpg?t=1668187197",
    "Price": 12.66,
    "Developers": "SuloSounds",
    "Publishers": "SuloSounds",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1976240/ss_a14a3b9841eda5cd7a5fa3ad02c58f522b7cae41.1920x1080.jpg?t=1668187197,https://cdn.akamai.steamstatic.com/steam/apps/1976240/ss_fff48dd7236fad161f103809b5ff0aa0a33f28d4.1920x1080.jpg?t=1668187197,https://cdn.akamai.steamstatic.com/steam/apps/1976240/ss_b7f464bf470197b8ce8ebebece799e6138e3dbd1.1920x1080.jpg?t=1668187197,https://cdn.akamai.steamstatic.com/steam/apps/1976240/ss_8bdf4177c37d106ecd0f9e40a2d7929172290e45.1920x1080.jpg?t=1668187197,https://cdn.akamai.steamstatic.com/steam/apps/1976240/ss_116e711fada6f61ebc4af1bd619f1b00d84ece2b.1920x1080.jpg?t=1668187197,https://cdn.akamai.steamstatic.com/steam/apps/1976240/ss_5343ab1522812e7acd79f54973f4ba9bed08e3ad.1920x1080.jpg?t=1668187197",
    "Slug": "dreams-of-pain",
    "Meta Title": "Dreams of Pain: Nov 11, 2022, SuloSounds and Full Overview",
    "Meta Description": "Looking for information on Dreams of Pain? Check out the release date (Nov 11, 2022), developer insights from SuloSounds, and a complete game summary.",
    "Alt Text Image": "Official header image for Dreams of Pain game - Steam 1976240",
    "Canonical URL": "https://gusku.site/game/dreams-of-pain",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dreams of Pain\", \"description\": \"Looking for information on Dreams of Pain? Check out the release date (Nov 11, 2022), developer insights from SuloSounds, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"SuloSounds\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SuloSounds\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1976240/header.jpg?t=1668187197\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.66, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}