{
    "AppID": 677770,
    "Name": "Easy Game Creator",
    "Release date": "Nov 8, 2022",
    "About the game": "Follow these simple steps to make your game in minutes: Please keep in mind that the purchase of Easy Game Creator comes with 2 export licenses and that further in-store purchases are required for more game exports (you will still be able to create and test as many of your creations as you want) Pick your theme This determines the overall setting for your game, changing the visual to available cut-scenes. Each theme comes with a convenient story and order events that you can use as a base. You can completely change every aspect of this story or order events so you can be as creative as you want! Add your family and friends Include as many of your friends and family as characters in your game. Make them a hero, villain, magician, comical bad guy, or one of many other options. Choose from multiple scenarios, backdrops and gameplay Pick from multiple game elements to truly customize the experience. Have your characters go on a walk, share some friendly banter, defend themselves from hordes of enemies, and use relatable images to tell your unique story! Add custom dialog with sounds and emotes Completely customize the story with extra flare! Add as many lines of dialog to any cutscene you want, with character emotes and multiple sounds to choose from. Don't forget to add in multiple inside jokes to truly make this experience memorable! Share your unique experience instantly! In just a few clicks, share your game instantly to your friends and family so they can play it on any HTML5 compatible web browser. Shared games are hosted on a private URL that you can send digitally to anyone, anywhere! Frequently Asked Questions How can I download the game? There’s no need to! After building your game you will be given a link you can easily share. Your game will be played right inside the web browser on any computer or mobile device. How many games do I get? Each purchase lets you create 2 built games to send to loved ones. Additional built games can be purchased. Where and how can the game be played? The game you create will be playable on any smartphone, computer, or tablet. Will the game be delivered immediately, or can I have it delivered on a specific day? We create a shareable link that you can send to them through email at any time you want. Do I need any programming skills to build this game? Absolutely not! Just fill out a short questionnaire, and the game will be created for you. How long will it take from start to finish? Most people can create their gift in less than fifteen minutes. How will they receive my gift? You will receive a link you can share with them through email, or online chat. Where and how can the game be created? After purchase, install Easy Game Creator, fill out the questionnaire, and the program does all of the heavy lifting.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/677770/header.jpg?t=1667945128",
    "Price": 24.99,
    "Developers": "SoftWeir Inc.",
    "Publishers": "SoftWeir Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/677770/ss_e7147d6a5d928d4c8206962b525b83ccbd8d844f.1920x1080.jpg?t=1667945128,https://cdn.akamai.steamstatic.com/steam/apps/677770/ss_58fce12a472a58feaf61889d8ef392544e12c67b.1920x1080.jpg?t=1667945128,https://cdn.akamai.steamstatic.com/steam/apps/677770/ss_760b561d3a6ba60689bf5ca0736f2d6772649e3d.1920x1080.jpg?t=1667945128,https://cdn.akamai.steamstatic.com/steam/apps/677770/ss_3ab917d7d6861391673866c3d4a8df6a8d0aa607.1920x1080.jpg?t=1667945128,https://cdn.akamai.steamstatic.com/steam/apps/677770/ss_628adbc30fc45782f1d3f30dc0edcba1e9849159.1920x1080.jpg?t=1667945128,https://cdn.akamai.steamstatic.com/steam/apps/677770/ss_a39a9556cbe3eff363ea4a47a42f318e60ee1f01.1920x1080.jpg?t=1667945128",
    "Slug": "easy-game-creator",
    "Meta Title": "Easy Game Creator: Nov 8, 2022, SoftWeir Inc. and Full Ov...",
    "Meta Description": "Looking for information on Easy Game Creator? Check out the release date (Nov 8, 2022), developer insights from SoftWeir Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for Easy Game Creator game - Steam 677770",
    "Canonical URL": "https://gusku.site/game/easy-game-creator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Easy Game Creator\", \"description\": \"Looking for information on Easy Game Creator? Check out the release date (Nov 8, 2022), developer insights from SoftWeir Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"SoftWeir Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SoftWeir Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/677770/header.jpg?t=1667945128\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}