{
    "AppID": 2182770,
    "Name": "Escape From Zombies",
    "Release date": "Nov 8, 2022",
    "About the game": "Escape From Zombies is played alone or cooperatively, on a map where the player(s) must repel waves of zombies through each level. It should be noted that the game does not end until all players are dead, the main goal is to beat the record of survived round. The game is currently in Pre Alpha, and still in development The player earns points by inflicting damage on zombies, killing them or reanimating a fallen teammate. It is also possible to lose points by falling to the ground. With the points, it is possible to make various purchases (weapons, equipment...), to clear certain obstacles preventing free movement inside the map, or to perform certain actions (activate traps, teleporters...), and even to acquire new weapons. ), and even acquire 'Assets', materialized by drink dispensers of different colors, such as the Mastodon which allows you to receive 5 shots instead of 2 before falling to the ground, Double-Shot which increases the rate of fire of automatic weapons by 25%, Pass-Pass which halves the reloading time as well as Rapid Reanimation which halves the time needed to heal a player who has been eliminated by zombies. In addition, some zombies drop bonuses in the form of a golden object surrounded by a green halo. The bonuses are as follows: Instant death (Insta-kill), it comes in the form of a skull and lasts 30 seconds. It allows you to kill your opponents with a single blow from any weapon. Nuke kills all zombies on the map Max ammo instantly fills the ammo and grenade supply of living players Double points lasts 30 seconds and doubles the points received by wounding or killing zombies and rebuilding barricades. It is possible to have more than four assets at the same time, and the player will lose them if he falls down. Once reanimated, he will keep his weapons. If unfortunately no one comes to revive him before a given time, he will disappear from the map and will only reappear in the next round (provided that the other players survive the current one...), without trumps or weapons. The game ends when all players are down.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2182770/header.jpg?t=1667934934",
    "Price": 5.39,
    "Developers": "BiKouZ",
    "Publishers": "PINAL AGENCY",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2182770/ss_e8b90a13c31ec9ddba8b61cb99d49a8ce4b8569e.1920x1080.jpg?t=1667934934,https://cdn.akamai.steamstatic.com/steam/apps/2182770/ss_45bb163481e93c8fca5525f0616252e4275d3c1b.1920x1080.jpg?t=1667934934,https://cdn.akamai.steamstatic.com/steam/apps/2182770/ss_700053eb6c249668008fc51358cb21383823951a.1920x1080.jpg?t=1667934934,https://cdn.akamai.steamstatic.com/steam/apps/2182770/ss_3cfa24a4d259a36621c89039476219fd2402af64.1920x1080.jpg?t=1667934934,https://cdn.akamai.steamstatic.com/steam/apps/2182770/ss_470e4ecdca0825cd4b4c9d8c86f5083e4eea83fc.1920x1080.jpg?t=1667934934",
    "Slug": "escape-from-zombies",
    "Meta Title": "Escape From Zombies: Nov 8, 2022, BiKouZ and Full Overview",
    "Meta Description": "Looking for information on Escape From Zombies? Check out the release date (Nov 8, 2022), developer insights from BiKouZ, and a complete game summary.",
    "Alt Text Image": "Official header image for Escape From Zombies game - Steam 2182770",
    "Canonical URL": "https://gusku.site/game/escape-from-zombies",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Escape From Zombies\", \"description\": \"Looking for information on Escape From Zombies? Check out the release date (Nov 8, 2022), developer insights from BiKouZ, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"BiKouZ\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PINAL AGENCY\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2182770/header.jpg?t=1667934934\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}