{
    "AppID": 1721150,
    "Name": "ET Superman : Wrath of Tyrannosaurus Rex",
    "Release date": "Nov 6, 2022",
    "About the game": "A genetically modified warrior with superpowers, a long-abandoned dinosaur park, a group of The ferocious and brutal mutant Tyrannosaurus rex, the super soldier Ethan Pete arrived by various coincidences Dinosaur Park collects embryos of mutant Tyrannosaurus rex. He knew it was a near-death adventure, but He has no choice, as his super powers make him terminally ill, he has to deal with Rhodes Dinosaurs Cooperation (maker of mutant tyrannosaurus rex) to obtain dinosaur embryos, genes from these embryos Extracted gene fragments from Ethan Pitt's terminal illness. In the game you will play super soldier Ethan Pete, after you collect Tyrannosaurus embryos, The ambush of the Tyrannosaurus, the Tyrannosaurus is frantically searching for your whereabouts in the abandoned city, your only hope It is to find the aircraft backpack that the rescuers dropped in the city. But the aircraft backpack is falling During the process, it was accidentally destroyed by a pterosaur, and the aircraft and batteries were scattered all over the city. These batteries are collected one by one and put back into the aircraft in order to start the aircraft and escape there. The game provides PC gamers with extensive customization options that you can set for each Tyrannosaurus Attributes, including its strength, speed, hunting methods, damage level, size, skin, and more. You can also set different weather for the scene, including sunny, rainy, rainy. through 22 Customization options You can set a different level of thrill and style for each game you will experience Incredibly thrilling adventure. In the 'Jurassic Park' and 'Jurassic World' films, the survivors were hunted by the Tyrannosaurus rex The shocking, tense, thrilling and exciting scenes are impressive. This game attempts to You recreate the shock, tension, thrill, thrill, experience of being hunted by a Tyrannosaurus, but now You're not watching a movie, you're immersing yourself in control of your character in the wild hunt for Tyrannosaurus escape. All objects in a city, including buildings, have their own mass that can be Push down and move with force to show the powerful destructive power of Tyrannosaurus, and shocking disaster special effects. You have a lot of freedom and can go anywhere you want, but the tyrannosaurus also It will follow, bringing you unprecedented pressure. All large objects in the city are Cover your props. Use your wisdom and courage to avoid the pursuit of Tyrannosaurus The aircraft battery, and finally got on the aircraft and escaped successfully. Features and content: ■ Challenge ABCDE 12345 The 10 challenges are from easy to difficult. In the challenge to ABCDE, the protagonist has no super ability. He can only use large objects in the city to escape the killing of tyrannosaurs, just like ordinary people. In the 12345 challenge, the protagonist has the super ability to throw objects, but he is not enough to kill the Tyrannosaurus rex, so he can only beat it back for a period of time, up to 3 seconds. ■ large city In the plot, these buildings are models that the park presents to visitors, built with lightweight materials, The interior is hollow. In the game, Tyrannosaurus can easily tear down these buildings, but the main Angular can't do it. Large urban terrain 1000*1000 meters, construction area 800*800 meters, model Quantity 14000. All objects have their own mass, and mass is proportional to volume. adult Powerful Tyrannosaurus that can shake most large buildings. Due to the huge size of the Tyrannosaurus, the protagonist Walking in the cracks of the building can block the Tyrannosaurus more safely and temporarily trap it. ■ Ethan Pitt His speed, skills, clothing can be configured. Skills include object throwing, bomb throwing, and javelin throwing. object throwing After opening, the protagonist will have the ability to throw objects. After an object hits the tyrannosaurus, the tyrannosaurus retreats for a period of time. the mass of the object The larger it is, the longer the tyrannosaurus retreats, with a maximum time of no more than 3 seconds. bomb dropping Bombs can be thrown forward, or they can be dropped backwards, and the explosion produced by the bomb Not only can it blow up surrounding objects, it can also make the Tyrannosaurus retreat for 1 second. There are up to 12 types of explosion effects for you to choose from. javelin throw When the javelin hits the tyrannosaurus body, it will make the tyrannosaurus retreat for 1 second. Hitting the Tyrannosaurus head will cause the Tyrannosaurus to retreat for 3 seconds. ■ Tyrannosaurus Rex Configurable its, speed, strength, size, skin, hunt style, quantity, etc. Up to 20 configurable properties. How tyrannosaurs hunted their prey Contains, fixed target pursuit, visual search, olfactory search. Three selectable modes fixed target pursuit The Tyrannosaurus will ignore any object's obstruction, and will always pursue the protagonist as the target. visual manhunt In this mode, the tyrannosaurus hunts for its prey visually, and when the tyrannosaurus sees the prey, it will hunt it down. If the prey suddenly disappeared from its sight, the tyrannosaurus recorded where the prey disappeared and where it went. Manhunt for a period of time, and if not found will be manhunted throughout the scene. Tyrannosaurus has a viewing angle of 200 degrees and a field of view radius of 2 kilometers. The protagonist hides from rocks, vehicles, etc. Behind large objects, it can effectively avoid the hunting of Tyrannosaurus. olfactory hunt In this mode, Tyrannosaurus hunts for prey with the cooperation of smell and vision. When a tyrannosaurus is more than 200 meters away from its prey, it uses its sense of smell to detect its prey The approximate position of the tyrannosaurus and gradually approach the prey, when the tyrannosaurus is within 200 meters of the prey , use the camera to hunt for prey. ■ head tracking To make the T-Rex's movements more realistic when chasing prey, we've added head tracking. After it is turned on, Tyrannosaurus will always keep its eyes on the direction of the target. When the target becomes the protagonist and approachesWhen the protagonist is the protagonist, the Tyrannosaurus rex's mouth is more likely to touch and bite the protagonist, so the danger level will be higher when head tracking is turned on. When it is turned off, the Tyrannosaurus Rex will trigger the bite action only when it is ithin 20 meters of the protagonist, and the bite action will be activated. It can be avoided, and the degree of danger is relatively low. ■ weather system You can customize the weather for each game. Including, sunny, rainy, rainy days. Typhoon sound effects can also be added to enhance the atmosphere. Rain is always accompanied by thunder, it can make The game atmosphere is more tense and exciting. Player custom content: We have brought a wealth of customized content for players, and you can play your imagination to your heart's content, Create your own content. Let your friends join in and share your creations. ■ custom mask You can customize your favorite avatar and add it to the game. It is a PNG image and can have many layers. is attached to the protagonist's head. Will it be very interesting to replace the avatar with your favorite cartoon character and let your favorite character participate in the game? You can do it now! You only need one positive png image and one negative png image to compose a three-dimensional mask. ■ custom character dialogue You can design your own character dialogue, and he will be dynamically displayed in the game in the form of subtitles. You can also set the display time for each line of dialogue, as well as the time interval between dialogues. ■ random scene The random map generated by the program takes about 1 minute to complete. The infinite arrangement and combination of objects will bring you a lot of surprises. You can save these scenes. You can also edit all objects in the scene arbitrarily. ■ custom scene Here you can edit any object you want. You can move any object anywhere, move it, move it, copy it, rotate it, scale it, change its quality. Any number of objects can be copied. You can set properties of objects. Including, physics objects affected by forces, meshes that do not contain colliders, A static object that contains only colliders. There are as many as 150 types of models in the scene, and you can use them to create the fantasy city in your heart. Then, load the self-built scene and start a life-and-death escape adventure with the Tyrannosaurus Rex in the self-built world. If you have any suggestions or questions, please contact us! Customer service e-mail: FreeCubeStudio@outlook.com Story: Rhodes Dino Park was a highly successful and flourishing dinosaur park which operated for more than 20 years. In order to create more powerful and attractive dinosaurs, their scientists have set up many different testing laboratories Ongoing experiments One of these experiments went awry and caused a disastrous event. A Tyrannosaurus Rex test subject was being given experimental treatment with a prototype injection serum called RX-47. The side-effects of the serum were predicted to be mild but the scientists miscalculated. The T-Rex experienced heavy genetic mutations, causing him to be extremely aggressive. This aggression led to an all out containment breach, where the T-Rex slaughtered and destroyed most of the park and its labs. Initially, the incident was believed to be self-contained. As the T-Rex was locked down inside of the park due to emergency containment procedures kicking in. However, as an expedition being sent inside to eliminate the T-Rex found out. The mutations for the creature are rapidly progressing, and it began to lay eggs at a staggering rate. Causing possible mass reproduction. The exponentially increasing mutations lead it to develop a high level of strength and resistance, merely shrugging off gunfire from the expedition team and leaving them cleaved to pieces. The park, being overseen by R.O.D. Company, had to declare an emergency and request all resources to be directed toward eliminating the creature before it reaches a stage of mutation where it would be impervious to damage. R.O.D. decided to take the situation seriously and hire a super-soldier turned merc named Ethan Pitt. Ethan hosts a powerful telekinetic ability, alongside strength, speed and intelligence far surpassing those of a normal human. The deal was not struck on equal terms, though. Pitt was diagnosed with a terminal disease, caused by his abilities. During his training, he was pumped full of experimental performance enhancing drugs. The side-effects of which haven’t begun to show themselves until recently. R.O.D. offered Pitt to allocate resources into finding a cure for his disease, if he could eliminate the creature. Pitt, having no other option, agreed to the terms of the deal. Following this, Ethan was given two simple tasks. Recover the eggs of the T-Rex and eliminate it if possible. He would either return victorious, or would not return at all. T-Rex Rhodes and R.O.D. worked in tandem to form the Dino park. Rhodes would gain profits from the tourists, which would fund R.O.D. experimentation and research beneath the surface. Shared profits from sales of research, as well as treatments to improve the captive dinosaurs would be given to Rhodes, to further increase tourist attraction. Rhodes desired a way to make the dinosaurs more resilient, so they did not need to spend money on things such as medical treatment, food or water for them. Minimizing expenditures for these so they may focus on pumping into advertising and new enclosures. However, during one of these experiments. R.O.D. made a fatal error. They miscalculated the necessary dosage or the effect on the genes of the dinosaurs when undergoing such drastic physical change induced by the serum. Due to this, the T-Rex, being their most popular enclosure and their desired test subject, was turned into a hideous monstrosity which ripped through the park and labs without remorse. The 'T-Rex out of control' Incident The escape and subsequent destruction of the park was dubbed the 'T-Rex out of control' Incident. Owing to the fact that the T-Rex was their first dinosaur test subject for the serum. The experiment was supposed to be conducted in a standard 30x20x20 meter steel lined testing room. The enclosure had meter thick steel walls, which were strong enough to withstand any sort of impact a dinosaur would be able to dish out, should they end up being rowdy. During stage one, the dinosaur would be sedated with a gas being pumped in through a set of small vents at the top of the room. This would give the researchers enough time to enter the testing chamber and attach the injector onto the T-Rex arteries. After the gas was pumped, the T-Rex fell to the ground sedated, as was expected. The researchers promptly entered its chambers and firmly attached an injector harness onto the T-Rex. This harness was a sort of suit, designed to simultaneously inject the serum into several arteries on the subjects body. It was also remotely controlled, so when the researchers finished attaching it, they left the chamber and sealed it back up. Stage two involved activating the injection harness and observing the changes. Upon the serum being injected, for a few moments, no changes were apparent. However, it quickly started to morph and change the subject. The serum made it grow in size, increased its muscle mass and solidified its leather-like skin into something more akin to kevlar. It also produced profound psychological changes, causing the T-Rex to become immensely aggressive. The situation quickly got out of hand, as the steel walls could not withstand the immense force of the T-Rex as it relentlessly bashed against them. After it broke out, it went on a rampage, destroying and killing everything in sight. The initial breach was contained by the parks emergency lockdown, which surrounded the whole complex with a massive set of walls and electrical fields. Obstacles which the mutant was still unable to breach. It made its way deeper into the park and set up a nest in one of the enclosures. There it layed eggs and sat, waiting for them to hatch. The Expedition Upon the initial breach calming down, Rhodes attempted to send in an expedition of 15 men, of which 5 were scientists and 10 were guards, to quickly assess the situation and perhaps even eliminate the mutant. It ended up being a complete failure, as the mutant was stronger than anticipated. As they tracked the beast to one of the enclosures, they entered with care and slowly made their way deeper. The walls were lined with a sort of gooey substance, that was extremely corrosive to the touch. The more they went in, the stronger the smell became. A smell that reminded them of rotting meat mixed with sulphur. Eventually, they reached a nest, where they found one of the many eggs the creature layed. They attempted to secure some traces for testing but were instead met with the T-Rex appearing behind them, almost as if it let them approach the eggs so it may trap them. The expedition stood no chance as the mutant shrugged off bullet after bullet and tore them apart. Their remains were never recovered. Ethan Pitt Ethan was born in a lab, as a result of a secret project to cultivate a set of super-soldiers for private use by a joint operation headed by several worldwide intelligence agencies. He was synthesised in a vat from an artificial zygote. From his birth, he was subject to tests and experiments. For years, he was injected with various concoctions, which eventually culminated in him developing telekinetic powers. Early on in his childhood, he was able to move small objects at an incredible speed, once being able to break one of the windows on his chambers. He was treated rather well by the scientists and willingly participated in many of the experiments. As he aged, he was trained in all types of combat and eventually grew into a deadly asset. He could utilise both his mind and body as weapons, all with great efficacy. He was eventually let loose into the world as an agent for hire by many private organisations. As he grew older, the side-effects of his treatments were beginning to show and he, faced with his mortality, wanted to get out of the business and try to live out his last few years as a normal human. However, when R.O.D. offered him a chance at a cure, he could not say no. In turn, for one final mission, he was offered a chance at a new life.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1721150/header.jpg?t=1667759115",
    "Price": 2.54,
    "Developers": "FreeCube Studio",
    "Publishers": "FreeCube Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_d8f1eb304833fc66711a42a7b5bdbd17578aef9d.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_8e43e0f882782cdceecf2db0cf1b951c3634f440.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_3dc41a360265a89e31a0b011bc4fb42ab2bcb92e.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_5b38db3e1d9b04e1ef9d9ea27804b2544b034394.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_509010c1500a8b5f4a6f27ddc5b5f220e230e67e.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_f0c557f59f987ff17feeaffa7df385e29859a745.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_c3231c0dc71b7326f3847669dfdbc392f249ce30.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_fd068740381a07ba5a6469a4714c0fc409ed097a.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_57990052821aed4e8e12b4f4fdd2ab4623e69a55.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_ede25d42876859fa0d3dd5de893e393da720e658.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_8e43e0f882782cdceecf2db0cf1b951c3634f440.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_68dc1ec51a6a30cb1af6c8dd144b4b77e22f727b.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_03e02aecdfd342c48545476fafe4110f2188025d.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_60facee5ed9ed33731acb0917ccef6b75616b0b3.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_e86b09cbc457ba435e5719e5a0dd40c36493ed2b.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_a2be948c840dd2f34bef57b994320f6c5b2e1896.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_5925bb477fb9b66dc4f104b554fa21e13c6caef6.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_1dce9c61c0ce3ab73b7ff24591abe444a358d875.1920x1080.jpg?t=1667759115,https://cdn.akamai.steamstatic.com/steam/apps/1721150/ss_d1e2e8326c40d352ce026b6f12b8615d29c7d317.1920x1080.jpg?t=1667759115",
    "Slug": "et-superman-wrath-of-tyrannosaurus-rex",
    "Meta Title": "ET Superman : Wrath of Tyrannosaurus Rex: Nov 6, 2022, Fr...",
    "Meta Description": "Looking for information on ET Superman : Wrath of Tyrannosaurus Rex? Check out the release date (Nov 6, 2022), developer insights from FreeCube Studio, ...",
    "Alt Text Image": "Official header image for ET Superman : Wrath of Tyrannosaurus Rex game - Steam 1721150",
    "Canonical URL": "https://gusku.site/game/et-superman-wrath-of-tyrannosaurus-rex",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ET Superman : Wrath of Tyrannosaurus Rex\", \"description\": \"Looking for information on ET Superman : Wrath of Tyrannosaurus Rex? Check out the release date (Nov 6, 2022), developer insights from FreeCube Studio, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"FreeCube Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FreeCube Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1721150/header.jpg?t=1667759115\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.54, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}