{
    "AppID": 2170320,
    "Name": "Final Beacon",
    "Release date": "Oct 26, 2022",
    "About the game": "I like the grand process of building wonders very much, and I also like the rich adventure events, so I designed this game, players can develop with peace of mind and choose their favorite strategic route; for the annoying AI, you can release the forbidden spell and take it away, just like that, no need to bother; a variety of races, plots, buildings, and plot combinations bring players a rich and colorful gaming experience. I hope players who love strategy games and fantasy-themed games will like it. Final Beacon，the last HOPE The Final Beacon is a wonder built on a demiplane, a piece of land called the Arcane Plain. This is the last Final Beacon, and it is also a signpost that guides the Abyss Expeditionary Force back to the human world. Your task is to collect mana across the demiplane, and finally build the Final Beacon to ensure that the expedition can go home safely! Collect various Terrains and expand your territory In the beginning, 'you' only had two territories. A variety of new Terrains will also be captured as the game progresses. There are ordinary Terrains such as Vast Grassland, Steep Fjord, and Wet Woodland, as well as rare Terrains such as Le Feu Fragment, Dead Cloud Valley, Metal Mountains, andWall of Illusions. There are 58 different Terrains to choose and combine to make the game process richful. Fantasy races, rich strategy There are currently 9 local races in the game. They are humans, elves, dwarves, gnomes, halflings, demons, devils, dragons, and Ophidians. Different races have different residency preferences. You will discover and interact with them by exploring: choose cooperation or war! Religious wars are imminent crisis In this material plane, there is a group of real 'gods' affecting the operation of the entire world. Choose a Faith, Meier, or Carmack? Bring the glory of 'God' to the whole plane! （Which is your faith?） Wonder Building is a Long Road There are no AIs that will compete with you for wonders building in the game. It can be said that because I hate AI competing wonders with me, I made this game. There are two kinds of wonders in the game. 1. Final Beacon. The foundation of the Final Beacon has been built on the Terrain. You need lots of mana to build her! 2. Cooperation wonders. Based on the combination of different local races, there will be a variety of wonders. You need the help of local races to build these wonders. Easy to get started, Play for Fun The game is easy to get started. There is no frightening learning curve, and there are no complicated calculations. I just hope that players can just get entertained!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2170320/header.jpg?t=1666846648",
    "Price": 10.99,
    "Developers": "迟到的南雨亭",
    "Publishers": "迟到的南雨亭",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2170320/ss_8d774e8b6e4e2e2d227a80f6375c8e862ed68566.1920x1080.jpg?t=1666846648,https://cdn.akamai.steamstatic.com/steam/apps/2170320/ss_96347a0fa627a55521bf85032889b96c58b3a000.1920x1080.jpg?t=1666846648,https://cdn.akamai.steamstatic.com/steam/apps/2170320/ss_fdbe5b5851595808106952e388a97662eeb9c554.1920x1080.jpg?t=1666846648,https://cdn.akamai.steamstatic.com/steam/apps/2170320/ss_3622887b6e6bed3aac3bf3f3b580202abb2a9826.1920x1080.jpg?t=1666846648,https://cdn.akamai.steamstatic.com/steam/apps/2170320/ss_3915d477ff735330f12e6e4e9c8d7a6cc69ab1c3.1920x1080.jpg?t=1666846648,https://cdn.akamai.steamstatic.com/steam/apps/2170320/ss_3a40a4f952f46c87310bca731471da2a82fbff6a.1920x1080.jpg?t=1666846648",
    "Slug": "final-beacon",
    "Meta Title": "Final Beacon: Oct 26, 2022, 迟到的南雨亭 and Full Overview",
    "Meta Description": "Looking for information on Final Beacon? Check out the release date (Oct 26, 2022), developer insights from 迟到的南雨亭, and a complete game summary.",
    "Alt Text Image": "Official header image for Final Beacon game - Steam 2170320",
    "Canonical URL": "https://gusku.site/game/final-beacon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Final Beacon\", \"description\": \"Looking for information on Final Beacon? Check out the release date (Oct 26, 2022), developer insights from \\u8fdf\\u5230\\u7684\\u5357\\u96e8\\u4ead, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u8fdf\\u5230\\u7684\\u5357\\u96e8\\u4ead\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u8fdf\\u5230\\u7684\\u5357\\u96e8\\u4ead\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2170320/header.jpg?t=1666846648\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}