{
    "AppID": 1904540,
    "Name": "Football Manager 2023",
    "Release date": "Nov 7, 2022",
    "About the game": "Delve into unrivalled depth and detail in Football Manager 2023 as you take charge at your club. Join the elite by writing your own headlines, earning the love of the fans and dominating the competition. It’s not just about picking tactics or crafting a team. It’s about taking on challenges and breaking new ground as you establish your own style. Game Description Find the club that’s right for you. Meet board and fan expectations before beating the best on your way to winning football’s top prizes. Don’t just sign superstars, create them. Level up your recruitment with the help of your backroom staff and provide pathways to the first team for your wonderkids to develop a world-class squad. Your team’s playing style is down to you. Create a unique strategy on the tactics board to deliver big wins and memorable matchday moments. New this season BUILD STRONGER SQUADS Power your transfer activity with revamped scouting and recruitment meetings, a closer relationship with agents and brand-new squad planning tools. With a better oversight of your prospects in the pipeline, it’s never been easier to meet long-term club ambitions. OUTSMART YOUR RIVALS Test your managerial skills against the most realistic AI managers in the history of the series. An overhaul of your opponents’ decision-making has made them smarter, while new out of possession tactical instructions make defensive and counter-attacking football more viable. As you’re pushed harder in every game, you’ll notice further match engine advancements, including changes to the way wing-backs and double pivots operate and a range of new animations. GET THE FANS ONSIDE Become closer to the fans than ever before with the new Supporter Confidence system. Get to grips with their expectations on and off the pitch to ensure a bright, long-term future in the dugout. BIG EUROPEAN NIGHTS Experience a greater sense of occasion with the UEFA Champions League, the UEFA Europa League and the UEFA Europa Conference League all fully licenced. Remodelled Cup Draws and officially branded team sheets, scoreboards and goal graphics vividly bring to life UEFA’s Club Competitions. SAVOUR YOUR SUCCESS Relive the milestones and achievements of every career with the brand-new Dynamic Manager Timeline. Whether you’ve given a youth player their first-team debut or won the UEFA Champions League, it’s never been easier to savour and share your Football Manager story. Countless more features, big and small, designed to improve your game experience are ready for you to discover in every career. *Early Access versions of the game may go live at different times on different platforms. '",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1904540/header.jpg?t=1666694694",
    "Price": 47.99,
    "Developers": "Sports Interactive",
    "Publishers": "SEGA Europe",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1904540/ss_cec40776d238a0ea712619122e41fd5ad3a2b607.1920x1080.jpg?t=1666694694,https://cdn.akamai.steamstatic.com/steam/apps/1904540/ss_2308f38343e41eeca632a884306f1072d9e91c22.1920x1080.jpg?t=1666694694,https://cdn.akamai.steamstatic.com/steam/apps/1904540/ss_f611ec133e13ad441986612047f92d9196e908f7.1920x1080.jpg?t=1666694694,https://cdn.akamai.steamstatic.com/steam/apps/1904540/ss_1e483bc1b5267b00053fbbfff8d0f04168a1ef47.1920x1080.jpg?t=1666694694,https://cdn.akamai.steamstatic.com/steam/apps/1904540/ss_e197328ee9a641c214fbaa0236d57d0c91b5758c.1920x1080.jpg?t=1666694694,https://cdn.akamai.steamstatic.com/steam/apps/1904540/ss_3be6041ecc5589f47c65ba8e53e9b7ce3b856f4e.1920x1080.jpg?t=1666694694",
    "Slug": "football-manager-2023",
    "Meta Title": "Football Manager 2023: Nov 7, 2022, Sports Interactive an...",
    "Meta Description": "Looking for information on Football Manager 2023? Check out the release date (Nov 7, 2022), developer insights from Sports Interactive, and a complete g...",
    "Alt Text Image": "Official header image for Football Manager 2023 game - Steam 1904540",
    "Canonical URL": "https://gusku.site/game/football-manager-2023",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Football Manager 2023\", \"description\": \"Looking for information on Football Manager 2023? Check out the release date (Nov 7, 2022), developer insights from Sports Interactive, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sports Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SEGA Europe\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1904540/header.jpg?t=1666694694\", \"offers\": {\"@type\": \"Offer\", \"price\": 47.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}