{
    "AppID": 2002200,
    "Name": "Future Mirror",
    "Release date": "Nov 1, 2022",
    "About the game": "STORY Itsuki and Akane, two high school sophomores pondering their future, decide to try performing a spell that is supposed to allow them to see their futures 10 years from now. Itsuki is skeptical and doesn't believe it's possible, but egged on by Akane, she performs the spell anyway. That night as Itsuki falls asleep, she suddenly finds herself in a world 10 years in the future, in an unfamiliar place, handcuffed to a stranger, and surrounded by flames. Itsuki wakes up from her dream and after meeting up at school the next day, is told a shocking truth by Akane: 'Ten years from now, I will be dead...' Is it really just a dream? Why is Akane dead? Determined to find answers, Itsuki travels back and forth to the future in her dreams searching for a happy ending for herself and Akane. GAMEPLAY The game combines traditional visual novel storytelling and player-controlled exploration. Depending on the player's actions, the story branches into four different endings. Escape the disastrous future you've learned about in your dreams and pursue a happy future. CHARACTERS Itsuki Hiiragi The protagonist. She has a bright and refreshing personality. Her goal is to lead a stable, happy life. Akane Ariake Itsuki's best friend. She has a soft and gentle personality, speaking in a slow and stilted manner, and has a mysterious air about her. Mutsumi Haitani A young man who finds himself handcuffed to Itsuki in the future. Gentle and respectful to everyone, but the depths of his soul are a mystery. Iori Kuto A senior of Itsuki and Akane's high school club. He recently started dating Akane, and is admired by all of the club members. Nao Hayashikawa A friend of Itsuki and Akane and belongs to the same club. She has a strong, firm personality and is shy when it comes to matters about love. Minako Sasahara Iori's ex-girlfriend. She is a senior in the same club as Itsuki and Akane. GAME FEATURES Four unique endings (1 Happy, 3 Bad). Playtime: Around 2 hours. ---------------------------------------------------------------------------------- Live Broadcasts, Reviews, and Fanarts Please write the name of the work and the creator's name somewhere on the website for streaming, reviews, and fanarts. Reporting is optional. However, please refrain from using the contents of additional content (after stories) in play-by-play videos, or in images in review articles. ----------------------------------------------------------------------------------",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2002200/header.jpg?t=1667796791",
    "Price": 6.29,
    "Developers": "皐月の夢",
    "Publishers": "LocaGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2002200/ss_227c48c4b3cf11d26d52f282f05f345605273a3b.1920x1080.jpg?t=1667796791,https://cdn.akamai.steamstatic.com/steam/apps/2002200/ss_706e8cb9de40e2346d36bc03c187c6f55165b6f6.1920x1080.jpg?t=1667796791,https://cdn.akamai.steamstatic.com/steam/apps/2002200/ss_1782111102f184a1890f32979d199d28e435a44d.1920x1080.jpg?t=1667796791,https://cdn.akamai.steamstatic.com/steam/apps/2002200/ss_e6ba424c770c65d432a91ed130d263e21b3aa011.1920x1080.jpg?t=1667796791,https://cdn.akamai.steamstatic.com/steam/apps/2002200/ss_43531c80d9902801a2d0f9b3f3990069d29df10a.1920x1080.jpg?t=1667796791",
    "Slug": "future-mirror",
    "Meta Title": "Future Mirror: Nov 1, 2022, 皐月の夢 and Full Overview",
    "Meta Description": "Looking for information on Future Mirror? Check out the release date (Nov 1, 2022), developer insights from 皐月の夢, and a complete game summary.",
    "Alt Text Image": "Official header image for Future Mirror game - Steam 2002200",
    "Canonical URL": "https://gusku.site/game/future-mirror",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Future Mirror\", \"description\": \"Looking for information on Future Mirror? Check out the release date (Nov 1, 2022), developer insights from \\u7690\\u6708\\u306e\\u5922, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u7690\\u6708\\u306e\\u5922\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LocaGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2002200/header.jpg?t=1667796791\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.29, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}