{
    "AppID": 2146040,
    "Name": "ネクロサーガ",
    "Release date": "Nov 3, 2022",
    "About the game": "The kingdom is about to fall due to an attack by necromancer. The wandering immortals, the secret maneuvers of bandits, the rampant mysterious plague... The people, who have lost their hearts and minds, are being eaten away by heresy. You wake up in a thick fog. You can aim to become a hero in this kingdom, or you can live according to your desires. white as snow as scarlet as blood black as darkness your soul gets cloudy. 'Necrosaga' is a dark fantasy 2D action RPG set in a kingdom where immortals wander. You can always choose between right and wrong, or an option that goes above and beyond your opponent's expectations. You can attack any individual you encounter, or conversely recruit them to join you. Because of his powerlessness at the beginning, he will not be able to exert a great influence on the world. However, you, who can 'steal the abilities of those who have defeated them', gain strength through battles with immortals. Even if you're not good at fighting, you can overwhelm your enemies with absolute power if you take your time. What fate awaits you who eventually gained great power... You can decide how the story ends. ■ Abundant choices ・You can freely select one from a maximum of six options. ・Customization to become stronger is also free. You can specialize in attack, or you can specialize in defense. You are free to use poison or shoot tactics that rely on luck. ■ Incandescent barrage battle ・During the enemy's attack turn, you can avoid the weak point by moving your own heart. ・No matter how high-level your opponent is, if you can't hit them, it won't matter. ・If you feel that the enemy's attack pattern is difficult, there is also a mode where you can practice freely, so you can rest assured. ・If you want a more intense danmaku, you can also challenge the gods that you don't have to fight in the normal route. ■ Attack turns where you freely build a deck and fight ・On your attack turn, you can attack by choosing cards. ・Depending on your sense of deck construction, you may be able to defeat high-level enemies easily. ・Cards can be obtained by defeating enemies or making choices in the story. every choice will make you stronger ・Let's make the strongest deck only for you All music in the game is composed by Maoudamashii. Please enjoy the story of Necrosaga colored with beautiful music.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2146040/header.jpg?t=1667721039",
    "Price": 0.0,
    "Developers": "Bravely Kappa",
    "Publishers": "Bravely Kappa",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2146040/ss_0418dc9647ce1dc9c1c60d26e52e3a0b19c33749.1920x1080.jpg?t=1667721039,https://cdn.akamai.steamstatic.com/steam/apps/2146040/ss_5a1983966726236f39bcc9796accaafd9ad844ca.1920x1080.jpg?t=1667721039,https://cdn.akamai.steamstatic.com/steam/apps/2146040/ss_6acaf050d457c59f8674c3a79bfa4e7046ae3573.1920x1080.jpg?t=1667721039,https://cdn.akamai.steamstatic.com/steam/apps/2146040/ss_faab68103d8c34a9d953449ec1f3ef62bbe8300b.1920x1080.jpg?t=1667721039,https://cdn.akamai.steamstatic.com/steam/apps/2146040/ss_5f38a109b288474fab9d716e353fafe4859e69d4.1920x1080.jpg?t=1667721039",
    "Slug": "",
    "Meta Title": "ネクロサーガ: Nov 3, 2022, Bravely Kappa and Full Overview",
    "Meta Description": "Looking for information on ネクロサーガ? Check out the release date (Nov 3, 2022), developer insights from Bravely Kappa, and a complete game summary.",
    "Alt Text Image": "Official header image for ネクロサーガ game - Steam 2146040",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u30cd\\u30af\\u30ed\\u30b5\\u30fc\\u30ac\", \"description\": \"Looking for information on \\u30cd\\u30af\\u30ed\\u30b5\\u30fc\\u30ac? Check out the release date (Nov 3, 2022), developer insights from Bravely Kappa, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bravely Kappa\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bravely Kappa\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2146040/header.jpg?t=1667721039\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}