{
    "AppID": 1821070,
    "Name": "Grey Block",
    "Release date": "Oct 26, 2022",
    "About the game": "Take control of Theo Church as you help him and his accomplice, fellow infiltration specialist Nikki Salzano, escape the Green Valley Psychiatric Hospital by force or by wit one fateful winter night when Nikki breaks in to help Theo. As the player, you will help Theo chart an exit through the hospital's tight security apparatus while searching for evidence of the conspiracy that resulted in your involuntary commitment by hacking computer terminals, tinkering with fuse boxes, and scouring offices for paper documents. Key Features A Rich World The world of Grey Block is one of a parallel dystopia. Around the same time in our world that funding for psychiatric care dried up, private capital sensed a unique business opportunity in the world of Grey Block. Innovation immediately flourished, the old Kirkbride-style institutions were transformed into chic, rehabilitation facilities, and a wave of novel treatments began to emerge. It was not to last though. The profit-driven nature of venture capitalists seeking to maximize ROI eventually claimed the high ground over the altruism of researchers seeking to serve the greater good. The world in which you take control of Theo is at a point when most of the altruistic have moved on, and those that remain are largely driven by material success. There are some that have stuck it out for the greater good, convinced that they can make a difference as a mongoose in a den of vipers, but they are few and far between. As Theo, you'll hunt for lore items that uncover more detail in the tangled web of characters present in his world. From Alexandra Roth, Theo's doctor, to Vic Vance and Erin Banker, the leadership at Cobalt Venture Capital (Green Valley's financers), to the internet hacktivist group SINON, to Theo's own father David Church, the more you look for, the more you'll find. Hunt for Evidence Though escaping is the goal, simply getting out doesn't solve Theo's problems. The individuals committed to keeping Theo inside the hospital have taken extraordinary measures to ensure he is kept quiet and out of sight. Blasting your way out, though possible, doesn't do much to disprove the narrative that Theo has been wrongly persecuted and deserves to be free. Getting out (and staying out) on your own would be near impossible. Thankfully, Nikki is able to lend her infiltration expertise to aid Theo in escaping and collecting evidence to prove your case. Utilize the covert, file-system mapping tool, termITE to break into the hospital's computer terminals and hunt for incriminating documents, memos, emails and chats. Theo will have to locate evidence throughout the file-system structure, which often requires hunting for user's encryption passwords, and executing programs to increase the access level on your key card that enables progress further through the hospital. For user's looking for an added challenge, the termITE CLI is available as an alternative to the visual interface Digital evidence is not the only form for which to hunt. Sometimes only a picture will tell a story that words can't. Find a camera within the hospital to capture pictures of certain objects that just need to be seen to believed. Failing that, you may be surprised at what some folks will leave around in paper form. Move with caution Theo is not a tank and his ability to physically engage security is limited. Implementing well-known 3d, 3rd-person shooter mechanics, stealth is crucial to getting out of Green Valley Psychiatric. If Theo makes too much noise, guards will investigate the sound, and if they see you, they will engage. Nurses on the other hand will run to the nearest intercom to alert the guards if they spot Theo. The Long Road or The Short Road How Theo and Nikki choose to escape matters. Should you choose violence, Theo's story will have less credibility unless backed up by considerable evidence. Should you rely on wit, there may be ways to unblock the path that rely on hacking fuseboxes, and picking locks.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1821070/header.jpg?t=1666799704",
    "Price": 19.99,
    "Developers": "Silver Rat Studios",
    "Publishers": "Silver Rat Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1821070/ss_416972a4853ab018a7057ca090ffe413077075d9.1920x1080.jpg?t=1666799704,https://cdn.akamai.steamstatic.com/steam/apps/1821070/ss_30f4f83946ea574341f6ca5147a9c81124502fbd.1920x1080.jpg?t=1666799704,https://cdn.akamai.steamstatic.com/steam/apps/1821070/ss_ffb67ececfec579dd07448b3d232752917844f6f.1920x1080.jpg?t=1666799704,https://cdn.akamai.steamstatic.com/steam/apps/1821070/ss_7b21d60c858dbd9b21d28fa2f1b6215607ae0421.1920x1080.jpg?t=1666799704,https://cdn.akamai.steamstatic.com/steam/apps/1821070/ss_43a1d708692fe162fe70b16d98dd888bc8a30acb.1920x1080.jpg?t=1666799704,https://cdn.akamai.steamstatic.com/steam/apps/1821070/ss_4af7017e98900d45b40150db8eb02dd438f519ca.1920x1080.jpg?t=1666799704,https://cdn.akamai.steamstatic.com/steam/apps/1821070/ss_bc3b1e010b5c3bc6ca95bc2dbff9a9d233778335.1920x1080.jpg?t=1666799704,https://cdn.akamai.steamstatic.com/steam/apps/1821070/ss_00c0503cde216280b7fae0bb5ba8184260e8bcf3.1920x1080.jpg?t=1666799704,https://cdn.akamai.steamstatic.com/steam/apps/1821070/ss_89ed494d9f7c21019841357f16b959cf8b831c15.1920x1080.jpg?t=1666799704,https://cdn.akamai.steamstatic.com/steam/apps/1821070/ss_f8f2137986ea13b96db69ee98d99cf65cffcdab0.1920x1080.jpg?t=1666799704,https://cdn.akamai.steamstatic.com/steam/apps/1821070/ss_e257edbb763c4ca32a8bef995dcb34559c7eb658.1920x1080.jpg?t=1666799704,https://cdn.akamai.steamstatic.com/steam/apps/1821070/ss_55370d29e239796c6ec96b5745a1b7b7e1203965.1920x1080.jpg?t=1666799704",
    "Slug": "grey-block",
    "Meta Title": "Grey Block: Oct 26, 2022, Silver Rat Studios and Full Ove...",
    "Meta Description": "Looking for information on Grey Block? Check out the release date (Oct 26, 2022), developer insights from Silver Rat Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Grey Block game - Steam 1821070",
    "Canonical URL": "https://gusku.site/game/grey-block",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Grey Block\", \"description\": \"Looking for information on Grey Block? Check out the release date (Oct 26, 2022), developer insights from Silver Rat Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Silver Rat Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Silver Rat Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1821070/header.jpg?t=1666799704\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}