{
    "AppID": 2171830,
    "Name": "Jotunn - Day of Judgement",
    "Release date": "Oct 27, 2022",
    "About the game": "Start your journey... Jotunn is a small First-Person-Horror experience . Set in a dark and mysterious norse forest, the player is tasked with activating multiple magic runestones to open the Serpent-Gate and to escape the mystical forest. Explore a mysterious dark scandinavian Forest in First-Person both at night and day. Hide and flee the Jotunn, a vicious creature, stalking the forest at night. Stay low and evade getting cought while exploring the forest. Gather your strength at the small forest hut, the only save place from the Jotunn. Sleep here to change the time of day. Search for the ominous Runestones, hidden at different locations across the forest and activate them to gather Odins strength and to find a way to open a gate, leading to safety. But be aware, for the stones can only be activated at night, when the Jotunn haunts the woods. Words from the developer Hi everyone! Thanks for your interest in Jotunn - Day of Judgement. As the developer, I believe that transparency towards the player is the key feature for a good game and a healthy community. Since I am a solo developer, the content of the game is somewhat limited, the performance not optimal (hence the crazy system requirements) and the balancing still not perfect. Still, I did not want to mark this title as Early Access, since I found this misleading since I'm not really planning for too many Updates. Apart from that, I would appreciate every piece of feedback. Share your ideas for improvement, better balancing or anything that comes to mind. As a single person, my capacitites in the fields of balancing and performance testing on multiple devices are somewhat limited. Therefore I am happy about every piece of information I can get. Since Jotunn is very short and not perfect, everyone should have the opportunity to play this game for free (should be obvious) I am looking forward to making more, longer and better games in the future and I am exciting for the upcoming journey!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2171830/header.jpg?t=1666982913",
    "Price": 0.0,
    "Developers": "Rouven Cabanis",
    "Publishers": "Rouven Cabanis",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2171830/ss_61966e1a0055da0fd28f095fd9741a108570d958.1920x1080.jpg?t=1666982913,https://cdn.akamai.steamstatic.com/steam/apps/2171830/ss_9d6366de41f498b930b4b7372a498b173cd244ad.1920x1080.jpg?t=1666982913,https://cdn.akamai.steamstatic.com/steam/apps/2171830/ss_d29b7e0280eef0b9c55075134cfaa84413516c76.1920x1080.jpg?t=1666982913,https://cdn.akamai.steamstatic.com/steam/apps/2171830/ss_333458ec44158158a6f3fd671d6d1a08a54e0e75.1920x1080.jpg?t=1666982913,https://cdn.akamai.steamstatic.com/steam/apps/2171830/ss_10cf9fbda4e5d865e1f9b9a1b366af4ea9ccb0fb.1920x1080.jpg?t=1666982913",
    "Slug": "jotunn-day-of-judgement",
    "Meta Title": "Jotunn - Day of Judgement: Oct 27, 2022, Rouven Cabanis a...",
    "Meta Description": "Looking for information on Jotunn - Day of Judgement? Check out the release date (Oct 27, 2022), developer insights from Rouven Cabanis, and a complete ...",
    "Alt Text Image": "Official header image for Jotunn - Day of Judgement game - Steam 2171830",
    "Canonical URL": "https://gusku.site/game/jotunn-day-of-judgement",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Jotunn - Day of Judgement\", \"description\": \"Looking for information on Jotunn - Day of Judgement? Check out the release date (Oct 27, 2022), developer insights from Rouven Cabanis, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rouven Cabanis\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rouven Cabanis\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2171830/header.jpg?t=1666982913\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}