{
    "AppID": 1909370,
    "Name": "Just Power: The Papal States",
    "Release date": "Nov 12, 2022",
    "About the game": "The Roman Empire is not dead. It has just changed its skin. Corruption, nepotism, and power struggles are all part of the environment where you will find yourself playing in this turn-based political simulator. With heresies looming, you must protect the one true faith and integrity of Rome. Re-establish the supremacy of the Pope (and your family’s too). How to reach that is up to you. Climb the hierarchies, promote your friends, shape the Church on your own image. Are you ready to lead Christendom into a new era? Become Pope and govern the Church Are you ready to lead the Church? Will you be able to lead it to greatness and prevent it from complete disintegrating? Not all Pontiffs had this concern: 'Since God has given us the Papacy, let us enjoy it' said Pope Leo X. What is certain is that being the successor of St. Peter brings enormous benefits. Appoint the bishops, decide who will sit in the College of Cardinals and appoint the boards of the most important congregations and institutions. And if you just can't leave the Church in good hands, at least make sure that your successor is your own flesh and blood. Bribe, blackmail and (if needed) kill You certainly have good intentions for God's people but remember: learn the rules of the game and then play better than everyone else. It is not necessarily the most pious candidate who will ascend to the papal throne. The world is full of evil people who will have no qualms about taking you down. Good intentions are not enough if you really want to leave your family name in history. Bribe your way into positions and favours; blackmail those whose secrets you know and if things go wrong: kill. Start investigations to get rid of the enemies of the Church The Church of Rome is a powerful institution. And like any powerful institution, it must defend itself against the plots of its adversaries. The Holy Office is the Congregation set up specifically for this task: to find the enemies of the Church and destroy them. Decide for yourself whether the greatest threat to Rome is heretics, corruption or your family's rivals. Create offices The bureaucracy of the Papal States was full of recommended people with very little desire to work but who held high positions. Do not stop this tradition. Create useless but solemnly named positions and hire relatives, friends, and party companions. Obviously, positions with big names deserve big salaries... Manage bishoprics Even if you’ll never become Pope, this does not exclude you from running a state. Decide how to manage the resources of the state. Invest in good works or divert the money to you and your relatives. Will you be a good or a lousy administrator? Create a dynasty The greatness of the Church is a key objective, but your family comes first. Start as a priest in the most remote diocese and work your way up to become Bishop of Rome. Place your relatives at the top of the Papal States and make your heirs forget the word 'insignificance'. Remember, death stops the body, not the ideas: your family will still be there to carry out your plans. Fight Heresy The greatest threat to the integrity of the Church is Heresy. But are you sure it is really bad? You choose whether to persecute them mercilessly or join them to reform the Church. Manage relations with other kingdoms The Pope is not the only sovereign of Europe. Others are interested in getting involved in the affairs of the Holy See. Interact with the greatest courts of Europe. Defend the interests of the Church. Make agreements and ensure that all souls always remain under the wing of Rome. Change the laws God's law is not enough. Men must also follow the laws dictated by you. Taxes, length of sentence and regulations are only some of the things you will have to decide on. What is the proper penalty for taking a bribe? It depends on what guise you will be playing: champion of justice or corrupt opulent? Deal with processes In the end, God will judge us; in the meantime, there are the earthly courts. Remember: the law applies strictly only to enemies; for friends, it is interpreted.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1909370/header.jpg?t=1668257539",
    "Price": 4.49,
    "Developers": "Sticks Games",
    "Publishers": "Sticks Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_05a977c6093753180f5f0039eb2bbe6625e90aa9.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_22485cfcbf1e2ef83a099b0c38ed867688025a64.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_e8030c1b4b11a259cf9031b45129470f32330000.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_d7a10195373a8a8a97f07f5a7ee25cb1bbdf933e.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_adc93c2e3820e1820f03d67065e34c8066284b41.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_ef9e6142fc287298eda75c816fd75f8ba3d900e7.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_9333ed1f4c0ae9a405e0377f6d546dc5d1d2c942.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_bf2969a94b35389c3a68026576c123ec14038e41.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_ce463e0c1cb07d300b86834e0db5ccf17d22032f.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_734f1399620f8d83e198a84b73fa3b7a38a336c3.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_0b1441ed0916c1081ca114b1ce9cf08b02d5eab4.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_ebebe5fe41042747c9c9d9a90b798bedb8d0774c.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_5548c7624e8099b72efaec75cc1be1ef0c6b78d1.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_312ba4829ac6936f3b982051fc9ca52bea0599f7.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_d329f9fb02b62142729f4f1143ae7aee2c286a98.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_0e719fe0ca0cba052c3cb54b1f7f821ca1ac7692.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_0d05c7585e84a01cf06b8c231f9742f71475e8d3.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_9c4b04a9da745bf7445da6c24f9ce42258b1a8d0.1920x1080.jpg?t=1668257539,https://cdn.akamai.steamstatic.com/steam/apps/1909370/ss_611eb66f4fc923ab42ae9408c4455fb94e453b70.1920x1080.jpg?t=1668257539",
    "Slug": "just-power-the-papal-states",
    "Meta Title": "Just Power: The Papal States: Nov 12, 2022, Sticks Games ...",
    "Meta Description": "Looking for information on Just Power: The Papal States? Check out the release date (Nov 12, 2022), developer insights from Sticks Games, and a complete...",
    "Alt Text Image": "Official header image for Just Power: The Papal States game - Steam 1909370",
    "Canonical URL": "https://gusku.site/game/just-power-the-papal-states",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Just Power: The Papal States\", \"description\": \"Looking for information on Just Power: The Papal States? Check out the release date (Nov 12, 2022), developer insights from Sticks Games, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sticks Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sticks Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1909370/header.jpg?t=1668257539\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}