{
    "AppID": 2183770,
    "Name": "KICK MASTER",
    "Release date": "Nov 1, 2022",
    "About the game": "kick master is a somewhat unusual game, I couldn't define exactly what its genre is, in this game the player will have to use 5 keys, 4 of which must be pressed one at a time, as soon as the blue ball is in the place corresponding to the key and then press the enter key, done that the sphere should disappear and then the character will kick the object in front of you. At first the player should use only two DF keys. When hitting 10 times in a row, a new object will appear along with the green bar running out, this is the time limit for the player to hit 5 sequences of spheres in a row to be able to destroy this fiance object, done that a second object will appear that the player also will need to hit for 10 more times until a second object appears that needs 5 sequences of kicks to be able to be destroyed, the game will repeat this sequence of events for 5 times. After these 5 events the game must be restarted automatically and at this moment, instead of using 2 keys, the player will play using 3 SDF keys. Once all events are completed again, the game must be restarted once more and now the player must use 4 keys to play ASDF The mechanic was based on clicking the sphere in the correct position as in 'Guitar hero' and a base based on 'Timberman'. lives: the player starts the game with only a single life, therefore, he loses by making the first mistake. The player will be able to see that just below the screen there is a point counter, these are cumulative, therefore, when reaching 1000 points the player gains a second life and when surpassing 2000 points the player gains a third life. which ends up making the game a little easier. The player won't find much in this game, it's a simple game, with a short duration, a casual game, just 4 squares with 4 keys drawn at the bottom left of the screen, 5 vertical lines that indicate the way down which the blue balls, in the middle there is a rectangle with blue edges with some indications inside, on the right side there is a character that stands still waiting for the player to hit the correct sequence of spheres so he can kick and break the object that is in front of him. At the top right of the screen there is a bar with 5 red items inside, for each time the player hits the sequence and the character destroys the object with the kick, the green bar fills up a little, when it is full it starts to empty, this is the time the player will have to break the object that is on the screen at that moment. the red items indicate which of the 5 levels the player is on. Sorry about my English mistakes, I'm Brazilian and I used the google translator. I hope you enjoy the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2183770/header.jpg?t=1667299189",
    "Price": 0.59,
    "Developers": "Artur Rezende",
    "Publishers": "PROATIV",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2183770/ss_ebd59c798accdec961f2f05e999f17f93a91ea35.1920x1080.jpg?t=1667299189,https://cdn.akamai.steamstatic.com/steam/apps/2183770/ss_95469fa5884ab1bd095d6037b0e8476c6ed6ca49.1920x1080.jpg?t=1667299189,https://cdn.akamai.steamstatic.com/steam/apps/2183770/ss_3bce57e3af272ec64df7e9e77a0367d0ce636783.1920x1080.jpg?t=1667299189,https://cdn.akamai.steamstatic.com/steam/apps/2183770/ss_fd9e94af44b459642e155a654177fe6c9821b3cc.1920x1080.jpg?t=1667299189,https://cdn.akamai.steamstatic.com/steam/apps/2183770/ss_b2b183e816956f9b4ab615bdafc42bea2242437f.1920x1080.jpg?t=1667299189,https://cdn.akamai.steamstatic.com/steam/apps/2183770/ss_6f382c1b07a48096d31414d25293f5a5bb986bec.1920x1080.jpg?t=1667299189,https://cdn.akamai.steamstatic.com/steam/apps/2183770/ss_56da9c9b1bbaa72907d532a003c7e65abd3bb95b.1920x1080.jpg?t=1667299189,https://cdn.akamai.steamstatic.com/steam/apps/2183770/ss_75867ec1e2869055d0c474e35ad1cc40ee66ed99.1920x1080.jpg?t=1667299189,https://cdn.akamai.steamstatic.com/steam/apps/2183770/ss_cd382e507fe77eea8266d69a66dfaa466b8e9563.1920x1080.jpg?t=1667299189,https://cdn.akamai.steamstatic.com/steam/apps/2183770/ss_ebd59c798accdec961f2f05e999f17f93a91ea35.1920x1080.jpg?t=1667299189",
    "Slug": "kick-master",
    "Meta Title": "KICK MASTER: Nov 1, 2022, Artur Rezende and Full Overview",
    "Meta Description": "Looking for information on KICK MASTER? Check out the release date (Nov 1, 2022), developer insights from Artur Rezende, and a complete game summary.",
    "Alt Text Image": "Official header image for KICK MASTER game - Steam 2183770",
    "Canonical URL": "https://gusku.site/game/kick-master",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"KICK MASTER\", \"description\": \"Looking for information on KICK MASTER? Check out the release date (Nov 1, 2022), developer insights from Artur Rezende, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Artur Rezende\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PROATIV\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2183770/header.jpg?t=1667299189\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}