{
    "AppID": 1967390,
    "Name": "Lenny Loosejocks in Space",
    "Release date": "Nov 1, 2022",
    "About the game": "You guide Lenny and Donga in their epic quest to save the human race from the evil Sluggees. It's the groundbreaking point-and-click web adventure game sequel to Lenny Loosejocks Goes Walkabout in all its pixelated glory - exactly like you remember playing when you got home from school in 1998. Use your mouse to guide Lenny to his spaceship and help him travel to each planet in our solar system where he must find and defuse the bombs planted by the Sluggees. Don't be afraid to click everywhere as you never know what interesting creature or discovery awaits you. You will need to use all your powers of logic and deduction to find and manipulate levers, activate machines and discover the secrets required to reveal the location of each bomb. Once you've found the bomb you need to solve a 'lights out' style puzzle to disarm it, and - most importantly - note down the number displayed as you'll need this to defuse the main bomb on Earth. Attention all Earthlings! I am Prime Minister Squeegle Queegly. Ruler of the planet Sluggeen. Lord of the 20 Billion Sluggees who live there. However, our Sun is dying and our galaxy is about to be thrown into infinite and terminal darkness! There is only one solution: to detonate a neighbouring Galaxy. with such force that the resulting explosion will burn bright enough to light our Galaxy forever! Your Galaxy is the closest, so, we've planted bombs on each of your nine planets. And in just over four hours... BOOM!! Bye bye Earthlings! Even if you find the bombs, good luck disarming them! Just to taunt you, the first bomb has been planted right under your noses in the desolate Outback town of Pullyapantsup! But, you must disarm all of the other bombs before you can disarm the master bomb on Earth! Ha! Ha! Ha! - Prime Minister Squeegle Queegly Well?! What are you waiting for? It's time to blast off: Lenny only has four hours to save the human race! Special thanks to super fan @TOMYSSHADOW who has made this Steam port possible. Proceeds from this version will help us create the final installment in the Lenny Loosejocks Trilogy - codename Lenny 3 . Thanks for your support and come say 'Hi' in the Ezone Discord. REVIEWS One of my top favorite classic shockwave games from the late 90's. Whether it was watching my older brother playing, or me fumbling around because I was still a very young child, this is another title from my childhood that has stuck with me since. Lenny Loosejocks spreading his wacky hijinks one thousand years past his time, going planet to planet in our solar system in order to save all who inhabit it. To this day, twenty plus years later, my brother and I will still quote this game, and we never grow tired of it. - Shakermaker Oh my god. I get to relive the alien that goes 'BEEKER BEEKER BEEKER BEEEE' - EterniTea Lenny in Space is one of my all-time favorite Shockwave games from its era. The mini-games were on-point, the puzzles were better than many flash-based games offered in its era, and the zany humor and antics of the characters served to create a game that I have remembered fondly into adulthood. To see it return to Steam is a dream come true, and I am so excited to revisit such a childhood classic. The adventures of Lenny and his friends were a major part of my early gaming childhood, and out of all of the various games, this is the one I remember the most! I hope that this revival can bring Lenny to a new generation, and can continue to fortify his presence in the minds and hearts of those who already love him. - Starsmors314 Sometimes you just need a game where you can get punched in the face and see a rad alien on a four-wheeler. Ten outta ten. Four-wheeler? Rover? It goes vroom, that's all that matters. - feralbones Lenny Loosejocks in Space was my childhood. It introduced me to the world of Ezone too. I remember going to the Henry Ford Centennial Library in the early 2000s every weekend with my sister and I would play Lenny Loosejocks in Space on the computers there. I keep finding myself playing it again throughout the years, not only for the nostalgia, just because simply it is a fantastic game. Pluto is still considered a planet too, so it get bonus points in my book! - Gangsta Goose Lenny in Space is the quintessential Ezone game that oozes with charm. It managed to leave a sequel tease that I’m still excited to see come to fruition. - Dirk Smirkley I remember back in the year 2000, downloading both Lenny Walkabout &amp; Lenny In Space to the ol' Shockmachine, and they were 2 of my favorite Shockwave games back then. I spent many a day back then playing through the world of Pullyapantsup &amp; exploring each planet in order to stop the Master Bomb from detonating. I bought Lenny Walkabout on Steam to support the guys at Ezone, and I'll gladly buy a copy of Lenny In Space when it arrives on Steam too, as thanks for all of the good memories those games gave me back then! - Iwantdevil Lenny in Space was the first game I ever played and it had a tremendous impact on me. The creative visuals and space theme made it memorable for this nerdy kid who, at the time, did not know English to properly follow the story. It remained engraved in my mind for years and I’ve never been more excited about a Steam release. It’s wholesome to see this game receive the attention it deserves and that it’s part of the childhood memories of so many. - Green Tea Lenny In Space was my first experience with the point-and-click adventure, and I can't think of a better way to get in to this genre. Intensely funny, challenging, and fun for all ages! - AjaxIronside",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1967390/header.jpg?t=1667305663",
    "Price": 11.99,
    "Developers": "Ezone PTY LTD",
    "Publishers": "Ezone PTY LTD",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1967390/ss_cd44c1e509efea079227be58d7519e7e59c87c43.1920x1080.jpg?t=1667305663,https://cdn.akamai.steamstatic.com/steam/apps/1967390/ss_cedb458c935dacc8ca777638f71bba6abdc35c11.1920x1080.jpg?t=1667305663,https://cdn.akamai.steamstatic.com/steam/apps/1967390/ss_15682f26c5acf8d9599385910e1fe5133ed58c0c.1920x1080.jpg?t=1667305663,https://cdn.akamai.steamstatic.com/steam/apps/1967390/ss_52c4b9fb0d345483057108e34354180c3584a3da.1920x1080.jpg?t=1667305663,https://cdn.akamai.steamstatic.com/steam/apps/1967390/ss_683cdf0ad29b0bbe4b426e40bc3f0acb2118e76a.1920x1080.jpg?t=1667305663,https://cdn.akamai.steamstatic.com/steam/apps/1967390/ss_b7c456ef274566cafec42efae411d1a8fcd957e6.1920x1080.jpg?t=1667305663,https://cdn.akamai.steamstatic.com/steam/apps/1967390/ss_651bd45bab7cb1674c403e337e960f7cb0a81c23.1920x1080.jpg?t=1667305663,https://cdn.akamai.steamstatic.com/steam/apps/1967390/ss_e9c3db609b3228fc444dc4d6da35b824b9b64102.1920x1080.jpg?t=1667305663,https://cdn.akamai.steamstatic.com/steam/apps/1967390/ss_dc8c08db8688763177156ce21396f8da63c98008.1920x1080.jpg?t=1667305663,https://cdn.akamai.steamstatic.com/steam/apps/1967390/ss_6789b1007d3cb0edfb2834383dd467217fd9f133.1920x1080.jpg?t=1667305663",
    "Slug": "lenny-loosejocks-in-space",
    "Meta Title": "Lenny Loosejocks in Space: Nov 1, 2022, Ezone PTY LTD and...",
    "Meta Description": "Looking for information on Lenny Loosejocks in Space? Check out the release date (Nov 1, 2022), developer insights from Ezone PTY LTD, and a complete ga...",
    "Alt Text Image": "Official header image for Lenny Loosejocks in Space game - Steam 1967390",
    "Canonical URL": "https://gusku.site/game/lenny-loosejocks-in-space",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lenny Loosejocks in Space\", \"description\": \"Looking for information on Lenny Loosejocks in Space? Check out the release date (Nov 1, 2022), developer insights from Ezone PTY LTD, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ezone PTY LTD\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ezone PTY LTD\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1967390/header.jpg?t=1667305663\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}