{
    "AppID": 1926180,
    "Name": "Lilium",
    "Release date": "Nov 11, 2022",
    "About the game": "Lilium is an action role-playing game taking place in a very small, but dense open world. It has a short, interesting main story, several side quests, dungeons and exciting secrets waiting to be discovered. Find your fun by interacting with your surroundings, develop your character, loot everything. After altering the future and saving humanity, our hero went on dangerous missions to finish the enemy once and for all. The last mission was a success, but ended with a huge nuclear explosion. The hero became a legend. A legend, but not dead. At the last moment the explosion threw them through the portal. The large overload caused by the nuclear reaction carried our hero to an unknown place and time. 'Where am I? How do I survive? Will I ever go home?' Play as a female or male character, set you name and starting character class Follow the main storyline and do several side quests, around 15 in total Explore the Western Islands of Lilium on foot or by boat Explore the dungeons and caves of the islands, 5 in total Interact with almost everything in the world. Most things are lootable, the rest is moveable, throwable. You can kill the strongest boss with a single cup if you're determined enough Fight with swords, clubs, axes, bows or just hack your opponent with a rubber chicken Dip you weapons in poison or light your arrows on fire and deal more damage Sneak around your enemies and deal more damage to them from behind with a surprise attack Develop your character as you play. Get faster by running a lot or more resistant by taking a lot of damage Loot, trade and upgrade you equipment as you go on Your progress in the game is saved automatically as you explore and complete quests. If you do something unwise, you might do a permanent damage to your world and won't be able to proceed with your storyline. It wont stop you from having fun of course. Don't afraid from starting a new game if everything goes wrong. Enemies and loot spawns randomly, you might have a different experience each time you play. If you die, you might lose some of your progress and loot, but you're character will keep it's skills. The more you play, the better you'll get, even if you die a lot.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1926180/header.jpg?t=1668174768",
    "Price": 11.99,
    "Developers": "Zolt치n Cser",
    "Publishers": "Zolt치n Cser",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1926180/ss_ade2e7a3871c1f213e30fdd521d740cf272b26f7.1920x1080.jpg?t=1668174768,https://cdn.akamai.steamstatic.com/steam/apps/1926180/ss_36a855c35e37f49a764f01bf355788c1271fa42e.1920x1080.jpg?t=1668174768,https://cdn.akamai.steamstatic.com/steam/apps/1926180/ss_abd7671ef0f06c66f204768207133e6d8cd42dca.1920x1080.jpg?t=1668174768,https://cdn.akamai.steamstatic.com/steam/apps/1926180/ss_348cd479c7b9837ebb9d31644221a4e9a5c7c723.1920x1080.jpg?t=1668174768,https://cdn.akamai.steamstatic.com/steam/apps/1926180/ss_94cac135646c07ea1c6de93d3dc7bcadf5339ac5.1920x1080.jpg?t=1668174768,https://cdn.akamai.steamstatic.com/steam/apps/1926180/ss_63d97ecd822d141ebe909a97637addb980bade75.1920x1080.jpg?t=1668174768",
    "Slug": "lilium",
    "Meta Title": "Lilium: Nov 11, 2022, Zolt치n Cser and Full Overview",
    "Meta Description": "Looking for information on Lilium? Check out the release date (Nov 11, 2022), developer insights from Zolt치n Cser, and a complete game summary.",
    "Alt Text Image": "Official header image for Lilium game - Steam 1926180",
    "Canonical URL": "https://gusku.site/game/lilium",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lilium\", \"description\": \"Looking for information on Lilium? Check out the release date (Nov 11, 2022), developer insights from Zolt\\u00e1n Cser, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zolt\\u00e1n Cser\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zolt\\u00e1n Cser\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1926180/header.jpg?t=1668174768\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}