{
    "AppID": 1418360,
    "Name": "Lonesome Village",
    "Release date": "Nov 1, 2022",
    "About the game": "Puzzle-solving and life-sim meet in a cozy, no-combat, coyote adventure! Uncover the mysterious, magical past of Lonesome Village and save this town from the hands of evil. You’re new to the quiet village of Lonesome, once known as Ubhora. With nothing but your can-do attitude, a map, (and a secret past?), you’re ready to find answers to your strange dreams as well as a home in this cozy community. But not everything is as it seems in the village… The people of Lonesome have vanished and a mysterious tower has risen from the ground, bringing with it secrets of a long buried village now disturbed. Puzzle-filled dungeon delving and cute social life simulation merge in this cute, no-combat adventure game. Take on the role of Wes the coyote and help bring this village back from the brink of destruction. Hang out and build relationships with a variety of cute characters bursting with personality. Make Lonesome your home - earn land in the village then build and customize your house inside and out. Help Lonesome grow by working in your garden and fishing in the nearby lakes. Discover hidden secrets with your Magic Glass and solve mind-bending puzzles to gain entry to and ascend a mysterious magic tower, one dark dungeon at a time. Save villagers from a perilous stay in the tower and help bring them back home to Lonesome! Lonesome Village is the perfect place to rest up after a long day of adventuring, with its gorgeous, inviting art style that gives a sense of calm and joy. Uncover a detailed and fascinating world full of mystery and adventure. Discover the gripping story of Lonesome’s origins and learn about Wes' secret past. Long ago, in old Ubhora , there was a tower similar to the very one recently sighted by Wes. One day, that tower had mysteriously disappeared - taking every home with it. Villagers often attributed this vanishing to The Cult , a group of wizards who wanted to control the world by summoning dark, unknown powers. Of course, this didn’t end up quite as they had planned. Many years later, Lonesome Villag e was founded on the same ground, and people flocked from all over the world to live there. Everything was well for a while, until the people of Lonesome soon discovered that the village wanted to remain alone. But of course, that’s where you come in. There’s so much to be done, let’s just hope The Cult doesn’t come back to stir up any trouble while you’re working…",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1418360/header.jpg?t=1667801686",
    "Price": 19.99,
    "Developers": "Ogre Pixel",
    "Publishers": "Ogre Pixel",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1418360/ss_3817792840af245cf52e56e7a913c70694a8406c.1920x1080.jpg?t=1667801686,https://cdn.akamai.steamstatic.com/steam/apps/1418360/ss_f0991129c6019d91d2d16871d087ee26e331e3e6.1920x1080.jpg?t=1667801686,https://cdn.akamai.steamstatic.com/steam/apps/1418360/ss_e037c726f95628b9aadfb312b8886a859a986ec8.1920x1080.jpg?t=1667801686,https://cdn.akamai.steamstatic.com/steam/apps/1418360/ss_6fe4109692c6767276887873001b1578aaa4e63c.1920x1080.jpg?t=1667801686,https://cdn.akamai.steamstatic.com/steam/apps/1418360/ss_0fea55be0286ff33389953410a4646d74f92fef5.1920x1080.jpg?t=1667801686,https://cdn.akamai.steamstatic.com/steam/apps/1418360/ss_73c06ad8003a2acb9650c51db6a7223694b973b0.1920x1080.jpg?t=1667801686,https://cdn.akamai.steamstatic.com/steam/apps/1418360/ss_cecebcca69e4432924d9375f69bc54d19c0e7638.1920x1080.jpg?t=1667801686",
    "Slug": "lonesome-village",
    "Meta Title": "Lonesome Village: Nov 1, 2022, Ogre Pixel and Full Overview",
    "Meta Description": "Looking for information on Lonesome Village? Check out the release date (Nov 1, 2022), developer insights from Ogre Pixel, and a complete game summary.",
    "Alt Text Image": "Official header image for Lonesome Village game - Steam 1418360",
    "Canonical URL": "https://gusku.site/game/lonesome-village",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lonesome Village\", \"description\": \"Looking for information on Lonesome Village? Check out the release date (Nov 1, 2022), developer insights from Ogre Pixel, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ogre Pixel\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ogre Pixel\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1418360/header.jpg?t=1667801686\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}