{
    "AppID": 2189420,
    "Name": "骸心 Mainbody",
    "Release date": "Nov 6, 2022",
    "About the game": "Play features: The story adventure game contains suspense and terror elements. Players spend every day by investigating on different floors. It is up to the player to decide whether to operate as agreed. Players' options have a significant impact on the plot. Multiple endings. It contains jumping out fright. The whole plot process takes about 1-2 hours. Story introduction: Welcome, new building manager. This room will be your room and office, where you are absolutely safe. As you know, you are about to work in a disgusting 'ghost building', but in fact, few outsiders know that the 'ghost building' is actually no ghost inside. In fact, there is only a group of contaminated 'patients' in the building, only some of them look like monsters because of the excessive contamination. Of course, you do not need to let them recover, as a replacement for the dead building director of the new, your duty is to maintain the normal operation of the building and keep the patients out of the building. The building manager's primary job is to keep the building in good standing, and a patient exodus would cause people on the outside to turn against our building. The building has been teetering on the brink of forced demolition in recent years, and it is the building manager's job to protect the building. After signing the agreement the building manager must put the interests of the building as the highest priority and must not leave his or her post without permission. One, the building manager needs to patrol the building every day and keep an eye on the entrance and exit at all times. Two, when you see a patient in the hallway, just persuade or drive them back to their room as appropriate, and don't let them out of your sight until they are back in their room. Third, keep a distance from the patient, do not enter the patient's room, remember. Fourth, if you encounter an emergency, please return to the building director's office immediately and wait for the patient to return to his room. Five, if the escape is Beast please stop it at all costs, if necessary the building manager needs to sacrifice himself for the building. I hope you can last a little longer than the last building manager. ---- Because of the content related to psychological trauma, please pay attention to the relevant aspects of the player's own psychological condition, if there is an accident game is not responsible.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2189420/header.jpg?t=1667718899",
    "Price": 0.79,
    "Developers": "水硅钒钙",
    "Publishers": "冷笑黑妖",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2189420/ss_36ebb44086f7572a6923b246fb2dc68df0be50d6.1920x1080.jpg?t=1667718899,https://cdn.akamai.steamstatic.com/steam/apps/2189420/ss_12d9f0dc3088bd1cf50810cf7bdbb87364886c2f.1920x1080.jpg?t=1667718899,https://cdn.akamai.steamstatic.com/steam/apps/2189420/ss_963d007b3d92d6e3b9ce3a87b11a215543283688.1920x1080.jpg?t=1667718899,https://cdn.akamai.steamstatic.com/steam/apps/2189420/ss_b823acb1e4644d453d808cb91bacfbc2b83c370e.1920x1080.jpg?t=1667718899,https://cdn.akamai.steamstatic.com/steam/apps/2189420/ss_8ed37303dd96e85eafe5c3c299484ff83debc56b.1920x1080.jpg?t=1667718899",
    "Slug": "mainbody",
    "Meta Title": "骸心 Mainbody: Nov 6, 2022, 水硅钒钙 and Full Overview",
    "Meta Description": "Looking for information on 骸心 Mainbody? Check out the release date (Nov 6, 2022), developer insights from 水硅钒钙, and a complete game summary.",
    "Alt Text Image": "Official header image for 骸心 Mainbody game - Steam 2189420",
    "Canonical URL": "https://gusku.site/game/mainbody",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u9ab8\\u5fc3 Mainbody\", \"description\": \"Looking for information on \\u9ab8\\u5fc3 Mainbody? Check out the release date (Nov 6, 2022), developer insights from \\u6c34\\u7845\\u9492\\u9499, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6c34\\u7845\\u9492\\u9499\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u51b7\\u7b11\\u9ed1\\u5996\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2189420/header.jpg?t=1667718899\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}