{
    "AppID": 2095280,
    "Name": "MeCopy - Keep your PC tidy",
    "Release date": "Nov 5, 2022",
    "About the game": "MeCopy (Modular Extension Copy) is a software based on independent modules with which you can copy, move or delete files on your computer at the same time without any module interfering with the others. Are you a gamer? With MeCopy you can select the folder where you have all your savegames (or each individual folder) and backup them to your portable HDD or USB. MeCopy will remember the paths, extensions, customizable module name and other module options you selected the next time you open it, so all you have to do is click a button and let MeCopy do the rest. Avoid doing repetitive tasks when managing your files. If you like to keep your computer tidy and you get lazy having to manually search for all those documents or multimedia and then move them to their respective folders, MeCopy will do it for you. Copy and move specific files by their extensions and delete files (also by extensions) or empty folders. Customizable names for each module. The program will remember the information you give it and the options you choose in case you need to copy, move or delete recurrently in one location. You can delete files filtering them by their extensions and also empty folders. Be careful! this option is quite dangerous if you don't know what you are doing, and you could alienate your Hard Disk from its precious files :-( and we don't want that to happen. Be careful with this option. Each of the 12 modules is independent of each other. You can copy, move or delete files at the same time between them without interrupting each other. You can choose which transfer type to use besides copy and move: . 1) Copy or move your files respecting the folder hierarchy . This means that your files will be copied or moved recursively to the place that you indicate inside the folder in which they were they were in. 2) Copy or move your files individually . This means that your files will be copied or moved individually to the destination of your choice. How to use To use the modules you must place the extensions beginning with a dot (.) and separating them with a space: .extension .extension .extension .extension . You can place as many as you want. Finally, you must press the 'Transfer' button and let MeCopy work its magic. You don't need to type in the extensions. You can check the type of file you want to copy, move or delete under the Extensions field. You can type the extensions yourself and also select them at the same time. If no extension is placed or selected, all files will be copied or moved from the source path to the destination path (or deleted, depending on the user's choice). How to delete files and empty folders? To delete files you must place or select the extensions and choose in ' Search in ' the path where the empty files or folders are. Options: Overwriten: If this option is enabled, the files in the destination folder will be overwritten with the new ones. NOT send to recycle bin: If this option is enabled, deleted empty files or folders will not be sent to the recycle garbage can. Only empty folders: If this option is enabled, only empty folders in the path selected in 'Search in' will be deleted. ATTENTION: It is important that your operating system is completely updated. If you have problems starting MeCopy, verify that you have the latest version of your OS. If you have Windows 7 you will need the system update KB3063858 which can be found in the Windows 7 update folder, located inside the MeCopy installation folder.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2095280/header.jpg?t=1667646413",
    "Price": 3.99,
    "Developers": "HuronByte",
    "Publishers": "HuronByte",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2095280/ss_3e19420623c9ae656d4c03dc6de92f1b1c09cea5.1920x1080.jpg?t=1667646413,https://cdn.akamai.steamstatic.com/steam/apps/2095280/ss_9ed6f0fa638fe2f879714de5e7c822f8b8f01fd7.1920x1080.jpg?t=1667646413,https://cdn.akamai.steamstatic.com/steam/apps/2095280/ss_aca0d45a71c91519bcbdf89b6f79e45145ad7fcc.1920x1080.jpg?t=1667646413,https://cdn.akamai.steamstatic.com/steam/apps/2095280/ss_6a9a5f8754ba56bb48b05315ce32d6e1f4504a83.1920x1080.jpg?t=1667646413,https://cdn.akamai.steamstatic.com/steam/apps/2095280/ss_4cc5246f972a7a96c40edd408e649c8f6bd35e3a.1920x1080.jpg?t=1667646413",
    "Slug": "mecopy-keep-your-pc-tidy",
    "Meta Title": "MeCopy - Keep your PC tidy: Nov 5, 2022, HuronByte and Fu...",
    "Meta Description": "Looking for information on MeCopy - Keep your PC tidy? Check out the release date (Nov 5, 2022), developer insights from HuronByte, and a complete game ...",
    "Alt Text Image": "Official header image for MeCopy - Keep your PC tidy game - Steam 2095280",
    "Canonical URL": "https://gusku.site/game/mecopy-keep-your-pc-tidy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MeCopy - Keep your PC tidy\", \"description\": \"Looking for information on MeCopy - Keep your PC tidy? Check out the release date (Nov 5, 2022), developer insights from HuronByte, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 5, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"HuronByte\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HuronByte\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2095280/header.jpg?t=1667646413\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}