{
    "AppID": 1961060,
    "Name": "Pawsecuted",
    "Release date": "Nov 1, 2022",
    "About the game": "Features Explore A different world each time with dynamically spawned quests and encounters. Scavenge The world was left devastated after the Great Mammal War. Search through the ruins of the Furless in a post-apocalyptic world. Craft Create the tools of survival and help rebuild the society of the Evolved. Recruit Hire mercenaries and convince followers to populate your Outposts or join you in battle. Consistent Map Transition Time doesn't stop when you get into a fight. Long, drawn out battles will tire you out. Combat Fight off venomous snakes, pistol-toting wallabies, and everything else trying to kill you. Or run away, that's fine too. Tactical Gameplay Time only moves when you do. Think and plan ahead to avoid death. Day/Night Cycle Makes activities during the night more dangerous. Line of sight, travel/search speed affected. Tag-Based Actions Extensive item tagging system that determines actions available to you. Anything with an Ignite tag can start a fire, anything with a Slice tag can make a sandwich. Story or Sandbox Follow the main storyline to find out more about the world, or completely ignore it and wander the Outback. Branching Quests Multiple ways to complete quests. Bribe a dog, complete a fetch quest or beat him up to get answers. Difficulty The world becomes more dangerous the further out you travel. You decide when you're ready. Moddability Data-driven design allows modders to create their own questlines, enemies, equipment, items and more. Lore/Backstory Pawsecuted exists in an alternate timeline that diverges from ours after the first cloning of sheep in 1984. This breakthrough led to huge advances in gene editing technology, and created a world with zero ethical restrictions on modifying DNA of non-human mammals. There was massive demand from people who wanted pets with humanlike qualities. Even wild animals were being modified to become suitable as household companions. By the mid-2010's, consumers could conveniently purchase gene mods giving their pets abilities such as speech, upright movement and even higher intelligence. Almost every household had multiple pets, modded for everything from entertaining children to construction work. In the 2020's, mammals started demanding equal rights to humans. Their demand was simple - nobody 'owns' anybody else, all mammals are free to choose their own destiny. Humanity pushed back, and the Great Mammal War for independence began. War lasted for over a decade and the world was left devastated. By the 2050's, the humans had all but been annihilated and forgotten. The only reminders of their rule are the ruined cities, towns and villages left behind. Your story begins in the distant aftermath of this war. You are a life-long convict in a work camp run by a zealous Koala. This is all you've ever known and all you expected to ever know. Until one day...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1961060/header.jpg?t=1667339396",
    "Price": 9.99,
    "Developers": "Poking Water Games",
    "Publishers": "Poking Water Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1961060/ss_92f937acdd8e02541725f565b162f3989375a290.1920x1080.jpg?t=1667339396,https://cdn.akamai.steamstatic.com/steam/apps/1961060/ss_dc3da5dc258adbf6f39aed743e767724f76dd5d7.1920x1080.jpg?t=1667339396,https://cdn.akamai.steamstatic.com/steam/apps/1961060/ss_4b4aefff8da188bae249f1fc2153c91ae452cb0d.1920x1080.jpg?t=1667339396,https://cdn.akamai.steamstatic.com/steam/apps/1961060/ss_ea63670a26f7315800a00281a16d89bb6260c362.1920x1080.jpg?t=1667339396,https://cdn.akamai.steamstatic.com/steam/apps/1961060/ss_b1d68dea143d9b9eaebc50a0eef6168a7da11583.1920x1080.jpg?t=1667339396,https://cdn.akamai.steamstatic.com/steam/apps/1961060/ss_5ffa1343d1654062b4913eab25900dc6557a3ee8.1920x1080.jpg?t=1667339396,https://cdn.akamai.steamstatic.com/steam/apps/1961060/ss_fe906d136395e6ac67699bd29c629468aa7b53bb.1920x1080.jpg?t=1667339396,https://cdn.akamai.steamstatic.com/steam/apps/1961060/ss_835cdaae0ae79d4a1744a4140ffe049c7395d15a.1920x1080.jpg?t=1667339396,https://cdn.akamai.steamstatic.com/steam/apps/1961060/ss_4bf22ea1e80a4b2cffe03c9b543d41712c3846c0.1920x1080.jpg?t=1667339396",
    "Slug": "pawsecuted",
    "Meta Title": "Pawsecuted: Nov 1, 2022, Poking Water Games and Full Over...",
    "Meta Description": "Looking for information on Pawsecuted? Check out the release date (Nov 1, 2022), developer insights from Poking Water Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Pawsecuted game - Steam 1961060",
    "Canonical URL": "https://gusku.site/game/pawsecuted",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pawsecuted\", \"description\": \"Looking for information on Pawsecuted? Check out the release date (Nov 1, 2022), developer insights from Poking Water Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Poking Water Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Poking Water Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1961060/header.jpg?t=1667339396\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}