{
    "AppID": 1648310,
    "Name": "Pillars Of Protection",
    "Release date": "Oct 21, 2022",
    "About the game": "Pillars of Protection is a team-based tower defense game. Towers can move and take on complex movement patterns over time. You can play online multiplayer in PvP or PvE modes. Build a base to protect your core from the onslaught of incoming monsters. Play as a shooter, melee, mover, or healing hero. Join or create a team to work synergistically to overcome the hoards of monsters. At the core, this game is a tower defense game where you must survive rounds of monsters. Towers can change location and you can define a position path for any tower to follow. You can strategically define paths and coordinate various towers to work systematically together. There are healing towers, stun turrets, defensive turrets, and boulders. Upgrade your towers to build a strong and powerful base to protect your core. If the core dies, then the game is over. Collect and farm points throughout the map to purchase tower upgrades, and equip various spells. The upgrade costs of a tower increases with each upgrade. Strategically choose which upgrades to apply. You will control a chosen hero from a Mover, Shooter, Healer, Entrepreneur, or Tank. The Entrepreneur is a vital hero to ensure that you gain enough points to build a powerful base. The Mover is great for crowd control, the Shooter for safely protecting your base, the Healer for surviving hoard rushes, and the Tank for taking out multiple nearby monsters. Heroes can purchase a large variety of spells. Spells such as healing spells, gestural-input spells, buff and debuff spells, melee spells, elemental/elemental-infusing spells, tower spells, monster-spawning spells, and tactical spells. Choose your spells carefully without sacrificing base upgrades. Elements play a key role in crowd control. You can ice monsters to slow them, splash monsters to reduce their movement friction and burn monsters to cause damage over time. Additionally, turrets can be infused with an elemental type if you attack them with a melee-infused elemental spell. The Shooter can infuse their bullets with elemental effects. There are two game modes; The PvE and PvP online multiplayer modes. The PvE mode consists of surviving rounds while you build a base and protect your core. The PvP mode is like the PvE except there are two teams and the team who can successfully destroy their opponent's core first wins. In PvP, there are monster-spawning towers that you can move and reposition so that your opponent’s base is attacked more. With every monster's death, they get stronger and stronger.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1648310/header.jpg?t=1666397524",
    "Price": 2.99,
    "Developers": "Garett A C Hunter",
    "Publishers": "Garett A C Hunter",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1648310/ss_6c4d4a32bfc3deafd5a5ab943482fede2ff5cce7.1920x1080.jpg?t=1666397524,https://cdn.akamai.steamstatic.com/steam/apps/1648310/ss_0e615ca15f4e4a8e577ecd6a504fb7680b8829be.1920x1080.jpg?t=1666397524,https://cdn.akamai.steamstatic.com/steam/apps/1648310/ss_a0db3000d27354ad5ce2928bb9557e197acaa058.1920x1080.jpg?t=1666397524,https://cdn.akamai.steamstatic.com/steam/apps/1648310/ss_a7ab30b32302c688f2dbbeb0ed06a0b7febf2fe2.1920x1080.jpg?t=1666397524,https://cdn.akamai.steamstatic.com/steam/apps/1648310/ss_f015c2fd57f4b5f7c0486962e9f28403dae06356.1920x1080.jpg?t=1666397524,https://cdn.akamai.steamstatic.com/steam/apps/1648310/ss_f780596b10349b2a8a43b6eb670fa3ccbcbfa31f.1920x1080.jpg?t=1666397524,https://cdn.akamai.steamstatic.com/steam/apps/1648310/ss_7b03472873125dc6aee0bcaa4973600d7e18eaed.1920x1080.jpg?t=1666397524,https://cdn.akamai.steamstatic.com/steam/apps/1648310/ss_28fb0511cd01d77c652721de455b05637336110f.1920x1080.jpg?t=1666397524",
    "Slug": "pillars-of-protection",
    "Meta Title": "Pillars Of Protection: Oct 21, 2022, Garett A C Hunter an...",
    "Meta Description": "Looking for information on Pillars Of Protection? Check out the release date (Oct 21, 2022), developer insights from Garett A C Hunter, and a complete g...",
    "Alt Text Image": "Official header image for Pillars Of Protection game - Steam 1648310",
    "Canonical URL": "https://gusku.site/game/pillars-of-protection",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pillars Of Protection\", \"description\": \"Looking for information on Pillars Of Protection? Check out the release date (Oct 21, 2022), developer insights from Garett A C Hunter, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Garett A C Hunter\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Garett A C Hunter\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1648310/header.jpg?t=1666397524\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}