{
    "AppID": 1599660,
    "Name": "Sackboy™: A Big Adventure",
    "Release date": "Oct 27, 2022",
    "About the game": "Go solo in an epic race against time stuffed with danger and peril – or create teams of two to four adventurers for fun-packed party play as you work together to overcome nefarious tasks however you can imagine. Can you save Craftworld from the dastardly Vex and his nightmarish Topsy Turver device… and become the Knitted Knight of legend? Exciting new PC features! Sackboy &lt;3 PC gaming! Craftworld’s top technicians have come up with a host of impressive graphical and performance-based gaming features so you can get the most fun possible out of this incredible adventure on your PC. Ooh pretty graphics! Quest through the colourful and crazy lands of Craftworld in stunning super-duper sharp 4K clarity*! Gasp in wonderment at beautifully detailed high-resolution images generated by NVIDIA Corporation’s groundbreaking Deep Learning Super Sampling tech – for NVIDIA® GeForce RTX® graphics cards or higher. Looking good, Sackboy! Wow, super-fast play! The dastardly Vex doesn’t take a break, so you need to be able to keep up with his mischievous plans. Leap into the fast and frantic action with enhanced frame rates, support for up to 120fps*, improved loading times on capable hardware, and variable refresh rates.** Take control! Save the day your way! Experience the deeply immersive haptic feedback and dynamic trigger effects designed specifically for Sackboy™: A Big Adventure by playing with the PlayStation®5 DualSense™ controller through a wired connection to your PC. You can also play with a wide range of other gamepads, or fully rebind all controls to your keyboard and mouse. Widescreen antics! Explore the heights and depths of Craftworld with a deeply immersive field of view through support for a 21:9 ultra-widescreen setup.* *Compatible PC and display device required. **HDMI 2.1 compatible display device required. The story so far… The dastardly Vex (a near-mythical being born of chaos and fear, no less) has kidnapped Sackboy’s friends and forced them to build his Topsy Turver. This most terrifyingly twisted device will transform Craftworld from a fantastical land of pure imagination and innocent dreams… into a torrid, barren eyesore of nightmares. Ooh the fiend! But legend tells of a prophecy from deep within the ancient order of the Knitted Knights, Craftworld’s legendary protectors. For only the brave, fearless, chivalrous and, yes, gallant can save the day in an almost too dramatic for words race against time stuffed with danger and peril. So much peril. Set off alone or with your bravest friends on a whirlwind of capers across the snowiest mountains, the leafiest jungles, the wettest underwater realms and the, uh, spaciest of space colonies. Take down Vex. Save the sack-folk. Save the day. It’s time to fulfil your destiny, Sackboy. From woolly wonderkid and hessian hero… rise our Knitted Knight. Perilous platforming experience. Explore here, there, and everywhere through distinctive hand-crafted lands across Craftworld. Utilise Sackboy’s cool, diverse move-set to face a huge variety of thrilling challenges, fierce enemies and startling surprises. You will never know what’s coming next in an awe-inspiring and downright fun epic adventure you’ll want to play again and again. And again. Collaborative, chaotic, and joyful multiplayer. Round up your favourite friends, family, and neighbours. This is going to get wild and woolly. Create teams of two to four adventurers and take on side-splitting challenges in local and online banter-packed party play that’ll have everyone in stitches. Parties can play through the whole game – including a number of co-op only levels – as you work together to overcome nefarious tasks however you can imagine, from ingenious squad tactics to pure dumb luck. Whatever it takes! Exploring by yourself is a jaw-dropping experience; but heading out on a journey of discovery with friends, family and neighbours is truly unforgettable. Re-stuffed. Re-stitched. Re-zipped. Sack it to me! Famed for his antics in the smash hit LittleBigPlanet™ series on PlayStation® consoles, Sackboy hits the big time on PC, stuffed with sweet moves and cool, game-changing gadgets. Hilarious, fearless, creative, and heroic. This is Sackboy unleashed – re-stuffed, re-stitched and re-zipped for a whole new generation of adventurers.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1599660/header.jpg?t=1666957067",
    "Price": 59.99,
    "Developers": "Sumo Digital",
    "Publishers": "PlayStation PC LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_ba7fd87730ca8e9397a9e31321230042c84d51fb.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_475f611dd457bb8800ec63f7df247c1b849f2693.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_f9da210d9b2d57f18e7450b6e3bcec01b117592b.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_690e52e5f8fc38fee8ca66ecfd9c181bd2334eca.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_314b1c79e6804d86e0c78529d8be48fef14b3567.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_5958a7ef3498c96585eb6ea99e3a1acdddb39913.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_b87611a0298d1d001c0bb37432bbf26920a0bcf3.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_41185d31926c4348e396f6261f54a387cc258929.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_3a025de9c08251355828fa538657509141c2b41f.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_dc1208940c1d392b7303ebd2a2307580ad39b831.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_30b04c7fc79460060a69d8b61dcaf62e1242e14a.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_b256d719ea00d0d6040bfadefb5c8a149224674d.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_cb5cf0191a853a6fc9e1710e30d71927f2fde4c2.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_411974039cfb81cdf139a34488506d0b7f8f362f.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_d44c91e4412a978daf0e275db123bb29b19879ec.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_b72aa0aeb0a4fc1b2fc1b3d7f467d9997fe99604.1920x1080.jpg?t=1666957067,https://cdn.akamai.steamstatic.com/steam/apps/1599660/ss_ba7d76942222222ce116f2f26c0c3790e15f41fe.1920x1080.jpg?t=1666957067",
    "Slug": "sackboy-a-big-adventure",
    "Meta Title": "Sackboy™: A Big Adventure: Oct 27, 2022, Sumo Digital and...",
    "Meta Description": "Looking for information on Sackboy™: A Big Adventure? Check out the release date (Oct 27, 2022), developer insights from Sumo Digital, and a complete ga...",
    "Alt Text Image": "Official header image for Sackboy™: A Big Adventure game - Steam 1599660",
    "Canonical URL": "https://gusku.site/game/sackboy-a-big-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sackboy\\u2122: A Big Adventure\", \"description\": \"Looking for information on Sackboy\\u2122: A Big Adventure? Check out the release date (Oct 27, 2022), developer insights from Sumo Digital, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sumo Digital\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PlayStation PC LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1599660/header.jpg?t=1666957067\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}