{
    "AppID": 2155090,
    "Name": "Secret Battle",
    "Release date": "Nov 11, 2022",
    "About the game": "Summary This game is a new round RPG of three elimination Specific play method: players use the mouse to draw lines to connect the same blocks and then eliminate them. The more connected, the higher the damage, and it is possible to synthesize new functional blocks! After passing the pass - the exquisite CG in the gallery will be unlocked! System A novel way to play 'Connect'+'Three Eliminations'+'Explosion'! Mild character intensity cultivation! 8-way DOF connection opens up your mind! And all kinds of exquisite CG! Click the same box with the mouse and drag, so that the more boxes it connects at one time, the better, and the higher the damage to the enemy! If you connect more than a certain number of blocks at one time, new blasting blocks will be generated! In the next connection, connect the blasting block with the ordinary block, and more elimination explosions will be generated! Reduce the enemy hp to 0 to pass!! After passing the pass, you will get gold coins and experience, and even unlock the exquisite CG rewards! In the information interface of level selection, you can spend gold coins to improve the character attributes, so that players can pass the following levels easily. Main plot This is a star that has just experienced Star Wars. A girl escaped to a desert island with a mysterious keepsake. At this moment, the world except the desert island is frozen. She must find nine other girls with keepsake like her within three days as soon as possible to unlock the mysterious power to defeat aliens and revive the planet. However, she found that she had just entered the desert island and was under the control of the evil spirit. She could not control her body, just like a crazy person who could only fight. The girl found that she could not continue the task. When she had no choice but to accept her fate, a hero fell from the sky Game objectives Players need to defeat 10 young girls controlled by heart demons, get the mysterious keepsake on the girl, gather the 10 keepsakes together to trigger the mysterious force, and finally defeat the aliens, revive the planet, and save all mankind. Set Mind Demon: In order to prevent girls from reviving the planet, aliens deliberately set mind demons to disturb girls' minds. Only by defeating girls, can girls get rid of mind demon control and continue the task. Huahua Planet: It is a small planet in the vast universe. It is targeted by aliens because of its rich resources. If aliens want to take away resources, they must kill all creatures on Huahua Planet. Desert Island: It is a very secret island. The living conditions on the island are poor, and wild animals often come and go. The island is filled with poison gas. With a mysterious token around, you can avoid the poison gas. Otherwise, you will die within three minutes after entering the island. It is the last defense line set by the ancestors to defend against the enemy.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2155090/header.jpg?t=1668158187",
    "Price": 2.09,
    "Developers": "SB pro",
    "Publishers": "SB CAmes",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2155090/ss_0de464f762eb501408ecedb951996f525d51f43f.1920x1080.jpg?t=1668158187,https://cdn.akamai.steamstatic.com/steam/apps/2155090/ss_70649216df4e9d9d2019b676576067b263932d04.1920x1080.jpg?t=1668158187,https://cdn.akamai.steamstatic.com/steam/apps/2155090/ss_d78339683cef8a47541fcbd8121a0fbd83b718f2.1920x1080.jpg?t=1668158187,https://cdn.akamai.steamstatic.com/steam/apps/2155090/ss_5b7eaf2a970d07e87a60be0670c0cc49126dd562.1920x1080.jpg?t=1668158187,https://cdn.akamai.steamstatic.com/steam/apps/2155090/ss_25983564178efc7e41360987f5b6ba632e2b0bc7.1920x1080.jpg?t=1668158187,https://cdn.akamai.steamstatic.com/steam/apps/2155090/ss_2840ce2e99c12829284b899dc5594559eb375835.1920x1080.jpg?t=1668158187",
    "Slug": "secret-battle",
    "Meta Title": "Secret Battle: Nov 11, 2022, SB pro and Full Overview",
    "Meta Description": "Looking for information on Secret Battle? Check out the release date (Nov 11, 2022), developer insights from SB pro, and a complete game summary.",
    "Alt Text Image": "Official header image for Secret Battle game - Steam 2155090",
    "Canonical URL": "https://gusku.site/game/secret-battle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Secret Battle\", \"description\": \"Looking for information on Secret Battle? Check out the release date (Nov 11, 2022), developer insights from SB pro, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"SB pro\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SB CAmes\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2155090/header.jpg?t=1668158187\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.09, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}