{
    "AppID": 2094480,
    "Name": "Senet",
    "Release date": "Nov 4, 2022",
    "About the game": "Board game from ancient Egypt, Senet is a turn-based strategy game meant for two players. Meaning “ The Game of Passing ”, and associated with spiritual and religious practices, Senet is one of the oldest racing games of humankind and was played by the Pharaohs themselves. In the Book of the Dead, Senet is used to play our destiny in the afterlife to access the kingdom of Osiris. Are you going to try yours? The game of Senet as you have never seen it before. Ancient Egypt was a land of advanced art and architecture. We committed ourselves to create the most beautiful and thrilling Senet video game ever made in 3D. You will be able to unlock and play several reproductions of genuine Senet boards currently in museums. Senet has two view modes . You can either play using a classic not moving top-view or a dynamic view following your ankh-shaped cursor. You can either play using your mouse or a gamepad , and even using the Steam Deck touchscreen (Senet is fully compatible with the Steam Deck despite not being currently reviewed by Valve). Choose between a single player mode where the opponent is played by the AI, and a local multiplayer mode to challenge your friends or family members. You will be able to play custom games, for example to play shorter games using 5 pieces instead of 7, and the small campaign unlocking the boards. The rules of this strategy based game are not complicated, and therefore easy to learn. This game has no reading required. Truly a game that is family friendly , Senet can be played with children as young as seven and still has the challenge to keep it interesting for adults too. This Senet version is using the well-known Kendall's rules The board consists of thirty squares (called houses) arranged in three rows of ten. You have seven pawns (it can be five on a custom game). Your aim is to ascent all your pawns from the board before your opponent, to access Sekhet-Aaru, the kingdom of Osiris, know as the Field of Reeds. To move a pawn, four throwsticks or two knucklebones are acting as dice. On a dice result of 1, 4 or 5, you get an extra throw . Each throw allows you to move a pawn by that value, so a turn can consist of several moves in any order. Only one pawn can stand in a house. You can only move a pawn to a vacant house unless the opponent pawn on that house is undefended. If a pawn occupies a house either before or behind another same kind of pawn, then both pawns are defended. Moving a pawn targeting an opponent undefended pawn will result of both pawns switching places, unless the targeted House is beyond the The House of Beauty, then the opponent pawn is sent back to The House of Water. Watch out for blockade and squares that send you tumbling back down the board! The House of Beauty , the 26th House, is a mandatory square. Each pawn has to stop by every time, you can't jump over that House. The House of Water , the 27th House, is acting like a Pitfall. You will mostly avoid to move a pawn here, but sometime you won't have the choice. If your pawn is on 27, your other pawns can't move and those pawns are not defended anymore. You can pass your turn and wait for a dice result of 4 in order to exit that pawn from the board from 27 (Select that pawn, cancel the move and then select the pawn again to pass your turn). You can choose to move that pawn to The House of Repeating Life, or any free House before it, if currently occupied by a Pawn. Doing so your turn ends despite the Dice values. The House of Three Judges, the House of Two Judges and the House of Horus, the 28th, 29th and 30th Houses: have the same rule. From those Houses, you have to do the right Dice Value to Exit the Board, so 3, 2 or 1. Senet was made as a way to celebrate the 100-year anniversary of the discovery of Tutankhamun's Tomb the 4th of November 1922. His tomb contained no less than four Senet boards. The boy king's treasures spurred renewed interest in Ancient Egypt, and after a centenary is still one of the most famous discoveries in modern archaeology. We aim to deliver our 1.0 version the 4th of November 2022.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2094480/header.jpg?t=1667570320",
    "Price": 9.99,
    "Developers": "Crinoid",
    "Publishers": "Crinoid",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2094480/ss_98ce33c8157a46df8b7d37056e40d843b59fa73d.1920x1080.jpg?t=1667570320,https://cdn.akamai.steamstatic.com/steam/apps/2094480/ss_250e9352b0ecf8a7936693f23c01b9e8a259b442.1920x1080.jpg?t=1667570320,https://cdn.akamai.steamstatic.com/steam/apps/2094480/ss_b45b0b3594fadcadaf5c8d80660ddc17f6bffae3.1920x1080.jpg?t=1667570320,https://cdn.akamai.steamstatic.com/steam/apps/2094480/ss_e87a2959a26cf35e90ccde7b9ee9e799adbe555a.1920x1080.jpg?t=1667570320,https://cdn.akamai.steamstatic.com/steam/apps/2094480/ss_4e9f788eb4b24b6a1fb18383141987990725eb99.1920x1080.jpg?t=1667570320,https://cdn.akamai.steamstatic.com/steam/apps/2094480/ss_8014761082bc50c17a6a209a915fd9d55a9e4048.1920x1080.jpg?t=1667570320,https://cdn.akamai.steamstatic.com/steam/apps/2094480/ss_42609c07c8b6527b3a8c26d5a621ea4a2daf7038.1920x1080.jpg?t=1667570320,https://cdn.akamai.steamstatic.com/steam/apps/2094480/ss_d59d8e81a1c951965258c5d2d4a8532542507caf.1920x1080.jpg?t=1667570320,https://cdn.akamai.steamstatic.com/steam/apps/2094480/ss_c2f2c8c0374c2b8d3549c70f302e3c57dcbc17c0.1920x1080.jpg?t=1667570320",
    "Slug": "senet",
    "Meta Title": "Senet: Nov 4, 2022, Crinoid and Full Overview",
    "Meta Description": "Looking for information on Senet? Check out the release date (Nov 4, 2022), developer insights from Crinoid, and a complete game summary.",
    "Alt Text Image": "Official header image for Senet game - Steam 2094480",
    "Canonical URL": "https://gusku.site/game/senet",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Senet\", \"description\": \"Looking for information on Senet? Check out the release date (Nov 4, 2022), developer insights from Crinoid, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crinoid\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crinoid\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2094480/header.jpg?t=1667570320\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}