{
    "AppID": 2127550,
    "Name": "Sherlock and Watson: A Study in Scarlet",
    "Release date": "Oct 31, 2022",
    "About the game": "IT TAKES TWO TO TANGO This is not another Sherlock Holmes game. This is a Sherlock and Watson game in which both roles are equally important. In order to play the game you’ll need a friend to play with. Most of the clues are split between Sherlock and Watson and the only way to get the full picture is to verbally communicate. You can use any source of communication such as Discord, Skype, WhatsApp, etc. In case you’re not patient enough to wait for your friend to play with you, join our Discord community to find your partner in solving the crime. GAME FEATURES CO-OP PUZZLE SOLVING - Feeling of success is even stronger when you can share it with someone. Communicating the clues to solve a puzzle is much more fun and bonds people together. SIMPLE CONTROLS - Point-and-click at its core. Explore the beautiful scenes, examine areas of interest, collect and manage inventory items, read through your journal, everything by using only the mouse or touchpad. “OLD BOOKS” VIBE - The point of the game is to immerse you in the book about one of the cases of Sherlock Holmes and Dr. Watson, but instead of reading it, you are an active participant. Therefore, the whole visual identity and the atmosphere breathe in the “old books” vibe. MYSTERY - The whole case is shrouded in a veil of mystery. As you progress through the game, you slowly reveal all the pieces of the story which is much larger than it seems at a first glance. STORY Inspired by the works of Arthur Conan Doyle, the game takes place in 19th century London and follows the 2 main protagonists, Sherlock Holmes and Dr. Watson, in their attempt to solve a mysterious murder. Early, rainy morning. It’s still pretty dark and things are going as usual in Whitechapel. This is the only part of a day when it’s quiet in this area of London, as most of its residents are sound asleep. Some of them are still resting for the hard working day ahead of them, while the others just got back to their beds after the night full of alcohol and sin. The sound of silence is broken by an exhausted horse, struggling to haul a heavy coach with Sherlock and Watson inside. Shortly before that, the famous detective and his loyal companion received a telegram from inspector Lestrade of the Scotland Yard, telling them to come as soon as possible to the given address in Whitechapel, where a peculiar murder took place. As they arrive at the murder scene in the victim’s house, the chief deputy informs them that the victim, a man in his 50s, was living there under the false identity. The killer, probably being aware of the victim’s real identity, took all the possible measures to hide the traces that may lead to the revelation who the unfortunate man really was. On top of that, the killer left a personal letter to Sherlock and Watson on the victim’s body. In the letter he calls them a fraud, expresses his superiority and challenges them to try to find out who the victim was by following subtle clues she (or he?) left them inside the house and around the neighborhood. From that moment Sherlock and Watson go separate ways and have to communicate in order to outsmart and imprison the overconfident killer, slowly revealing the true motive behind this murder.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2127550/header.jpg?t=1667248908",
    "Price": 4.99,
    "Developers": "Escape Pod",
    "Publishers": "Escape Pod",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2127550/ss_f908b609872dca846af1dc0d590cf37eec41c412.1920x1080.jpg?t=1667248908,https://cdn.akamai.steamstatic.com/steam/apps/2127550/ss_c8fba81b8489d25783479627206d7a0e8e4474f7.1920x1080.jpg?t=1667248908,https://cdn.akamai.steamstatic.com/steam/apps/2127550/ss_1cad8727af817781e6ddca86070bf27cdd7d2afa.1920x1080.jpg?t=1667248908,https://cdn.akamai.steamstatic.com/steam/apps/2127550/ss_81624bd96c1dbcb3f379df2ee76127136b06034a.1920x1080.jpg?t=1667248908,https://cdn.akamai.steamstatic.com/steam/apps/2127550/ss_b3408105aca4a4e425875d3b6ccd5ec6f0c0e00e.1920x1080.jpg?t=1667248908",
    "Slug": "sherlock-and-watson-a-study-in-scarlet",
    "Meta Title": "Sherlock and Watson: A Study in Scarlet: Oct 31, 2022, Es...",
    "Meta Description": "Looking for information on Sherlock and Watson: A Study in Scarlet? Check out the release date (Oct 31, 2022), developer insights from Escape Pod, and a...",
    "Alt Text Image": "Official header image for Sherlock and Watson: A Study in Scarlet game - Steam 2127550",
    "Canonical URL": "https://gusku.site/game/sherlock-and-watson-a-study-in-scarlet",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sherlock and Watson: A Study in Scarlet\", \"description\": \"Looking for information on Sherlock and Watson: A Study in Scarlet? Check out the release date (Oct 31, 2022), developer insights from Escape Pod, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Escape Pod\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Escape Pod\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2127550/header.jpg?t=1667248908\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}