{
    "AppID": 1975660,
    "Name": "Space Tail: Every Journey Leads Home",
    "Release date": "Nov 3, 2022",
    "About the game": "Space Tail is a 2.5D adventure platformer, which immerses the player in a deep, emotional plot, and lets him explore new planets and interact with alien civilizations. Every journey changes the point of view – it grows with the traveller. Our game tells a story about self-exploration, transformation and understanding the world around us. The plot of the game is inspired by real events, when people began their conquest of space by sending animals to the stars. We intended it to be a kind of a tribute to all the animals that paved the way for humans to go into space. Most of these animals - the first astronauts, did not survive the journey. Our story tells of the adventures of a dog named Bea, who... managed to beat the odds. Bea is a cheerful and courageous character, but the player must remember that she is just a... dog. She has all the characteristics of a mongrel - she barks, likes to chase her own tail, and learns about the world through her senses. Bea can sniff, listen and observe. These are the main mechanics of detective mode which will help her in exploring and understanding her environment. Bea travels through space discovering more planets. Each planet is different and has its specific inhabitants, who can either become friends of the main character or be very unfriendly towards her. We are convinced that exploring this amazing world together with Bea will give the player a lot of satisfaction and pleasure. Key Features: - Become an astronaut dog and experience an extraordinary space adventure - Follow your canine senses to traverse expansive levels and discover secrets hidden on wondrous planets - Communicate with extraterrestrials using a unique “dialogue system” relying solely on the dog’s body language: jump, wag your tail, bark, growl, etc. - Enlist the help of the space companions you meet along the way – a comet and a robot – and acquire new skills like double-jump and telekinesis to move heavy objects - Solve unusual and sophisticated logic puzzles - Test your agility by overcoming the dangers lurking on alien planets - Explore the intriguing and thought-provoking story of the universe - Immerse yourself in the stirring original soundtrack - Find the way home",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1975660/header.jpg?t=1667498362",
    "Price": 15.99,
    "Developers": "Enjoy Studio S.A.,Longterm Games S.A.",
    "Publishers": "Longterm Games S.A.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1975660/ss_b9bdf79891f5ae6f09798a3224cefde4b8e7a98b.1920x1080.jpg?t=1667498362,https://cdn.akamai.steamstatic.com/steam/apps/1975660/ss_734f74d784baa032ef386d39e3a757a5eeda8407.1920x1080.jpg?t=1667498362,https://cdn.akamai.steamstatic.com/steam/apps/1975660/ss_0cbced7e508dc6312df9514f847ed22284c853a5.1920x1080.jpg?t=1667498362,https://cdn.akamai.steamstatic.com/steam/apps/1975660/ss_6aa9c54ec3a807df1bf4d756e476016e0d83fa83.1920x1080.jpg?t=1667498362,https://cdn.akamai.steamstatic.com/steam/apps/1975660/ss_f390990fd536cbc74073332d6a945f835d1485ec.1920x1080.jpg?t=1667498362,https://cdn.akamai.steamstatic.com/steam/apps/1975660/ss_84d3b7e20623f074e097473a9076c63cb33ffd66.1920x1080.jpg?t=1667498362",
    "Slug": "space-tail-every-journey-leads-home",
    "Meta Title": "Space Tail: Every Journey Leads Home: Nov 3, 2022, Enjoy ...",
    "Meta Description": "Looking for information on Space Tail: Every Journey Leads Home? Check out the release date (Nov 3, 2022), developer insights from Enjoy Studio S.A.,Lon...",
    "Alt Text Image": "Official header image for Space Tail: Every Journey Leads Home game - Steam 1975660",
    "Canonical URL": "https://gusku.site/game/space-tail-every-journey-leads-home",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Space Tail: Every Journey Leads Home\", \"description\": \"Looking for information on Space Tail: Every Journey Leads Home? Check out the release date (Nov 3, 2022), developer insights from Enjoy Studio S.A.,Lon...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Enjoy Studio S.A.,Longterm Games S.A.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Longterm Games S.A.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1975660/header.jpg?t=1667498362\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}