{
    "AppID": 1915240,
    "Name": "Sparkle Milla: Eight Genetic Abnormalities and a Blood Ghost",
    "Release date": "Oct 27, 2022",
    "About the game": "'Sparkle Milla: Eight Genetic Abnormalities and a Blood Ghost' is a deduction game where you collect evidence from a murder scene to find the killer. However, unlike ordinary cases, the characters have special abilities. Your guesses won't be as straightforward as they seem. Together with the game's protagonist, let's do our best to solve the case and find the culprit. STORY Michel, a young boy in a red coat who can't remember a thing, is suddenly caught in a tornado one day. Afterwards, he woke up with the ability to remember everything he saw and heard. A test at the hospital revealed that it was a genetic abnormality and his symptoms were caused by it. In the country where he lives, children with genetic abnormalities are required to enroll in a certain school. The school is called Westwood Middle School. Michelle was to be enrolled there. Despite his anxiety, Michel passes through the school's main gate. But at that moment, he loses consciousness. When he woke up, the main gate was closed and there was not a single person to be seen outside the school. There should have been a lot of people there a while ago. Michel decided to go inside the school, found his classmates in the classroom who were also genetically abnormal. Apparently, they too had some unusual 'symptoms'. CHARACTERS Michel The main character. A somewhat timid boy with a sense of justice. Symptom: 'Memorize'. Able to completely memorize everything he sees and hears. Chizuru A sickly but cheerful girl. Symptom: 'Venom'. Can produce a dangerous deadly poison with just a touch from his hand. Rolly A short boy with a big appetite. Symptom: 'Luminate'. He can make his whole body glow. In return, he burns calories and gets hungry. Alberta A very reliable and dependable person. Former military woman. She was trained at a military institution. Symptom: None. Because of her exceptional physical abilities, the educational institution decided that it would be better for her to go to a school for people with genetic abnormalities rather than a regular school. Amano A student with a scary face and eyes. The tone of voice is also scary, but the personality is normal. Symptom: 'Tsukumogami'. Able to read the emotions and obsessions that are ingrained in objects. He can also find out the past of the object. Elizaveta A maid with a very polite tone. She used to work as a servant in a mansion, but was forced to come to this school when her genetic abnormality was discovered. She wants to go home as soon as possible. Symptom: 'Electrica'. Able to generate and manipulate static electricity. Samuel A boy who talks like a lady. Likes to dress up. Has experience as a make-up instructor as a child. Symptom: 'Masking'. Can disguise himself as any human face or body. Sherry The first girl that Michelle met. She has a mature tone and a cold personality. She is wearing a white coat and a red sweater. Symptom: 'I don't know.' According to her, she forgot what her symptoms were. About the Blood Ghost 'Milla' At Westwood Middle School, there is a murderous ghost named Milla who haunts and kills people. Milla possesses students and kills one of them by pretending to be that person. Michel and his friends must gather evidence, argue, and find out who is possessed by Mira. How to play the game As the game progresses and the story progresses, someone will die. Examine that person's body and the objects around them to collect evidence. Michel has a symptom called 'Memorize', so you can check the evidence at any time by recalling it. Once you've finished collecting evidence, it's time to start the 'discussion' to find out who is possessed by the murderous ghost, Milla. Use the memorize you have collected to advance the discussion and find out who the killer is.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1915240/header.jpg?t=1667013980",
    "Price": 14.99,
    "Developers": "Reijo",
    "Publishers": "Reijo",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1915240/ss_fc441f50bfb2a203c3c853abd2ff58995d486cbf.1920x1080.jpg?t=1667013980,https://cdn.akamai.steamstatic.com/steam/apps/1915240/ss_3b9584e04eac3c68a88135616fa2e914b053bc9e.1920x1080.jpg?t=1667013980,https://cdn.akamai.steamstatic.com/steam/apps/1915240/ss_5646fa48fbc351b094fefcd87dcef1c115ffbebd.1920x1080.jpg?t=1667013980,https://cdn.akamai.steamstatic.com/steam/apps/1915240/ss_c00cf8af59923099dbe337a3beb0236c499e4f03.1920x1080.jpg?t=1667013980,https://cdn.akamai.steamstatic.com/steam/apps/1915240/ss_7cd44a1f16e1721e5da61eeb517ea738049b1172.1920x1080.jpg?t=1667013980,https://cdn.akamai.steamstatic.com/steam/apps/1915240/ss_5ff15cf58059034a800a99b9f89936a43592219a.1920x1080.jpg?t=1667013980,https://cdn.akamai.steamstatic.com/steam/apps/1915240/ss_d7c6ade2d101c62d5a99dd5d603d93373edec1ad.1920x1080.jpg?t=1667013980,https://cdn.akamai.steamstatic.com/steam/apps/1915240/ss_306766dddb496d025b0e555e760073530aaf3ded.1920x1080.jpg?t=1667013980",
    "Slug": "sparkle-milla-eight-genetic-abnormalities-and-a-blood-ghost",
    "Meta Title": "Sparkle Milla: Eight Genetic Abnormalities and a Blood Gh...",
    "Meta Description": "Looking for information on Sparkle Milla: Eight Genetic Abnormalities and a Blood Ghost? Check out the release date (Oct 27, 2022), developer insights f...",
    "Alt Text Image": "Official header image for Sparkle Milla: Eight Genetic Abnormalities and a Blood Ghost game - Steam 1915240",
    "Canonical URL": "https://gusku.site/game/sparkle-milla-eight-genetic-abnormalities-and-a-blood-ghost",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sparkle Milla: Eight Genetic Abnormalities and a Blood Ghost\", \"description\": \"Looking for information on Sparkle Milla: Eight Genetic Abnormalities and a Blood Ghost? Check out the release date (Oct 27, 2022), developer insights f...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Reijo\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Reijo\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1915240/header.jpg?t=1667013980\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}