{
    "AppID": 2121680,
    "Name": "Steamcore",
    "Release date": "Nov 1, 2022",
    "About the game": "Steamcore is an always-on, massive multiplayer PvPvE shooter, in which you play as a mercenary prospector trying to capture and collect resources on tiny planets, battling corrupted robots and other players to survive. Git Gud, Go Pro in the World's First Play-To-Partner Game Steamcore uses the Echelon System from November Games to reward high-level play with increased viewership on Twitch.tv. The better you are at Steamcore, the more you grow on Twitch, it's that simple. If you've ever fancied a career as a content creator or professional gamer, Play-To-Partner is your chance to make that happen. Simply launch the game and the accompanying rewards dashboard to start earning in-game rewards and seeing your Twitch channel viewers rise alongside your leaderboard position. We take care of everything, you just frag out and we handle the rest. Play Style Steamcore has endless replayability, as it is an always-on game that puts players on even-footing every respawn. Drop into action with zero queue times or matchmaking, and get into the action quickly. Players of other third person shooters, battle royales, or loot and shoot survival games will find the controls, aiming, and smooth animation has been fine-tuned to deliver a high-quality experience tailored towards great multiplayer combat with a huge skill cap. Upgrade Weapons, Skills, and More As you destroy robots and defeat other players, you earn skill points that can be spent on a skill tree, making each run a new choice for a different play-style. One run you could prioritize health and shield, giving you the advantage in drawn-out fights against high DPS weapons. Another run, spend all your skill points on your player Boiler, allowing for triple jump, dash boosts, and deploying invulnerability. The bottom line is the game gives YOU the choice of how you'd like to play, and rewards those who experiment with different weapons and abilities. Game Loop Players spawn on their home planet representing their Twitch channel, where they can create a base and construct reinforcements. Then, venture out into space and find another planet owned by another player where a battle has ensued for control of the Generator - a machine constructed over the Fyridium vent that periodically produces 'Steamcores'. These resources are vital to your success in the game. Collect as many as you can while surviving waves of corrupted robots, and other players. Run them back to your home planet by warping home at the flag icon, and deposit the Steamcores in your home base. Doing so will reward you with points, and send you climbing up the leaderboard. Content Updates Each season, a new planet type will be released giving players new obstacles to overcome and barriers to use in combat. We also will release timed cosmetics that will be paired to the season, as well as change weapon loadouts that players can choose from in the game. An ever-shifting meta keeps the game fresh, and allows all manners of play style to succeed. Twitch Integration Servers passively integrate activity from the Twitch channel's of players who play Steamcore while streaming. This means that the chat can get involved with hidden commands, as well as change the course of the battle whenever major actions are taken on the site. Find out more about which actions are integrated by joining the playtests and seeing for yourself.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2121680/header.jpg?t=1667317890",
    "Price": 0.0,
    "Developers": "November Games",
    "Publishers": "November Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2121680/ss_bcba547b6d75eec884e44018d8b59b3eb9fdf4ed.1920x1080.jpg?t=1667317890,https://cdn.akamai.steamstatic.com/steam/apps/2121680/ss_800c251007a93a1165d4cb837cc8c4ae693ed46b.1920x1080.jpg?t=1667317890,https://cdn.akamai.steamstatic.com/steam/apps/2121680/ss_d2cea3ebc537c561923612661c386cc3bdf5b24c.1920x1080.jpg?t=1667317890,https://cdn.akamai.steamstatic.com/steam/apps/2121680/ss_e76226ab1bd09f9dc4fef45bc89df38e91853ce8.1920x1080.jpg?t=1667317890,https://cdn.akamai.steamstatic.com/steam/apps/2121680/ss_be6096e4491a9b7eecd0162efdef554abc367252.1920x1080.jpg?t=1667317890",
    "Slug": "steamcore",
    "Meta Title": "Steamcore: Nov 1, 2022, November Games and Full Overview",
    "Meta Description": "Looking for information on Steamcore? Check out the release date (Nov 1, 2022), developer insights from November Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Steamcore game - Steam 2121680",
    "Canonical URL": "https://gusku.site/game/steamcore",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Steamcore\", \"description\": \"Looking for information on Steamcore? Check out the release date (Nov 1, 2022), developer insights from November Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"November Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"November Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2121680/header.jpg?t=1667317890\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}