{
    "AppID": 1451090,
    "Name": "Tactics Ogre: Reborn",
    "Release date": "Nov 11, 2022",
    "About the game": "Tactics Ogre, crown jewel of the tactical role-playing genre, is reborn! Based on the 2010 release, the game features improved graphics and sound, as well as updated game design, bringing to life a new Tactics Ogre that remains true to its roots. Tactics Ogre veterans will experience a game that surpasses their fondest memories, while players new to Tactics Ogre will discover a game unlike any they've ever played. Reborn and deeper than ever, the game enables players to immerse themselves in the world and intrigue of Tactics Ogre like never before. The Story The Valerian Isles, jewels of the Obero Sea. Long a center of naval commerce, the people of the isles struggled throughout history for dominion over her shores. Finally there rose a man to put an end to this conflict: Dorgalua Oberyth. But history would know him as the 'Dynast-King.' King Dorgalua strove to stamp out the hatred among the people of the isles, and for fully half a century, Valeria knew prosperity. Yet upon the king's death, civil war erupted anew as three factions vied for control: the Bakram, who comprised much of Valeria's nobility; the Galgastani, whose people made up the majority of the isles' population; and the Walister, who numbered but few. The isles were soon divided between the Bakram and Galgastani, and an uneasy peace settled across the land. Yet none believed the calm would last... Tactics Ogre: Reborn Features Your choices affect how the story unfolds, and even how it ends, with a game system that allows for multiple paths through the game and multiple endings. The story takes place through the eyes of a young man named Denam. The decisions he makes will alter the fate of those around him, and shift the course of Valeria's history. Fight pitched tactical battles on three-dimensional battlefields. The completely revamped AI enables enemies to adapt their tactics to the situation, providing a battle system that always keeps you thinking and never grows old. The class-wide level management system used in Tactics Ogre (2010) has changed to a unit-by-unit level system. Theorycraft your way through endless combinations of classes, equipment, skills, and magic. Enjoy numerous playability improvements, such as a quicker pace of battle, auto save, and a complete overhaul to the controls and UI to make it easier to get into the game than ever. The unparalleled details of the characters and backgrounds from the original Tactics Ogre (1995) have been recreated in high definition, while the detailed pixel art that gives the game its unique feel has been preserved and enhanced. The cutscenes are fully voiced in English and Japanese, and all of the music has been rerecorded with live performances! The voices bring new life to the complex motivations of the characters that make up the factions and shifting political alliances of this epic story. When you advance far enough in the game you'll unlock the World Tarot, enabling you to travel back in the story with the power of your forces intact; an incredibly useful feature in a game where your choices have such a huge impact on how the story unfolds. If you wonder what a different choice would have led to, now you can find out! Traveling back isn't limited to the story; the Chariot Tarot lets you rewind up to a certain number of moves during battle. In a game of tactical battles where a single mistake can mean the difference between victory and defeat, you can play without worrying that you'll back yourself into a corner. Enjoy a wealth of endgame content such as the 100-level Palace of the Dead. A world of endless stories and intrigue awaits!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1451090/header.jpg?t=1668201917",
    "Price": 49.99,
    "Developers": "Square Enix",
    "Publishers": "Square Enix",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1451090/ss_1e6d95aea4292f591c408a4d403ef65f907f94fe.1920x1080.jpg?t=1668201917,https://cdn.akamai.steamstatic.com/steam/apps/1451090/ss_c05515200bdf1e50314f4dc76f1008ffdbd19d8e.1920x1080.jpg?t=1668201917,https://cdn.akamai.steamstatic.com/steam/apps/1451090/ss_399b976817400a4ff98dcc7e3b59bff25608093d.1920x1080.jpg?t=1668201917,https://cdn.akamai.steamstatic.com/steam/apps/1451090/ss_549ae5aec75bccd7e1ed242ae8d7c6dde28dc102.1920x1080.jpg?t=1668201917,https://cdn.akamai.steamstatic.com/steam/apps/1451090/ss_9d77277aa21cb6e923eb88127775b383673e3257.1920x1080.jpg?t=1668201917,https://cdn.akamai.steamstatic.com/steam/apps/1451090/ss_ac51cdafd39372596a9b0e317f3c17b1a08d2940.1920x1080.jpg?t=1668201917,https://cdn.akamai.steamstatic.com/steam/apps/1451090/ss_e19996ae0f63d3bbbe4c55d5abac80b4b8933cc6.1920x1080.jpg?t=1668201917,https://cdn.akamai.steamstatic.com/steam/apps/1451090/ss_f0bec28c1981620229392dddce756caae59e6636.1920x1080.jpg?t=1668201917,https://cdn.akamai.steamstatic.com/steam/apps/1451090/ss_6cb95e86684a9cddb39097637f713a56a6a0878d.1920x1080.jpg?t=1668201917,https://cdn.akamai.steamstatic.com/steam/apps/1451090/ss_dec81b0f97e4204303684ebc771f92219bcd4aaa.1920x1080.jpg?t=1668201917",
    "Slug": "tactics-ogre-reborn",
    "Meta Title": "Tactics Ogre: Reborn: Nov 11, 2022, Square Enix and Full ...",
    "Meta Description": "Looking for information on Tactics Ogre: Reborn? Check out the release date (Nov 11, 2022), developer insights from Square Enix, and a complete game sum...",
    "Alt Text Image": "Official header image for Tactics Ogre: Reborn game - Steam 1451090",
    "Canonical URL": "https://gusku.site/game/tactics-ogre-reborn",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tactics Ogre: Reborn\", \"description\": \"Looking for information on Tactics Ogre: Reborn? Check out the release date (Nov 11, 2022), developer insights from Square Enix, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Square Enix\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Square Enix\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1451090/header.jpg?t=1668201917\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}