{
    "AppID": 986040,
    "Name": "The Unliving",
    "Release date": "Nov 7, 2022",
    "About the game": "The realm of the living has been corrupted to its core and a storm is coming to change the world order. This storm is you, a mighty Necromancer, a sorcerer who denies death and leads the legions of the dead. Clerics and lords hope to hide behind high walls, but there’s no stronghold to cover them from your wrath. Smite hundreds of those standing in your way and turn them into your tools on the way to a greater purpose. The Unliving is a dynamic rogue-lite action RPG with strategic elements. Raise the undead, use numerous spells and explore a mystical world, all realised with darkly extravagant pixel-art. TURN ENEMIES INTO YOUR UNDEAD ARMY Each fallen foe can be resurrected and added to your army to create unlimited legions of the dead. These re-animated creatures have their own unique abilities, such as the undead Priest whose blessings in life, will now curse your enemies in death. UNLOCK THE SECRETS OF NECROMANCY Meet colorful characters - friends and foes alike. Question members of your own necromantic cult, force answers out of your enemies and even dialogue your own phylacterium - to gather the lost memories of the Necromancer piece by piece and reveal the nature of his immortality. Who knows, may be you also find out the grim truth about the supreme hierarchies of the Church. CRUSH EVERYONE IN YOUR WAY Only some of the living are helpless victims, the rest can retaliate against your forces. They hold the line, move in large groups and wield powerful abilities too. They cherish their lives and will not fall easily, so unleash hell as the Undead Lord to bring them to their knees. CONQUER UNCHARTED LANDS The world is randomly generated for each run and is richly populated with an array of creatures, artefacts, secret rooms and deadly traps. Each part of the world is occupied by a variety of living inhabitants - invade villages and slay feeble peasants to reinforce your army or engage in a desperate fight to the death in the swamps against formidable foes. BATTLE EPIC BOSSES The powerful creatures of this shadowy world will do all they can to stop you. Each boss has a unique fighting style and set of abilities, meaning deftness in combat and strategic thinking will be crucial in emerging victorious from these grueling encounters. DIE AND RISE AGAIN The ability to deny death itself is the greatest secret of the Necromancer. Another mortal strike is merely a setback for him. Take a lesson from your death and don’t let your enemies catch you the same way twice.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/986040/header.jpg?t=1667847223",
    "Price": 15.29,
    "Developers": "RocketBrush Studio",
    "Publishers": "Team17 Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/986040/ss_05ff12ecf648bf40154882d787e58a12468d9f05.1920x1080.jpg?t=1667847223,https://cdn.akamai.steamstatic.com/steam/apps/986040/ss_451bbc925c811c20bb0e0f4538cb78d74ea55024.1920x1080.jpg?t=1667847223,https://cdn.akamai.steamstatic.com/steam/apps/986040/ss_c52c8a7518cc6ab5822c75cc53a4d6adba0e443f.1920x1080.jpg?t=1667847223,https://cdn.akamai.steamstatic.com/steam/apps/986040/ss_d2ce1e5e3c3c997e6f75fc795b793197ab909dd8.1920x1080.jpg?t=1667847223,https://cdn.akamai.steamstatic.com/steam/apps/986040/ss_ff2769e9f7cff1889b8a83a790a1c4a6b18f69cf.1920x1080.jpg?t=1667847223,https://cdn.akamai.steamstatic.com/steam/apps/986040/ss_8855e59c014324ae5a70b5cb5098962b05b9ebc2.1920x1080.jpg?t=1667847223,https://cdn.akamai.steamstatic.com/steam/apps/986040/ss_aa552f6096acf49315049284dcab05fa0d8e1b58.1920x1080.jpg?t=1667847223,https://cdn.akamai.steamstatic.com/steam/apps/986040/ss_05b164012951b9d40134d6c9dd3e3fe81ae274cf.1920x1080.jpg?t=1667847223,https://cdn.akamai.steamstatic.com/steam/apps/986040/ss_97dd627e718fdb6c17ddba28423ef4021aaeeaa9.1920x1080.jpg?t=1667847223",
    "Slug": "the-unliving",
    "Meta Title": "The Unliving: Nov 7, 2022, RocketBrush Studio and Full Ov...",
    "Meta Description": "Looking for information on The Unliving? Check out the release date (Nov 7, 2022), developer insights from RocketBrush Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for The Unliving game - Steam 986040",
    "Canonical URL": "https://gusku.site/game/the-unliving",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Unliving\", \"description\": \"Looking for information on The Unliving? Check out the release date (Nov 7, 2022), developer insights from RocketBrush Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"RocketBrush Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Team17 Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/986040/header.jpg?t=1667847223\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.29, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}