{
    "AppID": 2064650,
    "Name": "Tower of Fantasy",
    "Release date": "Oct 19, 2022",
    "About the game": "Version 2.0 'Vera' is now available! Play now to venture into the unknown and forge your cyberpunk destiny together! 1. New Map: Vera The dangerous Land of Sand where the Grayspace Entities, Abyssants, and the charming cyberpunk city, Mirroria, are waiting for your exploration. 2. New Simulacrum/Matrix: Ruby is here The all-new Ruby (Flame, Attack) is here, accompanied by Spark, the powerful weapon to take on a new adventure with us. Unlock the limited Matrix: Ruby to experience the unique mastery mechanism for the offense and defense. 3. New Story 'Land of Sand' The unsolved puzzles hidden behind Ruby's cheerful and innocent face, the link between the machinery puppet's rebellion and mysterious Abyssant...Conspiracies beneath the sands are to be uncovered. 4. New Challenges &amp; Level Cap The all-new instances, Joint Operation: The End Game and Joint Operation: Sadness Valley, are now available. The level's cap is increased to 80. Become an even stronger Executor using the new unlocked combat engine. 5. New Events &amp; Rewards: Claim red nucleus for free Log in to participate in the Vera Supply Run event, Mirroria Tour, and more. Claim red nucleus, premium equipment, and stylish extrinsic rewards! In Tower of Fantasy, dwindling resources and a lack of energy have forced mankind to leave earth and migrate to Aida, a lush and habitable alien world. There, they observed the comet Mara and discovered an unknown but powerful energy called 'Omnium' contained in it. They built the Omnium Tower to capture Mara, but due to the influence of Omnium radiation, a catastrophic disaster occurred on their new homeworld. Immersive Open-World Experience a vast alien world full of beautiful open vistas and imposing futuristic structures. Unique Characters Wield the unique weapons of each character that grant different gameplay styles as you explore their compelling backstories. Grow and Explore Together Party up with friends online and take on new adventures in the shared open world. Epic Combat Engage in epic battles against enemies of all shapes and sizes as you switch weapons and gameplay styles on the fly to unlock your own personal fighting style. Explore and Interact Explore and interact with a vibrant living world as you discover your own journey through it. To learn more about Tower of Fantasy, go to -global.com or check out our other official channels: Facebook: Instagram: /@toweroffantasy_official Twitter: YouTube: -pV94mu_A/about Discord:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2064650/header.jpg?t=1666346778",
    "Price": 0.0,
    "Developers": "Hotta Studio",
    "Publishers": "Level Infinite",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2064650/ss_fbbf60f934d267f86c8a26e7e97655803d831566.1920x1080.jpg?t=1666346778,https://cdn.akamai.steamstatic.com/steam/apps/2064650/ss_9f1f64bfe3040773990b05d2f9d0b26a106ee239.1920x1080.jpg?t=1666346778,https://cdn.akamai.steamstatic.com/steam/apps/2064650/ss_50d4ad99157621e1ffaafe0c575a31665afed4c5.1920x1080.jpg?t=1666346778,https://cdn.akamai.steamstatic.com/steam/apps/2064650/ss_168c37b14e049c83a6529a7359fecfe6dbba09ab.1920x1080.jpg?t=1666346778,https://cdn.akamai.steamstatic.com/steam/apps/2064650/ss_98bfcf0d8afd9df35c430caa3397e828b8fdfbbc.1920x1080.jpg?t=1666346778",
    "Slug": "tower-of-fantasy",
    "Meta Title": "Tower of Fantasy: Oct 19, 2022, Hotta Studio and Full Ove...",
    "Meta Description": "Looking for information on Tower of Fantasy? Check out the release date (Oct 19, 2022), developer insights from Hotta Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Tower of Fantasy game - Steam 2064650",
    "Canonical URL": "https://gusku.site/game/tower-of-fantasy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tower of Fantasy\", \"description\": \"Looking for information on Tower of Fantasy? Check out the release date (Oct 19, 2022), developer insights from Hotta Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hotta Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Level Infinite\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2064650/header.jpg?t=1666346778\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}