{
    "AppID": 2119490,
    "Name": "TRAHA Global",
    "Release date": "Nov 1, 2022",
    "About the game": "Traha Global is RvR MMORPG based on the confrontation between two major factions. - An open world on a massive scale. Experience the vast open world with the highest quality graphics using the Unreal 4 Engine. Based on the launch version, there are 6 large open fields with an actual size of 3 to 5KM - Massive Battle based on RvR Led by the two major factions, Naiad and Vulcan, which have been in conflict for a long time, players must compete with their opponents on battlegrounds by cooperating with their teammates. - Infinity Class System The seven available classes are the Scythe, Bow, Greatsword, Shield, Staff, Dual Blade, and Knuckles. You can switch classes anytime and anywhere. In addition, combining the effects of attack, defense, or support skill tree attributes with a variety of active skills allows you to act as a tank, damage dealer, or healer. You can activate additional skill effects through triggers such as charging, holding, or timing skills to maximize your character’s power. Whether in the open field, dungeons, or in PvP/RvR instances, players will be tested on their understanding of their classes and skills through combat with their opponents. - Raids and Dungeons to Explore Raid dungeons featuring powerful monsters test the cooperation and strategy of players. Players should analyze the mechanics of boss monsters and come up with strategies accordingly. If you succeed in defeating the boss monster, high-level rewards will be waiting for you! - Variety of PvP/RvR content You can show off your individual battle skills in the 1v1 arena, Battlefield, Conquest Battles, Sieges, and Territorial Battles, where large-scale wars take place. These will test the power and unity of the players in their factions. Above all, Conquest Battles, which are held on a scale of 100 vs 100 and give buff rewards only to the winning side, are a showdown that must be won not only for the rewards, but for the pride of the faction. - Crafting Items with various Professions You can craft items and cook foods with ingredients you get from using professions like Gathering, Fishing, etc. Crafted items will provide helpful enhancements and buffs to the Traha and are essential in PvE/PvP/RvR battles.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2119490/header.jpg?t=1667354430",
    "Price": 0.0,
    "Developers": "MOAI GAMES Corporation",
    "Publishers": "MOAI GAMES Corporation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2119490/ss_5ea4d33fd95ac5a6108edf73dd98940973e87678.1920x1080.jpg?t=1667354430,https://cdn.akamai.steamstatic.com/steam/apps/2119490/ss_bb2fa68564fbf8d83b0594bbb3eae426d82ea26e.1920x1080.jpg?t=1667354430,https://cdn.akamai.steamstatic.com/steam/apps/2119490/ss_38e4e20e53a2976caa5645314b08b4e926b186f1.1920x1080.jpg?t=1667354430,https://cdn.akamai.steamstatic.com/steam/apps/2119490/ss_bfc36059692a1b030843edf399205995f9ff9571.1920x1080.jpg?t=1667354430,https://cdn.akamai.steamstatic.com/steam/apps/2119490/ss_c86d2453f30f28f0513d1615a2087266a800bd94.1920x1080.jpg?t=1667354430",
    "Slug": "traha-global",
    "Meta Title": "TRAHA Global: Nov 1, 2022, MOAI GAMES Corporation and Ful...",
    "Meta Description": "Looking for information on TRAHA Global? Check out the release date (Nov 1, 2022), developer insights from MOAI GAMES Corporation, and a complete game s...",
    "Alt Text Image": "Official header image for TRAHA Global game - Steam 2119490",
    "Canonical URL": "https://gusku.site/game/traha-global",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TRAHA Global\", \"description\": \"Looking for information on TRAHA Global? Check out the release date (Nov 1, 2022), developer insights from MOAI GAMES Corporation, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"MOAI GAMES Corporation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MOAI GAMES Corporation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2119490/header.jpg?t=1667354430\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}