{
    "AppID": 2199410,
    "Name": "Transcendence",
    "Release date": "Dec 31, 2023",
    "About the game": "Intro: This is a game fusion of, platform , Puzzle .You will play a small robot through the broken city. Game play This game is a linear process. Players need to use jumping, two-way movement, boxes and other props to break down the obstacles on the way. The game is divided into five scenes: the street on the ground floor, buildings, the middle city, factories, and outside the city. New game elements are added in different scenes. You need to pay attention to the eyes of military surveillance robots when walking through buildings. In the factory, you need to be aware of the mechanical mice that are scattered and clustered, The picture of the game has a strong tension. You can enjoy the depressing atmosphere of the end of the world and the weird beauty of Cyberpunk when you play. StoryLine The main character is a commercial intelligent robot of the early generation, who once served in the home of a brain neuroscientist and was closely related to his son. At the beginning of the war, he tried to put his nerve into the network to escape in order to save his family's life, but unfortunately he died. The boy's consciousness in the experiment was trapped in the neural network of the home robot by chance. The machine was abandoned and cleared away. Many years later, the robot in the garbage was awakened by unknown signals, and it embarked on the road to find itself Background story: This is a story about a small robot. As the first generation of commercial intelligent robot, it once served a brain neuroscientist. At the beginning of the war, in order to save the lives of his family, he tried to transfer his nerve into the network to avoid, but was unfortunately killed. In the experiment, the boy's consciousness remained in the neural network of the domestic robot by chance. The machine was abandoned and cleared. Many years later, the robot in the garbage was awakened by unknown signals. It embarked on the road of finding who he is.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2199410/header.jpg?t=1667549737",
    "Price": 0.0,
    "Developers": "烧糊梦工厂",
    "Publishers": "烧糊梦工厂",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2199410/ss_190b2bf64c2de75c595655f95d16f67478450c0e.1920x1080.jpg?t=1667549737,https://cdn.akamai.steamstatic.com/steam/apps/2199410/ss_367edfc55910b781d787b8ba4b38a634ca6325bb.1920x1080.jpg?t=1667549737,https://cdn.akamai.steamstatic.com/steam/apps/2199410/ss_59cf93fc262e5ab01162512408bc618daea19fca.1920x1080.jpg?t=1667549737,https://cdn.akamai.steamstatic.com/steam/apps/2199410/ss_95b16ca6213f0fe9f375a3dc575cdf4ca3667dbb.1920x1080.jpg?t=1667549737,https://cdn.akamai.steamstatic.com/steam/apps/2199410/ss_cc10a3e02bba8fd9a991d22547a6257461237260.1920x1080.jpg?t=1667549737",
    "Slug": "transcendence",
    "Meta Title": "Transcendence: Dec 31, 2023, 烧糊梦工厂 and Full Overview",
    "Meta Description": "Looking for information on Transcendence? Check out the release date (Dec 31, 2023), developer insights from 烧糊梦工厂, and a complete game summary.",
    "Alt Text Image": "Official header image for Transcendence game - Steam 2199410",
    "Canonical URL": "https://gusku.site/game/transcendence",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Transcendence\", \"description\": \"Looking for information on Transcendence? Check out the release date (Dec 31, 2023), developer insights from \\u70e7\\u7cca\\u68a6\\u5de5\\u5382, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u70e7\\u7cca\\u68a6\\u5de5\\u5382\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u70e7\\u7cca\\u68a6\\u5de5\\u5382\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2199410/header.jpg?t=1667549737\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}