{
    "AppID": 2070990,
    "Name": "VEGAS Edit 20 Steam Edition",
    "Release date": "Nov 1, 2022",
    "About the game": "VEGAS Edit 20 Steam Edition is everything you need to edit your gaming videos, from stream highlights to gameplays. Capture your gameplay excitement and edit it into a professional video to showcase your skills and strategies or share your tips. Edit the most exciting parts of the game together and leave out dead scenes or uninteresting parts. Record commentary to add your personality. Splice in footage of yourself or other players reacting to the gameplay to build up the drama. Highlight key moments with special effects like glitches, shaking, or slow motion. Keep your viewers’ attention with jump cuts, transitions, and slow-motion sequences. Write titles and captions to identify players, locations, and key gameplay moments. Create striking looks with powerful HDR color correction and grading. Give viewers different perspectives with multiple camera views. Then, match video with music and sound effects for a complete experience. When you're happy with your edit, export with GPU acceleration and upload to YouTube or other destinations. Highlights Record multiple video and audio sources Work with a wide range of professional formats, including Apple ProRes and BRAW Edit clips: trim, shuffle, slip, slide, time stretch, reverse, and more Add effects, filters, transitions, and titles Easily remove green screen Splice yourself into the game with picture in picture Create your signature look with HDR color correction and grading Edit effects with adjustment tracks Apply multi-region motion tracking to spice up your production Use audio to enhance your video with a multichannel mixer, reverbs and echoes, equalization tools, and VST3 support Use audio synchronization for multicam editing Use comprehensive built-in screen capture Work fast with GPU acceleration for decoding/encoding for Nvidia®, AMD® and Intel® Choose from a wide range of output formats Upload directly to YouTube and Vimeo What’s new? Audio production with support for the latest VST3 plug-ins for reverbs, delays, EQs, and more Optical Flow motion: create smooth slow motion, and fluid warp-flow movement along with seamless resampling Motion Blur FX: create a natural feel for motion sequences and target specific areas of your footage. Animated transitions and effects: build dynamic animation into your transitions and effects with complete Bézier curve control Automatic project collections: easily access all of your projects and their media files with automatic file organization Scene detection: automatically detect scenes from rendered video. Mark them as regions or break them up to work with them individually Modern flexible transitions: create your own transitions or choose from dozens of presets to spice up the story Hue vs Saturation color curve: target a specific color then change the saturation Saturation vs Saturation color curve: target a specific saturation then pump it or mute it Curves color picker: sample the exact colors or ranges to adjust in the color curves Zoomable Preview: get up close to your footage in the Video Preview window",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2070990/header.jpg?t=1667300108",
    "Price": 164.34,
    "Developers": "MAGIX Software GmbH",
    "Publishers": "MAGIX Software GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2070990/ss_3d50603e4d0dc049e46e1d71dd279bc1a48a61e8.1920x1080.jpg?t=1667300108,https://cdn.akamai.steamstatic.com/steam/apps/2070990/ss_b1df25b25447bd6fda28ebd2ef6d1b0ff557ed11.1920x1080.jpg?t=1667300108,https://cdn.akamai.steamstatic.com/steam/apps/2070990/ss_00f3a07ae7cb157a973de6ff25695ed131042ff9.1920x1080.jpg?t=1667300108,https://cdn.akamai.steamstatic.com/steam/apps/2070990/ss_f77567a252dae6e7681cb27e21c153cf93f815fc.1920x1080.jpg?t=1667300108,https://cdn.akamai.steamstatic.com/steam/apps/2070990/ss_49e5217d32106a8311bdbf18d8b8ba7c5fea12b6.1920x1080.jpg?t=1667300108,https://cdn.akamai.steamstatic.com/steam/apps/2070990/ss_fce5c09ea27a345b12890b82aba8c3e1e70ec26f.1920x1080.jpg?t=1667300108,https://cdn.akamai.steamstatic.com/steam/apps/2070990/ss_59ac3448ddc4aa0e3b7273f5f62c5c9cf1dc0160.1920x1080.jpg?t=1667300108,https://cdn.akamai.steamstatic.com/steam/apps/2070990/ss_f2d764ffd17c95eff398670fdc02d51d1b7b6402.1920x1080.jpg?t=1667300108,https://cdn.akamai.steamstatic.com/steam/apps/2070990/ss_c8f8d200a74a4f10cbc6aa0c3f013458ac414b87.1920x1080.jpg?t=1667300108",
    "Slug": "vegas-edit-20-steam-edition",
    "Meta Title": "VEGAS Edit 20 Steam Edition: Nov 1, 2022, MAGIX Software ...",
    "Meta Description": "Looking for information on VEGAS Edit 20 Steam Edition? Check out the release date (Nov 1, 2022), developer insights from MAGIX Software GmbH, and a com...",
    "Alt Text Image": "Official header image for VEGAS Edit 20 Steam Edition game - Steam 2070990",
    "Canonical URL": "https://gusku.site/game/vegas-edit-20-steam-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VEGAS Edit 20 Steam Edition\", \"description\": \"Looking for information on VEGAS Edit 20 Steam Edition? Check out the release date (Nov 1, 2022), developer insights from MAGIX Software GmbH, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"MAGIX Software GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MAGIX Software GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2070990/header.jpg?t=1667300108\", \"offers\": {\"@type\": \"Offer\", \"price\": 164.34, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}