{
    "AppID": 2090700,
    "Name": "WikiArena",
    "Release date": "Oct 25, 2022",
    "About the game": "Let Wikipedia articles battle it out in the arena and predict the winner! Each round pits two random Wikipedia articles against each other. Your task: Guess which article is longer or gets more views . Oh, and you have to pick the category as well based on what you think is the safer bet. 🌐 The game requires an internet connection to retrieve the Wikipedia data. 🎮 Fully playable with a dual-stick controller: right stick to point, R2 to click. Game Modes Arena: The 'roguelike' mode. Try to reach 10 correct predictions before being wrong 3 times! Endless: How many predictions can you get right before being wrong 3 times? VS WikiBot: Play 'last one standing' against a WikiBot that progressively gets better at playing the game the more you win. Can you beat WikiBot MK 25? Daily Arena: An arena run that's the same for all players each day. Do you think you can read the internet's collective mind better than your friends? Streamer VS Chat: Play against your favorite Twitch streamer (or against your chat if you're a streamer yourself)! Features ♾️ Literally infinite content: Wikipedia grows every day and with it the archive the game's article randomizer can pick from. You'll never play the same run twice! 📈 Statistics: Get a neat one-screen overview of your current run anytime! 📊 Meta statistics: The game records how many 10-win runs you had, your highest endless score ever, and all your recent results. ⚙️ Customization: Embrace the full chaos of the archive or customize your experience by e.g. having disambiguations or very obscure articles filtered out! 🐦 Battle tweets: Generate a sharable tweet visualizing the most interesting result after every duel via a single click! ⏱️ Optional 'speedrun' timer: How quickly can you finish a 10/10 stars Arena run? 💬 Multi-language support: English, German, Spanish and Japanese are fully translated. Wiki content is supported for even more languages (Chinese, Dutch, Italian, Portuguese). 🏆 Steam-exclusive: Achievements and leaderboards! Who would make this and why? Fabian Fischer (@Ludokultur) created the game to start exploring the 'trivia roguelike' genre. Games such as Wordle or Babble Royale show how much the 'free depth' of language itself can be used for game design purposes. WikiArena applies a similar approach, using the 'internet's meta' as its core language.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2090700/header.jpg?t=1666780218",
    "Price": 1.79,
    "Developers": "Ludokultur",
    "Publishers": "Ludokultur",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2090700/ss_e4ba58f8402dcb1e477db9c1897d09ba6d5a5ee1.1920x1080.jpg?t=1666780218,https://cdn.akamai.steamstatic.com/steam/apps/2090700/ss_57542c38642eae35cbb2f146114002bf491a1450.1920x1080.jpg?t=1666780218,https://cdn.akamai.steamstatic.com/steam/apps/2090700/ss_ed2e0df2f9a82195862c7cd9c4bf24c9fcd12838.1920x1080.jpg?t=1666780218,https://cdn.akamai.steamstatic.com/steam/apps/2090700/ss_ec5d190591b1de4bb9e06959226f778ed35a88c9.1920x1080.jpg?t=1666780218,https://cdn.akamai.steamstatic.com/steam/apps/2090700/ss_b445b38775d3a72680a879dc39ebc7ce6cfc300c.1920x1080.jpg?t=1666780218",
    "Slug": "wikiarena",
    "Meta Title": "WikiArena: Oct 25, 2022, Ludokultur and Full Overview",
    "Meta Description": "Looking for information on WikiArena? Check out the release date (Oct 25, 2022), developer insights from Ludokultur, and a complete game summary.",
    "Alt Text Image": "Official header image for WikiArena game - Steam 2090700",
    "Canonical URL": "https://gusku.site/game/wikiarena",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"WikiArena\", \"description\": \"Looking for information on WikiArena? Check out the release date (Oct 25, 2022), developer insights from Ludokultur, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ludokultur\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ludokultur\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2090700/header.jpg?t=1666780218\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}