{
    "AppID": 2152190,
    "Name": "Zombie Apocalypse Survival Simulator",
    "Release date": "Oct 17, 2022",
    "About the game": "(This game, as well as many others in our bundle, is FANTASTIC for Youtubers &amp; Streamers to create content, engage with their audience, &amp; allow their audience to better get to know them through answering a series of questions about the content creator! This creates a unique experience for all parties involved, and players playing the game themselves can enjoy the solo experience tremendously all on their own as well!) Zombie Apocalypse Survival Simulator The Apocalypse has come and gone, and all that's left are the voracious dead and The Wolves... Well, and then... There's you, of course. You will be asked a series of questions about Zombie Apocalypse Scenarios and must provide honest answers about what you would do if you were in potentially life-threatening situations. Based on your answers, you will be assessed and a result will be provided for you at the end of the game to determine how you would stack up in the dangers of such events. What is Zombie Apocalypse Survival Simulator? Well, in essence, it's just what it sounds like! It's our way of reading the feedback players have left for us on previous titles such as The Test Trilogy and others, taking their words into heavy consideration, and creating new experiences that players want to play! Everyone at some point or another imagines themselves fighting the walking dead, engaging in hand-to-hand combat, and encountering awful survival situations that we always wonder if we're strong enough to endure... Everyone thinks about surviving in an age where mankind no longer belongs... But how many people would actually cut it? How many people would actually survive, how many would die, and how many would thrive? Well, this simulator asks you a series of questions, and through your answers, will let you know your chances of surviving in the realm of the dead! Would you survive the combat? Would you survive the politics? Would you continue on into the new world? Would you Survive, or would you be just another victim of looters, bandits, or worst of wall... The Voracious Dead... There's only one way to find out... Features: Short and sweet Be a part of history with Player - Developer interaction Have your name in the credits of our upcoming titles The only game with this theme of its kind Very atmospheric and psychological Sit back, relax, and answer in-depth questions to reveal survival scenarios Super affordable for a unique experience Multiple choices with multiple endings",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2152190/header.jpg?t=1666025891",
    "Price": 1.19,
    "Developers": "Randumb Studios",
    "Publishers": "Randumb Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2152190/ss_8f3039895c77b77962ce23f262aae5a6573b3111.1920x1080.jpg?t=1666025891,https://cdn.akamai.steamstatic.com/steam/apps/2152190/ss_4dcf3c5bb8bb58029246af018c7f559c529e4540.1920x1080.jpg?t=1666025891,https://cdn.akamai.steamstatic.com/steam/apps/2152190/ss_b12dfc1cba56d7c5bfdaae83bf40841a2903a906.1920x1080.jpg?t=1666025891,https://cdn.akamai.steamstatic.com/steam/apps/2152190/ss_6d67bf5d1a72836204b85a385216c0ab9f7c95e9.1920x1080.jpg?t=1666025891,https://cdn.akamai.steamstatic.com/steam/apps/2152190/ss_0a4cdeb11c9b4867c0cae82fef3d5fc6dc27daf6.1920x1080.jpg?t=1666025891,https://cdn.akamai.steamstatic.com/steam/apps/2152190/ss_684c81ed4bad9c3fbf270bb81eb33e0bc99a9da1.1920x1080.jpg?t=1666025891,https://cdn.akamai.steamstatic.com/steam/apps/2152190/ss_1d2297a961148ace038d48aff954cd1667fea20e.1920x1080.jpg?t=1666025891,https://cdn.akamai.steamstatic.com/steam/apps/2152190/ss_c86c0ca07ae074b3bb860193b25cc25cbf72a0b4.1920x1080.jpg?t=1666025891",
    "Slug": "zombie-apocalypse-survival-simulator",
    "Meta Title": "Zombie Apocalypse Survival Simulator: Oct 17, 2022, Randu...",
    "Meta Description": "Looking for information on Zombie Apocalypse Survival Simulator? Check out the release date (Oct 17, 2022), developer insights from Randumb Studios, and...",
    "Alt Text Image": "Official header image for Zombie Apocalypse Survival Simulator game - Steam 2152190",
    "Canonical URL": "https://gusku.site/game/zombie-apocalypse-survival-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zombie Apocalypse Survival Simulator\", \"description\": \"Looking for information on Zombie Apocalypse Survival Simulator? Check out the release date (Oct 17, 2022), developer insights from Randumb Studios, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Randumb Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Randumb Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2152190/header.jpg?t=1666025891\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}