{
    "AppID": 1633300,
    "Name": "ANIQUILATION",
    "Release date": "Jul 28, 2022",
    "About the game": "Follow us here： Facebook Twitter Discord ANIQUILATION is a Twin Stick shooter set in small planets (some of which can be terraformed as you play!) in which not only your shoots, but also the enemies and planet environment are your weapon thanks to your SWORD which you can use to throw or reflect almost ALL the elements in the environment! You will follow the adventures of a pilot and her leader who are wandering in space and are trying to return to their home Galaxy and got lost after trying to solve a mystery that arrived to their galaxy. As you progress you’ll discover that it wasn’t just a coincidence that the heroes arrived to this specific mysterious galaxy and will understand why the only solution is invoking the fabled “Aniquilation” upon the galaxy! Find and learn about new energy sources for your people while you travel between each one of the game planets levels via racing-like tubular levels! STORY MODE: Join a big adventure alone or with your friends, using Split Screen. DEFEND THE BASE: The players must protect their 3 bases from the attacks from their opponent while trying to destroy their 3 bases. GOAL!: Score more Goals than your opponents before the time runs out! CONTAGION: Infect your opponent with the techno virus, the one that last less time with the virus wins! FREE FOR ALL: Just destroy your opponent, enemies and buildings Attacking and Defending SWORD (used to slash and reflect) 5 Different types of projectile weapons. 2 Special abilities which can be upgraded if you find the ultimate weapon: the 'Aniquilation'. Dash and destroy buildings and enemies. Throw and reflect buildings, enemies and projectiles. A shield that gives you temporal invulnerability. Recovery bases. You can choose from a variety of different ships, each one with different capabilities. Unlock and upgrade your ship using XP and gathered resources. Unlock the true ending of the game depending if you find the galaxy’s most powerful weapon: The Aniquilation! Enjoy 30 different levels each one with very different environments. 4 PVP and co-op modes. We are a Colombian video game studio passionate about experimenting and evolving game mechanics that we have always liked.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1633300/header.jpg?t=1659056159",
    "Price": 22.49,
    "Developers": "R-Next",
    "Publishers": "Gamera Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1633300/ss_30c4a969c3e51c7a704aed3b108b351f712a3810.1920x1080.jpg?t=1659056159,https://cdn.akamai.steamstatic.com/steam/apps/1633300/ss_8677313eef07d8ae23601f66c064544ce790e36f.1920x1080.jpg?t=1659056159,https://cdn.akamai.steamstatic.com/steam/apps/1633300/ss_d273be18ad2eb23d72ed47642c09c766442f3771.1920x1080.jpg?t=1659056159,https://cdn.akamai.steamstatic.com/steam/apps/1633300/ss_b0ab883af4fe557e607710c30c3a88325cacd0e2.1920x1080.jpg?t=1659056159,https://cdn.akamai.steamstatic.com/steam/apps/1633300/ss_78c7e21614e52d57cd52121d61d900318924fc4f.1920x1080.jpg?t=1659056159,https://cdn.akamai.steamstatic.com/steam/apps/1633300/ss_d49d1e6b314e28e06f8ad61a4b0ce29fdd2f4674.1920x1080.jpg?t=1659056159,https://cdn.akamai.steamstatic.com/steam/apps/1633300/ss_239609708cee9ff279b86847de5190de33070756.1920x1080.jpg?t=1659056159",
    "Slug": "aniquilation",
    "Meta Title": "ANIQUILATION: Jul 28, 2022, R-Next and Full Overview",
    "Meta Description": "Looking for information on ANIQUILATION? Check out the release date (Jul 28, 2022), developer insights from R-Next, and a complete game summary.",
    "Alt Text Image": "Official header image for ANIQUILATION game - Steam 1633300",
    "Canonical URL": "https://gusku.site/game/aniquilation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ANIQUILATION\", \"description\": \"Looking for information on ANIQUILATION? Check out the release date (Jul 28, 2022), developer insights from R-Next, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"R-Next\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gamera Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1633300/header.jpg?t=1659056159\", \"offers\": {\"@type\": \"Offer\", \"price\": 22.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}