{
    "AppID": 446510,
    "Name": "Armed and Gelatinous",
    "Release date": "Mar 1, 2016",
    "About the game": "Blobs in Space Armed and Gelatinous is a couch-competitive multiplayer party game with a wide variety of game modes. The main event is best described as a fast-paced bullet-hell space-shooter that pits you against your friends in epic matches of blob warfare! Take control of a gelatinous blob and either dash or blast your way to victory. Be warned! Your blob's body grows in size with each weapon you collect, effectively trading agility for firepower. Don't get too greedy or you'll swell up like a balloon and get popped! Collect, Grow, and Fight With each weapon collected, your blob's girth increases along with your destructive power! Although becoming a massive blob also provides you with a bigger health bar, you suffer a significant loss in speed and agility. Smaller blobs can more easily dodge bullets and evade attacks plus their supercharged Dash Attack has a much longer range. Less is more! Score, Dodge, and Evade Feeling sporty? Change it up! Between Blob Soccer, Blob Bombardment, and Blob Blitz, there's plenty of fun to be had. Party on! Match Types Personalize matches however you like in a variety of game modes: Point Match Time Match Stock Match Combo King Blob Soccer Blob Bombardment Blob Blitz (Coming Soon) Drone Decent (Coming Soon) Customize Matches Customize each match by setting the target point count, timer length, or number of lives! A secret unlockable arsenal menu allows you to choose from a multitude of weapon loadouts where you can even set up RPG only matches (our favorite) or try out your dashing skills with no weapons at all! Featuring Six Party Game Modes Tasty OST w/ 21 Original Tracks Be a Boss! 10+ Destructive Weapons Super Dash Ability Kill Streak Tracking Match Customization Hidden Soundtrack Selection Controls Explosive Dynamite Crates Space Tacos! Game Modes Point Match Time Match Stock Match Combo King Blob Soccer Blob Blitz Blob Bombardment Drone Descent Planned Features Online Multiplayer (Currently In Development) Party Mode Steam Trading Cards Steam Cloud Saves Progression System Save Data Cheats Community Support Discord Get exclusive updates, request beta access, and see what the team is up to! Join the Armed and Gelatinous Discord Steam Forums If you have any feedback or suggestions, we'd love to hear from you! Steam Discussions Forum Home Galaxy Found out more about your favorite gelatinous blob. Armed and Gelatinous Website Social Media Subscribe, Tweet, Follow, and Up vote us! YouTube | Twitter | Instagram | Reddit",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/446510/header.jpg?t=1583566387",
    "Price": 0.0,
    "Developers": "Three Flip Studios",
    "Publishers": "Three Flip Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/446510/ss_181c39d22041dcab0979dc06c128e26a6ffb7742.1920x1080.jpg?t=1583566387,https://cdn.akamai.steamstatic.com/steam/apps/446510/ss_42b96f8aa9d6997f1849d5628b56003f2b7714bb.1920x1080.jpg?t=1583566387,https://cdn.akamai.steamstatic.com/steam/apps/446510/ss_d42e60542947475f346093e638ef9fa60d367007.1920x1080.jpg?t=1583566387,https://cdn.akamai.steamstatic.com/steam/apps/446510/ss_7a246b14f920ac14991b0cf60653ad8d248e34e4.1920x1080.jpg?t=1583566387,https://cdn.akamai.steamstatic.com/steam/apps/446510/ss_49c5e5610404a56911e1cd8fcf3cf29c9752cb7d.1920x1080.jpg?t=1583566387,https://cdn.akamai.steamstatic.com/steam/apps/446510/ss_cb4db6710bbb0332f414220404394df9d9e7e248.1920x1080.jpg?t=1583566387",
    "Slug": "armed-and-gelatinous",
    "Meta Title": "Armed and Gelatinous: Mar 1, 2016, Three Flip Studios and...",
    "Meta Description": "Looking for information on Armed and Gelatinous? Check out the release date (Mar 1, 2016), developer insights from Three Flip Studios, and a complete ga...",
    "Alt Text Image": "Official header image for Armed and Gelatinous game - Steam 446510",
    "Canonical URL": "https://gusku.site/game/armed-and-gelatinous",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Armed and Gelatinous\", \"description\": \"Looking for information on Armed and Gelatinous? Check out the release date (Mar 1, 2016), developer insights from Three Flip Studios, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 1, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Three Flip Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Three Flip Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/446510/header.jpg?t=1583566387\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}