{
    "AppID": 2079800,
    "Name": "你与月光同罪-As Guilty As the Moon",
    "Release date": "Jul 26, 2022",
    "About the game": "Two years ago, 12 people were linked by a murder in a ride-hailing car. Two years later, the crime returned, and someone else seemed to be responsible. You open your eyes, you see a knife in your hand, and a man lying in a pool of blood not far away. The door opened and eleven others burst in... Could you. be the killer? You have 11 days to participate in this immersive mystery, but only one of you will survive. If we want to survive, we need to prove that we're innocent. Please don't trust anyone here. Who's behind all this? Can you make it to the last minute? Features: This is a realistic + survive-oriented work. The work is mainly presented to us in the form of story chapters. The murder case of online ride-hailing is deeply integrated into the immersive reasoning competition, and we will experience a thrilling adventure from the perspective of the heroine. Restore the truth of the event in the mode of multi-angle and group images. Reasoning content is highly brain-burning, plot ups and downs. Take you to appreciate the story of brain-burning games, truth, friendship, love, you have to believe who's word! Exquisite character design, clear picture quality effect, smooth operation experience, in the tense and exciting reasoning rhythm, feeling the different life of the leading group. Rich and diversified side plots. The player can choose the direction of the story as he wishes, each choice will take you to different branches, give you different stats, and each choice you make will determine the final outcome. Gameplay: The game is easy to operate, and beginners can easily get started. There are many dark plots in the works, which need us to explore carefully, discover the hidden stories, dig out the truth of the event, and find out the real killer! Have a special mind-reading mode. Trying too hard to find a relationship? Turn on the mind-reading feature for the character you want to attack. VR virtual scene to restore the truth of the case, all participants in the round table were cleared of memory, memory gradually recovered in VR scene to find the real killer. You got the killer card in the first place, and if you want to live, you need to prove your innocence. Very test the player's mind and wisdom, only to find the answer to the case, can save others.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2079800/header.jpg?t=1658885266",
    "Price": 7.99,
    "Developers": "橙光游戏",
    "Publishers": "橙光游戏",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2079800/ss_d2c52ed6f49bc7eb2e0e3848e0c8dc0e77396a04.1920x1080.jpg?t=1658885266,https://cdn.akamai.steamstatic.com/steam/apps/2079800/ss_1e951a679d5782c3f1b6ac4d7eb373819c63099c.1920x1080.jpg?t=1658885266,https://cdn.akamai.steamstatic.com/steam/apps/2079800/ss_1e44f588819ff57941a46827e5cf149796ce15f0.1920x1080.jpg?t=1658885266,https://cdn.akamai.steamstatic.com/steam/apps/2079800/ss_926fca57a1c902291f5109584ce5d11cd6a1c179.1920x1080.jpg?t=1658885266,https://cdn.akamai.steamstatic.com/steam/apps/2079800/ss_ac2e5352e5e97477f7ba97001088aa90c856d0c0.1920x1080.jpg?t=1658885266",
    "Slug": "as-guilty-as-the-moon",
    "Meta Title": "你与月光同罪-As Guilty As the Moon: Jul 26, 2022, 橙光游戏 and Full...",
    "Meta Description": "Looking for information on 你与月光同罪-As Guilty As the Moon? Check out the release date (Jul 26, 2022), developer insights from 橙光游戏, and a complete game su...",
    "Alt Text Image": "Official header image for 你与月光同罪-As Guilty As the Moon game - Steam 2079800",
    "Canonical URL": "https://gusku.site/game/as-guilty-as-the-moon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u4f60\\u4e0e\\u6708\\u5149\\u540c\\u7f6a-As Guilty As the Moon\", \"description\": \"Looking for information on \\u4f60\\u4e0e\\u6708\\u5149\\u540c\\u7f6a-As Guilty As the Moon? Check out the release date (Jul 26, 2022), developer insights from \\u6a59\\u5149\\u6e38\\u620f, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6a59\\u5149\\u6e38\\u620f\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6a59\\u5149\\u6e38\\u620f\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2079800/header.jpg?t=1658885266\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}