{
    "AppID": 1517290,
    "Name": "Battlefield™ 2042",
    "Release date": "Nov 19, 2021",
    "About the game": "WELCOME TO 2042 Battlefield™ 2042 is a first-person shooter that marks the return to the iconic all-out warfare of the franchise. Adapt and overcome in a near-future world transformed by disorder. Squad up and bring a cutting-edge arsenal into dynamically-changing battlegrounds supporting 128 players, unprecedented scale, and epic destruction. Battlefield™ 2042 – Season 1: Zero Hour Unleash the unexpected with Battlefield™ 2042 – Season 1: Zero Hour. Reach greater heights with high-tech stealth helicopters on Exposure; a new mountainous map. Deploy as new Specialist Ewelina Lis and use her G-84 TGM Rocket Launcher to clear the skies as you lead your squad to victory with new hi-tech gear. ALL-OUT WARFARE The next generation of fan-favorites Conquest and Breakthrough features the largest Battlefield maps ever and up to 128 players. Experience the intensity of all-out warfare on maps filled with dynamic weather and spectacular world events. Conquest Battlefield's massive, iconic sandbox mode returns – this time supporting 128 players on PC. The maps have been specifically designed for this vast scale, with action divided into ''clusters'' of various kinds. Also, the action now centers around sectors consisting of several flags instead of individual control points. Breakthrough The return of Breakthrough sees two teams – Attackers and Defenders – battle over larger-scale sectors as the Attackers push towards the final objective. Each sector is designed to house a larger number of players, enabling more strategic choice and more flanking opportunities. Approach the capture areas from multiple locations and take advantage of more types of tactical possibilities. BATTLEFIELD PORTAL Discover unexpected battles and enter the wide universe of Battlefield in a community-driven platform that gives you the power to change the rules of war. The possibilities are endless when you can customize weapons, gear, rules, and more in this creative sandbox mode. Replay classic experiences with select content from Battlefield 1942, Battlefield 3, and Battlefield: Bad Company 2, or leverage the modern content from the world of Battlefield 2042 to discover, create, and share something completely new. BATTLEFIELD HAZARD ZONE A tense, squad-focused survival experience, Battlefield Hazard Zone combines edge-of-your-seat gameplay with the best of the Battlefield sandbox. Inserted as a four-member squad, you must locate and retrieve critical Data Drives scattered throughout the battlefield, while competing against opposing squads with the same objective and local militias. Succeed by gathering the Data Drives and choosing when to extract before a storm overtakes the area in this high-stakes, one-life experience. Every bullet, every skirmish, and every decision counts.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1517290/header.jpg?t=1658753769",
    "Price": 29.99,
    "Developers": "DICE",
    "Publishers": "Electronic Arts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1517290/ss_d527b0f90590f466b0f1e1b7ac31a8123dc2a934.1920x1080.jpg?t=1658753769,https://cdn.akamai.steamstatic.com/steam/apps/1517290/ss_4d4aee02bcab9ecc7e9b9d3a27e89695d60a48bf.1920x1080.jpg?t=1658753769,https://cdn.akamai.steamstatic.com/steam/apps/1517290/ss_4d8a604d6fc9540ebced80520b73fe26a8a747c5.1920x1080.jpg?t=1658753769,https://cdn.akamai.steamstatic.com/steam/apps/1517290/ss_f34415a1d615ca62f474bb5afb214fa528b4fef3.1920x1080.jpg?t=1658753769,https://cdn.akamai.steamstatic.com/steam/apps/1517290/ss_266fb5de64cdffb8e3261a771d32ba8edd5d5259.1920x1080.jpg?t=1658753769,https://cdn.akamai.steamstatic.com/steam/apps/1517290/ss_075b303b59a5e9a0ae6c0fff78839116e6f75848.1920x1080.jpg?t=1658753769,https://cdn.akamai.steamstatic.com/steam/apps/1517290/ss_d686299d32a8ff3c21114360fb73c7d9f60c0c0b.1920x1080.jpg?t=1658753769",
    "Slug": "battlefield-2042",
    "Meta Title": "Battlefield™ 2042: Nov 19, 2021, DICE and Full Overview",
    "Meta Description": "Looking for information on Battlefield™ 2042? Check out the release date (Nov 19, 2021), developer insights from DICE, and a complete game summary.",
    "Alt Text Image": "Official header image for Battlefield™ 2042 game - Steam 1517290",
    "Canonical URL": "https://gusku.site/game/battlefield-2042",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Battlefield\\u2122 2042\", \"description\": \"Looking for information on Battlefield\\u2122 2042? Check out the release date (Nov 19, 2021), developer insights from DICE, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"DICE\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Electronic Arts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1517290/header.jpg?t=1658753769\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}