{
    "AppID": 1975160,
    "Name": "Be",
    "Release date": "Aug 1, 2022",
    "About the game": "Get away from the stress of life and fuel your soul. Spend time in a beautiful world, perhaps sitting by the water, walking in the forest ... or tickle your creative impulses by building your dream house (or super-villain pad?). Be is all about exploration, building and ... well, just 'Be'ing. Theres no work, no time pressures. No nasty surprises. Be is a place where you can relax and do nothing (listen to the birds!) or engage in construction limited only by your imagination. You have full control over the time of day &amp; weather, letting you style the worlds visuals as your mood take you. See amazing sunrises &amp; sunsets, or if you prefer, walk around under moonlight. Want to sit and enjoy a sunset? You can do that. Want to build a mega structure off the side of the map with friends? you can do that too! Features In Early Access A beautiful forest biome with a mix of hills, mountains and beach areas Full weather system: clear days, cloudy days, rain, storms and lightning Day / Night cycle: A day can pass in 20 minutes, or in realtime. You can even stop time completely! Beautiful &amp; colorful ambient change as the time of day changes/progresses Multiplayer support (peer-peer, players join another persons game, up to 4 players) Over an hour of relaxing meditative music Some annoying seagulls :) Support for co-op building and experience. Up to 4 players. Important Right now there are no resource limits, nor limits to building physics. We do plan to make building more challenging in a future update. Saved games may be unloadable in a future update. Vr Support Be Works From Both Pc and Also With Vr. Testing so far has been with the Oculus 2, since that's what we've developed with thus far. Of course we intend to add more headsets in the future (they might work now, but no testing or keybinding testing has been done) Ideas For the Future This gives you some idea of what we're thinking going forward. More animals; more life Paths, to add life and direction into existing biomes Varied biomes (desert/snow) Rivers More restricted physics for building (to make building certain structures more challenging) Journeys (mini adventures to aid in exploration and discovery) Paintable structures (colour/tint existing built items) Player created pieces which are shared in the community Sand Raking Terrain deformation Terrain painting (make an area grass/dirt/stone) Introduce more physics (make a slide down a hill, go down it, launch yourself over the landscape) Puzzles that require two players to complete (could also spawn a secondary copy/playback of yourself; timed) Swimming Sailing, implies making our own rafts/boats and being able to sail them Gliding More achievements Meditation/guided breathing specific mechanics, e,g: guided breathing exercises Player emotions / animations (Sad/happy/question/etc) Attenuation of audio indoors (come in from the rain, and hear that as well as see it) Many more items such as beds, chairs, rugs, various indoor lights, building materials Bookmarked locations (portals / easy way to go to areas that you've 'saved') A world that gets more beautiful as you build Creation of 'prefabs'. e.g: build a tower and don't have to build it twice. Share those prefabs with others (anything from small items to complete structures) Journeys (guided tours, perhaps centered around achievements or getting extra items)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1975160/header.jpg?t=1659382482",
    "Price": 11.69,
    "Developers": "shinywhitebox ltd",
    "Publishers": "shinywhitebox ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1975160/ss_1592eef7dc3a16b125e37c4f293a1a53acf50004.1920x1080.jpg?t=1659382482,https://cdn.akamai.steamstatic.com/steam/apps/1975160/ss_2e24a58b552afa89318b3e95efe2d5641bd2840e.1920x1080.jpg?t=1659382482,https://cdn.akamai.steamstatic.com/steam/apps/1975160/ss_fea6b3ea5e813423ff9f3513058be9b2ac9d701f.1920x1080.jpg?t=1659382482,https://cdn.akamai.steamstatic.com/steam/apps/1975160/ss_b1e4d2fc097d6af78ddd3deeaf421696476fc8ee.1920x1080.jpg?t=1659382482,https://cdn.akamai.steamstatic.com/steam/apps/1975160/ss_f773195208001ef5631248e9d2ea66691f5f6a7c.1920x1080.jpg?t=1659382482,https://cdn.akamai.steamstatic.com/steam/apps/1975160/ss_05e12a146c4f4d5a2ed421a96bbdb8d27d6145d7.1920x1080.jpg?t=1659382482,https://cdn.akamai.steamstatic.com/steam/apps/1975160/ss_7f7736c5181d3d318832af9891a3030a67ea3f12.1920x1080.jpg?t=1659382482,https://cdn.akamai.steamstatic.com/steam/apps/1975160/ss_42b365d41b0e3f02397491e2cbf58b3829dd0ff4.1920x1080.jpg?t=1659382482,https://cdn.akamai.steamstatic.com/steam/apps/1975160/ss_439760872335fb6e49d081a2dbc07b99294da774.1920x1080.jpg?t=1659382482,https://cdn.akamai.steamstatic.com/steam/apps/1975160/ss_bc222b94a8ce32313f833300f3b52f84e886d51a.1920x1080.jpg?t=1659382482,https://cdn.akamai.steamstatic.com/steam/apps/1975160/ss_b78544be23fe2609583c97c3e59158de54bcc2d6.1920x1080.jpg?t=1659382482,https://cdn.akamai.steamstatic.com/steam/apps/1975160/ss_55f1f7797913ea921cd8e7aa040b05c682a6eb67.1920x1080.jpg?t=1659382482,https://cdn.akamai.steamstatic.com/steam/apps/1975160/ss_a95d7310677035ee17570ebaaabb7830d52aee61.1920x1080.jpg?t=1659382482",
    "Slug": "be",
    "Meta Title": "Be: Aug 1, 2022, shinywhitebox ltd and Full Overview",
    "Meta Description": "Looking for information on Be? Check out the release date (Aug 1, 2022), developer insights from shinywhitebox ltd, and a complete game summary.",
    "Alt Text Image": "Official header image for Be game - Steam 1975160",
    "Canonical URL": "https://gusku.site/game/be",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Be\", \"description\": \"Looking for information on Be? Check out the release date (Aug 1, 2022), developer insights from shinywhitebox ltd, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"shinywhitebox ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"shinywhitebox ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1975160/header.jpg?t=1659382482\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.69, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}