{
    "AppID": 1886230,
    "Name": "BeatMotor",
    "Release date": "Feb 21, 2022",
    "About the game": "About this game: This is a small-scale independent game developed by an independent studio. It has innovated in the category of music games and developed a new way of playing. Integrating elements of music games ( rhythm stepping ), extreme sports ( fancy motorcycle ), and fighting games ( rubbing moves ), the overall style is relaxed and a little bit funny. There are 3 characters with different styles, and each character has 9 different jumping moves. At the same time, we have carefully selected 21 musics with strong and beautiful style. How to play: You'll control a fancy motor player drive on the track with music playing. At the rhythm point, there are some dirt slopes on the track. You need to rub with the arrow keys (or WASD) like in a fighting game, and jump at the top of the slope (press space). Successive jumps in a row will increase the number of combos, and the jump score will increase too. The game will record last 5 moves. When you jump, it will be compared with the records to determine the degree of fancy. So don't make the same jump always. Resolutions: This game runs in window mode only, providing 2 resolutions: 1600*900 and 1280*720, which can be switched by clicking the button in the title. It is recommended to play the game on the desktop above 1600*900, because the display of 1280*720 is overall scaled of the whole window, so maybe slightly not good-looking under a large desktop. System requirements: This is a lightweight 2D game, so the system requirements are very low. However, we haven't tested it on a PC that low enough, so we can't tell how low the minimum is. BUT Windows7 is needed . languages: This game provides 2 languages ​​- Simplified Chinese and English, and the default startup is Chinese. For the English users, there's no need to panic. You can switch language by clicking the English button in the title. This setting will be saved in the local profile and the game will be in English on subsequent runs. Producer's words: When I started thinking about music games, I found that the music games I've seen all require the player to give a specific move at a specific timepoint, with very low degrees of freedom, and the score evaluation depends entirely on accuracy. Then I was thinking, can we make a music game, at a specific timepoint, the player decides which move to give, so as to greatly expand the degree of freedom of the music game? One day, I played a fighting game a little while, then like a lightningbolt shot in my head, ' That's it! ' So I came up with this work. Have a great time. Best wishes from Gao.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1886230/header.jpg?t=1645459385",
    "Price": 3.99,
    "Developers": "Hohotech",
    "Publishers": "Hohotech",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1886230/ss_1baeaa64cded160482e6cd52966dd3979a22abad.1920x1080.jpg?t=1645459385,https://cdn.akamai.steamstatic.com/steam/apps/1886230/ss_d50cdc033a3084db813593cf46629f0c4b5fe39b.1920x1080.jpg?t=1645459385,https://cdn.akamai.steamstatic.com/steam/apps/1886230/ss_d35f1111923c0b28ee09083fc11884899e8fa0e5.1920x1080.jpg?t=1645459385,https://cdn.akamai.steamstatic.com/steam/apps/1886230/ss_ddd6e6b6689de2c14e5f818befc669ae4e9de397.1920x1080.jpg?t=1645459385,https://cdn.akamai.steamstatic.com/steam/apps/1886230/ss_6579407c33950effed10235539b7ab27441d0913.1920x1080.jpg?t=1645459385",
    "Slug": "beatmotor",
    "Meta Title": "BeatMotor: Feb 21, 2022, Hohotech and Full Overview",
    "Meta Description": "Looking for information on BeatMotor? Check out the release date (Feb 21, 2022), developer insights from Hohotech, and a complete game summary.",
    "Alt Text Image": "Official header image for BeatMotor game - Steam 1886230",
    "Canonical URL": "https://gusku.site/game/beatmotor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BeatMotor\", \"description\": \"Looking for information on BeatMotor? Check out the release date (Feb 21, 2022), developer insights from Hohotech, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hohotech\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hohotech\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1886230/header.jpg?t=1645459385\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}