{
    "AppID": 1911400,
    "Name": "Blink God",
    "Release date": "May 31, 2022",
    "About the game": "This game is a VR game inspired by Getting over it and Jump King. The goal was to make the gameplay of both games similar in VR. Create and throw a Blinker by hand, and after a while you will teleport to the location where the Blinker was. Climb cliffs and buildings with the sense of throwing a ball lightly, and try to reach the top by avoiding various obstacles. But it won't be as easy as you think. Blinker will collide or bounce off walls according to the laws of physics and will drop you to the bottom each time. This game is far from an easy and friendly game and it will even annoy you quite a bit. Still, I believe you will be able to reach the throne at the top. Features 3D world to enjoy in VR Explore the stunning 3D world with your own eyes and challenge yourself to the top. When you go up to a high place, don't you think you want to fall down at least once? Anything is possible in this game. Easy and simple operation All you need to know is the simple operation of grabbing and throwing the ball. And... the throwing direction and force, the acceleration of the object, the angle of incidence when the ball and the object collide, the elasticity, the speed and position of the moving footrest, the teleport timing... Play without motion sickness It moves based on teleportation, so there is little movement and no motion sickness. Oh, except when you fall. Real-time save and Undo All player actions are recorded in real time. But in some cases, it might be possible to go back once..? Game Controls Right Hand Grip: Creates or throws a blinker. Thrown blinkers are activated when they collide with objects. Right Hand Trigger: Instantly teleports to the location of the blinker that triggered it. Right-hand stick (pad): rotates the viewpoint by 45 degrees left/right. Left Hand Grip: Use 'Undo' to get back to where you were before you teleported. It can only be used once, but can be recharged at certain locations. Left hand stick (pad): Allows you to walk at a slow pace and move freely. Press the button to jump. Left-handed menu (system): Summon or return the menu drone. The menu drone allows you to modify settings or exit to the main menu.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1911400/header.jpg?t=1655368457",
    "Price": 9.99,
    "Developers": "Kaleido, Inc.",
    "Publishers": "Kaleido, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1911400/ss_33c9016a22f5991f0af7f427968fd27e4ecc531a.1920x1080.jpg?t=1655368457,https://cdn.akamai.steamstatic.com/steam/apps/1911400/ss_c1ab202e63a032380aff89e3542a74e09daf1c31.1920x1080.jpg?t=1655368457,https://cdn.akamai.steamstatic.com/steam/apps/1911400/ss_dca0953e399aa835998048f7c7e1a912809234ef.1920x1080.jpg?t=1655368457,https://cdn.akamai.steamstatic.com/steam/apps/1911400/ss_a21f5bd508206d3f74afc5e832aa72cfc52254e9.1920x1080.jpg?t=1655368457,https://cdn.akamai.steamstatic.com/steam/apps/1911400/ss_3aa30dc59b511d316b4501223190e5a5441db0f7.1920x1080.jpg?t=1655368457",
    "Slug": "blink-god",
    "Meta Title": "Blink God: May 31, 2022, Kaleido, Inc. and Full Overview",
    "Meta Description": "Looking for information on Blink God? Check out the release date (May 31, 2022), developer insights from Kaleido, Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for Blink God game - Steam 1911400",
    "Canonical URL": "https://gusku.site/game/blink-god",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Blink God\", \"description\": \"Looking for information on Blink God? Check out the release date (May 31, 2022), developer insights from Kaleido, Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kaleido, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kaleido, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1911400/header.jpg?t=1655368457\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}