{
    "AppID": 1633370,
    "Name": "Boat Crew",
    "Release date": "Aug 1, 2022",
    "About the game": "Boat Crew Boat Crew is an action-packed singleplayer game that is all about leading your men to bring out the best in them in the field of battle. You're given charge of a PT boat, one of many, in the Pacific, and sent against the Imperial Japanese Navy in the forefront of the Pacific War. Sometimes through bravery and sometimes through guile, you'll take on ever stronger enemy forces and come out on top. Manage your people and your resources; beg, borrow, and steal, and equip yourself from a wide variety of tools available to bring your campaign to a victorious conclusion. Prioritize your acquisitions, make connections, and customize your ship's capabilities to your taste. Above all else, care for your crew; Experienced sailors are in short supply in the largest naval front in the history of mankind. Sometimes the best option is to live to fight another day. Key Features Crew Management: In Boat Crew, you are not the boat herself but her commander, with all the associated responsibilities and privileges. Most tasks will be delegated to your trusty crewmen, and it's up to you to make sure they're up to the task. Jury-Rigged: With distances vast and ships spread thin, you're afforded a substantial degree of autonomy. Anti-tank guns and light mortars are only some of the weapons you can add to your boat that would be considered unusual, and there is ample room for innovation. The only two rules are, make sure you are still floating, and get the job done! Tested in Battle: Training teaches a man to keep his head down, but its experience that teaches him when he can start handing out the hurt. Crack troops are far more lethal than green recruits, and will be capable of abilities otherwise unavailable to less experienced crewmen. Live and Teach: Beyond being good fighters, your veterans also have much to teach to their replacements. Experienced soldiers will set a baseline crew experience and will impart their lethality on any replacements given some time. Fortunes of War: War has luck of its own, and industrialized total war is a different story entirely. Despite all caution and planning, some of your most trusted members will be lost at some point. It's up to you and your skills as the commander to find appropriate replacements and train them in time for larger engagements. Applied Science: Few things inspire innovation as much as war does, and sometimes you may find yourself pressed to be the first to employ a new technology in the field. Following the expansive tech tree will dramatically improve your crew's combat prowess; just make sure to prioritize appropriately. Grand Campaign: Fight numerous surface actions that range from night raids and coastal fire support to search and destroy. Your success in these battles will improve your clout and your crew's experience, increasing the options available to you in future battles and providing more daring operations. Trailer Music by Scott Buckley - 'The Endurance'",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1633370/header.jpg?t=1659431654",
    "Price": 15.99,
    "Developers": "Tabbing Tabby",
    "Publishers": "Tabbing Tabby,Doyoyo Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1633370/ss_3d91e479df1113182e0ae94bc3dcd348fc1bb3db.1920x1080.jpg?t=1659431654,https://cdn.akamai.steamstatic.com/steam/apps/1633370/ss_d73a94729335e3eac05e73ffa232f7747390a8fd.1920x1080.jpg?t=1659431654,https://cdn.akamai.steamstatic.com/steam/apps/1633370/ss_1b9a6cb0be9205d97e90d379bf7b10d8615f6eab.1920x1080.jpg?t=1659431654,https://cdn.akamai.steamstatic.com/steam/apps/1633370/ss_5511f109737dd9b968268118c4c77a86dfd7d090.1920x1080.jpg?t=1659431654,https://cdn.akamai.steamstatic.com/steam/apps/1633370/ss_84f2a8553761d842f90702952a482555d92d835c.1920x1080.jpg?t=1659431654",
    "Slug": "boat-crew",
    "Meta Title": "Boat Crew: Aug 1, 2022, Tabbing Tabby and Full Overview",
    "Meta Description": "Looking for information on Boat Crew? Check out the release date (Aug 1, 2022), developer insights from Tabbing Tabby, and a complete game summary.",
    "Alt Text Image": "Official header image for Boat Crew game - Steam 1633370",
    "Canonical URL": "https://gusku.site/game/boat-crew",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Boat Crew\", \"description\": \"Looking for information on Boat Crew? Check out the release date (Aug 1, 2022), developer insights from Tabbing Tabby, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tabbing Tabby\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tabbing Tabby,Doyoyo Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1633370/header.jpg?t=1659431654\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}