{
    "AppID": 458410,
    "Name": "Cabals: Magic & Battle Cards",
    "Release date": "Feb 6, 2018",
    "About the game": "Cabals combines the strategic deck building of card games and tactics of a chess like board game. The classic collectible card game is now designed from the ground up for PC. Choose your side, build your perfect deck and battle in the War of Cabals to decide the fate of humankind! Over 200 unique cards to collect Build your deck for different strategies and tactics Rich artwork and folklore from real mystical and esoteric traditions Compete against online opponents Practice mode to learn, test and improve your deck Complete quests and climb the leaderboard to receive amazing rewards! Cabals unites two gaming genres, combining the magic of collectible card games with the mechanics of a board game. This deep strategy is amplified when you are brave enough to compete online. The mobile version of Cabals has been available online since 2011 and has seen millions of matches fought on its battlegrounds. Rules in a nutshell: Build deck of at least 30 cards Use units, action cards and devices to outsmart your enemy in battles on the battlegrounds Win by conquering the opponent's stronghold or by reaching 60 domination points Now is the time to make it even better, designed from the ground up for PC with stunning graphics and atmospheric board layout. The improved deck editor makes it easier to choose the cards you want and manage multiple decks. And that is just the beginning! With your support, together, we can go even further! There’s nothing better than competing with other members of the Cabals Community. In the monthly War of Cabals tournament you can strive for the top of the leaderboards to receive amazing rewards. Take part in community hosted tournaments and regular giveaways on the social media channels. Now on Steam you can join the Cabals group to discuss your strategies with other Cabals Community members and of course give us your feedback to influence the continued development. The game even contains cards and battlegrounds that have been designed by you the Cabals Community! When going into battle there are 6 cabals to choose from; each with their own heroes, flavour, style and strengths. However, as you would expect in a world run by cabals, it’s not quite that simple. There are also 3 alliances between the cabals that allow advanced mixed deck permutations, not to forget the neutral cards that can be included in the deck of any cabal. Primal Alliance A shamanic group that mixes Slavic mythologies with weird psychoanalytic mind control techniques. Allied with forces of arctic nature they are believed to be operating out of the western reaches of the Soviet Union. Consists of aristocratic Irish witches and subterranean faerie folk. Celtic folklore meets Arthurian legends with means of buffing themselves and transforming tiles into gates to the underground. Dominion Alliance Esoteric engineers applying modern scientific methods to their worship of an energetic principle force. Underground power plants, somewhere in Southern Germany, manufacture their massive, unstable and risk taking Hyperborean cyborgs! Versed in Medieval alchemy and Arabic wisdom, these apprentices look to attain total mastery over matter. Their magic brings extra cards and resource manipulation from their laboratories thought to be hidden in Southern Spain. Nether Alliance Brings much needed nobility that is missing from other cabals. A lethal combination of brutal dragon spirit, disruption and surprise culminate in their powerful origins of Eastern Asia. Reaches out to ancient knowledge, astronomy and unimaginable strength that rarely leaves these dreadful priests empty handed. Their riches and ruthlessness originate from Northern Africa, allowing combinations of a deadly kind. Which side are you on?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/458410/header.jpg?t=1535641535",
    "Price": 0.0,
    "Developers": "Kyy Games",
    "Publishers": "Kyy Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/458410/ss_2e2b40ec99dfefd27db7a6860a1496ae8b4a9dab.1920x1080.jpg?t=1535641535,https://cdn.akamai.steamstatic.com/steam/apps/458410/ss_3bc6f5d025df203fe241d782cb4b2bace377d5de.1920x1080.jpg?t=1535641535,https://cdn.akamai.steamstatic.com/steam/apps/458410/ss_53becb796908bc112b5190a31a781b130121f6e6.1920x1080.jpg?t=1535641535,https://cdn.akamai.steamstatic.com/steam/apps/458410/ss_487c5f06916ccf505da94bdd61d2b9aa2c54e9e2.1920x1080.jpg?t=1535641535,https://cdn.akamai.steamstatic.com/steam/apps/458410/ss_fdce9da8bdba158c6064d4f06210f2081e17ccf8.1920x1080.jpg?t=1535641535,https://cdn.akamai.steamstatic.com/steam/apps/458410/ss_b5eb91dcebcc4817abd12ddb8dfaeacd6e4ed10c.1920x1080.jpg?t=1535641535,https://cdn.akamai.steamstatic.com/steam/apps/458410/ss_6b61fc7d5e42b7629af6c40d0f2bf3db1f88a24a.1920x1080.jpg?t=1535641535",
    "Slug": "cabals-magic-battle-cards",
    "Meta Title": "Cabals: Magic & Battle Cards: Feb 6, 2018, Kyy Games and ...",
    "Meta Description": "Looking for information on Cabals: Magic & Battle Cards? Check out the release date (Feb 6, 2018), developer insights from Kyy Games, and a complete gam...",
    "Alt Text Image": "Official header image for Cabals: Magic & Battle Cards game - Steam 458410",
    "Canonical URL": "https://gusku.site/game/cabals-magic-battle-cards",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cabals: Magic & Battle Cards\", \"description\": \"Looking for information on Cabals: Magic & Battle Cards? Check out the release date (Feb 6, 2018), developer insights from Kyy Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 6, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kyy Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kyy Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/458410/header.jpg?t=1535641535\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}