{
    "AppID": 1578650,
    "Name": "Citizen Sleeper",
    "Release date": "May 5, 2022",
    "About the game": "From the developer of In Other Waters, and featuring the stunning character art of Guillaume Singelin, Citizen Sleeper is a narrative RPG set on Erlin’s Eye, a ruined space station that is home to thousands of people trying to survive on the edges of an interstellar capitalist society. You are a sleeper, a digitised human consciousness in an artificial body, owned by a corporation that wants you back. Thrust amongst the unfamiliar and colourful inhabitants of the Eye, you need to build friendships, earn your keep, and navigate the factions of this strange metropolis, if you hope to survive to see the next cycle. An abandoned station on the edge of a system in crisis. Run down, chaotic, unruly, and alive—it was founded by idealists in the shadow of a corporate collapse. Now it is held together by anarchic alliances, ramshackle factions and a shared desire to be free from the gravity of corporate control. Every cycle you get up and choose what to do with your time. Toil in the yards, or take a bar shift. Search the markets for rare components or grab some street food. Make or break alliances, uncover truths and escape those that hunt you. Learn to survive and ultimately thrive, one cycle at a time. The station plays host to characters from all walks of life, trying to eke out an existence among the stars. Salvagers, engineers, hackers, bartenders, street-food vendors, each has a history which brought them here. You choose which of them you wish to help, and together you will shape your future. Hack into the station’s cloud to access decades of digital data, uncover new areas and unlock secrets. This is your unique power, and with it you can change your future. Corporate secrets, rogue AIs and troves of lost data await those willing to dive into the depths of the station’s networks. Essen-Arp: to them you are just property, one more asset in a portfolio that stretches across the stars. You are the product of an abusive system, in a universe where humanity’s expansion is marked by exploitation and extraction. Escape the makers of your decaying body, and chart your own path in a richly imagined, deeply relevant sci-fi world which explores ideas of precarity, personhood and freedom. Each cycle you roll your dice. Assign them to vast range of actions available on the station. With every action, choose what, and who, matters to you, shaping the lives of those around you, and ultimately the future of the station. Clocks track both your actions and the actions of others across the station. From becoming a local at the Overlook Bar to protecting a friend from Yatagan enforcers, clocks allow you to track your own progress and the influence you have on the world around you. Follow drives not quests, allowing you to pick and choose the stories and activities that matter to you. As you do, you will shape your character's five skills (Engineer, Interface, Endure, Intuit and Engage), unlocking perks and bonuses that reflect and change how you choose to live in this world. JOIN THE DISCORD FOR MORE EPISODE UPDATES ALSO FROM JUMP OVER THE AGE",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1578650/header.jpg?t=1657666339",
    "Price": 19.99,
    "Developers": "Jump Over The Age",
    "Publishers": "Fellow Traveller",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1578650/ss_d11e7a52bc97d82b9b83d9aa1312cc3710ec50e8.1920x1080.jpg?t=1657666339,https://cdn.akamai.steamstatic.com/steam/apps/1578650/ss_068f480ef3fdc28c0244e290f653cc01e96a3c0a.1920x1080.jpg?t=1657666339,https://cdn.akamai.steamstatic.com/steam/apps/1578650/ss_6b528fa7988c1e5048871f3c530be67ce574eadb.1920x1080.jpg?t=1657666339,https://cdn.akamai.steamstatic.com/steam/apps/1578650/ss_730f225650cb14351559b6e51045bc93f207593f.1920x1080.jpg?t=1657666339,https://cdn.akamai.steamstatic.com/steam/apps/1578650/ss_9db68bf85c1d9e44331f5a8dd4134aae8a744076.1920x1080.jpg?t=1657666339,https://cdn.akamai.steamstatic.com/steam/apps/1578650/ss_fc1ae5d631574cf95d41d220f30a9801d543c1f3.1920x1080.jpg?t=1657666339,https://cdn.akamai.steamstatic.com/steam/apps/1578650/ss_55fe1f0961b043847de965aed9ef754ea7e6d206.1920x1080.jpg?t=1657666339,https://cdn.akamai.steamstatic.com/steam/apps/1578650/ss_3c7e890b9de4017c88f6b6811bcb7f8b5eac0654.1920x1080.jpg?t=1657666339,https://cdn.akamai.steamstatic.com/steam/apps/1578650/ss_2e39beaf538199d9a8f1369046fd1f235d3e37c3.1920x1080.jpg?t=1657666339,https://cdn.akamai.steamstatic.com/steam/apps/1578650/ss_4f29f1e35829ac04209aebb383bd4856272ff34a.1920x1080.jpg?t=1657666339",
    "Slug": "citizen-sleeper",
    "Meta Title": "Citizen Sleeper: May 5, 2022, Jump Over The Age and Full ...",
    "Meta Description": "Looking for information on Citizen Sleeper? Check out the release date (May 5, 2022), developer insights from Jump Over The Age, and a complete game sum...",
    "Alt Text Image": "Official header image for Citizen Sleeper game - Steam 1578650",
    "Canonical URL": "https://gusku.site/game/citizen-sleeper",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Citizen Sleeper\", \"description\": \"Looking for information on Citizen Sleeper? Check out the release date (May 5, 2022), developer insights from Jump Over The Age, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 5, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jump Over The Age\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fellow Traveller\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1578650/header.jpg?t=1657666339\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}