{
    "AppID": 688930,
    "Name": "City of Ages: Picture Supportive Text MUD (server and client included)",
    "Release date": "Oct 13, 2017",
    "About the game": "WINDOWS 8 users: UAC BLOCKING you? [A WELL KNOWN ISSUE - SOLVED] If you find that when you run the Run the Client button doesn't bring up the client your Windows operating system is blocking with UAC. Pulling down UAC to the bottom isn't the full solution. To resolve the issue go into: C:\\Program Files (x86)\\Steam find STEAM.EXE right click go to properties and select Run as Administrator. This will solve the problem for all your products that use two applications to run your games including City of Ages. Windows 10 later issue got rid of this issue. ******************* A quick tidbit about the amount of code that is in the server alone, 5.73 Million bytes; that is a lot of code, all yours with purchase! Mostly written using SQL statements, that means speedy code! Also, CoA telnet client will work with other telnet MUDs, also CoA server has been tested and works with any and all other telnet clients and those clients running from other operating systems. The client is designed for everyone to make leveling much easier! Also, some find Text games more fun because a tonne more time is spent on the code over graphics. For those interested in the challenge of taking up the code. VB 6 sr 6, is still a decent language to work with and easy to learn, this is why this language was chosen. Also you will need Access 97 sr 1 if you want to dig into the database. You are all also welcome to advertise your mud internet IP address in your messages here under the description, so others can play your MUD. The Server and Client use a true X,Y,Z coordinate system giving real depth to the Mudding environment; allowing the development of a role-play feel and immersive realm. Portability friendly, use any telnet capable mobile device, tablet, or any type of computer to connect to your MUD! Not a coder, no problem! Use the IMMO command and learn to build, takes awhile to get used to them but they work great! There is instructions of all the main player control and immortal build commands right from the City of Ages client, for ease of use. You begin your adventure with medieval weapons including cross/bows/slings and bolts/arrows/and rocks, and move slowly into modern weaponry. There are machineguns/hand phasers and ammo. Starships are fully loaded with weapons/shields and mines, use them as a house or beam down to just about any location in the realm. Stock-market, Golfing [its hilarious to golf grenades around the realm], Stargates, Starships, a tonne of different types of Quest engines, as well as normal types of quests, and many built-in Door games. Door games include, a Mini-Casino, a real to life Roulette game, a fun Horse Racing game, one playable Arcade game, Dice, and a Deck of Cards. For Role-play we have advanced EMOTES for you and your mountable pets. The creatures of the realm go on city Raids, and will eventually mark you as a bounty over time and then they will try to catch you off guard. Great for those new to Mudding and especially those that played Internet MUDS, and BBS Door games. This MUD also allows you to link/import your own pictures and sounds, which is not included, for you to find and optionally create. There are loads of free pictures and free sounds found on the web. The MUD is fully finished and fully programmed to automatically run your quests for you. Happy Hunting!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/688930/header.jpg?t=1610479112",
    "Price": 0.0,
    "Developers": "Darren N Lory",
    "Publishers": "Formsmatter",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/688930/ss_3c959f587ab6a53875cb9493797b207d9cca4f32.1920x1080.jpg?t=1610479112,https://cdn.akamai.steamstatic.com/steam/apps/688930/ss_9006e87ff58abdf408870b92e378ccd87cd15dbd.1920x1080.jpg?t=1610479112,https://cdn.akamai.steamstatic.com/steam/apps/688930/ss_6570184fe33448e82e5ecc0fa0c9314c717bedbe.1920x1080.jpg?t=1610479112,https://cdn.akamai.steamstatic.com/steam/apps/688930/ss_fd64d13d82beff7ad6b55b817e44eb0adb05c6ed.1920x1080.jpg?t=1610479112,https://cdn.akamai.steamstatic.com/steam/apps/688930/ss_c39da13d1829efaddaa71972e7b6d63ecb676ad7.1920x1080.jpg?t=1610479112,https://cdn.akamai.steamstatic.com/steam/apps/688930/ss_f520f7eb8362cfb31b788124ab353994fe6ccc56.1920x1080.jpg?t=1610479112,https://cdn.akamai.steamstatic.com/steam/apps/688930/ss_59d3cfc76a7305c0f574f5364dac23536d4be20c.1920x1080.jpg?t=1610479112,https://cdn.akamai.steamstatic.com/steam/apps/688930/ss_48429623c129de2e34f91fb40edceec6cbbe7b35.1920x1080.jpg?t=1610479112,https://cdn.akamai.steamstatic.com/steam/apps/688930/ss_64ecbf5304da2729ec4684c1a2e854e0dff92aa8.1920x1080.jpg?t=1610479112",
    "Slug": "city-of-ages-picture-supportive-text-mud-server-and-client-included",
    "Meta Title": "City of Ages: Picture Supportive Text MUD (server and cli...",
    "Meta Description": "Looking for information on City of Ages: Picture Supportive Text MUD (server and client included)? Check out the release date (Oct 13, 2017), developer ...",
    "Alt Text Image": "Official header image for City of Ages: Picture Supportive Text MUD (server and client included) game - Steam 688930",
    "Canonical URL": "https://gusku.site/game/city-of-ages-picture-supportive-text-mud-server-and-client-included",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"City of Ages: Picture Supportive Text MUD (server and client included)\", \"description\": \"Looking for information on City of Ages: Picture Supportive Text MUD (server and client included)? Check out the release date (Oct 13, 2017), developer ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 13, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Darren N Lory\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Formsmatter\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/688930/header.jpg?t=1610479112\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}