{
    "AppID": 2016220,
    "Name": "EarthRoyale",
    "Release date": "Jul 29, 2022",
    "About the game": "EarthRoyale is a Map simulation Observer game where the game each turn / a few in game months time, chooses one of many events to edit the world map or add lore behind the countries of this future or historic world. the base games include a bunch of customization to the start of the game, but the map without downloading scenarios is stuck to a modern day de facto map (each province in game is owned by who actually controls, with some exceptions to constantly changing stuff). some of the ways you can customize the start of a game is by: Disable or enable any continent that you want. Make provinces, cultures or easter eggs independent at start. Edit the %edges of any event happening or choose one of the pre made modes of it. Each turn one of many things can happen: division: a random country gets divided by giving each province to the closest other country. Annexation: A random country gets given to one of their bordering countries, or if it only got coastal borders, the closest country. Shrink/Expand: A random country either takes over a few of the closest provinces to it or gives away up to 75 % of the countries provinces to each province closest other country. Colonization: A random country with coast takes over a random coastal province from another country but if there is any coastal provinces that are unclaimed, the game will prioritize it over all claimed coastal provinces. Independence: Each easter egg, province, culture, or previous country tag of any province within a random country has a chance of having all provinces with that tag within the country gain independence. Nuke: A random province is selected and all provinces around it within 3 different sized circles will be turned into Wasteland, Unclaimed, Fire. in that order from smallest to biggest circle. Collapse: All provinces within a random country will be turned into unclaimed, but there's a chance that multiple province, culture or previous country tags within the country gain independence Union: 2 countries will join together into a new country named 'country1 - country2', a union can form a union with another union or normal country. Split: a country will either split into north and south country or west and east country, or if it's a union, it will make all member states independence as they where when joining the union and all provinces that wasn't a part of a member state will be divided between the former member states based on who is closest Flood: A random province will be turned into flooded or water, it will also make 1 to 2 closest provinces do the same over and over again for up to 15 provinces. Fire: a random province will have a fire start in it. There is also multiple types of provinces. Normal/Claimed: a province that is owned by a country. it will have the country it belongs to's colour which is a random colour generated when the country was made by the game. it's also the only type of province effected by the events. UnClaimed: a province that is not owned by any country, it's a light brown colour and if one of the 3 closest provinces is claimed it will have a chance to be claimed by that country each turn. Wasteland: a province that is not owned by any country and is not claimable, it's a darker brown colour and if it's generated by the game and not made by the map editor, it will turn into unclaimed after a few turns Flooded: A province that is created by the flood event. it is coloured the same as the ocean, a darker blue and it will each turn loose it's flood level, the further away from where the flood started the lower flood level it starts with, when it hits 0 it will turn into unclaimed. Fire: A province that is created by the fire event. it is coloured a orange colour and each turn moves to another province and lose some strength, or splits into 2 provinces with only half it's strength. when the strength hits 0, it will die of, each province the fire leaves will be turned into unclaimed. None: A province that just doesn't exist, it's created if you disable a continent before starting a game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2016220/header.jpg?t=1659121152",
    "Price": 5.94,
    "Developers": "Lizzycat / Lizabeth Gidlund",
    "Publishers": "Lizzycat / Lizabeth Gidlund",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2016220/ss_d868619f0f16a09758302ab85e81413c68985dd6.1920x1080.jpg?t=1659121152,https://cdn.akamai.steamstatic.com/steam/apps/2016220/ss_de7de3e6c6f880be47915ec92408c1dcc250d4bc.1920x1080.jpg?t=1659121152,https://cdn.akamai.steamstatic.com/steam/apps/2016220/ss_6359c15c7a5b2a8c2660b17b9b7e6236fd1c3802.1920x1080.jpg?t=1659121152,https://cdn.akamai.steamstatic.com/steam/apps/2016220/ss_855923412369e30f3babe6019b8714562068b7d1.1920x1080.jpg?t=1659121152,https://cdn.akamai.steamstatic.com/steam/apps/2016220/ss_64abb3abec6c7f7061c0ee3b0af9455ec1f2a1d4.1920x1080.jpg?t=1659121152,https://cdn.akamai.steamstatic.com/steam/apps/2016220/ss_a0763d3b8f7d1234fea22c2dbeb8df2b3f88d2f1.1920x1080.jpg?t=1659121152,https://cdn.akamai.steamstatic.com/steam/apps/2016220/ss_fb24683da3cdc4e5b7759b40a286cd7827173ef2.1920x1080.jpg?t=1659121152,https://cdn.akamai.steamstatic.com/steam/apps/2016220/ss_4098e7ab7569140075e8484010be3f526db0fe10.1920x1080.jpg?t=1659121152",
    "Slug": "earthroyale",
    "Meta Title": "EarthRoyale: Jul 29, 2022, Lizzycat / Lizabeth Gidlund an...",
    "Meta Description": "Looking for information on EarthRoyale? Check out the release date (Jul 29, 2022), developer insights from Lizzycat / Lizabeth Gidlund, and a complete g...",
    "Alt Text Image": "Official header image for EarthRoyale game - Steam 2016220",
    "Canonical URL": "https://gusku.site/game/earthroyale",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"EarthRoyale\", \"description\": \"Looking for information on EarthRoyale? Check out the release date (Jul 29, 2022), developer insights from Lizzycat / Lizabeth Gidlund, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lizzycat / Lizabeth Gidlund\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lizzycat / Lizabeth Gidlund\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2016220/header.jpg?t=1659121152\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.94, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}