{
    "AppID": 2066550,
    "Name": "Error143",
    "Release date": "Jul 26, 2022",
    "About the game": "You video call Micah. It doesn’t even finish ringing once before he picks up. He scrunches his face up while he says, “What’s up, loser?” as he tries to hold back a yawn. “Why are you calling me at 3 a.m.? Shouldn’t you be sleeping by now? Like the angel you are.” It takes a couple of blinks for him to register your face. But once he does, a wry smile creeps onto his face. 'Don’t tell me you miss me,” he says, raising his brow. A jolt of butterflies rushes throughout your body when he says that, and you’re embarrassed to admit it. But it’s late. And you’re tired. And your brain short circuits…which is why you have a dumb and flustered look on your face. It takes him a second to register what’s happening. Once he understands, he starts blushing and cups his face with both hands. Between his fingers, a whimpered sound comes through, “Don’t tell me you actu—.” You were not going to let him finish that sentence. You gathered all your bravado together and muster the willpower to piece together, 'Wow, if I knew my silence was all it took for you to crumble, I would’ve become a mime.” He buries his face in his hands for a moment longer. But once he uncovers them, his familiar cocky smile is back, “Aww, but if you did that, I wouldn’t be able to hear all of your snarky comments'. He rests his head on his hand, cocking his face to the side, flirting with you. “You’re such a flirt. Do you really think anyone would fall for that?”. You know he's just looking into the webcam, but for a moment it feels like he's looking directly into your eyes. “I don’t think anyone else would fall for that, just you.” Features 1 Hot snarky asshole man (stupid f-ing smirk man_) pronoun opSIONS!! &lt;3 &lt;# 3 endings (1 bad end, 1 good end, 1 proposal) hella soundtracks and songs some amount of play time? like 1-3 hours depending on how ur vibing ability to hack into the dev's PC and change ur m00ds frisghteining ability to make hacking look like a hangman puzzle 5 million dollars PLEASE PLAY WITH THE MUSIC BOX THERE ARE LIKE HELLA SONGS OOP nuggets,,, Warnings waMRING DEEX NUTS ON UR FACE! AHA CUSSING!! bad language :(( fuck having feelings maybe??? fallin' in love???? lol simp Warnings that contains spoilers",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2066550/header.jpg?t=1658852343",
    "Price": 0.0,
    "Developers": "Jenny Vi Pham",
    "Publishers": "Jenny Vi Pham",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2066550/ss_b69fdb0494a8567cc7c4d43f00cdfedc45304070.1920x1080.jpg?t=1658852343,https://cdn.akamai.steamstatic.com/steam/apps/2066550/ss_74d54e418c3748bf7eb5bc9e4dbede5695a2b7be.1920x1080.jpg?t=1658852343,https://cdn.akamai.steamstatic.com/steam/apps/2066550/ss_0dcaeffdfc8ff40823818d1120123703dde95418.1920x1080.jpg?t=1658852343,https://cdn.akamai.steamstatic.com/steam/apps/2066550/ss_7df69878cae05196fd6550447ca2fcfe93a91d7f.1920x1080.jpg?t=1658852343,https://cdn.akamai.steamstatic.com/steam/apps/2066550/ss_1538f45b05072573d5e2a224cde4dd388a7b28d0.1920x1080.jpg?t=1658852343",
    "Slug": "error143",
    "Meta Title": "Error143: Jul 26, 2022, Jenny Vi Pham and Full Overview",
    "Meta Description": "Looking for information on Error143? Check out the release date (Jul 26, 2022), developer insights from Jenny Vi Pham, and a complete game summary.",
    "Alt Text Image": "Official header image for Error143 game - Steam 2066550",
    "Canonical URL": "https://gusku.site/game/error143",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Error143\", \"description\": \"Looking for information on Error143? Check out the release date (Jul 26, 2022), developer insights from Jenny Vi Pham, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jenny Vi Pham\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jenny Vi Pham\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2066550/header.jpg?t=1658852343\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}