{
    "AppID": 655290,
    "Name": "Escape The Pacific",
    "Release date": "Feb 23, 2018",
    "About the game": "A Realistic Survival Game set in the 1850's Experience raw, real survival in the Pacific. Collect resources and build a modular raft. Learn and master realistic sailing mechanics with different difficulty levels. Build a shelter to protect you from the challenging Pacific-like weather and seasons. Hunt for food, craft tools and weapons, build a sundial to determine the time of the day, use the sextant to find out your global position, and draw your map from scratch using the triangulation method. Explore the endless world based on islands and island clusters. Simulate real-life scenarios and learn how to survive in the wild Pacific! Build a modular raft from scratch and explore the full area of the real Pacific. You can build a raft with just a captain’s cabin on it or you can go crazy and build a survival floating base with chests for storage, drying racks for food preservation, sleeping arrangements, item holders and so on. The decision is yours. The realistic sailing mechanics enable you to learn how to sail. You can start with the beginner-friendly easy mode and switch to a more advanced one once you mastered your raft. Scavenge the waters and surrounding islands for clues and items. Find out the time of the day by building a Sun Dial. Find a piece of paper and a compass to draw your map from scratch using the Triangulation method. If you’re ready to explore new island clusters, find a Sextant and off you go into the unknown! Weather data from the real Pacific is implemented in the game. With up to 27 different weather factors the player can simulate a plethora of realistic scenarios: Hot, cold, dry, windy, calm and many more combinations. The in-game weather (wind, temperature, rain etc.) and seasons are based on the day of the year and the actual latitudinal position of the player on the global map. Items can get wet, and while wet wood is perfect to smoke food, it can be deadly when the player is suffering from starvation and can’t light up a fire. Everything is dynamic in this game. While the strong wind is perfect for sailing, it can cause the rain to fall at an angle and reach the inside of a building through a window. Build, craft and cook with the help of blueprints in three simple steps: Place the desired blueprint, add the required resources and finalize it by either using a tool (hammer) or by placing it on a cooking spot (in case of a recipe). Build complex structures on land or your raft and stay alive by cooking a delicious meal. FEATURES ALREADY IMPLEMENTED The following features can be experienced in the game at this point. We are keeping this section updated as best we can, to reflect the current state of the game progress. Sandbox mode Endless procedural generated map with randomized seed numbers Different types of islands (Small, big, forest, rocky, archipelago, with pond, with hill etc.) Navigation and Cartography (Compass, Sun Dial, Triangulation, Sextant) Engaging map building from scratch Wildlife Weather mechanics with data taken from the real Pacific Realistic sailing mechanics Realistic sun, moon and celestial bodies movement Latitude based weather and seasons Complex temperature mechanics Different difficulty levels and time flow intervals Complex player statistics and experience system Dynamic fire, rain and moisture mechanics Immersive building and crafting mechanics (raft, shelter and tools) Modular raft building Modular shelter building on land or on the raft Fast Time (sit down and let time pass faster) Fast Sail (sail super fast out in the open ocean) FEATURES PLANNED FOR VERSION 1.0 The following features are not implemented yet in Escape the Pacific, however, they are planned to be implemented during the Early Access development phase. These features are subject to change, based on the feedback and suggestions we receive from players. In no particular order, these are: Grand Narrative (Primary story with quests, secondary quests, End Game content) Material aging Building degradation by environmental factors Building repair mechanics NPCs Different island biomes Additional wildlife Additional tools and weapons Fauna and flora matching the latitudinal position Realistic tides based on moon movement Tsunamis, typhoons, and wide variety of atmospheric and oceanographic weather elements Illness and cure mechanics Achievement system Refined UI 2 player co-op mode 3rd person VR support Ongoing optimization",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/655290/header.jpg?t=1658259682",
    "Price": 14.99,
    "Developers": "Gamers4Gamers Team",
    "Publishers": "Gamers4Gamers Team",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_ff293eefdfa169a4efe58df48c4547f715eea611.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_0f03d9acc001fd2e0804b6fa0f01ad316eecba72.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_fb576f45fa7ea240a959e6b1168bccfd6a7abda8.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_e28340dfe103bba08e993f3161dafec1349f5b93.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_8f74a1ba5f7ad02903e21fc187f1086ea2cf45f1.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_8ce325069e48293294667e216af2d12fd196ba59.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_5e96b629c1b4ff8985285a5eb5a8f1100b96373b.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_2f64473258038e2811c32afb8ba21c1d39b62fcc.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_830b72ffe8c3c446caf6567722b6242bf067c401.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_fbc0bac091b37a82822d1001c45685476803e293.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_12915efabd8380402600d325f0e07350c9abcf36.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_c717b58b9abf042afd6793a6cd767e36559b9c8b.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_96c61c97ce4e85d20e44fbac5301969ff34e8bf3.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_acf0623b66f957b7a6e64d58f32b16b03ebfbdd2.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_4bbe6f0d487b4f7755f28247830b6fbfa4bbc7bd.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_6283afaeecdd0b82c920aa88fde56315a06481ff.1920x1080.jpg?t=1658259682,https://cdn.akamai.steamstatic.com/steam/apps/655290/ss_2cecaf12a0f3f625fd52282b77411dbcecfefbf6.1920x1080.jpg?t=1658259682",
    "Slug": "escape-the-pacific",
    "Meta Title": "Escape The Pacific: Feb 23, 2018, Gamers4Gamers Team and ...",
    "Meta Description": "Looking for information on Escape The Pacific? Check out the release date (Feb 23, 2018), developer insights from Gamers4Gamers Team, and a complete gam...",
    "Alt Text Image": "Official header image for Escape The Pacific game - Steam 655290",
    "Canonical URL": "https://gusku.site/game/escape-the-pacific",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Escape The Pacific\", \"description\": \"Looking for information on Escape The Pacific? Check out the release date (Feb 23, 2018), developer insights from Gamers4Gamers Team, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 23, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gamers4Gamers Team\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gamers4Gamers Team\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/655290/header.jpg?t=1658259682\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}