{
    "AppID": 724970,
    "Name": "神舞幻想 Faith of Danschant",
    "Release date": "Dec 21, 2017",
    "About the game": "A 3D ancient and fantasy RPG console game is created by Beijing Joyfun（Wangyuan shengtang’s branch company). Users will have a fabulous adventure and start their own legend in a fictional world based China’s traditional mythology. The unique development team gathered the top talents from the Giant China by using UE4 and advanced motion capture technology mixed China traditional music and dance to create a musical and visual feast! From a Mythology to your Dreamland Once upon a time, there is a fantastic land named NINE Land. During the reign of Kingdom YAO, a disaster called “JING” eroded the whole land. Kingdom YAO hold the huge sacrificial ceremony and pray to the god “why suffering such disaster”. However, it failed, the North &amp; South Stars disappeared, with a rumors of cutting off the Fate Line, the land has got into panic and the balance between countries smashed. But there is a tiny sparking in the dark, far beyond these chaos, a youth just start his journey…. The Visual Feast from Unreal Engine4 Unreal Engine4 as most powerful 3D engine naturally has used in the game. UE4 has the most advanced character bone animation system and physical collision engine, which bring the much more real RPG experience. A visual feast starts with delicate 3D modeling and rendering, latest DX special effect, large scene depth regulation, motion blur, advanced anti-aliasing, particle renderer, dynamic light cover, tessellation and other series of innovative technology. We created an original battle mode: beside the typical fighting skill in regular RPG game, the weakness connection system, spirt's pledge system, assistance system and strategy movement will be the very important elements in a battle. when users know these strategy better, get down a strong BOSS could be faster. Strategy Movement In traditional turn base battle, user always be kncoked down by a boss in a lower hp or unable to attack in priority while standing behind. Therefore, the strategy movement can settle this problem down. Friends Assistance We has broken the rules of turn base battle, because the Friends Assistance system make it even better. In one battle, a user could use 3 main roles and choose another role help in battle,even NPCs are available. Battle Enchanted Combo This key feature includes four parts: weakness time, double hit, two system skill and spirt's assistance.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/724970/header.jpg?t=1632301868",
    "Price": 29.99,
    "Developers": "北京九鳳信息科技有限公司",
    "Publishers": "北京网元圣唐娱乐科技有限公司",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/724970/ss_33349caf26095345673f26a928d53bc7bdd26c86.1920x1080.jpg?t=1632301868,https://cdn.akamai.steamstatic.com/steam/apps/724970/ss_4126aab346703e8be0a93bb504a475d306df0972.1920x1080.jpg?t=1632301868,https://cdn.akamai.steamstatic.com/steam/apps/724970/ss_22d4a8cbf4a3abb7fa122a9d4a2b9db11204414d.1920x1080.jpg?t=1632301868,https://cdn.akamai.steamstatic.com/steam/apps/724970/ss_7c5674679a2f6f344d1c2d906bcea05337f80419.1920x1080.jpg?t=1632301868,https://cdn.akamai.steamstatic.com/steam/apps/724970/ss_76122e2d1c2713dc01aa7ef02b61fe50c15a8ee8.1920x1080.jpg?t=1632301868,https://cdn.akamai.steamstatic.com/steam/apps/724970/ss_d6cff12dbda434d96ba74dcc4a2f7f1c9e03fd25.1920x1080.jpg?t=1632301868,https://cdn.akamai.steamstatic.com/steam/apps/724970/ss_5446dcfb093fb11b999fb3c115227e12244ab393.1920x1080.jpg?t=1632301868",
    "Slug": "faith-of-danschant",
    "Meta Title": "神舞幻想 Faith of Danschant: Dec 21, 2017, 北京九鳳信息科技有限公司 and F...",
    "Meta Description": "Looking for information on 神舞幻想 Faith of Danschant? Check out the release date (Dec 21, 2017), developer insights from 北京九鳳信息科技有限公司, and a complete game...",
    "Alt Text Image": "Official header image for 神舞幻想 Faith of Danschant game - Steam 724970",
    "Canonical URL": "https://gusku.site/game/faith-of-danschant",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u795e\\u821e\\u5e7b\\u60f3 Faith of Danschant\", \"description\": \"Looking for information on \\u795e\\u821e\\u5e7b\\u60f3 Faith of Danschant? Check out the release date (Dec 21, 2017), developer insights from \\u5317\\u4eac\\u4e5d\\u9cf3\\u4fe1\\u606f\\u79d1\\u6280\\u6709\\u9650\\u516c\\u53f8, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u5317\\u4eac\\u4e5d\\u9cf3\\u4fe1\\u606f\\u79d1\\u6280\\u6709\\u9650\\u516c\\u53f8\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u5317\\u4eac\\u7f51\\u5143\\u5723\\u5510\\u5a31\\u4e50\\u79d1\\u6280\\u6709\\u9650\\u516c\\u53f8\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/724970/header.jpg?t=1632301868\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}