{
    "AppID": 1981780,
    "Name": "FAMILY BATTLE タッグアリーナ",
    "Release date": "Aug 5, 2022",
    "About the game": "A big fight by a family of superheroes! A 2v2 tag-team battle action arena! Lemon or mayo for Karaage? What is the end of the endless struggle between the families who have been divided into two sides with everyone having one firm choice... This is a 2v2 3D tag team battle action game that can be played online. The tag team is divided into 'attacker' and 'support' roles, and must cooperate with each other to strategically carry out battles. Attackers use melee weapons and fight opponents on the front lines to inflict damage. In addition to the normal attack, the attacker can use two abilities that differ from character to character in order to corner the opponent and force them into a fold. Supports use long-range weapons but cannot inflict damage on their opponents. However, by using a wide variety of skills, they can control the battle situation as they wish. The support is the key to the game plan, sometimes protecting the attacker and sometimes paving the way for the attacker. In this tag-team battle, it is difficult to win by one person's strength alone. By cooperating and complementing each other, partners can enjoy exhilarating and strategic battles that cannot be achieved by a single player. Blow your opponent off the field and give candy to your pet cat . If you attack an opponent at the edge of the field, you can blow him off the field. Players who fall off the field are returned to the starting point and are forced to distance themselves from their allies. Dive into the pocket of the opponent who is now alone at once and turn him into a concentrated firefight. In addition, pet cats occasionally appear on the field in search of treats. If the support player approaches the cat, he or she can give the cat a treat, and if the support successfully keeps giving the cat a treat for a certain period of time, the cat will inflict heavy damage on the opposing tag team in return. The attacker must protect the support from the attacker's attack during the time the support is giving the cat a treat, as the cat will be in a defenseless state. Go online and battle with players from all over the country! Online matches allow you to enjoy arena battles against tag teams from all over the country. Fight against many strong opponents and make your name known all over the world.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1981780/header.jpg?t=1659766962",
    "Price": 7.99,
    "Developers": "nekogameteacher",
    "Publishers": "kodansha games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1981780/ss_d9ca16e1a2492533ceaf1890d0d3bff87d966bc0.1920x1080.jpg?t=1659766962,https://cdn.akamai.steamstatic.com/steam/apps/1981780/ss_3e09f071e8ab23ad3551a8be1442756a85b82539.1920x1080.jpg?t=1659766962,https://cdn.akamai.steamstatic.com/steam/apps/1981780/ss_f7c55b34d3c3bd8684992fe27b7d223805a82709.1920x1080.jpg?t=1659766962,https://cdn.akamai.steamstatic.com/steam/apps/1981780/ss_95a8671cf68e31e2a60f0b67538bc1ead639b52e.1920x1080.jpg?t=1659766962,https://cdn.akamai.steamstatic.com/steam/apps/1981780/ss_75f9a2544553b562d1b06af2696e340c85f00da6.1920x1080.jpg?t=1659766962",
    "Slug": "family-battle",
    "Meta Title": "FAMILY BATTLE タッグアリーナ: Aug 5, 2022, nekogameteacher and F...",
    "Meta Description": "Looking for information on FAMILY BATTLE タッグアリーナ? Check out the release date (Aug 5, 2022), developer insights from nekogameteacher, and a complete game...",
    "Alt Text Image": "Official header image for FAMILY BATTLE タッグアリーナ game - Steam 1981780",
    "Canonical URL": "https://gusku.site/game/family-battle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"FAMILY BATTLE \\u30bf\\u30c3\\u30b0\\u30a2\\u30ea\\u30fc\\u30ca\", \"description\": \"Looking for information on FAMILY BATTLE \\u30bf\\u30c3\\u30b0\\u30a2\\u30ea\\u30fc\\u30ca? Check out the release date (Aug 5, 2022), developer insights from nekogameteacher, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 5, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"nekogameteacher\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"kodansha games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1981780/header.jpg?t=1659766962\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}