{
    "AppID": 834280,
    "Name": "Fishing Sim World®: Pro Tour",
    "Release date": "Sep 18, 2018",
    "About the game": "Fishing Sim World: Pro Tour features an authentic career mode where you work your way up to an elite angler competing against over 100 of the best anglers in the world across Bass, Carp and Predator fishing whilst unlocking sponsorship opportunities, gaining career earnings and social media followers as you go. PLAY IT YOUR WAY Custom multiplayer allows you to set the rules as you take on your friends online. Choose different options such as number of rounds, length of match, catch species, venue, weather conditions etc. Participate in online tournaments which form the Dovetail Fishing League to try and earn the coveted title of ‘Angler of the Month’ and great rewards. PLAY AGAINST THE BEST As well as over 100 of the best anglers in the world - Fishing Sim World: Pro Tour is fully endorsed by Scott Martin, the most successful FLW Tour bass angler of all time as well as the host of the Scott Martin Challenge TV show on Discovery Channel and Ali Hamidi, leading Korda angler as well as executive producer and presenter of ITV’s Monster Carp and The Big Fish Off. LUCK’S GOT NOTHING TO DO WITH IT You will need all your skills and tactics to master the variety of the 10 venues. Use your boats sonar and GPS on Bass tour destinations, Lake Guntersville and Lake Travis or stalk from the margins on famous Carp fishing lakes Gigantica and Manor Farm at Linear Fisheries. There are hundreds of items of equipment to choose, from over 50 licensed partners including 13 Fishing, Evinrude, Booyah, Korda and RidgeMonkey. You will need it all when targeting the 29 different species of fish such as varieties of Bass and Carp, Brown and Rainbow Trout, Wells Catfish and Channel Catfish each with their own fish behavioral systems and affected by issues such as weather conditions and time of day. Key Features Career mode – Take on over 100 pro anglers including Scott Martin, Jacob Wheeler, Ali Hamidi and Ian Russell. Choose your path from Bass, Carp and Predator or choose all three. Your path is in your hands with the ability to change your discipline at any time. Unlock sponsorship opportunities and gain social media followers as well as career earnings as you rise from amateur to elite. Custom Multiplayer – Fish against your friends online and choose your own options such as number of rounds, length of match, catch species, venue, weather conditions and time of day Online Tournaments – Participate in the Dovetail Fishing League to try and earn the coveted title of ‘Angler of the Month’ for great rewards. Venues, Equipment and Species – 10 venues, including 5 US Bass venues and 5 European venues. Over 50 licensed partners offering hundreds of items of equipment and 29 different species of fish. Community and Mastery Challenge system – Complete community, weekly and in-game mastery challenges to unlock exclusive items.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/834280/header.jpg?t=1637159761",
    "Price": 19.99,
    "Developers": "Dovetail Games",
    "Publishers": "Dovetail Games - Fishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/834280/ss_fee03c15ad2b786e45174f73b39a2ae18776fe51.1920x1080.jpg?t=1637159761,https://cdn.akamai.steamstatic.com/steam/apps/834280/ss_f6c84683577ae100386e6f20db496da1f93c9ee3.1920x1080.jpg?t=1637159761,https://cdn.akamai.steamstatic.com/steam/apps/834280/ss_f586610abc0b5b00578581b77e798eddb665afc0.1920x1080.jpg?t=1637159761,https://cdn.akamai.steamstatic.com/steam/apps/834280/ss_1ed92c3f229dde2b8ed266515fe83468c2e75269.1920x1080.jpg?t=1637159761,https://cdn.akamai.steamstatic.com/steam/apps/834280/ss_bef239632bc005885d64d38e584d81cbdc0c3ccf.1920x1080.jpg?t=1637159761,https://cdn.akamai.steamstatic.com/steam/apps/834280/ss_97d03a9cd160bf26e658e455a4684551dccc1dc0.1920x1080.jpg?t=1637159761,https://cdn.akamai.steamstatic.com/steam/apps/834280/ss_6c2209a958b7f7d87314b6eb7655e9753c3aa272.1920x1080.jpg?t=1637159761,https://cdn.akamai.steamstatic.com/steam/apps/834280/ss_ac90651ac64904e64100b06cb43b3417099d3b2b.1920x1080.jpg?t=1637159761,https://cdn.akamai.steamstatic.com/steam/apps/834280/ss_f0b087eb0df811a80c3999f34252bc11e835617e.1920x1080.jpg?t=1637159761",
    "Slug": "fishing-sim-world-pro-tour",
    "Meta Title": "Fishing Sim World®: Pro Tour: Sep 18, 2018, Dovetail Game...",
    "Meta Description": "Looking for information on Fishing Sim World®: Pro Tour? Check out the release date (Sep 18, 2018), developer insights from Dovetail Games, and a comple...",
    "Alt Text Image": "Official header image for Fishing Sim World®: Pro Tour game - Steam 834280",
    "Canonical URL": "https://gusku.site/game/fishing-sim-world-pro-tour",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fishing Sim World\\u00ae: Pro Tour\", \"description\": \"Looking for information on Fishing Sim World\\u00ae: Pro Tour? Check out the release date (Sep 18, 2018), developer insights from Dovetail Games, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 18, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games - Fishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/834280/header.jpg?t=1637159761\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}