{
    "AppID": 1724670,
    "Name": "明途之境",
    "Release date": "Sep 12, 2021",
    "About the game": "Mysterious Land Of Finding Yourself is a turn-based rogue-like independent game imitating real-time It tells the story of people in some other worlds being sent by an indescribable existence to a secret realm composed of multiple worlds for trial. This is a real-time turn-based game. Although the game looks like a real-time battle, it is actually a turn-based game. The protagonist’s skills are the same as those of monsters and summons. The cooldown is calculated on the same schedule. When the cooldown time is up, the player can get a corresponding number of uses of the skill. Compared with the traditional turn-based game, our game is more flexible. As long as the skill has the number of uses, you can use it, and the rhythm is faster. If you don't know how to use the space bar to pause the game If you do, you may even feel that you need hand speed The protagonist will have a fixed role skill and a random skill at the beginning. As the monsters gain experience, the protagonist will upgrade to obtain new random skills. The combination of skills with high affinity will double the protagonist’s combat effectiveness. Players can get money from battle. Money can buy equipment in the store, and use the purchased equipment to synthesize advanced equipment with better attributes. You can also change skills in the skill store. No matter how good the skill set does not have the attribute support of the equipment, it will not work. Yes! Some advanced equipment will even provide passive skills. Of course, the equipment will only take effect if you wear it on the protagonist, don't forget! In addition to buying equipment, money can also buy mercenaries in the mercenary market, and you can also spend money to upgrade mercenaries purchased before, up to the same level as the protagonist. Players cannot control the actions of mercenaries, but mercenaries will be selected by monsters As the goal, it can disperse the pressure of the protagonist's blood volume, but once the mercenary is still dead at the end of the battle, it will be removed from the team. In the recent version of the game mechanics, we have added a new mechanism: treasures, unlike equipment, treasures are often free and obtained through the victory of boss battles, but the positive effects of treasures are often accompanied by negative effects. After all, there is no free in the world. For lunch... There is a save button at the bottom of the settings panel. After saving, you can use the load game button to return to the current situation. The game is currently under development. It is best to use the save button frequently. If you encounter a stuck situation, please contact my email which could be found in our contact information,and package your game record and send it to me. The game record is generally located at: C:\\Users\\'your computer user name'\\AppData\\LocalLow\\DefaultCompany\\MingTuZhiJing Just make this MingTuZhiJing folder into a compressed package, thanks",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1724670/header.jpg?t=1634019333",
    "Price": 4.99,
    "Developers": "3Y Studio",
    "Publishers": "3Y Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1724670/ss_c6f5f4f4c87ffd152912e44caeec1c281871ba1f.1920x1080.jpg?t=1634019333,https://cdn.akamai.steamstatic.com/steam/apps/1724670/ss_201e65f64927b7281518aa8c7beb602af0e20acd.1920x1080.jpg?t=1634019333,https://cdn.akamai.steamstatic.com/steam/apps/1724670/ss_e00d0d5017a5b6ef162453a142f0639c7afe0f59.1920x1080.jpg?t=1634019333,https://cdn.akamai.steamstatic.com/steam/apps/1724670/ss_d7dadf3787c1d731a3258a91809393c292937ee0.1920x1080.jpg?t=1634019333,https://cdn.akamai.steamstatic.com/steam/apps/1724670/ss_d1131eea8696c5e24df4205e2de6db8daba4c188.1920x1080.jpg?t=1634019333",
    "Slug": "",
    "Meta Title": "明途之境: Sep 12, 2021, 3Y Studio and Full Overview",
    "Meta Description": "Looking for information on 明途之境? Check out the release date (Sep 12, 2021), developer insights from 3Y Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for 明途之境 game - Steam 1724670",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u660e\\u9014\\u4e4b\\u5883\", \"description\": \"Looking for information on \\u660e\\u9014\\u4e4b\\u5883? Check out the release date (Sep 12, 2021), developer insights from 3Y Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"3Y Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"3Y Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1724670/header.jpg?t=1634019333\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}