{
    "AppID": 1915040,
    "Name": "蓝星舰策略",
    "Release date": "Jul 28, 2022",
    "About the game": "Blue Star Ship strategy is a type of naval battle game which with operation and strategy, Our technical team makes these modern and contemporary famous warship models carefully, and use the three-dimensional technology to improve them. For restoring a real sea battlefield. Going on the Journey, player will play a supreme naval commander, recruiting soldiers, building the base and developing resources. You can build your own invincible warships to defend the territorial sea, fighting with enemy vehemently. Perfect and colorful cultivation system We imitate the real warships from the first world war, making our game models exactly the same as them. Each of warship or submarine has it own timeline and introduction. We also make all commander roles exactly according to different countries naval officers, decorating them with different costume and hair color, representing their countries vividly. Historical and classic battles Except experiencing the furious naval battle, It is really crucial that get ready for fight. Players can operate their own naval base, excavate lots of sea resources and arrange the line of defense. In short, you can use all of feasible strategy to develop and build your own military fortress to resist the all possibilities of being invaded. A kaleidoscopic battlefield strategy The naval war is not the simple and aimless military strength contest. In Blue Star Ship strategy, the one who can use reasonable stratagem will finally overcame the strong enemy. Matching the arm of the services in different solution, selecting the batter commander to fight with enemy. “Map out a strategy ahead of schedule, gain a decisive victory a thousand miles away”. In a word, using all strategy you come up with to win! Perfectly restore the real battlefield Last but not least, In Blue Star Ship strategy, you also have the opportunities to back to the past, enjoying in real classic naval battles, Facing the crisis situation in that war era. And learn about the choice they chose to change their countries destiny as well as their thought of training and commanding military. All in all, you can continue maintain the real history or create new naval history in Journey!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1915040/header.jpg?t=1659078079",
    "Price": 0.0,
    "Developers": "无锡上宸信息科技有限公司",
    "Publishers": "无锡上宸信息科技有限公司",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1915040/ss_85e5b6021205bb32ebf570fdda4669c8e70b692b.1920x1080.jpg?t=1659078079,https://cdn.akamai.steamstatic.com/steam/apps/1915040/ss_09f10d2966cb1f0c867fa671105467f7931d98ed.1920x1080.jpg?t=1659078079,https://cdn.akamai.steamstatic.com/steam/apps/1915040/ss_4b8c3b36203a71a6a910d81dbd4cc1c040bff965.1920x1080.jpg?t=1659078079,https://cdn.akamai.steamstatic.com/steam/apps/1915040/ss_525dd9447d534bf6fdd1d5dd70f5bc6aa9eb3722.1920x1080.jpg?t=1659078079,https://cdn.akamai.steamstatic.com/steam/apps/1915040/ss_6a2355160fc21dfd9d9fec263bdba0cd1fa33a33.1920x1080.jpg?t=1659078079",
    "Slug": "",
    "Meta Title": "蓝星舰策略: Jul 28, 2022, 无锡上宸信息科技有限公司 and Full Overview",
    "Meta Description": "Looking for information on 蓝星舰策略? Check out the release date (Jul 28, 2022), developer insights from 无锡上宸信息科技有限公司, and a complete game summary.",
    "Alt Text Image": "Official header image for 蓝星舰策略 game - Steam 1915040",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u84dd\\u661f\\u8230\\u7b56\\u7565\", \"description\": \"Looking for information on \\u84dd\\u661f\\u8230\\u7b56\\u7565? Check out the release date (Jul 28, 2022), developer insights from \\u65e0\\u9521\\u4e0a\\u5bb8\\u4fe1\\u606f\\u79d1\\u6280\\u6709\\u9650\\u516c\\u53f8, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u65e0\\u9521\\u4e0a\\u5bb8\\u4fe1\\u606f\\u79d1\\u6280\\u6709\\u9650\\u516c\\u53f8\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u65e0\\u9521\\u4e0a\\u5bb8\\u4fe1\\u606f\\u79d1\\u6280\\u6709\\u9650\\u516c\\u53f8\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1915040/header.jpg?t=1659078079\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}