{
    "AppID": 1528080,
    "Name": "Gas Station Simulator: Prologue - Early Days",
    "Release date": "Apr 28, 2021",
    "About the game": "/ / Gas Station Simulator is all about renovating, expanding and running a gas station along a highway in the middle of nowhere USA. This prologue to the game serves as an introduction to the beginnings of it all, where you find an abandoned gas station, buy it and start renovating it in order to be able to service your first customers. That's why we call the prologue 'Early Days'. Check out Gas Station Simulator for more information, DevLogs and discussions: / On the full game’s page you can also download the regular demo of Gas Station Simulator that allows you jump in right into running a gas stations that has already been mostly restored and offers additional services allowing you to get a good idea how the game will play about the mid-game. You acquire the gas station is a pretty rundown state. It has been exposed to the elements for years and you will need to put some serious work into it in order to restore it to a useful state. You will have to clear the area of sand and rubble, fix the place up and take care of the inside as well. There are plenty of tools at your disposal to renovate the place and bring it to a state that won’t repeal customers by how it looks. The renovation itself is just part of the job, you will also have to keep in clean and tidy. Once you fixed the place up a little bit, you can think about customizing it and adding some personal touches. The prologue offers some of the customization features of the full game to give you a solid idea what types of customizations you can look forward to. Both the outside and inside of the gas station are covered giving you a solid idea of what to look forward to. You have spend all the money you had to buy the gas station and had to borrow some cash on top of that. Restoring the gas station to its former glory will cost you a bit, too. Hence any money that comes in becomes crucial. Thankfully you don’t need to wait for the gas station to be fully restored to start earning some money. Some fuel, fixing up the gas pump and you can start serving the occasional customer already. While you can’t offer your customers much else at this point, it’s a start toward a full fledged gas station offering lots of different services.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1528080/header.jpg?t=1646213735",
    "Price": 0.0,
    "Developers": "DRAGO entertainment",
    "Publishers": "Movie Games S.A.,HeartBeat Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1528080/ss_6543986ee66750e8305ab23431b994cd91e4e9b8.1920x1080.jpg?t=1646213735,https://cdn.akamai.steamstatic.com/steam/apps/1528080/ss_ea4c17313b6ddfed04754d7895907768045364e2.1920x1080.jpg?t=1646213735,https://cdn.akamai.steamstatic.com/steam/apps/1528080/ss_dc63aa9de507a5471070f5d60a83532d167e9807.1920x1080.jpg?t=1646213735,https://cdn.akamai.steamstatic.com/steam/apps/1528080/ss_b46dfc83be02bcefdd0a5525a149ecb455e409c8.1920x1080.jpg?t=1646213735,https://cdn.akamai.steamstatic.com/steam/apps/1528080/ss_dc5583e69d0ad9ebf65947f5f23f46fa05609190.1920x1080.jpg?t=1646213735,https://cdn.akamai.steamstatic.com/steam/apps/1528080/ss_2efb9976ff6a0f094d9526b219033e17643c08f8.1920x1080.jpg?t=1646213735",
    "Slug": "gas-station-simulator-prologue-early-days",
    "Meta Title": "Gas Station Simulator: Prologue - Early Days: Apr 28, 202...",
    "Meta Description": "Looking for information on Gas Station Simulator: Prologue - Early Days? Check out the release date (Apr 28, 2021), developer insights from DRAGO entert...",
    "Alt Text Image": "Official header image for Gas Station Simulator: Prologue - Early Days game - Steam 1528080",
    "Canonical URL": "https://gusku.site/game/gas-station-simulator-prologue-early-days",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gas Station Simulator: Prologue - Early Days\", \"description\": \"Looking for information on Gas Station Simulator: Prologue - Early Days? Check out the release date (Apr 28, 2021), developer insights from DRAGO entert...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"DRAGO entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Movie Games S.A.,HeartBeat Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1528080/header.jpg?t=1646213735\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}