{
    "AppID": 1722750,
    "Name": "Halt The Heist!",
    "Release date": "Jul 29, 2022",
    "About the game": "Play with 4 players online in a 2v2 heist-game all about either locating, stealing and escaping with a diamond, or searching and capturing the Thief as the security team! Each team has a player on the map, and one player on a computer, hacking and tracking down the opponents player while observing cameras, making strategies and confusing the other team. The Thief As the Thief, you spawn in one of 3 locations chosen by The Hacker, and your job is, with the Hacker's help, to track down a hammer and later a diamond to lastly escape before the Guard finds and catches you! Communicate with the Hacker to get through puzzles and devise a strategy throughout the heist. Use your surroundings to navigate the museum efficiently and quietly as you may give away your position standing under cameras, walking into obstacles and making noise! Use your dash to escape the clutches of the Guard or hide in bushes. The Hacker As the Hacker, your main objective is to extract as much information about the map and the opponent team as possible, as fast as possible. Make use of different hack tools as well as a Hacker's Manual to help and guide the Thief to treasure. But beware and alert the Thief of tripwires and camera, while the Surveillance attempts at shutting you out! Disrupt the security team by hacking their cameras, opening security doors, disabling tripwires and more! Guide the Thief to the hammers and diamonds locations and plan a quick get-away! Elude the Surveillance and avoid getting shut out. The Guard As the Guard, you must find and catch the Thief as quickly as possible with help from your teammate, the Surveillance. Use your flashlight and detective skills to search, listen and capture the Thief before it is too late! Patrol the museum and keep your diamonds where they are by finding and capturing the Thief. Build a taser to help you chase and catch that pesky Thief. Find and detect clues that the Thief was nearby using the surroundings and your flashlight. Communicate with the Surveillance to track the position of the Thief. Stand still and activate your 'listening mode' to hear footsteps and other Thief-related activities! The Surveillance As the Surveillance, you are hooked into the mainframe watching CCTV footage, counter-hacking and disrupting the Hacker, and trying to sort all the information your given to your advantage. As the minutes tick and the chance for the Thieves stealing your goods only rises, you must be quick and relay as much information to the Guard as possible while having the overview and strategizing. Guide the Guard through the map whilst keeping tabs on the comings/goings around the map. Figure out how the Hacker likes to play and shut down their attempts to disrupt your operations. Listen in on conversations between the Thief and the Hacker, if you can get the frequency right!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1722750/header.jpg?t=1659108227",
    "Price": 0.0,
    "Developers": "ByteTale Studios",
    "Publishers": "ByteTale Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1722750/ss_a703107d3be9b5cdf5a35865e055f25dcbe9a845.1920x1080.jpg?t=1659108227,https://cdn.akamai.steamstatic.com/steam/apps/1722750/ss_0618487e2bb74abd5a7bffdcc6ac41b18f06b4b5.1920x1080.jpg?t=1659108227,https://cdn.akamai.steamstatic.com/steam/apps/1722750/ss_08de31e9dec00a17cf0eee4ea34b78798ce39390.1920x1080.jpg?t=1659108227,https://cdn.akamai.steamstatic.com/steam/apps/1722750/ss_f28f0b065ef471f3f10c3c43e83027b0460373c3.1920x1080.jpg?t=1659108227,https://cdn.akamai.steamstatic.com/steam/apps/1722750/ss_156680b7a2a508f4187e1d2d7cd4d968078e49b4.1920x1080.jpg?t=1659108227,https://cdn.akamai.steamstatic.com/steam/apps/1722750/ss_3e8011fc512111f23ba04cc9d1f2442f38e8e6d2.1920x1080.jpg?t=1659108227,https://cdn.akamai.steamstatic.com/steam/apps/1722750/ss_22baf372a66863ee5a0c39bb54c3c2d57414370f.1920x1080.jpg?t=1659108227,https://cdn.akamai.steamstatic.com/steam/apps/1722750/ss_10d260f3021a0dd5d0676476a9377533107dd788.1920x1080.jpg?t=1659108227,https://cdn.akamai.steamstatic.com/steam/apps/1722750/ss_2e10212a02d67984d313fd857547fe9f3f8f5c64.1920x1080.jpg?t=1659108227",
    "Slug": "halt-the-heist",
    "Meta Title": "Halt The Heist!: Jul 29, 2022, ByteTale Studios and Full ...",
    "Meta Description": "Looking for information on Halt The Heist!? Check out the release date (Jul 29, 2022), developer insights from ByteTale Studios, and a complete game sum...",
    "Alt Text Image": "Official header image for Halt The Heist! game - Steam 1722750",
    "Canonical URL": "https://gusku.site/game/halt-the-heist",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Halt The Heist!\", \"description\": \"Looking for information on Halt The Heist!? Check out the release date (Jul 29, 2022), developer insights from ByteTale Studios, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"ByteTale Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ByteTale Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1722750/header.jpg?t=1659108227\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}