{
    "AppID": 1482860,
    "Name": "Idle Research",
    "Release date": "Jul 31, 2022",
    "About the game": "Idle Research is an addictive, resource management, incremental game with both idle and active playstyles. Research and Craft items (Flasks, Tubes, and Cylinders (in the future)) to earn as much of the 3 types of Energy as possible! The game can be played anywhere at anytime, no internet or constant attention is required (though it would speed up progress :D). Supports different platforms from Mobile and the Web version! Features We all love numbers right? How about big ones? That’s what this game is about! I designed the game to be a fun and addicting incremental. Fans of basic and complex incrementals will love this game. Research, the most important feature of the game, can unlock up to 18 different and colorful vital items! Craft researched items that will make you even more Energy and can be used in different features of the game! Progress through the game and complete 148 achievements! Currently there are 100 Steam achievements for you to collect :) Reset some progress, gain Golden items, and come back even faster! There are lots of different types of prestiges for you to unlock Fight enemy Tubes and steal their Energy! Explore through 7 different zones with a maximum of 500 stages each! Steal precious Skill Shards and level up 70 different skills! Become an alchemist and brew various types of potions! There's much more content for you to unlock, no more spoilers :^). 100s of hours guaranteed! The game can be speedruned for you speedrun addicts. The game is currently in Early Access, as you might have noticed from the tags and the banner at the top. Currently, there are two layers of content: Flasks and Tubes. My goal is to add a third and final layer of content, and add some holiday events! If you're curious, the third content layer will be larger than Flasks and Tubes, combined! There will be some form of educational material related to chemistry, physics, and math. Additionally, there will be some form of story or dialogue, if that's your kind of thing. If you want more previews and details, join the discord! I love to keep the community updated with what I am working on :) Future Development As a sole indie developer, this is my passion and hobby. Making games is one of my favorite hobbies, and I don't expect that to change anytime soon. I always seek suggestions, fix bugs, and find ways to add new content that will make the game even better. My goal is to satisfy as many players as possible and to create a fun experience. Community One of my major goals is to create a community of players and indie developers that are friendly and helpful towards one another. Want to come along with the crew? Join the discord! Meet the Developer Hi everyone! My name is Zach. I am the only developer for CryptoGrounds. Everything in Idle Research was made from scratch, this includes: game design, art, music, marketing, etc. I am a sophomore college student, majoring in Computer Science with a focus in Data Science and Space. My goal is to focus on college and allocate as much as into game development as possible, while trying to balance other hobbies and social life :^) Other hobbies include: making YouTube videos, rock climbing, videogames, drawing, friends, and programming random side-projects. I'm a huge music person. I'm always open to discuss these on Discord! I hope you enjoy the game! It's been in the making since October 2020, all started with a simple shower thought!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1482860/header.jpg?t=1659333649",
    "Price": 0.0,
    "Developers": "CryptoGrounds Games LLC",
    "Publishers": "CryptoGrounds Games LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1482860/ss_f51244bef3ce8ded0e8dc9ae519634dd3500cb56.1920x1080.jpg?t=1659333649,https://cdn.akamai.steamstatic.com/steam/apps/1482860/ss_62ad2b66ca621c8ff70d4f2f3a6ebc7d49974fb6.1920x1080.jpg?t=1659333649,https://cdn.akamai.steamstatic.com/steam/apps/1482860/ss_05643f6bb94c628e4451f640f6f5ddbc571fa84d.1920x1080.jpg?t=1659333649,https://cdn.akamai.steamstatic.com/steam/apps/1482860/ss_a3cd9855bee8057c615ad89ca624d2c01e0f199f.1920x1080.jpg?t=1659333649,https://cdn.akamai.steamstatic.com/steam/apps/1482860/ss_06bb52a3505e7df70e37a902022d28aca240bd8c.1920x1080.jpg?t=1659333649,https://cdn.akamai.steamstatic.com/steam/apps/1482860/ss_8f43c4bbe31740a03d0bd0ae3d3aca7556c24515.1920x1080.jpg?t=1659333649,https://cdn.akamai.steamstatic.com/steam/apps/1482860/ss_e911060e648dab0bd2bbba9e3f49970115481884.1920x1080.jpg?t=1659333649,https://cdn.akamai.steamstatic.com/steam/apps/1482860/ss_1620e154cc4a31acc74f70feecb20459d6cbc3b4.1920x1080.jpg?t=1659333649",
    "Slug": "idle-research",
    "Meta Title": "Idle Research: Jul 31, 2022, CryptoGrounds Games LLC and ...",
    "Meta Description": "Looking for information on Idle Research? Check out the release date (Jul 31, 2022), developer insights from CryptoGrounds Games LLC, and a complete gam...",
    "Alt Text Image": "Official header image for Idle Research game - Steam 1482860",
    "Canonical URL": "https://gusku.site/game/idle-research",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Idle Research\", \"description\": \"Looking for information on Idle Research? Check out the release date (Jul 31, 2022), developer insights from CryptoGrounds Games LLC, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CryptoGrounds Games LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CryptoGrounds Games LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1482860/header.jpg?t=1659333649\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}