{
    "AppID": 2001220,
    "Name": "Keita's Adventures on the African Savannah",
    "Release date": "Jun 12, 2022",
    "About the game": "What kind of game is it? It tells the story of a young African boy, Keita, who follows migratory animals from the Serengeti National Park to the Masai Mara game Reserve to seek medicine for his family. On the way, he encounters dangerous wildlife. How does the game play? Encounter rhinoceros: through archery to drive away rhinoceros, generally shot to the front half of the rhinoceros is effective, when the rhinoceros close to the tree can climb, in the tree can also carry out archery, shot about 3 times the rhinoceros will run away and disappear, but the number of climbing trees is limited, rhinoceros encounter two trees after the tree will fall. Meet the lion: after meeting the lion, the lion will chase you, you can avoid the attack of the lion by walking, and shoot the lion with an arrow, shoot the lion's front half effective, other animals are also. A lion will speed away after several attacks. Encounter bison: Bison have a certain number and will run away when attacked. They can shoot away the bison repeatedly, or they can climb trees to escape the bison attack, but the tree will fall after the bison hit it several times. Encounter hyenas: Hyenas have a certain number, and they will attack from the front and rear directions. Hyenas can be driven away by archery or weapons. After a certain period of time, hyenas will not appear. Meet crocodile: crocodile see you under the river they will also under the river, see you ashore, they will also ashore, you under the river after they will swim to you, you can shoot arrows constantly drive them ashore, hit a few times after there will be no crocodile under the river. Meet an Eagle: An eagle swoops down from the sky to attack. You just shoot it off, but at a good Angle. See the fruit: Drive away the eagle and walk further, you can see a tree, the tree has the fruit you need, you need to shoot the fruit with an arrow, and back. Why is it interesting? Because encounter different wild animals will have different escape methods, some need to climb trees, some need clever walking, some need accurate archery, this need to explore. How is the game done? The game is divided into two parts. In the first part, the boy follows the animals from the Serengeti National Park to the Masai Mara Wildlife Reserve to search for medicine. In the second part, the boy returns after taking the medicine and meets the same animals, but the difficulty is slightly increased. How long will it take to finish the game? Because of the fumbling, although the game is small, it may take a little longer to complete, about half an hour. Thank you for your attention and hope for your support!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2001220/header.jpg?t=1655034056",
    "Price": 0.99,
    "Developers": "African boy Keita studio,非洲小男孩凯塔工作室",
    "Publishers": "African boy Keita studio,非洲小男孩凯塔工作室",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2001220/ss_5a324dd71d051773c9a809a5784fed122c62d5d6.1920x1080.jpg?t=1655034056,https://cdn.akamai.steamstatic.com/steam/apps/2001220/ss_b356a0bb030691e60e6146433f230e53d0afdf60.1920x1080.jpg?t=1655034056,https://cdn.akamai.steamstatic.com/steam/apps/2001220/ss_f9ddb890693c95f073c113928330dead3041419d.1920x1080.jpg?t=1655034056,https://cdn.akamai.steamstatic.com/steam/apps/2001220/ss_4fccb9e0891de99dc1d55dde6d03c6cc74b00965.1920x1080.jpg?t=1655034056,https://cdn.akamai.steamstatic.com/steam/apps/2001220/ss_673341ec4ed73fe2e93ee9cbf05696ce0f5e26c3.1920x1080.jpg?t=1655034056",
    "Slug": "keita-s-adventures-on-the-african-savannah",
    "Meta Title": "Keita's Adventures on the African Savannah: Jun 12, 2022,...",
    "Meta Description": "Looking for information on Keita's Adventures on the African Savannah? Check out the release date (Jun 12, 2022), developer insights from African boy Ke...",
    "Alt Text Image": "Official header image for Keita's Adventures on the African Savannah game - Steam 2001220",
    "Canonical URL": "https://gusku.site/game/keita-s-adventures-on-the-african-savannah",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Keita's Adventures on the African Savannah\", \"description\": \"Looking for information on Keita's Adventures on the African Savannah? Check out the release date (Jun 12, 2022), developer insights from African boy Ke...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"African boy Keita studio,\\u975e\\u6d32\\u5c0f\\u7537\\u5b69\\u51ef\\u5854\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"African boy Keita studio,\\u975e\\u6d32\\u5c0f\\u7537\\u5b69\\u51ef\\u5854\\u5de5\\u4f5c\\u5ba4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2001220/header.jpg?t=1655034056\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}