{
    "AppID": 816340,
    "Name": "Kingdom Rush Origins - Tower Defense",
    "Release date": "Oct 17, 2018",
    "About the game": "The most addicting tower defense game returns in an all-new prequel adventure - welcome to Kingdom Rush Origins! Kingdom Rush Origins is the third installment of the award-winning Kingdom Rush saga, loved by millions and earning accolades from gamers and critics around the globe. Take a trip back to the beginning, before Vez’nan ever thought to threaten the kingdom with the gem of power, and experience even more of the lightning-fast, exceptionally captivating gameplay that made the franchise a cornerstone of essential tower defense games. In this exciting prequel, command your elven army and defend mystical lands from sea serpents, evil sorcerers, and wave after wave of gnoll tribesmen, all with the help of brand-spankin’ new towers, heroes, and spells to fend off every last baddie. Kingdom Rush Origins packs in a treasure trove of new content and features while keeping the signature look that millions have come to love. Key Features Re-enter the world of Kingdom Rush: visit mysterious elven forests, magical faery realms and even floating ruins of an ancient metropolis! Unleash the power of the elves with brand new towers and troops! Elf Archers, Mystic Mages, Stone Druids and the Elven Infantry make up the backbone of your army. Discover new specialized tower upgrades with over 18 abilities! Vanquish your enemies with elven marksmen, runed bears, magic-wielding wizards, and even giant animated trees. Take up arms against new enemies and engage in epic boss battles! Face hordes of Gnolls, giant spiders, and the terrible Twilight army. Master and upgrade legendary heroes and their awesome powers and spells! Rain lightning, summon reinforcements, and use each hero’s unique power to obliterate scores of enemies! Immerse yourself in hours of gameplay with over 70 achievements, with three difficulty modes for the newbs and veterans alike. Play different game modes - Classic, Iron, and Heroic - and prove your mettle as a master tactician. Study your enemies and your towers with an in-game encyclopedia. Kingdom Rush Origins Updates Schedule Last week of December - Update 1.1 Watch out! A powerful ogre army is preparing a strategy to invade and destroy everything! This update includes: Hulking rage expansion Heroes that will help you stop this invasion (Durax, Lilith and Razz &amp; Rags) Last week of January - Update 1.2 Malicia's last and most loyal lieutenant has gone mad and is plotting revenge. Lead the Elven forces and stop the plans of Baj'Nimen the Hateful before he destroys everything in its path! This update includes: Bittering Rancor expansion Powerful Heroes (Bruce, Lynn) March 7th- Update 1.3 As our Kingdom returns its former peaceful times, the message we sent asking for aid to the Dwarves never returned, if there's something more troublesome than a loud dwarf, it's a silent one! You need to travel to their land and look for answers. This update includes: Forgotten treasures expansion Heroes (Wilbur, Phoenix)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/816340/header.jpg?t=1611779882",
    "Price": 14.99,
    "Developers": "Ironhide Game Studio",
    "Publishers": "Ironhide Game Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/816340/ss_d590610c34715ff8c3166bbbcc2fd179b639d21e.1920x1080.jpg?t=1611779882,https://cdn.akamai.steamstatic.com/steam/apps/816340/ss_7ed00bf17d78d5ccaa333bfbd5467dbe0a237b70.1920x1080.jpg?t=1611779882,https://cdn.akamai.steamstatic.com/steam/apps/816340/ss_86580b6b420bf951b234856e9961bc5cd8a856b2.1920x1080.jpg?t=1611779882,https://cdn.akamai.steamstatic.com/steam/apps/816340/ss_385700950382d5a92547410940f6f49d5ae36d94.1920x1080.jpg?t=1611779882,https://cdn.akamai.steamstatic.com/steam/apps/816340/ss_60cf92784e814861e8615c639d1e90462011d5c7.1920x1080.jpg?t=1611779882,https://cdn.akamai.steamstatic.com/steam/apps/816340/ss_4ebbe292a307b0ae4b3cb331031ce547a589708f.1920x1080.jpg?t=1611779882,https://cdn.akamai.steamstatic.com/steam/apps/816340/ss_ffab0e6a4858c14f6609c48f2a75ad27c8bdfc9c.1920x1080.jpg?t=1611779882,https://cdn.akamai.steamstatic.com/steam/apps/816340/ss_66d184256867240d3045fbd3f65b27d0484c3a13.1920x1080.jpg?t=1611779882,https://cdn.akamai.steamstatic.com/steam/apps/816340/ss_6671748700d6079ff80a50201ffb67b2a68e4e3f.1920x1080.jpg?t=1611779882",
    "Slug": "kingdom-rush-origins-tower-defense",
    "Meta Title": "Kingdom Rush Origins - Tower Defense: Oct 17, 2018, Ironh...",
    "Meta Description": "Looking for information on Kingdom Rush Origins - Tower Defense? Check out the release date (Oct 17, 2018), developer insights from Ironhide Game Studio...",
    "Alt Text Image": "Official header image for Kingdom Rush Origins - Tower Defense game - Steam 816340",
    "Canonical URL": "https://gusku.site/game/kingdom-rush-origins-tower-defense",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kingdom Rush Origins - Tower Defense\", \"description\": \"Looking for information on Kingdom Rush Origins - Tower Defense? Check out the release date (Oct 17, 2018), developer insights from Ironhide Game Studio...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ironhide Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ironhide Game Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/816340/header.jpg?t=1611779882\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}