{
    "AppID": 1797880,
    "Name": "Lost Light",
    "Release date": "Aug 4, 2022",
    "About the game": "Realistic warfare survival Factories, harbors, forests...... these once familiar sights have been desecrated by the wrath of the apocalypse. Never neglect small details on the battlefield or there will be fatal consequences. You must know your weapons and know your equipment, explore every corner of the battlefield, learn to effectively deal with hunger and pain, and make tactical plans...... Complete survivors' commissions, scavenge for supplies, and hone your skills to survive the exclusion zone. Authentic Firearm Customization From structures to textures, the firearms in the game are meticulously recreated to provide players with the most realistic firearms experience. Each firearm supports up to 12 modifiable parts and hundreds of components to choose from. It's time to optimize your loadout from hundreds of possibilities. Of course, the system will also provide several recommended loadouts for Quick Equip. All About Tactics In Lost Light, violence is not always the answer—as long as you can find the evacuation point, you can make it out alive. You may choose to go armed to the teeth, wreaking havoc and reaping the loots, or you may choose to be a minimalist, scavenging your way to a small fortune. But remember, if you die in combat, you lose everything—the loots are not yours until you make it out alive! Map Out Before Moving Out Prepare yourself for battle in your shelter. Not only do you need to boost your body energy and stay in good shape, but more importantly, you have to customize and build your own loadout. But be careful with the gear you choose, because the battle begins when you start to equip yourself. Diversified Social Interaction Unlike conventional competitive survival games, Lost Light allows you to choose partnership over being a lone wolf. You may decide to team up with a spared enemy or commission other players to rescue you after you're knocked out—endless possibilities await! Profit Off Free-trade After the evacuation, you retreat deep within the abandoned subway tunnels where you stash your loot and establish a foothold. After upgrading it to a full-fledged base of operations, you can set up shop and trade within Lost Light's player-driven economy. Sell your surplus and buy what's in need—Trade wisely and your chance of survival increases! Cross-Platform Play PC gamers can now feel the exhilaration of battle. Players on mobile devices and PC will be able to chat with one another for a cross-platform gaming experience. Form parties across the different platforms to complete more challenges and achieve the impossible!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1797880/header.jpg?t=1659665997",
    "Price": 0.0,
    "Developers": "NetEase Games",
    "Publishers": "NetEase Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1797880/ss_93a5c7e46f4d088355f7223bed37611b56098a7a.1920x1080.jpg?t=1659665997,https://cdn.akamai.steamstatic.com/steam/apps/1797880/ss_a8f275fb257793ecce0ac0fe733a971b857f2a97.1920x1080.jpg?t=1659665997,https://cdn.akamai.steamstatic.com/steam/apps/1797880/ss_cbe5849a0fb6dc11b3db356a2dfd9a3c386e1886.1920x1080.jpg?t=1659665997,https://cdn.akamai.steamstatic.com/steam/apps/1797880/ss_62e5836d5bf230cf93efca1b1cfd9c61d4bf0e18.1920x1080.jpg?t=1659665997,https://cdn.akamai.steamstatic.com/steam/apps/1797880/ss_a692612acde02a84a88f9a6e35419f0b917ae029.1920x1080.jpg?t=1659665997,https://cdn.akamai.steamstatic.com/steam/apps/1797880/ss_36fba094f60fecc241c04ffa2f054600164a9d01.1920x1080.jpg?t=1659665997,https://cdn.akamai.steamstatic.com/steam/apps/1797880/ss_070a69faaa1f6ea094019ebef60b30d48a19ed7b.1920x1080.jpg?t=1659665997,https://cdn.akamai.steamstatic.com/steam/apps/1797880/ss_8dfd91beed98872535ffd23d38ff623229054bed.1920x1080.jpg?t=1659665997,https://cdn.akamai.steamstatic.com/steam/apps/1797880/ss_00eed965fd8e2a43989059ef8be3f1f61edb87e2.1920x1080.jpg?t=1659665997",
    "Slug": "lost-light",
    "Meta Title": "Lost Light: Aug 4, 2022, NetEase Games and Full Overview",
    "Meta Description": "Looking for information on Lost Light? Check out the release date (Aug 4, 2022), developer insights from NetEase Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Lost Light game - Steam 1797880",
    "Canonical URL": "https://gusku.site/game/lost-light",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lost Light\", \"description\": \"Looking for information on Lost Light? Check out the release date (Aug 4, 2022), developer insights from NetEase Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"NetEase Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NetEase Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1797880/header.jpg?t=1659665997\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}