{
    "AppID": 1180330,
    "Name": "Manor of Mystic Courtesans",
    "Release date": "Apr 17, 2020",
    "About the game": "Overview Manor of Mystic Courtesans♥ This is a place to find partners of every race, gender, and alternate dimension. A place where your senses are appeased to by a band of beautiful, charming, and intensely erotic courtesans and gigolos. Gorgeous artwork, seductive partners, and a plethora of extraordinary scenarios come together to make the most wild and lascivious adult novel game on Steam to date! Companions Demon Twins Mary and Juley You make a deep connection with a pair of twin demon courtesans. orally, manually, and physically. Body and mind become one as all three of your souls intertwine long into the night. The Monarch Butterfly・Kanata You visit the manor as the bashful son of a wealthy noble. A mystical butterfly woman named Kanata guides you down the path of confidence with her gentle and skillful hands. The Pregnant Breeder Angel・Macael A hardcore fetish adult film crew comes to the Manor seeking talent. They strike gold when they find Macael, the bawdy angel who is easily the wildest courtesan even among courtesans! Claudia The Indigent Heir Claudia is an Adonis faced butterfly gigolo with a disproportionately enormous member. His client for the evening is the president of a pharmaceutical company aching to test out his new inventions on him one after another... The Nine Tailed Japanese Fox Girl・Ayame A suspicious man calls upon Ayame, a nine tailed fox girl rumored to bring good luck to all she beds. Ayame senses a deep kinship with the man, but just what could his true intensions be... Megumi the Pitiable Dog Girl A highly trained, highly sexual dog woman of the highest pedigree. Her team of caretakers have once again come to visit her and continue her intense training! Futanari Vampire Nina Shunned by her royal family as an abomination, she escaped to The Manor and began living a life of mutual love and fulfilment. Then one day, a chambermaid she knew from her past life came to visit her... Silkie Bird Woman・Rinco A silkie bird woman who is both ovulating and in heat all year long. Her partner is a newly hired office worker who is brought to her by his boss. Fortune telling Eggs are laid one after another...what will the next ones mean? The Libertine Elf・Ginrei Ginrei is a powerful elf gigolo with immense magical power and endless lust. His partner for the evening, a team of bio-androids that don't know the meaning of tired. Ancient magic and futuristic technology are pit against each other in sultry match of strength and fortitude! Spirited Mare・Menoux A young man fascinated with horses finds his way to The Manor in search of a mythical horse racing legend. What the young man finds is that the hospitality of horse creatures is even more satisfying than he had imagined... Maria the Courtesan-in-training Hostess The front desk hostess of the Manor of Mystic Courtesans. Always happy to reveal everything she knows about the Manor's history, the secrets of it's residents... ...and even her beautiful body if you play your cards right. Features Visual novel style game where you click to progress the story A wide variety of unique and lascivious courtesans and gigolos to chose from 10 different sensual stories + extended bonus content. 37 Base CG images, each with variations for a whopping total of 652 unique images! WARNING! This game contains graphic depictions of sexual situations and in intended for a mature audience only. Players discretion is advised.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1180330/header.jpg?t=1635441812",
    "Price": 14.99,
    "Developers": "Nine’s Graphics",
    "Publishers": "Eroge Japan",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_c96cd08eede5a74bdf3c241b91767255b5562aec.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_d3ed14f9b550f23771aa630af356bf2a7b6cf07d.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_027a7db8a805d601da4d9ddffc7cd1a598304a88.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_0b9a6c0bd01ac5ea0e058f11a6cbe6b587828da1.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_c4987faf4596b676419f7f3a523149dee833be86.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_465ff6a651b46fbee4628304b6ffd0f5c6014f92.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_72c48d3469ba2ff5f38cc9028a705598ec59cc9f.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_d917b3362edf001d916320d02a5545370eeb4588.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_a023a612313c5b471c9f7c435ddc7f3be3694bd8.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_96167eda8944ba671936b6eaf8cf83932e9f5d58.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_55a29bd49d0ccdf4a5f655698f74be95b1db87ec.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_dc4666f9e148627f857453225f71045f78449645.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_65a528928e2b35d1cb33f4714ca9e9087bb9f569.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_40064cd3a22a6ddcbddb2360a3c5f4ec018ef51e.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_9e5cf6e94ab4024b9f354b7c95990cdf0c3b2afe.1920x1080.jpg?t=1635441812,https://cdn.akamai.steamstatic.com/steam/apps/1180330/ss_417d6d4c74a264fd1ddbc7cb05f09ce22d9272e8.1920x1080.jpg?t=1635441812",
    "Slug": "manor-of-mystic-courtesans",
    "Meta Title": "Manor of Mystic Courtesans: Apr 17, 2020, Nine’s Graphics...",
    "Meta Description": "Looking for information on Manor of Mystic Courtesans? Check out the release date (Apr 17, 2020), developer insights from Nine’s Graphics, and a complet...",
    "Alt Text Image": "Official header image for Manor of Mystic Courtesans game - Steam 1180330",
    "Canonical URL": "https://gusku.site/game/manor-of-mystic-courtesans",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Manor of Mystic Courtesans\", \"description\": \"Looking for information on Manor of Mystic Courtesans? Check out the release date (Apr 17, 2020), developer insights from Nine\\u2019s Graphics, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 17, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nine\\u2019s Graphics\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eroge Japan\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1180330/header.jpg?t=1635441812\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}