{
    "AppID": 1492750,
    "Name": "Mega Knockdown",
    "Release date": "Jul 29, 2022",
    "About the game": "The 2D Fighting Game With a Twist: It's Turn-Based! Mega Knockdown's simultaneous turn-based gameplay system makes it a unique, beginner-friendly fighting game experience that is easy to learn, but hard to master. Fighting game veterans and newbies alike can jump right in to advanced level mindgames without spending a lot of time learning execution or complex inputs. Learn fighting games, or teach them to your friends! Gameplay Highlights Simple controls with no timing requirement Experience classic fighting game archetypes: the fireball-throwing martial artist, the grappler, the long-limbed poke specialist, and more! Jockey for position and weave in and out of range of attacks. Are you a true master of fighting game footsies? Prove it! Get the upper hand on your opponents with a knockdown, and press the advantage with a 'meaty attack' on their wakeup! Enrage and astound your friends with a well placed 'tick throw'! Express yourself! Do you carefully block and punish your way to victory, or do you assert dominance with a wild and aggressive gameplan? How does it work? Each turn, players choose a combat action and a movement action in secret. Then, both players' actions resolve simultaneously over the course of a few seconds. Predicting the opponent's actions and choosing the right counterplay is the key to victory. The basic actions are attacks , blocks and throws : Attacks can beat out other moves through superior range or speed. Some attacks also knock players down, restricting that player's movement and slowing their attacks next turn. This emulates the 'wakeup game' seen in most fighting games. Blocking prevents damage from attacks, and usually puts the defender at an advantage next turn, or grants a free counter-attack ('punish') against the opponent. Throws can break an opponent's guard, but have short range. The game's six characters also have unique special moves which change how they play the game. Want to give it a try? Scroll up to check out the free demo! Modes and Features: Arcade Mode (with story scenes) Local Versus Online Versus (via Steam Remote Play) Interactive Tutorial Survival Mode Blitz speed variants Training Mode with frame data display Controller Support Accessible difficulty settings 6 Playable Characters 2 Selectable Art Styles Fun fact: Mega Knockdown was originally developed as a card game for the 2017 season of the CUDO Plays design competition.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1492750/header.jpg?t=1659106833",
    "Price": 5.94,
    "Developers": "dhamster",
    "Publishers": "Counter Hit Studios,Mega Memecast",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1492750/ss_a0837fb6a753d8669188373ece4648b29eaacae9.1920x1080.jpg?t=1659106833,https://cdn.akamai.steamstatic.com/steam/apps/1492750/ss_0740edf3cb9d0c93cbd8c587fb6dd8e7f3c6b7ef.1920x1080.jpg?t=1659106833,https://cdn.akamai.steamstatic.com/steam/apps/1492750/ss_2d3e42f86061c81ac6ff6c12397646844351869c.1920x1080.jpg?t=1659106833,https://cdn.akamai.steamstatic.com/steam/apps/1492750/ss_50bb315fe2a3d26780dbdbe444f746343d363ee3.1920x1080.jpg?t=1659106833,https://cdn.akamai.steamstatic.com/steam/apps/1492750/ss_4f8895c2f825d76e74137c0e3de8049e09c265e7.1920x1080.jpg?t=1659106833,https://cdn.akamai.steamstatic.com/steam/apps/1492750/ss_03f7b8558a298000fb7dcac457fcc2230968795f.1920x1080.jpg?t=1659106833,https://cdn.akamai.steamstatic.com/steam/apps/1492750/ss_fc0750fecfa088a5d0cdda596a87ea56ec344fea.1920x1080.jpg?t=1659106833,https://cdn.akamai.steamstatic.com/steam/apps/1492750/ss_f5add16b782a1a8a0cf65c474dbd9996e18529c3.1920x1080.jpg?t=1659106833",
    "Slug": "mega-knockdown",
    "Meta Title": "Mega Knockdown: Jul 29, 2022, dhamster and Full Overview",
    "Meta Description": "Looking for information on Mega Knockdown? Check out the release date (Jul 29, 2022), developer insights from dhamster, and a complete game summary.",
    "Alt Text Image": "Official header image for Mega Knockdown game - Steam 1492750",
    "Canonical URL": "https://gusku.site/game/mega-knockdown",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mega Knockdown\", \"description\": \"Looking for information on Mega Knockdown? Check out the release date (Jul 29, 2022), developer insights from dhamster, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"dhamster\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Counter Hit Studios,Mega Memecast\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1492750/header.jpg?t=1659106833\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.94, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}