{
    "AppID": 828520,
    "Name": "Metis One",
    "Release date": "Jun 1, 2018",
    "About the game": "The year is 20XX . Mayday! Distress call from ERIS BASE ! Through the void comes a dark warning to the inhabitants of JUPITER colony METIS ONE . A mysterious ALIEN FORCE is on the attack in the SOL SYSTEM . The people of EARTH have sent their most powerful fighter, the A-6 GRAVITUS , to repel the invasion and defend the free colonies. Receiver in hand, will you answer the call...? FEATURES Begin the game with access to two fighters: the A6-Gravitus (shown in blue) and the Quaternion B4 (in red). Each fighter has a unique special weapon which can be fired when fully charged. • The Gravitus' special weapon is the Deflector Shields. Perform a defensive aileron roll that temporarily activates electro-magnetic shields to deflect enemy fire, allowing you to safely pass through the enemies barrage of lasers. • The Quaternion's special weapon is the Ion Twist Cannon. Once fired this cannon unleashes a large volley of lasers to slice through the enemy lines. Use this to take down bosses quickly. • Unlock 3 more unique fighters, each with their own devastating special weapon, by completing certain challenges in the campaign mode. Power up your fighters' destructive and defensive capabilities by collecting one of four power up drops. Including Armor Up, Orbitals, Sidewinders and more... Two gameplay modes! • In Campaign Mode blast through 5 stages of alien squadrons, each more challenging than the last. Features two difficulty levels for novice, or advanced players. This mode can be played either solo, or in co-op mode. Uncover the mysteries of deep space to unlock the secret final stage and truly save the Sol System from destruction. • Hit up the Simulation Bay on Eris Base to do some flight training and test your skills in Score Attack mode. This endless mode scales in difficulty the longer you last. Go for the Hi Score to prove yourself the best pilot. Metis One also features full controller support as well as keyboard input. It has a 9:16 Tate mode for a more immersive a complete game field. Hi Scores boards to track your greatest victories! Giant Bosses to test your skill! Fancy 3-D graphics! Fail States galore! BONUS DLC Included with the game is the 21 track Out of this World Original Soundtrack by Cloe Song!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/828520/header.jpg?t=1592458876",
    "Price": 7.99,
    "Developers": "Actuator Games",
    "Publishers": "Actuator Games LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/828520/ss_b708ea922a6be0e1a9905a788a7c2df0fb55b111.1920x1080.jpg?t=1592458876,https://cdn.akamai.steamstatic.com/steam/apps/828520/ss_90854b9a77ab469d8a6df65fa30c064b7b3a9eca.1920x1080.jpg?t=1592458876,https://cdn.akamai.steamstatic.com/steam/apps/828520/ss_01b8e8806047c1e756d51105c0c472f506bd462d.1920x1080.jpg?t=1592458876,https://cdn.akamai.steamstatic.com/steam/apps/828520/ss_8cf06a06e5f29f51c70a8ff61553af05804a471a.1920x1080.jpg?t=1592458876,https://cdn.akamai.steamstatic.com/steam/apps/828520/ss_3c5ade32c2cb2017b08f48147ef33f16517582b0.1920x1080.jpg?t=1592458876,https://cdn.akamai.steamstatic.com/steam/apps/828520/ss_1961b08bb9c4e2ab71083896cee98b1b73b63f3c.1920x1080.jpg?t=1592458876",
    "Slug": "metis-one",
    "Meta Title": "Metis One: Jun 1, 2018, Actuator Games and Full Overview",
    "Meta Description": "Looking for information on Metis One? Check out the release date (Jun 1, 2018), developer insights from Actuator Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Metis One game - Steam 828520",
    "Canonical URL": "https://gusku.site/game/metis-one",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Metis One\", \"description\": \"Looking for information on Metis One? Check out the release date (Jun 1, 2018), developer insights from Actuator Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 1, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Actuator Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Actuator Games LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/828520/header.jpg?t=1592458876\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}