{
    "AppID": 1509770,
    "Name": "Million on Mars: Space to Venture",
    "Release date": "Sep 21, 2021",
    "About the game": "Space to Venture delivers the most realistic Mars survival crafting city-building experience. Your homestead is a venture corporation with up to a $1 Billion of funding from Ad Astra Unlimited. You are staked with 40 acres of real Martian terrain, carefully shop for your initial rovers, energy systems, and other factories to begin in-situ production on Mars. S2V is a MMO where your settlement is persistent and part of the greater Mars / Earth / Asteroid economy - craft, build and trade with other players and work cooperatively with your friends to build a Martian city. Leveraging your team of rovers and your problem solving skills, prepare your settlement for the arrival of the initial 20 Martians. Trailblaze to become one of the founders of a new great civilization on the red planet. Explore Mars via Real Terrain We have lovingly taken the incredible 3D digital terrain height map data from JPL/University of Arizona’s HiRISE project to create the highest fidelity Martian terrain possible. Your 250 meter hexagon on a side plot of terrain is the real deal - 40 acres of Mars at that exact latitude and longitude on the Red Plant. Command a Team of Rovers Rovers, robotics and automation are the true work horses on the Red Planet. Command small scout and repair rovers, larger mining &amp; hauling rovers, or even take a drive on the most exotic desert in the Beast. Keeping your rovers in working condition, well powered and planning what to focus their efforts on will consume much of your attention. Energy is the Key Craft over 200 Recipes We have the most rigorous deep crafting experience for settling Mars. Starting with the sun, the Martian regolith, the thin Martian atmosphere and the supplies you have purchased and brought from Earth you will boot strap the in-situ manufacturing on Mars to create your settlement. Examples include using a cryogenic atmospheric distiller to chill down the Martian air and store Carbon Dioxide. Scoop up the regolith (Martian dirt) and bake out the water content and then use electrolysis to split the water into hydrogen and oxygen. Take the hydrogen and combine with the carbon dioxide via the Sabatier process to create Methane. Methane to be used as rocket fuel, the basis of in-situ plastics manufacturing and most handy - to burn in the methane fuel cells to have on-demand energy supplies. Manage up to a Billion Dollars of Venture Debt As a tycoon MMO, your ultimate goal is to create a settlement that pays off its $1B of venture debt to Ad Astra Unlimited and grow into a commanding city-state on Mars!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1509770/header.jpg?t=1644604399",
    "Price": 14.99,
    "Developers": "Million on Mars Inc.",
    "Publishers": "Million on Mars Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1509770/ss_0eec32ff54393e9ea86ed79f4fbd7154b293e296.1920x1080.jpg?t=1644604399,https://cdn.akamai.steamstatic.com/steam/apps/1509770/ss_ca6b25bd13a5a0ed5a96a09c6615b3b1568ef6e1.1920x1080.jpg?t=1644604399,https://cdn.akamai.steamstatic.com/steam/apps/1509770/ss_39dbe3d6839313d85faccc6cdfd7cda475809a2f.1920x1080.jpg?t=1644604399,https://cdn.akamai.steamstatic.com/steam/apps/1509770/ss_c6a4d22e406ed061e77511dce03542b744b8c1f4.1920x1080.jpg?t=1644604399,https://cdn.akamai.steamstatic.com/steam/apps/1509770/ss_3b8edfcd484c74b739616b302a9a7695853245c6.1920x1080.jpg?t=1644604399,https://cdn.akamai.steamstatic.com/steam/apps/1509770/ss_3d56038cc2f9bc8f1a17c001e7bab80126cba620.1920x1080.jpg?t=1644604399,https://cdn.akamai.steamstatic.com/steam/apps/1509770/ss_32ea1ee59d4d8a55553e942c172bbfa0298d2b8b.1920x1080.jpg?t=1644604399,https://cdn.akamai.steamstatic.com/steam/apps/1509770/ss_8bd784580cc12d0daeb2fcada07d80d442289647.1920x1080.jpg?t=1644604399,https://cdn.akamai.steamstatic.com/steam/apps/1509770/ss_f820effcdd20cc553e1336911e675f2ee165bf7b.1920x1080.jpg?t=1644604399",
    "Slug": "million-on-mars-space-to-venture",
    "Meta Title": "Million on Mars: Space to Venture: Sep 21, 2021, Million ...",
    "Meta Description": "Looking for information on Million on Mars: Space to Venture? Check out the release date (Sep 21, 2021), developer insights from Million on Mars Inc., a...",
    "Alt Text Image": "Official header image for Million on Mars: Space to Venture game - Steam 1509770",
    "Canonical URL": "https://gusku.site/game/million-on-mars-space-to-venture",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Million on Mars: Space to Venture\", \"description\": \"Looking for information on Million on Mars: Space to Venture? Check out the release date (Sep 21, 2021), developer insights from Million on Mars Inc., a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 21, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Million on Mars Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Million on Mars Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1509770/header.jpg?t=1644604399\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}