{
    "AppID": 2067000,
    "Name": "Momo Mother Bird: Final Story",
    "Release date": "Jul 28, 2022",
    "About the game": "The final story of a horror with momo for fans of horror and scary games. You were left alone at home for a few days. The phone was constantly being torn apart by momo fake call, who were talking about momo horror story. These conversations were terrifying. You haven't slept for several days and are very tired of momo face call. Having decided to take a nap, you were somehow transported to a place that resembles horror games. The doors are locked, no one answers and definitely won't help. Your task is to get out of this terrible game and not let the scary momo catch you! Solve puzzles, escape from the persecution of momo horror stories and get out of this nightmare! Refusal of responsibility: This momo horror story game is not an official momo scarry app and has nothing to do with the original momo character. The plot of the game: You are an ordinary teenager who was sent to the village by his parents because there were rumors about Momo's appearance in the city. You don't believe in this nonsense, but you can't argue with your parents. You are lucky, because the village has everything you need for a modern teenager: a computer, Internet, electricity and even pizza delivery! When another day has passed at the computer, a message arrives to your email saying that Momo, caught in the manor, has again escaped to freedom and is looking for revenge. You laugh at this news and decide it's time to go to bed. At night you wake up in your own ruined room and do not understand what is happening. A text message from Momo arrives on the phone. Unfortunately, you realize that this is not a dream. It's time to play her game! Features: A redesigned hint system, interesting puzzles, a wide interactive field will not make you bored. Get to know the character of the character, experience with him and end the horrors that Momo brings! Momo will track your every move. This is her world and you will play by her rules! With every step, she will be there and will be happy to send you a message on your phone!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2067000/header.jpg?t=1658992301",
    "Price": 0.0,
    "Developers": "Laplace Games",
    "Publishers": "Laplace Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2067000/ss_c24905fa1543138c1df850cb3043bfc17a1ed4af.1920x1080.jpg?t=1658992301,https://cdn.akamai.steamstatic.com/steam/apps/2067000/ss_6a0de27abac3e83123dccfcbeb6711b0fbb61ab9.1920x1080.jpg?t=1658992301,https://cdn.akamai.steamstatic.com/steam/apps/2067000/ss_feb68d809d7bc82e3534b16f517c6f62a5f6c7e0.1920x1080.jpg?t=1658992301,https://cdn.akamai.steamstatic.com/steam/apps/2067000/ss_060b9c582d9a95d3b96dd0d2cf61e9fd228ae579.1920x1080.jpg?t=1658992301,https://cdn.akamai.steamstatic.com/steam/apps/2067000/ss_53c3b1ec048a2eec6e2d0720061df8756996bdfb.1920x1080.jpg?t=1658992301",
    "Slug": "momo-mother-bird-final-story",
    "Meta Title": "Momo Mother Bird: Final Story: Jul 28, 2022, Laplace Game...",
    "Meta Description": "Looking for information on Momo Mother Bird: Final Story? Check out the release date (Jul 28, 2022), developer insights from Laplace Games, and a comple...",
    "Alt Text Image": "Official header image for Momo Mother Bird: Final Story game - Steam 2067000",
    "Canonical URL": "https://gusku.site/game/momo-mother-bird-final-story",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Momo Mother Bird: Final Story\", \"description\": \"Looking for information on Momo Mother Bird: Final Story? Check out the release date (Jul 28, 2022), developer insights from Laplace Games, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Laplace Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Laplace Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2067000/header.jpg?t=1658992301\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}