{
    "AppID": 1488670,
    "Name": "Physics Cake",
    "Release date": "Aug 22, 2021",
    "About the game": "Physics Cake is a 2-D physics simulation game where you can draw containers, objects, or anything you want really and put whatever chosen physical object you want inside of it. All the objects have different interactions that are designed to be fun and entertaining. Physics Cake is similar to old “sand-like” games you would find online many years ago. Physics Cake is designed to be fun and entertaining, like paint, but with basic physics. You can also save your creations and simulations. You can easily share your simulations with anyone else by sharing your saved text files with them. Physics Cake supports steam cloud, so anything you have saved will be backed up to steam automatically when you exit the game. This way you can keep your creations across devices. The game is easy to start and has built-in help descriptions for all the objects and basic functions by clicking the ? Or ?2 buttons in the game. Physics Cake is currently in early access as we plan to add user suggestions, fix any bugs, improve stability, and in general make a fun open 2-D simulation game that can be entertaining for minutes or for hours. Below is a list of all the objects currently in the game (most objects are able to be re-arranged after spawning by right-clicking and dragging the object as wanted): None: nothing spawned on click (default) Delete: A red crossed through circle that deletes anything you touch with it. Line: A solid line to draw things with, or make containers. Water: A liquid ball of water. Oil: A liquid glob of oil. Steam: Quick rising steam that evaporates. Fire: It burns things, duh! Wood: Woodblocks that act similarly to the line (wood can be affected by other objects life fire). Jello: Wiggly, jiggly jelly, bouncy, and expandable. Spinner-R: Spins to the right like a singular fan blade. Spinner-L: Spins to the left like a singular fan blade Void: A tiny black hole, anything sucked into it is deleted automatically. Clack: Clacker balls that are pinned to the spawn area Grass: Grass, can be watered to be grown. Ice: Cubes of ice that freeze things and jiggle like real ice cubes. Water-SP: Endlessly spawns water objects from the chosen location. Ice-SP: Endlessly spawns ice objects from the chosen location. Oil-SP: Endlessly spawns oil objects from the chosen location. Jello-SP: Endlessly spawns jello objects from the chosen location. Steam-SP: Endlessly spawns steam objects from the chosen location. E-SP: Endlessly spawns electron objects. Sand-SP: Endlessly spawns sand objects. Kill Line: The standard object, but any physical objects that touch it are removed on contact. Pulley: Two connected weights that make up a pulley system. Sticky: Sticks to other physical objects. (limited to 400 instances on screen at once) COLORED L BUTTONS: Produces the LINE object in the chosen color. Etron: Short for electron. Bounces randomly at high velocity. Not affected by void, wood, or ice, and can electrify objects on contact. Drag u: Drags any physical objects upwards that are below it. Fire-SP: Endlessly spawns fire objects above it. Kill Line: The standard object, but any physical objects that touch it are removed on contact. Ball: The clacker ball object, but unpinned so it can move around freely. Stick: A little stick figure man (limit one). Try not to set him on fire… You monster… Sand: It’s EVERYWHERE Portal In: Anything that goes in the in portal will come out of the out portal. (limit 1) Portal Out: Things that go in the in portal will come out of this one. (limit 1) You can also alter the gravity of the simulation at any time you wish.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1488670/header.jpg?t=1629691043",
    "Price": 0.99,
    "Developers": "Merriman Games",
    "Publishers": "Merriman Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_edfdc104a82fa828f77acb1f3707a0ea2629b42a.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_21303363d34fc772e13fbc2eb584aafb213fd30e.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_4f2d18ac1ee296a8255b40cd949c1da35d0babd6.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_48cf67120a9150b39508761ac7857d5d1c2ce69a.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_3a07a157aada37bb525f8419e911dd3dd1ff9a03.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_24cb04ba90e6640ece53190fa9c8f3443833083b.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_58255f1f8496078d4efca3ace664a72ec277a201.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_0f8d0221dd98ddfe41447ebae8bd09eda9ea8b98.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_698ac48446388c6ad924e8d12ba3af49a33bb0c4.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_eaa1dbdce5a2d3a8029be5f3ea79fa1780e21192.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_aeb06eef4d69c3b5b5925ebe27b9cebace6abe59.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_614c5ea8164c368feb9343114cffeec8b326ba2c.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_b9454dd857f9f717c5aa44685b72f2bd4866f669.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_35f3fe80c294f9cec19483668e3fe4d1b8fdefe8.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_21a20c3d77f7325d5a15076dd5789801e6502292.1920x1080.jpg?t=1629691043,https://cdn.akamai.steamstatic.com/steam/apps/1488670/ss_657a848eb9c638ade24eef5b4973e31b69f709db.1920x1080.jpg?t=1629691043",
    "Slug": "physics-cake",
    "Meta Title": "Physics Cake: Aug 22, 2021, Merriman Games and Full Overview",
    "Meta Description": "Looking for information on Physics Cake? Check out the release date (Aug 22, 2021), developer insights from Merriman Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Physics Cake game - Steam 1488670",
    "Canonical URL": "https://gusku.site/game/physics-cake",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Physics Cake\", \"description\": \"Looking for information on Physics Cake? Check out the release date (Aug 22, 2021), developer insights from Merriman Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Merriman Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Merriman Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1488670/header.jpg?t=1629691043\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}