{
    "AppID": 2077950,
    "Name": "Pretty Girls Breakout! PLUS",
    "Release date": "Jul 28, 2022",
    "About the game": "'Pretty Girls Breakout!', A batting action-type breakout game that hits, hits, and hits back, is powered up! New game modes and new gimmicks have been added to make 'Pretty Girls Breakout! PLUS'! Complete the stages and get the costumes of 10 Pretty Girls to complete the game! ◆ Game content 'Pretty Girls Breakout!' is a block breaking game in which you control the player, batting at the right time and hitting the ball back. Depending on the stage, enemies will appear and shoot attack bullets, but aggressively hit back the bullets, destroy blocks and defeat the enemies to aim for a high score! ◆ New game modes! Pretty Battle This mode has 5 stages for each of the 7 characters. The difficulty level increases with the level of the stage. You can earn points by clearing each stage. Use the points you earn to get new costumes from the point exchange in the dressing room! Eternal Challenge In this mode, players compete to see how high they can increase their high score by endlessly breaking blocks that are approaching. The score increases as you break blocks and smash continuously, but it decreases as the ball falls or you take damage. The game is over when the block reaches the position of your ship. Try your hand at the endless, never-ending stages! ◆ 'KAWAII' Girls are waiting for you! There are 10 characters in total! New costumes can be changed in the dressing room. All characters are voiced in Japanese. ◆The Dressing Room has been powered up! The latest version of the Dressing Room, a well-known feature of the Pretty Girls series, is now available. In the diorama mode, you can place multiple characters at the same time and customize each character's placement, facial expression, and costume. Ten different stamps can be attached to decorate the scene! ◆ Character introduction Beatrix Queen of the fairy kingdom who descended to the human world. She is an egomaniac who respects beautiful things and can't help acquiring them. Ayame A mischievous girl with a strong sense of justice. But in fact, she is actually shy. Rui Rui is one of the most popular idols of the moment. She becomes tsundere in front of men she likes. Asahi Kind, family-oriented, and firm. She is good at housework and is relied on to do it, but she is not good at sports. Yu Yu is a responsible and serious person, but she is often defenseless. She is family-oriented and good at housework. Erina A kind and caring teacher. She is the advisor of the swimming club. Ryoka A strict physical education teacher who is hard on herself and others. She is often feared by her students. Miku A cheerleader who uses her athletic prowess to her advantage. She is a cute little sister with a sassy and pouty personality. Misa A calm, mature woman with a seductive sex appeal. She prefers older men. Yuri An elite type with a clear head. She is bitter about the open-minded lifestyle of women and believes that love should be a healthy relationship. *All bishojo characters are officially licensed for use. *All characters in this game are 18 years of age or older.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2077950/header.jpg?t=1659055089",
    "Price": 3.99,
    "Developers": "Zoo Corporation",
    "Publishers": "Zoo Corporation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2077950/ss_e13c141c1d9f126f22becc830fe2204ab0b12e4c.1920x1080.jpg?t=1659055089,https://cdn.akamai.steamstatic.com/steam/apps/2077950/ss_2e54fdd131daa4191700fcec66eeead73683e94e.1920x1080.jpg?t=1659055089,https://cdn.akamai.steamstatic.com/steam/apps/2077950/ss_29dbb63ad86d41b866ef9ff7b2bc7b975440dff2.1920x1080.jpg?t=1659055089,https://cdn.akamai.steamstatic.com/steam/apps/2077950/ss_5b5e0348567f3dbd43d259283939c03081602ae7.1920x1080.jpg?t=1659055089,https://cdn.akamai.steamstatic.com/steam/apps/2077950/ss_7dcfa820401d33df3e100cd15dd58f21440757f7.1920x1080.jpg?t=1659055089",
    "Slug": "pretty-girls-breakout-plus",
    "Meta Title": "Pretty Girls Breakout! PLUS: Jul 28, 2022, Zoo Corporatio...",
    "Meta Description": "Looking for information on Pretty Girls Breakout! PLUS? Check out the release date (Jul 28, 2022), developer insights from Zoo Corporation, and a comple...",
    "Alt Text Image": "Official header image for Pretty Girls Breakout! PLUS game - Steam 2077950",
    "Canonical URL": "https://gusku.site/game/pretty-girls-breakout-plus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pretty Girls Breakout! PLUS\", \"description\": \"Looking for information on Pretty Girls Breakout! PLUS? Check out the release date (Jul 28, 2022), developer insights from Zoo Corporation, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zoo Corporation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zoo Corporation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2077950/header.jpg?t=1659055089\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}