{
    "AppID": 1123850,
    "Name": "Red Black Poker",
    "Release date": "Sep 8, 2019",
    "About the game": "Red Black Poker is a modern remake of the classic game of video poker. With crisp vector graphics and a simple interface, this extremely addictive game will keep you entertained for hours. Red Black Poker simulates a casino video poker machine. There are two hands displayed in each round. In the first hand five cards are displayed on the screen. Cards that the computer believes are relevant are held for the next hand. The computer doesn't necessarily makes the best decision every time, so feel free to hold cards at your discretion. in the second hand the cards that were not held in the first hand are replaced. If there is a winning hand a notification sound followed by a short melody give you time to choose between collecting or doubling the money won. If you choose to double your money, you are taken to a different interface where several cards are displayed. You must guess if the next card will be red or black, if you guess correctly the amount you win is doubled. This can allow your winning amount to grow exponentially, up to 64 times the initial winning sum. Keep in mind that you are free to collect your winnings at any point during the game. The initial payment is all that this game costs. There are no in app purchases, the cash is unlimited, simply click the ' Add More Money' button to insert cash into the virtual machine. KEY FEATURES One time payment. Free to play forever Play on a resizable window or full screen Adapts to any screen resolution automatically Absolute real shuffled deck of cards displayed, no tricks ( Read developer description below ) Crisp vector graphics Different sounds for each winning hand Ability to choose card design Ability to change cards display speed Wild JOKER Auto Hold AI Bonus and ability to double up bonus Double Up your winnings exponentially up to 64 times Bet up to $100 per hand Winning statistics Automatically saves all winnings and statistics FROM THE DEVELOPER The mechanics of Red Black Poker are described below.. In this game there are 2 decks of cards. One for the poker game itself and the other for the bonus round where you must guess the color of the next card in the deck. The first deck ( for the Poker game ) contains 53 cards ( including the JOKER ) . These cards are shuffled once, and cards are pulled out of the deck one by one and then displayed on the screen. What I'm trying to say is that this game simulates an absolute realistic setting, there are no statistical algorithms that would slim or increase your chances to win. The second deck of cards ( the guessing round cards ) is a separate deck that works in a different way. The deck exists in the computer's memory as long as the deck isn't finished. The computer chooses a card randomly from this deck at the time when the user pushes the Red or Black button. If the card wasn't displayed before it's displayed to the user. This way not even the computer knows if the next card will be black or red. I had a few people test it and everyone thought there are some kind of patterns in guessing the cards. I can assure you that there are no patterns. It's all absolutely random. However, it does help to keep track of the colors you guessed before. Maybe... Good Luck !",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1123850/header.jpg?t=1567968239",
    "Price": 5.99,
    "Developers": "Cyclotron",
    "Publishers": "Cyclotron",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1123850/ss_f617c70bcf537b68579ce50beddfc6a1a02dfb08.1920x1080.jpg?t=1567968239,https://cdn.akamai.steamstatic.com/steam/apps/1123850/ss_70f5e9134e3d8c52e7b892f2cbb4d3f4cf428328.1920x1080.jpg?t=1567968239,https://cdn.akamai.steamstatic.com/steam/apps/1123850/ss_dabf547a8a66b9dc7ef255eabdcb7161ee54678f.1920x1080.jpg?t=1567968239,https://cdn.akamai.steamstatic.com/steam/apps/1123850/ss_613bacbd5170add89af89fb22797f0c55725d9f3.1920x1080.jpg?t=1567968239,https://cdn.akamai.steamstatic.com/steam/apps/1123850/ss_617baf48e2221c7436e2d04e2774e2ddb85cc484.1920x1080.jpg?t=1567968239,https://cdn.akamai.steamstatic.com/steam/apps/1123850/ss_a715ccef4854d03b6cb33576ee64da3f19302187.1920x1080.jpg?t=1567968239,https://cdn.akamai.steamstatic.com/steam/apps/1123850/ss_524f6f2352d441bf022a6225731c15351bf50ee7.1920x1080.jpg?t=1567968239,https://cdn.akamai.steamstatic.com/steam/apps/1123850/ss_1ef0206520f86388469b33ba309187d956070e29.1920x1080.jpg?t=1567968239,https://cdn.akamai.steamstatic.com/steam/apps/1123850/ss_e8f0e232affe7854e8d0ab45b2f17c771d50399b.1920x1080.jpg?t=1567968239,https://cdn.akamai.steamstatic.com/steam/apps/1123850/ss_6a5dc0a86f1d49c3f28e2be79a144c2cd6c56260.1920x1080.jpg?t=1567968239",
    "Slug": "red-black-poker",
    "Meta Title": "Red Black Poker: Sep 8, 2019, Cyclotron and Full Overview",
    "Meta Description": "Looking for information on Red Black Poker? Check out the release date (Sep 8, 2019), developer insights from Cyclotron, and a complete game summary.",
    "Alt Text Image": "Official header image for Red Black Poker game - Steam 1123850",
    "Canonical URL": "https://gusku.site/game/red-black-poker",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Red Black Poker\", \"description\": \"Looking for information on Red Black Poker? Check out the release date (Sep 8, 2019), developer insights from Cyclotron, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 8, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cyclotron\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cyclotron\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1123850/header.jpg?t=1567968239\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}