{
    "AppID": 1211950,
    "Name": "Sheol",
    "Release date": "Jan 6, 2020",
    "About the game": "You are the undead man of church that was killed while chasing the bishop. Your task was to destroy mighty Aspects - spirits of the upside-down world. Those spirits try to dive into our reality through sigils. However, you were betrayed and slayed. When you wake up, you see that the undead world is real and now - you are the servant of King of Tears and you have no choice but to serve him, bringing lost sould to his Hall. Now you just a puppet...or now? Server the King and try to get chance to ressurect. FEATURES: Unique mixup of adventure, castle manager and visual novel. - Go through randomly generated forest levels, find souls and bring them to the Hall. - Gather resources, fight enemies and Build and upgrade functional objects in the Hall - Be careful - you can survive and find a soul or take a risk to get more resources. But beware the keeper of forest. - Resist the power of Decay. - Dive into dark story with unique soundtrack. About UPDATES. Hey, Guys! Our game is still under development and will be more complex in future. Right now we are releasing the 'skeleton' of the game. Eveyrone who've supported us will get full version and all upcoming updates and patches. These are things we are planning to add in future: New storyline, PvP, New interactive quest mechanics and missions, New buildings and artifact system that change the rule of playing and lots of more. ABOUT US: We are Tauron Glyph - small indie studion that adores grim stories and dark fantasy. Sheol is our subproject that should help us with the release of our main title - Sigil As we do not treat players as children, we don't want to explain all tricks and possibilities that can be hidden in our games. We want you do discover possibilities and mechanics. Please note that this is our debut game and we always gather feedback and improving our game as well as in-game mechanics.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1211950/header.jpg?t=1581332994",
    "Price": 9.99,
    "Developers": "Tauron Glyph",
    "Publishers": "Tauron Glyph",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1211950/ss_77561fc669d092783439dbfa914c4bba8fedd3d2.1920x1080.jpg?t=1581332994,https://cdn.akamai.steamstatic.com/steam/apps/1211950/ss_237552103c3a7f12aa6999541bc85352ae3ac3e9.1920x1080.jpg?t=1581332994,https://cdn.akamai.steamstatic.com/steam/apps/1211950/ss_232ede96e093c3a614f991482aab7850de40e7ce.1920x1080.jpg?t=1581332994,https://cdn.akamai.steamstatic.com/steam/apps/1211950/ss_d006046dfc0680d11b2881af4d7870f4e73b2062.1920x1080.jpg?t=1581332994,https://cdn.akamai.steamstatic.com/steam/apps/1211950/ss_d7495419a051776ea829bb08f71894b04e436c21.1920x1080.jpg?t=1581332994",
    "Slug": "sheol",
    "Meta Title": "Sheol: Jan 6, 2020, Tauron Glyph and Full Overview",
    "Meta Description": "Looking for information on Sheol? Check out the release date (Jan 6, 2020), developer insights from Tauron Glyph, and a complete game summary.",
    "Alt Text Image": "Official header image for Sheol game - Steam 1211950",
    "Canonical URL": "https://gusku.site/game/sheol",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sheol\", \"description\": \"Looking for information on Sheol? Check out the release date (Jan 6, 2020), developer insights from Tauron Glyph, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 6, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tauron Glyph\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tauron Glyph\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1211950/header.jpg?t=1581332994\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}