{
    "AppID": 2068810,
    "Name": "Solar Nations",
    "Release date": "Aug 4, 2022",
    "About the game": "Since the dissemination of the hyperdrive, the squabbling planet-states of humanity have longed for greatness, and you will be the one to bring it to them. Lead humanity to greater heights than before thought possible! You are the mind behind a vast interstellar empire, eager to achieve greatness. Battle, influence, and strategize your way through a history in the making so that in the distant future, your struggles, victories, and even defeats will be the inspiration for future Empires like yours. SPACE IS BIG And the galaxy is bigger. Each region represents thousands of worlds, and even a thousand ships cannot hope to cover enough ground to bring an Empire to it's knees. Luckily for you, you will command millions! Each region is hand-crafted and plays a role in the overarching story of Mankind - a story you get to make! STRATEGIC WAR War is hell, and the resolve of your people will be tested as you plunge into the meat grinder knowing that each battle costs thousands of ships, and millions of lives. Battles are waged at light-hours distance, cover massive portions of space, and require extensive management to win. This is not simply a numbers game, as endurance, technology, and wit play starring roles in this space opera. COMPETENT AI OPPONENTS Wars are only as good as those who wage them, and so the AI has been engineered with war and user experience in mind. The AI engages honorably in battle, and refrains from cowardly and annoying tactics and cheats. However, this does not mean they are incompetent; they have every ambition you do, and the same tools with which to achieve it. ECONOMIC CYCLES Some things never change, and even in this far future world, capitalism still rears it's ugly head. Rampant industrialization has lead to regular economic cycles which add depth to the gameplay dynamic. They may put your plans for galactic domination on hold, but recessions also create unique opportunities to destroy more powerful rivals. HISTORY IN THE MAKING Experience multiple unique scenarios, set centuries apart, which tell a thousand year history of mankind in perpetual struggle. Each one is tuned for interesting situations and replay value, with unique nations and technologies. Or you can pick the earliest one and play a millennium all in one game! ONE GAME, ONE PRICE There will never be DLC or paid content of any kind in this game, you pay for the game, the full game is yours, along with any future updates!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2068810/header.jpg?t=1659820065",
    "Price": 17.99,
    "Developers": "Flomgus Games",
    "Publishers": "Flomgus Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2068810/ss_3af01521dd3d80d349848a4d4d400b49dd6304fe.1920x1080.jpg?t=1659820065,https://cdn.akamai.steamstatic.com/steam/apps/2068810/ss_76b58b3e61c460789bbcebab0190f66cdcbd706d.1920x1080.jpg?t=1659820065,https://cdn.akamai.steamstatic.com/steam/apps/2068810/ss_929d1d1e1778d0a2566dd8f4275483204dff2cd2.1920x1080.jpg?t=1659820065,https://cdn.akamai.steamstatic.com/steam/apps/2068810/ss_f9170aeee929e42a1ed0747857fa2efa4a176189.1920x1080.jpg?t=1659820065,https://cdn.akamai.steamstatic.com/steam/apps/2068810/ss_7cb2efd9dbc1445dbc5acfeaf2007d3d06afa82a.1920x1080.jpg?t=1659820065,https://cdn.akamai.steamstatic.com/steam/apps/2068810/ss_2e93474b5a04afc83e50125290f21e4a0a0b7188.1920x1080.jpg?t=1659820065",
    "Slug": "solar-nations",
    "Meta Title": "Solar Nations: Aug 4, 2022, Flomgus Games and Full Overview",
    "Meta Description": "Looking for information on Solar Nations? Check out the release date (Aug 4, 2022), developer insights from Flomgus Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Solar Nations game - Steam 2068810",
    "Canonical URL": "https://gusku.site/game/solar-nations",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Solar Nations\", \"description\": \"Looking for information on Solar Nations? Check out the release date (Aug 4, 2022), developer insights from Flomgus Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Flomgus Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Flomgus Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2068810/header.jpg?t=1659820065\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}