{
    "AppID": 1709180,
    "Name": "Solitaire Expeditions",
    "Release date": "Jul 23, 2022",
    "About the game": "Solitaire without the gimmicks! Free play mode offers 150 solitaire variants in a clean and simple interface. No gems, power-ups or wildcards, just classic solitaire games played with standard rules. Choose from well-known favorites such as Klondike, FreeCell, Spider, Canfield, and Golf or try a new variant you've never heard of before! Don't know how to play? No problem—rules for all variants are available in game. Why just play solitaire when you can go on an expedition? If you're looking for more, try expedition mode where you can embark upon a cross-country road trip. Plan your route and travel from state to state by winning games. And since every expedition needs mystery and adventure, each state features three randomly selected solitaire variants, letting you experience games you may have never seen before! Discover and unlock new items What’s an expedition without new things to discover? As you make your way through an expedition or free play, accumulate points, earn achievements or find other ways to unlock new card backs, decks or backgrounds. User profiles Solitaire Expeditions supports multiple user profiles. Keep your hard-earned stats and progress separate from other members of your family or friends! Complete list of variants (150 in total) A: Accordion, Acme, Acme II, Addiction, Agnes Bernauer, Ali Baba, All in a Row, American Toad, Arizona, Aunt Mary, Australian Patience B: Baby Spiderette, Baker's Dozen, Baker's Game, Batsford, Beleaguered Castle, Baroness, Baroness II, Beehive, Big Apple, Black Hole, Black Widow, Block Ten, Bristol, Busy Aces C: Canfield, Corona, Castles in Spain, Chameleon, Clock, Colours, Criss-Cross D: Dawson, Demon Fan, Deuces, Diplomat, Double Canfield, Double Fourteens, Double Gaps, Doublets, Dutchess E: Eagle Wing, Easthaven, Eight Off, Emperor, Escape From New York, Exit F: Faerie Queen, Faerie Queen II, Fan, Fanny, Farmer's Wife, Flower Garden, Fly, Fortune's Favor, Forty Thieves, Fourteen Out, FreeCell, Frog G: Gaps, Gargantua (no redeal), Gargantua (one redeal), Giza, Golf (Kings on Queens), Golf (Putt Putt), Golf (Traditional), Good Measure, Grounds for Divorce H: HardCell, How They Run I: Indian, Intelligence J: Josephine, Juvenile K: King Albert, Klondike (draw 1), Klondike (draw 3) L: La Belle Lucie, Lady Betty, Lanes M: Martha, Maze, Milligan Harp, Miss Milligan, Monte Carlo N: Napoleon's Square, Nestor, New York, Number Ten O: Osmosis P: Peek, Penguin, Pile Up, Poker Squares, Pyramid Q: Quadrangle, Queen of Italy, Queens and Jacks R: Rainbow, Rainbow II, Red and Black, Relaxed FreeCell, Relaxed Pyramid, Rows of Four, Russian Solitaire S: Salic Law, Salic Law II, Scorpion, Scorpion II, Seahaven Towers, Selective Castle, Siegecraft, Simple Pairs, Sir Tommy, Spanish Patience, Spider (1 suit), Spider (2 suits), Spider (4 suits), Spiderette (1 suit), Spiderette (2 suits), Spiderette (4 suits), Stonewall, Storehouse, Strategy, Streets and Alleys, Superior Canfield T: The Clock, Thieves of Egypt, Thirteens, Thirty Six, Three Blind Mice, Three Blind Mice II, Three Cells, Thumb and Pouch, Thumb and Pouch 2 Decks, Tri-Peaks, Tri-Peaks II, Triangle, Triple Klondike, Two Cells V: Variegated Canfield, Vertical W: Wasp, Westcliff, Whitehead, Wildflower, Will o' the Wisp X: X Marks the Spot Y: Yukon Z: Zendike",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1709180/header.jpg?t=1658586172",
    "Price": 9.59,
    "Developers": "Quirky Porcupine",
    "Publishers": "Quirky Porcupine",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1709180/ss_f0be44affa6888ecd99726acd03c36076eb12615.1920x1080.jpg?t=1658586172,https://cdn.akamai.steamstatic.com/steam/apps/1709180/ss_9ee9eedc90b22bb3f6fc44b21dde655a200bdbee.1920x1080.jpg?t=1658586172,https://cdn.akamai.steamstatic.com/steam/apps/1709180/ss_f34263bb43804f777337054961de57a4ecfd5762.1920x1080.jpg?t=1658586172,https://cdn.akamai.steamstatic.com/steam/apps/1709180/ss_a97f8c64329af716eba308b05930028cff0a83a8.1920x1080.jpg?t=1658586172,https://cdn.akamai.steamstatic.com/steam/apps/1709180/ss_5cab0625014ae24a99fb408ecb4b43b91e0e5797.1920x1080.jpg?t=1658586172,https://cdn.akamai.steamstatic.com/steam/apps/1709180/ss_0e2e6061c723a74242a3ce6a9af94bade481df04.1920x1080.jpg?t=1658586172,https://cdn.akamai.steamstatic.com/steam/apps/1709180/ss_13914332151c71c037bfb70770861d3dac2efc23.1920x1080.jpg?t=1658586172",
    "Slug": "solitaire-expeditions",
    "Meta Title": "Solitaire Expeditions: Jul 23, 2022, Quirky Porcupine and...",
    "Meta Description": "Looking for information on Solitaire Expeditions? Check out the release date (Jul 23, 2022), developer insights from Quirky Porcupine, and a complete ga...",
    "Alt Text Image": "Official header image for Solitaire Expeditions game - Steam 1709180",
    "Canonical URL": "https://gusku.site/game/solitaire-expeditions",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Solitaire Expeditions\", \"description\": \"Looking for information on Solitaire Expeditions? Check out the release date (Jul 23, 2022), developer insights from Quirky Porcupine, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 23, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Quirky Porcupine\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Quirky Porcupine\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1709180/header.jpg?t=1658586172\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}