{
    "AppID": 502720,
    "Name": "Star Explorers",
    "Release date": "May 8, 2018",
    "About the game": "Notice Star Explorers is a game made by a single person over the course of many years - janky behavior may be experienced. You may reach out to the developer on the Steam forum or Discord server with any questions, bug reports or insults. Version 5.0 Earth has been destroyed, and humanity must find a way to survive. Star Explorers grants players a tremendous amount of freedom and agency in how to approach the game without holding your hand, but with freedom comes responsibility and consequences. Take risks and reap the rewards in your efforts to find a new home for the human race in this open world space exploration game. Reviews: '...See, the galaxy Schmidt has created here isn't cruel. 'Cruel' implies that it cares. And this galaxy is terribly, terribly uncaring...' - MagFlare – Steam User '...This game, at its core, is about exploration, and it scratches my space exploration itch in a way that no game has since I played Starflight as a kid...' - battlescar2014 – Steam User Planets Planets are formed randomly, but their conditions are based on somewhat scientific factors. The size and temperature of the star they orbit, their distance from that star, the type of surface, atmosphere, and liquids present (or not) determine how a planet will look once landed on. Players will be able to land, depart and return to planets, exploring their surfaces as well as underground cave systems repeatedly, while keeping the same features intact on each visit. Exploration Fuel, ammunition and oxygen will all have to be carefully managed if the player wants to survive the long search for an earth-like planet. While many planets will be too hot or cold, or without an atmosphere, there are also worlds of liquid methane, ammonia, sulphuric acid and more, that have developed their own unique evolutionary cycles. Each kind of alien plant, tree or animal is pieced together randomly, making for a unique experience for each player. The Star Explorers universe is not a friendly one though, it can be cruel and indifferent to the struggles of its inhabitants. If you're not careful, you might land on a planet that's just too hot, or too cold, or enveloped in a cloud of corrosive acid, and not live to tell about it. Upgrading your space suit will open these otherwise impossible worlds to further exploration. Inventory, Upgrading and Crafting Exploration will allow the player to discover many things, including tools and resources that will help in further exploration. Among these are raw materials, weapons, armor upgrades and blueprints that allow you to craft helpful items. Armor upgrades will increase your space suit's resistance to heat, cold and other environmental hazards. Some weapons allow you to access areas that may be closed off to less experienced adventurers. Caves and Ancient Ruins Star Explorers may be the first interstellar dungeon crawler. Traversing the dark, hidden places and caves is necessary to find the resources required to complete the game. Discover the crumbling remains of an ancient culture and learn the secrets of its mysterious people. In Star Explorers, exploration and investigation are rewarded with special items and locations that many players may never find. If you are someone who likes to look around every corner, then this is the game for you. Generative Design Almost everything in Star Explorers is produced generatively. From the locations of stars and nebulae, to the surfaces of planets and their features, every location is different, and every play-through offers unique challenges. Even the music heard in game is generated in real time, and is based purely on the parameters of the player's environment. Each planet, cave and other location has a unique sound-track. The Future of Star Explorers Star Explorers is still in development. You can see update announcements here on the store page, and in the community hub. Version 5.0 is well underway, and will be released some time in the Fall. It includes a number of new features in including an improved star chart, alien city, more dialogue options, mothership interior, tornadoes, meteors, sand planets and much more in terms of small improvements and updates. A full feature list will be compiled when it is ready for full release.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/502720/header.jpg?t=1640882597",
    "Price": 4.99,
    "Developers": "Schmidt Workshops",
    "Publishers": "Schmidt Workshops",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_0cfd8454dfdcf68aeaba807b51e9ed11a2c5db25.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_30b3ac88d84a4d145177623bb360af9a4d08efc9.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_564bb3ff9bb767821b01f495f707f3043589f14c.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_3b98d978e474122ac5960c4f679f60f027866c99.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_766e33ca256a69622948ffead98de8673f79b4fe.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_378885f9e659e5f609878fb384d40ebe4467fa54.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_a3130bbf5c60e55b321175b5619a7a01d2c84299.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_7c138382fb2d9236feba9cc2a20f9b096176093f.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_f1985aabe9f8ca41b1688a6be77f625a886e45d1.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_536874b240c47d3d363e9910ec08b623eb9e371b.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_980592ac6a5fda3dd5804ed5644f78c22da424dd.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_0f884cfc5d854125c9d6c99569bbc34c4776e876.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_982dd28ab97a802aaff2e4b38c680e1e11137674.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_8b090ecb7ee005561b5d856d72d4a376db1f41bd.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_58455720603cec5c9064cd0c8d55b820873e1f81.1920x1080.jpg?t=1640882597,https://cdn.akamai.steamstatic.com/steam/apps/502720/ss_b33c8f7bb23e2eace96c1ad96b2f2bb79b329e72.1920x1080.jpg?t=1640882597",
    "Slug": "star-explorers",
    "Meta Title": "Star Explorers: May 8, 2018, Schmidt Workshops and Full O...",
    "Meta Description": "Looking for information on Star Explorers? Check out the release date (May 8, 2018), developer insights from Schmidt Workshops, and a complete game summ...",
    "Alt Text Image": "Official header image for Star Explorers game - Steam 502720",
    "Canonical URL": "https://gusku.site/game/star-explorers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Star Explorers\", \"description\": \"Looking for information on Star Explorers? Check out the release date (May 8, 2018), developer insights from Schmidt Workshops, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Schmidt Workshops\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Schmidt Workshops\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/502720/header.jpg?t=1640882597\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}