{
    "AppID": 641050,
    "Name": "StroodleDoodle",
    "Release date": "Sep 14, 2017",
    "About the game": "StroodleDoodle is a fun 3D World-Building and Modeling Tool for Virtual Reality where Everything is 3D Printable! What Is This Thing? This app was designed and built for Vive from the ground up with the goal of being incredibly simple to learn and use. Most users can learn how it works and produce their first fun, printable model in 10 minutes, but power users can discover tricks and techniques for hours to come. Ever wanted to share your 3D creations simply and quickly? With StroodleDoodle all you have to do is press the 'Export' button and your work is instantly published to our public SketchFab account. Want more control? Just sign up for a SketchFab account and paste your API key into the StroodleDoodle API Key file, now your exports will go directly to your personal account. This app is designed to be a simple and intuitive way to create things in 3D. Straightforward tools make all the difference. 3D Models Made In Just A Few Minutes Features Canvas Extruder : A mutant hybrid between a selfie stick and a play-dough machine, the canvas extruder is where you can draw 2D shapes and pop them into the third dimension. Just set the Extrusion Depth and stamp a copy of your blob into the world. Teleporter : Point and go, anywhere in the world. If you want to go big, build scaffolds to stand on and remove them when you're done, or make a castle in the sky, it's up to you. Instantaneous transit means no movement to make you sick. Just pull the trigger and click your thumb. Grab : Positioning objects in a traditional 3D editor is tedious and complex, but here, it could not be simpler. Just reach out and grab any blobs to position them wherever you want. Paint : Monochromatic spaces are no fun, so you can easily choose the color of any blob before you stamp it into the world. Wanna change a blob's color after stamping? Just reach out with your brush and swipe it to the color you want. Cut : Don't like that blob? ZIP. Gone. Reach out with your scissor tool to remove blobs you don't like anymore. Export : Save directly to sketchfab for easy sharing, either to our account, or your own. Find it after you export at our Sketchfab Account. More advanced users can export directly to their own sketchfab accounts. Just drop a sketchfab_api_key.txt file in your game directory with your api key in it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/641050/header.jpg?t=1505953121",
    "Price": 9.99,
    "Developers": "Eric Neuman",
    "Publishers": "Eric Neuman",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/641050/ss_205091cd87e7cb39c13ad694817f1c267be1c54c.1920x1080.jpg?t=1505953121,https://cdn.akamai.steamstatic.com/steam/apps/641050/ss_95c71aaaaa4b46f78d073f24418eaa97ae2b990c.1920x1080.jpg?t=1505953121,https://cdn.akamai.steamstatic.com/steam/apps/641050/ss_5a291d0f4f3ee38e30bd7c19b2a285fa0864dbf9.1920x1080.jpg?t=1505953121,https://cdn.akamai.steamstatic.com/steam/apps/641050/ss_602a98a5bf68d2c9aa91865fd0bf22b39ddc9222.1920x1080.jpg?t=1505953121,https://cdn.akamai.steamstatic.com/steam/apps/641050/ss_3d590bb7cc0354ecbf7696b5c4f9cc2e6d126985.1920x1080.jpg?t=1505953121,https://cdn.akamai.steamstatic.com/steam/apps/641050/ss_74adbb9a7ff9a58fa154ff9d402e460cd00e6c4b.1920x1080.jpg?t=1505953121,https://cdn.akamai.steamstatic.com/steam/apps/641050/ss_13561e2d48ace218bcf1a90ff5539e3b15ae18e9.1920x1080.jpg?t=1505953121",
    "Slug": "stroodledoodle",
    "Meta Title": "StroodleDoodle: Sep 14, 2017, Eric Neuman and Full Overview",
    "Meta Description": "Looking for information on StroodleDoodle? Check out the release date (Sep 14, 2017), developer insights from Eric Neuman, and a complete game summary.",
    "Alt Text Image": "Official header image for StroodleDoodle game - Steam 641050",
    "Canonical URL": "https://gusku.site/game/stroodledoodle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"StroodleDoodle\", \"description\": \"Looking for information on StroodleDoodle? Check out the release date (Sep 14, 2017), developer insights from Eric Neuman, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 14, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eric Neuman\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eric Neuman\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/641050/header.jpg?t=1505953121\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}