{
    "AppID": 940020,
    "Name": "Survive Together",
    "Release date": "Aug 24, 2020",
    "About the game": "Survive Together is a 2D world simulator where players are thrown into the many perils of nature, and together overcome them to build a thriving empire. Core Features Building - Players and NPCs will build up their homeland, starting with a stone campfire and work towards large cities. Crafting - Interact with items in the world to create what you need. Tools, buildings, weapons, clothing, etc. Combat - Fight off hungry rats that come for your food, invaders from a foreign village, roaming monsters or worse. Multiplayer - Host a server or join a friend and play together via the server browser or direct IP. Twitch - Set the game to your Twitch channel so viewers can interact with the game via chat commands. For example, !play will spawn the user in the womb of a villager. Guides - Detailed information about all game related material can be found within the game. Hovering over any item and pressing 'G' will open a guide explaining all functions of the item, or 'H' to bring up a guide for an item in hand. There is also a general help menu by clicking the '?' at the top left of the game window. Saving - Ability to save and load multiple game states. Achievements - Complete various challenges to earn Steam achievements, such as surviving for 100 days. Professions Leader - The town expert of the town. Responsible assigning professions, handling diplomatic decisions such as war/peace status, leading expeditions, exiling problematic villagers and deciding the general direction of the town progression. Carpenter - The wood expert of the town. Responsible for cutting down trees, constructing buildings and crafting furniture. Blacksmith - The metal expert of the town. Responsible for digging stone/ore quarries, mining, forging metal from ore, creating coal from wood, crafting metal tools and objects. Farmer - The plant expert of the town. Responsible for creating farm plots, planting and watering seeds and harvesting crops. Mason - The stone expert of the town. Responsible for creating stone bricks, laying down new roads and crafting other stone related tools and materials. Hunter - The trap expert of the town. Responsible for creating animal snares, skinning animals and capturing wild livestock. Tailor - The clothing expert of the town. Responsible for creating threads, weavings, clothing and bags. Barkeep - The food expert of the town. Responsible for brewing alcohol, cooking food and crafting consumables such as cigars. Priest - The religious expert of the town. Responsible for crafting charm necklaces, building shrines and gaining town favor from the gods. Shepherd - The animal expert of the town. Responsible for milking goats and cows, sheering sheep and tending to animals in general. Specifics NPCs - Villages may be populated by non-player characters who will act similarly to players. They will automatically build up their villages, carry out conversations, form relationships and more. Lineage - All characters except for those at the start of a new game will be born into the world by another villager, starting in the womb. Age - After birth, villagers go through the stages of being a baby, a child and finally an adult, and will later suffer old age and die. Death - There are many ways to die. Starvation, dehydration, combat, old age, but death might not be the end. Upon death, you enter the spirit realm as a ghost before being able to be reborn. Farming - By utilizing soil, seeds and water, villagers can regrow most of what grows naturally. Night - Villages are likely to be attacked during the night as it gets harder to see. Keep near fires during this time to avoid ambush. Traits - Various traits such as laziness, bravery, etc will impact villager behavior, relationships, abilities and more. Genetics - Newborn villagers will inherit most of their traits from their maker. Traits such as hair, eye and skin color. But also traits such as bravery, laziness and more. Professions - There will be many specific roles to fill in a village, such as leader, blacksmith, carpenter, stone mason, priest, barkeep, tailor, hunter and farmer. Each playing a vital role in progressing the village and keeping it from destruction. Lead - Players may choose to leave their current village to form their own, perhaps even a rival village. Conversation - If you address an NPC villager by name, they'll stop to talk to you. They'll answer questions such as where is town, take orders such as get food, and much more. Relationships - Whenever a villager interacts with another, they'll remember it and it will impact their overall relationship. This will lead to creating allies, enemies, courtships and more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/940020/header.jpg?t=1611198916",
    "Price": 4.99,
    "Developers": "Jeck",
    "Publishers": "Jeck",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/940020/ss_934eae7ff621099d3ce681d2b01bf0f8370e49db.1920x1080.jpg?t=1611198916,https://cdn.akamai.steamstatic.com/steam/apps/940020/ss_79c745d77a32dffc6fd677b78ee3d128e22d9d84.1920x1080.jpg?t=1611198916,https://cdn.akamai.steamstatic.com/steam/apps/940020/ss_7d374a1203e313d1d033cd50fa26c9c80cd94564.1920x1080.jpg?t=1611198916,https://cdn.akamai.steamstatic.com/steam/apps/940020/ss_249e4e931ec9789532305e72fabf0b6c2de6628d.1920x1080.jpg?t=1611198916,https://cdn.akamai.steamstatic.com/steam/apps/940020/ss_4564df8f09d61557a8c2166919bf40fb8c840088.1920x1080.jpg?t=1611198916,https://cdn.akamai.steamstatic.com/steam/apps/940020/ss_4831162abf23b9ebc02abcff88232b280f18b8a0.1920x1080.jpg?t=1611198916,https://cdn.akamai.steamstatic.com/steam/apps/940020/ss_cc6b95746f3263d101661d422369298392e25308.1920x1080.jpg?t=1611198916,https://cdn.akamai.steamstatic.com/steam/apps/940020/ss_7868d40c61dd555113188cc5035bff260c24d071.1920x1080.jpg?t=1611198916",
    "Slug": "survive-together",
    "Meta Title": "Survive Together: Aug 24, 2020, Jeck and Full Overview",
    "Meta Description": "Looking for information on Survive Together? Check out the release date (Aug 24, 2020), developer insights from Jeck, and a complete game summary.",
    "Alt Text Image": "Official header image for Survive Together game - Steam 940020",
    "Canonical URL": "https://gusku.site/game/survive-together",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Survive Together\", \"description\": \"Looking for information on Survive Together? Check out the release date (Aug 24, 2020), developer insights from Jeck, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jeck\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jeck\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/940020/header.jpg?t=1611198916\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}