{
    "AppID": 1155660,
    "Name": "The Deed II",
    "Release date": "May 29, 2020",
    "About the game": "Continuing in the tradition of The Deed and the Dynasty expansion, The Deed II offers a brand new take on the unique challenge of getting away with murder. The Story So Far In 1925, Kenneth Miller found himself committed to a mental asylum. Far from enjoying a period of psychological recovery, however, he and the other patients were tortured and abused every night by a group of sadistic orderlies. Eight years later, during a trip to Paris, Miller is shocked when he recognises the very worst of those men - Frank Graceman - standing outside of a whorehouse. Is this unlikely meeting a mere coincidence, or some manner of twisted providence? In either case, he knows that he might never get a better opportunity to enact his revenge. Steeling his nerves, he follows the man inside ... La Fleur Rouge For one hundred and fifty years, Paris was famous for its extremely diverse, luxurious selection of brothels. There was something to match every taste in the city of love. La Fleur Rouge is of a darker sort - one that caters primarily to fantasies of a sadomasochistic nature. Little wonder, then, that the place is a favourite haunt of Frank Graceman. Inside its walls, you'll meet a varied collection of characters, each with their own story to tell. The Tools of Murder The latest installment in The Deed series will give you more options than ever when it comes to choosing the murder weapon. Blunt instruments, surgical tools, piano wire, and of course the age-old favourite of the discreet assassin: poison. False Leads The Deed II features ten NPCs, more than in any previous scenario, which means there are even more victims to entrap in your nefarious plot! First you'll need to find the right piece of evidence which will suggest they had a strong motive for murdering Frank Graceman. Which of them, if any, will take the blame for your vengeful deed? Time Waits for No One Unlike in the previous games, where time would move forward according to the actions of the player, the minutes will now pass in a more natural way and an on-screen clock will help you to keep track of the time. One benefit of the natural passage of time is that certain NPCs will now move around according to their own schedules. This includes your intended target, so you will need to pick the perfect moment to commit the murder! An Inspector Calls When the deed is done, you must match your wits against the best detective in Paris. Can you convince him of your innocence, or even frame an innocent person? What will be your ultimate fate? In The Deed II there are more possible endings than ever before, some of which may be quite surprising ...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1155660/header.jpg?t=1631959417",
    "Price": 1.99,
    "Developers": "Pilgrim Adventures",
    "Publishers": "GrabTheGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1155660/ss_2764263d2b92c835693a11a36c962a8ab7f51a10.1920x1080.jpg?t=1631959417,https://cdn.akamai.steamstatic.com/steam/apps/1155660/ss_c54f5d14a45fae4083b8c43ff5a8673449b37c1d.1920x1080.jpg?t=1631959417,https://cdn.akamai.steamstatic.com/steam/apps/1155660/ss_33b5b4668e951b21028802618baa3c5b4f39dd58.1920x1080.jpg?t=1631959417,https://cdn.akamai.steamstatic.com/steam/apps/1155660/ss_134b32d160f09d48a5ad11d954e38d24015b107b.1920x1080.jpg?t=1631959417,https://cdn.akamai.steamstatic.com/steam/apps/1155660/ss_54209a292f15fdccf1b3dc38f949618908263cfc.1920x1080.jpg?t=1631959417",
    "Slug": "the-deed-ii",
    "Meta Title": "The Deed II: May 29, 2020, Pilgrim Adventures and Full Ov...",
    "Meta Description": "Looking for information on The Deed II? Check out the release date (May 29, 2020), developer insights from Pilgrim Adventures, and a complete game summary.",
    "Alt Text Image": "Official header image for The Deed II game - Steam 1155660",
    "Canonical URL": "https://gusku.site/game/the-deed-ii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Deed II\", \"description\": \"Looking for information on The Deed II? Check out the release date (May 29, 2020), developer insights from Pilgrim Adventures, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pilgrim Adventures\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GrabTheGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1155660/header.jpg?t=1631959417\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}