{
    "AppID": 1015650,
    "Name": "The Virtual Reality Museum of Immersive Experiences",
    "Release date": "Feb 20, 2019",
    "About the game": "The (Virtual) Reality Museum of Immersive Experiences is a very special kind of museum. It exhibits projects originally designed for large-scale immersive environments in a simulation that is true to the physical manifestation of these systems.These systems include 360 degree panoramic and hemispherical projection screens, stereoscopic 3D multi-view installations and a number of spatial and experimental video installations. Situated in a large derelict warehouse, the 3D museum is freely navigable and the many exhibits can be explored interactively. A wide variety of content is accessible, ranging from the arts to research project outcomes. There are even demonstrations of VR projects within this virtual museum. Features: works on HTC Vive, Oculus Rift and Windows Mixed Reality headsets 18 immersive systems and platforms 34 different projects 18 projects in stereoscopic 3D 1:40 h duration of his definition video content 2000 sqm exhibition space detailed information and catalogue pages for each project and platform (internet connection required) capture photos of your experience intuitive VR UI please note, some featured projects are represented as trailers or excerpts. More info, visit -immersion/ Link to games Key page -virtual-reality-museum-of-immersive-experiences/ . Immersive display and interaction environments and systems have been utilised in simulation, visualisation, entertainment, the arts and museological context for a long time before VR made its resurgence only a few years back. Applications and experiences created for a specific physical immersive platform rely on the complex and costly technical infrastructure they were originally designed for. Descriptions and video documentation only go so far in illustrating an immersive experience. The embodied aspect, the emotional engagement and the dimensional extend, central to immersion, is mostly lost in translation. The idea behind this project is to provide a framework to showcase and for the conservation and preservation of immersive experiences and architectures outside specialised facilities and labs. This simulation gives a good sense of how an immersive experiences functions in regards to scale, field-of-view, peripheral vision, audience viewing position and perspective. It is able to preserve what an experience felt like. Acknowledgements Systems: EPICylinder; Design: S. Kenderdine, J. Shaw; UNSW Expanded Perception and Interaction Centre. AVIE Advanced Visualisation and Interaction Environment and AVIE-SC; Design: J. Shaw with D. Del Favero, A. Harjono, V. Kuchelmeister, M. McGinity; UNSW iCinema Centre for Interactive Cinema Research. RE-ACTOR; Design: S. Kenderdine, J. Shaw with P. Bourke. iDome; Design: P. Bourke, V. Kuchelmeister, J. Shaw; UNSW iCinema. Turntable/Placeworld; Design: J. Shaw, adapted as Turntable by V. Kuchelmeister. ZKM Karlsruhe / UNSW Art &amp; Design. Panorama Screen; Design: J. Shaw with B. Lintermann; ZKM Centre for Art and Media Karlsruhe. Applications : 360 degree video panoramas (2014) in AVIE; V. Kuchelmeister. Produced UNSW iCinema Centre. Amnesia Atlas (2014) in AVIE-SC; Volker Kuchelmeister, Jill Bennett. Produced UNSW NIEA. Amnesia Atlas VR (2014) in VR; Volker Kuchelmeister, Jill Bennett .Produced UNSW NIEA. Back O' Bourke (2009) in iDome; V. Kuchelmeister. Produced UNSW iCinema Centre. Boatride (2008) in iDome; V. Kuchelmeister. Produced UNSW iCinema Centre. City Jam (2007) in AVIE; V. Kuchelmeister. Produced UNSW iCinema Centre. Conversations @ the Studio (2005) in iDome; V. Kuchelmeister, J. Shaw, D. Del Favero, N. Brown, N. Papastergiadis, S. McQuire, A. Arthurs, S. Kenderdine, K. Sumption, G. Cochrane. Produced UNSW iCinema Centre. Deconstructing Double District I. Volumetric Video (2008) in Stereoscopic 3D Projection screen; V. Kuchelmeister. Performer: S.Teshigawara, R.Sato. Deconstructing Double District II. Slitscan visulaisation. (2010) in Speculative stereoscopic 3D curved screen; V. Kuchelmeister. Performer: S.Teshigawara, R.Sato. Double District (2008) in ReActor; S.Teshigawra with V.Kuchelmeister. Performer: S.Teshigawara, R.Sato. Produced Epidemic, UNSW iCinema Centre. Fragmentation (2011) in ReActor; R. Lepage. Adaptation, by R. Castelli and V. Kuchelmeister. Produced Epidemic, UNSW iCinema Centre. Hong Kong Skydrive (2011) in Stereoscopic 3D Projection screen; V. Kuchelmeister. Juxtaposition (2011) in AVIE-SC; V. Kuchelmeister. Juxtaposition (2011) in Turntable; V. Kuchelmeister. Lost Memories (2017) in Stereoscopic 3D Projection screen; V. Kuchelmeister. Monsoon (2012) in AVIE; V. Kuchelmeister. Produced UNSW iCinema Centre. Naguar India 360 (2007) in iDome; S. Kenderdine, J. Shaw, V. Kuchelmeister. Panoramic Navigator (1997) in Interactive visitor information system; J.Shaw, V.Kuchelmeister. Produced ZKM Karlsruhe. ParraGirls (2017) in EPICylinder; A.Davies, B.Djuric, L.Hibberd, V. Kuchelmeister, J.McNally. Co-produced by Jill Bennett and Anxiety Festival. ParraGirls VR (2017) in VR; A.Davies, B.Djuric, L.Hibberd, V. Kuchelmeister, J.McNally. Co-produced by Jill Bennett and Anxiety Festival. Rajasthan 360 (2007) in DomeLab; V. Kuchelmeister with S. Kenderdine and J. Shaw. ReActor Service (2008) in ReActor; V. Kuchelmeister. Spherecam (2004) in Spherecam; V.Kuchelmeister, J.Shaw, D. Del Favero. Produced UNSW iCinema Centre. Syncrotron 360 (2008) in iDome; C. Henschke, V. Kuchelmeister. There is Still Time . . Brother (2008) in AVIE; The Wooster Group, commissioned and produced by EMPAC, the Experimental Media and Performing Arts Center at Rensselaer Polytechnic Institute (USA). Topography of the Unseen (2017) in Stereoscopic 3D Projection screen; V. Kuchelmeister. Transmutation (2012) in Stereoscopic 3D Projection screen; V.Kuchelmeister. Veloscape (2014) in Interactive installation. Projection screen and bicycle; V.Kuchelmeister, L.Fisher, J.Bennett. Produced UNSW NIEA. WaterVapour (2011) in AVIE-SC; V.Kuchelmeister. Produced UNSW iCinema Centre. Zeitraum (2013) in Custom stereoscopic 3D curved projection screen; V.Kuchelmeister. Zeitraum I (2012) in AVIE-SC; V. Kuchelmeister. UNSW Art and Design. Zeitraum II (2012) in AVIE-SC; V. Kuchelmeister.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1015650/header.jpg?t=1602810880",
    "Price": 0.0,
    "Developers": "Volker Kuchelmeister",
    "Publishers": "http://kuchelmeister.net",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1015650/ss_82b2b7e002be7674d236fd55aea497f76ffe8f12.1920x1080.jpg?t=1602810880,https://cdn.akamai.steamstatic.com/steam/apps/1015650/ss_2faff6155834e88f6eaa0ef88ee39bb4cd18fbe0.1920x1080.jpg?t=1602810880,https://cdn.akamai.steamstatic.com/steam/apps/1015650/ss_afa6139d5c1bf1617149bb832fc6c8d179e6fd55.1920x1080.jpg?t=1602810880,https://cdn.akamai.steamstatic.com/steam/apps/1015650/ss_6e2d31489d7d69598fcfb07fd0715669fe40b40d.1920x1080.jpg?t=1602810880,https://cdn.akamai.steamstatic.com/steam/apps/1015650/ss_3e9176df21fbf0d77b03dfdc5395ef42eb949de7.1920x1080.jpg?t=1602810880,https://cdn.akamai.steamstatic.com/steam/apps/1015650/ss_2aeac4321221d253f21db3e7e126e3a883e6e99f.1920x1080.jpg?t=1602810880,https://cdn.akamai.steamstatic.com/steam/apps/1015650/ss_5cab9119d0bf94196f1ca2d0267d4fb4da0ae9c1.1920x1080.jpg?t=1602810880,https://cdn.akamai.steamstatic.com/steam/apps/1015650/ss_3dbd4de8ffdee9e45dc0c41b1e05ddfbdee9adc0.1920x1080.jpg?t=1602810880,https://cdn.akamai.steamstatic.com/steam/apps/1015650/ss_81c691fe0ca128af7a9a6ada7a3fb9ed706998cf.1920x1080.jpg?t=1602810880",
    "Slug": "the-virtual-reality-museum-of-immersive-experiences",
    "Meta Title": "The Virtual Reality Museum of Immersive Experiences: Feb ...",
    "Meta Description": "Looking for information on The Virtual Reality Museum of Immersive Experiences? Check out the release date (Feb 20, 2019), developer insights from Volke...",
    "Alt Text Image": "Official header image for The Virtual Reality Museum of Immersive Experiences game - Steam 1015650",
    "Canonical URL": "https://gusku.site/game/the-virtual-reality-museum-of-immersive-experiences",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Virtual Reality Museum of Immersive Experiences\", \"description\": \"Looking for information on The Virtual Reality Museum of Immersive Experiences? Check out the release date (Feb 20, 2019), developer insights from Volke...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 20, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Volker Kuchelmeister\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"http://kuchelmeister.net\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1015650/header.jpg?t=1602810880\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}