{
    "AppID": 1745620,
    "Name": "The Oath of The Dark Magic Queen",
    "Release date": "Nov 5, 2021",
    "About the game": "Deep inside a forest, a voice calls out to the hero. It is there that he crosses paths with Omaylas, the Dark Magic Queen and one of the generals of the Demon Lord. Imprisoned in the forest, she offers to swear an oath to the hero in exchange for her freedom, even if it means facing execution in the capital. Is there a secret agenda to her actions? It is up to you, the hero to decide in this fantasy adventure visual novel from developer, DessertTheory! Story Five years ago, a group of heroes slayed the Demon Lord who had been terrorizing the land. While some semblance of peace was won, it was not without great sacrifice. And even with the Demon Lord defeated, a number of the demon generals that served under him managed to escape with some even still causing havoc. In order to bring true peace to the people of the war-torn continent, adventurers traveled the land to take down the remaining demon generals. Then one day, the hero receives word from the adventurers' guild about an enormous magic power emanating from a remote forest. While investigating the forest, a mysterious female voice calls out to the hero. 'We might not have met before, but you should have heard rumors about me, no?' Standing before the hero, was a beautiful woman, with flowing red hair. More than that, the woman who stood before him was Omaylas, Dark Magic Queen and one of the demon generals of the Demon Lord! Shackled by magical powers, she tells the hero that she was imprisoned in the forest for disobeying the Demon Lord and not joining the fight against the hero. While the very idea confounds the hero, he is further surprised when she tells him that she's willing to swear an oath to the hero, in order to free her from this magical prison. She is even willing to be taken to the capital to be executed for even that is a fair price versus being locked away forever by the magical forces that bind her. While the hero does not trust Omaylas, his code of honor prevents him from leaving her there. But he is suddenly filled with confusion and doubt. Somewhere in his hazy memories, an unfamiliar female appears before him... What happened between these supposed rivals? Is there more to this demoness than what the rumors say? Characters Features First title developed by indie studio, DessertTheory Multiple endings Visual novel set in a fantasy world setting English and Traditional Chinese language options",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1745620/header.jpg?t=1636138965",
    "Price": 4.99,
    "Developers": "DessertTheory",
    "Publishers": "Sekai Project",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1745620/ss_092b05ce888faa4329ac878cc522500f923a5a3f.1920x1080.jpg?t=1636138965,https://cdn.akamai.steamstatic.com/steam/apps/1745620/ss_61504435212e8bf778a493db749095519fb833c4.1920x1080.jpg?t=1636138965,https://cdn.akamai.steamstatic.com/steam/apps/1745620/ss_2c009804139dbd920f2ac1ddaf7d36ed3f43a512.1920x1080.jpg?t=1636138965,https://cdn.akamai.steamstatic.com/steam/apps/1745620/ss_25635b204c19860c2280a83cd34892bb897ac333.1920x1080.jpg?t=1636138965,https://cdn.akamai.steamstatic.com/steam/apps/1745620/ss_a5bdaf4aa688e519b7e81e421fcc3e22ae71cee4.1920x1080.jpg?t=1636138965",
    "Slug": "the-oath-of-the-dark-magic-queen",
    "Meta Title": "The Oath of The Dark Magic Queen: Nov 5, 2021, DessertThe...",
    "Meta Description": "Looking for information on The Oath of The Dark Magic Queen? Check out the release date (Nov 5, 2021), developer insights from DessertTheory, and a comp...",
    "Alt Text Image": "Official header image for The Oath of The Dark Magic Queen game - Steam 1745620",
    "Canonical URL": "https://gusku.site/game/the-oath-of-the-dark-magic-queen",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Oath of The Dark Magic Queen\", \"description\": \"Looking for information on The Oath of The Dark Magic Queen? Check out the release date (Nov 5, 2021), developer insights from DessertTheory, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"DessertTheory\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sekai Project\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1745620/header.jpg?t=1636138965\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}