{
    "AppID": 2085550,
    "Name": "Truck Simulator in City",
    "Release date": "Jul 29, 2022",
    "About the game": "Welcome to the Arcade Truck Simulation game, which offers a brand new gameplay experience. In this new generation Truck game, where we offer a specially designed player and user experience, we offer you a new gaming experience by blending Arcade and Simulation game genres. Sometimes you will try to complete your task on the inner city streets, on the top of the next mountain, on difficult winding roads and you will get the Dorse to its destination. You will feel how troublesome and difficult it is to be a truck driver. It's easy to drive a Truck for hours on long empty highways, and try driving a Truck in the city. In the huge big city, you have to transport the necessary urgent deliveries. You have to pick up the trailers waiting for delivery all over the city and transport them to the destination. In this game, which we provide with a realistic feeling, you will understand that it is not easy to do this, how difficult this job is. Let's talk about the features and content of the game. I tried to be the best in Truck Simulation games. We have brought you a full Truck Simulator game with HD graphics, Truck Stunt Parkour game and Truck Parking game. First of all, your main task is to be the only truck driver in the city. You have to tie the trailers waiting to be delivered in the city to the back of the truck and deliver them all to the companies we have made an agreement with. While doing this, you should be careful not to damage the truck and the heavy load you are carrying. You should take the full trailer that you will buy from the industry or the factory to the targeted place in the best way. Also, you need to attach your truck to the trailer nicely. It may seem like a game of plugging the Trailer Tractor, but it's not that easy at all. Just attach your trailer to the truck, take your carrier and start your mission. If all this work and driving has made you tired, then it's time to have some fun. Show off your skills on Truck Stunt tracks consisting of 15 different designs, make your best show and reach the finish line by completing the Fun Truck Track. Special Ramps that you can jump on with the Truck Carrier, obstacles and huge animated tracks are waiting for you in this game. It's time to try your driving skills. Let's see how well you control the vehicle you drive with 10 Truck Parking Game modes, each of which is more difficult than the other. You must be able to park the truck so that you can do your main task correctly. Truck Parking is not easy, test your skills in this game. Park your Truck Truck or Transporter on a trailer. If we need to summarize some features of the game. - 2000 different routes and missions. - 15 different fun Truck Stunt and Fun parkour maps. - 10 different Truck parking maps. - It's a huge city. - Support for 25 different languages. - Trailer Transport and Trailer delivery function - Free Roam function. - Detailed interior design and 5 different camera angles. - Mini-Map and Radar system. - Traffic system.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2085550/header.jpg?t=1659230522",
    "Price": 7.19,
    "Developers": "Soner Çakır",
    "Publishers": "Soner Çakır",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2085550/ss_dc4837480e560f11cf833ccc01aff6d64cb6e207.1920x1080.jpg?t=1659230522,https://cdn.akamai.steamstatic.com/steam/apps/2085550/ss_7aec4f4c01de4e2d4e47d1e15f116913429c20ff.1920x1080.jpg?t=1659230522,https://cdn.akamai.steamstatic.com/steam/apps/2085550/ss_724c55f30a924e2d5d37e3348b3f599ffc76846c.1920x1080.jpg?t=1659230522,https://cdn.akamai.steamstatic.com/steam/apps/2085550/ss_58d246691df5663a050ea198728a45f06920785b.1920x1080.jpg?t=1659230522,https://cdn.akamai.steamstatic.com/steam/apps/2085550/ss_965d3d32c2552427ac90d13d2de96b9b645918df.1920x1080.jpg?t=1659230522,https://cdn.akamai.steamstatic.com/steam/apps/2085550/ss_117fd6c3d76a172aaf6cb3d8d47309a32aa1b5f5.1920x1080.jpg?t=1659230522,https://cdn.akamai.steamstatic.com/steam/apps/2085550/ss_4f528650ca687db9b6f34cb7f14e172533309e63.1920x1080.jpg?t=1659230522,https://cdn.akamai.steamstatic.com/steam/apps/2085550/ss_a06f5dc55eb0720087f4bf8af1f96ddb4e78aee2.1920x1080.jpg?t=1659230522,https://cdn.akamai.steamstatic.com/steam/apps/2085550/ss_99cc054fd547afb0e9aa4d59cc9ff9e309cc936b.1920x1080.jpg?t=1659230522,https://cdn.akamai.steamstatic.com/steam/apps/2085550/ss_58fbc39e78695f942b966f50d9ea4ebd3528d0e8.1920x1080.jpg?t=1659230522,https://cdn.akamai.steamstatic.com/steam/apps/2085550/ss_fd1289e08b762e08cecb9023fad738a22c7a2f6d.1920x1080.jpg?t=1659230522,https://cdn.akamai.steamstatic.com/steam/apps/2085550/ss_2647c9b004f22d42daa808689957a257c5e0007e.1920x1080.jpg?t=1659230522,https://cdn.akamai.steamstatic.com/steam/apps/2085550/ss_6a4b763219918146fb39c71827710ffec27e2875.1920x1080.jpg?t=1659230522",
    "Slug": "truck-simulator-in-city",
    "Meta Title": "Truck Simulator in City: Jul 29, 2022, Soner Çakır and Fu...",
    "Meta Description": "Looking for information on Truck Simulator in City? Check out the release date (Jul 29, 2022), developer insights from Soner Çakır, and a complete game ...",
    "Alt Text Image": "Official header image for Truck Simulator in City game - Steam 2085550",
    "Canonical URL": "https://gusku.site/game/truck-simulator-in-city",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Truck Simulator in City\", \"description\": \"Looking for information on Truck Simulator in City? Check out the release date (Jul 29, 2022), developer insights from Soner \\u00c7ak\\u0131r, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Soner \\u00c7ak\\u0131r\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Soner \\u00c7ak\\u0131r\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2085550/header.jpg?t=1659230522\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}