{
    "AppID": 1220160,
    "Name": "Virtual Race Car Engineer 2020",
    "Release date": "Jan 24, 2020",
    "About the game": "Intermediate level tuning software for racers You can come up with your own baseline setup but are still slower than most? Don't know what to do to gain that extra speed to compete for podium spots? The Virtual Race Car Engineer is for you. VRCE fine tunes your existing baseline setup to get the most out of the car… fast. Offering whole-lap and corner-specific advice, VRCE will get the very best out of your setup. In the process, the driver tailors the setup to his individual needs and feel. The end result is a comfortable, reliable, and fast race setup ready to challenge for top positions. Choose Your Session Testing - Enter your results from a test run, report your handling impression, and the software recommends setup changes to cure your condition in the Lap Wizard. Then, using the Corner Wizard, focus on a specific corner to even further tune your setup to maximize speed through individual corners. Qualifying - Virtual Race Car Engineer now provides additional advice for single-lap or timed session qualifying setups. Qualifying higher up the grid and avoid the turn-1 wrecks. Race day - Finally, on race-day use the Race Session and Lap Wizard to help you deal with any changes to your setup that may arise due to weather or variable track conditions. Virtual Race Car Engineer offers pit-lane-only solutions in Race Session mode. New In Virtual Race Car Engineer 2020: New advice format! Virtual Race Car Engineer gives you the choice between the standard text based explanation for each setup change or the new – simpler – UP or DOWN arrow for each chassis subject Qualify higher! With the new qualifying session advice, you can take your trusted setup and make it faster just for the qualifying session. Don’t forget to revert back for the race though! Improved Lap Wizard tool that steps the user through the process Sim selections customize setup subjects for each of your favorite games. Fuel Calculator to determine full-race and race-remaining fuel &amp; pit stop needs New car types! Virtual Race Car Engineer now has Sprint-type and Kart default car advice, each with different setup advice based on their specific chassis options. Lap times can now be entered in M:SS.000 format More advice! Now with even more advice, including stagger for those Sprint and Outlaw cars Severity matters! Choose how severe the car’s condition and Virtual Race Car Engineer will provide the best solution(s) to fix the problem without over or under doing it. Tire Delta! The new adjustable tire delta allows you to tweak the formula for matching your setup’s tire temperatures, allowing you to fine tune the most important aspect of your setup more or less that day. More language options. Virtual Race Car Engineer allows you to create your own language translations with a simple text editor. Make your own to share with others. Free extras! Both the “Learn to setup your race car” eBook by Tim McArthur and the easy to use setup tuning flowcharts are included with Virtual Race Car Engineer 2020 Over time and use you will come to understand the effect of chassis changes as they’ve related directly to your own experiences, and with that knowledge become the master of your own setup. For easiest use, Virtual Race Car Engineer should be running on a second monitor, separate laptop or tablet. Virtual Race Car Engineer can be used with any realistic auto racing software that allows the users to adjust the car setup, including the following: Assetto Corsa, Automobilista, Codemasters F1 series, iRacing, Project Cars, RaceRoom, rFactor, rFactor 2, Stock Car Extreme, and more. Just a beginner? For beginning tuners I recommend the sister app to Virtual Race Car Engineer /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1220160/header.jpg?t=1622052818",
    "Price": 19.99,
    "Developers": "Tim McArthur",
    "Publishers": "Monkey Face Software LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1220160/ss_745af07beb67adb0c9710aad36b499be8ea7a673.1920x1080.jpg?t=1622052818,https://cdn.akamai.steamstatic.com/steam/apps/1220160/ss_2cd6a0538b729f7b8a752147f05de8ee0f375048.1920x1080.jpg?t=1622052818,https://cdn.akamai.steamstatic.com/steam/apps/1220160/ss_14e3e2b0985cb8087c2325943d8efbcd9facaed7.1920x1080.jpg?t=1622052818,https://cdn.akamai.steamstatic.com/steam/apps/1220160/ss_1c586af82fb5f66be226f786a6c5063255c47fff.1920x1080.jpg?t=1622052818,https://cdn.akamai.steamstatic.com/steam/apps/1220160/ss_468d81ac3b8dc99a2f5f8007e9950af50dc9d771.1920x1080.jpg?t=1622052818,https://cdn.akamai.steamstatic.com/steam/apps/1220160/ss_34b9cc920abe955e51cb5998b464eb6928ea3a86.1920x1080.jpg?t=1622052818",
    "Slug": "virtual-race-car-engineer-2020",
    "Meta Title": "Virtual Race Car Engineer 2020: Jan 24, 2020, Tim McArthu...",
    "Meta Description": "Looking for information on Virtual Race Car Engineer 2020? Check out the release date (Jan 24, 2020), developer insights from Tim McArthur, and a comple...",
    "Alt Text Image": "Official header image for Virtual Race Car Engineer 2020 game - Steam 1220160",
    "Canonical URL": "https://gusku.site/game/virtual-race-car-engineer-2020",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Virtual Race Car Engineer 2020\", \"description\": \"Looking for information on Virtual Race Car Engineer 2020? Check out the release date (Jan 24, 2020), developer insights from Tim McArthur, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tim McArthur\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Monkey Face Software LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1220160/header.jpg?t=1622052818\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}