{
    "AppID": 1002930,
    "Name": "War of Tanks: Blitzkrieg",
    "Release date": "Aug 13, 2019",
    "About the game": "The game is based on World War II tanks, such as the German Tiger, U.S. Sherman, Soviet T34/85 and the Chinese 59-D and many more. All tanks are modeled according to the real blueprint design to ensure an accurate historical experience with additional upgrades. In addition, the game also incorporates the mysterious chariots from the future world based on classic tanks. There are hundreds of tanks ready for your command and ready to go into war. [Famous Generals] The game gathers many well-known commanders of World War II, such as MacArthur, Zhukov, Gudrian, Rodsovsky and many more. The characters are lifelike and matched with tanks from their time with real unfolded stories of World War II. The achievements and tactical expertise of the famous generals in the history of World War II are perfectly displayed, such as the preference of Russian famous generals for summoning Katyusha chariots to assist them in the battlefield, and the common use of similar strategies such as summoning air strikes by virtuous generals, all of which are perfectly restored, so that players can really check up and enjoy fighting side by side with famous generals. [Realistic view from the sky] The overall performance, quality and contrast of light and shadow of 'War of Tanks: Blitskrieg' are exquisite. Together with the historical accuracy, realistic real-time combat mode and the stunning observation angle of the whole process gives you a thrilling war experience. [Rich variety of gameplay] The main line of the game is based on real World War II campaigns, such as the Dunkirk retreat, the Polish blitz and more. At the same time, it has added a rich line of training modes. Players can gain experience in the Western Line raids, the Kursk blood battles, Jedi counterattacks and more. Multi-threaded tank system, tank upgrade, debris collection, various important parts of the tank such as muzzle, crawler, sight glass, armor, engine, etc. can be upgraded and enhanced. During the battle, the player can beat the opponent through superb battle skills! [Conquer the World] The game also brings players an extremely interactive expedition system. Players can hoard grains, build bases, seize oil fields, expand their territory, and conquer the world with like-minded allies. From the corner of the woods to the entire continent, your tanks will level off everything that stands between them and glory. Follow Us on Facebook: War of Tanks : Blitzkrieg",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1002930/header.jpg?t=1616477940",
    "Price": 0.0,
    "Developers": "HQGames,HQ Games",
    "Publishers": "HQGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1002930/ss_9cb92412b8b34d5d8e9ab9b6b3f453e937095c90.1920x1080.jpg?t=1616477940,https://cdn.akamai.steamstatic.com/steam/apps/1002930/ss_20cea14185cd346e8c7daba9af2b3ea3da4f0480.1920x1080.jpg?t=1616477940,https://cdn.akamai.steamstatic.com/steam/apps/1002930/ss_55bb645e3e963ce69e24c40c6bd2482b5ce186fe.1920x1080.jpg?t=1616477940,https://cdn.akamai.steamstatic.com/steam/apps/1002930/ss_a035d220a53bdbb5862354710c763b20ed335544.1920x1080.jpg?t=1616477940,https://cdn.akamai.steamstatic.com/steam/apps/1002930/ss_5ac55f3cc0fe287511d20a93852ed1ea822f352f.1920x1080.jpg?t=1616477940",
    "Slug": "war-of-tanks-blitzkrieg",
    "Meta Title": "War of Tanks: Blitzkrieg: Aug 13, 2019, HQGames,HQ Games ...",
    "Meta Description": "Looking for information on War of Tanks: Blitzkrieg? Check out the release date (Aug 13, 2019), developer insights from HQGames,HQ Games, and a complete...",
    "Alt Text Image": "Official header image for War of Tanks: Blitzkrieg game - Steam 1002930",
    "Canonical URL": "https://gusku.site/game/war-of-tanks-blitzkrieg",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"War of Tanks: Blitzkrieg\", \"description\": \"Looking for information on War of Tanks: Blitzkrieg? Check out the release date (Aug 13, 2019), developer insights from HQGames,HQ Games, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 13, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"HQGames,HQ Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HQGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1002930/header.jpg?t=1616477940\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}