{
    "AppID": 1295500,
    "Name": "Warhammer 40,000: Battlesector",
    "Release date": "Jul 22, 2021",
    "About the game": "Warhammer 40,000: Battlesector is a fast-paced turn-based strategy game set in the grimdark universe of the 41st Millennium. Pick your force, develop your army, field mighty heroes and fight for victory using superior strategy, awesome abilities, and devastating weaponry. Age of Crimson Dawn Experience an epic twenty mission single-player campaign that explores the aftermath of the Devasta-tion of Baal. Help Sergeant Carleon and his allies purge the Tyranid infestation on Baal Secundus, and preserve the honour of the noble Blood Angels. Skirmish Mode Fight across the surface of Baal on maps of your choosing in the Skirmish mode. Pick the faction you'll lead as well as the one you'll face. Completely customize your army list by selecting your units, heroes and their loadouts. It is available with three different types of Objective: Exterminatus, Conqueror and Strategic Command. Planetary Supremacy Mode Planetary Supremacy is a conquest-style skirmish campaign, introduced in a free update as part of our ever expanding plan for Battlesector, in which you, the player, decide the outcome. Take command of your favourite faction and conquer the planet in a series of procedurally generated skirmish battles. To achieve victory, capture more tiles, acquire strategic resources and expand your army. Then, bring destruction to your enemies in Skirmish battles. Forge Your Armies Command iconic units like the Sanguinary Priest, the Librarian Dreadnought, and the Hive Tyrant to annihilate your foes. Use over 60 abilities and 50 weapons to orchestrate your opponent’s bloody de-mise. Build Momentum Each faction has a unique Momentum system that can result in a Surged unit. Units that Surge are able to string together superhuman chains of actions, or use the opportunity to further upgrade their abili-ties. Call In Air Support Use Command Points to call in faction-specific air support abilities. The Blood Angels Stormraven can obliterate xenos with a missile barrage, or deep strike a unit of veteran Assault Marines behind enemy lines. Meanwhile, the Tyranid Harpy can devastate the enemy defenses with its Sonic Screech, or scat-ter the battlefield with its deadly Spore Mines. Face Your Friends On The Battlefield With live and asynchronous multiplayer, and hotseat modes available, there’s no excuse not to take your friends to war.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1295500/header.jpg?t=1658936742",
    "Price": 25.99,
    "Developers": "Black Lab Games",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1295500/ss_c221d5d1759ba0778bf334145e3d9cf805057657.1920x1080.jpg?t=1658936742,https://cdn.akamai.steamstatic.com/steam/apps/1295500/ss_fd387cf6a17010d7c24a189a2187e41e5723986a.1920x1080.jpg?t=1658936742,https://cdn.akamai.steamstatic.com/steam/apps/1295500/ss_fbd361c8f27929d2e1d6fcb3a8846e62b35f2fb8.1920x1080.jpg?t=1658936742,https://cdn.akamai.steamstatic.com/steam/apps/1295500/ss_6ec0c0480a913deadfdbdd26bae629bc931a4464.1920x1080.jpg?t=1658936742,https://cdn.akamai.steamstatic.com/steam/apps/1295500/ss_d56f7d6a2d401f22ff7f46df663f5907a5b22730.1920x1080.jpg?t=1658936742,https://cdn.akamai.steamstatic.com/steam/apps/1295500/ss_7f218ebf05c06de838bba4c0347c7696f1eae808.1920x1080.jpg?t=1658936742",
    "Slug": "warhammer-40-000-battlesector",
    "Meta Title": "Warhammer 40,000: Battlesector: Jul 22, 2021, Black Lab G...",
    "Meta Description": "Looking for information on Warhammer 40,000: Battlesector? Check out the release date (Jul 22, 2021), developer insights from Black Lab Games, and a com...",
    "Alt Text Image": "Official header image for Warhammer 40,000: Battlesector game - Steam 1295500",
    "Canonical URL": "https://gusku.site/game/warhammer-40-000-battlesector",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Warhammer 40,000: Battlesector\", \"description\": \"Looking for information on Warhammer 40,000: Battlesector? Check out the release date (Jul 22, 2021), developer insights from Black Lab Games, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Black Lab Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1295500/header.jpg?t=1658936742\", \"offers\": {\"@type\": \"Offer\", \"price\": 25.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}