{
    "AppID": 1546500,
    "Name": "Warplanes: WW1 Fighters",
    "Release date": "Mar 4, 2021",
    "About the game": "Become a pilot! Immerse in WW1 aerial combat like never before in a captivating VR experience. Be a pilot during the Great War in Warplanes: WW1 Fighters. No matter whether you prefer arcade games or flight simulators – a variety of options will let you adjust the game to your preferences. EXPERIENCE WW1 IN VR! Amazing performance and graphics – game fully optimized for even low-end computers. Fully customizable flight models – from arcade to simulation based on aerodynamics. Additional options affecting gameplay – enabling manual takeoffs and landing, aggressive AI, disabling of HUD and more. Two campaigns with hundreds of missions set in diverse locations, seasons and time of day. Intuitive and immersive controls designed especially for VR. 18 playable planes – from light scout planes to bombers. Single-player, cross-platform PvP and Co-op multiplayer modes. Steering designed to fully utilize tracked motion controllers. Grab the yoke and feel how smoothly you can control the machine. Enjoy a full hands-on experience – punch the switch for faster machine gun reloading, or take the flare pistol in your hand and shoot barrage balloons, or take a bomb and toss it onto ground targets. Detailed cockpits and plane models will help you immerse and feel like a pioneer of aviation like never before. Choose a mode adjusted to your preferences and skill. From light and relaxing Leisure mode, through Realistic, where the flight model is based on aerodynamics. If you are looking for a challenge, try a Real War where all secondary forces and effects are calculated, you have to manually take off and land, planes get realistic damages affecting flight, A.I. is more cunning and aggressive and all HUD elements are disabled. Two campaigns for Central Powers and Triple Entente let you experience all major fronts of World War I – you’ll fly above diverse landscapes that participated in the conflict in various types of missions. Face-off against enemy fighters and bombers, bomb strategic ground targets, destroy naval forces, protect your base and cities from the bombing raids. Build a squadron, switch between planes to utilize maximum potential of each machine – fast and well armored Junkers D.II is a perfect choice to fight bombers, while highly manoeuvrable Fokker Dr. I is designed for efficient dogfight. Airco DH.2 with its wide-open cockpit will guarantee a unique and immersive flight experience. Buy and upgrade your planes with in-game currency earned during missions. Your command will also reward you with medals – thanks to them you’ll be able to increase mission rewards, as well as manage your planes and crew more efficiently. Join multiplayer battles in Deathmatch, Team Deathmatch and Last Man Standing. Invite your friends to Co-op missions. Cross-platform support allows players around the globe to play with each other, no matter which platform they own.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1546500/header.jpg?t=1656511327",
    "Price": 19.99,
    "Developers": "Home Net Games",
    "Publishers": "Home Net Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1546500/ss_c8c8e0b7a73ed9a3cb27735c07277d9dc9fc56b8.1920x1080.jpg?t=1656511327,https://cdn.akamai.steamstatic.com/steam/apps/1546500/ss_91e55a5954240215c005f68b7bddef9b43c04aed.1920x1080.jpg?t=1656511327,https://cdn.akamai.steamstatic.com/steam/apps/1546500/ss_015a2338d0abb56805d50a8069189589a18bbb75.1920x1080.jpg?t=1656511327,https://cdn.akamai.steamstatic.com/steam/apps/1546500/ss_0a70000f955266862b95a793675a3a520a1a65ec.1920x1080.jpg?t=1656511327,https://cdn.akamai.steamstatic.com/steam/apps/1546500/ss_f8f8dc132eb5316c164e9ba02e25bb7ab994a2fa.1920x1080.jpg?t=1656511327,https://cdn.akamai.steamstatic.com/steam/apps/1546500/ss_e126f8e83249bfe80b63e52d00bfa71728dba0f9.1920x1080.jpg?t=1656511327,https://cdn.akamai.steamstatic.com/steam/apps/1546500/ss_ed8f313360a16ce83a2c015607075b183e4dbe33.1920x1080.jpg?t=1656511327,https://cdn.akamai.steamstatic.com/steam/apps/1546500/ss_26c4a2dafd1eea1f153a0c782147e1e66f354a02.1920x1080.jpg?t=1656511327,https://cdn.akamai.steamstatic.com/steam/apps/1546500/ss_811b38f94eb7e016d775d48b2f8d3ea83c4a488d.1920x1080.jpg?t=1656511327,https://cdn.akamai.steamstatic.com/steam/apps/1546500/ss_ae092a69b2c8f1652ee8daa5abd9ec58997300bd.1920x1080.jpg?t=1656511327,https://cdn.akamai.steamstatic.com/steam/apps/1546500/ss_8879394cf91f7347364022acbe0fc5e2d5ba9383.1920x1080.jpg?t=1656511327,https://cdn.akamai.steamstatic.com/steam/apps/1546500/ss_e76893326c54ab1ff3b25a7cecb93682926f45b9.1920x1080.jpg?t=1656511327",
    "Slug": "warplanes-ww1-fighters",
    "Meta Title": "Warplanes: WW1 Fighters: Mar 4, 2021, Home Net Games and ...",
    "Meta Description": "Looking for information on Warplanes: WW1 Fighters? Check out the release date (Mar 4, 2021), developer insights from Home Net Games, and a complete gam...",
    "Alt Text Image": "Official header image for Warplanes: WW1 Fighters game - Steam 1546500",
    "Canonical URL": "https://gusku.site/game/warplanes-ww1-fighters",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Warplanes: WW1 Fighters\", \"description\": \"Looking for information on Warplanes: WW1 Fighters? Check out the release date (Mar 4, 2021), developer insights from Home Net Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Home Net Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Home Net Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1546500/header.jpg?t=1656511327\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}