{
    "AppID": 1346720,
    "Name": "Wicked Games",
    "Release date": "Jul 27, 2022",
    "About the game": "The protagonist is Adan Kaider, a sinner who has ended up in Hell. After being in the place of punishment for three years, he became obsessed with one single thought: to get out of here as soon as possible. Finally, after a long wait and demanding work, he had the opportunity not just to gain freedom. Adan got his hands on a lucky ticket with a cover on it that states: 'Ticket to Paradise'. Unknowingly, the hero doomed himself to many trials, which will not only test his character, but also transform him beyond recognition. You’ll face many surprises, mentally trying decisions, various locations and dialogues with interesting characters. Also, you’ll see a large number of Hell representatives: sinners who are leading a wretched existence of disenfranchised slaves; demons who represent the local prissy elite, raising themselves above the rest; and forgiven, people who didn’t approve themselves during their mortal life and got a chance to do it here, in Hell. What we have (and what we plan to make): 1. Quests based on social interactions, with the mechanics of dialogues and decision-choices that determine not only the attitude of the characters towards you, but also the final ending. 2. Unique and radically different locations (both in ideas and ways of playing). 3. Various gameplay mechanics that diversify the gaming experience. 4. Authorial designed soundtracks. 5. Original voice acting in Russian. 6. A wide variety of characters you can (and should) interact with. 7. Deep universe with its own history and problems. 8. And,surely, a lot of humor! That will be free to download and play the game for the duration of the development process. Why? Due to the current situation in the international field (sanctions against Russia), we are not able to get funds from Steam directly. You can join our socail networks pages (all links are stated in the info and the community page).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1346720/header.jpg?t=1658914267",
    "Price": 0.0,
    "Developers": "SibCatTeam",
    "Publishers": "SibCatTeam",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1346720/ss_49311c7e28f2d4ae797e76b8407b1370cfb46722.1920x1080.jpg?t=1658914267,https://cdn.akamai.steamstatic.com/steam/apps/1346720/ss_360c46d2f6ee7ab8665bde6eb9f0d5af85f9b861.1920x1080.jpg?t=1658914267,https://cdn.akamai.steamstatic.com/steam/apps/1346720/ss_2f2411ea88de12f9656f66c60dc18bca488c0beb.1920x1080.jpg?t=1658914267,https://cdn.akamai.steamstatic.com/steam/apps/1346720/ss_db1121760e0d34e76e66664b75cbfb0cc657bb8e.1920x1080.jpg?t=1658914267,https://cdn.akamai.steamstatic.com/steam/apps/1346720/ss_0b2c459ee5140e4ceedbe86ef16cc400b93670d1.1920x1080.jpg?t=1658914267",
    "Slug": "wicked-games",
    "Meta Title": "Wicked Games: Jul 27, 2022, SibCatTeam and Full Overview",
    "Meta Description": "Looking for information on Wicked Games? Check out the release date (Jul 27, 2022), developer insights from SibCatTeam, and a complete game summary.",
    "Alt Text Image": "Official header image for Wicked Games game - Steam 1346720",
    "Canonical URL": "https://gusku.site/game/wicked-games",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wicked Games\", \"description\": \"Looking for information on Wicked Games? Check out the release date (Jul 27, 2022), developer insights from SibCatTeam, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"SibCatTeam\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SibCatTeam\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1346720/header.jpg?t=1658914267\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}