{
    "AppID": 2087360,
    "Name": "Wilderness Game Stalker VR: North America",
    "Release date": "Aug 5, 2022",
    "About the game": "Disclaimer This product was designed and intended for use with the Oculus Quest 2. Functionality with other VR headsets cannot be guaranteed. Stalk and hunt North America’s most iconic game species in virtual reality through woodland, prairie, and lakeside vistas. Approach as close as you dare to line up the perfect shot on a trophy buck, and experience the fear of becoming the hunted as dangerous predators turn the tables on unwary hunters. Utilize three distinct weapons with unique hunting styles as you aim from afar with a rifle, from close range with your shotgun, or make a precision strike with the bow! After a successful hunt, harvest your trophy and mount it in your trophy lodge with a variety of dynamic poses, capturing the tranquility or ferocity of a given creature. Horned and Antlered animals feature dynamic racks that ensure each hunt leads to a different prize. Will you find a small horned target, or a mighty trophy specimen? Even for creatures without such obvious display features, animals will also vary in size, giving fearsome predators a chance at becoming impressive collections to your lodge. Your targets include: American Bison The largest land mammal native to North America, in size alone this creature makes an excellent trophy, but this creature also has Dynamic Horn size as well, so hunters may wish to focus on getting not just large body size, but large horns as well! This species can be dangerous if provoked, so caution is advised. Bighorn Sheep A thick-bodied mountain sheep, with impressive winding horns. This species has Dynamic Horns, and hunters should focus not just on the length of the horn, but the curl as well. This creature does not present danger to the hunter, but care must be taken for good shot placement. Rocky Mountain Elk With elegant and iconic antlers, and being one of the world’s largest deer species, the elk is undoubtedly the crown jewel of many hunters’ trophy lodges, and fittingly has Dynamic Antlers as well. Elk naturally exist with a wide variety of body sizes, and hunters may wish to focus on trophies on both ends the spectrum. Moose The world’s largest deer species, and often considered the most dangerous of North America’s game animals, the moose is a challenging but incredibly rewarding prey species to tackle. Found alone or in pairs, the moose is more elusive than other game species, but can turn aggressive in an instant if threatened, making caution important when at close range. Fitting of a creature with impressive palmate antlers, this animal has Dynamic Antlers. Mule Deer One of the continent’s most widespread and commonly hunted species, don’t let that make this creature seem any less enticing. With Dynamic Antlers and a swift escape at the first sign of danger, this animal is best downed in a single shot even more so than your other hunting targets, for if it escapes you might never see it again. Feral Hog A nuisance throughout the country, hunting this animal is often seen as an ecological service. Crosses of escaped farm pigs with wild stock, or even simply loosed boars themselves, these animals breed a masse and dominate ecosystems they colonize. Despite this, they can make for impressive trophies with their Dynamic Tusks, and they come in a great variety of body sizes as well, ranging from smaller, natural sizes to monstrous creatures taking on their domestic proportions. Don’t be fooled, these animals can be dangerous when provoked, so make shot placement well. Grizzly Bear When it comes to ferocity and terror, few animals have the iconic American Grizzly Bear beat. Solitary by nature, the Grizzly can be trickier to approach than other animals, and when threatened becomes extremely aggressive. If not subdued quickly, this animal is very likely to down a would-be hunter. The ultimate trophy of a large individual can reach 9 feet or more when rearing up, making it a perfect addition to any hunter’s collection. Cougar One of the most widespread of the cat family, ranging from Canadian snowscapes, to temperate woodlands, down to arid desert and tropical rainforest, and even to the swamps of Florida, the accomplishments of this predator are clear to see. It may lack the size of the Grizzly, but more than makes up for it in stealth and speed. A deadly prey species, this animal will likely only give a single chance to take it down before it turns the hunter into the hunted. Most of these cats weigh under 100 pounds, but a true trophy can exceed 200, an excellent and formidable trophy.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2087360/header.jpg?t=1659702119",
    "Price": 8.09,
    "Developers": "VL Enterprises LLC",
    "Publishers": "VL Enterprises LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2087360/ss_7db30aef56ae85b579a21a96cc1d6e1cf0f2374f.1920x1080.jpg?t=1659702119,https://cdn.akamai.steamstatic.com/steam/apps/2087360/ss_5fb98bcfa78768e6c155eefc975d233b75b2c87b.1920x1080.jpg?t=1659702119,https://cdn.akamai.steamstatic.com/steam/apps/2087360/ss_e1dee809e37fdfb7e382fba3240b2bd1f0c479dd.1920x1080.jpg?t=1659702119,https://cdn.akamai.steamstatic.com/steam/apps/2087360/ss_272637c9e5b16c0cb87c9fa868c1e3cc85591f3c.1920x1080.jpg?t=1659702119,https://cdn.akamai.steamstatic.com/steam/apps/2087360/ss_404ea62a2e1d37aa060e62eb69ae0d69f2d40a2b.1920x1080.jpg?t=1659702119",
    "Slug": "wilderness-game-stalker-vr-north-america",
    "Meta Title": "Wilderness Game Stalker VR: North America: Aug 5, 2022, V...",
    "Meta Description": "Looking for information on Wilderness Game Stalker VR: North America? Check out the release date (Aug 5, 2022), developer insights from VL Enterprises L...",
    "Alt Text Image": "Official header image for Wilderness Game Stalker VR: North America game - Steam 2087360",
    "Canonical URL": "https://gusku.site/game/wilderness-game-stalker-vr-north-america",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wilderness Game Stalker VR: North America\", \"description\": \"Looking for information on Wilderness Game Stalker VR: North America? Check out the release date (Aug 5, 2022), developer insights from VL Enterprises L...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 5, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"VL Enterprises LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VL Enterprises LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2087360/header.jpg?t=1659702119\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.09, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}