{
    "AppID": 1274970,
    "Name": "ZEROED",
    "Release date": "Aug 8, 2021",
    "About the game": "This game plays WAY better with a controller. You can play on keyboard, but it's going to be hard to keep up with controller users! High-speed racing that keeps you off the walls ...because there are no walls! We built this in a way that would remove obstacles you might slam into and bring you to a stop. You're either going to be going fast or really fast. Quick tips: The more you rotate your ship, the slower you go. Move efficiently! Keep your energy bar high because the lower it is, the slower you go! Don't boost all your energy away! Use it in small amounts frequently to recover speed! Color &amp; combat Out-maneuvering your opponents is only half of the battle in this racer. Currently with 4 distinct weapons and plans for many more, you'll have plenty of options to ruin your opponent's day. Bright and colorful explosions will litter the track as players aim to reduce each other's energy, which reduces their top speed. Check out the tutorial in the 'Info' section. Given we did things so differently, there's going to be a lot for you to learn, but don't be discouraged! We include both text and video tutorials to try to get you up to speed as quickly as possible! Travel through varied surroundings Bright and natural scenery is what we hope separates us from most other high-speed racers. We've noticed the genre is saturated with dark, claustrophobic and mechanical surroundings, so we wanted to put a different spin on it! Check out our 4 dynamic landscapes: Frosinn Bring the heat to a frozen arctic sea and melt the competition. There are no Lion Seals on this ice sheet, but don’t worry, your opponents should be enough to look out for! Te Ora Get your hipster fighter on in luscious mountains and deciduous woodlands. We’re not here to tear down forests... We’re here to tear through them! Wawae If you like piña coladas, you’ll love love getting caught in your opponents' draft trails over these beaches. Turns out any paradise is a little less relaxing with enough explosives! Imara Don't forget to bring your canteen to these desert cliffs. It might be safer to fill it with jet fuel for backup instead of water, though! Modes Practice against CPU opponents! Online quick play against random players or privately with friends! ZeroHour, which is an online tournament every hour on the hour! See you in the air!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1274970/header.jpg?t=1648184690",
    "Price": 7.99,
    "Developers": "OAKgames",
    "Publishers": "OAKgames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1274970/ss_6f031563d92ed1721e998cf8bf99594c62c3151d.1920x1080.jpg?t=1648184690,https://cdn.akamai.steamstatic.com/steam/apps/1274970/ss_5e71ac3c7315f35be2aa8b0ed0e9dac58ba88271.1920x1080.jpg?t=1648184690,https://cdn.akamai.steamstatic.com/steam/apps/1274970/ss_945f2da92e1805b3b0dbdeed7bf42a2014d86508.1920x1080.jpg?t=1648184690,https://cdn.akamai.steamstatic.com/steam/apps/1274970/ss_1b06119353cb2bf346af56762433f12fed44165c.1920x1080.jpg?t=1648184690,https://cdn.akamai.steamstatic.com/steam/apps/1274970/ss_d175af0d74b9aadf4156197dcf9fc1723b47ec3b.1920x1080.jpg?t=1648184690,https://cdn.akamai.steamstatic.com/steam/apps/1274970/ss_1bfffaaf0287243c41ae4e1817e59750ef864b37.1920x1080.jpg?t=1648184690,https://cdn.akamai.steamstatic.com/steam/apps/1274970/ss_97f0caa872ace5a24cd8d70f18d9c97f254088e7.1920x1080.jpg?t=1648184690",
    "Slug": "zeroed",
    "Meta Title": "ZEROED: Aug 8, 2021, OAKgames and Full Overview",
    "Meta Description": "Looking for information on ZEROED? Check out the release date (Aug 8, 2021), developer insights from OAKgames, and a complete game summary.",
    "Alt Text Image": "Official header image for ZEROED game - Steam 1274970",
    "Canonical URL": "https://gusku.site/game/zeroed",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ZEROED\", \"description\": \"Looking for information on ZEROED? Check out the release date (Aug 8, 2021), developer insights from OAKgames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 8, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"OAKgames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OAKgames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1274970/header.jpg?t=1648184690\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}