{
    "AppID": 1489410,
    "Name": "Alice Escaped!",
    "Release date": "Jan 27, 2023",
    "About the game": "■ About Alice Escaped! is an exploratory 2D action Metroidvania. Follow the adventures of Usada and Kotora, who have wandered into a strange wonderland of grimoires and must chase after a mysterious girl named Alice in order to return to their own world. What awaits them in this mysterious world are strange yet familiar characters, such as Cheshire Cat, Mad Hatter, and Humpty Dumpty. Are they friends or foes? And why does the white rabbit Usamura have a zipper on his back? And who exactly is this enigmatic girl hiding Alice in the deepest part of the world? This is where you've probably realized that this game has multiple endings. There are numerous major choices to be made, a story that repeats itself, and the true goals of the characters to be revealed. An adventure the likes of which you've never experienced before is about to begin! ■ Battle Action One of the core points of this game is its stylish, tag-team battle system! Swing Usada’s giant hammer to pulverize your enemies with powerful melee attacks, or use Kotora’s submachine gun and bombs to take out enemies from a distance. Switch between the two to chain impressive combos! Chaining combos will increase their attack power, and make it easier to quickly defeat your many oncoming enemies. Taking out enemies builds up your Chance Gauge, which can be used to perform supporting attacks and devastating ultimate attacks. (Feature not included in the demo.) The intensity builds in boss fights: whittle down their Shield Gauge to break their shields, letting you unleash a flurry of attacks. But beware: they've got a variety of powerful attacks to hit you back with! ■ Our heroines learn and grow When you collect the skill crystals that drop all over the world, you can improve your characters' skills. You can improve their weapons, which will then unlock unique skills. Or you can focus on their stats and movement, and even pick up skills to help them convince others to help them. If you find yourself stuck on a difficult boss, then try taking some time away from the main path to help our heroes grow stronger. Scattered about here and there in the world are death matches (areas where you can't proceed without defeating all of the enemies there), and if you can finish them with a high-count combo, or without taking any damage, you can earn skill crystal fragments. In addition, out in the world you can also find Heart Crystals, which increase your heroes' maximum health, in addition to other key items that they'll need on their adventure. Based on what you find, you might find that they're protected by powerful traps, just like the treasure you'd find deep inside of a cave. Go explore any way you wish in the world of Alice in Wonderland! ■ Characters 〇 Usamura-san A strange, white rabbit that seems to be really busy for some reason. It looks like there's a zipper on his back...? He's also looking for Alice. 〇 Cheshire Cat A cryptic feline who appears before Usada and Kotora and enjoys testing her skills against them. Perhaps she has another goal aside from just getting in their way...? 〇 Mad Hatter A dignified lady who holds a tea party practically every day. Beloved by the denizens of Wonderland. It looks like she lost something important recently. 〇 Alice The person that Usada, Kotora, and Usamura-san are searching for. Just where in the world did she go? The Mad Hatter and the others might know something about that. ■ Story One summer's day, Usada and Kotora go to the library to do their homework. While Kotora takes her studies seriously, Usada has her head in the clouds. She wanders over to a bookshed deep inside, returning with a big, thick book. 'I found this interesting-looking book!' Kotora looks back at her quizzically. Suddenly, a slip of paper falls out from the book. The letter reads: 'Find Alice.' As soon as they read the words, the two are enveloped in a blinding light. When they come to, they're in a grassy field that they've never seen before. At that moment, a white rabbit comes hopping along. He might know how to get back to their own world! The pair take their first steps into the world of this magical book, in order to go searching for the white rabbit... ■ Features Character illustrations by the talented PicPicGram ( Ninja Girl , Japanese School Life ) Developed by illuCalab ( A Magical High School Girl ) Two playable characters Two difficulties to choose from",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1489410/header.jpg?t=1674959065",
    "Price": 17.99,
    "Developers": "illuCalab",
    "Publishers": "Sekai Project",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1489410/ss_3994c4abe17b1723f1f07d2cacb15ffe089177ea.1920x1080.jpg?t=1674959065,https://cdn.akamai.steamstatic.com/steam/apps/1489410/ss_7baf6470461f07e537f3215d1abd7434f89bbd6a.1920x1080.jpg?t=1674959065,https://cdn.akamai.steamstatic.com/steam/apps/1489410/ss_413eff3e6d7592689331c022a093fda60332fda0.1920x1080.jpg?t=1674959065,https://cdn.akamai.steamstatic.com/steam/apps/1489410/ss_06e175c36dec038bb674eead39091ac22e67251d.1920x1080.jpg?t=1674959065,https://cdn.akamai.steamstatic.com/steam/apps/1489410/ss_bef0f1fce645cb9548e0a964493ecc7e95fa902c.1920x1080.jpg?t=1674959065,https://cdn.akamai.steamstatic.com/steam/apps/1489410/ss_39c29dc7b719e2489b509764eea20c1f6586ce19.1920x1080.jpg?t=1674959065,https://cdn.akamai.steamstatic.com/steam/apps/1489410/ss_6e6769939b077bb1fb42854287b9e07a9e82a646.1920x1080.jpg?t=1674959065,https://cdn.akamai.steamstatic.com/steam/apps/1489410/ss_f4b01862d25883c51090d35f3dca11a78a0fe183.1920x1080.jpg?t=1674959065,https://cdn.akamai.steamstatic.com/steam/apps/1489410/ss_e1d908c3dabb256345d2b279a493d65742bfa757.1920x1080.jpg?t=1674959065",
    "Slug": "alice-escaped",
    "Meta Title": "Alice Escaped!: Jan 27, 2023, illuCalab and Full Overview",
    "Meta Description": "Looking for information on Alice Escaped!? Check out the release date (Jan 27, 2023), developer insights from illuCalab, and a complete game summary.",
    "Alt Text Image": "Official header image for Alice Escaped! game - Steam 1489410",
    "Canonical URL": "https://gusku.site/game/alice-escaped",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Alice Escaped!\", \"description\": \"Looking for information on Alice Escaped!? Check out the release date (Jan 27, 2023), developer insights from illuCalab, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 27, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"illuCalab\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sekai Project\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1489410/header.jpg?t=1674959065\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}