{
    "AppID": 2139510,
    "Name": "Amber Trail",
    "Release date": "Feb 12, 2023",
    "About the game": "You are sent on a mission to rebuild the settlement securing part of the trade route. Only the old, destroyed tower remained after the previous settlement. They all died. Try not to repeat their fate. Fight monsters, develop your character and collect an army. Hire workers, develop the economy and build defense buildings. Become famous on the trail and unlock new settlements with which you can trade new goods. Remember, you don't get a good offer often. The amber trail will give you wealth and fame if you don't let it take you. Good luck! MORE INFO At the moment of wishlist the game offers 8 unique monsters that you can fight. Each monster plays a different role during an attack, so that defense requires more strategy. Current monster types: Ranged, Magic, Melee, Charging, Tanking, Supportive and Biome monster We can develop our character by collecting experience from killing monsters. For now character can reach a maximum level of 36 and with each level the player can choose a new passive or active skill. The character can also upgrade his sword. For this, you need a blacksmith's building and certain raw materials. The sword looks different with each new level and has more attack and greater range of damage. The player can hire workers as soldiers. At the moment, the wishlist offers 3 types of soldiers: Archer, Swordman and Witch. The game offers the possibility of upgrading soldiers. Only Archer can be upgraded one level at the time of the wishlist. Archer is a type of ranged defensive unit who can additionally climb towers and avoid direct contact with monsters. Swordman is a melee unit that effectively blocks monsters. Witch is an supportive unit. Heals wounded units, but also prays to the gods and accelerates plant growth. The game offers 5 categories of buildings, of which there are currently 3 buildings in each category. The building categories are: Houses, Farming, Industry, Defense, and Faith. To build a building, you need a certain amount of resources and free space. Buildings can be upgraded, however, they require more rare resources, which can be purchased by trading with other settlements or obtained as a gift from a traveling merchant. At the moment of wishlist the game offers 22 different resources. Raw materials have a different value depending on the rarity, but this value is not constant, so you can sometimes buy the same goods cheaper or more expensive. The player can hire employees to perform various jobs. However, the employee has needs. The employee may be hungry and crave specific food. The worker must have a place to sleep and may need to pray to a desired god. If you are able to meet the needs of your employees, they will be happy and you will receive fame points. Fame Points can also be obtained by trading with other settlements. At the moment of wishlist the fame points unlocks the ability to trade with other settlements. In the description, I often mark 'At the moment of wishlist' because I continue to add content to the game and at the time of release it may have more than I described. I hope you will have a good time playing Amber Trail. Have fun!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2139510/header.jpg?t=1676199732",
    "Price": 4.99,
    "Developers": "Lukudev",
    "Publishers": "Lukudev",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2139510/ss_12420b85f0f227b4f1af442d1202b550b8c8220f.1920x1080.jpg?t=1676199732,https://cdn.akamai.steamstatic.com/steam/apps/2139510/ss_c5387794299c9358d28bfd6d8645e1b62c195d25.1920x1080.jpg?t=1676199732,https://cdn.akamai.steamstatic.com/steam/apps/2139510/ss_086551613776f7adf04547f94432f973ccc89da5.1920x1080.jpg?t=1676199732,https://cdn.akamai.steamstatic.com/steam/apps/2139510/ss_072cbda4782dac14d1351c55dd06a43d599d71d7.1920x1080.jpg?t=1676199732,https://cdn.akamai.steamstatic.com/steam/apps/2139510/ss_03600da4a2da99880cc20efb6861713a0d18789a.1920x1080.jpg?t=1676199732,https://cdn.akamai.steamstatic.com/steam/apps/2139510/ss_7067314a7696028e950e62880ddb301613e58d76.1920x1080.jpg?t=1676199732,https://cdn.akamai.steamstatic.com/steam/apps/2139510/ss_6c25453ca2a2608b9073283d99deb8b49f3166c0.1920x1080.jpg?t=1676199732",
    "Slug": "amber-trail",
    "Meta Title": "Amber Trail: Feb 12, 2023, Lukudev and Full Overview",
    "Meta Description": "Looking for information on Amber Trail? Check out the release date (Feb 12, 2023), developer insights from Lukudev, and a complete game summary.",
    "Alt Text Image": "Official header image for Amber Trail game - Steam 2139510",
    "Canonical URL": "https://gusku.site/game/amber-trail",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Amber Trail\", \"description\": \"Looking for information on Amber Trail? Check out the release date (Feb 12, 2023), developer insights from Lukudev, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 12, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lukudev\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lukudev\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2139510/header.jpg?t=1676199732\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}