{
    "AppID": 2051110,
    "Name": "BETA-SIXDOUZE",
    "Release date": "Feb 9, 2023",
    "About the game": "GAMEPLAY &amp; FEATURES Visual novel featuring 10+ hours of space adventure High-quality event CGs featuring original anime artwork More mecha duels, fluffy tails, and pulpy science fiction! Full professional Japanese voice acting SUMMARY Approximately 380,000 kilometers from Earth, a monstrous rose blooms just beyond the night sky, its silhouette glowing ominously in the moonlight. No one knows when it will strike again, and its true name and intentions remain unconfirmed. Humans know it only as “Consuelo.” Enter Yosuke Hakone, a combat pilot with Earth's military entrusted with an unlikely mission: to take to the stars in the legendary Battle-SHEEP Sura with his mysterious new copilot Hanaco... and defeat humanity’s greatest threat yet! But with Hanaco’s regressions and Yosuke’s own intergenerational inner demons to overcome, will this mismatched pair get it together in time? And just who is Hanaco, really...? The second in Dento Nanahoshi and Liar-soft's STX-SF series following ALPHA-NIGHTHAWK , this space opera sequel is for the starry-eyed dreamer in all of us–a nostalgic nod to the old adage that what’s essential is invisible to the eye. CHARACTERS Yosuke Hakone Voice: Noboru Yajima The STX Space Force’s newest captain. Rank: Silver Star. Promoted to Battle-SHEEP pilot due to his selfless nature, he’s ready to lay down his life for the mission–and humankind. However, as the grandson of a notorious war criminal, his morality often stems from misplaced shame and guilt. Thanks to Hanaco, he learns to face his demons for the first time... “You and me together make 612! You got that, Hanaco?!” Hanaco Voice: Suzu Sazanami Yosuke’s mysterious new copilot, a bona-fide Blue Star, and a wunderkind at channeling vast amounts of pure sel. This girl’s all at once honest, simple, and the purest of heart. Though no fault of her own, she often fails to read the room. Tends to take conversations and social cues at face value. “Got it. I’ll fight with you, Yosuke!” Jean Valjean Voice: Amando Rikuhongi Neo-fennec no. 24601. Nickname: Jean Valjean. Yosuke’s personal SHEEP mechanic and closest pal. A jokester and the life of the party, but always first to lend an ear. Has a criminal record. Like many neos, he’s also a devout animist. “I know that face. You can’t help but fall in love, can you?” Antoine de Sagan Voice: Musubi Aono A ’39 survivor and ex-STX-SF commander and pilot. Sports honey-wheat hair and sapphire eyes. Prefers the more manly “Sagan” over “Antoine”... Originally from France. “I think I could have fun living in a place like this, even on my own.” Wolf Voice: Stallone Not only is he an STX Space Force general and Blue Star military hero, but he also holds the record for most Consuelos defeated. Has currently pulled back from the front lines to organize his Elites... Date and place of birth unknown. Eliza’s closest confidant. “Yes, so I can remain human to the very end. That’s all there is to it.” Eliza Voice: Mako Ayane An “artificial goddess” android created by the scientist Jean Regulus. Her mind was uploaded from autonomous will first discovered in SHEEP. Since she excels at loving conversations, she oversees the online mental care of Battleship Baobab’s residents as their foremost psychiatrist. Her ageless, eternal beauty is an inspiration to many a Baobabian woman. She and Wolf are close companions. Literally doesn’t have a heart. “You’re right... All I can do is learn from humans’ conversations and repeat the most apt words.” Origin Voice: Kumiko Okugawa Neo-fennec no. ??? Age unknown. Yosuke and Jean Valjean’s enigmatic landlady. Insists her slate-like black tablet is a notebook device... “I’m a successful product of nanomachines, but in a completely different way from Consuelo.” Lamune Cinnamon Yatsuhashi Navigation AI and the official STX Space Force mascot. The most shared AR anim on Battleship Baobab. Download him for free from the military’s official website! Enriches people’s lives with his lamb-y charms and fluffy face. Lococo Nanaco Cinnamon Yatsuhashi Neo-fennec no. 655775. Works at a Hawaiian bar on Cosmic Oahu. Possesses uniquely long arms due to her strong “Adam blood,” a term reserved for apparent traits from early neo-fennec ancestors. Jean Regulus Tetsuto Furukawa By all accounts, an altruistic and lion-hearted research scientist... Dabbles in genetic engineering as a side project to his main Monolith work. A childhood friend and something of a big brother to Sagan. He’s also an old war buddy of Ichizo Yodaka—the two remain close. “So please, look forward to the surprise I’ve got in store for you.” Lunette Kumiko Okugawa A neo-fennec much loved and doted on by Sagan. Currently living the lab life at the STX-SF R&amp;D Center. A sucker for cheese and salty blue boudin sausages. Ichizo Yodaka Noboru Yajima An STX Space Force elite commander and Blue Star captain. Joined the STX with Regulus, and is now Sagan’s superior officer. Despite appearances, he’s got a surprisingly sweet tooth. The grandfather of one Yosuke Hakone, for better or worse. “You do know what you are, don’t you?”",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2051110/header.jpg?t=1676271850",
    "Price": 15.99,
    "Developers": "Liar-soft",
    "Publishers": "Shiravune",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2051110/ss_78463b30cb4a23ac0aedb797b2d6fa5d48ed9abf.1920x1080.jpg?t=1676271850,https://cdn.akamai.steamstatic.com/steam/apps/2051110/ss_9ca1fc8a1091c539970b24e8a62ee1c57d0e0a35.1920x1080.jpg?t=1676271850,https://cdn.akamai.steamstatic.com/steam/apps/2051110/ss_6215bf27909c688699ee2b075e18c538ebca6bba.1920x1080.jpg?t=1676271850,https://cdn.akamai.steamstatic.com/steam/apps/2051110/ss_c037d1cedb2f4cefdf936d3ce188381a672e32e1.1920x1080.jpg?t=1676271850,https://cdn.akamai.steamstatic.com/steam/apps/2051110/ss_0dcd1d93cabe6524d0dfbe4cdb12b671cc150c4f.1920x1080.jpg?t=1676271850,https://cdn.akamai.steamstatic.com/steam/apps/2051110/ss_d40b622a446d5a8bbbe89b6cb99b26f32b716848.1920x1080.jpg?t=1676271850,https://cdn.akamai.steamstatic.com/steam/apps/2051110/ss_53ccf61f96693f279605be584a97f67a44c40335.1920x1080.jpg?t=1676271850,https://cdn.akamai.steamstatic.com/steam/apps/2051110/ss_913d55cb82b447dc3290b94c849793e7ad4a8110.1920x1080.jpg?t=1676271850,https://cdn.akamai.steamstatic.com/steam/apps/2051110/ss_42aee173017c2ab0fa9b29c82e09d583945f00ce.1920x1080.jpg?t=1676271850,https://cdn.akamai.steamstatic.com/steam/apps/2051110/ss_3a58104d9bbe54fd1ea2cdc02f57a427ca2c1bb5.1920x1080.jpg?t=1676271850,https://cdn.akamai.steamstatic.com/steam/apps/2051110/ss_727ce8d1c7a6f114e606ec312a58fb84280a25a1.1920x1080.jpg?t=1676271850,https://cdn.akamai.steamstatic.com/steam/apps/2051110/ss_efba72202eff7f0d9f75ddad926860ef90736a55.1920x1080.jpg?t=1676271850,https://cdn.akamai.steamstatic.com/steam/apps/2051110/ss_ae0e4925922969b08f7d152b819d25abf9b0c99c.1920x1080.jpg?t=1676271850",
    "Slug": "beta-sixdouze",
    "Meta Title": "BETA-SIXDOUZE: Feb 9, 2023, Liar-soft and Full Overview",
    "Meta Description": "Looking for information on BETA-SIXDOUZE? Check out the release date (Feb 9, 2023), developer insights from Liar-soft, and a complete game summary.",
    "Alt Text Image": "Official header image for BETA-SIXDOUZE game - Steam 2051110",
    "Canonical URL": "https://gusku.site/game/beta-sixdouze",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BETA-SIXDOUZE\", \"description\": \"Looking for information on BETA-SIXDOUZE? Check out the release date (Feb 9, 2023), developer insights from Liar-soft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 9, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Liar-soft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shiravune\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2051110/header.jpg?t=1676271850\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}