{
    "AppID": 1801110,
    "Name": "違う冬のぼくら／BOKURA",
    "Release date": "Feb 13, 2023",
    "About the game": "Are you and I really seeing the world the same way? An exclusively two-player puzzle adventure game that makes you question your reality. *Players must communicate with each other to play this game. If you are not playing in the same location, you will need another communication method, such as voice chat. Before buying the game, please keep in mind that the game itself does not provide a separate communication method. BOKURA is a puzzle adventure game that can only be played with two players. To play the game, two people must play on two separate machines. While you have to work together, what you see on your game screens is completely different. Even though the same character should be displayed on both of your screens, to one of you, they might look like an animal out of a picture book, while to the other, they might look like a robot. (The objects you can interact with might move differently for each of you too!) You will need to talk to each other to find out what you can and cannot see. Work together to solve the puzzles and continue your journey. You can play online in different locations while talking to each other over a call. Player 1: A world of animals Player 2: A world of machines Gameplay The game is a side-scrolling co-op puzzle adventure. You will be faced with a number of critical choices throughout the story which will lead your journey in different directions. You Can't Play Alone A unique feature of this game is that you cannot play it alone. You cannot play it singleplayer or with a computer as player two. It can only be played with two people—no more, no less. As such, the very first choice you make in this game takes place before you even start: Who should I play this game with? The total gameplay time is around three to four hours. While you play, you and the other player will need to talk to each other to understand what is happening, solve problems, and make important decisions together. Story Two boys who run away from home encounter a dead deer. The sight of it causes them to faint, but when they wake up, the worlds they see are no longer the same. One of them sees a world of animals, while the other sees a world of machines. Will the boys be able to find out what has happened to them and return to the world they used to be in? Creator Profile tokoronyori ( Twitter ) An indie game dev with a distinctive style that fills his games with originality and mystery. He is known for his 2016 hit game Hitoribocchi Wakusei (Lonely Planet). He created the two-player puzzle adventure game BOKURA as a member of the first round of Kodansha's Game Creators' Lab. He specializes in making experiences only possible through games with his characteristic game mechanics. Creator Comment Have you ever wondered if the world you see is the same as the world everyone else sees? BOKURA is a game about two boys whose worlds are no longer the same as everyone else's. When you play, you'll find that what you and the other player see are not the same either. I hope you'll overcome the differences in how you see the world and relive the friendship of your childhood through the story of these two boys.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1801110/header.jpg?t=1676787035",
    "Price": 9.89,
    "Developers": "ところにょり",
    "Publishers": "kodansha games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1801110/ss_bae8dc3506f31979e34cfe456b6cc4b0d83cfa4e.1920x1080.jpg?t=1676787035,https://cdn.akamai.steamstatic.com/steam/apps/1801110/ss_6186043353585ba463611eb8219676c953a46998.1920x1080.jpg?t=1676787035,https://cdn.akamai.steamstatic.com/steam/apps/1801110/ss_531716eee4fa84714e235a6589603259287cbf15.1920x1080.jpg?t=1676787035,https://cdn.akamai.steamstatic.com/steam/apps/1801110/ss_ce420dd4544344de07f6fb759d279fde148c4dee.1920x1080.jpg?t=1676787035,https://cdn.akamai.steamstatic.com/steam/apps/1801110/ss_d114491a0d2cd846e6b4eecc12ca224dda3b7160.1920x1080.jpg?t=1676787035,https://cdn.akamai.steamstatic.com/steam/apps/1801110/ss_0466444fcde98ce7cee7d2a1f8aa6f3709aaef46.1920x1080.jpg?t=1676787035,https://cdn.akamai.steamstatic.com/steam/apps/1801110/ss_3e47712884b296881f3f799967500854e6d09db3.1920x1080.jpg?t=1676787035,https://cdn.akamai.steamstatic.com/steam/apps/1801110/ss_2785a15739374f57c4e4a91b7c8768d3234532d7.1920x1080.jpg?t=1676787035,https://cdn.akamai.steamstatic.com/steam/apps/1801110/ss_edca0156265b863feb740849615b024dc2debedf.1920x1080.jpg?t=1676787035,https://cdn.akamai.steamstatic.com/steam/apps/1801110/ss_8ac99875d8c46b97fd1b8e43dbef02c08ceef6f6.1920x1080.jpg?t=1676787035",
    "Slug": "bokura",
    "Meta Title": "違う冬のぼくら／BOKURA: Feb 13, 2023, ところにょり and Full Overview",
    "Meta Description": "Looking for information on 違う冬のぼくら／BOKURA? Check out the release date (Feb 13, 2023), developer insights from ところにょり, and a complete game summary.",
    "Alt Text Image": "Official header image for 違う冬のぼくら／BOKURA game - Steam 1801110",
    "Canonical URL": "https://gusku.site/game/bokura",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u9055\\u3046\\u51ac\\u306e\\u307c\\u304f\\u3089\\uff0fBOKURA\", \"description\": \"Looking for information on \\u9055\\u3046\\u51ac\\u306e\\u307c\\u304f\\u3089\\uff0fBOKURA? Check out the release date (Feb 13, 2023), developer insights from \\u3068\\u3053\\u308d\\u306b\\u3087\\u308a, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 13, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u3068\\u3053\\u308d\\u306b\\u3087\\u308a\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"kodansha games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1801110/header.jpg?t=1676787035\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.89, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}