{
    "AppID": 2296910,
    "Name": "Book of Shadows",
    "Release date": "Feb 14, 2023",
    "About the game": "The game takes place 1,000 years after the Battle of the Holy Devil, the Book of Shadows suddenly appeared on the mainland, and it is said that people have the power to rule the country if they get it. So the major sects and organizations participated in the competition for this book. Later, I learned about it through the Magic Church. When people get this book, the book will absorb the negative emotions of humans, summon monsters from other worlds, and demonize ordinary humans. Later, the book will be placed in the Shadow Temple to seal this power. The castle affected by this first produced various monsters. The protagonist was sent to investigate here and learned the secret of the Book of Shadows, but because the Book of Shadows was snatched by the magic mercenaries of the Magic Star Society, when the protagonist and the others came to the Magic Star Society, the magic mercenaries had already been taken away. The ancient dark star is demonized. When the protagonist defeats the Dark Star, he learns that the two powers of the Book of Shadows are playing a game, and with the help of the successor of the ancient archmage, he undoes the barrier of the Book of Darkness, comes to the hiding place of the Demon King, and discovers the truth of the matter . Compared with traditional RPG, there are various skills and equipment. Various attributes are attached to the attack. The maze of the scene is different from the general RPG, it is more linear. Completing various tasks, defeating rare monsters, and improving strength are more obvious. Game features: 1 Magnificent scenes, rich hidden elements, and unique NPC background stories build a magnificent and mysterious ancient magic world. 2 BGM and sound effects produced by a professional company. Increase the atmosphere of the scene. 3Dozens of magic options, cooperate with each other to form hundreds of tactics. 4Each character has unique skills and exclusive weapons, which can be matched with each other to defeat the enemy faster. 5 Dozens of equipment, including weapons, armor, accessories. Each weapon has different grades and has different exclusive skills 5 rich hidden monsters, stronger than ordinary monsters, you can get exclusive equipment after defeating them. 6 Each scene has different scene effects, increasing the sense of role substitution. 7 Monsters and characters have their own special skills, and Huali's skills increase the character's difference and particularity.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2296910/header.jpg?t=1676382822",
    "Price": 4.99,
    "Developers": "WJLEGAME",
    "Publishers": "WJLEGAME",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2296910/ss_6221d331f5931a0deafc6904c85041dd5a0e44b7.1920x1080.jpg?t=1676382822,https://cdn.akamai.steamstatic.com/steam/apps/2296910/ss_7f86588cac449d055e9e5655f52befb9c326bf90.1920x1080.jpg?t=1676382822,https://cdn.akamai.steamstatic.com/steam/apps/2296910/ss_28c4320c954a7ccf981c0aaa2bf38854086f893a.1920x1080.jpg?t=1676382822,https://cdn.akamai.steamstatic.com/steam/apps/2296910/ss_b98a0580f0348bb44ea405ac178b60bd74b8be27.1920x1080.jpg?t=1676382822,https://cdn.akamai.steamstatic.com/steam/apps/2296910/ss_889dbe716f71b5375636339f5b1da4fd31b9af89.1920x1080.jpg?t=1676382822,https://cdn.akamai.steamstatic.com/steam/apps/2296910/ss_25e9885f5cfd662ab4a4aefcd64db6ab636cd42e.1920x1080.jpg?t=1676382822,https://cdn.akamai.steamstatic.com/steam/apps/2296910/ss_1c0240b0baeff818483a5d00d68a96e6a9601a10.1920x1080.jpg?t=1676382822,https://cdn.akamai.steamstatic.com/steam/apps/2296910/ss_eba9465331334da19c46f4927444afa6a7114733.1920x1080.jpg?t=1676382822",
    "Slug": "book-of-shadows",
    "Meta Title": "Book of Shadows: Feb 14, 2023, WJLEGAME and Full Overview",
    "Meta Description": "Looking for information on Book of Shadows? Check out the release date (Feb 14, 2023), developer insights from WJLEGAME, and a complete game summary.",
    "Alt Text Image": "Official header image for Book of Shadows game - Steam 2296910",
    "Canonical URL": "https://gusku.site/game/book-of-shadows",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Book of Shadows\", \"description\": \"Looking for information on Book of Shadows? Check out the release date (Feb 14, 2023), developer insights from WJLEGAME, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 14, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"WJLEGAME\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"WJLEGAME\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2296910/header.jpg?t=1676382822\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}