{
    "AppID": 2235670,
    "Name": "Changeling Charade",
    "Release date": "Feb 9, 2023",
    "About the game": "Put on a magical disguise to find true love! As a changeling, will you stay among the human nobility, or join the fairy revolution? Changeling Charade is a 450,000-word interactive supernatural romance novel by Ruth Vincent, where your choices control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination. Magic is illegal in the city of New Victoria. That means that Supernaturals - werewolves, djinn, fairies, and more - have started an underground trade in potions and spells. As an impoverished fairy, you’ve joined that trade in hopes of earning a better life for yourself and your family: you’ve become a changeling, transforming yourself to resemble the human noblewoman Lady Constance Weatherby. Living in Lady Constance’s lavish townhouse, you can wear the finest fashions, attend masked balls, make friends among the nobility, learn the arts from a skilled tutor, even gain an audience with the Queen herself! But there is more to New Victoria’s high society than meets the eye, and you are not the only one hiding a magical secret. Which noble house conceals a werewolf? Which one has suspicious ties to the shady Potion Market? Not only that, but there are fairy revolutionaries fighting to reverse the laws that forbid magic, and spies among the nobility working for the same cause. Will you join them? Or will you stay in the comfortable human life that you have made for yourself? And where will you find love? With the distinguished earl that Lady Constance’s overbearing mother hopes to match with her daughter? The fashionable noble with a pet fox and a mischievous smile to match? The penniless tutor, artistic and sincere? Or even the idealistic fairy revolutionary who leads the charge to restore magic? Play as a woman; gay, straight, bi; poly or monogamous. Romance a melancholy earl, a mischievous noble, an artistic tutor, or a bold fairy revolutionary. Uncover the supernatural secrets of New Victoria’s human nobility Dance at masked balls, attend pastoral picnics, refine your artistic accomplishments - or laugh and drink at a fairy pub. Find acceptance for your true fairy self - or discover new comfort living as a human Meet the Queen - or work to overthrow her, or even take her place on the throne!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2235670/header.jpg?t=1675950093",
    "Price": 4.79,
    "Developers": "Heart's Choice",
    "Publishers": "Heart's Choice",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2235670/ss_65c485fe6564ed998eede3113ea9af643f0a0605.1920x1080.jpg?t=1675950093,https://cdn.akamai.steamstatic.com/steam/apps/2235670/ss_f893a6fc6ec921809d69a43748eb136eb635e191.1920x1080.jpg?t=1675950093,https://cdn.akamai.steamstatic.com/steam/apps/2235670/ss_f7727a88dea265e3c569aa3ceba3720efc0350e5.1920x1080.jpg?t=1675950093,https://cdn.akamai.steamstatic.com/steam/apps/2235670/ss_1847a17bf5ae4d138c172cc1833615d66959540f.1920x1080.jpg?t=1675950093,https://cdn.akamai.steamstatic.com/steam/apps/2235670/ss_96515038add43ead4f5d2d1980e317bba7fe5b54.1920x1080.jpg?t=1675950093,https://cdn.akamai.steamstatic.com/steam/apps/2235670/ss_7d036133f932f065a0e3a67099d91e89f477b6c2.1920x1080.jpg?t=1675950093",
    "Slug": "changeling-charade",
    "Meta Title": "Changeling Charade: Feb 9, 2023, Heart's Choice and Full ...",
    "Meta Description": "Looking for information on Changeling Charade? Check out the release date (Feb 9, 2023), developer insights from Heart's Choice, and a complete game sum...",
    "Alt Text Image": "Official header image for Changeling Charade game - Steam 2235670",
    "Canonical URL": "https://gusku.site/game/changeling-charade",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Changeling Charade\", \"description\": \"Looking for information on Changeling Charade? Check out the release date (Feb 9, 2023), developer insights from Heart's Choice, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 9, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Heart's Choice\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Heart's Choice\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2235670/header.jpg?t=1675950093\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}