{
    "AppID": 2077940,
    "Name": "Code Rivals",
    "Release date": "Feb 4, 2023",
    "About the game": "Code Rivals is a experimental, visual programming language combat game, by a solo developer. Learn the basic principles of programming in a super intuitive visual (not text-based) programming language in a campaign tutorial, then challenge your friends in a autonomous robot combat, in different online multiplayer arenas, in various game modes. In Code Rivals, instead of controlling the combat robot you will program it to fight for you, using an intuitive graphic based programming language you will use blocks that represent the actions the program will execute, the parts of the robot that will be activated, the flow of execution, variables etc. The main screen consists of the 'coding area' where you drop your coding blocks and connect them. The side monitor is the 'real world' view where you visualise your robot, the area and enemies it is facing in the level and the paths/actions it must take to achieve victory. The game currently has 10 single player/tutorial levels, each showing different features of the programing language and user interface, in a progressive and intuitive manner, even young kids can beat the initial levels but by the time you reach level 10 you will feel like youre creating real programs with complex scripts to be executed. The final game is intended to have 25 single player campaign levels. The multiplayer section consists of the multiplayer menu, where you find or create a match. Then joining a match you are transported to the lobby area where you can test your code or play with a random code generator, while waiting for the required number of players to start the multiplayer battle. In the multiplayer map the objective is to program your robot or import and adapt code from one of the multiple saved code slots, then set your robot ready to the battle before the timer runs out. Once the battle begins its all up to your code controlling your robot to beat your code rival. Teams are divided into red vs blue, up to 2 players in each, in a deathmatch or conquest modes. First team to win 2 rounds wins the match. It is possible to text chat anyone and also to share your code with anyone during the match. The final game is intended to have initially 3 single player modes: deathmatch, conquest and defend/attack the objective. Also 3 playable robot types: heavy gun, light machine gun, rocket launcher. In 10 multiplayer arenas. The game is in initial stages early-access, for real bug testing. I invite you to enjoy the already playable levels and modes and contribute with construtive feedback.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2077940/header.jpg?t=1675564383",
    "Price": 0.0,
    "Developers": "Leandro B",
    "Publishers": "Leandro B",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2077940/ss_07f83b2d7c149b2c1a8383739c363836a1b110ce.1920x1080.jpg?t=1675564383,https://cdn.akamai.steamstatic.com/steam/apps/2077940/ss_f2f376847227b1698cc3cefabc252422d212207b.1920x1080.jpg?t=1675564383,https://cdn.akamai.steamstatic.com/steam/apps/2077940/ss_d87ebb71e2a3c78ef02e7ddaeadc666bdd0cd37e.1920x1080.jpg?t=1675564383,https://cdn.akamai.steamstatic.com/steam/apps/2077940/ss_fa379d49425422cb6b3ed00efa8f63bd1027a7bb.1920x1080.jpg?t=1675564383,https://cdn.akamai.steamstatic.com/steam/apps/2077940/ss_20908e067ddb11472f83b434f6604ffe514a226a.1920x1080.jpg?t=1675564383",
    "Slug": "code-rivals",
    "Meta Title": "Code Rivals: Feb 4, 2023, Leandro B and Full Overview",
    "Meta Description": "Looking for information on Code Rivals? Check out the release date (Feb 4, 2023), developer insights from Leandro B, and a complete game summary.",
    "Alt Text Image": "Official header image for Code Rivals game - Steam 2077940",
    "Canonical URL": "https://gusku.site/game/code-rivals",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Code Rivals\", \"description\": \"Looking for information on Code Rivals? Check out the release date (Feb 4, 2023), developer insights from Leandro B, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 4, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Leandro B\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Leandro B\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2077940/header.jpg?t=1675564383\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}