{
    "AppID": 2237070,
    "Name": "Deathtide Survivors",
    "Release date": "Jan 26, 2023",
    "About the game": "Horde Survival Reimagined Deathtide Survivors is a Hordelike (Horde-Survival Roguelite) where you fight powerful bosses and endless tides of the undead. Unlock ancient powers and create overpowered builds, conquer brutal challenges and become an epic bullet-hell Final Boss even hundreds of enemies struggle to take down. Inspired by classic ARPGs and Roguelites, Deathtide Survivors brings a whole new approach to the 'Hordelike' subgenre, adding unique gameplay elements that enhance and polish the game experience. You're in Charge While autocast Spells are fundamental to Hordelike gameplay, in Deathtide Survivors you have full control of special abilities that can change the tide of battle, making room for skillful plays and that powerful feeling of being unstoppable. Ultimates: Powerful spells with long cooldowns, that can be cast whenever you want. Use them for a tactical retreat or to push forward and show your true power. Dash: You can dodge to gain temporary immunity for a short time, quickly gain ground against fleeing enemies or reposition yourself when in danger. Consumables: Items such as potions and magic scrolls are plentiful, but can only be used once or twice before running out. Items can be found in the shop, or on chests carried by Elite enemies and bosses. Against All Odds The bulk of the undead horde is weak and mindless, but you will be challenged by the powerful Elite forces. With advanced Artificial Intelligence that reads the ever changing battlefield and works together to bring you down, you can expect a fun and engaging combat experience. Here are a couple of examples: Necromancer: Their primary goal is to protect the undead horde, healing and resurrecting the enemies you slay. Mage: They will predict your movements to try and corner you with well placed spells and if threatened will retreat behind Guardians or Necromancers for protection. Champion: These fallen warriors have superior tactics and are able to intercept your movements, blocking your escape route when you're surrounded. The Goblin Looter is not undead, and he doesn't care about anything other than stealing your precious XP! Play Your Way Deathtide respects both casual and hardcore players alike. You can just have fun on Normal mode and pick whichever spell seems cooler to massacre endless amounts of undead, or you can dive deep into theorycrafting to make the most powerful builds imaginable to beat Nightmare mode. Unique Spells: There are no duplicates or redundant spells, making the choice between them more impactful, and build-crafting more fun. Rerolls: Who doesn't love RNG? 69% of players don't. Or was it 33%? Regardless, with rerolls you have a chance to fight back against your bad luck when you level up and select your spells, giving you greater chances to create a fun build. Elemental Powers: Every spell has an element that stacks a distinct and powerful effect on enemies, creating great potential for synergies and unique playstyles. Talents: You cannot take all of them at once, but they can be freely swapped, reset or saved in loadouts to help with build experimentation. Attunement: You can only pick one! Attunements are the base of your build, prizing certain aspects of gameplay while overlooking (or sacrificing) others, each one grants a unique game experience, making builds unique and diverse. You can check all your unlocks at the Library. A Clash Of Titans What better way to show off your might than toppling down giants? Each map comes with 3 fully fledged, multi-phase boss battles. Show them who is the real boss and bask in their epic loot. Avoid the noxious poison of the Plaguebringer in Act I An Ever Evolving story Follow in the footsteps of the Deathslayer, a righteous Justicar fighting against Death itself during the End Times. You will explore a dead world torn by the ravages of time and conflict, finding pieces of history scattered throughout the maps, and reading about the lore on spell descriptions and character dialogues. Each major update will bring a new Act: A new map, the next chapter of the storyline and vast amounts of content with new spells, talents, attunements, enemies, bosses, balance changes, etc... The Map Of Act I. I would like to thank everyone who read until the end of the page and has taken interest in the project! Deathtide Survivors is made by a single 'does-it-all' developer, with the unconditional assistance of his wife. We hope to create a vibrant community around our game, and your feedback is always greatly appreciated. So make sure to join our Discord if you're interested in helping us shape the future of Deathtide Survivors and the emerging Hordelike genre in general.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2237070/header.jpg?t=1674946791",
    "Price": 4.49,
    "Developers": "Luiz Pascoto",
    "Publishers": "Luiz Pascoto",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2237070/ss_c161955c82086c698228ad166082e97027882650.1920x1080.jpg?t=1674946791,https://cdn.akamai.steamstatic.com/steam/apps/2237070/ss_325322fd7702bfea3daacd5fb61a940794d03141.1920x1080.jpg?t=1674946791,https://cdn.akamai.steamstatic.com/steam/apps/2237070/ss_1f5dcd8f58d6e5ab64f6fe440d4df7997e06ad06.1920x1080.jpg?t=1674946791,https://cdn.akamai.steamstatic.com/steam/apps/2237070/ss_181ab54dd90831ea1009d5b16a05101375ae8834.1920x1080.jpg?t=1674946791,https://cdn.akamai.steamstatic.com/steam/apps/2237070/ss_d9a07dd137f4c08031cf3d7f46c19a91b217d87e.1920x1080.jpg?t=1674946791,https://cdn.akamai.steamstatic.com/steam/apps/2237070/ss_91cc89fb744a8fcf0e3a4eca0461ce2d77eef1ea.1920x1080.jpg?t=1674946791",
    "Slug": "deathtide-survivors",
    "Meta Title": "Deathtide Survivors: Jan 26, 2023, Luiz Pascoto and Full ...",
    "Meta Description": "Looking for information on Deathtide Survivors? Check out the release date (Jan 26, 2023), developer insights from Luiz Pascoto, and a complete game sum...",
    "Alt Text Image": "Official header image for Deathtide Survivors game - Steam 2237070",
    "Canonical URL": "https://gusku.site/game/deathtide-survivors",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Deathtide Survivors\", \"description\": \"Looking for information on Deathtide Survivors? Check out the release date (Jan 26, 2023), developer insights from Luiz Pascoto, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 26, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Luiz Pascoto\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Luiz Pascoto\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2237070/header.jpg?t=1674946791\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}