{
    "AppID": 1338840,
    "Name": "Death in the Water 2",
    "Release date": "Jan 26, 2023",
    "About the game": "BEWARE Beware the waters, they hide a mysterious and terrifying threat. Death, an ancient Kraken leviathan haunts your every move in this tense underwater horror survival game. Fight to survive using powerful weapons and upgrades as you explore a beautiful yet treacherous underwater world. Gameplay Death in the Water 2 at its core is a wave-based shooter but combines elements of terrifying horror and tension with heart-pounding adrenalin-fueled action. Each dive ( wave ) typically starts off with elements of exploration where the pace is a bit slower and gives you a chance to find treasure, and other collectibles as well as find your bearings. During this phase, the tension builds as you investigate ruins, wrecks, and reefs. Sharks and creatures are passive and may not always attack you unless provoked, much like the behavior of real sharks. At any stage during the dive Death ( the Kraken ) will launch a mind-control attack on all creatures and a feeding frenzy will kick off with you being the primary target. You will need to survive and complete the dive objective before you move on to the next wave. As you progress to the next dive the difficulty ramps up and things get even more frantic. The combination of tension and action makes it incredibly addictive as you explore the open world map. Will you escape the clutches of the Kraken, or will you join the endless ranks of the drowned? This is a game about facing your fears head on and conquering the challenges that stand in your way. It's about testing your limits and pushing yourself to the brink. It's about survival, and emerging victorious against all odds. So, strap on your diving gear and get ready for the ultimate underwater horror experience. Death awaits you in the depths... Open World Death in the Water features a large open-underwater world map for you to discover during dives. Explore wrecks, reefs, caves, ruins, and terrifying open waters that will test your thalassophobia. Find hidden treasures and other secrets to help you on your quest to take on the Kraken. Creatures Death in the Water 2 has an extensive list of incredibly lifelike procedurally animated creatures, both real and fantasy based. Enemies will navigate through the world reacting realistically to the environment as they hunt you down using sight, sound, or scent to find you. Weapons and Gear In your arsenal, you will have access to a host of weapons and gear that you can unlock and upgrade. These include Chum Grenades, High Powered Sniper Spearguns and Shotguns. About the Dev Team We are two friends Neil (the artist) and Edward (the coder), we started making games as a hobby back when we were still in school. Thirteen years ago we quit our day jobs and went on to found Lighthouse Games Studio and have released multiple top selling games including Shark Attack Deathmatch, Comedy Night, Avatar Deathmatch, and many others. Social Links You can follow us on Twitter | YouTube | TikTok for daily updates on the progress of the game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1338840/header.jpg?t=1675084785",
    "Price": 17.99,
    "Developers": "Lighthouse Games Studio",
    "Publishers": "Lighthouse Games Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1338840/ss_fe533cea7d9d80448319604b209a77545662e8e2.1920x1080.jpg?t=1675084785,https://cdn.akamai.steamstatic.com/steam/apps/1338840/ss_8146eda284b70a428232f4a2f14baa2d78a49867.1920x1080.jpg?t=1675084785,https://cdn.akamai.steamstatic.com/steam/apps/1338840/ss_30bcf90b849ec97e8cc113ee8d1ac28f14e34ee6.1920x1080.jpg?t=1675084785,https://cdn.akamai.steamstatic.com/steam/apps/1338840/ss_90a4c62f4bfd2470e98c24d3a27b06a270869b57.1920x1080.jpg?t=1675084785,https://cdn.akamai.steamstatic.com/steam/apps/1338840/ss_4efa73ab96cf89cf1b224fd9ec38aefd58bada58.1920x1080.jpg?t=1675084785,https://cdn.akamai.steamstatic.com/steam/apps/1338840/ss_1408f76fd51c107ab2c3e9e382aeb077398ca8d1.1920x1080.jpg?t=1675084785,https://cdn.akamai.steamstatic.com/steam/apps/1338840/ss_581ee9b2513eb0178c57907b8d188b71071e9c8f.1920x1080.jpg?t=1675084785,https://cdn.akamai.steamstatic.com/steam/apps/1338840/ss_29cbea99513352134f5247d4835c4e1b2d42343c.1920x1080.jpg?t=1675084785,https://cdn.akamai.steamstatic.com/steam/apps/1338840/ss_bedc17f592701d5ba34068d1ceed411ec88240a5.1920x1080.jpg?t=1675084785,https://cdn.akamai.steamstatic.com/steam/apps/1338840/ss_036e86d51dc8b480f17c3a96786decd0aa8569a8.1920x1080.jpg?t=1675084785,https://cdn.akamai.steamstatic.com/steam/apps/1338840/ss_16fb5af3dfd9b6f3dfdb13f699ab293cdac6249a.1920x1080.jpg?t=1675084785,https://cdn.akamai.steamstatic.com/steam/apps/1338840/ss_3825138067bc1b96775da89d441b61e005c87a60.1920x1080.jpg?t=1675084785",
    "Slug": "death-in-the-water-2",
    "Meta Title": "Death in the Water 2: Jan 26, 2023, Lighthouse Games Stud...",
    "Meta Description": "Looking for information on Death in the Water 2? Check out the release date (Jan 26, 2023), developer insights from Lighthouse Games Studio, and a compl...",
    "Alt Text Image": "Official header image for Death in the Water 2 game - Steam 1338840",
    "Canonical URL": "https://gusku.site/game/death-in-the-water-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Death in the Water 2\", \"description\": \"Looking for information on Death in the Water 2? Check out the release date (Jan 26, 2023), developer insights from Lighthouse Games Studio, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 26, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lighthouse Games Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lighthouse Games Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1338840/header.jpg?t=1675084785\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}