{
    "AppID": 1739650,
    "Name": "Dimensions: Dreadnought Architect",
    "Release date": "Feb 1, 2023",
    "About the game": "Discord: QQ: 1053474688 Build Easier, But Produce Fancier! Build Your Ship From Modules Each ship is composed of independent modules and connections topolgoy between them. Every module has its properties and functions. You should design your ship with a clear strategy, balancing among maneuverability, endurance, firepower, cargo space, power supplyment and other aspects. Command Your Ship Tactically As captain, you need not to control every individual modules. but command your ship by policy management according to battlefield situation. Such as setting navigation direction and motion attitude, setting combat policy, energy supply priority. And what's more, you can activate your unique skills to totally turn the table. An Easier Building Pattern You can design your ship in a more free and convenient way. Give less effort, but gain a more exquisite ship. Module is freely attached via contact to other module's connector area. Module can be freely scaled along X, Y, Z axes, and all properties of module would change according to size of modules. Support X, Y, Z axes mirroring and other advanced features. Realistic Physics Simulation Thrust and torque are computed from individual thrusters, so thruster direction and mass of center need to be concerned in ship design. Structure of ship will be broken if crucial module (node of topology) is destroyed, so it's better to set some redundant connnections in design. All bullets and missiles are physical simulated, will deliver impact force to target hit. Roguelike Experience In singleplayer mode, you can explore procedural generated galaxy, fight against distinctive unknown enemies, redesign and reinforce your ship, until victory. Attention, you have only one shot. Have Fun With Your Friends You can create a custom combat through network with your friends. Either play against AI enemies or fight with each other. Although only LAN is officially supported now, some players can still connected to each other by NAT-Traversal through internet. And we are planning to upgrade to fully online support in future.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1739650/header.jpg?t=1675306853",
    "Price": 12.74,
    "Developers": "Craft Theory",
    "Publishers": "Craft Theory",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1739650/ss_84119262e24b9c3e70519b0763a1f8975d70454b.1920x1080.jpg?t=1675306853,https://cdn.akamai.steamstatic.com/steam/apps/1739650/ss_a57945b71f9e677677dc7ae200afc38a523e7b51.1920x1080.jpg?t=1675306853,https://cdn.akamai.steamstatic.com/steam/apps/1739650/ss_7eb11b2377b2ff831095b452a6f06f3b2d2d0c6c.1920x1080.jpg?t=1675306853,https://cdn.akamai.steamstatic.com/steam/apps/1739650/ss_4ce98d51050494f6d51c7a5b0b7c5f8e6fa931e2.1920x1080.jpg?t=1675306853,https://cdn.akamai.steamstatic.com/steam/apps/1739650/ss_dad93fefe4ae08a9f275827b108e8421beb59e98.1920x1080.jpg?t=1675306853",
    "Slug": "dimensions-dreadnought-architect",
    "Meta Title": "Dimensions: Dreadnought Architect: Feb 1, 2023, Craft The...",
    "Meta Description": "Looking for information on Dimensions: Dreadnought Architect? Check out the release date (Feb 1, 2023), developer insights from Craft Theory, and a comp...",
    "Alt Text Image": "Official header image for Dimensions: Dreadnought Architect game - Steam 1739650",
    "Canonical URL": "https://gusku.site/game/dimensions-dreadnought-architect",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dimensions: Dreadnought Architect\", \"description\": \"Looking for information on Dimensions: Dreadnought Architect? Check out the release date (Feb 1, 2023), developer insights from Craft Theory, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 1, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Craft Theory\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Craft Theory\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1739650/header.jpg?t=1675306853\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.74, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}