{
    "AppID": 2101080,
    "Name": "East Trade Tycoon",
    "Release date": "Feb 22, 2023",
    "About the game": "East Trade Tycoon is a business simulation game, the background is set in the fictional ancient China, in the game, you can change from a poor guy with nothing to a rich businessman. Through commodity trading, investing in cities, completing business orders, operating business accounts, and managing families, the goal is to become the highest honored Chinese merchant! While running a business, you can also experience Sims life, get married and have children, and carry on the family line. As family members grow, they can also do business and trade with you, working to make money, which is an indispensable help for us to grow into a trade tycoon. Our ultimate goal is to monopolize the business of the whole region and become the largest businessman in every city. At the same time, we have a strong family so that our business can be passed on forever. There are 80 ancient cities based on real geography and names in the game, from Yanzhou in the Central Plains to Luoyang in Guanzhong, from Gongyue City in the Western Regions to Ryukyu on Treasure Island, all of which can be reached in the game. Across the entire map, it even takes a year in the game, but the huge profit margin will make all the travel worth it. There are a total of 89 kinds of goods in the game, distributed in different cities and regions. The price of commodities will rise and fall with the time in the game. You need to buy low and sell high at the most appropriate time to achieve wealth growth. There will also be random city festivals held in the game. On special days, the prices of some commodities may be the lowest in history! The higher the eloquence attribute in the game, the more discounts and discounts you can get in the bargaining game. Cities of different levels will regularly release the latest demand for business orders. By transporting goods that are in short supply in different places, you can obtain more excess profits than usual. Actively completing business orders and planning trade routes is the secret to getting rich quickly. Every time you complete a business order, you will accumulate very important goodwill, and having enough goodwill is the key to unlocking new city trade licenses. After all, the more goodwill you get, the greater your reputation in the business world, and the more people are willing to do business with you. In the game, you need to form a caravan to have the necessary cargo capacity and transportation capacity for trade. You need buddies to help you carry goods, donkey carts to help you carry out long-distance transportation, and guards to provide armed protection from bandits. Oh, by the way, you may also need some doctors, otherwise the caravan will travel very slowly if you encounter a plague. On the way of trade, there may be various random events, it may be a blessing from the heavens when you pick up the goods, or you may be targeted by pickpockets and lose some silver taels. It is said that there is a talent of family members that can improve our good luck. . When entering different cities, you may also encounter emergencies that require choices. It may be local people asking for help, or it may be a choice made when family and career conflicts. Different options will have different results. Try each The possibilities that these options bring! In the game, you are not only the leader of the trade team, but also the patriarch of a family. When you have a certain amount of savings, you can build a mansion, marry your own spouse, reproduce and educate from generation to generation, and form a huge family with dozens of people. Each family member has the three major abilities of management, eloquence, and charm. You can assign outstanding family members to be the deputy leader of the caravan or the manager of the company to improve the efficiency of trade! Every family member will grow up, get sick, and get old with the passage of time. When a generation passes away, you need to appoint a new generation of heirs to take over the family business and inherit a century-old business. Each person also has an independent appearance system, and having Yi Rong Dan can even change a person's appearance. The family can obtain up to ten family heirlooms, and each heirloom has an extraordinary buff effect, which has a powerful buff to the abilities of family members and caravans. The acquisition of heirlooms is closely related to the number of chief firms. After obtaining heirlooms, you can also upgrade the heirlooms through treasures to make the heirlooms more effective. Treasures only exist in the imperial capital of Chang'an. It is said that treasure merchants wandering on the big map will also sell treasures at a discount. Try to meet him! Each family member also has its own unique talent. Talent is a super ability that will take effect on the whole family. Family members with powerful talents should be cherished. In addition to manual trading in the game, the establishment of a business name is also the main source of funds in the middle and late stages. The business will recruit other caravans to serve you. The higher the level of the business, the more caravans it can recruit and the stronger the caravan's ability. When you feel a little tired from trading, take a break and let the business gather wealth for you. Lost a good choice. Each city can set up a firm, and when the market share exceeds 50%, it will become the chief firm. The legendary family heirloom can be obtained when the chief merchant reaches the specified number. But our competitors may not let our lead firm go smoothly, they may launch business wars from time to time! During the business war, the stronger the family's overall ability, the stronger the company's fighting power, defeat the challenge of competitors, and consolidate our business position! The annual asset changes, annual income and expenditure, the most bought and sold goods, and the most visited places will all be recorded in the data system in the game. The data records your hardships and achievements along the way. When you forge your own trading empire, when you look back at these real records, you must have some emotion!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2101080/header.jpg?t=1677319679",
    "Price": 3.59,
    "Developers": "PandaUpStudio",
    "Publishers": "BD Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2101080/ss_7d9c9caee3c3225ff189756c7288e02baefb76af.1920x1080.jpg?t=1677319679,https://cdn.akamai.steamstatic.com/steam/apps/2101080/ss_9bed2b275f2c14bfad7f7aa820f5d1cc9296ffb2.1920x1080.jpg?t=1677319679,https://cdn.akamai.steamstatic.com/steam/apps/2101080/ss_39d500539b91255898ee2dc0d8361376ed8c768d.1920x1080.jpg?t=1677319679,https://cdn.akamai.steamstatic.com/steam/apps/2101080/ss_25093f33f3e331542d7147aaebe83454b89c428b.1920x1080.jpg?t=1677319679,https://cdn.akamai.steamstatic.com/steam/apps/2101080/ss_e712840a3f7c0e72fde8fe440aa16088fb4c72b6.1920x1080.jpg?t=1677319679,https://cdn.akamai.steamstatic.com/steam/apps/2101080/ss_92ecb95f64df25c5efa0397d0693c00a9f5acf35.1920x1080.jpg?t=1677319679,https://cdn.akamai.steamstatic.com/steam/apps/2101080/ss_1e2e6eda0f3a9b290a3955b19ad92238de21c3bf.1920x1080.jpg?t=1677319679,https://cdn.akamai.steamstatic.com/steam/apps/2101080/ss_734b7835f97e0dfc868dc034cefb2e54e7482893.1920x1080.jpg?t=1677319679",
    "Slug": "east-trade-tycoon",
    "Meta Title": "East Trade Tycoon: Feb 22, 2023, PandaUpStudio and Full O...",
    "Meta Description": "Looking for information on East Trade Tycoon? Check out the release date (Feb 22, 2023), developer insights from PandaUpStudio, and a complete game summ...",
    "Alt Text Image": "Official header image for East Trade Tycoon game - Steam 2101080",
    "Canonical URL": "https://gusku.site/game/east-trade-tycoon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"East Trade Tycoon\", \"description\": \"Looking for information on East Trade Tycoon? Check out the release date (Feb 22, 2023), developer insights from PandaUpStudio, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"PandaUpStudio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BD Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2101080/header.jpg?t=1677319679\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}