{
    "AppID": 2105450,
    "Name": "Flight Level",
    "Release date": "Feb 18, 2023",
    "About the game": "Flight Level is an Air Traffic Control simulator made by real radar controllers to give everyone a chance to experience what the job is like. The game also teaches the core concepts of ATC and lets players work together in multiplayer. Training Campaign In the Training Campaign we teach the player the necessary skills and concepts to safely handle traffic in Area Control and Approach Control and also the principles of how sectors are supposed to work together. Realistic UI The UI of the game resembles the radar position interface used in many centers around the world. Main interaction is done via aircraft labels, which are small UI elements attached to traffic on the radar screen so it is quite clear which label is attached to what aircraft. Also provided are helpful tools for measuring conflicts and analyzing the traffic situation. Simplified interaction One big skill to learn for ATC is radio phraseology i.e talking in the standard way to give clearances etc. To make it simpler for players to learn about ATC we designed the game so that the player just clicks clearances into the labels and hears the clearances given and pilot readbacks. Electronic coordination simulation In modern ATC communication and coordination between sectors is handled by simply interacting with the aircraft labels, sending requests and accepting them via the UI. This is all emulated in the game, but of course, since situations can get awfully complex, expect to use voice communication as well in multiplayer. Multiplayer ATC is one of the most COOP experiences to be had and so no simulation of the job would be complete without working together with other people to safely expedite traffic. Almost all traffic for a position comes from another sector and goes into another. Collaboration with neighbors is often needed to resolve problems in an efficient manner. Weather Taking wind into consideration whilst solving problems is a core part of ATC work and hence different winds at different flight levels are simulated. Another implemented realistic anomaly are thunderstorms, about which the player gets mainly information from the pilots, who request headings to avoid storm cells. Create your own Airspaces and Scenarios The game has a built in Scenario Editor for creating your own challenging single or multiplayer scenarios. Also, adding airspaces is possible and documentation for that is provided with the game. Warning Do not use this product for actual ATC training or in a professional environment. The experience this product provides is an approximation of real ATC work.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2105450/header.jpg?t=1676710152",
    "Price": 19.99,
    "Developers": "Towerhouse",
    "Publishers": "Towerhouse",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2105450/ss_bead41e462460e567a5c23d8d187e59fe8f5928b.1920x1080.jpg?t=1676710152,https://cdn.akamai.steamstatic.com/steam/apps/2105450/ss_99736d32836a30cc551852d59095665af68bddee.1920x1080.jpg?t=1676710152,https://cdn.akamai.steamstatic.com/steam/apps/2105450/ss_8cb178f562bb663a0c3318d46559952e329a93d3.1920x1080.jpg?t=1676710152,https://cdn.akamai.steamstatic.com/steam/apps/2105450/ss_73120176079b97f501f33b3d87cec13b6c50c061.1920x1080.jpg?t=1676710152,https://cdn.akamai.steamstatic.com/steam/apps/2105450/ss_f161fab450fe0b06c53330d8573af66e1b4b2810.1920x1080.jpg?t=1676710152,https://cdn.akamai.steamstatic.com/steam/apps/2105450/ss_e8147dc1cd64b4b1fa2bae75a20d96b7b3eaf50a.1920x1080.jpg?t=1676710152",
    "Slug": "flight-level",
    "Meta Title": "Flight Level: Feb 18, 2023, Towerhouse and Full Overview",
    "Meta Description": "Looking for information on Flight Level? Check out the release date (Feb 18, 2023), developer insights from Towerhouse, and a complete game summary.",
    "Alt Text Image": "Official header image for Flight Level game - Steam 2105450",
    "Canonical URL": "https://gusku.site/game/flight-level",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Flight Level\", \"description\": \"Looking for information on Flight Level? Check out the release date (Feb 18, 2023), developer insights from Towerhouse, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 18, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Towerhouse\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Towerhouse\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2105450/header.jpg?t=1676710152\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}