{
    "AppID": 2244690,
    "Name": "Forest of Frequencies",
    "Release date": "Jan 31, 2023",
    "About the game": "Step into a world where music, magic and nature collide. Forest of Frequencies is a single player music adventure strategy game where you can explore a world filled with dangerous creatures, breath taking flora and spirits looking for their bodies. Music, visual art &amp; gameplay comes together to form a unique experience made for those who love the interplay and combination of art forms. Features Tune into the power of magical frequencies Effect the world around you with music. Search for magical frequencies using a radio to aid you on your journey. Hypnotise enemies, guide souls and defeat hungry hollow husks all through the power of music. Protector of musical spirits The forest is suffering. Musical spirits have become separated from their bodies and have had to go into hiding to avoid predation. Find these spirits and safely guide them back to their bodies. Dangers of the Forest On your journey you will encounter different enemies that all pose a unique danger. Some can be hypnotised by music, some are drawn to music and others will detune your radio. You must come up with a plan to keep you and the spirits safe. Choose your own path Find your own way through the environment. The clearest path might not be the safest one… or the most adventurous. Breath-taking environment The magic of music has not only affected the creatures within the world but the flora as well. Glowing mushrooms and coral like fungi dot the landscape. Lose yourself in this rich environment. About the team Forest of Frequencies was made within 14 weeks by Dapper Pigeon, a team of 16 students without prior game design or development experience. Everything in the game from models to the music has been produced by the team itself. The team would like to thank everybody who helped during the process of developing our game and of course you the players! Can't wait? Whishlist now to be notified as soon as Forest of Frequencies is released!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2244690/header.jpg?t=1675170384",
    "Price": 0.0,
    "Developers": "Dapper Pigeon",
    "Publishers": "Dapper Pigeon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2244690/ss_61b745d0e6b3478060f4503de97e92f88b93cfc1.1920x1080.jpg?t=1675170384,https://cdn.akamai.steamstatic.com/steam/apps/2244690/ss_ceff3d441d2e64e9660853c4fdca18736dbc489b.1920x1080.jpg?t=1675170384,https://cdn.akamai.steamstatic.com/steam/apps/2244690/ss_5169904a7cdb01eda6addee84a2b78a0df621df1.1920x1080.jpg?t=1675170384,https://cdn.akamai.steamstatic.com/steam/apps/2244690/ss_a415e185c212f47bd7d2e26779ef7e0311c6db9f.1920x1080.jpg?t=1675170384,https://cdn.akamai.steamstatic.com/steam/apps/2244690/ss_f9398445070d6af310341714c1a4265469d7c436.1920x1080.jpg?t=1675170384",
    "Slug": "forest-of-frequencies",
    "Meta Title": "Forest of Frequencies: Jan 31, 2023, Dapper Pigeon and Fu...",
    "Meta Description": "Looking for information on Forest of Frequencies? Check out the release date (Jan 31, 2023), developer insights from Dapper Pigeon, and a complete game ...",
    "Alt Text Image": "Official header image for Forest of Frequencies game - Steam 2244690",
    "Canonical URL": "https://gusku.site/game/forest-of-frequencies",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Forest of Frequencies\", \"description\": \"Looking for information on Forest of Frequencies? Check out the release date (Jan 31, 2023), developer insights from Dapper Pigeon, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dapper Pigeon\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dapper Pigeon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2244690/header.jpg?t=1675170384\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}