{
    "AppID": 2302240,
    "Name": "Gallery Manager",
    "Release date": "Feb 17, 2023",
    "About the game": "Game introduction The game is mainly divided into 5 parts: unlocking new items, setting a reasonable visiting time according to the situation, operating the gallery, editing items, and taking visitors to the gallery Unlock items Doing any unlock action costs gold and gives you additional effects. For example, unlocking a new drawing board can increase the ticket fee and attract staff to increase the refresh rate of tourists. Each item has a different unlock cost and different effects. Reasonably arranging the unlocking route is the key to gaining benefits quickly! Edit item It can be edited when the artboard and hologram girl are unlocked. The drawing board can import local pictures, set the length and width, and adjust the ambient light; the holographic girl can switch its actions, character models and colors. Set visit time A steady stream of people come to visit the gallery every day. As an administrator, you need to conduct reasonable analysis and management of the visit data. Setting the visiting time is the main management method. The longer the visiting time is set, the longer visitors will be able to visit the gallery, and the number of tourists will increase but the ticket price will decrease. These data will change as the level increases. Visiting the gallery with tourists You can lead tourists to visit the gallery, each visitor has their favorite drawing board, and you can get extra gold coins every time you take them to visit their favorite drawing board. And evaluate this drawing board according to the quality of the illustrations you import, the clarity of the background, the ambient lighting and many other aspects. Introduction to game mechanics The game has a high degree of freedom, and a large number of items can be customized and edited, such as menu music, game music, and pictures on the drawing board. As soon as the game comes out, only 5 artboards can be edited, and you will act as the manager to manage the gallery. Set a reasonable visit time according to different levels, charge visitors an entrance fee or lead them around to get extra tips to grow your gallery. As the game progresses you will unlock more and more artboards, recruiting more workers to work on your gallery. Come and build your exclusive gallery!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2302240/header.jpg?t=1676705047",
    "Price": 1.21,
    "Developers": "joker",
    "Publishers": "joker",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2302240/ss_d7fb582cecc8ec817ed13dc2473b9bb8d2973eea.1920x1080.jpg?t=1676705047,https://cdn.akamai.steamstatic.com/steam/apps/2302240/ss_8f56ad65e25b538e3d40f81e6a11537a44becae4.1920x1080.jpg?t=1676705047,https://cdn.akamai.steamstatic.com/steam/apps/2302240/ss_871e6d5969fa71732e3fdab7a4023328758584ce.1920x1080.jpg?t=1676705047,https://cdn.akamai.steamstatic.com/steam/apps/2302240/ss_575fff789472044aab56daf9fcc719d132814fee.1920x1080.jpg?t=1676705047,https://cdn.akamai.steamstatic.com/steam/apps/2302240/ss_9e48a55713770e8710d7c03b41fa87971e411467.1920x1080.jpg?t=1676705047,https://cdn.akamai.steamstatic.com/steam/apps/2302240/ss_180716d16a1cc0d3cfb5466e15659d13d6fc8200.1920x1080.jpg?t=1676705047",
    "Slug": "gallery-manager",
    "Meta Title": "Gallery Manager: Feb 17, 2023, joker and Full Overview",
    "Meta Description": "Looking for information on Gallery Manager? Check out the release date (Feb 17, 2023), developer insights from joker, and a complete game summary.",
    "Alt Text Image": "Official header image for Gallery Manager game - Steam 2302240",
    "Canonical URL": "https://gusku.site/game/gallery-manager",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gallery Manager\", \"description\": \"Looking for information on Gallery Manager? Check out the release date (Feb 17, 2023), developer insights from joker, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 17, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"joker\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"joker\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2302240/header.jpg?t=1676705047\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.21, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}