{
    "AppID": 2078830,
    "Name": "奇谭文字游戏",
    "Release date": "Feb 9, 2023",
    "About the game": "In advance, this game is very rough, because it is a 40-year-old uncle who painted and made it in his spare time. My game is free, but I don't want to waste your precious time. I tell you that the game is very rough and I don't want to waste your precious time. This year, there are not many people who are as kind as me. So, players, play carefully! The game is a word game I made for my friends. If you do not like word games, it is not recommended to play. Even word games are inferior. This game requires you to have a certain interest in Chinese culture, including word games, such as [couplets, poems, crossword puzzles...] and so on. For example, in the game, if you choose the wrong branch, you will exit the game [if you choose the wrong branch, you will be required to accept a certain [punishment] according to your identity as the anchor and player, such as [drink] (not real drink), or Say yourself a little fool once. A dialog box will pop up in the game, asking you to answer [original content], and then please paste your [answer, that is, your original poems, songs, couplet riddles] in the comment area, so that I can also learn. Therefore, this game generally does not accept the so-called 'positive, negative' your original answer, which is what the author wants to see in the comment area. [In particular, due to the level of the author, most of the game does not include tone. For those who have higher requirements for tone, or text level, please do not play!!] [This game is painted by myself!] Everything is entertainment, everything is to spread, Chinese culture. My talent and learning are shallow. The various settings of the platform make me, a 40-year-old uncle, racking my brains for the first time. If your game crashes, or where There is a problem. That must be my reason. I apologize for making it for the first time. Well, why do I play this word game? What for? 1： It is to give a Tianjin elder brother of mine, and let him, as well as some of my anchors, players, and hateful cloud players with low cultural level and low cultural aesthetics, to popularize culture. Second, to put it bluntly, most of the so-called national customs at present have only their appearance, but no soul. [Wearing Hanfu, with internal and external bones], I hope this garbage game can give you a little bit, a little bit of the soul of Chinese culture. [Third, it's my personal burden, [spreading Chinese characters] Apologize to all players in advance, game garbage, don't expect",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2078830/header.jpg?t=1675949161",
    "Price": 0.0,
    "Developers": "勤奋的小德",
    "Publishers": "勤奋的小德",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2078830/ss_28319ca2e3a1a1fc60fbcb4904c0ce12d063076f.1920x1080.jpg?t=1675949161,https://cdn.akamai.steamstatic.com/steam/apps/2078830/ss_b88c27460bca69f42b72156105beb806bbbf89bf.1920x1080.jpg?t=1675949161,https://cdn.akamai.steamstatic.com/steam/apps/2078830/ss_cf3f2728a7923eada620029ef42c6ae8d063f071.1920x1080.jpg?t=1675949161,https://cdn.akamai.steamstatic.com/steam/apps/2078830/ss_ac2193e4ac43aedd192e493821b19b43d1dc0f6d.1920x1080.jpg?t=1675949161,https://cdn.akamai.steamstatic.com/steam/apps/2078830/ss_a6d1109917080fc842d3d3a8e1aec1bc2248aa5e.1920x1080.jpg?t=1675949161,https://cdn.akamai.steamstatic.com/steam/apps/2078830/ss_8596889299a2100d81038886a91e6a94b58a0afa.1920x1080.jpg?t=1675949161",
    "Slug": "",
    "Meta Title": "奇谭文字游戏: Feb 9, 2023, 勤奋的小德 and Full Overview",
    "Meta Description": "Looking for information on 奇谭文字游戏? Check out the release date (Feb 9, 2023), developer insights from 勤奋的小德, and a complete game summary.",
    "Alt Text Image": "Official header image for 奇谭文字游戏 game - Steam 2078830",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5947\\u8c2d\\u6587\\u5b57\\u6e38\\u620f\", \"description\": \"Looking for information on \\u5947\\u8c2d\\u6587\\u5b57\\u6e38\\u620f? Check out the release date (Feb 9, 2023), developer insights from \\u52e4\\u594b\\u7684\\u5c0f\\u5fb7, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 9, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u52e4\\u594b\\u7684\\u5c0f\\u5fb7\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u52e4\\u594b\\u7684\\u5c0f\\u5fb7\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2078830/header.jpg?t=1675949161\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}