{
    "AppID": 2300040,
    "Name": "Gangster City: Mafia Car Driving",
    "Release date": "Feb 12, 2023",
    "About the game": "Be a gangster and take the mafia safely to their destination in this car game. The mafia boss gives you big rewards for every job you do and allows you to customize your car better with these rewards. Complete all the missions without making the mafia boss wait by quickly passing by other vehicles in the traffic in gangster city. The most successful mafia games are easy to play and have good graphics. The excitement in the games is excellent, and you feel like a gangster mafia. One of the most critical factors is to be a gangster. You have to develop yourself as a gangster mafia and customize the car you drive. This game can also be passed as a gangster city game. The game aims to drive the car as a gang member and take the mafia boss to certain places at certain times. The essential factor of people in this mafia game is always plus points for their work on time. The most popular mafia games of recent years receive a prize from the mafia boss for doing the specified tasks. Apart from this, the mafia city can also be located in different city centers. You will feel you as a mafia family in this mafia game. You can have a pleasant time in the gangster mafia game with great graphics. The mafia in the game is to take the big mafia boss requested from you to the specified areas in a short time with the car. There are four cameras in the mafia car, so you can see your surroundings better while driving as a gangster. With the help of these cameras, it is possible to enjoy the mafia game more. While going through traffic, you can see the cars coming around you and passing by them. Using the cameras, you can take the mafia boss to his destination faster and more safely. The mafia king gives you many rewards for this task, and you can customize the gangster car with this reward. Car driving is exhilarating because it is a 3D simulation system. That's why users in gangster mafia do not understand how time passes. The simulation quality of this game has been made to be above specific mafia game standards. Especially since the car is produced in 3D during the design, the inside or outside of the cars can be seen very clearly. The most important thing for this is the car simulator. If you run out of gas while driving a gangster car, you must go to the gas station with the mafia boss. You can continue your duty by getting mafia car petrol from the gas station. Before starting the mission, you can fill your fuel before you begin the mafia king so as not to keep you waiting on the road. This way, the mafia will not wait too long, and you can get your reward earlier. In this real gangster game, if you crash into other cars in the traffic while driving your vehicle, you have to get your car repaired without going to the mafia. You can get your car repaired by collecting repair kits in certain areas in gangster city. In terms of content, the mafia game dazzles with different graphic designs. Therefore, people continue to play without getting bored. In this game, the mafia boss is taken from specific addresses and left at certain addresses. By making gangster car drive, he must go the boss to the areas. There are various products inside the car. Since it is produced at a very high level in terms of visuals, it is carried out with car 3d technology. With these features, you will enjoy the mafia game better.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2300040/header.jpg?t=1676228152",
    "Price": 0.84,
    "Developers": "Yusuf Islam Seyhan,Samet Acar",
    "Publishers": "Inspector Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2300040/ss_fd7e6415e702d0a8febd416d253ae45225808c9b.1920x1080.jpg?t=1676228152,https://cdn.akamai.steamstatic.com/steam/apps/2300040/ss_309e475657d9ffcb4cfc2ec963eea6fac4b5da35.1920x1080.jpg?t=1676228152,https://cdn.akamai.steamstatic.com/steam/apps/2300040/ss_224f46ae4f3d63408af64e05077674b9789d7c1a.1920x1080.jpg?t=1676228152,https://cdn.akamai.steamstatic.com/steam/apps/2300040/ss_fcf63df3f9750c202e16fb25c821b632661b5724.1920x1080.jpg?t=1676228152,https://cdn.akamai.steamstatic.com/steam/apps/2300040/ss_769c707770db186a2de6f3c136a746ead2ea419a.1920x1080.jpg?t=1676228152",
    "Slug": "gangster-city-mafia-car-driving",
    "Meta Title": "Gangster City: Mafia Car Driving: Feb 12, 2023, Yusuf Isl...",
    "Meta Description": "Looking for information on Gangster City: Mafia Car Driving? Check out the release date (Feb 12, 2023), developer insights from Yusuf Islam Seyhan,Samet...",
    "Alt Text Image": "Official header image for Gangster City: Mafia Car Driving game - Steam 2300040",
    "Canonical URL": "https://gusku.site/game/gangster-city-mafia-car-driving",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gangster City: Mafia Car Driving\", \"description\": \"Looking for information on Gangster City: Mafia Car Driving? Check out the release date (Feb 12, 2023), developer insights from Yusuf Islam Seyhan,Samet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 12, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Yusuf Islam Seyhan,Samet Acar\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Inspector Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2300040/header.jpg?t=1676228152\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.84, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}