{
    "AppID": 2127100,
    "Name": "Grappling Dash",
    "Release date": "Jan 27, 2023",
    "About the game": "Jump, Swing, Dash Grappling Dash is fast-pace, uniquely stylized platformer game. Use your grappling hook to swing around in giant levels, dash through energy crystals, find hidden secrets and master even the most difficult worlds. Play in free style or against the timer with one or two grappling guns and finish more than 10 enormous levels by dodging obstacles and deadly traps. It’s easy to play, it’s fast and it’s fun. - Gameplay - You start the game in the middle of a giant city surrounded by skyscrapers. You look around and see a giant poster that explains the general movement. This way you learn that you are able to dash while being in the air. You also realize that you have a grappling gun in your hand and see floating crystals above your head. You aim at the crystals and use your grappling gun to hook onto them. Once hooked you start swinging and swing towards the next crystal. You hook on to the next crystal and have already mastered the main movement mechanism. After a couple of hooks, you realize that you can change your swinging direction and speed by dashing into the wanted direction. This is the second important thing to learn about the movement and gives you a lot of freedom in your movement. Soon you will reach the next giant poster which explains further movement patterns that you can use to improve your precision and movements. You learn that you can remove your grappling hook, use an in-air dash and then hook on to the next floating crystal to build up speed and energy. You can use this energy to collect hidden achievements, dash through activator crystals, that unlock new areas o the level, or speed run levels later on. Furthermore, you realize that the dash refreshes every couple of seconds which leads to an incredibly fast and satisfying movement once you are able to master it. The game mechanics might sound simple at first but it is a lot of fun just playing around with it and is super juicy and satisfying once you get the hang of it. In order to ease the player into the game, we also gave the option to play with 2 grappling guns (instead of 1) while advanced players can use the speed run mode and race against the clock. At its current state, the game features 12 different giant levels with different themes and difficulties in each of them. Later on new obstacles, traps, moving crystals, hidden secrets, exciting shortcuts, enemies, and many more are introduced.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2127100/header.jpg?t=1674831394",
    "Price": 7.99,
    "Developers": "EpiXR Games UG",
    "Publishers": "EpiXR Games UG",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2127100/ss_d53798971d81c0529762d9000cde26c80050faab.1920x1080.jpg?t=1674831394,https://cdn.akamai.steamstatic.com/steam/apps/2127100/ss_cc5b7c5b4e68ca8405b0ca01d93d24b667a6e6c2.1920x1080.jpg?t=1674831394,https://cdn.akamai.steamstatic.com/steam/apps/2127100/ss_a47f88f5947baa8306a8c1b7b1cf1e9d6d221bbd.1920x1080.jpg?t=1674831394,https://cdn.akamai.steamstatic.com/steam/apps/2127100/ss_f1af06a27c9b39405ca7ba9f401dba11cbb30e0d.1920x1080.jpg?t=1674831394,https://cdn.akamai.steamstatic.com/steam/apps/2127100/ss_c541df484afd2978bf31897e5134aa54b8ca3727.1920x1080.jpg?t=1674831394,https://cdn.akamai.steamstatic.com/steam/apps/2127100/ss_001abb5c9faeab5de91844b7b450082e3c37fff9.1920x1080.jpg?t=1674831394,https://cdn.akamai.steamstatic.com/steam/apps/2127100/ss_a47f88f5947baa8306a8c1b7b1cf1e9d6d221bbd.1920x1080.jpg?t=1674831394",
    "Slug": "grappling-dash",
    "Meta Title": "Grappling Dash: Jan 27, 2023, EpiXR Games UG and Full Ove...",
    "Meta Description": "Looking for information on Grappling Dash? Check out the release date (Jan 27, 2023), developer insights from EpiXR Games UG, and a complete game summary.",
    "Alt Text Image": "Official header image for Grappling Dash game - Steam 2127100",
    "Canonical URL": "https://gusku.site/game/grappling-dash",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Grappling Dash\", \"description\": \"Looking for information on Grappling Dash? Check out the release date (Jan 27, 2023), developer insights from EpiXR Games UG, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 27, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"EpiXR Games UG\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"EpiXR Games UG\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2127100/header.jpg?t=1674831394\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}