{
    "AppID": 1946010,
    "Name": "I'm looking for 3024 people",
    "Release date": "Feb 3, 2023",
    "About the game": "The dead computer engineer (Frank) had only one purpose, to reveal the true face of the company he worked for. Now, this mission is up to a hacker (anonym52) and 3024 people. I'm looking for 3024 people is an alternate reality game developed by Bakodun Game Studios. In this adventure; you will have to infiltrate Grebi Interactive Corp. using a hacking program, examine the leaked documents, and monitor the live cameras. You can download the game now and infiltrate the company. You will be involved in a horrific experiment conducted within the company. You will control a human subject who cannot see. So you won't see anything either. You have to act on what you hear. You can only finish the game by following the directions that you hear. You must get the subject man out of his confinement as soon as possible. You can't finish this game just by downloading and playing. You must understand the mission and act accordingly. Our main goal in the game is to complete the 3024 slot process and reach the Special Area page. This way, new information can be obtained from within the company and we can move on to the next stage. For this, you will first need to choose a slot from Frank's Computer Online website. Then you will enter the game and find the 3-digit code corresponding to your slot. When you find this code, you will need to enter the Discord server and perform your slot process. Participating in the blind experiment is just one of the parts of the game, and it's not enough by itself to finish the story. The story takes place in today's alternate reality, it is taking shape on Frank's Computer Online website and Discord. By visiting these places without downloading the game, you can help solve puzzles together with the community and dive deeper into the story. Once you have all the information, you will have to re-enter the game and follow a different way. The blind experiment is a single-player game. But in Discord puzzles, you have to move together with other players. You will join a different multiplayer experience. In 1974, Frank, who graduated from the computer engineering department, was very excited when he started his first job at a technology R&amp;D company. But two years later, what he realized inside the company would change his whole life. The technology developed in this place was not for the benefit of people. People were being slaughtered here for the brutal pleasure of other people. Frank immediately quit his job as soon as he realized this. In the later part of his life, he tried to expose this company. By 1996, Frank was still working on exposing this company. The most important thing he found; was the discovery of 3024 ports (slots) that could infiltrate the company. But he will not be able to continue this because he has been diagnosed with pancreatic cancer. For this, he uploaded all the documents he obtained to the internet and hoped that someone would reach them. In 2002, these documents were found by a hacker with the nickname anonym52. In 2022, anonym52 put the documents Frank obtained until 1996 and the documents they have obtained so far on Frank's Computer Online website. They could now complete Frank's unfinished mission. But anonym52 would not be able to undertake this big mission alone. For this, they need 3024 more people. We're making a comic book about Frank's story from his departure from the company to 1996. You will be able to witness what Frank went through that night, his adventurous departure from the company, and how he secretly followed the company for these 19 years. We will share it with everyone for free when it is ready. The game development process took 1,5 years. Sticking to the alternate reality genre, we created an interactive story with the real world. While doing this, we also added people, stories, and locations from real life. We also presented our mysterious posters about the fictional company Grebi Interactive Corp. with #realgrebi hashtag on outdoor signs. You will be in a parallel story connected with the world you live in.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1946010/header.jpg?t=1675518351",
    "Price": 17.99,
    "Developers": "Bakodun Game Studios",
    "Publishers": "Bakodun Game Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1946010/ss_79de3706041d8caa27239c7a23ac846c995f5d5a.1920x1080.jpg?t=1675518351,https://cdn.akamai.steamstatic.com/steam/apps/1946010/ss_03189b1084e389cf17bc538fce3e63b6938da640.1920x1080.jpg?t=1675518351,https://cdn.akamai.steamstatic.com/steam/apps/1946010/ss_b80d2ca79a944a693073c2032d31791013e1944a.1920x1080.jpg?t=1675518351,https://cdn.akamai.steamstatic.com/steam/apps/1946010/ss_7431bd2b0a453ce7aef5713f775d5ef9b8e7c428.1920x1080.jpg?t=1675518351,https://cdn.akamai.steamstatic.com/steam/apps/1946010/ss_e3cbd763302b78d345e009a13880dd23f672f02a.1920x1080.jpg?t=1675518351,https://cdn.akamai.steamstatic.com/steam/apps/1946010/ss_b0d68ddb3977300732cc6e726d71a7ecd28aba67.1920x1080.jpg?t=1675518351",
    "Slug": "i-m-looking-for-3024-people",
    "Meta Title": "I'm looking for 3024 people: Feb 3, 2023, Bakodun Game St...",
    "Meta Description": "Looking for information on I'm looking for 3024 people? Check out the release date (Feb 3, 2023), developer insights from Bakodun Game Studios, and a co...",
    "Alt Text Image": "Official header image for I'm looking for 3024 people game - Steam 1946010",
    "Canonical URL": "https://gusku.site/game/i-m-looking-for-3024-people",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"I'm looking for 3024 people\", \"description\": \"Looking for information on I'm looking for 3024 people? Check out the release date (Feb 3, 2023), developer insights from Bakodun Game Studios, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 3, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bakodun Game Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bakodun Game Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1946010/header.jpg?t=1675518351\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}