{
    "AppID": 2061150,
    "Name": "Ikki Unite",
    "Release date": "Feb 14, 2023",
    "About the game": "*** Guide to “Ikki Unite” *** “You can’t riot with just one or two people!” The legendary “bad game” that once had people scoffing is back, and this time it’s time to unite! It’s the autumn harvest, a time to rejoice in the fruits of labor, but a swarm of locusts ravage the land! The village is in trouble, and yet the collectors still demand taxes… So let’s start a rebellion and get our rice back, and protect our village! This time we aren’t alone! It’s time to “Ikki Unite” with up to 16 people! It’s the MOST CASUAL of ONLINE COOP games with simple controls and satisfying gameplay! Cooperate and dodge bullets to defeat the enemies, and collect items. Head towards the Daikan Yashiki! This is roguelike action…but united! *** Game Introduction *** [Target] Defeat the Boss of each area, then beat the final boss...the Evil Magistrate! [Controls] - Arrow keys only. (Attacking and skill activation are automatic) [Features] 1: Action-packed Defeat swarms of enemies and bosses with easy controls! 2: 16 Player Co-op Introducing four different character types; Exploration, Offense, Enhancement and Recovery! Work together to become more and more powerful! Gonbe: An agreeable youth with a strong sense of justice, whom Koshimoto has taken a liking to. Tago: This calm and gentle man attacks with sickles, just like in the stories! Tanba: Will the others accept his ilk into the fold? A ninja of keen skill and keen eyes joins the cause! Bonze: This priest's scary face belies a kind heart. Here to support his comrades. Shirou: Here to back up comrades with the power of prayer! That charisma of his is alive and well! Heihachiro: He's taking a stand for those suffering from tax collection! He'll use his kusarigama to muscle through the opposition! Yojimbo: A bodyguard with a mysterious patron. A successful Ikki means a well paid Yojimbo?! Hideyori: A daimyo himself is joining the fray?! He can take command to power up his comrades! Kunoichi: A female ninja who fights elegantly! Overpower enemies with her ninja skill of cloning herself! Magoichi: The legendary gunman has arrived! He can also use katanas. Yosaku: A strong stout fellow, a trusty comrade to Gonbe and the crew. Goemon: Where there is money, there shall be Goemon. One of the greatest thieves of the land, he's great at collecting money. Minstrel: A songstress of the battlefield, sparking inspiration in her comrades through her singing. The tones of her shamisen strike fear in the hearts of enemies! Onmyoji: Study a lot to become a master in Onmyodo! Annihilate your enemies with the mysterious power of Yin and Yang and the five elements! Medicine Man: He's good with medicine, for healing and for more, shall we say, dubious uses...Support your comrades with the special concoctions! Koshimoto: Her love for Gonbe knows no time limit! She shall protect with the passion she accumulated for 38 years. 3: Roguelike Elements It unfolds differently every time you play! The game that can be played over and over again. *** Featured Points *** Above all, this time we can play co-op with 16 people online! Invite your friends to join your team! We are stronger together than alone! But playing with strangers online can be a bit awkward sometimes... We, the development team, have felt the same way before as well. So we introduced the Emote button! With this button, we can check where everyone is, as well as read the room. The exhilaration of defeating a lot of enemies together will be sure to 'qu-ikki-ly' captivate you! This is the true UNITED ROGUELIKE ACTION! We were so close to clearing the game... I could have helped them if I had just a bit more time... We were so close to meeting up with the other group... If you find you keep asking youself, 'Is everyone keeping up with me?', you might have turned into a Ikki Unite-holic. *** Game Flow *** [Start of Game] 16 players will be divided into 4 random groups! Run, run and run some more to meet up! Let's take enemies down together, united as one! [Shop] Enhance your character and equipment! When you defeat enemies, they drop money. When you collect enough money, a store will open. In the store, characters can choose a power-up to enhance their equipment. Stores include the Blacksmith,Tea House, and General Store. [Boss Battles] Once your character gets stronger, find and defeat the boss before the time limit expires! The time limit will be restored once the boss is defeated. The game is cleared when the Evil Magistrate is finally defeated. *** Tips *** i) Be careful of your position. All attacks and skill activations are automatic, so let's focus on moving your character. The best position is where your attacks reach the enemy but the enemy can't reach you! ii) Don't wander too far from your allies. Use the mini-map as a guide when traversing the map. During boss fights, it is more effective to attack from near your allies! Let's run, gather and meet up with all 16 players to defeat the final boss, the Evil Magistrate! iii) Helping each other. Revive your allies! Even if your allies go down, you can rescue them by standing on top of their cage for a few seconds. Check the mini-map every now and then so we know what's going on with our allies! *** What's an 'Ikki' in the first place? *** 'Ikki'* is a thrilling period drama game SUNSOFT released in Japan in 1985 for Famicon. It's one of SUNSOFT's classic retro games, which came to be known as the original 'bad game' due to the fact that the game had you start an uprising...with only one or two people(players). *Ikki means 'uprising' in Japanese. *** What's this 'SUNSOFT is back!' deal about? *** 'SUNSOFT is back!' points to the announcement we made in August of 2022 , stating we are making a comeback in this new generation! We SUNSOFT, a long-established video game brand known for its original 'bad games' such as 'Atlantis no Nazo' and 'Ikki', is returning to the video game scene.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2061150/header.jpg?t=1676426528",
    "Price": 7.19,
    "Developers": "SUNSOFT",
    "Publishers": "SUNSOFT",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2061150/ss_ed56f9c15b1b0f6709f80d80f3219798b9639e87.1920x1080.jpg?t=1676426528,https://cdn.akamai.steamstatic.com/steam/apps/2061150/ss_60c1f4dde1a1776b97c475bc5b4009db29497310.1920x1080.jpg?t=1676426528,https://cdn.akamai.steamstatic.com/steam/apps/2061150/ss_ed630e4e78a1fe29aa3465b601d31a4f898b558c.1920x1080.jpg?t=1676426528,https://cdn.akamai.steamstatic.com/steam/apps/2061150/ss_22cbd096ebc9e53c2699aef0a4ef2159f3499f1b.1920x1080.jpg?t=1676426528,https://cdn.akamai.steamstatic.com/steam/apps/2061150/ss_70970b77dddc281bdc49d4e3bda0d0ed3228757b.1920x1080.jpg?t=1676426528",
    "Slug": "ikki-unite",
    "Meta Title": "Ikki Unite: Feb 14, 2023, SUNSOFT and Full Overview",
    "Meta Description": "Looking for information on Ikki Unite? Check out the release date (Feb 14, 2023), developer insights from SUNSOFT, and a complete game summary.",
    "Alt Text Image": "Official header image for Ikki Unite game - Steam 2061150",
    "Canonical URL": "https://gusku.site/game/ikki-unite",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ikki Unite\", \"description\": \"Looking for information on Ikki Unite? Check out the release date (Feb 14, 2023), developer insights from SUNSOFT, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 14, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"SUNSOFT\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SUNSOFT\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2061150/header.jpg?t=1676426528\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}