{
    "AppID": 1761600,
    "Name": "JETT: The Far Shore + Given Time",
    "Release date": "Jan 31, 2023",
    "About the game": "JETT: The Far Shore + Given Time JETT: The Far Shore releases on Steam in early 2023, including the all-new free expansion Given Time. Download the JETT demo now and embark on an interstellar trip to carve out a future for a people haunted by oblivion. An ambitious, cinematic and unorthodox science fiction adventure from Superbrothers, co-creator of Superbrothers: Sword &amp; Sworcery EP (2011). 'Between the environmental tilt, invented rituals, and fictional topolect, Jett: The Far Shore recalls the gently radical fiction of Ursula Le Guin.' -WIRED FEATURING EMBARK on an exploratory single player adventure presented in five captivating acts encompassing monumental moments, laid-back exploration, occasional white-knuckle action, moments of heartfelt companionship, with a dollop of existential dread. SOAK in a sea of music and immersive audio with a breathtaking score by Scntfc and sound bolstered by A Shell In The Pit and Priscilla Snow. Featuring the song 'Out Of My Hands' by Jim Guthrie. DEPLOY to the surface of a mythic ocean planet: skim up undiscovered coastlines, inspect indigenous flora and fauna, adapt to new perils, and problem-solve tough obstacles using your jett's array of scientific tools.' INVESTIGATE the source of 'the hymnwave', an interstellar invitation that propelled a people to look beyond their troubled skies and across the sea of stars, for salvation RENDEZVOUS at 'Ground Control' and get to know fellow scouts in relaxed first-person sequences, as the scouts struggle together to satisfy Jao's directives and be absolved. ENDURE hardships, evade pursuers and grapple with massive 'kolos' creatures by out-pacing or out-smarting adversaries and navigating hazards. DELVE DEEPER to explore an expansive mysterious world where the open-world immersive sim elements linger on the horizon. THE FAR SHORE - THE ORIGINAL 2021 CAMPAIGN - SYNOPSIS Step into the snug space boots of jett scout Mei and take your leave of everyone and everything you've ever known, then traverse deep space while in torpor in The Far Shore's memorable prologue '0. Embark'. &lt;&lt; STEAM DEMO AVAILABLE A thousand years later, be the first to explore a mythic ocean planet in the feature-film length episode 'I. Deploy'. Take the helm of a jett and explore a vast unknown. Skim low over waves, roar up pristine coastlines and carve through otherworldly woods. Learn to take shelter and work together with fellow jett scouts to survive encounters with local hazards and looming 'kolos' in order to establish a secure foothold for your scout unit. The Far Shore's narrative heart and JETT's wild-eyed science fiction ambitions are laid bare in 'II. Investigate' when the assembled jett scout unit gathers on Tsosi Massif to seek out the source of an interstellar siren song known as 'the hymnwave' beneath the mantle of Tor, a vast solemn cone. Story threads are introduced here, some of which are left intentionally dangling by the end of the 2021 campaign. In a multi-hour segment of the experience, in the aftermath of a series of cosmic revelations, Mei and the scouts are tasked with getting familiar with an intricate, systemic open world in 'III. Adapt' while they explore islands beyond Tsosi Massif, to Ozu and beyond. There's some significant adversity for the scouts to push through in 'IV. Persevere' as Mei sets out alone in a desperate bid to salvage some hope to bring this story of courage, wonder and regret to its interim conclusion. GIVEN TIME - THE NEW 2023 CAMPAIGN - KNOWN INFO Given Time takes place 3 years after the events of the original campaign's ending, as Mei arises from torpor into Ground Control, which is still in hibernation with only one other scout awake, and a weathered jett awaiting outside. “We’re thrilled to have another JETT campaign to offer. Given Time will continue and conclude Mei's story, while progressing and resolving key story threads that were left intentionally dangling at the end of The Far Shore.” said co-creator Craig D. Adams from Superbrothers A/V. “This new campaign is much more free-roaming and player-driven, we're getting more out of our distinct ecosystem-puzzling and light survival systems this time out, but not to worry, we aren't shy about having some cosmic prog rock spectacle in unexpected places.' CREATORS / ORG JETT was created by Superbrothers A/V + Pine Scented with songs and sounds by scntfc, and it was bolstered and sharpened by JETT Squad. This moonshot of a DIY videogame and universe was quietly developed principally by two people with a composer/sound designer from 2013 to 2018. From 2019 to 2021 this vision took shape with the help of PlayStation and Epic, and it was delivered upon with the help of an all-star squad of contributors working through COVID times in timezones around the globe, with personnel including C Andrew Rohrmann (Oxenfree), Randy Smith (Looking Glass Studio, Thief series), Sam Bradley (Don't Nod), Priscilla Snow (Half Mermaid, IMMORTALITY), Flaminia Grimaldi (Wheels of Aurelia), Terri Brosius (Looking Glass Studio, voice of SHODAN), Jim Guthrie (Superbrothers: Sword &amp; Sworcery EP, Below), A Shell In The Pit (Rogue Legacy 1+2), Dustin Harbin, Skymap Games and others. To hear about JETT Squad 1.3 and Given Time's production, wishlist/follow the project and keep an eye on the newsfeed.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1761600/header.jpg?t=1675263557",
    "Price": 17.99,
    "Developers": "Superbrothers,Pine Scented",
    "Publishers": "Superbrothers",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_dae7f89e79dcdd3b5f394d59b93f6524ff022688.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_882d9cdb61b00114fc2a97f977c31615a4aedd26.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_5625672498af3934801c3e31e92f5f6383b3ced9.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_f437ed0e511c4d60cea0866b36b1c85d662afab8.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_e75c6bf342e4ac7d15f394c4e3f17afee046796f.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_530bf90a2ec3964a80a4dc2b5544ed428be7d5ee.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_ed0c2fef15d2081829fa3f740fb9e813e006e234.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_4f33d332705a1922b9a1c7e9724a5b04d9aaf925.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_f5cdd2c6da0dd43af7dc9b84cc48f7a874e935d3.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_936475d78bf6d60c6dabf8bd50de7cd392dc7b1e.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_5c55c4a13ebe85bcd6398a08c338c17529a73cb6.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_a9daf31b999da2ac71cd0c0a1e5000dfb2eecfcb.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_5aae414a610ef7651cc881eb0b68573bf84744ec.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_cd7adc0726053cc76774cd493f42c4dbfe180253.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_fa95cf8ffd62d5e84f1bf6cda8e5517e322fefe7.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_425817be4092ee342f48c92a1fbd4fcb3cc76684.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_fadc292e8aaf60381f2e0368653e48e1413629e2.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_293a62e7f016cbede09e0d16d7463e141fa55ae2.1920x1080.jpg?t=1675263557,https://cdn.akamai.steamstatic.com/steam/apps/1761600/ss_ec093fc6d6d683a9d2207e204a68f5fa1cc11d8a.1920x1080.jpg?t=1675263557",
    "Slug": "jett-the-far-shore-given-time",
    "Meta Title": "JETT: The Far Shore + Given Time: Jan 31, 2023, Superbrot...",
    "Meta Description": "Looking for information on JETT: The Far Shore + Given Time? Check out the release date (Jan 31, 2023), developer insights from Superbrothers,Pine Scent...",
    "Alt Text Image": "Official header image for JETT: The Far Shore + Given Time game - Steam 1761600",
    "Canonical URL": "https://gusku.site/game/jett-the-far-shore-given-time",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"JETT: The Far Shore + Given Time\", \"description\": \"Looking for information on JETT: The Far Shore + Given Time? Check out the release date (Jan 31, 2023), developer insights from Superbrothers,Pine Scent...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Superbrothers,Pine Scented\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Superbrothers\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1761600/header.jpg?t=1675263557\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}