{
    "AppID": 2275820,
    "Name": "Kitchen Chaos",
    "Release date": "Jan 30, 2023",
    "About the game": "Wishlist my Upcoming Steam game! / NOTE: This is a learning project. This is the final game created by following my FREE YouTube course. The customers are hungry, it's up to you to fill them up! Pick up some ingredients, prepare them, put them on a plate and deliver them. Work with the various counters to prepare them. Pick up a full Cheese block, cut it into slices, then cook a Meat Patty (but don't let it burn!), pick them up on a Plate, add some Bread and you have a nice burger! Features: - 7 Ingredients to use - 3 Complete Recipes to create - 6 unique Kitchen Counters to interact with ----------------------------------------------- Watch the full FREE course video to learn how to build this game step-by-step starting completely from scratch over 45 Lectures. If you're a complete Beginner or a more Intermediate user you will learn a lot from following this course. The quality of the code in this course is on the same level as my own games, so you will learn how to make games just like a Professional Indie Game Developer using clean code and good project architecture. You will learn the basics of Unity and C#, how to make a Character Controller and detect Collisions. How to do Physics Raycasts, use C# Interfaces and Events. How to use Scriptable Objects, Shader Graph, build a UI and tons more! Everything we're going to do is going to be focused on writing good easy to understand clean code. Meaning that I will not be teaching you bad practices that some beginner tutorials teach. The code that we're going to write here is production quality code , it is not a throwaway demo. The quality of the code and the structure of the game that we're going to build is on the same level of quality as my own Steam games Like I said this is a completely FREE course but it has the same level of quality as my paid courses. Check it out on my YouTube channel. Multiplayer free course expansion coming soon! About me: I've been an Indie Game Developer for over 10 years and 5 years ago I started the Code Monkey YouTube channel to share my knowledge to help you learn how to make your own games. Check out my games on Steam and then watch my YouTube channel to see how I made them! For some interactive learning check out my Free Code Monkey App /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2275820/header.jpg?t=1675101563",
    "Price": 0.0,
    "Developers": "Endless Loop Studios,Code Monkey",
    "Publishers": "Endless Loop Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2275820/ss_559dc9be443e853272ef45de73fbfe0f12942edd.1920x1080.jpg?t=1675101563,https://cdn.akamai.steamstatic.com/steam/apps/2275820/ss_524cb04beeba54d31371f3ab7248a5c3fa3d1f97.1920x1080.jpg?t=1675101563,https://cdn.akamai.steamstatic.com/steam/apps/2275820/ss_7dfb8c12b306c621ccfdecf79f3b37b3e5e9967c.1920x1080.jpg?t=1675101563,https://cdn.akamai.steamstatic.com/steam/apps/2275820/ss_0371db34a7ad7d379b7f8278d7ba6d44e7a1b49c.1920x1080.jpg?t=1675101563,https://cdn.akamai.steamstatic.com/steam/apps/2275820/ss_872ca7604865c2303adef48a1ef0ea176b12c2a5.1920x1080.jpg?t=1675101563",
    "Slug": "kitchen-chaos",
    "Meta Title": "Kitchen Chaos: Jan 30, 2023, Endless Loop Studios,Code Mo...",
    "Meta Description": "Looking for information on Kitchen Chaos? Check out the release date (Jan 30, 2023), developer insights from Endless Loop Studios,Code Monkey, and a com...",
    "Alt Text Image": "Official header image for Kitchen Chaos game - Steam 2275820",
    "Canonical URL": "https://gusku.site/game/kitchen-chaos",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kitchen Chaos\", \"description\": \"Looking for information on Kitchen Chaos? Check out the release date (Jan 30, 2023), developer insights from Endless Loop Studios,Code Monkey, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 30, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Endless Loop Studios,Code Monkey\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Endless Loop Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2275820/header.jpg?t=1675101563\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}