{
    "AppID": 2280260,
    "Name": "Kori's Fable Visual Novel",
    "Release date": "Jan 31, 2023",
    "About the game": "In this game you can read through a story and make choices that will affect the abilities that you have. Using these abilities you can overcome challenges in the game by making proper choices. It is a choice based game a little bit like choose your own adventure games. The dialogue in the game comes from either the characters or the narrator. The game is heavily text based so if you enjoy reading novels then you will enjoy this visual novel too. The ability system consists of three major types of abilities: astronomy, alchemy and sorcery. Throughout the game you can upgrade any of these abilities and use them to solve problems that you will encounter in the story. You will also have a journal where the character will write down her experiences and you will be able to read this journal anytime you want by going to the menu. The game can be saved by going to the menu by clicking on the 'cog' icon. The game is basically a novel with pictures and music. The story goes as follows: 'In the continent of High Birm the priests held the highest power. Progressive thinking and activities were prohibited and the priests' laws were definite. The kingdoms in the continent took counsel from their high priests and ruled with an iron fist. The society was largely orthodox and patriarchal and people who sought to oppose that social structure and sail against the waves were shunned or punished. On top of that the mingling of Godly magic and sorcery had created many twisted spells and forbidden arts in this land which made the life of common folks even more difficult. Among all this a sweet girl named Kori lost her parents when they were taken prisoner by the kingdom of her land. She escaped from the clutches of the kingdom but alas she was just an innocent girl, unaware of the ways and the treachery of the world. She had always been in the love and care of her parents and now suddenly she was left astray. All she could rely on was a shunned witch, her son and the intense desire to unite with her parents. Will you guide Kori through this hostile realm and help her in her mission?' Play Kori's Fable Visual Novel today on Steam.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2280260/header.jpg?t=1675183558",
    "Price": 9.99,
    "Developers": "Redseed Game Studio",
    "Publishers": "Redseed Game Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2280260/ss_c4bd273b146a176fd8562e8080314a002c38d617.1920x1080.jpg?t=1675183558,https://cdn.akamai.steamstatic.com/steam/apps/2280260/ss_1396d13f127cb2ef57bcd33885f36facaa1a97ee.1920x1080.jpg?t=1675183558,https://cdn.akamai.steamstatic.com/steam/apps/2280260/ss_ac190613aa147c7337e6a22efded637b7491d022.1920x1080.jpg?t=1675183558,https://cdn.akamai.steamstatic.com/steam/apps/2280260/ss_7bd39bf5dd73c26353ac7081dd48ec35cabaa95b.1920x1080.jpg?t=1675183558,https://cdn.akamai.steamstatic.com/steam/apps/2280260/ss_a8eb685cc424086f29f2db4260e3fa66412e34b9.1920x1080.jpg?t=1675183558",
    "Slug": "kori-s-fable-visual-novel",
    "Meta Title": "Kori's Fable Visual Novel: Jan 31, 2023, Redseed Game Stu...",
    "Meta Description": "Looking for information on Kori's Fable Visual Novel? Check out the release date (Jan 31, 2023), developer insights from Redseed Game Studio, and a comp...",
    "Alt Text Image": "Official header image for Kori's Fable Visual Novel game - Steam 2280260",
    "Canonical URL": "https://gusku.site/game/kori-s-fable-visual-novel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kori's Fable Visual Novel\", \"description\": \"Looking for information on Kori's Fable Visual Novel? Check out the release date (Jan 31, 2023), developer insights from Redseed Game Studio, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Redseed Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Redseed Game Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2280260/header.jpg?t=1675183558\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}