{
    "AppID": 2251650,
    "Name": "Mimicry",
    "Release date": "Feb 10, 2023",
    "About the game": "In Mimicry, experience a classic top-down dungeon crawler, with a twist that instead of being the adventurer clearing waves of monsters, you are the monster clearing waves of adventurers. You play as a creature called a mimic, which looks like a chest to lure in prey. It’s kind of like a stick bug, only carnivorous and 20 times the size. Use stealth to hide among supplies and consume the human invaders of your home. Fight your way through 6 floors of a totally realistic dungeon to save the society of mimics that live in the catacombs, and collect sweet loot doing so. But be wary of the dangers of venturing too deep. Explore the Underground Bounce your way through 6 carefully curated floors of the dungeon, and use different gameplay mechanics to face differing enemies. Choose between hiding among crates, barrels, and real chests for sneaky kills or charging headfirst through the pillared hallways to take on an army of explorers. Each floor has a distinct character which influences what will be found there. Some floors may have you dodging through tunnels to avoid detection, while others you'd need to find ways to keep the lights on in the darkness to push forward. Once each floor has been cleared it will open up the way to move on through the dungeon. But you'd need to keep an eye on old floors as baddies can try to reclaim them, and the levels may provide handy items for later-game use. Fight With Stealth Unlike most dungeon crawlers, Mimicry plays as a mixture of fighting hordes of enemies and of hide and seek. The suspicion bar tells you how much adventurers will think you're just a chest, or if you're secretly a man-eating monster in disguise. Actions like standing still next to cargo lower your suspicion, while actively killing people around others guarantees you to have a full, blazing bar and you'll need to run for it. Use low suspicion to your advantage to get instant kills, which are much safer than non-instant kills and level you up faster. Customize Your Playstyle Choose your character from one of 4 specialized mimics that have their own unique playstyles. And beyond that, each mimic has customizable special attacks that can be leveled and affected by different loot. There are the two types of mimics, wooden and reinforced, which each have their own light and heavy classes. Wooden mimics have movement focused abilities, such as rushing or body slamming and will require more energy. Reinforced mimics have equipment focused abilities such as whirling swords or throwing axes which use less energy, but cost items. Full List of Planned Features Note that the game is in early access, so not all listed features are guaranteed to be added. Some features may change, others may get scrapped, and some new ones may be added. Floor 2 and 3 Rework and Expansion 3 More Playable Mimic Classes Greater Customizable Combat Options 4 More Floors Secret Tunnels A Proper Tutorial More Stealth Combat Mechanics More Strategy Gameplay Mechanics More Enemy Variety Enemy AI Improvements More Merchant NPCs More Potions Uses for Material Loot Items Player Cosmetics and Accessories Society of Mimics Bosses Enemy Bestiary Base Building Doper Lighting Multiplayer Co-op and PvP Arena Survival Mode Localization An Ending",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2251650/header.jpg?t=1676138037",
    "Price": 3.99,
    "Developers": "Voyde Studios",
    "Publishers": "Voyde Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2251650/ss_f761725aec80b86a94229e4d3675165a86a35f00.1920x1080.jpg?t=1676138037,https://cdn.akamai.steamstatic.com/steam/apps/2251650/ss_1ab5b0f8451c3f08a666c8a4885df8b8ad481b26.1920x1080.jpg?t=1676138037,https://cdn.akamai.steamstatic.com/steam/apps/2251650/ss_a87ae5aff7eab7438aae8d3573c264e1357e227b.1920x1080.jpg?t=1676138037,https://cdn.akamai.steamstatic.com/steam/apps/2251650/ss_d00c5c0425bd1ce37b1412712a4d724978441170.1920x1080.jpg?t=1676138037,https://cdn.akamai.steamstatic.com/steam/apps/2251650/ss_552ee24b4fdf40f43db5ac1944dca89ebab73424.1920x1080.jpg?t=1676138037,https://cdn.akamai.steamstatic.com/steam/apps/2251650/ss_9892f0c59146fba13a9f1838f974f8a05b2a10cb.1920x1080.jpg?t=1676138037,https://cdn.akamai.steamstatic.com/steam/apps/2251650/ss_909163d84c21ae326f76b410f57df8c9f949634e.1920x1080.jpg?t=1676138037,https://cdn.akamai.steamstatic.com/steam/apps/2251650/ss_ad14c0cc2a2401c6c0db2c52da56559a31cc061f.1920x1080.jpg?t=1676138037,https://cdn.akamai.steamstatic.com/steam/apps/2251650/ss_ea82b56f1217e21071febfe258371e11648c1bcb.1920x1080.jpg?t=1676138037,https://cdn.akamai.steamstatic.com/steam/apps/2251650/ss_ba100f4cbf1597dd7a7bbae9dadb64f9a68c6414.1920x1080.jpg?t=1676138037,https://cdn.akamai.steamstatic.com/steam/apps/2251650/ss_3a13f8d338f7189f0535cf15fd9f3cb3232d5888.1920x1080.jpg?t=1676138037,https://cdn.akamai.steamstatic.com/steam/apps/2251650/ss_67a3714fef58c6e4450b38e10621182c7d2a91a5.1920x1080.jpg?t=1676138037",
    "Slug": "mimicry",
    "Meta Title": "Mimicry: Feb 10, 2023, Voyde Studios and Full Overview",
    "Meta Description": "Looking for information on Mimicry? Check out the release date (Feb 10, 2023), developer insights from Voyde Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Mimicry game - Steam 2251650",
    "Canonical URL": "https://gusku.site/game/mimicry",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mimicry\", \"description\": \"Looking for information on Mimicry? Check out the release date (Feb 10, 2023), developer insights from Voyde Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 10, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Voyde Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Voyde Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2251650/header.jpg?t=1676138037\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}