{
    "AppID": 2272010,
    "Name": "Minibots TD",
    "Release date": "Feb 6, 2023",
    "About the game": "Get ready for the Best tower defense attack! Build, deploy, and upgrade your towers in this epic Robotic world adventure. The battle is in a robotic world; it starts on a road between your city and the army of Kaids trying to pass the road and conquer it. Craft your perfect defense from a combination of different Towers, Turrets that upgrade, Aerial defense systems, laser bombs, and land mines, destroy every last invading Kaidan Robot with their armored vehicles. The game's speed will gradually go high as more and more robots with different military vehicles attack. You have to face and confront the kaids' army, which is equipped with robotic soldiers and armored personal carriers; Arial drones will try to pass the road. You can also have different upgradeable weapons and towers, land mines, and laser bombs. Unlike the other TD games, you must think strategically about using your guns and spending your earned coins on upgrading the towers and weapons, buying laser bombs and land mines. As you progress further in the game levels, you will face strategic challenges and dilemmas to care about, and with that, the game will become your hobby when you are busy with it! Mistakes have a price, so stay alert, learn from your mistakes, plan a new strategy, and endure and fight for another day! FEATURES ⦁ Heroic enemy attacks that will hook you for hours ⦁ Variety of enemies, terrestrial and aerial. ⦁ Arrange your towers and see them engage in all robotic battles ⦁ Hours of gameplay with challenging achievements ⦁ Easy to work with menus and settings ⦁ Full screen awesome 3D art ⦁ Level achievements and coins for purchasing Items &amp; upgrading your towers ⦁ Freedom for tower placements Different environments and graphics are depicted The artistic style of Minibots is designed based on the imaginary design of an extraterrestrial planet, with all the robots, cars and towers in it rotate around the axis of this extraterrestrial period on a distant planet. A GAME TO TEST YOUR STRATEGIC THINKING! The battlefield is an unforgiving landscape and every second counts. Beginners will find forgiveness on normal mode while veterans will be drawn to the challenge of hard. When you’re ready it’s time to put your skills to the test in nightmare and survival. How long can you hold back the hordes? BURN, BLAST AND OBLITERATE Deploy the machine gun, flame thrower, artillery and plasma turrets to destroy your foes. Upgrade your towers to their experimental stages packing serious firepower and charged attacks. Different environments and graphics are depicted The artistic style of Minibots is designed based on the imaginary design of an extraterrestrial planet, with all the robots, cars and towers in it rotate around the axis of this extraterrestrial period on a distant planet. A GAME TO TEST YOUR STRATEGIC THINKING! The battlefield is an unforgiving landscape and every second counts. Beginners will find forgiveness on normal mode while veterans will be drawn to the challenge of hard. When you’re ready it’s time to put your skills to the test in nightmare and survival. How long can you hold back the hordes? BURN, BLAST AND OBLITERATE Deploy the machine gun, flame thrower, artillery and plasma turrets to destroy your foes. Upgrade your towers to their experimental stages packing serious firepower and charged attacks.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2272010/header.jpg?t=1675705763",
    "Price": 5.94,
    "Developers": "Robogames",
    "Publishers": "Robogames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2272010/ss_bcb05f302552f9251b97a15c1ce6d47690ebf5ac.1920x1080.jpg?t=1675705763,https://cdn.akamai.steamstatic.com/steam/apps/2272010/ss_1ef51a4c92f0aff521b957adb3d838c8a131e0e6.1920x1080.jpg?t=1675705763,https://cdn.akamai.steamstatic.com/steam/apps/2272010/ss_5903d57b720481a5768131e7f77ad0b55df7ae97.1920x1080.jpg?t=1675705763,https://cdn.akamai.steamstatic.com/steam/apps/2272010/ss_b79bfc299f641abd560aab226a8bfb2e128cca18.1920x1080.jpg?t=1675705763,https://cdn.akamai.steamstatic.com/steam/apps/2272010/ss_8608fc5346affa7c753e46d26117b1f06e713fe7.1920x1080.jpg?t=1675705763,https://cdn.akamai.steamstatic.com/steam/apps/2272010/ss_69d2620eed9637e2c44c494e59bdbb4db9f72e26.1920x1080.jpg?t=1675705763,https://cdn.akamai.steamstatic.com/steam/apps/2272010/ss_215dee1d52ee7dc6c008da681dbbfb807908c596.1920x1080.jpg?t=1675705763",
    "Slug": "minibots-td",
    "Meta Title": "Minibots TD: Feb 6, 2023, Robogames and Full Overview",
    "Meta Description": "Looking for information on Minibots TD? Check out the release date (Feb 6, 2023), developer insights from Robogames, and a complete game summary.",
    "Alt Text Image": "Official header image for Minibots TD game - Steam 2272010",
    "Canonical URL": "https://gusku.site/game/minibots-td",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Minibots TD\", \"description\": \"Looking for information on Minibots TD? Check out the release date (Feb 6, 2023), developer insights from Robogames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 6, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Robogames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Robogames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2272010/header.jpg?t=1675705763\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.94, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}