{
    "AppID": 1071620,
    "Name": "Netherverse",
    "Release date": "Feb 7, 2023",
    "About the game": "NETHERVERSE As Humanity's dimensional world collides with a parallel dimension, mysterious living organisms, called the Nethers, begin to appear on Earth. At first, the dimensional shifts between both worlds were fascinating slow transitions, where the two living species could see and learn about each other. As it became more frequent, both came to realize that one dimension would inevitably be absorbed by the other. To survive, one must eliminate any vital energy from the rival dimension. In the Netherverse, Humans and Nethers face each other in a 6-minutes quick deathmatch. One team starts as the Hunters and must takedown the opposing team members as many times as possible while they run away. As dimension shifts, the map layout changes, and the roles are swapped - The Hunter becomes the Hunted, and the Hunted comes the Hunter. To win, earn the most points through 1-on-1 takedowns and objectives points each round! KEY FEATURES Team Battles Deathmatch Players can team up with friends and other players to enter this 3v3 deathmatch arena. Select your character with unique abilities to support your team in the fight for your species' survival. Surprising, taunting and deceiving the hostile team is your key to victory! Strategic Third Person Gameplay In this 3v3 character-based game, create your own meta or counter meta by adopting your own playstyle and build unique synergies with your team. Coordinate together to build offensive or defensive strategies. Experience the anxiety of being Hunted, as well as the thrill of being the Hunter! Colliding dimensions Have you ever experienced a world-switching battlefield? This deathmatch takes place on one world, and as the battle rages on, the landscape changes as both teams are transported to a parallel world. Navigate through different dimensions to discover their own unique twists and features! Takedowns to win Earn the most points through Takedowns and round objectives to win. Surprise, taunt and deceive the hostile team is your key to victory. Show your style through customizing your character to your liking. Each character has unique takedown animations, weapon customization, outfits, VFX, and many more. Collect these items customization through in-game shopping and rewards.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1071620/header.jpg?t=1675801836",
    "Price": 0.0,
    "Developers": "PLAYMIND",
    "Publishers": "PLAYMIND",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1071620/ss_91acd84eaa4f93d37951f2e59931de2bf6dbea29.1920x1080.jpg?t=1675801836,https://cdn.akamai.steamstatic.com/steam/apps/1071620/ss_85210d8bd79aad337b6055f3e2d20e90d414822f.1920x1080.jpg?t=1675801836,https://cdn.akamai.steamstatic.com/steam/apps/1071620/ss_b954413e6d8afe36bab0d2d95509cd20e7e5177e.1920x1080.jpg?t=1675801836,https://cdn.akamai.steamstatic.com/steam/apps/1071620/ss_65927409f78e500c08d6fe32cfdf645327650c03.1920x1080.jpg?t=1675801836,https://cdn.akamai.steamstatic.com/steam/apps/1071620/ss_e263bf4ef3b50f4753b64d316598222835dd33d4.1920x1080.jpg?t=1675801836,https://cdn.akamai.steamstatic.com/steam/apps/1071620/ss_2e9420e993d567f0b3c429f3a9c8a507c375fe4a.1920x1080.jpg?t=1675801836,https://cdn.akamai.steamstatic.com/steam/apps/1071620/ss_db69e91e68ea43cd9f0ccf99e67437d4eb6655d6.1920x1080.jpg?t=1675801836,https://cdn.akamai.steamstatic.com/steam/apps/1071620/ss_a32201d9ee028a0faa9f1dcea61625d032b272e9.1920x1080.jpg?t=1675801836",
    "Slug": "netherverse",
    "Meta Title": "Netherverse: Feb 7, 2023, PLAYMIND and Full Overview",
    "Meta Description": "Looking for information on Netherverse? Check out the release date (Feb 7, 2023), developer insights from PLAYMIND, and a complete game summary.",
    "Alt Text Image": "Official header image for Netherverse game - Steam 1071620",
    "Canonical URL": "https://gusku.site/game/netherverse",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Netherverse\", \"description\": \"Looking for information on Netherverse? Check out the release date (Feb 7, 2023), developer insights from PLAYMIND, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 7, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"PLAYMIND\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PLAYMIND\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1071620/header.jpg?t=1675801836\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}