{
    "AppID": 1603940,
    "Name": "Nuclear War Simulator",
    "Release date": "Feb 2, 2023",
    "About the game": "Info section: Nuclear War Simulator is a detailed realistic simulation and visualization of large-scale nuclear conflicts with a focus on humanitarian consequences. There are currently over 13000 nuclear weapons on this planet of which over 9000 are in military stockpiles. This software should help you answer the question: what will happen if Russia and the United States or India and Pakistan use their arsenals? You can design warheads, missiles and carries, place them on the map and execute attack plans to tell a credible story about how nuclear conflicts play out and what are the consequences. Using a high-resolution population density map and realistic weapons effects like blast, heat and radiation you can make an estimate of how many people will die in a conflict. Nuclear conflict scenarios You can design realistic large-scale scenarios between major powers with thousands of warheads. Scenarios can be created manually where you can assign each warhead individually or with the assistance of an AI for faster targeting. It is also possible to simulate whole conflicts with a few clicks on the map interactively. You can download scenarios created by other people and upload your scenarios to the mods.io server. Realistic effects of nuclear weapons The simulation includes a high-resolution population density grid. The effects of blast, heat, fires and radiation are calculated and visualized for each population cell to estimate fatalities (similar to Alex Wellerstein’s NUKEMAP). The destruction of military targets is simulated using a model considering the CEP of the weapon, target hardness and cratering. You can place yourself, your family and friends into the simulation to estimate the expected injuries and survival probability. The amount of burnt fuel and produced soot are also calculated to estimate the effects of nuclear winter using a simplified model. Design and placement of objects Using an intuitive UI you can design warheads, place them on missiles and into silos, on aircraft, TELs and submarines. You can then place the forces onto the map simply clicking on it or importing real-world locations from KMZ files. If you know how much uranium and plutonium is needed for one warhead, you can estimate how many can be build from today’s stockpiles if a country wants to. Modding and interfaces The simulation supports some basic modding of unit textures, loading screens and background music. It is also possible to share unit blueprints and scenarios with others. If you have simulated a conflict in another tool you can import the list of detonations as a simple CSV file to calculate the humanitarian effects. On the other hand, you can also export the list of detonations together with the burnt soot into other tools like detailed climate simulations. Features Detailed effects of nuclear weapons, accurate reports on affects/results (including but not limited to radiation zones, casualties and fires) Realistic delivery systems, up-to-date full known arsenal of main world powers. Sandbox to design weapon systems and build conflict scenarios. Individual civilians moving on the map and taking shelter. 22+ predefined editable scenarios.  In-game mod upload and download. (instant synchronisation) Adjustable AI. Integrated early warning and Missile Defence systems.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1603940/header.jpg?t=1675350078",
    "Price": 29.99,
    "Developers": "Bit Mirror",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1603940/ss_87f37f1340401a58ba714764676bb74529315bc2.1920x1080.jpg?t=1675350078,https://cdn.akamai.steamstatic.com/steam/apps/1603940/ss_ac0b05c704e8dd101867c0b243907a58b5f00499.1920x1080.jpg?t=1675350078,https://cdn.akamai.steamstatic.com/steam/apps/1603940/ss_7c1374feb709d186d088f1ddfd259dc1acf22eb6.1920x1080.jpg?t=1675350078,https://cdn.akamai.steamstatic.com/steam/apps/1603940/ss_0a5e772b9bd7e473eb389a75939852eee6b58b95.1920x1080.jpg?t=1675350078,https://cdn.akamai.steamstatic.com/steam/apps/1603940/ss_04f41c44ad65c38e8bea66bc53485b6efe698a12.1920x1080.jpg?t=1675350078,https://cdn.akamai.steamstatic.com/steam/apps/1603940/ss_5db1a03762d94dd50d9eefc7e114d4898add73ed.1920x1080.jpg?t=1675350078,https://cdn.akamai.steamstatic.com/steam/apps/1603940/ss_30e7c3ee8928cf333160ec20981d257bbc9ed07c.1920x1080.jpg?t=1675350078,https://cdn.akamai.steamstatic.com/steam/apps/1603940/ss_cdcfa88858a7b20e134578465f4f84d4af223306.1920x1080.jpg?t=1675350078,https://cdn.akamai.steamstatic.com/steam/apps/1603940/ss_74ecd8060da1e4f0ef4758202bc78a3312d66eda.1920x1080.jpg?t=1675350078",
    "Slug": "nuclear-war-simulator",
    "Meta Title": "Nuclear War Simulator: Feb 2, 2023, Bit Mirror and Full O...",
    "Meta Description": "Looking for information on Nuclear War Simulator? Check out the release date (Feb 2, 2023), developer insights from Bit Mirror, and a complete game summ...",
    "Alt Text Image": "Official header image for Nuclear War Simulator game - Steam 1603940",
    "Canonical URL": "https://gusku.site/game/nuclear-war-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nuclear War Simulator\", \"description\": \"Looking for information on Nuclear War Simulator? Check out the release date (Feb 2, 2023), developer insights from Bit Mirror, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 2, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bit Mirror\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1603940/header.jpg?t=1675350078\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}