{
    "AppID": 1993960,
    "Name": "Path of a Player",
    "Release date": "Jan 26, 2023",
    "About the game": "Path of a player 2 is a marvel time killer experience with Cute and Tiny Characters and graphics, an online system based on solo leveling the manga/light novel. Become the best adventurer in this epic world. A perfect time killer adventure for your device. HOW TO PLAY - Explore the world and find monsters to fight. - Fight the monsters and plunder their loot! - Craft and buy stronger equipment and level up! - Continue exploring the vast world! You can play offline! That makes Path of a player 2 a perfect time killer app for your phone or tablet. FEATURES - Daily Quests just like solo leveling! - Cool skills that can be unlocked in various ways! - Recruit allies on your adventure to fight together with! - 3 unique classes with more to be added! - Hidden classes with many more to be added! The World is cursed! Your mission is to explore the dungeons! Conquer the dungeon, gather different allies in this Turn Based RPG adventure game, the greatest time killer adventure 2021. Path of a player 2 is a perfect Turned Based RPG Adventure game, with a tiny, cute theme. The mission is to explore the world and unlock many different items throughout your journey! In this Turn Based RPG Adventure, you will face different challenges: - POWERFUL ENEMIES: The world is filled with many Bosses and Monsters for you to defeat! - SOLO LEVELING UP: This game is massively played alone, which makes you get stronger on your own! -RANKING #1: Challenge the top players in the world to claim the spot of #1 on the leaderboard! - UNLOCK THE SECRET: this game also follows its own storyline which you must follow a player…. Or do you? A lot of COOL CHALLENGES and A ADVENTURE IN PATH OF A PLAYER 2 is waiting for you in one of the CUTEST ARCADE games of 2021 ONLINE &amp; OFFLINE GAMES. A 2021 Cute Action-packed classic with turn based arcade gameplay has come. An easy control system that brings you an addictive but frustrating time killer adventure, remember it can be an offline game. Play this epic adventure rush arcade app! Leave Path of a Player 2, gain rewards and get resources for simply playing. Any master must wear the best outfit! Be the best Player worldwide! Get the ultimate RPG game and level up your gameplay. Collect the Medals and gather the ultimate Skins! Join the Path of many other adventurers and SOLO LEVEL UP! Path of a player 2 is a free to play Turn based RPG game but it contains gems that can be purchased for real money. Let us know what you think of our Turn Based RPG game! Do you like cute dash adventures? Join the Subway Runner Tiny Adventure rush game now!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1993960/header.jpg?t=1674741344",
    "Price": 4.99,
    "Developers": "CB4D",
    "Publishers": "CB4D",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1993960/ss_1f160c4465eae4cdc95e953ec98240f874662b79.1920x1080.jpg?t=1674741344,https://cdn.akamai.steamstatic.com/steam/apps/1993960/ss_f1adf6b44acd0b50922b43d0c685c6bed65d8f61.1920x1080.jpg?t=1674741344,https://cdn.akamai.steamstatic.com/steam/apps/1993960/ss_cafc02f8e358958954e21736adfb001663e6c2b9.1920x1080.jpg?t=1674741344,https://cdn.akamai.steamstatic.com/steam/apps/1993960/ss_612fb420aca2e6fe5157cfedc0b0ab5394221bb9.1920x1080.jpg?t=1674741344,https://cdn.akamai.steamstatic.com/steam/apps/1993960/ss_da1fb17843ac35e2725cf7f27768900611cc9ba5.1920x1080.jpg?t=1674741344,https://cdn.akamai.steamstatic.com/steam/apps/1993960/ss_f696237e3d78c99124b429a68a2ec2c2a3c237b3.1920x1080.jpg?t=1674741344",
    "Slug": "path-of-a-player",
    "Meta Title": "Path of a Player: Jan 26, 2023, CB4D and Full Overview",
    "Meta Description": "Looking for information on Path of a Player? Check out the release date (Jan 26, 2023), developer insights from CB4D, and a complete game summary.",
    "Alt Text Image": "Official header image for Path of a Player game - Steam 1993960",
    "Canonical URL": "https://gusku.site/game/path-of-a-player",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Path of a Player\", \"description\": \"Looking for information on Path of a Player? Check out the release date (Jan 26, 2023), developer insights from CB4D, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 26, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"CB4D\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CB4D\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1993960/header.jpg?t=1674741344\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}