{
    "AppID": 1351080,
    "Name": "Pharaoh: A New Era",
    "Release date": "Feb 15, 2023",
    "About the game": "Immerse yourself in the history of Ancient Egypt with 50 missions and over 100 gameplay hours in Pharaoh: A New Era, a remake of Pharaoh (and the expansion Cleopatra: Queen of the Nile), one of the best city builders from the golden age of Sierra Entertainment. Stone by stone, build your city and manage all aspects of its development to ensure it prospers and makes you a powerful and revered Pharaoh. Develop your city by cultivating the fertile lands along the banks of the Nile valley. Erect the iconic monuments of Ancient Egypt, including the pyramids, the Sphinx and the Lighthouse of Alexandria. Build temples and mausoleums to help manage all aspects of your city's health and culture as well as the predominant polytheistic religion of the time. Ensure your city is prosperous enough to deal with economic or political crises, or even plundering by enemies. A Pharaoh takes care of its people and does whatever it can to earn the favour of the gods. Pharaoh: A New Era celebrates 20 years since the release of the famous franchise with a complete remake, including more than 50 playable missions and over 100 hours of gameplay. The 'Campaign' mode teaches you the game basics while allowing you to experience a unique story in the heart of Ancient Egypt and explore all aspects of life in a thriving city. You have everything at your disposal to build an entire city and manage all its fundamental elements to ensure it flourishes: the economy, internal and external trade, culture, health, agriculture, education, etc. To help you monitor your progress, various indicators show you the overall well-being of your city and its residents. The journey back in time is really brought to life with this Ultra HD remake, which upgrades the gameplay mechanics to modern standards and completely redesigns the captivating soundtrack and gorgeous isometric 2D graphics. ● A Cult Classic Remade: Rediscover 4,000 years of History in 4K HD in this remake of the cult classic city-builder Pharaoh and its expansion Cleopatra: Queen of the Nile ● A Rich, Complexe and Unique Experience: Trade and develop your economy with neighboring cities and make your civilization thrive while facing the elements with the flooding of the Niel, the wars with your enemies, the furies of the Gods and the plagues of Egypt ● A Fortune of Fun: Lead your people through a rich 50+ missions and 100+ hour campaign, or unwind and build the metropolis of your dreams in a Free Build mode ● Breathtaking Views: Marvel at the beauty of budding settlements and lively cities sprawling across the Egyptian sands, brought to life through fully reworked, intricate hand drawn art ● Modern Refinements: Overhauled menus, a refreshed UI and various adjustments make Pharaoh: A New Era’s classically inspired fun feel like second nature to play ● A Fully Reorchestrated Soundtrack: Take in stirring recreations of the original soundtrack’s melodies, rearranged and performed with traditional oriental instruments More than just a remake, Pharaoh: A New Era also brings hundreds of gameplay changes, enhancing the original experience to new standards: ● New reworked UI: with overhauled menus and a fully redesigned UI, build your city more efficiently and raise your empire to new heights ● With the New Nilometer Indicator , track both when the Nile floods occur and its quality ● Manage your people more easily and efficiently with new and redesigned mechanics, like the Workers tooltip, the Fixed Worker Ratio or the Global Labor Pool ● Develop your city with ease with the ability to quickly copy-paste buildings ● Enjoy a chiller experience by disabling predators ● And many more!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1351080/header.jpg?t=1676473513",
    "Price": 19.54,
    "Developers": "Triskell Interactive",
    "Publishers": "Dotemu",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1351080/ss_53e363da487279fb0736e50d95e379ce3259315a.1920x1080.jpg?t=1676473513,https://cdn.akamai.steamstatic.com/steam/apps/1351080/ss_fa6b8ce5b3fdb961264980b6d128938c9cf9933b.1920x1080.jpg?t=1676473513,https://cdn.akamai.steamstatic.com/steam/apps/1351080/ss_3a365d9c9c7881f9862075f1354ded96021dc140.1920x1080.jpg?t=1676473513,https://cdn.akamai.steamstatic.com/steam/apps/1351080/ss_6f4fde41cca2004b6c16c85e248f65c7fcc52adc.1920x1080.jpg?t=1676473513,https://cdn.akamai.steamstatic.com/steam/apps/1351080/ss_b96095c0f5c6849c158483acfd2d4002663314f3.1920x1080.jpg?t=1676473513,https://cdn.akamai.steamstatic.com/steam/apps/1351080/ss_d131e30f716d232eff78fee190778242df651d1a.1920x1080.jpg?t=1676473513",
    "Slug": "pharaoh-a-new-era",
    "Meta Title": "Pharaoh: A New Era: Feb 15, 2023, Triskell Interactive an...",
    "Meta Description": "Looking for information on Pharaoh: A New Era? Check out the release date (Feb 15, 2023), developer insights from Triskell Interactive, and a complete g...",
    "Alt Text Image": "Official header image for Pharaoh: A New Era game - Steam 1351080",
    "Canonical URL": "https://gusku.site/game/pharaoh-a-new-era",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pharaoh: A New Era\", \"description\": \"Looking for information on Pharaoh: A New Era? Check out the release date (Feb 15, 2023), developer insights from Triskell Interactive, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 15, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Triskell Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dotemu\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1351080/header.jpg?t=1676473513\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.54, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}