{
    "AppID": 2218970,
    "Name": "Plains of Pain",
    "Release date": "Feb 17, 2023",
    "About the game": "THE STORY BEHINDS PLAINS OF PAIN Humanity was at the height of technological advancement when this happened. For some unknown reason, the sun began to produce gigantic solar flares that literally melted Mercury and Venus in a matter of days. The Earth was no exception and began to heat up as well. There was a general panic. Ordinary people relied on world leaders to somehow resolve the situation. They didn't. Instead, they immediately packed up and flew off the planet with the world's wealthiest class as part of a secret government project. Slowly, the original civilization began to disintegrate into smaller parts until there was almost nothing left. Over time, the planet was almost completely drained by the constant extreme temperatures. Only a minimum of vegetation remained. Of the few humanity that was left, most people went mad over time and just wandered the world looking for a little water and food. Two hostile factions are trying to restore some sort of general order and help those who haven't gone completely mad. But each in their own way. If you're not loyal to them, you're nothing more than a grain of sand in an endless wasteland. And this is where your story begins. You start out as a neutral survivor, and your only mission is to survive. How? That's up to you. You can build loyalty to one of the two factions, or you can stay neutral. There are advantages and disadvantages to both. Find out who's on the side of good and who's on the side of evil. Explore the world. Build your sanctuary. Trade. But above all, survive! EARLY ACCESS &amp; COMMUNITY Joining us on Discord means being in touch with us. We listen to you. We listen to your ideas, feedbacks and complaints as well! We want to lead our game from alpha state in the straight direction to the stable (1.0) version through all storms. We want to deliver the most enjoyable post-apocalyptic multiplayer game to you. That's our goal. Be there for it. Be here with us. We do our best, because we are players as well. So this game is not a product of AAA studio, but it's driven by pure desires and visions of how the post-apocalyptic multiplayer game should look like. ONLINE MULTIPLAYER Currently we use P2P networking for providing online multiplayer. You can create private/public/friends only lobbies. LAN MULTIPLAYER We provide LAN networking as well. The game uses KCP protocol for this feature. SINGLE PLAYER For lone wolves who want to enjoy the post-apocalyptic atmosphere undisturbed, we have also prepared this option. MAIN CURRENCY There is no more money. Only barter. Hold on.. there is something similar to! All survivors there use rusty nuts. Yeah, just rusty nuts. Or are they some special as well? Bet on it. TRADERS &amp; TRADING There are traders outhere! Meet them randomly in wasteland, or locate them in villages or lonely spots all over the world. Each of them has unique demand and offers, and prices of course! Some of them demand something special, it's totally on you to figure out the way how to obtain the goods of their needs. FACTIONS &amp; LOYALITY You enter the world as a nobody, who is loyal to no one. There are two big areas on map which are under control of two main rival factions. You can go there, but on your own risk, if you're not loyal to them. Otherwise they will protect you if you meet them. You can obtain loyality to certain faction in a few different ways. There are a few more factions you can meet, but it's up to your desire of exploration our world. OUTPOSTS Outposts are strategically located colonies that are under the control of a given faction. The location is unknown and the player will discover these colonies as he travels through the game world. Now the importance of faction loyalty comes into play, as the defenders of an outpost will attack anyone who is not loyal to their faction. In the Outposts you can encounter rare merchants with a specific assortment of goods for purchase and redemption, among other things, rare loot will be found, and not only from fallen opponents in the case of conquering the Outpost. The defenders are regularly replenished by air transport from the main bases of the faction. WORLD The world map is 100 sq km of true wasteland. The omnipresent heat turned the world into an endless plain devoid of vegetation. There are settlements and camps of survivors. You can meet some animals there. But be prepared for any advanture there. That heat is killing. SURVIVING Of course you will need food and water to survive. But that's not enough. There are more challanges outhere. Watch your fatigue or oxygen in your lungs carefully, or you would be dead really fast. Be aware of radiation and intoxication. BUILDING We have a few pieces of buildables. For example like mattress - which allow you to set a spawn point! So when you die, you will spawn just there! And the best thing is you can build a bunker, that behaves as your base, when you can put other buildables like chests or barrels, and a few more. This feature is really in an early stage, but we hope you'll love it! RE-BUILDABLE SETTLEMENTS Cooperate with other players and re-build as most as possible settlements in the world to get advantages of each built buildings. Bring wastelanders from wasteland to each building to enhance its feature. NPC &amp; AI Our world is alive everywhere you go. You will meet strangers and traders, or enemies of course! NPCs are driven by our prototype implementation of Infinite Axis Utility AI, using our prototype of independent navigation in the world (not classic Pathfinding). This is the alpha, so don't expect real-human behaviours from NPC, but we want to improve it more in upcoming updates. HOVER VEHICLES They need gas. So you'll have to find some. They have storage, so they're useful for faster looting the world. And they hover, not fly. INVENTORY SYSTEM The UI system where you manage your items. We mainly focus on simplicity and minimalistic interface to not complicate the player experience. CRAFTING &amp; COMBINING Many items in the game are craftable. Some items have special effect on the other item - that we call combining. For example, when you have a bottle full of oil, you can repair/fix your gun with that. Or you can make a melee weapon poisoned (deals intoxication to an enemy), if you apply a bottle with poision on it. RANDOM SPAWNING We build on randomization a lot. The game is filled with randomly generated game content (NPCs, loot, etc.) everywhere, where are not static spots like settlements or Outposts. These type of static spots have their own spawn system for loot and NPCs. So when you travel through the wasteland, you never know what adventure you'll meet. DEADLY ZONES Explore the world carefully! There are deadly zones outhere as well. We don't want to spoiler here, but we want to aware you of it. Player needs a specific set of equipment to be able safely explore these zones. GLOBAL DISASTER EVENTS Expect deadly disasters driven by randomization. Again, we won't spoiler here, but be prepared for the worst. Player should pay attention to the surroundings during his travels, watch the sky, listen to the sounds and try to learn how to surive thru these unexpected events. UPCOMING UPDATES This is a list of what you can expect in upcoming updates. Quests and missions (random and story driven) Tuning, balancing and bug fixing AI improvements New weapons New hover vehicles, faction drones, faction transports New enemies &amp; NPCs New buildables New locations on map Improving of current locations on map New systems around factions and Outposts New types of global disaster events UI improvements Animations improvements The ability to crouch Brand new special locations on map Brand new in-game systems to scale fun New sounds and atmospheric ambient music Achievements Leaderboards We are a team of 3 people who decided to make a game about post-apocalyptic theme which would have all aspects we're missing in other games we like.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2218970/header.jpg?t=1676673536",
    "Price": 9.59,
    "Developers": "Cobra Byte Digital",
    "Publishers": "Cobra Byte Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_b5ce7e74f6c790afdcc45858f84096d8f44c30f8.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_1fbbff34cc33ddd309b62e03f14ccf14eaa2b9d8.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_dad8b84a561a886c64566b6d811245a43c2e859c.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_87f57a20168bc3bcdc1adff7f0e2bd08025ba465.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_9a5cbb657a6c2d844f09dfee25d6874054f1f17c.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_4006fa3d96186911290a939d30e6c051f50d3bac.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_4d4509b1f76daf961278b5e4f5cdbe8c6bdb2488.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_e6b8d2d066f57ed34c104f1bf80376c146bc5e93.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_16e579ea3562b5a9eeb7907a7d9ee1ab93884015.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_df119f46af9e782e0a83f367c90ebf777e22c5b8.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_7aaa1a5070f696cd8e9e8310909d5492edfda24c.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_4038b7160f3f55f1edcdbad5fa4b95a7108c8169.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_9ec626f03445df132e4aee4718c9fb18bc23fd1b.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_f3a016dd66f08457d84ce8d692c5cdbde4b6ca50.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_90fd8a0d8efc80bd2bf829422a3f07c1fd3e4716.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_0f48b5c912d578f062824474bfcc766e7c1d2ee2.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_1b2df1b7202940a4630129e2def02a0f08c8189e.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_ba3a5c8e1bfdc769fa51efe057ec068529ccdba3.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_74283485327f1ce484426474aa8f19283fdfad02.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_fd8094b62cebf1caa7e2d05e0fe2843c53cea794.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_7763fdcdf2003c814bd5e67332fb9aba9cd54093.1920x1080.jpg?t=1676673536,https://cdn.akamai.steamstatic.com/steam/apps/2218970/ss_33e7c2e09b74d9ae6c0b274bfd823bfe906123e3.1920x1080.jpg?t=1676673536",
    "Slug": "plains-of-pain",
    "Meta Title": "Plains of Pain: Feb 17, 2023, Cobra Byte Digital and Full...",
    "Meta Description": "Looking for information on Plains of Pain? Check out the release date (Feb 17, 2023), developer insights from Cobra Byte Digital, and a complete game su...",
    "Alt Text Image": "Official header image for Plains of Pain game - Steam 2218970",
    "Canonical URL": "https://gusku.site/game/plains-of-pain",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Plains of Pain\", \"description\": \"Looking for information on Plains of Pain? Check out the release date (Feb 17, 2023), developer insights from Cobra Byte Digital, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 17, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cobra Byte Digital\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cobra Byte Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2218970/header.jpg?t=1676673536\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}