{
    "AppID": 1878290,
    "Name": "Project Utgardr",
    "Release date": "Feb 3, 2023",
    "About the game": "A young woman, Thyra, lives in a village near ancient mountains in the Scandinavia of the II century A.D. One day she will find a vertical crack on a facade of a mount never seen before. Curious about, she will slip into it and shortly after, behind her, the passage will collapse... An ancient road, through rocks and an uncontaminated nature, could lead to an exit from these old and mysterious mounts... or even somewhere else? Mystery, adventure and parkour will be just a taste, along with the numerous Norse and rocky puzzle altars, that hide an archaic secret concerning a tale that lies forgotten in the myth and legend of peoples. Project Utgardr is an adventure open-world, parkour, platform, in first-person and inspired by Norse and Viking mythology. Make Thyra escape from these impervious and harsh mountains, explore mysterious and beautiful environments and solve ancient puzzles of a previous civilization. Unfold the mystery that lies behind a forgotten and concealed tale... of a place that only the old sages might remember... 'And yet someone looks at her, and yet someone guides her, yet someone deceives her...' Features: Adventure and exploration (open world) In search of an escape from the mountains, you will have to explore various types of zones in order to proceed. Overcoming rocks or other natural obstacles and paying attention to any particular mark left on the way. Parkour and platforming Thyra will use her parkour skills to avoid or overcome various obstacles such as lopsided rocks, fallen trees, pillars suspended in the void. She could move by crouching, walking and running, climbing, wall running, climbing and lateral climbing only on certain type of surfaces. Norse and Viking mythology The Norse mythology is applied in various aspects of the game. From the dialogues, to the runes engraved in stone, to the interaction with 'typical' objects of this culture. Puzzles The puzzles will activate natural events that will allow an escape route or the continuation of the main path. The puzzles refer to elements of the Norse and Viking mythology, namely mainly altars and Menhirs. Mystery Mystery is a 'permeating' part of the adventure and there will not be too much guidance. A lot of space will be left to the inventiveness of the human being, who will find his expressions.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1878290/header.jpg?t=1675643961",
    "Price": 8.79,
    "Developers": "TronusGames",
    "Publishers": "TronusGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1878290/ss_539e9b3345d8f09513d7e703f483469618c6f1c6.1920x1080.jpg?t=1675643961,https://cdn.akamai.steamstatic.com/steam/apps/1878290/ss_9bcf2b9ff5d79d4c922d7b51c493108414a2d6ee.1920x1080.jpg?t=1675643961,https://cdn.akamai.steamstatic.com/steam/apps/1878290/ss_e9db48410eb17a8710bf3d2acaf0c920d3d8bde4.1920x1080.jpg?t=1675643961,https://cdn.akamai.steamstatic.com/steam/apps/1878290/ss_e775b79a64b367dc6b9635cbe4b1c4eae4f94a25.1920x1080.jpg?t=1675643961,https://cdn.akamai.steamstatic.com/steam/apps/1878290/ss_4eeee584bfb95331c04630cd65e2448f8e1607d8.1920x1080.jpg?t=1675643961",
    "Slug": "project-utgardr",
    "Meta Title": "Project Utgardr: Feb 3, 2023, TronusGames and Full Overview",
    "Meta Description": "Looking for information on Project Utgardr? Check out the release date (Feb 3, 2023), developer insights from TronusGames, and a complete game summary.",
    "Alt Text Image": "Official header image for Project Utgardr game - Steam 1878290",
    "Canonical URL": "https://gusku.site/game/project-utgardr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Project Utgardr\", \"description\": \"Looking for information on Project Utgardr? Check out the release date (Feb 3, 2023), developer insights from TronusGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 3, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"TronusGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TronusGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1878290/header.jpg?t=1675643961\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}