{
    "AppID": 2002850,
    "Name": "Raiden IV x MIKADO remix",
    "Release date": "Jan 31, 2023",
    "About the game": "A blast from the past soars into the present! A sci-fi shoot 'em up for the ages! Raiden IV x MIKADO remix combines the original arcade experience with modern-day features, allowing this series to perform like never before. With a remastered soundtrack, vertical screen play, new battle modes, and more, it's time to take off and take 'em down! Experience the return of this classic arcade shoot 'em up as Raiden IV x MIKADO remix soars onto PC! Enjoy an exhilarating lineup of content including brand-new levels, combat modes, play styles, and more. This sci-fi shooter launches gameplay to new heights with a remastered soundtrack and the addition of vertical screen play, allowing players to capture the original arcade experience like never before. Instill fear in your enemies with devastating attacks and earn the acclaimed title of Master Ace! In Raiden IV x MIKADO remix, you'll continue the fight against the extraterrestrial race known as the Crystals in their attempt to take over the world. The arcade classic steps up for its explosive arrival on PC. With this debut comes a suite of electrifying content featuring new levels, frenetic bullet-patterns, and intense gameplay modes such as Arcade, OverKill, Score Attack, and more! The addition of vertical screen play gives players a nostalgic blast from the past, while Double Play mode (the ability to pilot two ships at once) provides an exciting and challenging experience that's out of this world! Soar sky-high with a stellar soundtrack that features live performances and new arrangements, with the ability to switch between classic and remixed songs. With all this and more, Raiden IV x MIKADO remix stays true to its arcade origins while launching the franchise into the present! Play Your Way: Modes such as Dual Play and Double Play take your adventure to the next level! Modern Music: Remixed BGM from the original classic, including live performances and new arrangements! Old-school Vibes: Vertical screen play allows players to recreate the original arcade experience! A Suite of New Content: New levels, bullet-patterns, and modes, including Arcade, OverKill, Additional, Score Attack, and Boss Rush!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2002850/header.jpg?t=1675188244",
    "Price": 26.99,
    "Developers": "MOSS",
    "Publishers": "NIS America, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2002850/ss_c90b02a1a76b51a033c9a93929542fd754dbd51e.1920x1080.jpg?t=1675188244,https://cdn.akamai.steamstatic.com/steam/apps/2002850/ss_c3c640486e33b5efd8e01e18f7559e65d4c380c5.1920x1080.jpg?t=1675188244,https://cdn.akamai.steamstatic.com/steam/apps/2002850/ss_a8d186162737cb1e76c998500ddf6419476712d8.1920x1080.jpg?t=1675188244,https://cdn.akamai.steamstatic.com/steam/apps/2002850/ss_a83171d3bba8107e9036291c14e7e69188045c03.1920x1080.jpg?t=1675188244,https://cdn.akamai.steamstatic.com/steam/apps/2002850/ss_adde67c48b17d894a89ddb38c1938c42dd3950d6.1920x1080.jpg?t=1675188244,https://cdn.akamai.steamstatic.com/steam/apps/2002850/ss_5f5422c00e2e21bbee0ff9fe30f2b395fa588129.1920x1080.jpg?t=1675188244,https://cdn.akamai.steamstatic.com/steam/apps/2002850/ss_a24bc721b91148a94f4c828297ddb6eac2a8e272.1920x1080.jpg?t=1675188244",
    "Slug": "raiden-iv-x-mikado-remix",
    "Meta Title": "Raiden IV x MIKADO remix: Jan 31, 2023, MOSS and Full Ove...",
    "Meta Description": "Looking for information on Raiden IV x MIKADO remix? Check out the release date (Jan 31, 2023), developer insights from MOSS, and a complete game summary.",
    "Alt Text Image": "Official header image for Raiden IV x MIKADO remix game - Steam 2002850",
    "Canonical URL": "https://gusku.site/game/raiden-iv-x-mikado-remix",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Raiden IV x MIKADO remix\", \"description\": \"Looking for information on Raiden IV x MIKADO remix? Check out the release date (Jan 31, 2023), developer insights from MOSS, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"MOSS\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NIS America, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2002850/header.jpg?t=1675188244\", \"offers\": {\"@type\": \"Offer\", \"price\": 26.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}