{
    "AppID": 1039220,
    "Name": "RealFighter",
    "Release date": "Feb 12, 2023",
    "About the game": "RealFighter - Is a Fighting Game in Unreal Engine we add much features and later with Character Creater for Creating yourself in our Game. RealFighter is a fast-paced fighting game that immerses players in intense, high-stakes battles. The game features a diverse roster of characters, each with their own unique fighting styles and special moves. Players can choose from a variety of game modes, including single player arcade mode, versus mode for local multiplayer, and online multiplayer (coming soon) for players to compete against other players around the world. The game also features a robust combo system that allows players to string together devastating attacks and finish off opponents with powerful special moves. With its high-quality graphics and smooth gameplay, RealFighter is an exciting and engaging fighting game that offers hours of entertainment for players of all skill levels. Whether you're a seasoned fighting game veteran or new to the genre, RealFighter is sure to provide an enjoyable and satisfying gaming experience. Why Early Access? “Because we want bring you the Game while its in Development and you can say what we should change and your wishes and so we can improve the Game before its ready.” Approximately how long will this game be in Early Access? “How long you want until you say its ready. And when most features are ready Not so long we hope, do finish all and get out of early access” How is the full version planned to differ from the Early Access version? “We Plan: You can add your own Fighting Characters when its ready For now you can send us Photos and Names of Characters you want have in Game and Locations for Levels. More Levels (you can write us which we should add) Online Multiplayer (Coming SOon) Character Creator And more ideas will come, also write us if you have more good ideas for the game.” What is the current state of the Early Access version? “Career Mode for Playing and Win new Levels PVP - 2 Player Fighting Local with Keyboard or Controllers 7 Levels” Will the game be priced differently during and after Early Access? “No will stay same price.” How are you planning on involving the Community in your development process? “You can add your own Fighting Characters when its ready For now you can send us Photos and Names of Characters you want have in Game and Locations for Levels. You can write at Steam forums, by our website or by email you find in the game” RealFighter is a Fighting Game and at the moment its much Fighting but it will be more like StreetFighter or Mortal Kombat when its ready. You have now 7 Locations for Fights but we add much much more while development progress, Fight against CPU or against a other Player both at keyboard or controllers or mix like you want. We already have uch kicks, punchs and blocks but we will add so much more of them to make it a fun fighting game. More Infos about the RealFighter Game Coming Soon. Hey, We are GamePyro and we create games! We making Games / Software for more then 10 years now and we thought sharing some of the stuff we learned along the way would be a good way to make sure we can create more Games in the future and also give you a place to learn something new. This will focus mostly on our Games and prototypes of them. But prepare yourself for awesome Devlogs, Asset Store assets and plugin reviews, and tips regarding presentation style to get your game noticed out there. Discord Server access etc. You also support all our other Game creations with this like SNWBRD: Freestyle Snowboarding, W.A.N.T.E.D, RealFighter, CrashRace, OffRacing, The Dead Walking, Days Later and more. We try to Hand out early prototype versions of or Games once we think they are in a presentable stage. Please beware, our Prototypes are very rough and have mostly no gameplay goal at all. But all at Steam will have gameplay.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1039220/header.jpg?t=1676218735",
    "Price": 14.99,
    "Developers": "Gaming Limited",
    "Publishers": "Gaming Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1039220/ss_7da90edb0d27678427b1f6a7582a6b7cb61c924d.1920x1080.jpg?t=1676218735,https://cdn.akamai.steamstatic.com/steam/apps/1039220/ss_40d00a28ea305e6bccde5305744c4d57a422bcad.1920x1080.jpg?t=1676218735,https://cdn.akamai.steamstatic.com/steam/apps/1039220/ss_cc607a181e6963201155679db09f6b7427773cfc.1920x1080.jpg?t=1676218735,https://cdn.akamai.steamstatic.com/steam/apps/1039220/ss_297024db144e65cb3b454fc4538c0aba2e2a0e50.1920x1080.jpg?t=1676218735,https://cdn.akamai.steamstatic.com/steam/apps/1039220/ss_4cc6eace222487c52552d21ecdaa560969425e0d.1920x1080.jpg?t=1676218735,https://cdn.akamai.steamstatic.com/steam/apps/1039220/ss_cc46d4393ceb12d9865d650be337f5c562b089bb.1920x1080.jpg?t=1676218735,https://cdn.akamai.steamstatic.com/steam/apps/1039220/ss_87679a32020b22c75fd3bd8a8698585911266734.1920x1080.jpg?t=1676218735,https://cdn.akamai.steamstatic.com/steam/apps/1039220/ss_1636c0590eab790d2267b79db3ee1b734713578c.1920x1080.jpg?t=1676218735,https://cdn.akamai.steamstatic.com/steam/apps/1039220/ss_ad1e78b881938428234b4f844359658443f1d975.1920x1080.jpg?t=1676218735,https://cdn.akamai.steamstatic.com/steam/apps/1039220/ss_1c6dd6ca9d8617a7d4d47e711e103904a206f904.1920x1080.jpg?t=1676218735,https://cdn.akamai.steamstatic.com/steam/apps/1039220/ss_92860b301f2046454e263d59b1d35a8137e91545.1920x1080.jpg?t=1676218735",
    "Slug": "realfighter",
    "Meta Title": "RealFighter: Feb 12, 2023, Gaming Limited and Full Overview",
    "Meta Description": "Looking for information on RealFighter? Check out the release date (Feb 12, 2023), developer insights from Gaming Limited, and a complete game summary.",
    "Alt Text Image": "Official header image for RealFighter game - Steam 1039220",
    "Canonical URL": "https://gusku.site/game/realfighter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RealFighter\", \"description\": \"Looking for information on RealFighter? Check out the release date (Feb 12, 2023), developer insights from Gaming Limited, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 12, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gaming Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gaming Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1039220/header.jpg?t=1676218735\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}