{
    "AppID": 1649240,
    "Name": "Returnal™",
    "Release date": "Feb 15, 2023",
    "About the game": "Break the cycle as this award-winning third-person shooter brings bullet hell action to PC. Selene’s roguelike odyssey arrives with a suite of arresting graphical and performance-based enhancements to ensure an unforgettable journey. This includes the full Returnal™ experience, complete with Suspend Cycle, Photo and Co-op Modes, as well as the Tower of Sisyphus included from day one. BACKGROUND: After crash-landing on this shape-shifting world, Selene must search through the barren landscape of an ancient civilization for her escape. Isolated and alone, she finds herself fighting tooth and nail for survival. Again and again, she’s defeated – forced to restart her journey every time she dies. Through fast, relentless gameplay, you’ll discover that just as the planet changes with every cycle, so do the items at your disposal. Every loop offers new combinations, empowering you to push your boundaries and approach combat with a different strategy each time. Brought to life by stunning visual effects, the dark beauty of the decaying world around you is packed with explosive surprises. From high stakes, bullet hell-fuelled combat, to jaw-dropping twists and turns set across stark and contrasting environments. You’ll explore, discover and fight your way through an unforgiving journey, where mystery stalks your every move. Designed for extreme replayability, the procedural world of Returnal invites you to dust yourself off in the face of defeat and take on new, evolving challenges with every rebirth. The complete PC experience Includes support for achievements, complete with an in-game progress tracker. Five graphical pre-sets have also been included, alongside in-game performance metrics, including an FPS counter, a gauge for GPU and CPU usage and a latency tracker. Savour a dazzling visual experience 16:10, Ultrawide (21:9) and Super Ultrawide (32:9) aspect ratios offer an expanded field of view throughout Atropos – with wider aspects adding additional options for cinematics and the user interface. All this in stunning 4K. (1) On high-specification PCs, experience deeper immersion with ray-traced reflections and shadows, adding a whole new layer of lighting options – all customizable through various sliders. Performance enhancing technologies such as NVIDIA’s DLSS and NVIDIA NIS, as well as AMD’s FSR (2) , are also available. 1 Compatible PC and display device required. 2 Compatible PC and graphics card required for enhanced graphics.  Feel sensory overload, first hand Play with the DualSense™ controller to experience haptic feedback and dynamic trigger effects. (3) Alternatively, choose mouse and keyboard or other controller inputs – all with fully customizable button prompts. Expanded accessibility options have also been added, including an alt-fire crosshair charging notification, alongside a Co-op ping system. Added support for Dolby Atmos, as well as the option to select type of 3D Audio support. (4) Hear sound all around you with pinpoint accuracy, bringing environments to life and helping improve your reactions. 3 Wired connection required to experience the full range of in-game controller features. 4 3D Audio modes require stereo headphones or compatible speaker Co-op Mode: In Co-op Mode, share your journey through the shifting labyrinth of Atropos with another PC player. (5) The hostile nature of Atropos will remain unwavering, but the possibility of teamwork adds a whole new dimension and means of survival. Each player controls a different version of Selene, from different cycles. Using the Chronosis device located in each biome, the host player summons a friend or is matched with another random online player. The progress of the host determines the available item pool for the duration of the multiplayer session. Tower of Sisyphus: Next time you wake at the crash site, look up. You should be able to see a gate towards the Tower of Sisyphus, accessible as long as you’ve unlocked the Icarian Grapnel. (5) In this Tower, prepare for a new kind of challenge. It’s a nearly endless ascending gauntlet with a pure focus on combat, how high you build up your score and progress, exclusive items, Scout logs and as-yet unseen fragments from Selene’s story. 5 The Tower of Sisyphus, House sequences and Challenge Mode are not available in Co-op Mode. Cross-play with players on PlayStation®5 consoles is not supported. INTENSE COMBAT - Fight to survive in this third-person roguelike shooter. - Take on ruthless enemies in explosive, bullet hell-fuelled combat. THRILLING EXPLORATION - Manage equipment and resources carefully – every time you die, you restart from the beginning. - Scavenge alien tech for upgrades to enhance your abilities in future cycles. HAUNTING NARRATIVE - Piece together fragments of Selene’s memories as she seeks out answers. - Forge a personal connection with the planet as you explore its constantly evolving and decaying terrain.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1649240/header.jpg?t=1676476643",
    "Price": 59.99,
    "Developers": "Housemarque,Climax Studios",
    "Publishers": "PlayStation PC LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1649240/ss_3c260834df0c87cfc9ac1b457d0ec0eb3b9f367c.1920x1080.jpg?t=1676476643,https://cdn.akamai.steamstatic.com/steam/apps/1649240/ss_a91854c29cee0b4975862d174f03ff374ae5e26c.1920x1080.jpg?t=1676476643,https://cdn.akamai.steamstatic.com/steam/apps/1649240/ss_e15da2a195556b773ba8a982051f55de50d79a75.1920x1080.jpg?t=1676476643,https://cdn.akamai.steamstatic.com/steam/apps/1649240/ss_ea2f5b9dd34cd18e05970343edfb36ed0dade475.1920x1080.jpg?t=1676476643,https://cdn.akamai.steamstatic.com/steam/apps/1649240/ss_7ba021e0dd34bdcfff04a6e600323858acdbec4e.1920x1080.jpg?t=1676476643,https://cdn.akamai.steamstatic.com/steam/apps/1649240/ss_e16d48bbc96569c6d1bb77e7f252bd8c4d7724c2.1920x1080.jpg?t=1676476643",
    "Slug": "returnal",
    "Meta Title": "Returnal™: Feb 15, 2023, Housemarque,Climax Studios and F...",
    "Meta Description": "Looking for information on Returnal™? Check out the release date (Feb 15, 2023), developer insights from Housemarque,Climax Studios, and a complete game...",
    "Alt Text Image": "Official header image for Returnal™ game - Steam 1649240",
    "Canonical URL": "https://gusku.site/game/returnal",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Returnal\\u2122\", \"description\": \"Looking for information on Returnal\\u2122? Check out the release date (Feb 15, 2023), developer insights from Housemarque,Climax Studios, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 15, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Housemarque,Climax Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PlayStation PC LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1649240/header.jpg?t=1676476643\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}