{
    "AppID": 1148490,
    "Name": "Second Front",
    "Release date": "Jan 31, 2023",
    "About the game": "Introducing Second Front, the highly anticipated World War II strategy game developed by Hexdraw and published by Microprose. As the commander of a military force in the era of WWII, you must use your tactical prowess and cunning to lead your troops through intense battles and challenging missions. With a vast array of weapons, vehicles, and equipment at your disposal, you must carefully plan your attacks and outmaneuver your enemies to secure victory on the battlefield. But Second Front isn't just about strategy and tactics – it's also about the human element of war. You'll need to carefully manage your soldiers' morale and physical condition, as well as their equipment and ammunition. And with the ability to issue orders, you'll be able to react to changing situations and make strategic decisions that could make all the difference on the battlefield. With a rich, detailed world, Second Front is a game that will transport you back to the days of World War II. Whether you're a seasoned veteran of strategy games or just starting out, Second Front offers a challenging and rewarding experience that will keep you coming back for more. So why wait? Join the fight and experience the intense-strategic action of Second Front today! Second Front Key Features Second Front features 48 epic scenarios set in iconic locations of World War II, including the Stalingrad Factory District, Borisov, and Korostychiv. Second Front includes an editor to not only create and share custom maps but also complete campaigns. Players can then share their creations with the steam community - making Second Front an infinite tactical sandbox experience. Craft your own treacherous maps and scenarios in the integrated scenario and map editor. Then share with your allies on the steam community. Command the battlefield with absolute precision and realism. Outmaneuver your opponent while compensating for realistic persistent loss, unit fatigue and other unforeseen battlefield considerations. Choose to play as German, American or Russian forces, with unique leaders from each nation casting influence over the battlefield. Over 40 infantry units to command, each with its own tactical function and strategic value. Build a mechanized army from over 216 types of tanks, vehicles, ordnance and weaponry including MGs, Flamethrowers, Mortars, Panzerschrecks and Bazookas. Competitive AI, built from emergent AI behaviour, provides a more challenging and adaptive opponent on the battlefield. Easy-to-identify controls and mechanics make Second Front easy to play, while the in-depth strategic layers make it a challenge to master. Play over a wide variety of terrain, with 30 terrain types, 148 types of destructible and flammable buildings, bridges and environment pieces. More To Come Second Front continues to expand with plans to add new features and content. Some examples of what players can expect in future updates include new desert and jungle environments, artillery support, and close air support. The team is passionate about making Second Front a great game, and they are committed to continuing to improve and expand it over time.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1148490/header.jpg?t=1675255109",
    "Price": 29.74,
    "Developers": "Hexdraw",
    "Publishers": "MicroProse Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_f573c1d1109716896d7fa7182b6ac90a09d3cc9e.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_caaaae0157b0fd6ca9a3852998ea0c999780f1c4.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_13fb96909a2b578edfe0ea75231c6a1a5865785b.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_9b8ae330e0a6c8bf20fda78f4fea163a5c7ae8c4.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_f9d54b3e795a480e2c76e4ff0384a06f6f6a5fc1.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_d29c8633868fe4e9def89afa2f674e4104734db0.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_417ca65bb9fecd9b7e228b1fc266d80ad5917489.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_dd22c7972b5f222542bb5aebf47bf39a1010964e.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_5d3c92f936755963795b5192ab272da3dc1c3279.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_09a72566e499d2242c657616668a3ce96419c7d7.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_0ab0275dbc3f5f11a96b1d6811edaae738624d34.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_15f824fc5a6dc31756dee1d9fd25972438e5f1a6.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_0d1ddc0af4ea267b318b2d74c06b57cb438b0982.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_a126937acbfef4a6848c0a0420299f04e8a133d1.1920x1080.jpg?t=1675255109,https://cdn.akamai.steamstatic.com/steam/apps/1148490/ss_8c08343eaede30b07facb4cf5df7b67ef856d8ba.1920x1080.jpg?t=1675255109",
    "Slug": "second-front",
    "Meta Title": "Second Front: Jan 31, 2023, Hexdraw and Full Overview",
    "Meta Description": "Looking for information on Second Front? Check out the release date (Jan 31, 2023), developer insights from Hexdraw, and a complete game summary.",
    "Alt Text Image": "Official header image for Second Front game - Steam 1148490",
    "Canonical URL": "https://gusku.site/game/second-front",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Second Front\", \"description\": \"Looking for information on Second Front? Check out the release date (Jan 31, 2023), developer insights from Hexdraw, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hexdraw\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MicroProse Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1148490/header.jpg?t=1675255109\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.74, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}