{
    "AppID": 1912130,
    "Name": "SNWBRD: Freestyle Snowboarding",
    "Release date": "Feb 6, 2023",
    "About the game": "SNWBRD: Freestyle Snowboarding - Is a Snowboard Game like AMPED and inspired by the AMPED Original Xbox Game we add much features later with Character Creater for Creating yourself in our Game. SNWBRD: Freestyle Snowboarding is an action-packed, open-world snowboarding game that lets players experience the thrill and freedom of shredding the slopes. Players can choose from a variety of characters, each with their own unique snowboarding styles and special tricks. The game takes place in a massive, open-world mountain ranges, offering endless opportunities for exploration and discovery. 7 Big Locations at the moment: Brighton, Snow Summit, Stratton, Tahoe, Alpinbahn, Grand Canyon Gulch, Niseko (SlopeStyle) Players can ride down any of the many runs, hitting jumps and performing tricks along the way to gain points and boost their score. The game also features a wide variety of challenges and competitions, as well as a robust customization system that allows players to create their own unique snowboards and characters. With its realistic physics and high-quality graphics, SNWBRD: Freestyle Snowboarding want deliver an authentic and immersive snowboarding experience that will keep players coming back for more when finished but also now in the development Early Access Version. WHAT THE DEVELOPERS HAVE TO SAY: Why Early Access? “Because we want bring you the Game while its in Development and you can say what we should change and make better, and your wishes and so we can improve the Game before its ready. And make it a great game” Approximately how long will this game be in Early Access? “How long you want until you say its ready. And your whises are done.” How is the full version planned to differ from the Early Access version? We plan to: “Online Multiplayer Sponsor Challenges Pro Challenges And More Features You can add your own Characters when its ready For now you can send us Photos and Names of Characters you want have in Game and Locations for Levels. at FULL then also all AMPED 1 - 2 Locations when ready the AMPED 2 as DLC or as sperated Game will be checked what will be the best. Level Editor and Steam Workshop will be there As DLCs we want add other Locations that never was in any other Snowboard Game also Real Locations Ski Resorts (Example: Switzerland, France, Austria and more USA Locations) you can write us which locations and spots you want.” What is the current state of the Early Access version? “Current state most ready for SNWBRD Game: Career Mode Local Multiplayer (up to 4 Players Splitscreen) Keyboard and Mouse Control (Also 2 Players at 1 Keyboard) Controller Support (Xbox One, Xbox 360, PS4 and much more) AMPED 1 Locations Additional Locations: Train and Road Gaps at Tahoe Most Menu's and Scores are Ready Level Editor and Steam Workshop Local Sountrack and Online Radio you can listen to your favorite Online Radio Channel” Will the game be priced differently during and after Early Access? “Yes if all new Locations that was planned for a 2nd Version will be added in one Game then Price will be higher after Early Access or they get added as DLC will be checked before done. Also we not want make SNWBRD 2 we think better all then in one Game or add as DLCs new locations and functions.” How are you planning on involving the Community in your development process? “You can write us what we need change, what Locations we should add what mechanics and other whises everything you want can be added if possible.” You can do that in the Steam forums, trough our website and by email. Hey, We are Gaming International and we create games! Patreon We making Games / Software for more then 10 years now and we thought sharing some of the stuff we learned along the way would be a good way to make sure we can create more Games in the future and also give you a place to learn something new. This Patreon will focus mostly on our Games and prototypes of them. But prepare yourself for awesome Devlogs, Asset Store assets and plugin reviews, and tips regarding presentation style to get your game noticed out there. Discord Server access etc. You also support all our other Game creations with this Patreon like W.A.N.T.E.D, RealFighter and more. We try to Hand out early prototype versions of or Games once we think they are in a presentable stage. Please beware, our Prototypes are very rough and have mostly no gameplay goal at all. But all at Steam will have gameplay.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1912130/header.jpg?t=1675780689",
    "Price": 22.49,
    "Developers": "Gaming Limited",
    "Publishers": "Gaming Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_9c469d90d84350c5c0e041351231f2d561fbcc1a.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_142c241b81c2a5f13cf67ce7bfb565318e73e524.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_b5a217a597a6101fa180f752525b9fc8f2edbb48.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_8ef4bbd28233b5cb0b615181944de266d79ae382.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_383d64a3508a63ef431f4b8231dc5c93631cba39.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_4375851fc46fc0805125b68566e1ab9beb9b1e6c.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_64fe3599f76fc4a7a1e06b462f80a499aa76bde1.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_b35c5f62b1145287aea9a9ddaaf7503f57f117c8.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_f71d23579a2f9e10befc90c566b9eb002593627c.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_a8324a0bb658115fc601567f002d7c2112b82838.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_934d49c7f95c228ffe27460e19e1bc14a214a5eb.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_b38c26ab2f2e768703a099715619f63655a3b0a9.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_f4d829f82ed09f0e4f838f99eca3405e6ccd6c6b.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_8d020ff1c602715ad294fd27f7fad300f808b21f.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_49823bc736887b0e88ed8077fb497bba3edaab6c.1920x1080.jpg?t=1675780689,https://cdn.akamai.steamstatic.com/steam/apps/1912130/ss_65ba8c120691541880cbb85586c7695cd19f4cc3.1920x1080.jpg?t=1675780689",
    "Slug": "snwbrd-freestyle-snowboarding",
    "Meta Title": "SNWBRD: Freestyle Snowboarding: Feb 6, 2023, Gaming Limit...",
    "Meta Description": "Looking for information on SNWBRD: Freestyle Snowboarding? Check out the release date (Feb 6, 2023), developer insights from Gaming Limited, and a compl...",
    "Alt Text Image": "Official header image for SNWBRD: Freestyle Snowboarding game - Steam 1912130",
    "Canonical URL": "https://gusku.site/game/snwbrd-freestyle-snowboarding",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SNWBRD: Freestyle Snowboarding\", \"description\": \"Looking for information on SNWBRD: Freestyle Snowboarding? Check out the release date (Feb 6, 2023), developer insights from Gaming Limited, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 6, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gaming Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gaming Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1912130/header.jpg?t=1675780689\", \"offers\": {\"@type\": \"Offer\", \"price\": 22.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}