{
    "AppID": 2294860,
    "Name": "Space Game: Star We There Yet?",
    "Release date": "Feb 13, 2023",
    "About the game": "Welcome to “Star We There Yet?”, a game about traveling the cosmos, collecting extraordinary crew, and battling with friends and foes alike in exciting merge-conflict matchups! Engaging! A wholesome mix of idle “Catch Some Zs” gameplay and “Catch Them All” combat, “S.We.T.Y?” features a huge cast of loveable and loathsome characters, faster-than-light space travel set to a slower-than-slight soundtrack, and tons of intriguing destinations to discover and then immediately leave behind. Fun to play for five minutes or five hours, it’s the perfect game to play in between other more demanding games! Featuring: A cast of 65 characters to collect, each with their own special abilities and winning personalities. Just so many personalities. A relaxing (and oddly addicting) idle space travel experience. Crank the cosmic-y tunes and tap your ship to get up to max speed. Or just use the auto-tappers. That’s what they’re for. Hundreds of stories and Missions for your crew, as they encounter black holes, super novae, hostile aliens, evil twins, space cows, hair stylists, cosmic horrors, and Larry. A unique Merge PVP battle mode, with highly advanced turn-based combat. Merge ships together to form your fleet, deploy them to attack your enemies, or activate your Crew’s special abilities! Basically unlimited planets and star systems to explore. Well not really - but there’s a lot. Space is big! It’s right there in the name. A super chill soundtrack that will make the lightyears roll by in a contented vibe. Optional in-game purchases can boost your progress (and feed our artists), but the game is completely do-able Free To Play. Just like a real post-scarcity futuristic society! “Star We There Yet?” is a fresh and flavorful blend of different game styles, with a little something for everyone. When fully operational, it will allow players to battle across platforms and continents and probably solar systems eventually. What are you waiting for? Play Space Game: Star We There Yet? and set a course for adventure! (And cosmic horror. As previously mentioned.)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2294860/header.jpg?t=1676344800",
    "Price": 0.0,
    "Developers": "Rule Of Cool Studios",
    "Publishers": "Rule Of Cool Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2294860/ss_a45a215dd2581fee5a240402712829d70f0bda14.1920x1080.jpg?t=1676344800,https://cdn.akamai.steamstatic.com/steam/apps/2294860/ss_1376cc532e780df25f2fcba0ccaec3656baa2b29.1920x1080.jpg?t=1676344800,https://cdn.akamai.steamstatic.com/steam/apps/2294860/ss_049420816b8927bbc05f64565f276711d3fbf117.1920x1080.jpg?t=1676344800,https://cdn.akamai.steamstatic.com/steam/apps/2294860/ss_e045b3bd821c58ddaa370bb217cf6635f748af2d.1920x1080.jpg?t=1676344800,https://cdn.akamai.steamstatic.com/steam/apps/2294860/ss_8926ac2801c6daf10bb34dd89206f708a7adae25.1920x1080.jpg?t=1676344800",
    "Slug": "space-game-star-we-there-yet",
    "Meta Title": "Space Game: Star We There Yet?: Feb 13, 2023, Rule Of Coo...",
    "Meta Description": "Looking for information on Space Game: Star We There Yet?? Check out the release date (Feb 13, 2023), developer insights from Rule Of Cool Studios, and ...",
    "Alt Text Image": "Official header image for Space Game: Star We There Yet? game - Steam 2294860",
    "Canonical URL": "https://gusku.site/game/space-game-star-we-there-yet",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Space Game: Star We There Yet?\", \"description\": \"Looking for information on Space Game: Star We There Yet?? Check out the release date (Feb 13, 2023), developer insights from Rule Of Cool Studios, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 13, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rule Of Cool Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rule Of Cool Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2294860/header.jpg?t=1676344800\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}