{
    "AppID": 2116970,
    "Name": "StarStruck",
    "Release date": "Jan 31, 2023",
    "About the game": "A workplace accident marks the start of your journey and soon after you’ll be met with your first real choice of consequence. Nearly every choice impacts your journey as you navigate overlapping dimensions, space pirates, mad scientists, eccentric duos and a psychotic villain bent on wiping out everyone and everything. Make friends, uncover the past, learn their secrets and embrace your new powers as you are thrust into the middle of it all. You are the key. The fate of the universe is in your hands. But StarStruck is not just about the action and the mayhem. When things quiet down for a spell you will find yourself with a brief moment of peace and the opportunity to learn more about your companions. Nearly every character has a backstory they are willing to share, but not with just anybody. Be careful however, one wrong turn can forever destroy your chances of hearing these stories. At least until the universe loops again. Can you win them over and uncover it all? Some choices are purely there for a little bit of extra content with no repercussions, most of them change the story in some way, but every now and then you will get a choice that changes the flow of the story completely. If you go one way, you wake up in a mad scientist's laboratory. Choose the other option and you end up having to face off against space pirates. Nearly every chapter has an alternate story just waiting to be told. And the icing on the cake; you can get to the true ending regardless of which route you pick. Are you tired of characters wearing the same outfit throughout a visual novel, even if it doesn’t make sense? The knight gets an audience with the king in the royal court, while still wearing his pajamas (King, knight, or both, take your pick). What about a hunter out in the wilds searching for the lost city of Kala-something-or-the-other, wearing a black tux with fancy dress shoes? Well then, fear not! In StarStruck the story makes allowance for story driven attire. No longer will you have to suffer a businessman dressed like he just went through a cement mixer unless it’s part of the story! Most of the main cast come with a change in costume where appropriate, while several other characters have an outfit or two waiting to be unveiled as the story progresses. Length of several novels Good for more than one playthrough Sixteen (16) memorable characters to interact with 70+ locations In-depth affection system Multiple story arcs Multiple endings",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2116970/header.jpg?t=1675184054",
    "Price": 11.99,
    "Developers": "Strawberrytail",
    "Publishers": "Strawberrytail",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2116970/ss_6a34c72a1bef5d6fec5289f0156f919595751208.1920x1080.jpg?t=1675184054,https://cdn.akamai.steamstatic.com/steam/apps/2116970/ss_20d5c7b31eba2932e876a1c77079822395342bcd.1920x1080.jpg?t=1675184054,https://cdn.akamai.steamstatic.com/steam/apps/2116970/ss_79f09183fe743f6f70bcd0ad50df76e1c4bc107f.1920x1080.jpg?t=1675184054,https://cdn.akamai.steamstatic.com/steam/apps/2116970/ss_fd0ffc3fb47f415adefca9e33350322c00526714.1920x1080.jpg?t=1675184054,https://cdn.akamai.steamstatic.com/steam/apps/2116970/ss_7e8bb65f0a593a812dd4af20187caf311c9eb8e4.1920x1080.jpg?t=1675184054,https://cdn.akamai.steamstatic.com/steam/apps/2116970/ss_6aac70c82cb17324516ca7ec8d187f7ac164726a.1920x1080.jpg?t=1675184054,https://cdn.akamai.steamstatic.com/steam/apps/2116970/ss_5fb8a892190ac4301bc1712f64f12975e64a2442.1920x1080.jpg?t=1675184054,https://cdn.akamai.steamstatic.com/steam/apps/2116970/ss_2ea58e6d0951fc5135c84bbb9e38a1e935d052b4.1920x1080.jpg?t=1675184054",
    "Slug": "starstruck",
    "Meta Title": "StarStruck: Jan 31, 2023, Strawberrytail and Full Overview",
    "Meta Description": "Looking for information on StarStruck? Check out the release date (Jan 31, 2023), developer insights from Strawberrytail, and a complete game summary.",
    "Alt Text Image": "Official header image for StarStruck game - Steam 2116970",
    "Canonical URL": "https://gusku.site/game/starstruck",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"StarStruck\", \"description\": \"Looking for information on StarStruck? Check out the release date (Jan 31, 2023), developer insights from Strawberrytail, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Strawberrytail\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Strawberrytail\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2116970/header.jpg?t=1675184054\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}