{
    "AppID": 2278920,
    "Name": "SUBNET - Escape Room Adventure",
    "Release date": "Feb 8, 2023",
    "About the game": "Unleash your inner detective and stop the drkFORCE subway exploit! Get ready for an electrifying race against time in the heart of the city! A new hacker group, drkFORCE, has unleashed a brutal cyber attack on the subway, compromising the transport system and leaving chaos in their wake. But with you on the case, the fate of the city rests in capable hands. As an IT expert and subway traveller, you've been summoned to help track down the hackers and uncover their ultimate goal. With the clock ticking, every second counts as you dive headfirst into the mystery, navigating the underground and decoding clues to piece together the puzzle. But you're not alone on this pulse-pounding mission. An AI assistant is by your side, providing real-time updates, news and information to help guide you through the chaos. With their help, you'll have the advantage you need to stay one step ahead of the drkFORCE hackers and put an end to their reign of terror. Are you ready to join the fight against the drkFORCE? Buckle up and get ready for the cyber thrill ride of a lifetime! FEATURES Embark on a thrilling journey through an indoor and outdoor 3D environment, where every twist and turn is filled with mind-bending puzzles and hidden secrets waiting to be discovered. Harness your cunning and resourcefulness as you collect and utilize a vast array of objects to aid in your escape. Immerse yourself in a visually stunning world, featuring breathtaking 3D graphics and atmospheric environments. Let the pulse-pounding soundtrack and effects draw you deeper into the escape experience, adding to the tension and excitement with every step. Keep the adventure going with a full save system featuring multiple load slots, so you can customize every aspect of your journey to suit your preferences. CONTROLS: Movement: WASD + Mouse Inventory: I Menu: ESC Compatible with Official Xbox Series X/S Wireless Controller or similar controller. HINTS &amp; CLUES If you get stuck while playing SUBNET - Escape Room Adventure, don't worry! Just reach out to me via email or social media (check out the links on my website) and I'll be happy to give you a helpful hint or clue. 😊",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2278920/header.jpg?t=1676053576",
    "Price": 8.09,
    "Developers": "M9 Games",
    "Publishers": "M9 Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2278920/ss_bb18e89eb7dc5ef8fae953c7a6039da255262d40.1920x1080.jpg?t=1676053576,https://cdn.akamai.steamstatic.com/steam/apps/2278920/ss_d004e29706dac18a4e77297a7dcd47417b64b943.1920x1080.jpg?t=1676053576,https://cdn.akamai.steamstatic.com/steam/apps/2278920/ss_1da5fe2296f2f63c6087c4b6ec8c4879cf488a50.1920x1080.jpg?t=1676053576,https://cdn.akamai.steamstatic.com/steam/apps/2278920/ss_4fb34b38caf25f5bc02f05ed60a3e0888e300661.1920x1080.jpg?t=1676053576,https://cdn.akamai.steamstatic.com/steam/apps/2278920/ss_24aeee48bd773e7e91d7e0d7d269229d8998254c.1920x1080.jpg?t=1676053576,https://cdn.akamai.steamstatic.com/steam/apps/2278920/ss_3d30f6e4771cc6ce06d1a1122366ad2ed5293a52.1920x1080.jpg?t=1676053576",
    "Slug": "subnet-escape-room-adventure",
    "Meta Title": "SUBNET - Escape Room Adventure: Feb 8, 2023, M9 Games and...",
    "Meta Description": "Looking for information on SUBNET - Escape Room Adventure? Check out the release date (Feb 8, 2023), developer insights from M9 Games, and a complete ga...",
    "Alt Text Image": "Official header image for SUBNET - Escape Room Adventure game - Steam 2278920",
    "Canonical URL": "https://gusku.site/game/subnet-escape-room-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SUBNET - Escape Room Adventure\", \"description\": \"Looking for information on SUBNET - Escape Room Adventure? Check out the release date (Feb 8, 2023), developer insights from M9 Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 8, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"M9 Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"M9 Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2278920/header.jpg?t=1676053576\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.09, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}