{
    "AppID": 2153780,
    "Name": "Survival Nation",
    "Release date": "Feb 2, 2023",
    "About the game": "Survival Nation is an open-world online RPG VR game. The player takes on the role of one of the survivors of the zombie apocalypse . The main goal is to survive, but in order to do so, he has to cooperate with other members of the survival camp. In this game, you will: kill hundreds of zombies, acquire weapons, learn new skills, craft, explore the world, complete quests, and most importantly, fight for survival. To survive, you need to remember about food and water . You can get food in many ways: by fishing, hunting, gathering, or scouring abandoned houses. In a world where danger awaits you at every turn, taking care of sufficient needs is not the easiest thing to do. They say that cooperation is the key. It is no different here. Survival Nation is a game that focuses on multiplayer mode . You can join other players and participate in a joint adventure and exploration of the world. Talk to other people, exchange items and supplies, and cooperate during combat. Don't worry. If you still don't want to play with other players, you can enjoy Solo mode and have fun playing alone. Survival Nation is not lacking in RPG elements either. A whole bunch of missions and side activities are waiting for you. All this to take care of the progression of your character. You have at your disposal 3 unique skill trees , which you develop with each level you gain. It's up to you whether you want to focus on survival skills, combat, physical endurance, or a mix of all of them. In addition to the skill trees, there are quite a few weapons waiting for you to acquire, which you can upgrade . You'd probably like to know what more you can do in this game. In addition to quests and many forms of food gathering mentioned earlier, there are many other activities . You can search for items with a metal detector , climb on top of various spots, search for treasure using riddles , and much more. Survival Nation offers a mass of diverse weaponry at your disposal. Each weapon has not only different statistics but also a feeling, and a way of reloading. You can choose from a variety of weapons from categories such as pistol, shotgun, rifle, melee, and explosives . In addition, for real hunters, there is also a bow . Join our Discord server to be updated. Stay tuned and become a member of Survival Nation soon!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2153780/header.jpg?t=1675351071",
    "Price": 26.99,
    "Developers": "Wenkly Studio Sp. z o.o.",
    "Publishers": "Wenkly Studio Sp. z o.o.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2153780/ss_277380ae47b81a75d0203e0681de3252369da401.1920x1080.jpg?t=1675351071,https://cdn.akamai.steamstatic.com/steam/apps/2153780/ss_388a9fc64fb57b760bfeb015ce829927871f430b.1920x1080.jpg?t=1675351071,https://cdn.akamai.steamstatic.com/steam/apps/2153780/ss_64197111c4a9128b3d03e8b7acbdd7c74ab07d05.1920x1080.jpg?t=1675351071,https://cdn.akamai.steamstatic.com/steam/apps/2153780/ss_0938f5014922a552eda07f7b0c44b1e3d36d612a.1920x1080.jpg?t=1675351071,https://cdn.akamai.steamstatic.com/steam/apps/2153780/ss_010c1c5d4eb2aed139bc08d336750830de5094e0.1920x1080.jpg?t=1675351071",
    "Slug": "survival-nation",
    "Meta Title": "Survival Nation: Feb 2, 2023, Wenkly Studio Sp. z o.o. an...",
    "Meta Description": "Looking for information on Survival Nation? Check out the release date (Feb 2, 2023), developer insights from Wenkly Studio Sp. z o.o., and a complete g...",
    "Alt Text Image": "Official header image for Survival Nation game - Steam 2153780",
    "Canonical URL": "https://gusku.site/game/survival-nation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Survival Nation\", \"description\": \"Looking for information on Survival Nation? Check out the release date (Feb 2, 2023), developer insights from Wenkly Studio Sp. z o.o., and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 2, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wenkly Studio Sp. z o.o.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wenkly Studio Sp. z o.o.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2153780/header.jpg?t=1675351071\", \"offers\": {\"@type\": \"Offer\", \"price\": 26.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}