{
    "AppID": 2258530,
    "Name": "没落陰陽絵巻 - Tale of the fallen Onmyoji -",
    "Release date": "Feb 12, 2023",
    "About the game": "'''没落陰陽絵巻 - Tale of the fallen Onmyoji -'' is a visual novel game in which the protagonist; a member of a fallen Onmyoji family, finds his path and happiness by breaking the ''curse'' spread in the town with a kiss to the heroines.' This Bishojo Game released in 2021 under the 'Momoiro Pocket' brand has been reworked for the 'PandaShojo' platform for players of all ages worldwide to enjoy. ◆Introduction In every era, people are afraid of something mysterious. Pandemics, natural disasters, ghosts, and Yokai... The life of a fallen Onmyoji is renewed when a new 'threat' appears. ◆Synopsis A story in a world where Yokai coexist. In Hinomoto, a country that had chosen to coexist with Yokai, many incidents occur because of evil Yokai, but the existence of 'Onmyoji' was the way to solve these problems. However, a new 'Curse' has been spreading... Many Onmyoji have gathered to exorcise the 'Curse' except the protagonist 'Zen Kamono', due to being a member of a fallen onmyoji family. While researching on his own, he discovers that a 'kiss' is the most effective against the curse...! ◆Characters Hazuki Tsunashi 'I hear Onmyoji doesn't ask gods for help, but are you different?' A priestess from a noble family with both talent and high status. An expert in the extermination of Yokai and a leader of other priestesses. Neat looking but is occasionally abusive. She wants to get along with others, but her harsh personality tends others to avoid her. Midori Suzumiya ”I don't mind being called a doll because I have no ego.' A hybrid Onmyoji also with the power of a priestess. Her family is an enemy of Hazuki and often turns against Zen since he is close to Hazuki. Has a rivalry with Hazuki due to the constant comparisons with her. Sakuya 'I don't care whether it's the human or the Yokai who rule this country.' A 'Yoko' with a free spirit, who loves having fun and a drink. From her sketchy personality, it is questionable if she is an ally or a foe. It is said that she becomes a great Yokai when reaching nine tails, but she is still in the development process. Often called a doll because of her quiet nature with no ego. Takane 'I believe in you master. I know you will get through this crisis.' A Shikigami that serves Zen. Being together since childhood, there is a special bond between them. Obedient, but sometimes teases Zen. To her, Zen is a master she adores with all her heart, a child in need of care, but sometimes thinks of him as a husband. Nagisa Tsunashi 'She's becoming a great girl. She could be the one saving Hinomoto.' Hazuki's mother who is retired, but still possesses the strong powers of a priestess. There is no priestess in Hinomoto who doesn't know her name. She looks calm and gentle, but really smart. She is a widow but she is happy to spend her days with Hazuki. Zen Kamono A protagonist that comes from a fallen Onmyoji family. Runs his own business called 'Yokai Detective business'. Reads and studies old books and dreams about becoming a success in his generation. Not just Takane, he has other small Yokai helpers.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2258530/header.jpg?t=1676265977",
    "Price": 19.99,
    "Developers": "CyberStep, Inc.,Rideon Works Co. Ltd,",
    "Publishers": "CyberStep, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2258530/ss_cb6ebbd52ab565ec61674370a0924f271489d8e2.1920x1080.jpg?t=1676265977,https://cdn.akamai.steamstatic.com/steam/apps/2258530/ss_9be62a9067be8b713de4415825c904c8e2e3b45b.1920x1080.jpg?t=1676265977,https://cdn.akamai.steamstatic.com/steam/apps/2258530/ss_7da8478e37dae8899c210f1064efd7f1e75e13a2.1920x1080.jpg?t=1676265977,https://cdn.akamai.steamstatic.com/steam/apps/2258530/ss_287f7297e99ba8d004e123f55ce103b4dc439d26.1920x1080.jpg?t=1676265977,https://cdn.akamai.steamstatic.com/steam/apps/2258530/ss_69746e6ee617169f30e7bec97925db045633471a.1920x1080.jpg?t=1676265977,https://cdn.akamai.steamstatic.com/steam/apps/2258530/ss_f68e192948453f7eacd39e426bb59d0efa851f20.1920x1080.jpg?t=1676265977,https://cdn.akamai.steamstatic.com/steam/apps/2258530/ss_10b34344becc06bfb1b91676c393a742f568cc04.1920x1080.jpg?t=1676265977,https://cdn.akamai.steamstatic.com/steam/apps/2258530/ss_db87bbafa68030c21521da3f0108291cd90202b1.1920x1080.jpg?t=1676265977,https://cdn.akamai.steamstatic.com/steam/apps/2258530/ss_816bd1d71bb58969b779d22e70553fe85ea7664d.1920x1080.jpg?t=1676265977",
    "Slug": "tale-of-the-fallen-onmyoji",
    "Meta Title": "没落陰陽絵巻 - Tale of the fallen Onmyoji -: Feb 12, 2023, Cybe...",
    "Meta Description": "Looking for information on 没落陰陽絵巻 - Tale of the fallen Onmyoji -? Check out the release date (Feb 12, 2023), developer insights from CyberStep, Inc.,Rid...",
    "Alt Text Image": "Official header image for 没落陰陽絵巻 - Tale of the fallen Onmyoji - game - Steam 2258530",
    "Canonical URL": "https://gusku.site/game/tale-of-the-fallen-onmyoji",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6ca1\\u843d\\u9670\\u967d\\u7d75\\u5dfb - Tale of the fallen Onmyoji -\", \"description\": \"Looking for information on \\u6ca1\\u843d\\u9670\\u967d\\u7d75\\u5dfb - Tale of the fallen Onmyoji -? Check out the release date (Feb 12, 2023), developer insights from CyberStep, Inc.,Rid...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 12, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberStep, Inc.,Rideon Works Co. Ltd,\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CyberStep, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2258530/header.jpg?t=1676265977\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}