{
    "AppID": 1946070,
    "Name": "Ten Dates",
    "Release date": "Feb 13, 2023",
    "About the game": "Ten Dates is the sequel to the interactive rom-com, Five Dates. Misha, a millennial from London in search of that elusive in-person connection, tricks her best friend Ryan into going to a speed dating event with her. Each with their own five potential matches, Misha and Ryan must pluck up the courage and turn on the charm to date wildly different personalities. Throughout the game, your choices and interactions will either strengthen or weaken your relationship with your date. Amidst a branching, multi-directional chain of conversation topics and deep-dive questions, Misha and Ryan are faced with ice-breaker games, awkward scenarios and unexpected truths. Will either find love? A live-action romantic comedy with 12 hours of total footage Directed by Paul Raschid (Five Dates, The Complex) Authentic representation of groups including but not limited to; disability, neurodiversity and LGBTQ+ Real-time Relationship Status Tracking that influences the story as you play Pause your choices to interact with your community, your friends, or to just give you more time (optional) Ryan, a young urban heart-throb on a quest to find true love amidst the complexities of city dating. He wears his emotions on his sleeve and his words have the power to endear or alienate. Misha is a captivating city single searching for her perfect match. Her magnetic charm and quick wit leave a lasting impression on all who cross her path. With a sparkling personality, is she the missing piece to someone's love puzzle? A staple of the social scene, Bash is the ultimate lad, always ready for a good time with his friends. But is there more to him than just sports, beer, and crude jokes? Can you see through his exterior and discover the charming and endearing qualities within? Alpha and financially mobile, Brandy is the quintessential hustler. Keep up with her as she puts you to the test in a race to win her over. Learn about her journey and how she became a trailblazer in the city of London. Attractive, exciting, and devilishly charming, Ty is the ultimate bad boy with a hint of mystery. Will you be able to resist his rough exterior and see the potential for redemption within him? Or will his wild ways lead to heartbreak? A non-conformist rebel with a sharp wit. Explore the world of activism and arcane interests with this guarded, passionate firecracker. Meet the ultimate nice guy, dependable, kind and always ready to put a smile on your face. With a good job and a solid social life, he offers a pleasant dating experience. But is there more to him than meets the eye? Will you see through his surface-level charm and find the genuine interest he has in you? Get ready to break a sweat with this clean-living, driven athlete. Join her in her quest to break through society's slow acceptance of female sports and tackle the challenges she faces as a female athlete. The quirky and lovable coder with a sense of humour. As technology grows, so does Lucas's relatability. He may not be a dating expert, but his personable nature and trendy tech interests make him a standout in the dating scene. A PhD student with brilliance, charm, and a zest for life. Get ready for a thought-provoking journey as you join forces with this easy-going genius. A confident, approachable individualist with a relatable personality. Despite her un-curated exterior, Hazel hides a deeper story waiting to be uncovered. Join her as she navigates the dating scene and discovers what it means to be truly authentic. An urbane, suave, and smooth-talking event host. With his charm and effortless conversation skills, Derek will sweep you off your feet. A diverse cast includes Rosie Day (Outlander), Charlie Maher (Conversations with Friends), Meaghan Martin (Until Dawn, Camp Rock), Sagar Radia (Industry), Sam Buchanan (The Power), Kaine Zajaz (The Witcher), Ellie James (I May Destroy You), and Rhiannon Clements (Death On The Nile).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1946070/header.jpg?t=1676385243",
    "Price": 14.39,
    "Developers": "Wales Interactive,Good Gate Media",
    "Publishers": "Wales Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1946070/ss_8acaa6130fdbfdf7046ab4943a465ae55f6f36a1.1920x1080.jpg?t=1676385243,https://cdn.akamai.steamstatic.com/steam/apps/1946070/ss_e76b7c4c8dc60f63604874d452599ceeb2cd1e62.1920x1080.jpg?t=1676385243,https://cdn.akamai.steamstatic.com/steam/apps/1946070/ss_e42cd53ec2a6b11011ad15a17501f97708073b85.1920x1080.jpg?t=1676385243,https://cdn.akamai.steamstatic.com/steam/apps/1946070/ss_5045c466f6d056f53446a860ef8cce43eb1c7f4f.1920x1080.jpg?t=1676385243,https://cdn.akamai.steamstatic.com/steam/apps/1946070/ss_d3caa73ec61c7773553b978efdc86cacf0fa3010.1920x1080.jpg?t=1676385243,https://cdn.akamai.steamstatic.com/steam/apps/1946070/ss_41fc94246d7e16c40679ae7c86ac23183bc74c5c.1920x1080.jpg?t=1676385243,https://cdn.akamai.steamstatic.com/steam/apps/1946070/ss_08ba5d8f00fadad4f8f74823ae7866695e9dbc0d.1920x1080.jpg?t=1676385243,https://cdn.akamai.steamstatic.com/steam/apps/1946070/ss_47574810fc7370df6d1d626cd95428ea7677ecf4.1920x1080.jpg?t=1676385243,https://cdn.akamai.steamstatic.com/steam/apps/1946070/ss_642eacb86dc310570a1435a7feb1345c7cdfc554.1920x1080.jpg?t=1676385243,https://cdn.akamai.steamstatic.com/steam/apps/1946070/ss_9c4451b08d3fc03e1d2f328cb687560c4cbb067c.1920x1080.jpg?t=1676385243",
    "Slug": "ten-dates",
    "Meta Title": "Ten Dates: Feb 13, 2023, Wales Interactive,Good Gate Medi...",
    "Meta Description": "Looking for information on Ten Dates? Check out the release date (Feb 13, 2023), developer insights from Wales Interactive,Good Gate Media, and a comple...",
    "Alt Text Image": "Official header image for Ten Dates game - Steam 1946070",
    "Canonical URL": "https://gusku.site/game/ten-dates",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ten Dates\", \"description\": \"Looking for information on Ten Dates? Check out the release date (Feb 13, 2023), developer insights from Wales Interactive,Good Gate Media, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 13, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wales Interactive,Good Gate Media\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wales Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1946070/header.jpg?t=1676385243\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}