{
    "AppID": 2069180,
    "Name": "The King's Dilemma: Chronicles",
    "Release date": "Jan 30, 2023",
    "About the game": "Welcome to the Kingdom of Ankist: a place of daring expeditions, gruesome battles, and arcane mysteries. You play as the Head of the Council, the leader of the King’s inner circle. Listen to the advice of your Council of Houses, or overrule their decisions. Face hundreds of dilemmas where every choice you make may affect your relationship with the other Houses, influence the well-being and resources of the kingdom, and change the course of history itself. Discover the lands of Ankist over a story spanning across tens of generations. Form alliances, survive betrayals, and prepare for the final uprising foretold by an ancient prophecy. Will you act for the greater good, or will you think only of yourself? Explore the map of Ankist and see the Kindom’s problems currently at hand. Choose one, and the Council will be summoned to make a decision: do we send help to people hit by famine? Should we wage war against that northern tribe raiding the villages across our border? The Houses will cast their vote: “Aye” or “Nay” based on their personal interest and political stance. At that point, you might decide to influence the vote, spending your House’s finances to corrupt members of the council, or consuming some fo the limited “power” points you are given for the rule of each King. Each decision you make has consequences both on your relations with the other Houses and on the Kingdom’s resources, which in turn might result in the King abdicating or being overthrown. But they will also make more dilemmas become available on the map. Based on the resources standing at the end of the current King’s rule and your moral alignment, you will be awarded “greed” and “influence” points, which you’ll be able to spend to research technology, start expeditions, or build structures. Which of these will become available depends on the choices you made. Each of the above will award you money and resources during the rule of each King, in addition to changing the events of the final uprising you will be preparing for. Play as one of twelve different houses, each with their own narrative goal Discover 300+ story-driven dilemmas through Ankist and its neighboring kingdoms Choose branching narrative paths across six intertwined storylines Explore multiple endings, with each playthrough lasting 3 to 4 hours Use influence or corruption to control the Council Invest in research, technology and buildings Play across generations, choose your heir as well as their personality and goals Always be preparing for the final battle The King’s Dilemma: Chronicles tells the story of Ankist, a fictional medieval kingdom in the continent of Lywik. The structure of the kingdom is feudal: the Duchies and the Marks are managed by their ruling Houses, many of which also have their representatives sitting at the Council, a governing body ruling in the name of the King located in Lybra, the capital city of the Kingdom. As the leader of the Council, all social classes will come asking for your help: Merchants, Scholars, the Army, the Cult of the Mother, and of course, the People. It will be your task to drive the choices of the Council and satisfy their requests… but you’ll also have to manage the resources of the Kingdom, and keeping everyone happy won’t be easy. Your main interest is obviously to make Ankist prosper; however, you are also trying to increase the power and the prestige of your own family over the others. The campaign spans decades and generations, and you will assume the role of different representatives of your House over the course of the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2069180/header.jpg?t=1675181818",
    "Price": 14.99,
    "Developers": "Big Trouble",
    "Publishers": "Big Trouble",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2069180/ss_722fca18753ba9880109a81dfa5d9c217048c837.1920x1080.jpg?t=1675181818,https://cdn.akamai.steamstatic.com/steam/apps/2069180/ss_61b216ce66c84ab23379a7adc71dca5196d713d3.1920x1080.jpg?t=1675181818,https://cdn.akamai.steamstatic.com/steam/apps/2069180/ss_a5a200f5ae10382a02408d07bbadadf15f18a6b9.1920x1080.jpg?t=1675181818,https://cdn.akamai.steamstatic.com/steam/apps/2069180/ss_4d5f82e9fabee146d55da642667c01af7fffaa2f.1920x1080.jpg?t=1675181818,https://cdn.akamai.steamstatic.com/steam/apps/2069180/ss_67260d57a469faa919afd03329ab322bd05fb43c.1920x1080.jpg?t=1675181818,https://cdn.akamai.steamstatic.com/steam/apps/2069180/ss_48e1eba541028f16fd4214ae71df35cadff07613.1920x1080.jpg?t=1675181818,https://cdn.akamai.steamstatic.com/steam/apps/2069180/ss_699b5d5232f8de0ef94e3c1ff47a2d0f94d81589.1920x1080.jpg?t=1675181818,https://cdn.akamai.steamstatic.com/steam/apps/2069180/ss_c16ff7dbef63fff3771a85b5f7e538bbcd1d54c0.1920x1080.jpg?t=1675181818",
    "Slug": "the-king-s-dilemma-chronicles",
    "Meta Title": "The King's Dilemma: Chronicles: Jan 30, 2023, Big Trouble...",
    "Meta Description": "Looking for information on The King's Dilemma: Chronicles? Check out the release date (Jan 30, 2023), developer insights from Big Trouble, and a complet...",
    "Alt Text Image": "Official header image for The King's Dilemma: Chronicles game - Steam 2069180",
    "Canonical URL": "https://gusku.site/game/the-king-s-dilemma-chronicles",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The King's Dilemma: Chronicles\", \"description\": \"Looking for information on The King's Dilemma: Chronicles? Check out the release date (Jan 30, 2023), developer insights from Big Trouble, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 30, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Big Trouble\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Big Trouble\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2069180/header.jpg?t=1675181818\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}