{
    "AppID": 1906570,
    "Name": "The Art of War: Card Game",
    "Release date": "Feb 1, 2023",
    "About the game": "Overview The Art of War: Card Game is a non-collectable game where you can lead one of four factions and fight for dominance in fierce card battles against other players online. This game is a digital version of our tabletop version with some limitations. In the digital version matches are limited by two players (instead of 4 in the tabletop version) and only 'versus' mode is available. On the other hand, digital version of the game provide quick and easy search for opponents, ranking system and solo mode where the player can fight with AI without a human partner. All other aspects of the game are equivalent in both versions of the game. Gameplay Four factions of your choice: The Kingdom of Etlia is a kingdom of the middle lands, which for a long time existed without wars and gave the world many literature and art masterpieces of. Its culture is known far beyond the borders of the kingdom, but the civil war made the country easy prey in the eyes of its neighbors. The self-defense units of Etlia are not so strong, but the heroes of these lands are able to inspire the troops by restoring their health and recruit additional units under their banners. Nordkönigreich is the kingdom of the north, a nation that has tempered its character in centuries of incessant wars. Artillery, battle mages and warriors of this faction can unleash all their power and fury on the enemies of the Kaiser and inflict large damage upon them, from which they can never recover. The Sarioantian Empire , which was once the most powerful nation on the continent, is now in a political crisis. Despite the shaky position and unrest in society, its new leader intends to return the empire to greatness. This faction specializes in covert operations that can leave the enemy without an army and disrupt enemy strategy before Sarioantia deploys its main forces. The Greatunion Tsardom is a religious kingdom of the east, in which the practice of magic is prohibited. However, despite the absence of magicians in the ranks of its troops, the troops of this nation are the most powerful and disciplined, and clerics give protection to soldiers from enemy magic attacks. Ten cards Each player starts the game with 10 cards in their hands. Players draws cards only between rounds, so during a round you can only count on card you have in your hand. Use your cards wisely! Before the game you can construct your main deck in Deck Builder or you can play with default one. Best out of three To win the game, you need to score two Victory Points. The loser of the round gets 0 points, and the winner gets 1 point. A draw gives 1 point to each player. If two rounds did not reveal a winner, then an additional (third) round is played. Two rows Each player's field, which is called the player's side in the game, consists of two equal rows in which the player places his cards. The rows are no different from each other and only allow you to disperse your forces, depending on the tactics chosen. Six cards per row Each row is limited to 6 cards. Player cannot place another card in a row with 6 cards. Also, the accumulation of the main forces in one row can be a good target for an enemy attack or effect. One turn - one card During player's turn, each player must play one card from his hand and if they can't, then they must pass. The passing player no longer participates in the round and passes the initiative to the opponent. Winner of the round At the end of each round, the health of all units on a player's side is calculated. The player who controls the army with more health wins the round. If the combined health of units is the same for two or more players, then a draw is declared. Story After the death of King of Etlia – Louis VII – a civil split began in the country, which soon escalated into a civil war. The brother of the late king, supported by some aristocrats, did not acknowledge the illegitimate son of the monarch – Charles – and declared himself as the new king. General Covali de Villefort – the commander of the royal forces of Etlia, as well as the regent of the young monarch – remained loyal to the late king and is trying to protect the heir and get even from the opposition. Seeing the state of the kingdom, Nordkönigraich, in the person of Kaiser Alexander III the Ferocious, under an imaginary pretext, declares war on Etlia and occupies its northern territories. Sarioantia, in the person of Emperor Serginian ebn Julius, fearing that the northerners will occupy the gold mines and trading centers of Etlia, announces that Etlia has violated neutral status and introduces its troops into the southern territories of the country, in an attempt to prevent the north from strengthening in the region. General Kovali de Villefort, now forced to fight at once with Sarioantia, the Northern Kingdom and the rebels, asks for help from his eastern neighbor – the Greatunion Tsardom, which is now ruled by the young and ambitious Vladislav IV – the Terrible – the son of his great father, with whom the late King of Etlia had friendly relations. In a small kingdom, a war has now begun between four forces, each of which sees itself as a beneficiary of this war. In addition, the situation is complicated by groups disloyal to De Villefort, who either situationally enter alliances or fight against everyone.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1906570/header.jpg?t=1675255389",
    "Price": 0.0,
    "Developers": "Brightdawn Entertainment",
    "Publishers": "Brightdawn Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1906570/ss_2791c55f90c7cda6d431c84284c305c4cc87758b.1920x1080.jpg?t=1675255389,https://cdn.akamai.steamstatic.com/steam/apps/1906570/ss_e050c1e9db017c099b5df4c976de6f207490112e.1920x1080.jpg?t=1675255389,https://cdn.akamai.steamstatic.com/steam/apps/1906570/ss_c1bf3d2a8f595a59264f993b13929ae632af88cf.1920x1080.jpg?t=1675255389,https://cdn.akamai.steamstatic.com/steam/apps/1906570/ss_40e3ff40d8028fefe624ff64644abf769a7e542f.1920x1080.jpg?t=1675255389,https://cdn.akamai.steamstatic.com/steam/apps/1906570/ss_9f7fa68a8bad6ed0f6643a969d5d875f93e73101.1920x1080.jpg?t=1675255389",
    "Slug": "the-art-of-war-card-game",
    "Meta Title": "The Art of War: Card Game: Feb 1, 2023, Brightdawn Entert...",
    "Meta Description": "Looking for information on The Art of War: Card Game? Check out the release date (Feb 1, 2023), developer insights from Brightdawn Entertainment, and a ...",
    "Alt Text Image": "Official header image for The Art of War: Card Game game - Steam 1906570",
    "Canonical URL": "https://gusku.site/game/the-art-of-war-card-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Art of War: Card Game\", \"description\": \"Looking for information on The Art of War: Card Game? Check out the release date (Feb 1, 2023), developer insights from Brightdawn Entertainment, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 1, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Brightdawn Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Brightdawn Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1906570/header.jpg?t=1675255389\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}