{
    "AppID": 1927520,
    "Name": "The Last World",
    "Release date": "Feb 3, 2023",
    "About the game": "The Last World is a sci-fi simulation game with elements of space, modding and automation in which the player has to discover new planets and terraform them. The world that we all knew and loved so well is dead. He was killed by a bacterium born in a test tube of a scientist who was trying to create a panacea - a cure for all diseases. The result is one - the disappearance of all life on the planet. On the verge of extinction, people created the 'Ironborns' project - an artificial intelligence whose goal is to find a planet suitable for the existence of biological organisms in the endless ocean of stars and give a person a second chance to exist. The player will have to build and develop his base, explore, trade and much more. The game features a factory mechanic where the player can produce more expensive resources for sale or upgrades. The player will extract resources from the bowels of the planets and process them to obtain components that are more expensive to manufacture. The Last World is a sandbox where the player is free to choose his own path. You control robotic mechanisms (robots) that have landed on the planet to complete their mission. During the game, you have to build buildings, manage the economy, explore the territory and study the area that surrounds you. Your mission is to give people a second chance, give them hope and a new home. The game generates planets - from deserted, lifeless planets to heavenly giants. Each planet is unique and will dictate its own rules for the game. Every planet is a challenge. You will have to explore the place of deployment to make sure that it has all the necessary resources to build and strengthen the base. Explore flora and fauna, always be one step ahead. In the game The Last World all unique units are modular. This means that you can build your character, literally, piece by piece. To do this, the game has a powerful, in its functionality, character costructor, where the game will give you the opportunity to assemble your own unique character from dozens of modules. In the game The Last World units use tools (a local analogue of weapons), which can also be modified in the constructor. Each tool can be matched with dozens of modules to make it better and more powerful. Build huge production plants for processing, extraction or production of components. Build supply chains to be as productive as possible and get more productivity gains. Accumulate resources in storage, and then send them to the trading floor to earn more currency to continue your mission. The game The Last World has over 40 fully functional buildings that you can build on uncharted locations. In the game The Last World you have to build your base for the production of new components, and for this you will need a lot of resources. All resources are scattered around the location and are divided into two types - underground and aboveground deposits. You will be able to extract and process - coal, stone, oil petrolium, natural gas, as well as various kinds of ores. As you progress through the technology tree, more and more sophisticated technologies for the extraction and processing of natural resources will become available to you. All units, drones, buildings have their own inventory. The inventory is a cellular structure, where all items have their own size and weight. You have to deal with inventory management, because each of its cells is worth its weight in gold. Look for or create more capacious unit modules, or use modules to improve your building storage. We built factories, accumulated resources, collected items - you can go to the trading floor* and sell all the accumulated good to earn more in-game currency. The space market works exclusively with in-game currency. However, there are exceptions - sometimes traders can offer profitable deals or even barters. * will be available after the game is released in early access As the game progresses, you will want to develop and for this you will need a technology tree. In it, you can open the branches you need to research more complex technologies. Do research and improve your base and units*. There will be three trees in the game - the main tree, units and buildings. Each tree will open up more possibilities for you. * unit and building technology tree will be available after the game is released in early access All planets have their own ecosystem - somewhere it will be hot, somewhere it will be cold, and somewhere endless winds will blow. You will have to face dynamically changing weather that can catch you off guard and turn your journey into chaos. Come face to face with temperature phenomena and find out how they affect gameplay. I plan to release the game in Early Access in the first quarter of 2023 . During Early Access, I will change and develop the game based on your feedback. During this time, I will add new features and content, improve the balance and introduce new game features.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1927520/header.jpg?t=1675472448",
    "Price": 17.09,
    "Developers": "Erochin",
    "Publishers": "Erochin",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_113c7c6db6029848a6cc228a1d70210ebffa7a71.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_c3b1bdc84015a0e394897e203622efae35b60d6e.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_e94187a914f7aa88292262cd8dc9261368ee40f6.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_c85ddfaed8f1410f077af4bd1224433843c330d7.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_797938ac9f9d104941056c5b752fb47cc5bd2a2f.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_b32d9bfff49c56d8faa2a8c0416d789d21e3cde0.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_345dd4b35f057819f30833a104cb264e799b623d.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_a83003af9218abea291ac28ffa5fd5b38d8979d9.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_26664630421499127dfa3829c3acf6aeef389024.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_0f6c4ec406bec0568a555d656751522e0b159abf.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_d6f96b3af4e9212d486ceff58eb1d2420aa1670a.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_fe4d61bb954e4b521f710f420357f535c99a000c.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_84574e2e58c3f07ddc6c114e1121fde7f08d8078.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_c089e80fb8017aab8f6852888087f8c18fa1be52.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_d2c0cab128e495ad99601dbca8e3240dcffb5ae0.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_3de2608f9140064bae2356368745a2cb076e0040.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_cfb388d6238e02671b36138a8100376a739c3c1b.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_560562a365ae5c9de94cff9071684725ddb4bb18.1920x1080.jpg?t=1675472448,https://cdn.akamai.steamstatic.com/steam/apps/1927520/ss_32f56d4eabcc541b151a72010749bb0032eec2a9.1920x1080.jpg?t=1675472448",
    "Slug": "the-last-world",
    "Meta Title": "The Last World: Feb 3, 2023, Erochin and Full Overview",
    "Meta Description": "Looking for information on The Last World? Check out the release date (Feb 3, 2023), developer insights from Erochin, and a complete game summary.",
    "Alt Text Image": "Official header image for The Last World game - Steam 1927520",
    "Canonical URL": "https://gusku.site/game/the-last-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Last World\", \"description\": \"Looking for information on The Last World? Check out the release date (Feb 3, 2023), developer insights from Erochin, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 3, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Erochin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Erochin\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1927520/header.jpg?t=1675472448\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.09, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}