{
    "AppID": 1857080,
    "Name": "The Last Starship",
    "Release date": "Feb 15, 2023",
    "About the game": "The Last Starship is the latest video game from acclaimed Indie developer and creator of Prison Architect, Introversion Software. The Last Starship will shortly be released into Early Access and regular updates will be released containing content drops, bug fixes and updates based on your feedback. We need your help to make our vision a reality and once purchased, Introversion pledges never to charge you for any future update. As your crew awaits your orders, it’s time to build your ship. Whether you select from a range of pre-packaged fleets or build your own, you’ll need to use the local depot to grab everything you need. Start with a reactor to power your engines, lay down your ship’s pipework and electrical systems to ensure optimal power, while managing life support and other ship-wide systems. Without the right O2 supply and CO2 scrubbers, your crew won’t last long... As you explore the universe and complete missions, you’ll earn rewards to continuously upgrade all aspects of your ship. The sector map is the gateway to your procedurally generated universe. Each system has unique missions, scenarios and anomalies for you to explore. From passenger rescue to cargo delivery, missions will adapt to ensure you’re constantly challenged. It is down to you to decide which routes you take through the galaxy. Space is cold, dark and empty. In order to survive you’ll need resources - water, oxygen and fuel for constructing your ships and keeping your crew alive. Whether using drones to harvest, or lasers to drill source materials in order to create a giant mining rig, you’ll need to create a smooth operation if you’re to gain the quantity of materials you need to survive. Use the intuitive ship editor to design, edit and create your starship. Need a new nacelle to house a third FTL drive? No problem. Need to expand your cargo capacity? A few clicks and your design is locked in. Want to share your design with the community? No problem. Unlock the unlimited potential of our community’s imagination with ship sharing via the Steam Workshop. If you can think of it, you can build it, share it and someone else can battle with it…. Take complete control over where to install your weapons. Lasers or rail guns? More armour or more manoeuvrability? Stealth or overwhelming fire-power? The choice is yours. Less Top Gun Maverick, more Hunt for Red October (until things go wrong). The Last Starship’s combat requires strategic thinking and precision strikes. Built the best mining vessel in the galaxy? Great, but where will all the evacuees sleep? Built a kick-ass warship? That’s nice, but how will you feed everyone? As your command grows, so will the requirements to keep everyone alive and you’ll not be able to manage that on one vessel. Expand your fleet and design different ships with unique capabilities if you want to trek the stars forever! The Last Starship is developed and published by Introversion Software. We started with our first game, Uplink in 2001 and have followed up with Darwinia, DEFCON, Multiwinia and Scanner Sombre. Our most popular title, with over four million players is Prison Architect, launched in early access in 2012 we delivered 54 major content upgrades - one each month until the end of 2018 when the game was sold to Paradox Interactive. We intend to bring the same development approach to the Early Access phase of The Last Starship - regular content updates (that will be free) over a number of years. Major inspiration for the game comes from Star Trek, Battlestar Galactica, Factorio and Kerbal Space Program. We never make promises about what we will deliver, but mush those four concepts together and pour them into an Introversion game and we think we’re onto something amazing….",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1857080/header.jpg?t=1676654928",
    "Price": 26.99,
    "Developers": "Introversion Software",
    "Publishers": "Introversion Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1857080/ss_bdcc54d9b967ec8078266f404c034f669defd149.1920x1080.jpg?t=1676654928,https://cdn.akamai.steamstatic.com/steam/apps/1857080/ss_757abe6bdcb6493b6e7a0fc1ce3b6ccdcb2af716.1920x1080.jpg?t=1676654928,https://cdn.akamai.steamstatic.com/steam/apps/1857080/ss_068cfb3723c87b313a6276834a84126799b3032b.1920x1080.jpg?t=1676654928,https://cdn.akamai.steamstatic.com/steam/apps/1857080/ss_7769271d5528afc412553b0e6c2300c8187acc46.1920x1080.jpg?t=1676654928,https://cdn.akamai.steamstatic.com/steam/apps/1857080/ss_6ee5d67974be8f9797ed52b52c8ea506d757729a.1920x1080.jpg?t=1676654928,https://cdn.akamai.steamstatic.com/steam/apps/1857080/ss_7d7cdd7b7d78433ca6ec706f6389189ac7e357d0.1920x1080.jpg?t=1676654928,https://cdn.akamai.steamstatic.com/steam/apps/1857080/ss_103948b9217146cc9698903be73963a632c6ec5b.1920x1080.jpg?t=1676654928,https://cdn.akamai.steamstatic.com/steam/apps/1857080/ss_2489396e9dc35da1e6dc6fccdfb17f667d614d0d.1920x1080.jpg?t=1676654928,https://cdn.akamai.steamstatic.com/steam/apps/1857080/ss_234401be9bd3e4bba2e59de12b3be2fee1ccb9e4.1920x1080.jpg?t=1676654928,https://cdn.akamai.steamstatic.com/steam/apps/1857080/ss_475f47faf5ab98314f0d2b5cda83c7c3fb515a30.1920x1080.jpg?t=1676654928,https://cdn.akamai.steamstatic.com/steam/apps/1857080/ss_58981719a1fea1be99bb81ef7a3dddad475d7153.1920x1080.jpg?t=1676654928",
    "Slug": "the-last-starship",
    "Meta Title": "The Last Starship: Feb 15, 2023, Introversion Software an...",
    "Meta Description": "Looking for information on The Last Starship? Check out the release date (Feb 15, 2023), developer insights from Introversion Software, and a complete g...",
    "Alt Text Image": "Official header image for The Last Starship game - Steam 1857080",
    "Canonical URL": "https://gusku.site/game/the-last-starship",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Last Starship\", \"description\": \"Looking for information on The Last Starship? Check out the release date (Feb 15, 2023), developer insights from Introversion Software, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 15, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Introversion Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Introversion Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1857080/header.jpg?t=1676654928\", \"offers\": {\"@type\": \"Offer\", \"price\": 26.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}