{
    "AppID": 1342080,
    "Name": "The Maiden, the Butler, and the Witch",
    "Release date": "Feb 10, 2023",
    "About the game": "Irina lives a quiet life in her home on Vervain Island with her mother Serinata and their butler Legato, but there comes a time in every witch's life when she must embark on a journey. To fully awaken her powers, Irina must visit the magical springs of the island and bathe in their waters to absorb their powers. This would be little more than a vacation under normal circumstances, but Vervain is overrun by monsters summoned by the Demon Lord, who has taken residence there for some reason! Luckily for her, Legato is a former adventurer, and his company will make the pilgrimage a bit easier... Even so, it will be far from a walk in the park! In classic JRPG style, mow down hordes of monsters with your party of two, Irina and Legato. Find equipment and level them up to grow stronger to face mighty bosses. Travel across the world map to discover new locations and fight to every holy spring to gain access to new elemental spells. Enemies are visible on the map, so you can pick and choose your fights, grinding as much or as little as you wish. Spend precious mana to cast spells or charge your TP to unleash powerful innate abilities. Become the savior of Vervain Island as you complete your pilgrimage to the holy springs and unlock your true potential as a witch! Traditional JRPG Roots Fight through hordes of monsters with a duo of characters, one focused on physical and one on magical damage. Balance their healing, mana, and resources to overcome the many dungeons and bosses of the game quickly. Combat Strategy Resources are limited, but you can take advantage of the enemy's elemental weaknesses to preserve mana and HP. Irina's options will expand as the game continues, unlocking new elements and spells that will annihilate enemies that were once too difficult to tackle but be careful. Suffer too many attacks, and Irina's armor will weaken, lowering her defenses. Keep her gear in good shape to avoid taking too much damage. Packed with Laughs While Legato loves and respects Irina, he can't help being cheeky from time to time... He will see her through this pilgrimage come rain or shine, but that won't stop him from teasing her when the situation calls for it, which is quite often considering her very sheltered life.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1342080/header.jpg?t=1676091613",
    "Price": 13.49,
    "Developers": "PEACH CAT",
    "Publishers": "Kagura Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1342080/ss_21d39a73aafab93a28d7782e5c8055b63db9cb34.1920x1080.jpg?t=1676091613,https://cdn.akamai.steamstatic.com/steam/apps/1342080/ss_c8c489fefc98d804c6f8f20e8824302612191cbf.1920x1080.jpg?t=1676091613,https://cdn.akamai.steamstatic.com/steam/apps/1342080/ss_513125264ec9b870fc37029d03a7fb8c69257953.1920x1080.jpg?t=1676091613,https://cdn.akamai.steamstatic.com/steam/apps/1342080/ss_b7648ff949d48fe0f36087d56b4c0ab71dc766c8.1920x1080.jpg?t=1676091613,https://cdn.akamai.steamstatic.com/steam/apps/1342080/ss_4d7dd63019595156f82d4b2256a34e27c389dc4f.1920x1080.jpg?t=1676091613",
    "Slug": "the-maiden-the-butler-and-the-witch",
    "Meta Title": "The Maiden, the Butler, and the Witch: Feb 10, 2023, PEAC...",
    "Meta Description": "Looking for information on The Maiden, the Butler, and the Witch? Check out the release date (Feb 10, 2023), developer insights from PEACH CAT, and a co...",
    "Alt Text Image": "Official header image for The Maiden, the Butler, and the Witch game - Steam 1342080",
    "Canonical URL": "https://gusku.site/game/the-maiden-the-butler-and-the-witch",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Maiden, the Butler, and the Witch\", \"description\": \"Looking for information on The Maiden, the Butler, and the Witch? Check out the release date (Feb 10, 2023), developer insights from PEACH CAT, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 10, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"PEACH CAT\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kagura Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1342080/header.jpg?t=1676091613\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}