{
    "AppID": 2276060,
    "Name": "Truck Simulator Ultimate 3D",
    "Release date": "Jan 30, 2023",
    "About the game": "Players who experience the legendary American truck game deliver various cargoes. Loads taken from certain areas in the city are taken by truck to where they need to be taken by following the route. It will show you how to go with the arrows on the ground as you move forward with the truck to drop the loads. The truck game and American truck simulator offer breathtaking views and high-level graphics. Truck simulator players, who start their jobs as truck drivers, must perform truck tasks in the city. American truck and car driver simulator players, who reach the target with minor damage, gain experience points. This truck game has four different truck cameras: interior camera, exterior camera, wheel camera, and ball camera. Truck USA and truck car, which reveal the experience of truck transportation in the Americas, offer realistic environments. With its advanced physics simulation, the players appreciate truck and car driving. Truck games and American truck simulator, where simulation and entertainment are presented perfectly, allow you to test your driving skills. The truck simulator, which is focused on driving, works with the gasoline system. Players have to supply gasoline before it runs out. The American truck and car driver simulator, accessible to everyone, allows even the most casual players to enjoy it. Truck USA and truck car, among the most popular simulation games, are increasing their player base daily. It is possible to customize the vehicles in the truck game and the American truck simulator, which have various missions. While packing your cargo, truck driver and truck simulator players have their cars repaired in case of an accident. American truck and car driver simulator, which is appreciated in terms of gameplay mechanics, has a unique audience. Players who like to watch the open highways prefer the truck USA and the truck car. Truck players who start as the freelance driver can customize their vehicles by earning money. The interior of the truck is well designed. Car drive and truck game players who stick to automatic options benefit from extensive missions. American truck simulator and truck driver players who want to customize their truck manage their finances well. In this way, it can make all the important personalizations for the truck. Truck USA and truck car players win prizes after each completed delivery. Truck game and American truck simulator players who drive trucks from one end of the American to the other learn how it feels to drive 12 wheels. Truck driver and truck simulator players who discover great locations gain a real truck experience. Many features are offered, from engine sounds too detailed interiors. American truck and car driver with improved controls are designed to be a realistic simulator. Truck and car drive players can complete their tasks faster without hitting the cars in the traffic. Truck simulator and American truck players traveling around the city from one end to the other become the king of the roads. Car driver simulator and truck USA with realistic graphics give the game a better gaming experience. Truck car players, who experience the adventure they long for, follow the driving rules. Trucks can be driven in the city as well as in any area. It has been designed with all its details for players to spend time in the truck game for a long time.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2276060/header.jpg?t=1675068681",
    "Price": 0.84,
    "Developers": "Yusuf Islam Seyhan,Samet Acar",
    "Publishers": "Inspector Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2276060/ss_8266d4f7a58265cc92cd281211655a4291cd3309.1920x1080.jpg?t=1675068681,https://cdn.akamai.steamstatic.com/steam/apps/2276060/ss_d37e7fe3251cde218f01776816d2af144989f570.1920x1080.jpg?t=1675068681,https://cdn.akamai.steamstatic.com/steam/apps/2276060/ss_f0775b65a40def9b4563deb5bf3762967e1b6669.1920x1080.jpg?t=1675068681,https://cdn.akamai.steamstatic.com/steam/apps/2276060/ss_9cad8754f3d45746f4b4e7fbbae793a6979f4110.1920x1080.jpg?t=1675068681,https://cdn.akamai.steamstatic.com/steam/apps/2276060/ss_2e75c6e8c8ef8300d8cbbfca126c365b6158036e.1920x1080.jpg?t=1675068681,https://cdn.akamai.steamstatic.com/steam/apps/2276060/ss_cec5394a47ff164d923cd2202f8b446bacaaf826.1920x1080.jpg?t=1675068681,https://cdn.akamai.steamstatic.com/steam/apps/2276060/ss_dafc70f61ba636d0585a4ecfc3fa9dbed3fc601e.1920x1080.jpg?t=1675068681",
    "Slug": "truck-simulator-ultimate-3d",
    "Meta Title": "Truck Simulator Ultimate 3D: Jan 30, 2023, Yusuf Islam Se...",
    "Meta Description": "Looking for information on Truck Simulator Ultimate 3D? Check out the release date (Jan 30, 2023), developer insights from Yusuf Islam Seyhan,Samet Acar...",
    "Alt Text Image": "Official header image for Truck Simulator Ultimate 3D game - Steam 2276060",
    "Canonical URL": "https://gusku.site/game/truck-simulator-ultimate-3d",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Truck Simulator Ultimate 3D\", \"description\": \"Looking for information on Truck Simulator Ultimate 3D? Check out the release date (Jan 30, 2023), developer insights from Yusuf Islam Seyhan,Samet Acar...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 30, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Yusuf Islam Seyhan,Samet Acar\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Inspector Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2276060/header.jpg?t=1675068681\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.84, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}