{
    "AppID": 1523040,
    "Name": "VOLLEYGON",
    "Release date": "Feb 17, 2023",
    "About the game": "Dubbed the game of polygon volleyball, VOLLEYGON is a raucous 2-on-2 anti-gravity showdown where geometric shapes flying through space take center stage! Utilize the ceiling and floor to bounce, lob, and smash the ball into your opponent's zone! Just be careful as the ball can change gravity on a whim, and so can your opponents! VOLLEYGON was introduced as an indie arcade cabinet in NYC in 2017 and is making its way to Steam and home consoles in 2023! It's a simple, physics-based game with crisp, energetic visuals that supports up to 4 players and is best suited your next local/couch multiplayer party! The familiar mechanics of volleyball and tennis are the basis for its gameplay, making VOLLEYGON easy to learn but difficult to master: players must jump and strike a ball to clear it over the net into an opponent's zone. If the ball bounces twice a point in a player's zone, a point is scored. To add some spice to the proceedings, the ball will randomly invert its gravity and players must invert their own gravity to follow suit and play along the ceiling of the playfield as well as the floor. Coordinate with your teammate to anticipate and take advantage of the changing gravity to surprise your opponents! Players assume the roles of one of 6 different physics shapes: Circle, Square, Trapezoid, Star or Rectangle, each with their own unique strengths and weaknesses. Games take place across 12 different arenas/playfields, each with unique features players must contend with such as spinning barriers or shifting walls! VOLLEYGON's Multiplayer mode contains options for two vs two, one vs one, as well as a two vs one mode. Not able to meet up with friends yet? No problem, VOLLEYGON contains three unique single player modes: go for the longest rally in Solo Mode, or try the brand new Challenges Mode, earning bronze, silver, and gold medals by proceeding through 10 unique timed challenges. Finally, hone your skills in Vs. AI Mode, where one or two players can challenge one or two devious CPU bots of varying specified difficulty levels to a classic 12-point game of VOLLEYGON! ]Please Note : For local multiplayer, multiple Xbox-style gamepads will be needed to play comfortably. If you would like to use keyboard mapping to configure your own controllers or arcade cabinet, please use the following mappings: Player 1 Down - Q Player 1 Up - W Player 1 Left - A Player 1 Right - S Player 1 Jump - Z Player 1 Change Gravity - X Player 1 Start - 1 Player 2 Down - E Player 2 Up - 5 Player 2 Left - D Player 2 Right - F Player 2 Jump - C Player 2 Change Gravity - V Player 2 Start - 2 Player 3 Down - T Player 3 Up - Y Player 3 Left - G Player 3 Right - H Player 3 Jump - B Player 3 Change Gravity - N Player 3 Start - 3 Player 4 Down - U Player 4 Up - I Player 4 Left - J Player 4 Right - K Player 4 Jump - M Player 4 Change Gravity - , Player 4 Start - 4 Credits: Concept and Development - Nick Santaniello Design - Kevin Davis Development - Walt Mitchell Music - Ghan Patel Special Thanks - Matt Fry Arcade Cabinet - Mark Kleback and Death by Audio Arcade",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1523040/header.jpg?t=1676668502",
    "Price": 6.39,
    "Developers": "ROBYSOFT",
    "Publishers": "ROBYSOFT",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1523040/ss_aec7ec0b188befffe22719f924be57c29b1b90c9.1920x1080.jpg?t=1676668502,https://cdn.akamai.steamstatic.com/steam/apps/1523040/ss_301ae61296dd9105606e2fc2d2c204b184451cd7.1920x1080.jpg?t=1676668502,https://cdn.akamai.steamstatic.com/steam/apps/1523040/ss_641ee6eae2514b77ba3eb491a02e00c18c9e2b57.1920x1080.jpg?t=1676668502,https://cdn.akamai.steamstatic.com/steam/apps/1523040/ss_b5c2addefabf501b9b8d4c34e59e2ea9f0a19353.1920x1080.jpg?t=1676668502,https://cdn.akamai.steamstatic.com/steam/apps/1523040/ss_a2cd93113cae035a2db750b2ba14a4b32fdc33f9.1920x1080.jpg?t=1676668502,https://cdn.akamai.steamstatic.com/steam/apps/1523040/ss_1c313db25ae48d64352c0045d54d3e284a968e7e.1920x1080.jpg?t=1676668502,https://cdn.akamai.steamstatic.com/steam/apps/1523040/ss_7c99a606946f929fd2e5978c9e301b83732f09bb.1920x1080.jpg?t=1676668502,https://cdn.akamai.steamstatic.com/steam/apps/1523040/ss_22c82c2305049944b8023bcc9050b47b87df831e.1920x1080.jpg?t=1676668502,https://cdn.akamai.steamstatic.com/steam/apps/1523040/ss_d55cb59bff9846ce20a188a7b00a9fad69d919be.1920x1080.jpg?t=1676668502,https://cdn.akamai.steamstatic.com/steam/apps/1523040/ss_e357e84913a6ea928916f1a52335c489a94c22ba.1920x1080.jpg?t=1676668502,https://cdn.akamai.steamstatic.com/steam/apps/1523040/ss_b17fab2d0e113ecf41ec2fd1d12e487997442563.1920x1080.jpg?t=1676668502",
    "Slug": "volleygon",
    "Meta Title": "VOLLEYGON: Feb 17, 2023, ROBYSOFT and Full Overview",
    "Meta Description": "Looking for information on VOLLEYGON? Check out the release date (Feb 17, 2023), developer insights from ROBYSOFT, and a complete game summary.",
    "Alt Text Image": "Official header image for VOLLEYGON game - Steam 1523040",
    "Canonical URL": "https://gusku.site/game/volleygon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VOLLEYGON\", \"description\": \"Looking for information on VOLLEYGON? Check out the release date (Feb 17, 2023), developer insights from ROBYSOFT, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 17, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"ROBYSOFT\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ROBYSOFT\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1523040/header.jpg?t=1676668502\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}