{
    "AppID": 2274410,
    "Name": "Weird and Unfortunate Things Are Happening",
    "Release date": "Feb 6, 2023",
    "About the game": "“THERE IS NO NIGHTMARE IN DAYBREAK. THE CITY IS ABSOLUTELY FINE. PLEASE FORGET THAT IT EVER EXISTED.” Weird and unfortunate things are happening in the city of Daybreak. To the rest of the world, the city seems to have simply vanished, but inside, it has become a playground for mysterious beings who see humans only as hosts for their own amusement. Alicia’s a bit strange. She still likes to wear her old baseball jersey, even though her team disbanded over a year ago. She can see otherworldly creatures that no one else seems to notice. She also has weird powers that she keeps hidden from the rest of the world. But when she receives a call for help from her niece in Daybreak, she’ll do anything to save her. Caught up in the struggle along with Alicia are Miriam, a secretary and gun aficionado who only wants to escape the city, Lamar, an overworked middle school English teacher, and Dottie, Alicia’s niece, who has been captured for some nefarious purpose. Explore what’s left of the ravaged city and find your way through surreal otherworldly areas that connect the broken urban shell. Encounter any other citizens who have survived and make contact with the strange entities that now inhabit this realm. Survive. Or be swallowed up by the city and forgotten forever. Turn-based RPG with a survival edge - scrounge the ruined city for restorative items, money, obols (special currency used to buy skills) and rare collectors items to sell for cash! Exploration is always rewarded with new items, equipment, and secrets around every turn! Meet a wide variety of characters, human and otherwise. Allies, survivors, and power-mad villains await! Enjoy tactical battles where fighting wisely will allow you to decimate foes! Strategize your attacks against the eight different types of foe, and figure out the mysterious Unknowns, whose strengths and weaknesses are hidden from you! Customize your characters' battle style with over fifty unique active and passive skills in the Skill Space. There's much more to this world than meets the eye. Find hidden corridors between realities, puzzle through eldritch languages, and collect bizarre curios to help unravel Daybreak's mysteries. Four difficulty levels allow you to adjust the game to your liking, even in the midst of play! From a walk in the park to a deadly journey through hell, play the way you enjoy the most. Estimated playtime is 15-20 hours. Warnings : Game contains flashing lights and swearing.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2274410/header.jpg?t=1675689158",
    "Price": 0.0,
    "Developers": "Sapphire Dream Games",
    "Publishers": "Sapphire Dream Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2274410/ss_4f7bb5f6b2c550b5ad3fa1f4adb75020a31690cf.1920x1080.jpg?t=1675689158,https://cdn.akamai.steamstatic.com/steam/apps/2274410/ss_21861b54dde15e714048eca5c7aa16cfb269ac1a.1920x1080.jpg?t=1675689158,https://cdn.akamai.steamstatic.com/steam/apps/2274410/ss_1d6950bfd409167dd32de9d31342ecec3b2d6372.1920x1080.jpg?t=1675689158,https://cdn.akamai.steamstatic.com/steam/apps/2274410/ss_e486cf3446d9812952a5686db9f8f8b2723973a7.1920x1080.jpg?t=1675689158,https://cdn.akamai.steamstatic.com/steam/apps/2274410/ss_2467053669495c7738308bdaf57f281fa2b86fa9.1920x1080.jpg?t=1675689158",
    "Slug": "weird-and-unfortunate-things-are-happening",
    "Meta Title": "Weird and Unfortunate Things Are Happening: Feb 6, 2023, ...",
    "Meta Description": "Looking for information on Weird and Unfortunate Things Are Happening? Check out the release date (Feb 6, 2023), developer insights from Sapphire Dream ...",
    "Alt Text Image": "Official header image for Weird and Unfortunate Things Are Happening game - Steam 2274410",
    "Canonical URL": "https://gusku.site/game/weird-and-unfortunate-things-are-happening",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Weird and Unfortunate Things Are Happening\", \"description\": \"Looking for information on Weird and Unfortunate Things Are Happening? Check out the release date (Feb 6, 2023), developer insights from Sapphire Dream ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 6, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sapphire Dream Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sapphire Dream Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2274410/header.jpg?t=1675689158\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}