{
    "AppID": 2175210,
    "Name": "Winter Survival: Prologue",
    "Release date": "Feb 15, 2023",
    "About the game": "/ Winter Survival’s Prologue sets the stage for a survival experience around Mount Washington before the events of the Winter Survival game. Learn more about the friends you set out on the journey with and see what happens before things turn dire. THE ADVENTURE Get to know Joel while you are both looking for Mike who went missing just when you stated your long weekend into the mountains. Experience what happened before you all set off on the trip and before the events of the full game take place. Learn details and background information about the planned trip and its challenges while helping Joel to look for Mike. And then in the later part of the prologue see how the events unfold and get your first taste of survival. THE GAMEPLAY Winter Survival: Prologue is a mix of story driven and fully narrated content with stretches of free roaming to experience the gathering, scavenging, hunting and taking care of your equipment to ensure your survival. Stealth and cunning are important parts of the experience and crucial in exploring the surrounding areas. Harsh and changing weather conditions will influence many of the aspects of your gameplay. THE SANITY SYSTEM The prologue will also cover the game’s sanity system giving you a better idea what this is about compared to the game’s demo. While Winter Survival brings some unique features to the survival genre, its Sanity System is likely the most dominant one. In reality, your mind becomes a problem way sooner than starvation. It starts with fatigue symptoms, loosing your will to continue the struggle up to imagining things and even full blown hallucinations. This makes for a really interesting experience and changes how you experience survival. THE SURVIVAL The prologue features the same winter survival mechanics as the actual game. Hunger, thirst, sleep, exhausting and cold are the major factors in your survival in the harsh winter climate. Our sanity system adds a new layer on top of these to simulate how harsh conditions affect your mind and introduce interesting twists to the survival formula. THE WILDLIFE Wildlife is not only important for your survival by hunting but also a major obstacle. Predators such as wolfs or the occasional bear can become extremely dangerous, especially considering the fact that you don’t have weapons. Avoiding, distracting, sneaking and acting quick are the tools at your disposal. Sure, a torch might help you keep the occasional wolf at bay, but like in real life you don’t really stand a chance against large predators with a knife in your hand.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2175210/header.jpg?t=1676484026",
    "Price": 0.0,
    "Developers": "DRAGO entertainment",
    "Publishers": "DRAGO entertainment,HeartBeat Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2175210/ss_60eaaa55d34e0a3aa74882249400f6d53a724edb.1920x1080.jpg?t=1676484026,https://cdn.akamai.steamstatic.com/steam/apps/2175210/ss_fbb22b97300e4108dfd7194e503461ea14919ad7.1920x1080.jpg?t=1676484026,https://cdn.akamai.steamstatic.com/steam/apps/2175210/ss_cb7ea8b3ff49f6041344635d382cb494f925dcf7.1920x1080.jpg?t=1676484026,https://cdn.akamai.steamstatic.com/steam/apps/2175210/ss_3343f0478b99cafc7d77cdb3d3d739eef9e7b66d.1920x1080.jpg?t=1676484026,https://cdn.akamai.steamstatic.com/steam/apps/2175210/ss_e318fcb779ce43ad6d91bdda66af2f4e910542aa.1920x1080.jpg?t=1676484026,https://cdn.akamai.steamstatic.com/steam/apps/2175210/ss_bc47d24e1b51b5f295a1e934966d108ad971b15f.1920x1080.jpg?t=1676484026,https://cdn.akamai.steamstatic.com/steam/apps/2175210/ss_493a99f3a1a7d7d597f131044ab86c9daa320eec.1920x1080.jpg?t=1676484026,https://cdn.akamai.steamstatic.com/steam/apps/2175210/ss_8e31aafa40af003cf814512c07a4d5795791bd49.1920x1080.jpg?t=1676484026,https://cdn.akamai.steamstatic.com/steam/apps/2175210/ss_5557816463a428888129e948a0ea8e9d0fe1eac9.1920x1080.jpg?t=1676484026",
    "Slug": "winter-survival-prologue",
    "Meta Title": "Winter Survival: Prologue: Feb 15, 2023, DRAGO entertainm...",
    "Meta Description": "Looking for information on Winter Survival: Prologue? Check out the release date (Feb 15, 2023), developer insights from DRAGO entertainment, and a comp...",
    "Alt Text Image": "Official header image for Winter Survival: Prologue game - Steam 2175210",
    "Canonical URL": "https://gusku.site/game/winter-survival-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Winter Survival: Prologue\", \"description\": \"Looking for information on Winter Survival: Prologue? Check out the release date (Feb 15, 2023), developer insights from DRAGO entertainment, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 15, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"DRAGO entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DRAGO entertainment,HeartBeat Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2175210/header.jpg?t=1676484026\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}