{
    "AppID": 2282630,
    "Name": "World Annihilation Operations Parts I-IV",
    "Release date": "Feb 14, 2023",
    "About the game": "Short summary: World Annihilation Operations Parts I-IV is a set of 4 short experimental games examining the impact of audiovisual and narrative contradictions within fictional worlds. Each game showcases a vastly different world with various mechanics, and is the result of a research-based creative process meant to discover technical operations, inspired in each case by a unique act of creation and able to generate contradictions/impossible figures within initially logically 'possible' worlds. Some overall primary features: Four unique experiences around 12-20 minutes each. Varied, dynamic and often unexpected audiovisual effects. A progression in ways of approaching contradictions and impossible figures in games, from an observational stance to a linear exploration format with light puzzles, a narrative approach, and an engaged discourse. A timing system for speed-running Parts II-III-IV (see related achievements). In-depth description: Part I: Fly freely through a 3-D scene of a strange city in the middle of the desert, while various audiovisual events occur. Audiovisual contradictions/instabilities appear in a predetermined and timed order, inspired by the idea of propagation (propagating light, shadows, objects, camera views, etc.). Part II: Experience a short and abstract adventure through a profoundly unstable world, with a few spatial puzzles. Contradictions may emerge from various elements in the fiction suddenly switching their nature. Part III: Save the world from a demon who has taken a liking to mixing realities together in this short exploration game. Impossible figures may emerge from the superposition of unexpected elements within the fictional world. Part IV: Experience a metaphorical rendition of the life of an unknown creature attempting to escape its fate in the food industry. Through the means of lies , fictional contradictions are created and used to represent contradictions perceivable in the real world between popular beliefs and real events. This compilation of games is done in the context of a PhD research on the integration of logical contradictions in video game fiction. It is expected that at least one more compilation of similar experiments emerges from this research. Following the publication of these works, the operations developed through the creation process should lead to the development of one much larger adventure game in the coming years. This set of games is entirely free. If you would like to support the developer, please consider purchasing one of the DLCs (they do not add any content within the game!).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2282630/header.jpg?t=1676476369",
    "Price": 0.0,
    "Developers": "Jesse Aidyn",
    "Publishers": "Jesse Aidyn",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2282630/ss_2d323fb3992560a7ac7a04c8c8da23f65406668c.1920x1080.jpg?t=1676476369,https://cdn.akamai.steamstatic.com/steam/apps/2282630/ss_2a1818cba8b449ad9734d6f9bfd5eb2c93e55521.1920x1080.jpg?t=1676476369,https://cdn.akamai.steamstatic.com/steam/apps/2282630/ss_174c569444ac9e9c6ac4251c87f3a7322555d0cb.1920x1080.jpg?t=1676476369,https://cdn.akamai.steamstatic.com/steam/apps/2282630/ss_34163847062d75048b8e5f68f5947a3e94b4cb0b.1920x1080.jpg?t=1676476369,https://cdn.akamai.steamstatic.com/steam/apps/2282630/ss_79c3bc7e58f8efb83234332bba1fcdb64ac61d8d.1920x1080.jpg?t=1676476369,https://cdn.akamai.steamstatic.com/steam/apps/2282630/ss_14a0c0dfac7e460a3a1be57a2fbcaac70b018ca7.1920x1080.jpg?t=1676476369",
    "Slug": "world-annihilation-operations-parts-i-iv",
    "Meta Title": "World Annihilation Operations Parts I-IV: Feb 14, 2023, J...",
    "Meta Description": "Looking for information on World Annihilation Operations Parts I-IV? Check out the release date (Feb 14, 2023), developer insights from Jesse Aidyn, and...",
    "Alt Text Image": "Official header image for World Annihilation Operations Parts I-IV game - Steam 2282630",
    "Canonical URL": "https://gusku.site/game/world-annihilation-operations-parts-i-iv",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"World Annihilation Operations Parts I-IV\", \"description\": \"Looking for information on World Annihilation Operations Parts I-IV? Check out the release date (Feb 14, 2023), developer insights from Jesse Aidyn, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 14, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jesse Aidyn\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jesse Aidyn\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2282630/header.jpg?t=1676476369\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}