{
    "AppID": 2107860,
    "Name": "Yggdra Union",
    "Release date": "Feb 6, 2023",
    "About the game": "'Yggdra Union' released in 2006 It has evolved with each release on various platforms, and finally appears on STEAM! ! Adjust the operation method and functions according to the PC! Added new features for the PC version! ! [Game contents] ■ Story The Kingdom of Fantasinia is ruled by a royal family that inherited the blood of the gods who built up a stable era. However, the Kingdom of Fantasinia fell under the attack of the Empire of Bronquia. Meanwhile, Yggdra, a lone girl who escaped With her kingdom's last hope in hand, head to the remotest land on the southern tip of the continent. She arrives and meets a boy, the king of thieves, Milanor. The battle to liberate Yggdra's homeland begins with that encounter... ■Collaborate with allies! 'Union system!' A battle system that allows up to 5 people to participate in battle at once depending on the character's position! Let's fight together with allies to defeat the powerful enemy! ■One-shot reversal tactics card! Use the power of cards with special moves to defeat your enemies! Skillfully use various effects and face difficulties! ! 《Added content in the ported version》 [Porting additional function] Added a rewind function (you can undo your actions as much as you like) Added auto save function (Even if you quit midway, you can start from your favorite turn) Added conversation log function Added item hints to EXTRA content (Hints are given on which stage the item is on) Addition of battle speed adjustment function (you can play at up to 5 times speed from the beginning) The unit [Flunky] will participate under certain conditions! (What if Flunky achieved results in the first stage...?) Sound set function! (You can play by choosing from 3 types of sound sources) [Trick function] A function that makes Milanor look like Cruz (Milanor will play an active role as a hunter) Enemy/Allies no critical function Skill gauge MAX at the start of battle (skill gauge starts at MAX state only for own army) Formation type reversal function (Male and female formation types are reversed) The trick function is to press a specific button appear. The appearance method is described in the manual. 《PC Version New Features (Additions and Changes)》 Japanese voice / English voice can be switched (easy to switch at any time during the event) Addition of free save (You can now save freely during battle) Infinite use of items in EASY mode (Items can now be used indefinitely only in EASY mode) Equipment removal (equipment can now be removed in the middle) Adjustment of Itmbreak (weapon does not break with Itembreak and is unusable) Completely compatible with in-game mouse/keyboard/controller You can adjust the layout of the keyboard buttons.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2107860/header.jpg?t=1675731763",
    "Price": 19.99,
    "Developers": "Sting",
    "Publishers": "Sting",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2107860/ss_35aaaef26efe6c4371664522ed8aa7f9e6f97080.1920x1080.jpg?t=1675731763,https://cdn.akamai.steamstatic.com/steam/apps/2107860/ss_7eae10d407bb07a08a3421b69dfd3c16cb3485bb.1920x1080.jpg?t=1675731763,https://cdn.akamai.steamstatic.com/steam/apps/2107860/ss_99ae834c3f710f1e774ba29698d55196c3eeb855.1920x1080.jpg?t=1675731763,https://cdn.akamai.steamstatic.com/steam/apps/2107860/ss_5e4434731c4a4ecb46fad2368027e216ad385764.1920x1080.jpg?t=1675731763,https://cdn.akamai.steamstatic.com/steam/apps/2107860/ss_d70ab56e45e0fd8cec320918a057fee3068b8611.1920x1080.jpg?t=1675731763,https://cdn.akamai.steamstatic.com/steam/apps/2107860/ss_edf65bbe5019cc1953c0d64dffe0648ba04cd18d.1920x1080.jpg?t=1675731763",
    "Slug": "yggdra-union",
    "Meta Title": "Yggdra Union: Feb 6, 2023, Sting and Full Overview",
    "Meta Description": "Looking for information on Yggdra Union? Check out the release date (Feb 6, 2023), developer insights from Sting, and a complete game summary.",
    "Alt Text Image": "Official header image for Yggdra Union game - Steam 2107860",
    "Canonical URL": "https://gusku.site/game/yggdra-union",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Yggdra Union\", \"description\": \"Looking for information on Yggdra Union? Check out the release date (Feb 6, 2023), developer insights from Sting, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 6, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sting\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sting\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2107860/header.jpg?t=1675731763\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}