{
    "AppID": 1868540,
    "Name": "Zenteni",
    "Release date": "Jan 31, 2023",
    "About the game": "Cut through wild forest, dig through stone to build your kingdom. Lay roads, construct towers and build castles. Recruit an army to conquer lands. Discover new heroes. Find scrolls and craft equipment. What is this game? This game was developed by one person. I spend around three thousands hours after my normal job in six years to make it and deliver it to you. My main purpose was to make a fun strategy. Some features were inspired by games created in '90s: Castles and armies Towers that conquers terrain Production chains Some features I invented myself to make this game original: Features are uncovered by completing the stained glass window, so you will see only very small fraction of features at the beginning and even after you complete the story they may still be some main features that you don't know. Token battle (inspired by Go game) Masks that influences terraforming monsters An game engine that can speed up game even 2 thousands times depending on your PC What is this game NOT? A perfect product - I spend only around 300 hours on testing this game, but if you found a bug please report it in steam discussions and I will try to fix it as soon as possible. A game with w lot of animations - don't expect an AAA game. I made it for people that are looking for something original, not for players that expect only graphic from games. A game with flawless progress - this game is sometimes grindy, and you may find maps and quests repetitive. A game with low entry threshold - my retired mother was able to play this game without any help, but she is patient and intelligent. You may want to skip this title if you frustrate quickly when you don't understand something. A game with unique graphic - it contains packages of images that you might have seen. A game with unique music - it contains packages of music/sounds that you might have heard. A tower defence game or an economy game. It has only simplified elements of these game types. Key features: Be settler. Build your kingdom with help of your heroes. Discover and build more than 40 building types. Defend your territory against free monsters. Build walls, towers, temples. Fill the stained glass window. Unlocked fragments will enable new features. Avoid conquering specific altars to not make free monsters angry, sad, determined, enjoyed, pride, disgust, surprise or scary. Heroes can be improved with puzzles and equipments. You can make them walk faster, farm better, lead bigger armies and many more. You are majesty, so heores do work for you on their own. You can optimise their choices by prioriterizing jobs and resources. When a hero is no longer useful for you send him to university. When you will conquer new lands or idle wait, he will become archeologist and he will look for treasures for you. Discover fifteen pages comics with the dethroned queen story. Build a castle, recruit monsters and defeat enemy's armies that occupy land. Complete quests and collect rewards. Craft equipment for your heroes. Use 5 different castles, 60 heroes, 40 monsters, 260+ equipment pieces.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1868540/header.jpg?t=1675227696",
    "Price": 17.99,
    "Developers": "Miron Iceshine",
    "Publishers": "Miron Iceshine",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1868540/ss_c1dc9ce449b2d4653f697ca396bd27b2a7953dc9.1920x1080.jpg?t=1675227696,https://cdn.akamai.steamstatic.com/steam/apps/1868540/ss_7bbacff308a9bf6a6694cdef0d53db1d54108239.1920x1080.jpg?t=1675227696,https://cdn.akamai.steamstatic.com/steam/apps/1868540/ss_4a830871566456d30fbfffc7d44c21a0292cf0c2.1920x1080.jpg?t=1675227696,https://cdn.akamai.steamstatic.com/steam/apps/1868540/ss_866635ecae2653cc2d996b3003b5ea4c99f02371.1920x1080.jpg?t=1675227696,https://cdn.akamai.steamstatic.com/steam/apps/1868540/ss_97f488fd017be0bab928af8af525c9e8fde95b93.1920x1080.jpg?t=1675227696,https://cdn.akamai.steamstatic.com/steam/apps/1868540/ss_dbf227ac7968c3ed051db29310f59ce61fc46dec.1920x1080.jpg?t=1675227696,https://cdn.akamai.steamstatic.com/steam/apps/1868540/ss_6417a3a73347af7acafe7300929a3d7cd085a114.1920x1080.jpg?t=1675227696,https://cdn.akamai.steamstatic.com/steam/apps/1868540/ss_1645da87e51c609aa596d2362f188761d38cff51.1920x1080.jpg?t=1675227696",
    "Slug": "zenteni",
    "Meta Title": "Zenteni: Jan 31, 2023, Miron Iceshine and Full Overview",
    "Meta Description": "Looking for information on Zenteni? Check out the release date (Jan 31, 2023), developer insights from Miron Iceshine, and a complete game summary.",
    "Alt Text Image": "Official header image for Zenteni game - Steam 1868540",
    "Canonical URL": "https://gusku.site/game/zenteni",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zenteni\", \"description\": \"Looking for information on Zenteni? Check out the release date (Jan 31, 2023), developer insights from Miron Iceshine, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2023\", \"author\": {\"@type\": \"Organization\", \"name\": \"Miron Iceshine\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Miron Iceshine\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1868540/header.jpg?t=1675227696\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}